{"id": "http://arxiv.org/abs/hep-th/0004187v2", "guidislink": true, "updated": "2000-05-08T15:47:44Z", "updated_parsed": [2000, 5, 8, 15, 47, 44, 0, 129, 0], "published": "2000-04-27T14:20:23Z", "published_parsed": [2000, 4, 27, 14, 20, 23, 3, 118, 0], "title": "D3-brane Holography", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-th%2F0004032%2Chep-th%2F0004019%2Chep-th%2F0004140%2Chep-th%2F0004159%2Chep-th%2F0004070%2Chep-th%2F0004133%2Chep-th%2F0004012%2Chep-th%2F0004154%2Chep-th%2F0004135%2Chep-th%2F0004162%2Chep-th%2F0004006%2Chep-th%2F0004023%2Chep-th%2F0004134%2Chep-th%2F0004060%2Chep-th%2F0004013%2Chep-th%2F0004026%2Chep-th%2F0004043%2Chep-th%2F0004076%2Chep-th%2F0004062%2Chep-th%2F0004039%2Chep-th%2F0004088%2Chep-th%2F0004016%2Chep-th%2F0004130%2Chep-th%2F0004175%2Chep-th%2F0004194%2Chep-th%2F0004092%2Chep-th%2F0004059%2Chep-th%2F0004087%2Chep-th%2F0004147%2Chep-th%2F0004021%2Chep-th%2F0004116%2Chep-th%2F0004068%2Chep-th%2F0004040%2Chep-th%2F0004160%2Chep-th%2F0004071%2Chep-th%2F0004129%2Chep-th%2F0004168%2Chep-th%2F0004190%2Chep-th%2F0004142%2Chep-th%2F0004028%2Chep-th%2F0004002%2Chep-th%2F0004052%2Chep-th%2F0004155%2Chep-th%2F0004084%2Chep-th%2F0004031%2Chep-th%2F0004097%2Chep-th%2F0004114%2Chep-th%2F0004099%2Chep-th%2F0004101%2Chep-th%2F0004150%2Chep-th%2F0004015%2Chep-th%2F0004184%2Chep-th%2F0004056%2Chep-th%2F0004195%2Chep-th%2F0004090%2Chep-th%2F0004110%2Chep-th%2F0004025%2Chep-th%2F0004187%2Chep-th%2F0004181%2Chep-th%2F0004199%2Chep-th%2F0004131%2Chep-th%2F0004141%2Chep-th%2F0004067%2Chep-th%2F0004108%2Chep-th%2F0004205%2Chep-th%2F0004105%2Chep-th%2F0004200%2Chep-th%2F0004038%2Chep-th%2F0004204%2Chep-th%2F0004094%2Chep-th%2F0004169%2Chep-th%2F0004003%2Chep-th%2F0004085%2Chep-th%2F0004183%2Chep-th%2F0004123%2Chep-th%2F0004041%2Chep-th%2F0004029%2Chep-th%2F0004128%2Chep-th%2F0004111%2Chep-th%2F0004136%2Chep-th%2F0004180%2Chep-th%2F0004014%2Chep-th%2F0004148%2Chep-th%2F0004203%2Chep-th%2F0004102%2Chep-th%2F0004007%2Chep-th%2F0004173%2Chep-th%2F0004188%2Chep-th%2F0004001%2Chep-th%2F0004151%2Chep-th%2F0004191%2Chep-th%2F0004137%2Chep-th%2F0004109%2Chep-th%2F0004193%2Chep-th%2F0004103%2Chep-th%2F0004044%2Chep-th%2F0004093%2Chep-th%2F0004122%2Chep-th%2F0004192%2Chep-th%2F0004027%2Chep-th%2F0004161&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "D3-brane Holography"}, "summary": "It has recently been conjectured that the AdS_5/SYM_4 correspondence can be\ngeneralized away from the conformal limit, to a duality between supergravity on\nthe full asymptotically flat three-brane background and a theory characterized\nas N=4 SYM deformed in the IR by a specific dimension-eight operator. Assuming\nthat this relation is valid, we derive a prescription for computing n-point\ncorrelation functions in the holographic theory, which reduces to the standard\nAdS/CFT recipe at low energies. One- and two-point functions are discussed in\ndetail. The prescription follows from very simple considerations and appears to\nbe applicable to any asymptotically flat background. We also compute the\nquark-antiquark potential and comment on the description of the baryon in the\nsupergravity picture. We conclude with some comments on the possible relation\nbetween our work and recent results in non-commutative field theories.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-th%2F0004032%2Chep-th%2F0004019%2Chep-th%2F0004140%2Chep-th%2F0004159%2Chep-th%2F0004070%2Chep-th%2F0004133%2Chep-th%2F0004012%2Chep-th%2F0004154%2Chep-th%2F0004135%2Chep-th%2F0004162%2Chep-th%2F0004006%2Chep-th%2F0004023%2Chep-th%2F0004134%2Chep-th%2F0004060%2Chep-th%2F0004013%2Chep-th%2F0004026%2Chep-th%2F0004043%2Chep-th%2F0004076%2Chep-th%2F0004062%2Chep-th%2F0004039%2Chep-th%2F0004088%2Chep-th%2F0004016%2Chep-th%2F0004130%2Chep-th%2F0004175%2Chep-th%2F0004194%2Chep-th%2F0004092%2Chep-th%2F0004059%2Chep-th%2F0004087%2Chep-th%2F0004147%2Chep-th%2F0004021%2Chep-th%2F0004116%2Chep-th%2F0004068%2Chep-th%2F0004040%2Chep-th%2F0004160%2Chep-th%2F0004071%2Chep-th%2F0004129%2Chep-th%2F0004168%2Chep-th%2F0004190%2Chep-th%2F0004142%2Chep-th%2F0004028%2Chep-th%2F0004002%2Chep-th%2F0004052%2Chep-th%2F0004155%2Chep-th%2F0004084%2Chep-th%2F0004031%2Chep-th%2F0004097%2Chep-th%2F0004114%2Chep-th%2F0004099%2Chep-th%2F0004101%2Chep-th%2F0004150%2Chep-th%2F0004015%2Chep-th%2F0004184%2Chep-th%2F0004056%2Chep-th%2F0004195%2Chep-th%2F0004090%2Chep-th%2F0004110%2Chep-th%2F0004025%2Chep-th%2F0004187%2Chep-th%2F0004181%2Chep-th%2F0004199%2Chep-th%2F0004131%2Chep-th%2F0004141%2Chep-th%2F0004067%2Chep-th%2F0004108%2Chep-th%2F0004205%2Chep-th%2F0004105%2Chep-th%2F0004200%2Chep-th%2F0004038%2Chep-th%2F0004204%2Chep-th%2F0004094%2Chep-th%2F0004169%2Chep-th%2F0004003%2Chep-th%2F0004085%2Chep-th%2F0004183%2Chep-th%2F0004123%2Chep-th%2F0004041%2Chep-th%2F0004029%2Chep-th%2F0004128%2Chep-th%2F0004111%2Chep-th%2F0004136%2Chep-th%2F0004180%2Chep-th%2F0004014%2Chep-th%2F0004148%2Chep-th%2F0004203%2Chep-th%2F0004102%2Chep-th%2F0004007%2Chep-th%2F0004173%2Chep-th%2F0004188%2Chep-th%2F0004001%2Chep-th%2F0004151%2Chep-th%2F0004191%2Chep-th%2F0004137%2Chep-th%2F0004109%2Chep-th%2F0004193%2Chep-th%2F0004103%2Chep-th%2F0004044%2Chep-th%2F0004093%2Chep-th%2F0004122%2Chep-th%2F0004192%2Chep-th%2F0004027%2Chep-th%2F0004161&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "It has recently been conjectured that the AdS_5/SYM_4 correspondence can be\ngeneralized away from the conformal limit, to a duality between supergravity on\nthe full asymptotically flat three-brane background and a theory characterized\nas N=4 SYM deformed in the IR by a specific dimension-eight operator. Assuming\nthat this relation is valid, we derive a prescription for computing n-point\ncorrelation functions in the holographic theory, which reduces to the standard\nAdS/CFT recipe at low energies. One- and two-point functions are discussed in\ndetail. The prescription follows from very simple considerations and appears to\nbe applicable to any asymptotically flat background. We also compute the\nquark-antiquark potential and comment on the description of the baryon in the\nsupergravity picture. We conclude with some comments on the possible relation\nbetween our work and recent results in non-commutative field theories."}, "authors": ["Ulf H. Danielsson", "Alberto Guijosa", "Martin Kruczenski", "Bo Sundborg"], "author_detail": {"name": "Bo Sundborg"}, "author": "Bo Sundborg", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/1126-6708/2000/05/028", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/hep-th/0004187v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-th/0004187v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "LaTeX 2e, 45+1 pages, 7 eps figures; v2: references added, typos\n  corrected", "arxiv_primary_category": {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-th/0004187v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-th/0004187v2", "journal_reference": "JHEP 0005:028,2000", "doi": "10.1088/1126-6708/2000/05/028", "fulltext": "UUITP-02/00\nUSITP-00-05\nhep-th/0004187\n\narXiv:hep-th/0004187v2 8 May 2000\n\nD3-brane Holography\nUlf H. Danielsson,1 Alberto Güijosa,2\nMartı́n Kruczenski,1 and Bo Sundborg2\n1\n2\n\nInstitutionen för Teoretisk Fysik, Box 803, SE-751 08 Uppsala, Sweden\n\nInstitute of Theoretical Physics, Box 6730, SE-113 85 Stockholm, Sweden\nulf@teorfys.uu.se, alberto@physto.se,\nmartink@teorfys.uu.se, bo@physto.se\n\nAbstract\nIt has recently been conjectured that the AdS5 /SYM4 correspondence can be generalized away from the conformal limit, to a duality between supergravity on the full\nasymptotically flat three-brane background and a theory characterized as N = 4 SYM\ndeformed in the IR by a specific dimension-eight operator. Assuming that this relation\nis valid, we derive a prescription for computing n-point correlation functions in the\nholographic theory, which reduces to the standard AdS/CFT recipe at low energies.\nOne- and two-point functions are discussed in detail. The prescription follows from\nvery simple considerations and appears to be applicable to any asymptotically flat\nbackground. We also compute the quark-antiquark potential and comment on the description of the baryon in the supergravity picture. We conclude with some comments\non the possible relation between our work and recent results in non-commutative field\ntheories.\n\nApril 2000\n\n\f1\n\nIntroduction\n\nThe path that led to the discovery of the AdS/CFT correspondence1 [1, 2, 3] began\nwith the realization that the physics of D-branes can be captured from two quite\ndistinct perspectives: as extended objects in supergravity, or as localized objects with\nintrinsic worldvolume dynamics [5]. Over the years, an enormous body of evidence\nhas accumulated in support of this insight. In the particular case of D3-branes,\nthe works [6, 7, 8, 9] performed a variety of comparisons between quantities in the\ntwo alternative descriptions, and constituted very important steps on our way to\nunraveling the precise relation between the two approaches. It was from these works\nthat Maldacena [1] was able to distill his statement of equivalence between the extreme\nlow-energy limit of the worldvolume dynamics (governed by N = 4 SYM in four\ndimensions) and type IIB string theory in the near-horizon region of the three-brane\nsupergravity solution (i.e., AdS5 × S5 ).\nMore recently, the authors of [10, 11, 12] have attempted to take another step\nalong this path, by exploring the possibility of elevating the AdS/CFT correspondence to a duality between type IIB string theory defined on the full asymptotically\nflat three-brane background, and the effective theory describing the low-energy worldvolume dynamics of D3-branes at strong 't Hooft coupling. The latter theory has been\ncharacterized in [11, 12] as an IR deformation of the N = 4 fixed point by a specific\ndimension-eight operator. To directly examine this non-renormalizable gauge theory\nwould constitute an enormously difficult challenge. In this paper, we pursue a different line of attack. We assume that there exists a holographic image of physics on\nthe D3 background, even if its precise form may be unknown to us. By definition, all\ninformation about this holographic dual is encoded in the bulk supergravity theory,\nsince the duality mapping must work in both directions. Our approach will thus\nbe to study the duality by developing a calculational procedure that extracts this\ninformation from the bulk theory.\nThe paper is structured as follows. In the next section we give a more detailed\naccount of the proposal of [10, 11, 12], and delineate our approach. In Section 3 we\nderive a prescription for computing two-point correlators, using as a concrete example\nthe operators that couple to dilaton partial waves. Section 4 contains a discussion\nof the two-point function we obtain, demonstrating that it reduces to the known\nN = 4 SYM result at low energies, and establishing its relation with the supergravity\nabsorption probability. The result differs in some aspects from the one discussed\nby previous authors [10, 11]. In Section 5 we calculate a one-point function in the\npresence of an external source, and use it to discuss the UV/IR relation, encountering\nsome interesting features. The prescription is then generalized to arbitrary n-point\nfunctions in Section 6. Sections 7 and 8 are respectively devoted to a calculation of the\nquark-antiquark potential and the description of baryons as D5-branes. A final section\npresents our conclusions, and includes some comments on the close parallel between\ncertain aspects of our results and recent work in non-commutative field theories.\n1\n\nSee [4] for a comprehensive review and an extensive list of references.\n\n1\n\n\f2\n\nThe Physics of D3-branes\n\nIn this section we will carefully examine the regimes of applicability of the two alternative descriptions of a system of D3-branes, and review the proposal of [10, 11, 12]\nfor generalizing the AdS/CFT correspondence [1] to a duality involving the full D3brane background. We should emphasize from the outset that, although our work was\nmotivated by the existence of this relatively concrete duality conjecture, the route we\nchoose to follow does not explicitly rely on its specific form. We will simply assume\nthere exists some brane theory dual to supergravity on the three-brane background,\nand proceed in Sections 3 and onward to derive rules for computing quantities in the\ndual theory in terms of physics on the curved background.\n\n2.1\n\nDual descriptions of D3-branes\n\nConsider a collection of a large number, N, of D3-branes in Type IIB string theory. On\nthe one hand, the physics of this system can be described in terms of a worldvolume\ntheory coupled to string theory in the bulk of flat ten-dimensional spacetime. For\nprocesses with substringy energies, ω ≪ ms , only the lowest modes of the D3-branes\nand the closed strings can be excited, and the description is in terms of a non-Abelian\ngauge theory coupled to supergravity. The action for the combined system is then\nS = SS [φ, h, . . .] + SD3 [A, Φ, . . . ; φ, h . . .] ,\n\n(1)\n\nwhere the two terms denote the Type IIB supergravity action in a flat background\nand the D3-brane action, respectively. The degrees of freedom on the branes include\na gauge field Aμab , six scalars Φiab (a, b = 1, . . . , N; μ = 0, . . . , 3; i = 4, . . . , 9), and\ntheir fermionic superpartners. For discussion purposes it is convenient to split the D3brane action2 into two terms, SD3 = Sb [A, Φ, . . .] + Sint [A, Φ, . . . ; φ, h, . . .], describing\nthe dynamics on the brane and the couplings to the supergravity fields, respectively.\nThe brane action Sb includes in particular contributions from the Born-Infeld term,\nwhich are schematically of the form\nSb = −N\n\nZ\n\nn\n\nd4 x Tr F 2 + R4 F 4 + . . .\n\no\n\n.\n\n(2)\n\nNote that the gauge field A, as well as the scalars Φ (not shown explicitly), have been\n't Hooft-normalized. This is the normalization which is most convenient in studying\nthe large N limit.\nOn the other hand, the system under consideration can be studied as a black\nbrane solution of supergravity, with metric\nds2 = H −1/2 (−dt2 + dx21 + dx22 + dx23 ) + H 1/2 (dr 2 + r 2 dΩ25 ),\nR4\nH(r) = 1 + 4 ,\nR4 = 4πNgs ls4 ,\nr\n2\n\n(3)\n\nSee [13, 14] and references therein for an account of what is known about the form of Dp-brane\nlow-energy effective actions.\n\n2\n\n\fa constant dilaton eφ̄ = gs , and N units of Ramond-Ramond flux through the fivesphere. The above metric describes a geometry with an asymptotically flat region\nr ≥ R, and a throat extending from r = R down to a horizon at r = 0. One can trust\nthis supergravity solution as long as R ≫ ls , or in other words, Ngs ≫ 1.\nHenceforth we will refer to the above two descriptions as the flat and the curved\npictures, respectively. It should be emphasized that simultaneous validity of the two\ndescriptions requires\nωls ≪ 1,\nR/ls ≫ 1,\n(4)\nbut the combination ωR is arbitrary, as pointed out already in [7]. When this combination is small it represents a convenient expansion parameter.\nThat the curved and flat space pictures should be in some sense equivalent has\nbeen clear since Polchinski's identification of D-branes as RR-charged black branes [5].\nAt the string level one has the option of either formulating the worldsheet theory as\na non-linear σ-model for closed strings in the non-trivial three-brane background, or\nintroducing explicit D3-branes by considering holes on the worldsheet with appropriate boundary conditions. We emphasize that in the latter description the spacetime\nmetric one perturbs about is flat3 , the non-trivial geometry having being traded for\nthe cumulative effect of open string loops.\nInitial evidence for the equivalence of the two pictures came from the early D-brane\nscattering calculations [15]. A more systematic exploration of the precise connection\nbetween the two descriptions began with the comparison of thermodynamic quantities\n[6] and absorption cross-sections [7, 8, 9] computed in the two approaches.\nBased partly on these works, Maldacena motivated his duality conjecture [1] by\nnoting that in the low-energy limit, ωR → 0, the branes in the flat picture decouple\nfrom the bulk (i.e., Sint → 0). In addition, it can be seen from (2) that in this limit\nonly the leading term survives, and the worldvolume theory reduces to N = 4 SYM.\nIn taking the limit, the dimensionless ratio Φ/ω should be held fixed. It is convenient\nand customary to regard ω as fixed and finite, in which case the low-energy decoupling\nis achieved by taking4 R → 0.\nThe expectation value of the Higgs field is related to the radial coordinate in the\ncurved picture through r = R2 Φ. So if R → 0 with Φ fixed, we have r ∝ R2 → 0,\nand as a result H(r) → (R/r)4 , which means that we zoom in on the near-horizon\ngeometry, AdS5 × S5 . The gauge theory energy ω corresponds in the curved picture\nto the energy measured at infinity, and is related to the locally measured energy ωr\nthrough ω = [H(r)]−1/4 ωr . So even though ωR → 0, the fact that r/R2 is held fixed\nimplies that ωr R stays fixed and finite, and consequently stringy excitations remain\nin the spectrum. Maldacena's remarkable conclusion is that the full string theory in\n3\n\nNotice that there is no inconsistency here- even if the number of D-branes is large, the worldsheet theory with Dirichlet/Neumann boundary conditions and a flat target-space metric is certainly\nconformal. To introduce D-branes as boundary conditions and at the same time consider the associated non-trivial background would be double-counting.\n4\nIn [1] this limit was written as ls → 0, which is equivalent to R → 0, since R/ls ∝ (gs N )1/4 is\nheld fixed.\n\n3\n\n\fAdS5 × S5 can be equated with N = 4 SYM [1]. The string and SYM couplings are\nrelated through gY2 M = 2πgs . For gs ≪ 1 and gs N ≫ 1 the bulk description is in\nterms of classical supergravity. Quantum gs and stringy ls /R corrections about this\nlimit are mapped onto 1/N and 1/λ1/4 corrections in the gauge theory, respectively,\nwhere λ = gY2 M N is the 't Hooft coupling.\nLet us now try to obtain a holographic dual that describes more than just the nearhorizon geometry. Such information would be included if we keep ωR finite [7, 10, 16].\nIt is clear from (2) that Sb will then include terms of dimension higher than four. The\nworldvolume theory is thus no longer conformally invariant, its behaviour at different\nscales being described by a particular renormalization group trajectory. Just like in\nthe AdS case, we expect a UV/IR correspondence [17, 18] to operate, relating the bulk\nradial coordinate r to an energy scale in the field theory. The non-conformal nature\nof the worldvolume theory is thus simply a reflection of the fact that the supergravity\nbackground is no longer SO(4, 2)-invariant, and as a result it has different properties\nat different values of r.\nIn accord with (4), we of course still restrict attention to substringy energies. But\nbecause we now work away from the extreme low-energy limit, the branes and the\nbulk do not decouple. As pointed out in [11], we can still achieve a decoupling of sorts\nin the weak coupling limit5 gs → 0. The flat space supergravity theory becomes free,\nand interactions can only take place on the worldvolume of the branes, with coupling\nstrength gs N. It is thus natural to conjecture that the physics in the full three-brane\nmetric is dual to the worldvolume action for the D3-branes6 [7, 10, 16, 11].\nNotice that, if we as usual wish to regard ω as being arbitrary, then to comply with\n(4) we must take ls → 0. To retain the non-conformal information we are then forced\nto simultaneously send gs N → ∞ in such a way that R ∼ (gs N)1/4 ls remains fixed.\nEven if we do not describe the limit this way, (4) requires that the theory on the branes\nbe strongly coupled, λ = gY2 M N ≫ 1, in order for the curved picture supergravity\nbackground to be reliable. As emphasized in [11], this requirement implies that the\nworldvolume action cannot be merely the Born-Infeld action. The latter arises from\na disk-level string calculation, so it does not incorporate the effects of summing over\nworldsheets with an arbitrary number of boundaries.\n5\n\nIn Section 3 we will be more precise about the sense in which the branes 'decouple' from the\nbulk in this limit.\n6\nA different approach to this same problem was proposed in [19]: embedding the full D3-brane\ngeometry in an asymptotically AdS background. The required geometry is simply that produced\nby two stacks of D3-branes a finite distance apart. By the standard AdS/CFT correspondence, this\nis dual to an SU (N + K) SYM theory broken to SU (N ) × SU (K). It was found in [19] that the\ninformation about the 'full D3-brane' portion of the background is encoded in a very narrow energy\nrange in the gauge theory, and is consequently difficult to extract. Absorption in the double-centered\nbackground was considered recently in [20], and successfully compared with the field theory result\nin [21].\n\n4\n\n\f2.2\n\nExplicit conjectures\n\nTo formulate an explicit duality conjecture, it is thus necessary to determine the lowenergy effective action for a large number of D-branes at strong 't Hooft coupling-\nundoubtedly a daunting task. Fortunately, as explained in [11, 12], string-theoretic\ninformation highly constrains the possible form of the required action. First of all,\nthe theory must reduce to N = 4 SYM in the extreme infrared, corresponding to\nthe fact that the three-brane metric reduces to AdS for r → 0. For small but finite\nenergy, the Lagrangian of the dual theory can be expressed as a deformation of the\nsuperconformal fixed point by irrelevant operators,\nL = LSY M +\n\nX\n\nd>4\n\nhd Rd−4 Od ,\n\n(5)\n\nwhere d denotes the dimension of the non-renormalizable operator Od , and hd is a\ndimensionless coupling.\nThe irrelevant operators {Od } ought to be compatible with the symmetries of\nthe three-brane background: they must preserve sixteen supersymmetries (i.e., nonconformal N = 4) and be invariant under the SO(6) ∼ SU(4) R-symmetry. The\nleast irrelevant such operator is\n1\nO8 = Q4 Q̄4 Tr Φ4 = Tr F 4 − (F 2 )2 + . . .\n4\n\u001a\n\n\u001b\n\n,\n\n(6)\n\nwhich happens to be the leading correction to SYM obtained by expanding the BornInfeld action (see [22] and references therein). As indicated schematically in (6), O8\nlies in a short multiplet of the N = 4 algebra: it is a supersymmetric descendant of\nthe chiral primary operator Tr Φ4 (where the product of scalar fields is understood\nto be symmetrized and traceless). O8 is dual to a supergravity field π which has\nmass-squared m2 = 32/R2 and describes deformations of the trace of the AdS5 and\nS5 metrics [23, 24, 25].\nNow, the AdS/CFT correspondence predicts that for strong 't Hooft coupling, all\noperators in the gauge theory except those in short multiplets acquire large anomalous\ndimensions, d ∼ λ1/4 . For λ ≫ 1, then, the sum in (5) is effectively restricted to run\nonly over operators in short multiplets. All of the supergravity fields dual to such\noperators were tabulated in [23]. It is shown there that the aforementioned field π is\nin fact the only scalar SO(6)-singlet mode with positive mass-squared (i.e., dual to\nan irrelevant gauge theory operator). Gubser and Hashimoto [11] were thus led to\nconjecture that, at least for gs → 0 and gs N → ∞, physics on the curved three-brane\nbackground is holographically encoded in the Lagrangian\nL = LSY M + h4 R4 O8 .\n\n(7)\n\nThis was interpreted in [11] as a Wilsonian effective Lagrangian with a cutoff of order\nR.\n\n5\n\n\fTo test their conjecture, Gubser and Hashimoto computed the absorption probability P for arbitrary dilaton partial waves in the three-brane background7 , exploiting\nthe remarkable fact that the relevant equation of motion has an exact solution in terms\nof associated Mathieu functions [11] (see also [26]). From P it is possible to deduce,\nthrough an application of the optical theorem, the two-point correlator of the gauge\ntheory operator dual to the dilaton partial wave under consideration. This exercise was carried out in [11] for the dilaton s-wave, employing the logic explained in\n[9, 27, 4]. In Section 4 we will demonstrate that the form of the optical theorem used\nin [11] is incomplete. Nevertheless, the two-point function which satisfies the correct\noptical theorem (and which follows directly from the prescription we will develop in\nthe following section) has a form similar to the one presented in [11]. It was argued in\n[11] that this form could potentially be fully explained in terms of the Lagrangian (7),\nalthough of course a perturbative calculation would not be expected to reproduce the\nprecise numerical coefficients obtained at strong coupling from the supergravity calculation. For the first correction to the conformal result, this comparison was carried\nout already in [10]. A closely related comparison can be found in [20, 21].\nThe conjecture of Gubser and Hashimoto was further analysed and considerably\nstrengthened in subsequent work by Intriligator [12]. The last author arrived at (7)\nfrom a somewhat different perspective. His starting point is the assumption that there\nexists some four-dimensional theory dual to the background (3) with an arbitrary\nSO(6)-symmetric harmonic function\nR4\n.\n(8)\nr4\nIntriligator then argues that the scaling properties of the metric imply that h should\nbe interpreted as a coupling constant which multiplies an operator in the dual theory\nwhose dimension is exactly eight at all scales. As stated before, a renormalization\ngroup flow dual to the three-brane background must preserve sixteen supersymmetries. From a detailed analysis of flows with these many supersymmetries, the author\nof [12] concluded that along them the gauge coupling constant does not run, and the\ndimensions of operators in short multiplets remain constant. In the case of immediate\ninterest, the former property is in line with the fact that the background dilaton is\nconstant, while the latter property implies that O8 has dimension exactly eight along\nthe entire flow. In this manner, Intriligator arrived at the conclusion that the background (3) with harmonic function (8) is holographically dual to the four-dimensional\ngauge theory whose Lagrangian is exactly (7) along the entire flow, with h4 ∼ h [12].\nThis duality statement includes the AdS5 /SYM4 correspondence (h = 0) as a particular case. The case h = 1 is of course the full three-brane background, and all other\ncases with h > 0 are related to this by a rescaling of r and xμ . It was emphasized\nin [12] that the dimension-eight operator that enters the duality could potentially be\na linear combination of the single-trace operator (6) and the double-trace operator\nTr F 2 Tr F 2 + . . ., which has exactly the same quantum numbers.\nH(r) = h +\n\n7\n\nThree-brane absorption probabilities for a broad class of massless modes with arbitrary energies\nwere determined in [28].\n\n6\n\n\fWhile the information reviewed so far indicates that O8 (possibly with some\ndouble-trace admixture) is the only short-multiplet operator of relevance for the duality, it does not yet rule out that long-multiplet SU(4)-symmetric operators preserving\nsixteen supersymmetries could appear in the deformed Lagrangian (5). If present,\nthey would be important for the duality conjecture away from the strong-coupling\nregime. Intriligator argued that this is in fact not possible, because such operators\nwould have to enter the Lagrangian multiplied by a gY M -dependent power of h, and\nthis would lead to a non-trivial running of the gauge coupling constant, in contradiction with the fact that the dilaton in the supergravity background is constant [12].\nIntriligator has thus conjectured that (7) is in fact the exact holographic dual of type\nIIB string theory on the background (3) with harmonic function (8), for any value of\ngs and N. Notice that the duality has now been phrased in terms of the full string\ntheory, as opposed to just supergravity: as explained before, if gs N and ωR are arbitrary, then ωls is also arbitrary, implying that it is possible to excite higher string\nmodes. String excitations would in fact be present on both sides of the duality, so\nit is not clear if a sensible meaning can be ascribed to a duality statement involving\nonly the gauge theory modes8 .\nIn a sense, the statement that (7) is dual to the full D3-brane geometry is a special\ncase of the AdS5 /SYM4 correspondence. Given that the operator O8 is dual to the\nsupergravity field π, the deformation of LSY M by O8 should describe a background\nwhich asymptotes to AdS space, with the mode π excited.\nThe standard situation would be to consider N = 4 SYM as a UV fixed point, and\nperturb away from it by adding relevant operators Od , d < 4 (see [4] and references\ntherein). In that case the asymptotic r → ∞ geometry is AdS, with the appropriate\nsupergravity field excited and having a radial-dependence r d−4 . The√dimension of the\noperator and the mass of the dual field are related through d = 2 + 4 + m2 R2 [2, 3].\nOn the contrary, for the deformation indicated in (7) one regards N = 4 SYM as\nan IR fixed point. The geometry is thus required to be asymptotically AdS as r → 0.\nExpanding the metric (3) with harmonic function (8), one finds that to linear order\nin h\n2\n\nds ≃\n\nds2AdS\n\nh r\n+\n2 R\n\u0012\n\n\u00134 \"\n\nr\n−\nR\n\u0012\n\n\u00132\n\nR\n(−dt + dx ) +\nr\n2\n\n2\n\n\u0012\n\n\u00132\n\n2\n\ndr + R\n\n2\n\ndΩ25\n\n#\n\n.\n\n(9)\n\nThe form of the perturbation, and in particular its dependence on r 4 (relative to\nAdS), is consistent with a deformation associated with the field π, whose mass satisfies\nm2 R2 = 32 [33]. As r increases, the metric perturbation indicated in (9) grows large,\nso it becomes necessary to solve the full non-linear supergravity equations. The\ncomplete solution is of course the three-brane background, which differs drastically\nfrom AdS at large r.\nOn the gauge theory side, we are attempting to define the theory starting from\nthe IR fixed point and following the RG flow in the reverse direction. The presence\n8\n\nIt seems more sensible to speak of a closed string–open string duality, along the lines of [29, 30]\n(see also [31, 32]).\n\n7\n\n\fof a non-renormalizable interaction would ordinarily point to the need for a new\ndefinition of the theory in the UV. On this issue, Intriligator espoused the view that\n(7) describes the theory at all scales, with the understanding that the coefficients of\nall other irrelevant operators are fine-tuned to zero [12].\nWe do not necessarily subscribe to this view. In particular, we should stress that,\nif D-branes are invoked to motivate the duality, then to us it seems inevitable that\nexcited open string modes enter the duality at super-stringy energies, ω > ms . Such\nenergies can certainly be reached if both R and gs N are finite. On the other hand,\nIntriligator's line of argument does not really equate the dual theory with the D3brane worldvolume theory: the duality is asserted to hold for arbitrary gs and N,\nwhereas we know that (7) certainly does not summarize the low-energy dynamics of\na small number of weakly coupled branes, gs ≪ 1, N ∼ 1. So whether or not it is\ncorrect, this strong form of the duality conjecture cannot be said to rest directly on Dbrane intuition. Instead, it is based on the (by now fairly standard) assumption that\nany theory of gravity can be described holographically through a lower-dimensional\nnon-gravitational theory [34, 35].\n\n2.3\n\nOur approach\n\nGiven the immense difficulties encountered in attempting a direct analysis of the\ncandidate dual theory, we choose to follow an indirect route. We assume that there\nexists some theory which is the holographic image of physics on the three-brane background. We will henceforth refer to this theory as the 'holographic dual'. Based on\nthis existence assumption, in the following sections we will develop calculational tools\nthat allow us to compute quantities in the holographic dual in terms of supergravity.\nThe spirit of our approach is similar to that of [36, 37, 38], in that we use a conjectural\nduality to extract information about the dual theory. Since our calculations are based\nentirely on the supergravity side of the duality, our results contain information about\nwhatever theory turns out to be the holographic dual of the D3-brane background,\neven if it is not of the form (7) along the entire RG flow. Notice in particular that\nthe fact that the supergravity solution is smooth for all r presumably indicates that\nthe dual theory is sensible at all energy scales. We regard our work as a step towards\na more precise specification of this dual theory.\n\n3\n\nHolographic Two-Point Function from Supergravity\n\nIf there exists a duality relating supergravity in a D3-brane background to some\nfour-dimensional theory, the duality mapping ought to work in both directions. By\ndefinition, the lower-dimensional theory should holograph supergravity in the tendimensional background. Conversely, the physics of the holographic theory should\nbe encoded in the bulk. In particular, a prescription should exist for computing\n8\n\n\fcorrelation functions of the dual theory in terms of the curved D3 spacetime. In this\nsection we will construct such a prescription. For definiteness, we focus on the twopoint function of the operator dual to the dilaton s-wave. The extension to higher\npartial waves is straightforward; the main steps are described in Appendix B, and\nthe final result is quoted at the end of this section. We will generalize the recipe to\nhigher correlators in Section 6.\nBefore we proceed, we should take a moment to indicate why we have found it\nnecessary to develop a new prescription. In the AdS/CFT case it has been argued\n[39, 40] that the GKPW recipe [2, 3] essentially equates correlation functions in\nthe CFT with (generalized) AdS scattering amplitudes. It is thus natural to guess\nthat the GKPW prescription can be carried over to our setting by simply replacing\nthe AdS bulk-to-boundary propagator with the corresponding solution in the full\nD3 background. Unfortunately, this guess yields a two-point function which fails\nto reproduce the correct absorption probability, and suffers from severe problems at\nhigh energies9 . In this section, following a more physical approach, we will be arrive\nat a prescription which gives a two-point function in accord with the absorption\nresults (see Section 4), and has a built-in subtraction and amputation procedure\nwhich automatically ensures a well-defined UV limit.\n\n3.1\n\nThe prescription\n\nConsider a dilaton propagating in the presence of N D3-branes. Let us denote the\ncorresponding propagator by G(r, r ′) (for the time being we focus only on the rdependence; the other nine directions are left implicit). Viewing the branes as a\nsupergravity solution, this propagator is obtained to lowest order in gs by solving\nthe linearized equation of motion for the dilaton in the curved ten-dimensional background. Higher-order corrections, involving supergravity interactions, are suppressed\nin the gs → 0 limit. In taking this limit, we keep the geometry fixed, i.e., we hold\nR4 ∝ gs N constant.\nOn the other hand, we can view the D-branes as (3+1)-dimensional objects with\nintrinsic dynamics, embedded in a flat (9+1)-dimensional ambient spacetime. In the\nobvious coordinate system, they are localized (along six directions) at r = 0. The\nlth partial wave of the canonically normalized dilaton φ couples with unit strength\nto an operator in the worldvolume theory which will be denoted by Oφ (the angularmomentum labels of these operators will be left implicit). The leading low-energy\nterms of these operators can be found in [41]. The dilaton s-wave, in particular,\ncouples to the operator\n√\n\u0013\n\u001b\n\u001a √\n\u0012\n√\n1 2 2\n2π\n4\n2 2 2\n2 4\nOφ = −\n(10)\nTr ( 2πR ) F + ( 2πR ) F − (F ) + . . . ,\n4\n4\n9\n\nWe are referring here to the appearance of UV divergences with non-standard momentumdependence. Extrapolation of the GKPW recipe led to similar high-energy problems in [37, 38],\nwhich were dealt with using ad hoc momentum-dependent multiplicative renormalizations. The need\nfor this peculiar procedure was taken as an indication of the non-local nature of the corresponding\ndual theories.\n\n9\n\n\fwhere the '. . .' represent scalar and fermion dimension-four operators present already\nin the conformal limit [41], as well as additional operators of dimension eight and\npossibly higher which are corrections away from this limit [10]. We remind the reader\nthat the field strength F in (10) is 't Hooft-normalized, i.e., the combination which\nappears in the worldvolume action is N Tr F 2 .\nr\n\nr\n\nr\n\nr′\n\na\n\nr′\n\nb\n\nr′\n\nc\n\nFigure 1: Propagation of a flat space dilaton in the presence of D3-branes. Starting from\npoint r, the dilaton can reach r ′ a) directly, or b,c) indirectly, after having interacted with\nthe branes. Black dots denote insertions of the operator Oφ , and dotted lines represent\nworldvolume processes.\n\nA dilaton can propagate from r to r ′ either directly (Fig. 1a), or indirectly, after\nhaving interacted\nwith the branes (e.g., as depicted in Figs. 1b,c) by means of the\nR\ncoupling d4 x φOφ . This results in a series of contributions to the propagator which\nare expressed diagrammatically in Fig. 2, where Cn denotes the 'pure worldvolume'\nconnected n-point correlator of Oφ (i.e., the correlator computed exclusively with the\nbrane action Sb described in Section 2).\nIf we take the 'decoupling' limit gs → 0 with the 't Hooft coupling λ ∝ gs N fixed,\nthe expansion in Fig. 2 simplifies drastically. Diagrams involving supergravity vertices\nevidently vanish. In addition, almost all diagrams involving brane correlation functions drop out. The gs -dependence of the correlators is known in the conformal limit,\nfrom the standard AdS/CFT correspondence. According to the GKPW recipe [2, 3],\nboundary theory correlators are obtained from bulk AdS diagrams with n external\ndilaton legs which terminate at the boundary. C2 is consequently gs -independent,\nsince the relevant graph is just the propagator. The graphs for (connected) higherorder correlators feature supergravity vertices, and as a result, (the leading large-N\ncontribution to) Cn is proportional to gsn−2. From the point of view of the field theory,\nthis corresponds to the large-N factorization of correlation functions. It is thus clear\nthat in the gs → 0 limit, the expansion in Fig. 2 collapses to\n\nG(r, r ′) = G0 (r, r ′) + G0 (r, 0)C2 G0 (0, r ′) + G0 (r, 0)C2 G0 (0, 0)C2 G0 (0, r ′) + . . .\n= G0 (r, r ′) + G0 (r, 0)∆2 G0 (0, r ′),\n(11)\n\nwhere G0 is the flat-space dilaton propagator, and in the second line we have denoted\nby ∆2 the sum of the indicated series.\n10\n\n\fG\n\nG0\n\nC2\nSUGRA corrections\n\nCn corrections\nC4\n\nFigure 2: Diagrammatic expansion for the two-point dilaton correlator. The full propagator\nG is written out in terms of the flat space propagator G0 , flat space supergravity vertices,\nand 'pure-brane' n-point correlators Cn . The first three diagrams on the right-hand side\ncorrespond to processes of the type shown in Figs. 1a, 1b and 1c, respectively. See text for\ndiscussion.\n\nIt might seem surprising that even at vanishing gs the branes are capable of\nemitting and reabsorbing dilatons. From the string theory perspective, diagrams\nwith additional closed strings usually have extra handles, and are thus suppressed\nas gs → 0. However, what looks like an extra handle in going from, e.g., Fig. 1b to\nFig. 1c, in fact sews together two surfaces which would otherwise be disjoint. The net\neffect is to add some number of boundaries to the original surface. In this manner,\neach successive term in the first line of (11) originates from a string diagram with\nadditional worldsheet boundaries, which contribute additional powers of gs N, not of\ngs . Since we work in the regime of strong 't Hooft coupling, the entire series in (11)\nmust indeed be kept. Notice this means that there is no way to disentangle processes\nlike those shown in Fig. 1c from the 'purely worldvolume' graphs that are contained\nin C2 . String theory thus dictates that it is ∆2 , and not C2 , which must be regarded\nas the two-point correlator of Oφ ,\n∆2 = hOφ Oφ i ,\n\n(12)\n\nin the effective theory summarizing the dynamics of the 'decoupled' brane system.\nThis is the theory which can be expected to holograph the physics of the curved D3\nbackground.\nIf we identify G(r, r ′) in (11) with the curved space dilaton propagator, then the\nequality can a priori only be expected to hold in the limit r, r ′ → ∞, because it is\nonly far away from the branes that one can meaningfully compare G with the flat\nspace propagator G0 . The essential point here is that, if we took (11) as it stands\nas our definition of ∆2 , then we would expect ∆2 to depend on r, r ′ , complicating\nits interpretation as a correlator in a four-dimensional theory. Our main goal in the\n11\n\n\fremainder of this section and the next will be to show that, on the contrary,\nG(r, r ′ ) − G0 (r, r ′ )\n∆2 = lim\nr,r ′ →∞ G0 (r, 0)G0 (0, r ′ )\n\n(13)\n\nis a well-defined quantity which can be rightfully interpreted as the desired fourdimensional holographic correlator.10\n\n3.2\n\nCalculation of the correlator\n\nTo examine the limit r, r ′ → ∞, we first need to discuss the propagators in more\ndetail. In order for the essential points to be more easily appreciated, we will first\ncarry out the calculations at a general level, postponing explicit evaluations to the\nnext subsection. The propagators G and G0 are defined as solutions to the tendimensional dilaton equation of motion\nh√\ni\n∂M\n−g g M N ∂N G = δ (10) (X − X ′ )\n(14)\n\nin the respective backgrounds. Upon projecting onto a plane wave exp(ikμ xμ ) for the\ndirections parallel to the three-branes, and onto the constant mode on S5 , one is left\nwith an equation for the radial propagator G(k μ ; r, r ′) of the form\n(\n\n∂r2\n\nδ(r − r ′ )\n∂r f\n∂r + Vk (r) G = 3\n,\n+\nf (r)\nπ f (r)\n)\n\n(15)\n\n√\nwhere f (r) = −gg rr . Since we regard G(k; r, r ′ ) as the field created at r by a source\nat r ′ , it must satisfy boundary conditions such that (for ω ≡ k 0 > 0) the associated\nflux moves away from the source.\nAt r 6= r ′ , (15) is just the homogeneous equation for radial motion of the dilaton.\nDenote the solution with the required behaviour at r → 0 (and consequently at all\nr < r ′ ) by φ1 . Similarly, let φ2 be the solution of the homogeneous equation obeying\nthe appropriate boundary condition at r → ∞. Finally, take φ3 to be the solution\nwhich is linearly independent from φ2 and satisfies the 'opposite' boundary condition\nat r → ∞. Of course, the solutions {φ1 , φ2, φ3 } are not independent, and we can\nwrite\nφ1 = Aφ3 + Bφ2 ,\n(16)\nwith A, B some overlap coefficients. It is clear that the r-dependence of the propagator\ncan be expressed in the form\nG(r, r ′ ) =\n\n(\n\nα(r ′)φ1 (r) if r < r ′\nβ(r ′)φ2 (r) if r > r ′\n\n10\n\n(17)\n\nOnce this is established, it becomes natural to speculate, based on the insight gained from\nAdS/CFT [17, 18], that (11) holds also for finite r, r′ , with ∆2 interpreted as the two-point function\nwith a UV cutoff (or more precisely, with r and r′ indicating a 'smearing' of the two insertions of\nOφ ).\n\n12\n\n\ffor some α, β. These functions of r ′ can be determined by demanding that the propagator be continuous at r = r ′ , and its first derivative have a discontinuity at r = r ′\nwhich yields the delta-function in (15), with unit coefficient. The end result is\n1\n\n1\nB\nG(r, r ) =\nφ2 (r> )φ1 (r< ) =\nφ2 (r> ) φ3 (r< ) + φ2 (r< ) ,\nw32 A\nw32\nA\n′\n\n\u0014\n\n\u0015\n\n(18)\n\nwhere r< (r> ) is the smaller (larger) of r and r ′ , w32 is the constant appearing in\nthe Wronskian W32 (r) = φ3 ∂r φ2 − φ2 ∂r φ3 = w32 /f (r), and A, B are the overlap\ncoefficients defined in (16).\nNow we have enough information to explore the nature of the limit in (13). By\ndefinition, the flat space solution φ02 (φ03 ) must asymptote to a purely outgoing\n(ingoing) wave as r → ∞: φ02 (r) → r −5/2 exp[i(qr + θ0 )]. This must be true as well\nfor the corresponding solution in the asymptotically flat D3 background, with the\nsame q but a different 'phase shift', θ. Finally, the flat space solution φ01 must be\nregular at the origin, which implies that A0 = B0 , and G0 (r, 0) → r −5/2 exp[i(qr+θ0 )].\nUsing all of this in (13) one is left with\n\"\n\nw012\n1\n∆2 =\nw32 φ01 (0)\n\n#2 \"\n\n#\n\nB 2i(θ−θ0 )\ne\n−1 ,\nA\n\n(19)\n\nwhere A, B are the curved space overlap coefficients and w012 /f (r) is the Wronskian\nof the indicated flat-space solutions. As advertised, all r, r ′ -dependence cancels out,\nand the limit is well-defined. This result is as expected from our derivation of (13),\nand serves as a first consistency check on our approach.\n\n3.3\n\nExplicit evaluation\n\nHaving explained the essential points, let us now proceed to the explicit determination\nof the dilaton propagators. Using the metric (3) in (14), the curved space propagator\nG(k μ ; r, r ′) can easily be seen to satisfy (15) with f (r) = r 5 and Vk (r) = q 2 H(r), where\nwe have defined q 2 = ω 2 − ~k 2 . As explained in [11] (see also [26]), the corresponding\nhomogeneous equation can be related to Mathieu's equation, and the solutions of\ninterest to us are found to be\nφ1 (r) = r −2 H (1) (ν, − ln(r/R)) ,\nφ2 (r) = r −2 H (1) (ν, + ln(r/R)) ,\nφ3 (r) = r −2 H (2) (ν, + ln(r/R)) .\n\n(20)\n\nUnless otherwise noted, we adopt the notation of [11]: H (1,2) (ν, z) are associated\nMathieu functions of the third and fourth kind, respectively, and ν is the 'Floquet\nexponent' (an l-dependent function of qR) defined in [11, 26]. In line with the previous\ndiscussion, the following boundary conditions have been enforced: φ1 is purely ingoing\nat the horizon r = 0, while φ2 (φ3 ) is purely outgoing (ingoing) at r → ∞. The\n13\n\n\fWronskian of φ2 and φ3 works out to w32 = 4i/π. For future use, we note that with\nthese boundary conditions, (16) implies that the absorption probability is given by\nPabs = 1 −\n\nB\nA\n\n2\n\n.\n\n(21)\n\nFrom Eq. (18) in [11] we can read off the superposition coefficients\nA=\n\n1\nη2 χ\n− η1\n\nχ−\nη\n\n,\n\nB=\n\nχ−\nη−\n\n1\nχ\n1\nη\n\n,\n\n(22)\n\nwhere η = exp(iπν) and χ = φ(−ν/2)/φ(ν/2), with φ(±ν/2) (not to be confused with\nthe radial solutions φi (r)) two of the coefficients involved in the definition of Mathieu\nfunctions [11, 26]. Both η and χ are functions of qR, which we will characterize\nfurther in Section 4 and Appendix A. Using all of this in (18) we obtain\n\n\n\n\nχ − χ1 (1)\niπ\nr< \nr<\nr>  (2)\nμ\n′\n(1)\nG(k ; r, r ) = − 2 ′2 H (ν, ln( )) H (ν, ln( )) +\nH\n(ν,\nln(\n)) .\n4r r\nR \nR\nR \nχ − η21χ\n(23)\nAs r → ∞, the Mathieu functions asymptote to Hankel functions, and\ni\nG(k μ ; r, r ′ ) → −\n2q\n\n\u0012\n\n1\nrr ′\n\n\u00135/2\n\n\n\n\nei(qr> +θ) e−i(qr< +θ) +\n\n\nχ−\n\n\n\n1\n\nχ\ni(qr< +θ)\n,\ne\n1\n\n2\nη χ\n\nχ−\n\n(24)\n\nwith θ = −π(2ν + 1)/4.\nThe derivation of the flat space propagator proceeds in the same steps. The\nsolutions to the homogeneous version of (15) are now just Bessel and Hankel functions,\nφ01 (r) = r −2 J2 (qr) ,\n(1)\n\nφ02 (r) = r −2 H2 (qr) ,\n(2)\n\nφ03 (r) = r −2 H2 (qr) .\n\n(25)\n\nThe appropriate boundary condition at the origin r = 0 is now simply regularity of\nthe solution, which picks out J2 as the correct solution. The propagator is found to\nbe\nn\no\niπ\n(1)\n(2)\n(1)\nG0 (k μ ; r, r ′ ) = − 2 ′2 H2 (qr> ) H2 (qr< ) + H2 (qr< ) ,\n(26)\n4r r\nso in the limit r, r ′ → ∞ it becomes\ni\nG0 (k ; r, r ) → −\n2q\nμ\n\n′\n\n\u0012\n\n1\nrr ′\n\n\u00135/2\n\nn\n\nei(qr> +θ0 ) e−i(qr< +θ0 ) + ei(qr< +θ0 )\n\nwith θ0 = −5π/4. Additionally, as r → ∞ one finds\n√\n!\ni 2π q 3/2 i(qr+θ0 )\nμ\nG0 (k ; r, 0) →\ne\n.\n16\nr 5/2\n14\n\no\n\n,\n\n(27)\n\n(28)\n\n\fInserting Eqs. (24), (27) and (28) into (13) we finally arrive at an explicit expression for the two-point function of Oφ in the holographic theory,\n\n\n\n\nχ − χ1\n64π 2\n .\n∆2 (q 2 ) = 4 i \n1 −1\nq\nηχ − ηχ\n\n(29)\n\nThe preceding calculation has focused on the S5 -symmetric mode of the dilaton,\nbut the prescription we have derived generalizes to arbitrary supergravity fields in\na straightforward manner. In particular, one can easily determine the two-point\nfunctions of the operators dual to all dilaton partial waves. The general result is\n(l)\n∆2 (q 2 )\n\n\n\n= 25+l π 2 (l + 1)(l + 2)q −2l−4i (−)l\n\nχl −\n\nηl χl −\n\n1\nχl\n1\nηl χl\n\n\n\n− 1 .\n\n(30)\n\nThe main steps of the calculation are given in Appendix B. The analysis of the above\nresult will be the subject of the next section.\n\n4\n\nLow Energy Limit and Absorption Probability\n\nIn order to understand the properties of the correlator (30) it is convenient to introduce the following notation:\ns = (qR)2 , χl = eiμl (s\n\n2 ) ln s+iα (s2 )\nl\n\n, νl = l + 2 + iμl (s2 ).\n\n(31)\n\nIt can be inferred from the results of [11, 26] (summarized in Appendix A) that αl (s2 )\nand μl (s2 ) are analytic functions (in a neighborhood of s = 0) which, for real s, are\nreal when l = 0 and purely imaginary for l > 0. In this notation, Eq. (29) (which is\nvalid for the case l = 0) can be rewritten as:\n∆2 (s) = −\n\n64π 2 R4\n64π 2 R4\ncot\n[μ\nln(−s)\n+\nα\n]\nsinh(πμ\n)\n+\ni (cosh(πμ0 ) − 1) . (32)\n0\n0\n0\ns2\ns2\n\nThe second term contains only (even) integer powers of s in an expansion around\ns = 0 and therefore corresponds to contact terms. We can drop it in a comparison\nto field theory. The first term has a cut for positive real s where the imaginary part\nchanges sign, being negative above the real axis and positive below. In addition, it\nbecomes real for negative real s. It is clear then that the first term has the analytic\nproperties expected from a field theory propagator. On the other hand, even if the\nsecond term is dropped on the grounds that it is analytic, it is somewhat unsettling\nthat it is imaginary for real values of s. We will return to this point below.\nUsing the above notation, it is equally easy to write down the two-point function\nfor a generic value of angular momentum l (see Appendix B for the derivation):\n(l)\n\n∆2 (s) = −2l+5 (l + 1)(l + 2)\n\nπ 2 R4\ncot [μl ln(−s) + αl ] sinh(πμl ) + analytic.\ns2\n15\n\n(33)\n\n\fThe l-dependent factor in front arises from the normalization factor of the spherical\nharmonics. Incidentally, notice that our method yields a finite result, in contrast\nwith the AdS calculation [2, 3, 4], which produces a divergent result that needs to be\nrenormalized.\n\n4.1\n\nLow energy limit\n\nUsing the results of [11, 26], which we summarize in Appendix A, the small s behaviour\n(l)\nof ∆2 follows as\n(l)\n\n∆2 (s) = analytic −\n\nπ3\nR4 sl+2 ln(−s) + higher order in s.\n23l+1 l!(l + 1)!3 (l + 2)\n\n(34)\n\nThe low-energy behaviour of this propagator is fixed by conformal invariance up to\na normalization constant. It was computed directly in the SYM theory in [41]. To\n(l)\ncompare with that result one has to multiply ∆2 by sl Cp9 Cp9 (using the notation of\n[41]), from their definition of the operators coupling to the dilaton, and also divide\nby a factor 2κ2 , from the difference between the standard and canonical dilaton\nnormalization. After including all these factors we obtain the result of [41] up to\nan overall factor of two. Notice that one should not expect exact agreement, since\nas explained in Section 3, the propagator ∆2 incorporates not only worldvolume\nprocesses but also the coupling with the flat space dilaton. It is related to the 'pure\nbrane' two-point function C2 through Eq. (11).\nFor the case l = 0 the result including more than just the leading term is\nπ3 4 2\n1\n7\n17 4\nR s ln(−s) 1 − s2 ln(−s) + s2 +\ns (ln(−s))2 (35)\n4\n24\n72\n6912\n\u0015\n5π 2 4\n5561 4\n161 4\ns ln(−s) +\ns +\ns + * * * + analytic .\n−\n18432\n13824\n663552\nThe first five terms agree with those that can be deduced from the results of [11],\nup to the same overall factor of two (the first two terms are implicit already in [10]).\nThe sixth term (of order s6 ln(−s)) disagrees with [11]; it is the first discrepancy due\nto the fact that, as explained in the following subsection, the analysis of [11] does not\nemploy the correct form of the optical theorem.\nIt would be interesting to examine the high-energy behaviour of the propagator.\nThis, however, would require a better understanding of the role played by the second\nterm in (32) and (33). We have already pointed out that this term is peculiar, and\nwe will have more to say about it below. Let us just note that, as will be discussed\n(l)\nin the next subsection, ∆2 is related to the absorption probability Pabs through\nEq. (45). Since Pabs → 1 as s → ∞, we seem to conclude that the UV behaviour\n(l)\nof the propagator is ∆2 (s) ∼ s−l−2 . Extracting this result directly from (30) is a\ndelicate matter. Consider for instance the case l = 0. It has been pointed out in [38]\nthat a WKB analysis shows that the first term of (29) is a decaying exponential at\nhigh energies. The expected q −4 behaviour thus appears to arise entirely from the\nsecond term, which has the peculiar property of being purely imaginary.\n∆2 (s) = −\n\n\u0014\n\n16\n\n\f4.2\n\nAbsorption probability\n\nFrom the field theory point of view the propagator computed in the previous section\ncan be related to the absorption cross-section using unitarity. Here we proceed to\ncompute such relation and then, as a consistency check, verify that it is satisfied by\nour propagator. Writing the S-matrix as S = 1 + iT , the well known identity\n− 2Imhi|T |ii = hi|T † T |ii\n\n(36)\n\nfollows. The state |ii will be taken to be an incident dilaton moving with momentum\nk μ parallel to the brane and with transverse momentum ~q. Let x0...4 and y5...9 denote\ncoordinates parallel and perpendicular to the brane, respectively. The coordinate y9\nis chosen to be parallel to the incident dilaton, i.e, ~q = qŷ9 . The S-matrix follows\nfrom the interaction\nSint =\n\nZ\n\n9\nX\n\nd4 x\n\n∂i1 ...il φ(x, y)\n\ni1 ...il =5\n\ny =0\n~\n\ni1 ...il lm\nClm\nO .\n\n(37)\n\ni1 ...il\nClm\n\nwhere the coefficients\nare defined in Appendix B. All supergravity interactions\nare suppressed by powers of gs and so discarded in the limit gs → 0. The field φ(x, y⊥ )\nis expanded as\nφ(x, y⊥ ) =\n\nZ\n\n\u0011\nd3 kd6 q \u0010 −ik*x−iq*y\nik*x+iq*y †\ne\na\n+\ne\na\nk,q\nk,q\n(2π)9 2ωk,q\n0\n\nwhere the frequency ωk,q ≡ k =\n\nq\n\n(38)\n\n~k 2 + ~q2 , and the operators ak,q and a† satisfy\nk,q\n\n[ak′ ,q′ , a†k,q ] = (2π)9 2ωk,q δ (4) (k − k ′ )δ (6) (q − q ′ ).\n\n(39)\n\nWith these conventions and using the fact that the only interaction vertex where φ\nappears is the one in Eq. (37) we get\nh1k,q |T |1k,q i = −V T (−)\n\nl\n\nZ\n\ni1 ...il j1 ...jl\nd4 xeikx h0|T̂ Olm (x)Olm (0)|0iClm\nClm qi1 . . . qjl\n\n(l)\n\n= V T (−)l i∆2 (k)q 2l\n\nX\n\n9...9 9...9\nClm\nClm ,\n\n(40)\n\nm\n\nwhere V ,T are normalization volume and time (which cancel in the final result) and\nin the second equality we used the fact that the incident particle propagates along\ny9 . Note also that the Olm propagator is computed including the vertex (37).\nTo compute h1k,q |T † T |1k,q i one has to insert a complete set of states between\nT † and T . With the only interaction being (37), the possible processes are elastic\nscattering and absorption. Elastic scattering is described by inserting one-dilaton\nstates. The calculation is similar to the previous one:\nR\n\nd3 k ′ d6 q ′\n(2π)9 2ωk′ ,q′\n\nh1k,q |T † |1k′ ,q′ ih1k′,q′ |T |1k,q i =\n\n=\n\nVT\nq 4l+4\n2(2π)5\n\n=\n\nVT\nq 4l+4 Nl\n2(2π)5\n\n(l)\n\nP\n\nmm′\n\nP\n\ni1 ...il j1 ...jl ′\n9...9 9...9\nClm\nClm′ |∆2 |2 dΩq′ Clm\nClm′ q̂i1 . . . q̂j′ l\n(l)\n\nm\n\nR\n\n9...9 9...9\nClm\nClm |∆2 |2 .\n\n17\n\n(41)\n\n\fHere qˆ′ is a unit vector indicating the direction of the outgoing particle (|~q ′ | is fixed\nby energy conservation) and Nl is the result of the angular integration, which can be\nfound in Appendix B.\nThe other contribution is from inelastic scattering, which in our case is simply\nproportional to the absorption cross-section:\nZ\n\ndνD h1k,q 0D |T † |0φ νD ih0φ νD |T |1k,q 0D i = V T 2iqσabs .\n\n(42)\n\nHere νD denotes an arbitrary state of the brane, 0φ (0D ) the vacuum in the bulk\n(brane), and 2iq is the incident flux.\nAltogether, unitarity implies\n(l)\n\n− 2q 2l Im∆2\n\nX\n\n9...9 9...9\nClm\nClm = 2qσabs +\n\nm\n\nX\nq 4l+4\n(l)\n9...9 9...9\nNl\nClm\nClm |∆2 |2 .\n5\n2(2π)\nm\n\n(43)\n\nThe absorption cross-section is related to the absorption probability through[27, 11]\nσabs =\n\n8π 2\n(l + 1)(l + 2)2 (l + 3)Pabs .\n3q 5\n\n(44)\n\nWe can thus recast (43) as an expression relating the absorption probability to the\npropagator,\nPabs\n\n\n\n\n\n(l)\n\n(l)\n\nq 2l+4 ∆2\nq 2l+4 ∆2\n−\n= −2Im  l+5 2\n2 π (l + 1)(l + 2)\n2l+5 π 2 (l + 1)(l + 2)\n\n2\n\n,\n\n(45)\n\n9...9 9...9\nwhere we have used the values of Nl and m Clm\nClm given in Appendix B. Inserting\n(l)\nour explicit expression for ∆2 , Eq. (30), we obtain\n\nP\n\n\n\nPabs = −2Im i \n= 1−\n\nηχ −\n\nχ−\n\nηχ −\n\n1\nχ\n1\nηχ\n\nχ−\n\n1 2\nχ\n1\nηχ\n\n\n\n− 1 −\n\nχ−\n\nηχ −\n\n1\nχ\n1\nηχ\n\n2\n\n−1\n\n(46)\n\n.\n\nAs can be seen from (21) and (22), this is precisely the formula for the absorption as\ndefined in the bulk. We have thus verified that our two-point function satisfies the\noptical theorem.\nNote that elastic scattering and absorption processes contribute to the total crosssection at the same order in gs N. At low energies elastic scattering is suppressed,\nbut away from the conformal limit (ωR → 0) it has to be taken into account if one\nattempts to reconstruct the propagator directly from the absorption probability. This\nwas overlooked in [11].\nAnother point to notice is that it is the full two-point function (30) which contributes to (46), including the contact (analytic) terms arising from the second term\n18\n\n\fof (32) or (33). We noted before that these terms are peculiar because they are imaginary for real values of s. In field theory, analytic terms can arise from divergent\ndiagrams when using cut-off regularization, but it is hard to see how they could have\nan imaginary part for real values of s. Since the problematic terms are analytic, one is\ntempted to simply discard them. The puzzle, however, is that the resulting two-point\nfunction would no longer satisfy the optical theorem, Eq. (45).\nWe should stress that the appearance of this type of terms is not unique to our\napproach: the correlators derived in [37, 38] by means of an extrapolation of the\nGKPW recipe [2, 3] suffer from the same difficulty. This was not noticed in those\nworks, and neither was the tension between discarding these terms and satisfying\nthe optical theorem, since the authors of [37, 38] did not attempt to establish the\nrelation between their proposed two-point functions and the corresponding absorption\nprobabilities.\nThe presence of these bizarre terms is related to a phenomenon first pointed out by\nStokes [42]. The essential point is that both the GKPW recipe and our prescription\nextract\n√ the subleading coefficient in the large-r expansion of an expression of the type\nE(s, sr) (the expression in question is in our case the curved-space propagator G;\nsee (13)). The expansion is supposed to make sense for arbitrary complex values of\ns. For negative real s, in particular, the expansions of relevance to [37, 38] and the\npresent paper are all of the form\nE(s,\n\n√\n\nsr) ∼ L(s)\n\n1 −√−sr\n1 √−sr\ne\ne\n+\nS(s)\n,\nrp\nrp\n\n(47)\n\nwith p some constant. The prescriptions for two-point correlators employed by the\nauthors of [37, 38] and by us essentially extract the subleading coefficient, S(s). To\nreproduce the correct holonomy of the function E upon encircling the origin of the\ncomplex s-plane, the coefficients L and S develop peculiar properties. For instance,\nS can appear to be complex on the negative real s-axis, even if the function E is\nmanifestly real there11 .\nTaken at face value, the presence of imaginary analytic terms in the propagator\n(30) would appear to indicate a breakdown of unitarity in the dual theory. We\nbelieve, however, that there should exist a less radical interpretation. The simplest\npossibility is that these terms should be dropped. As we have explained above, the\nproblem would then be to understand why the resulting propagator fails to satisfy\nEq. (45). Alternatively, one could try to relax one of the assumptions employed\nin the derivation of Eq. (13). For instance, one could take into account the backreaction of the branes on the geometry, through the inclusion of tadpole diagrams.\nThis would entail the replacement of the flat-space propagator G0 in (13) with some\ncurved-space propagator G̃, which would presumably differ from G by the choice of\nboundary conditions. The net effect of this or any other potential resolution should\nbe to multiply ∆2 by an overall complex 'form factor' f (s), such that the resulting\n11\nAn example of this can be seen in the asymptotic expansion of the Bessel function Iν (z) - see,\ne.g., [43].\n\n19\n\n\fpropagator has a standard analytic structure. At the same time, a compensating\nchange should take place in the kinematic factors appearing in Eq. (45), to ensure\nthat the optical theorem is still satisfied.\nSince we have brought up the issue of back-reaction, we wish to emphasize before\nclosing this section that, in our opinion, the expectation that there could exist a\nduality generalizing the AdS/CFT correspondence amounts to the hope that the\nsum over diagrams in the dual theory with arbitrary numbers of loops will by itself\nreproduce the effects of the curved geometry. As explained in [29, 30], this hope\nultimately rests on open string– closed string duality (see [31] for a related discussion).\nAt any rate, given the conceptual difficulties inherent in placing explicit D-branes in\nthe curved background they themselves generate, it is surely important to see how far\none can develop a duality involving the worldvolume theory embedded in flat space.\n\n5\n\nA One-Point Function and the UV/IR Correspondence\n\nA key ingredient of holography is the ability of the hologram to encode the extra\ndimensions of the object it is meant to represent. In the standard AdS/CFT correspondence, the radial coordinate of AdS space is mapped to a scale in the CFT-\nphenomena at different scales in the lower-dimensional theory correspond to phenomena at different radii in the bulk. The larger the radius in AdS the smaller the length\nscale in the CFT. This has come to be known as the UV/IR correspondence [17, 18],\nand is a striking illustration of holography at work.\nAn interesting way to study the UV/IR correspondence is through an analysis of\nthe one-point function produced by an external source. As shown in [44] and further\nexamined in [45], a point source at fixed r ′ in the bulk of AdS space will manifest\nitself in the holographic dual, through an associated expectation value, as a blob with\na radius that goes like R2 /r ′ . The blob is extended if the source is deep down in AdS,\nand concentrated if it is close to the boundary (r ′ → ∞).\nThe physical interpretation of the source is more transparent if instead of a point\nsource we consider a string originating at infinity and terminating on the D3-branes.\nEach point on the string acts as a source for the field and contributes to the onepoint function. The total one-point function is obtained by integrating along the\nstring, and different parts of the string dominate at different length scales in the\nholographic dual. The result represents, from the point of view of the dual theory,\nthe one-point function in the presence of an external quark [45, 46]. While all of\nthis is well understood in the AdS case, it is the subject of the present section to\ninvestigate what happens if we use the full D3-brane metric. We will find that there\nare some interesting new phenomena in this more general setup.\nWe focus attention first on the case of a point source, located at some radial\nposition r ′ . If desired, it can be regarded as an infinitesimal segment of a string.\nThe one-point function for the entire string will be discussed a little bit later. For\n20\n\n\fG0\n\nG0\nr′\n\nhOφ i\n\nFigure 3: The one-point function in the presence of an external quark is computed with the\naid of a string. Each point on the string can be regarded as an individual source. A dilaton\ndetected at infinity may have originated from the string or from the D3-branes, through the\none-point function induced by the presence of the external source. See text for discussion.\nconcreteness, we consider a source for the dilaton s-wave. Proceeding as in the case\nof the two-point function, we write down the one-point function with the help of\n\u0010\n\n\u0011\n\nG (r, r ′ ) = G0 (r, r ′ ) + G0 (r, 0) ∆1, r′ q 2 ,\n\n(48)\n\nwhere G (r, r ′ ) (with r → ∞) is the supergravity propagation from the source out to\ninfinity, divided into a direct piece through flat space and a piece due to the induced\none-point function on the brane, ∆1, r′ = hOφ i, with Oφ the operator given in (10).\nThe situation is summarized in Fig. 3 (which depicts the entire string). The one-point\nfunction is thus computed using\n\u0010\n\n\u0011\n\nG (r, r ′ ) − G0 (r, r ′ )\n.\nr→∞\nG0 (r, 0)\n\n∆1, r′ q 2 = lim\n\n(49)\n\nThe subscript r ′ on the one-point function indicates the dependence on the radial\nposition of the source. Using the same notation and definitions as in Section 3, the\nresult can be written as\n\u0010\n\n\u0011\n\n∆1, r′ q 2 =\n\n\u0010\n\u0011\n4\n(1)\n(2)\ni(θ−θ0 ) 1\n(1)\n′\n′\n′\ne\nH\n(ν,\n−\nln\nr\n/R)\n−\nH\n(qr\n)\n+\nH\n(qr\n)\n.\n2\n2\nq 2 r ′2\nA\n\u0012\n\n\u0013\n\n(50)\n\nLet us now investigate this one-point function in the limit of large scales, i.e., the\nIR regime in the holographic dual. To do this we consider expression (50) in the\nlimit of small momentum, q ≪ 1/R, which implies large distances x after Fourier\ntransforming. We begin by considering qr ′ ≪ 1 but finite qR2 /r ′ . This includes the\ncase with a source deep inside the AdS region (i.e. r ′ ≪ R), and we therefore expect\nto recover the AdS result. We find that the one-point function takes the form\n\u0010\n\n\u0011\n\n∆1, r′ q 2 =\n\n\u0011\n\u0010\niπ\n(1)\n2\n′\n− 1,\nqR\n/r\nH\n4q 2 r ′2 2\n\n21\n\n(51)\n\n\fFor the purpose of\nwhere we have used the fact that A = − πR16i\n4 q 4 for small q.\nstudying the UV/IR correspondence it is useful to write down the one-point function\nfor spacelike momenta q 2 = −p2 , where it becomes\n\u0011\n\n\u0010\n\n∆1, r′ −p2 =\n\n\u0011\n\u0010\np2 R 4\n2\n′\n− 1.\nK\npR\n/r\n2\n2r ′2\n\n(52)\n\nThe Fourier transform,\n1\n(2π)3\n\nZ\n\n\u0011\n\n\u0010\n\nd3 pe−i~p*~x ∆1, r′ −p2 =\n\n15R8\nr ′−4\n,\n8π (x2 + R4 /r ′2 )7/2\n\n(53)\n\nclearly shows how the radial position of a point source is reflected in the holographic\ndual: the one-point function describes a blob whose width is of order R2 /r ′ . This is\nin accordance with the UV/IR correspondence.\nThe derivation above used p ≪ 1/R and pr ′ ≪ 1, and it is clear that there will be\nsmall distance modifications when x < R. However, expression (53) will be valid as\nlong as x ≫ r ′ even if r ′ is not small, i.e., even if it is outside of the AdS region. On\nthe other hand, if r ′ ∼ x we conclude that the one-point function may be corrected\neven at large distances. To find out how, we need to consider the one-point function\nfor p ≪ 1/R, finite pr ′ and hence pR2 /r ′ ≪ 1. This gives\n\u0010\n\n\u0011\n\n∆1, r′ −p2 =\nwhere we have made use of the fact that\ntransforming in p we get\n\n16R4 p2\nK2 (pr ′ ) ,\n3r ′2\n\n(54)\n\n2πiR4 p4\n3\n\nfor small p. After Fourier\n\nB\nA\n\n−1 ∼\n\n\u0011\n\u0010\n20R4\n1\n1 Z 3 −i~p*~x\n2\n′\n=\n−p\nd\npe\n∆\n1,\nr\n3\nπ (x2 + r ′2 )7/2\n(2π)\n\n(55)\n\nfor large r ′ . Interestingly, the UV/IR correspondence is now reversed, with the size\nof the blob increasing with the radial position. To summarize: as a source is moved\nto ever larger values of r ′ , the blob first decreases in size, in accord with the usual\nUV/IR correspondence. But as the source leaves the AdS region, the blob reaches a\nminimal size of order R and then starts to grow again. According to the standard\nUV/IR correspondence, the region deep inside of AdS corresponds to the IR of the\nholographic dual, while the region close to the boundary of AdS corresponds to the\nUV. With AdS as part of a full three-brane background we can proceed even further\nout, and according to the above reasoning we will again encounter a region of space\nthat will influence the IR behaviour of the holographic dual. In the concluding section\nof the paper we will have more to say on the nonstandard UV/IR properties of D3brane holography, and possible connections with non-commutative geometry.\nIn view of the modified UV/IR correspondence that we have observed in the D3brane background, it is also important to consider the result of integrating over the\nsource position, r ′, along the entire string. As discussed above, this corresponds to\n22\n\n\fdetermining the expectation value of the operator dual to the dilaton s-wave, Eq. (10),\nin the presence of an external quark. In the AdS limit we find that\n\u001c\n\n1 2\nF\n4\n\n\u001d\n\n1\n1\n= √ hOφ i =\ndt′ dr ′ ∆1, r′ (x)\n4πα′\n2κ\nZ\nZ\n\u0011\n\u0010\nd4 k −ik0 t′ −i~k*~x\n1\n′\n′\n2\n2\n~\n′\ndt\ndr\n=\ne\n∆\nk\n−\nk\n1, r\n0\n4πα′\n(2π)4\nZ\n\n1\n=\n4πα′\n\nZ\n\n0\n\n∞\n\ndr\n\n′\n\nZ\n\n(56)\n\nq\n\n2gY2 M N\nR\nd k −i~k*~x\n2\n~\ne\n∆1, r′ −k =\n=\n,\n16π 2 α′ x4\n16π 2 x4\n(2π)3\n3\n\n\u0010\n\n\u0011\n\n2\n\nwhere we have used that the time integral enforces k0 = 0. Note the √12κ in the first\nequality which cancels a similar factor in the charge density of the string. These\nfactors come about since we are using a canonically normalized dilaton. The result\nof the calculation is indeed in agreement with [45], apart from the factor of two\nmentioned in Section 4.\nWhat happens if we take into account the portion of the string that lies outside\nof the AdS region? Through the reversed UV/IR correspondence, this threatens to\nchange the large scale behaviour of the one-point function. However, for a given scale\nx ≫ R, one can easily estimate the modifications of hOφ i due to portions of the string\nwith r ′ > x, by comparing the integral of (53) and (55) from r ′ = x to r ′ = ∞. This\nshows that any modification will be at most of order 1/x6 , and the coefficient of the\nleading 1/x4 term will therefore not be modified.\nIt would also be interesting to consider the high energy or small distance behaviour\nof the one-point function. For this we would need to investigate the one-point function\n(50) in the limit where q 2 = −p2 becomes large and negative. This we have not done;\nin Section 4 we have already discussed some difficulties in extracting this limit.\n\n6\n\nHigher Correlation Functions\n\nThe prescription for two-point functions derived in Section 3 extracts information\nfrom the brane geometry by probing it with a bulk correlation function evaluated at\npoints at asymptotic distances from the brane. No relation was assumed between\nthe radial positions of these points. For n-point functions we may formulate our prescription in the same way, but it is convenient and perhaps more natural to compute\ncorrelators between points on a common cutoff surface. Then we can formulate rules\nfor computing brane n-point functions motivated by the same reasoning as before\n(see Fig. 4):\n1) Introduce a cutoff surface at r = rΛ .\n2) Draw all curved space Feynman diagrams for the n-point correlation function\nof the appropriate supergravity fields. Work in position space for r and in\nmomentum space for xμ . The n external legs have one end at r = rΛ , and carry\nfour-dimensional momenta k1 , . . . , kn .\n23\n\n\f3) Replace the propagators G(ki ; rΛ , r) associated with external legs by G∆ (ki ; rΛ , r),\nwhere G∆ = G − G0 , with G0 the corresponding flat space propagator.\n4) Amputate each external leg, dividing by G0 (ki ; rΛ , 0).\n5) Take the limit rΛ → ∞.\n\nCombining rules 3) and 4), the factor on each external leg becomes\nG∆ (k; rΛ , r)\nG0 (k; rΛ , 0)\ni(θ−θ0 )\ne\nφ1 (r) − 2Aφ01 (r)\n=\n2Aφ01 (0)\ni(θ−θ0 )\nei(θ−θ0 ) φ2 (r) − φ02 (r)\ne\nφ3 (r) − φ03 (r) + B\nA\n.\n=\nφ01 (0)\n\n∆1, r (k 2 ) =\n\nlim\n\nrΛ →∞\n\n(57)\n\nThe notation here is the same as in Section 3. This factor effectively removes processes\nwhere the external leg is unaffected by the presence of the brane. We thus restrict\nattention to processes where all external lines touch the brane, and from these we\nextract the physics on the brane.\n\nG∆\n\n❆ k1\n❆❯\n\nk3 ✁\n✁☛\n\nG∆\n\nr = rΛ\n\nG∆\n\nG\n✕✁\n✁ k2\n\n❆❑\n\nk4 ❆\n\nG∆\n\nFigure 4: The prescription for n-point correlators: Introduce a cutoff surface at asymptotic\nradial coordinate r = rΛ . In each of the Feynman diagrams for the n-point correlation\nfunction of the appropriate supergravity fields, replace all curved space propagators G\nassociated to external legs by G∆ = G − G0 . Amputate each external leg, dividing by G0 .\nSee text for a more precise description.\n\nAs an example we write down the case of the three-point function\nR √\n−gdrG∆ (k1 ; rΛ , r)G∆ (k2 ; rΛ , r)G∆ (k3 ; rΛ , r)V3\n,\n∆3 (k1 , k2 , k3) = r lim\nΛ →∞\nG0 (k1 ; rΛ , 0)G0 (k2 ; rΛ , 0)G0 (k3 ; rΛ , 0)\nobtained from the corresponding supergravity three-point function\nZ\n√\nG3 (k1 , k2, k3 ; r1 , r2 , r3 ) =\n−gdrG(k1 ; r1 , r)G(k2; r2 , r)G(k3 ; r3 , r)V3 ,\n24\n\n(58)\n\n(59)\n\n\fwhere V3 is the supergravity three-vertex, which generally may involve the metric,\nmomenta in the brane directions and derivatives in the transverse dimensions.\nWe now want to check that these n-point functions agree with known results in the\nconformal limit, which amounts to showing that the integrals reduce to AdS integrals\nin the low energy limit qR → 0. To do this more information on the solutions φi\nand φi0 is needed. We give the arguments for the three-point function, but one can\nrepeat the same steps for any tree diagram, at least for any diagram with interaction\nvertices directly connected to external legs. For six-point functions and higher there\nare other diagrams, and the argument is not complete in its present form.\nWe may use the asymptotics of the Mathieu functions obtainable through the\nseries expansion (100) described in Appendix A, in the limit of small qr. To facilitate\ncomparison with the AdS literature we use Euclidean q 2 = −p2 and find\n\u0011\n\u0010\np2 R 4\npR2\n2\n′\n∆1, r (−p ) →\n−\n1\n→\n−\nK\npR\n/r\n2\n2r ′2\n2r\n2\n\n!2\n\n.\n\n(60)\n\nWe note that ∆1, r (k 2 ) vanishes for r ≫ pR2 (if pr ≪ 1 ). As demonstrated below the\ncontribution from the outer region, pr ≥ 1, is suppressed for low energies. Thus the\neffective upper limit of integration for the three-point function in Eq. (58) goes to\nzero in the low energy limit, and we may use the near horizon limit of the integration\nmeasure to find\nT\n∆CF\n(k1 , k2 , k3 ) ∼ κR2\n3\n\nR8\n= κ\n8\n\nZ\n\n\u0010\n\nZ\n\ndrr 3V3 ∆1, r (q12 )∆1, r (q22 )∆1, r (q32 )\n\ndzz −5 p21 z 2 K2 (p1 z) − 2\n\n\u0011\u0010\n\np22 z 2 K2 (p2 z) − 2\n\n\u0011\u0010\n\n(61)\n\u0011\n\np23 z 2 K2 (p3 z) − 2 ,\n\nwhich scales as q 4 in the low energy limit. We recognize the AdS form of the threepoint function with the bulk-to-boundary propagator p2 z 2 K2 (pz). The subtractions\nfound automatically in our approach may look unfamiliar, because they are not always\nexplicitly mentioned. They are however necessary to obtain the final finite conformally\ninvariant results given for instance in [47, 4]. They are all independent of at least\none momentum (or at least one relative distance, in position space). Just as in\nthe case of the two-point function, our approach automatically produces a finite\nanswer, in contrast to the standard AdS calculations that require renormalization.\nSince the region of integration that contributes is entirely within the AdS region,\nany supergravity vertex V3 that yields a conformally invariant three-point function\nin the AdS case, will do so in our low energy limit, no matter how complicated it\nis. The three dilaton vertex,the dilaton-TrF 2 coupling, our normalization of F and\nκ/R4 ∼ 1/N then give\nE\nD\n1\nTrF 2 TrF 2 TrF 2 ∼\n,\n(62)\nN\nas expected.\nTo see why the region r ≤ pR2 dominates low energy behaviour we need a qualitative understanding of the wave solutions φi (r). This may be obtained directly from\n25\n\n\ftheir equation of motion [11], written in terms of ρ = ln Rr ,\nn\n\no\n\n∂ρ2 + 2(qR)2 cosh 2ρ − 4 e2ρ φi (Reρ ) = 0 ,\n\n(63)\n\nwhich can be thought of as a one dimensional Schroedinger equation with a potential\nbarrier. For small qR there is oscillatory behaviour for 2r < qR and for qr > 2. The\nwaves tunnel through the barrier between the turning points with an approximate\namplitude φ(r) = C + DR4 /r 4 inside the barrier. For the solution φ1 , which is\npurely ingoing for small r, almost all the incident wave is reflected and the amplitude\ndoes not grow from the exterior region towards the interior region. This means that\nC ≫ D. For the exterior region we use Eqs. (100), (58) and (19), which give\nIext ∼\n\nZ\n\n1/q\n\nr\n\n5\n\n(1)\n4\n2 4\n2 4\n2 H2 (q1 r)\ndrq1 ∆2 (q1 )q2 ∆2 (q2 )q3 ∆2 (q3 )\n(q1 r)2\n\n(1)\n\n(1)\n\nH2 (q2 r) H2 (q3 r)\n∼ q 6 , (64)\n(q2 r)2\n(q3 r)2\n\nusing ∆2 (q 2 ) = O(q 0 ). The contribution from the barrier region is obtained by\nmatching to the exterior solution at the exterior turning point:\nIbar ∼\n\nZ\n\n1/q\n\nR\n\nr 5 drq1 4 q2 4 q3 4 ∼ q 6 ,\n\n(65)\n\nusing also Eq. (97). We find as promised that the conformal result (62) from the\ninterior region dominates at low energies.\n\n7\n\nThe Quark-Antiquark Potential\n\nIn the standard AdS5 /CFT4 correspondence, an external quark in SYM is dual to a\nstring in the bulk of AdS space. This identification leads to a natural recipe [48, 49]\nfor computing Wilson loops in the strongly-coupled gauge theory,12 which has been\nexploited to obtain numerous interesting results (see [51, 4] for a review of some of\nthem). In the present section we wish to generalize the Wilson loop prescription of\n[48, 49] to our setting, and use it to determine the quark-antiquark potential in the\nholographic theory.\nThe motivation for relating strings in the bulk theory to external sources in the\nfour-dimensional theory is of course the same as in the AdS case. Start with N + 1\ncoincident D3-branes, and pull one brane out to a finite separation rΛ , by giving a\nvacuum expectation value to the appropriate worldvolume scalar field. This breaks\nU(N + 1) → U(N) × U(1). A string connecting the solitary brane to the stack\nof N branes represents a W-boson of the spontaneously broken gauge theory [52].\nIn the supergravity picture, the N D3-branes are replaced by the black three-brane\nsolution, so the W-boson corresponds to a string extending from the solitary D3-brane\nat r = rΛ down to the horizon at r = 0. In Section 5 we have already made use of\nthis representation to determine the field around a point source in the dual theory.\n12\n\nSee also [50] for a detailed discussion and refinement of the recipe.\n\n26\n\n\fWe describe the dynamics of a fundamental string through the Nambu-Goto action\nSF = −TF\n\nZ\n\nq\n\nd2 σ −g (i) ,\n\n(66)\n\nwhere g (i) is the pullback of the spacetime metric (3) to the string worldsheet, and\nTF = 1/2πls2 is of course the string tension. We make a static gauge choice σ 1 =\nr, σ 2 = t, and restrict attention to static configurations of the form X(r) (where x is\none of the spatial directions parallel to the D3-branes), with the string pointing along\na fixed S5 direction. In most of the discussion it will be convenient to use an inverted\nradial coordinate z = R2 /r. The generic static solution,\nX(z; zm ) = ±\n\nZ\n\nzm\nz\n\ndz\n\nz 4 + R4\nq\n\n4 − z4\nz 2 zm\n\n,\n\n(67)\n\ndescribes a string lying along a geodesic which starts and ends at the location of the\nprobe D3-brane, r = rΛ (z = zΛ ), and extends down to a minimum at r = rm (a\nmaximum at z = zm ), as shown in Fig. 5a. We will eventually take rΛ → ∞, to\nremove the probe brane. The endpoints of the string on this brane are separated by\na distance\nZ zm\nz 4 + R4\n∆X(zΛ ; zm ) = 2\ndz q\n.\n(68)\n4 − z4\nzΛ\nz 2 zm\n\nFor large r the ambient space becomes flat, so the string of course just lies along a\n2\nstraight line, with slope ∆x/∆r = R2 /zm\n. The total energy of the string is\nU(zΛ ; zm ) = 2TF R\n\n2\n\nq\n\nR4\n\n+\n\n4\nzm\n\nZ\n\ndz\n\nzm\n\nzΛ\n\nq\n\n4 − z4\nz 2 zm\n\n.\n\n(69)\n\nThe string we have just described corresponds to a W-W̄ pair in the U(N) ×\nU(1) theory, i.e., a quark-antiquark pair from the perspective of the U(N) theory.\nAs a simple check, notice that if we send zm → ∞ holding zΛ fixed, (69) reduces\nto 2TF R2 /zΛ = 2TF rΛ , which is the correct energy for two infinitely separated Wbosons13 . In the 'D-branes + flat space' picture, the situation is as portrayed in\nFig. 5b. The stack of N D3-branes and the solitary brane are separated by a distance\nrΛ , with two strings of opposite orientation running between them. The endpoints\nof these strings which lie on the N D3-branes constitute a quark-antiquark pair in\nthe worldvolume theory, and so attract one another. As a result of this attraction,\n2\nthe strings are tilted by an angle α = arctan(R2 /zm\n). The endpoints on the probe\nbrane are held in place by an external agent which enforces the appropriate Dirichlet\n13\n\nIncidentally, notice that this equality between the total energy of a purely radial string in the\ncurved background and the corresponding W-boson provides a canonical way to identify the radial\ncoordinates in the curved and flat backgrounds. This is significant for the prescription for correlation\nfunctions presented in Sections 3 and 6, which involves a comparison of the curved and flat space\npropagators.\n\n27\n\n\fr\nr = rΛ\n\n✛\n\n✻\n\n✲\n\n∆X\n\n✛\n\n∆X\n\n✲\n\nrΛ\nα\n\n❄\n\n✛ L ✲\n\nr = rm\n\na\n\nb\n\nα\n\nx\n\nFigure 5: a) 'Hanging string' lying along a geodesic of the curved three-brane geometry.\nThe endpoints of the string lie on a probe D3-brane at r = rΛ . This is the supergravity\nrealization of a W-W̄ pair in the U (N ) × U (1) gauge theory. b) The same system in the\n'branes + flat space' picture: two strings of opposite orientation connect the stack of N\nD3-branes to a solitary brane a distance rΛ away. The endpoints of the strings on the stack\nof D3-branes constitute a quark-antiquark pair. See text for discussion.\n\nboundary conditions [50]. Because of the tilt, the separation L between the quark\nand the antiquark is (for large rΛ ) much smaller than that between the endpoints on\nthe solitary brane. As seen in Fig. 5b, the two distances are related by\nL = ∆X(zΛ ; zm ) − 2rΛ tan α = ∆X(zΛ ; zm ) −\n\n2R4\n.\n2\nzΛ zm\n\n(70)\n\nWe are now ready to compute the quark-antiquark potential. Since we are interested in taking the limit zΛ → 0 to remove the probe brane to infinity, we first carry\nout a Laurent expansion of (68) about zΛ = 0, writing\n∆X(zΛ ; zm ) = R\n\n4\n\nZ\n\nzΛ\n\nR4\n= 3\nzm\n\n2dz\n\nzm\n\n(Z\n\n0\n\nq\n\n4 − z4\nz 2 zm\n\n1\n\n+\n\nZ\n\nzm\nzΛ\n\n\"\n\n#\n\n2z 2 dz\nq\n\n4 − z4\nzm\n\n.\n\n(71)\n\n)\n\ndζ\n2\nzm\n√\n− 2 + zm\n−2 +2\n2\n4\nζ\nzΛ\n1−ζ\n\nZ\n\n1\n0\n\n2ζ 2 dζ\n√\n+ ...,\n1 − ζ4\n\nwhere we omit terms involving positive powers of zΛ . The two integrals can be carried\nout analytically, yielding 2 −c and c, respectively, with c = (2π)3/2 /[Γ(1/4)]2 ≃ 1.198.\nWe are thus left with\nR4\n2R4\n+\nc\nz\n−\n∆X(zΛ ; zm ) =\nm\n3\n3\nzΛ zm\nzm\n28\n\n!\n\n+ ...\n\n(72)\n\n\fUsing this in (70) we obtain a relation between the quark-antiquark separation L and\nthe geodesic parameter zm ,\nR4\nL(zm ) = c zm − 3 ,\nzm\n!\n\n(73)\n\nwhich is perfectly well-defined in the limit zΛ → 0.\nWe next Laurent-expand (69),\nTF R2 q 4\n4\nU(zΛ ; zm ) =\nR + zm\n3\nzm\n= 2TF\n\nR2\nzΛ\n\nq\n\n(Z\n\n4\nR4 + zm\n2\nzm\n\n1\n\n0\n\n−c\n\n\"\n\n)\n\n#\n\ndζ\n2\nzm\n√\n− 2 + ...\n−2 +2\n2\n4\nζ\nzΛ\n1−ζ\nTF R2 q 4\n4 + ...\nR + zm\n3\nzm\n\n(74)\n\nThe leading term diverges in the limit zΛ → 0, but it is clearly just the energy\n2TF rΛ sec α of the two straight strings in Fig. 5b. We are interested only in the\nenergy E which arises from the U(N) interaction between the quark and antiquark,\nso we subtract this leading term and obtain14\nTF R2 q 4\n4 .\nE(zm ) = −c 3\nR + zm\nzm\n\n(75)\n\nEqs. (73) and (75) give the quark-antiquark potential E(L) in implicit form. The\npotential is plotted in Fig. 6.\n√E(L)\n2\n\ngY M N\n\n2\n\n4\n\n6\n\n8\n\n10\n\nL\n\n-0.05\n-0.1\n-0.15\n-0.2\n-0.25\n-0.3\n-0.35\n-0.4\n\nFigure 6: Quark-antiquark potential E(L) in the holographic theory (in R=1 units). For\nlarge L, the potential agrees with that of N = 4 SYM (dashed line). For short distances\nthere is confining behaviour.\nFor large q q̄ separation, L ≫ R, both (73) and (75) reduce to the corresponding\nAdS relations [48, 49], so as required the IR limit of the potential coincides with the\n14\n\nJust like in the AdS case, the energy associated with the U (1) interaction between the string\nendpoints on the solitary brane is negligible in the strong 't Hooft coupling regime.\n\n29\n\n\fconformal N = 4 potential,\nc2\nEIR (L) = − √\n2π\n\nq\n\ngY2 M N\nL\n\n.\n\n(76)\n\nHere we have made use of the relation R4 = 2gY2 M Nls4 to write the result exclusively\nin terms of gauge theory quantities.\nAt the opposite extreme, notice from (73) that, surprisingly, L → 0 as zm →\nR. Geodesics with zm < R thus appear to give no direct information about the\nquark-antiquark interaction in the U(N) theory. Since these geodesics are completely\noutside the throat region z ≥ R, this is yet another indication that the flat space\nregion is in a sense left out of the holographic theory. This is as expected from the\ndecoupling argument of Section 2, and is indeed consistent with what we have found\nfor correlation functions in Sections 3 through 6. The short-distance quark-antiquark\npotential is\nq\nq\nc gY2 M N\ngY2 M N\nEU V (L) = −\n+\nL.\n(77)\nπR\n2πR2\nThis expression is again written only in terms of parameters of the q\ngauge theory,15\nand displays confining behaviour with a confining string tension σ = gY2 M N /2πR2 .\n√\nFrom the supergravity perspective this result is not surprising, as σ = TF / 2 is\nsimply the tension of a fundamental string located at r = R.\nFrom (73) and (75) it follows that the quark and antiquark attract one another\nwith a force\nTF R2\n∂E\n.\n(78)\n=q\n4\n∂L\nR4 + zm\nAs a consistency check on our approach, we note that this equals the force ∂U/∂∆X\nobtained from the unsubtracted expressions (68) and (69) in the zΛ → 0 limit.\n\n8\n\nThe Baryon\n\nIn the preceding section we have seen how the AdS picture of a quark-antiquark pair\ncan be generalized away from the conformal limit. We now wish to point out that\nit is also possible to extend the AdS description of the baryon [53, 54, 55, 56] to our\nsetting.\nIn the AdS5 /SYM4 correspondence, the SU(N) baryon (the color-neutral coupling of N external quarks) is dual to N fundamental strings stretching from the\nAdS boundary to a D5-brane wrapped around S5 [53, 54]. To provide a thorough\ndescription of this system it is necessary to analyse the full worldvolume action for\nthe D5-brane embedded in AdS5 × S5 . The baryon is then seen to be realized as a\n15\n\nRecall that R itself is present as a parameter in the gauge theory away from the conformal limit,\nas seen in (7).\n\n30\n\n\fparticular class of BPS D5-brane embeddings [55, 56, 57, 58], in which the N strings\nappear as Born-Infeld string tubes [59, 60].\nIn our case, then, to obtain a picture of the baryon we must consider a D5-brane\nembedded in the full three-brane background. It was shown in [56, 57, 61] that this\nsystem has a one-parameter family of BPS solutions of the form ζ = ζ(ξ; ζΛ), where\nζ = −r cos θ, ξ = r sin θ, with θ the polar angle on S5 . These embeddings have a flat\nportion and (for ζΛ > 0) a tubular region, which as explained in [56] represent a flat\nD5-brane located at ζ = ζΛ , and a bundle of N Born-Infeld strings, respectively (see\nFig. 7).\nζΛ = 10R\n\nζΛ = 6R\n\nFigure 7: Family of D5-branes embedded in the full D3-brane geometry. The solutions extend along r and the S5 directions, and lie at a fixed position along x. They are parametrized\nas ζ = ζ(ξ; ζΛ ), where ζ = −r cos θ, ξ = r sin θ, with θ the polar angle on S5 . ζΛ denotes\nthe vertical position of the flat region of the D5-brane. The tubular portion of the brane,\nin the limit ζΛ → ∞, is dual to the baryon of the holographic theory.\n\nWe propose that these solutions are dual to the baryon of the holographic theory,\nwith the understanding that the flat D5-brane at ζ = ζΛ plays the same role as the\nsolitary D3-brane at r = rΛ in the quark-antiquark case, and should therefore be\nremoved by taking ζΛ → ∞. For large ζΛ , the lower portion of the tube is close to\nr = 0, and coincides with the AdS baryon embedding. This is a necessary condition\nfor the large-distance field of the baryon to reduce to that of the SYM theory16 . In\nthe limit ζΛ → ∞, the Born-Infeld tube becomes infinitely thin.\nIt was demonstrated in [56, 57] that the energy of the tube (obtained from the full\nenergy by subtracting the infinite contribution of the flat portion) is exactly equal\nto the energy of N fundamental strings of length ζΛ . Since these strings represent\nthe baryon's constituent quarks, it follows that the D3 baryon (just like its AdS\ncounterpart) has zero binding energy, as expected from the BPS character of the\nconfiguration.\n16\n\nThe latter was computed in [46]. It would be interesting to repeat that calculation in our\nnon-conformal setting, employing reasoning similar to that of Section 5.\n\n31\n\n\f9\n\nDiscussion\n\nBased on the assumption that there exists some theory which holographs the full\nasymptotically flat three-brane background, in this paper we have developed methods\nfor computing quantities in the dual theory in terms of supergravity. Concretely, in\nSection 6 we have presented a calculational recipe for arbitrary n-point correlators in\nthe holographic dual. The particular case of two-point functions of the operators Oφ\ncoupling to dilaton partial waves was analysed at length in Sections 3 and 4. Threepoint functions were discussed in Section 6, and a one-point function in the presence\nof a source was examined in Section 5. Additionally, in Section 7 we have employed\na 'hanging' string to determine the potential energy of an external quark-antiquark\npair in the dual theory, and in Section 8 we have commented on the representation\nof baryons as deformed D5-branes.\nIn addition to its derivation, we have presented several non-trivial checks of our\nrecipe for correlation functions. First, the correlators we obtain reduce to N = 4 SYM\ncorrelators in the extreme low-energy limit. Second, the two-point functions of operators dual to dilaton partial waves are related to the corresponding exact absorption\nprobabilities [11] through the appropriate optical theorem. Third, our prescription\nincorporates a natural subtraction and amputation procedure which automatically\nremoves potential UV divergences and renders the correlators well-defined.\nDespite these nice features, our results are not entirely satisfactory. The correlators we obtain appear to include terms which are analytic functions of the momenta\nwith imaginary coefficients. As explained in Section 4, their presence is related to the\nso-called Stokes phenomenon [42], which in some cases forces subleading coefficients\nof the asymptotic expansion of a real function to take on complex values. We should\nemphasize that the appearance of such terms is not unique to our approach: the twopoint functions derived in [37, 38] using the GKPW recipe [2, 3] suffer from the same\nproblem (a fact which was not noticed in those works). Given that the problematic\nterms are analytic in momentum-space, and therefore amount to contact terms, one\nis tempted to simply drop them from the correlators. This would indeed yield n-point\nfunctions with sensible analytic structure. The only problem is that these same contact terms appear to be necessary for two-point functions to be correctly related to\nthe corresponding absorption probabilities, as dictated by the optical theorem. We\nhave discussed this puzzle in Section 4, as well as some of its possible resolutions.\nOur work was motivated by a series of recent papers [10, 16, 11, 12] addressing\nthe possible generalization of the AdS5 /SYM4 correspondence away from the conformal limit ωR → 0. As explained in Section 2, the authors of [10, 16, 11] espouse\nthe view that physics on the full three-brane background is encoded in the D3-brane\nworldvolume action (an insight which was implicit already in [7]). Through considerations of symmetries and large anomalous dimensions, Gubser and Hashimoto [11]\nwere led to conjecture that, for strong 't Hooft coupling, this worldvolume theory is\nsimply N = 4 SYM deformed in the infrared by a specific dimension-eight operator,\nas indicated in (7). They advocate a duality between this theory and supergravity\n\n32\n\n\fin the full three-brane background, which is supposed to hold in the limit gs → 0,\ngs N → ∞.\nWe wish to stress that our work does not rely on the specific form of the conjecture\nof [11]. Since our calculations are based on the supergravity side of the duality\nrelation, the physical quantities we compute pertain to whatever theory turns out to\nbe dual to the curved space description, even if it is not precisely of the form (7). We\nregard our work as a step towards the more precise specification of this theory, and it\nis an outstanding challenge to reproduce our results through an explicit field theory\ncalculation.\nOn the other hand, it should be noted that our approach is in accord with the\nperspective of [10, 16, 11] in two important respects: first, throughout the paper we\nexplicitly assume that the worldvolume theory of D3-branes (or at least some localized\n(3 + 1)-dimensional object) is relevant for the duality; second, for the most part we\nrestrict attention to the limit gs → 0. These two assumptions play a role both in our\nderivation of the recipe for two-point functions in Section 3, and in our formulation\nof the optical theorem in Section 4.\nThe duality we have studied in this paper operates between two alternative descriptions of physics in the presence of a system of N ≫ 1 branes: on the one hand,\nsupergravity on the curved three-brane background; on the other hand, the D3-brane\nworldvolume theory coupled to supergravity in the bulk of flat (9 + 1)-dimensional\nspace. We are interested in this system at finite ωR, since ωR → 0 is just the usual\nMaldacena limit [1]. An important aspect that follows from our analysis (see Section\n3) is that, for large gs N, the worldvolume theory does not decouple from the bulk even\nif gs → 0. As a result, n-point correlators of operators in the lower-dimensional theory receive contributions from virtual particles propagating in the higher-dimensional\nspace, which cannot be disentangled from those entirely confined to the brane. As\nexplained in Section 4, such higher-dimensional processes also have an impact on the\nform of the optical theorem connecting two-point functions to absorption probabilities, a fact which was overlooked in [11].\nThe lack of a complete decoupling should not be mistaken for the absence of\na duality. It does however indicate that, in contrast with the AdS/CFT case, the\n'gauge theory' side of the duality in question necessarily involves both the worldvolume\ntheory and supergravity in flat space. Of course, as gs → 0 the latter theory becomes\ntrivial- free fields propagating in (9 + 1)-dimensional flat space. Roughly speaking,\nthis trivial part of the system describes the free fields on the asymptotically flat part\nof the three-brane geometry, while the worldvolume theory encodes all the non-trivial\nphysics in the throat (which includes much more than the near-horizon geometry\nrelevant to the standard AdS/CFT correspondence [1]). If correct, this is undoubtedly\na very profound statement. In particular, it still seems appropriate to us to speak\nof 'holography', given that the non-trivial aspects of a higher-dimensional theory are\nencoded in the dynamics of a theory which is essentially four-dimensional.\nIntriligator [12] has argued that the duality conjectured by Gubser and Hashimoto\nshould in fact be expected to hold for arbitrary gs and N. In Section 2 we have\n33\n\n\freviewed his arguments and commented on the problematic aspects of his proposal.\nHere we wish to emphasize that Intriligator arrived at his conjecture by means of\nscaling and non-renormalization arguments which do not explicitly bring the two\nalternative D-brane descriptions into play. While he asserts that the dual theory is of\nthe form (7), he does not identify it with the D3-brane worldvolume theory. This could\nperhaps be viewed as a weakness of his proposal, but it enables him to take the view\nthat the four-dimensional theory whose Lagrangian is (7), is by itself (without any\ncoupling to a higher-dimensional theory) dual to the entire three-brane background.\nWhile we approach the problem from a different perspective, the interesting question\nremains whether there could exist a purely four-dimensional theory which holographs\nthe full asymptotically flat geometry. From our analysis it is clear that such a theory\nwould necessarily be more than a pure D3-brane worldvolume theory, for it would\nhave to summarize the effective theory on the branes, free supergravity in (9 + 1)dimensional flat space, and the interaction between them. In such a theory our\ncorrelators would be seen to follow from a strictly four-dimensional calculation.\nIn this connection, we cannot resist commenting on the similarity between certain\naspects of our results and some recent analyses of non-commutative field theories. A\nfirst point to notice is the potential connection of our work and that of Maldacena\nand Russo [38], who studied certain supergravity backgrounds which are the putative\nduals of large N non-commutative gauge theories (this was first done in [62]). The\nbackgrounds in question are obtained as decoupling limits of the solution describing\nN D3-branes in the presence of a constant B field - the same limit which on the\ngauge theory side gives rise to the non-commutative description [63]. Among other\nthings, the authors of [38] computed a two-point correlator of a certain component\nof the gauge theory energy-momentum tensor, employing an extrapolation of the\nGKPW recipe [2, 3]. Interestingly, the relevant supergravity field (restricted to be\nindependent of time and one spatial direction) satisfies an equation which is identical\nto that of a dilaton propagating on the full (zero B field) asymptotically flat D3brane background! As a result, the correlator obtained in [38] is essentially the same\nas that computed by us in Section 3, and expressed in Eq. (29). Maldacena and\nRusso also determined the shape and energy of strings lying along geodesics of their\ngeometry; the relevant equations happen to have the same form as those considered\nby us in our study of the quark-antiquark potential (see Section 7). It is too soon\nto tell whether these remarkable similarities are merely accidental or indicate some\nunderlying connection. It should be emphasized that the backgrounds studied in\n[62, 38] are completely different from ours: not only is there a non-vanishing B field\n(whose magnitude is in fact taken to diverge in the decoupling limit), but also a dilaton\nwith non-trivial dependence on the radial coordinate. Still, it is interesting to note\nthat, as pointed out in [62], the Einstein frame metric in one case is asymptotically\nflat.\nThere is yet another feature of our results which is suggestive of a relation to\nthe non-commutative case: the presence, in what is otherwise a four-dimensional\ntheory, of virtual particles propagating in a higher-dimensional space. This closely\n34\n\n\fresembles a phenomenon encountered in recent studies of non-commutative perturbative dynamics [64, 65] (see also [66]–[76]). In that context, the basic observation is\nthat while the non-commutativity removes the usual UV field-theoretic divergences,\nit gives rise (even in a massive theory) to peculiar IR divergences. The latter represent novel long-distance effects which in fact arise from the short-distance degrees of\nfreedom- an intriguing phenomenon known as UV/IR mixing [64, 65]. To capture\nthe correct long-distance physics in a Wilsonian description of the theory with an\nexplicit UV cutoff, it is then necessary to introduce additional fields which reproduce\nthe unfamiliar IR singularities. Some of these fields have propagators which can be\nnaturally interpreted as describing particle propagation in a higher-dimensional space.\nThis suggests an analogy with string theory, associating the lower-dimensional fields\nwith open strings attached to a brane, and the higher-dimensional fields with closed\nstrings which can propagate outside the brane17 . There is thus a clear parallel with\nthe 'branes + flat space' description of our system, which incorporates worldvolume\nand bulk degrees of freedom in manifest correspondence with massless modes of open\nand closed strings, respectively.\nThe imprint of UV/IR mixing is seen also in the context of our discussion of the\nUV/IR correspondence in Section 5. As explained there, a point-like source located\nat radial position r = r ′ in the bulk makes its primary contribution to a one-point\nfunction in the dual theory at a length scale L(r ′ ) which is essentially the maximum\nof R2 /r ′ and r ′ . This means in particular that the r ′ → ∞ region, which would be\nnaturally interpreted as a high-energy region in the holographic dual, can in fact give\nrise to the large-distance effects.\nWe reiterate that all similarities with the non-commutative case might amount\nto no more than an intriguing analogy. It is however tempting to speculate that\na) perhaps there exists a purely four-dimensional theory which holographs the entire\nthree-brane background (flat region included), and b) possibly this theory incorporates some type of non-commutativity. The dual description that we have directly\nscrutinized - the one which follows directly from D-brane reasoning - could then\nbe regarded as a reformulation of the non-commutative dual in terms of two coupled components: a Wilsonian worldvolume effective action (which according to [11]\nis given by (7), with a cutoff of order 1/R), and the (9 + 1)-dimensional flat space\nsupergravity action, encoding the additional long-distance effects. This interpretation would be in line with the fact that, as explained in Sections 4 and 5, there is\na subtlety in extracting low-energy results from the supergravity description. If we\nregard AdS space as the r → 0 portion of the full three-brane geometry, carry out\ncalculations in the complete background, and then take the low-energy limit, the results do not necessarily agree with those obtained in a space which is purely AdS\nfrom the beginning. In the 'branes + flat space' side of the duality, the issue is\nwhether or not one includes the contribution of the virtual particles which propagate\noff the branes. In the hypothetical strictly four-dimensional description, this would\n17\n\nIn situations where the non-commutative field theory is a limit of string theory [63], this could\nperhaps be more than just an analogy [65, 69] (see however [71, 73, 75]).\n\n35\n\n\fcorrespond to the statement that the non-commutative theory does not reduce to the\nnaive commutative description at low energies.\nBefore closing, we wish to remark that our prescription for correlation functions is\nbased on such simple considerations that it seems possible to generalize it to arbitrary\nasymptotically flat backgrounds. Of course, in the general case one is no longer guided\nby D-brane intuition, so the attempt to describe the curved background in terms of\na lower-dimensional effective theory embedded in a higher-dimensional flat space is\nmore of a guess- even if it is still in consonance with the spirit of [34, 35]. But it is\nthe very fact that it would take us into uncharted terrain which could possibly make\nthis investigation worth our while.\n\n10\n\nAcknowledgements\n\nWe are grateful to Nadav Drukker, Ansar Fayyazuddin, Hans Hansson, Esko KeskiVakkuri, Subir Mukhopadhyay, Øyvind Tafjord, and Staffan Yngve for useful discussions. We would also like to thank Karen Ramı́rez for help with the figures. The\nwork of U.D., A.G., and B.S. was supported by the Swedish Natural Science Research Council (NFR), and that of M.K. by the Swedish Foundation for International\nCooperation in Research and Higher Education (STINT).\n\nAppendix A\nIn this appendix we review some properties of Mathieu functions following [77, 11, 26].\nIn [11] it was realized that the radial equation for a massless field moving in the D3brane background,\n\"\n\nd2\nR4\n5 d\nl(l + 4)\n2\n1\n+\n+\n−\n+\nq\ndr 2 r dr\nr2\nr4\n\n!#\n\nφ(r) = 0,\n\n(79)\n\ncan be recast as Mathieu's equation\n\"\n\nd2\n+ 2(qR)2 cosh(2ρ) − (l + 2)2 ψ(ρ) = 0,\n2\ndρ\n#\n\n(80)\n\nby means of the change of variables\nr = Reρ ,\n\nφ(r) = e−2ρ ψ(ρ).\n\n(81)\n\nFollowing [77] a solution can be easily written as an expansion for small qR :\nu(ρ) =\n\n∞\nX\n\n(qR)2n un (ρ),\n\n(82)\n\nn=0\n\nu0 (ρ) = cosh((l + 2)ρ),\n2 Zρ\ncosh(2ρ′ ) sinh((l + 2)(ρ − ρ′ ))un−1 (ρ′ )dρ′ .\nun (ρ) = −\nl+2 0\n36\n\n(83)\n(84)\n\n\fA Floquet solution, namely one satisfying\nMν (ρ + iπ) = eiπν Mν (ρ),\n\n(85)\n\nMν (ρ) = u(ρ) − eiπν u(ρ + iπ),\n\n(86)\n\ncan be obtained from u(ρ) as\n\nwhere the Floquet exponent ν turns out to be\nν=\n\n1\narccos(u(iπ)).\nπ\n\n(87)\n\nThis solution can be expanded as\n∞\nX\n\nMν (ρ) =\n\nan e(2n+ν)ρ ,\n\n(88)\n\nn=−∞\n\nwhere the coefficients an can be easily identified from the expansion in powers of qR\ngiven above. A linearly independent solution to (80) is given by\n∞\nX\n\nM−ν (ρ) ≡\n\nn=−∞\n\na−n e(2n−ν)ρ ,\n\n(89)\n\nwhere the an are the same coefficients as in (88).\nFor ease of comparison, we note that the Floquet solution J(ν, ρ) given in [11] is\nproportional to Mν . The former is defined as\nJ(ν, ρ) =\n\n∞\nX\n\n(−)n φ(n + 12 ν)e(2n+ν)ρ ,\n\n(90)\n\nn=−∞\n\nso the two solutions are related through\na0 J(ν, ρ) = φ(ν/2)Mν (ρ)\n\n=⇒\n\n(−)n\n\nφ(n + ν/2)\nan\n.\n=\nφ(ν/2)\na0\n\n(91)\n\nMν is similarly related to the Floquet solution Meν defined in [26].\nAn alternative expansion in terms of Bessel functions which uses the same coefficients is [11, 26]\nMν (ρ) =\n\n∞\nX\n1\n(−)n an Jn (qRe−ρ )Jn+ν (qReρ ) .\nφ(ν/2) n=−∞\n\n(92)\n\nEvaluating this equation at ρ = 0 and dividing it by the corresponding equation for\nM−ν (0) = Mν (0), the important quantity χ follows as\n∞\nn\nφ(−ν/2)\nn=−∞ (−) a−n Jn (qR)Jn−ν (qR)\n.\nχ≡\n= P∞\nn\nφ(ν/2)\nn=−∞ (−) an Jn (qR)Jn+ν (qR)\n\nP\n\n37\n\n(93)\n\n\fThe above expression contains only integer powers of qR except for the factors (qR)ν\nand (qR)−ν arising from the Bessel functions Jn±ν (qR). It is possible then to write χ\nas\nχ = (qR)−2ν χ̃((qR)2 ) = e−2ν ln(qR)+iα\n(94)\nwhere χ̃ (or α) can be expressed as a series expansion in integer powers of (qR)2 . For\ngeneric l > 0 one obtains (following [26])\n(qR)4\n+***\nν = l+2−\n4(l + 1)(l + 2)(l + 3)\n\"\n#\n4\n2l+2\nl!(l\n+\n1)!\nq\n2\nχ = (−)l+1\n1+\nln(qR)2 + * * *\n(l + 3) (qR)2l\n4(l + 1)(l + 2)(l + 3)\n\n(95)\n(96)\n\nwhich are useful expressions when computing the AdS limit. In the case of l = 0 one\nobtains\nν = 2 + iμ ,\n\n(97)\n√\n√\n2 1\n2 γ\n49\n49\nχ = e−2iμ ln[(qR) e ] − − i 5 + (−\n+\ni 5)(qR)4\n3 3\n1152 2880\n\u0015\n12527\n18853 √\ni 5+\n)(qR)8 + O((qR)12 ) ,\n(98)\n+(\n39813120\n9953280\n√\n5\n7 √\n11851 √\nμ = −\n(qR)4 +\n5(qR)8 +\n5(qR)12 + O((qR)16 ) , (99)\n48\n138240\n637009920\n\u0014\n\nwhere γ ≈ 0.5772 is Euler's constant.\nIn the text we also used the solutions [11]\nH (1,2) (ν, ρ) =\n\n∞\nX\n\n(−)n\n\nn=−∞\n\nan\n(1,2)\nJn (qRe−ρ )Hn+ν (qReρ ),\na0\n\n(100)\n\n(i)\n\nwhere Hn+ν are Hankel functions of order n + ν. The Mathieu functions H (1,2) (ν, ρ)\nare of particular interest because they behave asymptotically as purely ingoing or\noutgoing waves.\n\nAppendix B\nIn this appendix we derive Eq. (30). To this end it is useful to first summarize some\nformulas involving the spherical harmonics on S5 , following [78]. In the following we\ndenote coordinates parallel and orthogonal to the brane as xμ and ~y , respectively.\nBesides we write ~y = rŷ, with ŷ a unit vector. Orthonormal spherical harmonics on\nS5 are then defined through\n1\ni1 ...il\nYlm = √ Clm\nŷi1 . . . ŷil ,\nNl\n38\n\n(101)\n\n\fwith\nπ3\n= l−1\n,\n2 (l + 1)(l + 2)\n\nNl\nZ\n\nX\n\n(102)\n\nd5 ΩYlm Yl∗′ m′ = δll′ δmm′ ,\n\n(103)\n\ni1 ...il i1 ...il\n= δmm′ .\nClm\nClm′\n\n(104)\n\ni1 ...il\ni1 ...il\nThe coefficients Clm\ntake the symmetric traceless part of the product of the unit\nP\n9...9 9...9\nvectors ŷ. For a wave incident along y9 it is important to compute m Clm\nClm\nThis calculation was performed in [41] using other coefficients that can be defined by\nl\nCpi11...i\n...pl =\n\nX\n\ni1 ...il p1 ...pl\nClm\nClm .\n\n(105)\n\nm\n\nTranslating to the notation used here, the result in [41] reads\nX\n\n9...9 9...9\nClm\nClm =\n\nX X\n\n9...9 i1 ...il\nClm\nClm\n\ni1 ...il m\n\nm\n\nX\n\n9...9 i1 ...il\n=\nClm\n′ Clm′\n\nCi9...9\nCi9...9\n1 ...il\n1 ...il\n\ni1 ...il\n\nm′\n\n(l + 2)(l + 3)\n.\n=\n3 * 2l+1\n\nX\n\n(106)\n\nNow we proceed to derive Eq. (30). When the interaction is\nSint =\n\nZ\n\nd4 x\n\n9\nX\n\n∂i1 ...il φ(x, y)\n\ni1...l =5\n\ny=0\n\ni1 ...il lm\nClm\nO ,\n\n(107)\n\nthe analog of (11) turns out to be\nG(r, r ′ , ŷ, ŷ ′) = G0 (r, ŷ; r ′ , ŷ ′)\n\n(108)\n\n+ ∂i1 ...il G0 (r, ŷ; ~y1)|~y1 =0\n\nX\n\ni1 ...il (l) j1 ...jl\nClm\n∆2 Clm\n\n∂j1 ...jl G0 (r ′ , ŷ ′; ~y2)|~y2 =0 .\n\nlm\n\nThe flat space propagator G0 can be expanded as\nG0 (r, ŷ; r ′ , ŷ ′) = −i\n\nπ 1 X\n(1)\nJl+2 (qr< )Hl+2(qr> )Ylm (ŷ)Ylm (ŷ ′)\n2 (rr ′)2 lm\n\n(109)\n\nwhere r< (r> ) is the smaller (larger) of r and r ′ . The Bessel function Jl+2 ensures\n(1)\nthat the propagator is well behaved at r = 0 and the Hankel function Hl+2 that the\nflux at infinity is outgoing. From the previous equation and (101) one can compute\n∂i1 ...il G0 (r, ŷ; ~y )|~y=0 = −i\n\nπ l! q l+2 1\n1\ni1 ...il\nYlm (ŷ).\nHl+2 (qr) √ Clm\nl+2\n2\n2 (l + 2)! 2 r\nNl\n\n(110)\n\nExpanding the full propagator in spherical harmonics,\nG(r, ŷ; r ′, ŷ ′) =\n\nX\n\nG(l) (r, r ′ )Ylm (ŷ)Ylm (ŷ ′ ) ,\n\nlm\n\n39\n\n(111)\n\n\fit follows that the coefficients G(l) (r, r ′ ) satisfy\n\"\n\nd2\nR4\n5 d\nl(l + 4)\n2\n1\n+\n+\n−\n+\nq\ndr 2 r dr\nr2\nr4\n\n!#\n\nG(l) (r, r ′ ) =\n\nδ(r − r ′ )\n,\nπ3r5\n\n(112)\n\nAs in Section 3, G(l) (r, r ′) must reduce to a purely ingoing wave at the horizon and a\npurely outgoing wave at infinity. Again using the notation of Eq. (18), the solution is\nG(l) (r, r ′ ) =\n\n1\nB\nφ2 (r> ) φ3 (r< ) + φ2 (r< ) ,\nw32\nA\n\u0014\n\n\u0015\n\n(113)\n\nExpanding for large r,r ′ and using the values of A and B from (22) the difference\nbetween the full and flat space propagators follows as (r, r ′ → ∞):\n\n\n\n\nχl − χ1l\niπ 2 1\n(l)\nl iq(r+r ′ ) \nl\n(−)\ne\n(−)\n− 1 .\nG(l) (r, r ′ ) − G0 (r, r ′ ) ≃\n5\n4 πq (rr ′ ) 2\nηl χl − ηl1χl\n\n(114)\n\nFinally, inserting the last equation and (110) into the expansion (108), the propagator\n(l)\n∆2 is found to be\n\n\n(l)\n\n∆2 = 2l+5 π 2 (l + 1)(l + 2)q −2l−4i (−)l\n\nχl −\n\nηl χl −\n\n1\nχl\n1\nηl χl\n\n\n\n− 1 .\n\n(115)\n\nReferences\n[1] J. Maldacena, \"The Large N Limit of Superconformal Field Theories and Supergravity,\" Adv. Theor. Math. Phys. 2 (1998) 231, hep-th/9711200.\n[2] S. S. Gubser, I. R. Klebanov, and A. M. Polyakov, \"Gauge Theory Correlators\nfrom Noncritical String Theory,\" Phys. Lett. B428 (1998) 105, hep-th/9802109.\n[3] E. Witten, \"Anti-de Sitter Space and Holography,\" Adv. Theor. Math. Phys. 2\n(1998) 253, hep-th/9802150.\n[4] O. Aharony, S. S. Gubser, J. Maldacena, H. Ooguri and Y. Oz, \"Large N field\ntheories, string theory and gravity,\" hep-th/9905111.\n[5] J. Polchinski, \"Dirichlet-Branes and Ramond-Ramond Charges,\" Phys. Rev.\nLett. 75, 4724 (1995), hep-th/9510017.\n[6] S. S. Gubser, I. R. Klebanov and A. W. Peet, \"Entropy and Temperature of\nBlack 3-Branes,\" Phys. Rev. D54, 3915 (1996), hep-th/9602135.\n[7] I. R. Klebanov, \"World-volume approach to absorption by non-dilatonic branes,\"\nNucl. Phys. B496, 231 (1997), hep-th/9702076.\n40\n\n\f[8] S. S. Gubser, I. R. Klebanov and A. A. Tseytlin, \"String theory and classical\nabsorption by three-branes,\" Nucl. Phys. B499, 217 (1997), hep-th/9703040.\n[9] S. S. Gubser and I. R. Klebanov, \"Absorption by branes and Schwinger terms in\nthe world volume theory,\" Phys. Lett. B413, 41 (1997), hep-th/9708005.\n[10] S. S. Gubser, A. Hashimoto, I. R. Klebanov and M. Krasnitz, \"Scalar absorption\nand the breaking of the world volume conformal invariance,\" Nucl. Phys. B526,\n393 (1998), hep-th/9803023.\n[11] S. S. Gubser and A. Hashimoto, \"Exact absorption probabilities for the D3brane,\" Commun. Math. Phys. 203 (1999) 325, hep-th/9805140.\n[12] K. Intriligator, \"Maximally supersymmetric RG flows and AdS duality,\"\nhep-th/9909082.\n[13] W. I. Taylor and M. Van Raamsdonk, \"Multiple Dp-branes in weak background\nfields,\" hep-th/9910052.\n[14] R. C. Myers, \"Dielectric-branes,\" JHEP 9912, 022 (1999), hep-th/9910053.\n[15] A. Hashimoto and I. R. Klebanov, \"Scattering of strings from D-branes,\" Nucl.\nPhys. Proc. Suppl. 55B, 118 (1997), hep-th/9611214.\n[16] S. P. de Alwis, \"Supergravity, the DBI action and black hole physics,\" Phys.\nLett. B435, 31 (1998), hep-th/9804019.\n[17] L. Susskind and E. Witten, \"The Holographic Bound in Anti-de Sitter Space,\"\nhep-th/9805114.\n[18] A. W. Peet and J. Polchinski, \"UV/IR relations in AdS dynamics,\" Phys. Rev.\nD59, 065011 (1999), hep-th/9809022.\n[19] A. Hashimoto, \"Holographic description of D3-branes in flat space,\" Phys. Rev.\nD60, 127902 (1999), hep-th/9903227.\n[20] M. S. Costa, \"Absorption by double-centered D3-branes and the Coulomb branch\nof N = 4 SYM theory,\" hep-th/9912073.\n[21] M. S. Costa, \"A Test of the AdS/CFT Duality on the Coulomb Branch,\"\nhep-th/0003289.\n[22] A. A. Tseytlin, \"Born-Infeld action, supersymmetry and string theory,\"\nhep-th/9908105.\n[23] H. J. Kim, L. J. Romans and P. van Nieuwenhuizen, \"The mass spectrum of\nchiral N = 2 D = 10 supergravity on S5 ,\" Phys. Rev. D32, 389 (1985).\n\n41\n\n\f[24] S. Ferrara, M. A. Lledó and A. Zaffaroni, \"Born-Infeld corrections to D3 brane\naction in AdS5 × S5 and N = 4, d = 4 primary superfields,\" Phys. Rev. D58,\n105029 (1998), hep-th/9805082.\n[25] H. Liu and A. A. Tseytlin, \"Dilaton-fixed scalar correlators and AdS5 × S5 -SYM\ncorrespondence,\" JHEP 9910, 003 (1999), hep-th/9906151.\n[26] R. Manvelian, H. J. Müller-Kirsten, J. Q. Liang and Y. Zhang, \"Absorption\ncross-section of scalar field in supergravity background,\" hep-th/0001179.\n[27] S. S. Gubser, \"Can the effective string see higher partial waves?,\" Phys. Rev.\nD56, 4984 (1997), hep-th/9704195.\n[28] M. Cvetič, H. Lü and J. F. Vázquez-Poritz, \"Absorption by extremal D3-branes,\"\nhep-th/0002128.\n[29] H. Verlinde, \"Holography and compactification,\" hep-th/9906182.\n[30] J. Khoury and H. Verlinde, \"On open/closed string duality,\" hep-th/0001056.\n[31] V. Periwal and Ø. Tafjord, \"A finite cutoff on the string world sheet?,\" Phys.\nRev. D60, 046004 (1999), hep-th/9803195;\nØ. Tafjord, \"The Dynamics of D-branes in String Theory,\" Princeton University\nPh.D. Thesis (1999).\n[32] I. Y. Park, \"Fundamental vs. solitonic description of D3 branes,\" Phys. Lett.\nB468, 213 (1999), hep-th/9907142.\n[33] N. R. Constable and R. C. Myers, \"Exotic scalar states in the AdS/CFT correspondence,\" JHEP 9911, 020 (1999) hep-th/9905081.\n[34] G. 't Hooft, \"Dimensional reduction in quantum gravity,\" gr-qc/9310026.\n[35] L. Susskind, \"The World as a hologram,\" J. Math. Phys. 36, 6377 (1995),\nhep-th/9409089.\n[36] O. Aharony, M. Berkooz, D. Kutasov and N. Seiberg, \"Linear dilatons, NS5branes and holography,\" JHEP 9810, 004 (1998). hep-th/9808149.\n[37] S. Minwalla and N. Seiberg, \"Comments on the IIA NS5-brane,\" JHEP 9906,\n007 (1999) hep-th/9904142.\n[38] J. M. Maldacena and J. G. Russo, \"Large N limit of non-commutative gauge\ntheories,\" JHEP 9909, 025 (1999), hep-th/9908134.\n[39] V. Balasubramanian, S. B. Giddings and A. Lawrence, \"What do CFTs tell us\nabout anti-de Sitter spacetimes?,\" JHEP 9903, 001 (1999), hep-th/9902052.\n\n42\n\n\f[40] S. B. Giddings, \"The boundary S-matrix and the AdS to CFT dictionary,\" Phys.\nRev. Lett. 83, 2707 (1999), hep-th/9903048.\n[41] I. R. Klebanov, W. Taylor IV, and M. Van Raamsdonk, \"Absorption of Dilaton\nPartial Waves by D3-Branes,\" hep-th/9905174.\n[42] R. B. Dingle, Asymptotic Expansions: Their Derivation and Interpretation, Academic Press, London (1973).\n[43] I. S. Gradshteyn and I. M. Ryzhik, Table of Integrals, Series, and Products, Fifth\nEdition, Academic Press, London (1994), p. 973, formula 8.451.5.\n[44] V. Balasubramanian, P. Kraus, A. Lawrence and S. P. Trivedi, \"Holographic probes of anti-de Sitter space-times,\" Phys. Rev. D59, 104021 (1999)\nhep-th/9808017.\n[45] U. H. Danielsson, E. Keski-Vakkuri and M. Kruczenski, \"Vacua, propagators, and holographic probes in AdS/CFT,\" JHEP 9901, 002 (1999),\nhep-th/9812007.\n[46] C. G. Callan and A. Güijosa, \"Undulating Strings and Gauge Theory Waves,\"\nNucl. Phys. B565, 157 (2000), hep-th/9906153.\n[47] D. Z. Freedman, S. D. Mathur, A. Matusis and L. Rastelli, \"Correlation functions in the CFTd /AdSd+1 correspondence,\" Nucl. Phys. B546, 96 (1999),\nhep-th/9804058.\n[48] S.-J. Rey, J. Yee, \"Macroscopic Strings as Heavy Quarks of Large N Gauge\nTheory and Anti-de Sitter Supergravity,\" hep-th/9803001.\n[49] J. Maldacena, \"Wilson Loops in Large N Field Theories,\" Phys. Rev. Lett. 80\n(1998) 4859, hep-th/9803002.\n[50] N. Drukker, D. J. Gross and H. Ooguri, \"Wilson loops and minimal surfaces,\"\nPhys. Rev. D60, 125006 (1999), hep-th/9904191.\n[51] J. Sonnenschein, \"What does the string/gauge correspondence teach us about\nWilson loops?,\" hep-th/0003032.\n[52] E. Witten, \"Bound States of Strings and p-Branes,\" Nucl. Phys. B460 (1996)\n335, hep-th/9510135.\n[53] E. Witten, \"Baryons and Branes in Anti de Sitter Space,\" J. High Energy Phys.\n07 (1998) 006, hep-th/9805112.\n[54] D. Gross and H. Ooguri, \"Aspects of Large N Gauge Theory Dynamics as seen\nby String theory,\" Phys. Rev. D58 (1998) 106002, hep-th/9805129.\n\n43\n\n\f[55] Y. Imamura, \"Supersymmetries and BPS Configurations on Anti-de Sitter\nSpace,\" Nucl. Phys. B537 (1999) 184, hep-th/9807179.\n[56] C. G. Callan, A. Güijosa and K. G. Savvidy, \"Baryons and string creation from the fivebrane worldvolume action,\" Nucl. Phys. B547, 127 (1999),\nhep-th/9810092.\n[57] B. Craps, J. Gomis, D. Mateos and A. Van Proeyen, \"BPS solutions of a D5brane world volume in a D3-brane background from superalgebras,\" JHEP 9904,\n004 (1999), hep-th/9901060.\n[58] J. Gomis, A. V. Ramallo, J. Simon and P. K. Townsend, \"Supersymmetric baryonic branes,\" JHEP 9911, 019 (1999) [hep-th/9907022].\n[59] C. Callan and J. Maldacena, \"Brane Dynamics from the Born-Infeld Action,\"\nNucl. Phys. B513 (1998) 198, hep-th/9708147.\n[60] G. Gibbons, \"Born-Infeld Particles and Dirichlet p-branes\", Nucl. Phys. B514\n(1998) 603, hep-th/9709027.\n[61] J. M. Camino, A. V. Ramallo and J. M. Sánchez de Santos, \"Worldvolume\ndynamics of D-branes in a D-brane background,\" Nucl. Phys. B562, 103 (1999),\nhep-th/9905118.\n[62] A. Hashimoto and N. Itzhaki, \"Non-commutative Yang-Mills and the AdS/CFT\ncorrespondence,\" Phys. Lett. B465, 142 (1999), hep-th/9907166.\n[63] N. Seiberg and E. Witten, \"String theory and noncommutative geometry,\" JHEP\n9909, 032 (1999), hep-th/9908142.\n[64] S. Minwalla, M. Van Raamsdonk and N. Seiberg, \"Noncommutative perturbative\ndynamics,\" hep-th/9912072.\n[65] M. Van Raamsdonk and N. Seiberg, \"Comments on noncommutative perturbative dynamics,\" hep-th/0002186.\n[66] I. Y. Aref'eva, D. M. Belov and A. S. Koshelev, \"Two-loop diagrams in noncommutative φ44 theory,\" Phys. Lett. B476, 431 (2000), hep-th/9912075.\n[67] I. Y. Aref'eva, D. M. Belov and A. S. Koshelev, \"A note on UV/IR for noncommutative complex scalar field,\" hep-th/0001215.\n[68] A. Matusis, L. Susskind and N. Toumbas, \"The IR/UV connection in the noncommutative gauge theories,\" hep-th/0002075.\n[69] Y. Kiem and S. Lee, \"UV/IR mixing in noncommutative field theory via open\nstring loops,\" hep-th/0003145.\n\n44\n\n\f[70] I. Y. Aref'eva, D. M. Belov, A. S. Koshelev and O. A. Rytchkov, \"UV/IR mixing for noncommutative complex scalar field theory. II: (Interaction with gauge\nfields),\" hep-th/0003176.\n[71] O. Andreev and H. Dorn, \"Diagrams of noncommutative φ3 theory from string\ntheory,\" hep-th/0003113.\n[72] A. Bilal, C. Chu and R. Russo, \"String theory and noncommutative field theories\nat one loop,\" hep-th/0003180.\n[73] J. Gomis, M. Kleban, T. Mehen, M. Rangamani and S. Shenker, \"Noncommutative gauge dynamics from the string worldsheet,\" hep-th/0003215.\n[74] A. Rajaraman and M. Rozali, \"Noncommutative gauge theory, divergences and\nclosed strings,\" hep-th/0003227.\n[75] H. Liu and J. Michelson, \"Stretched strings in noncommutative field theory,\"\nhep-th/0004013.\n[76] J. Gomis, K. Landsteiner, and E. López, \"Non-Relativistic Non-Commutative\nField Theory and UV/IR Mixing,\" hep-th/0004115.\n[77] A. Erdélyi, ed., Higher Transcendental Functions, Vol. 3, McGraw-Hill, New\nYork (1955), p. 105.\n[78] S. Lee, S. Minwalla, M. Rangamani and N. Seiberg, \"Three-point functions of\nchiral operators in D = 4, N = 4 SYM at large N,\" Adv. Theor. Math. Phys. 2\n(1998) 697, hep-th/9806074.\n\n45\n\n\f"}