{"id": "http://arxiv.org/abs/hep-th/0610151v2", "guidislink": true, "updated": "2007-05-04T15:19:27Z", "updated_parsed": [2007, 5, 4, 15, 19, 27, 4, 124, 0], "published": "2006-10-12T20:38:35Z", "published_parsed": [2006, 10, 12, 20, 38, 35, 3, 285, 0], "title": "Observing the Geometry of Warped Compactification via Cosmic Inflation", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-th%2F0410277%2Chep-th%2F0410271%2Chep-th%2F0410265%2Chep-th%2F0410127%2Chep-th%2F0410278%2Chep-th%2F0410189%2Chep-th%2F0410064%2Chep-th%2F0410073%2Chep-th%2F0410227%2Chep-th%2F0410218%2Chep-th%2F0410099%2Chep-th%2F0410178%2Chep-th%2F0410008%2Chep-th%2F0410015%2Chep-th%2F0410258%2Chep-th%2F0610186%2Chep-th%2F0610218%2Chep-th%2F0610204%2Chep-th%2F0610152%2Chep-th%2F0610266%2Chep-th%2F0610316%2Chep-th%2F0610122%2Chep-th%2F0610037%2Chep-th%2F0610234%2Chep-th%2F0610145%2Chep-th%2F0610285%2Chep-th%2F0610259%2Chep-th%2F0610180%2Chep-th%2F0610300%2Chep-th%2F0610160%2Chep-th%2F0610163%2Chep-th%2F0610308%2Chep-th%2F0610334%2Chep-th%2F0610018%2Chep-th%2F0610290%2Chep-th%2F0610176%2Chep-th%2F0610304%2Chep-th%2F0610298%2Chep-th%2F0610032%2Chep-th%2F0610038%2Chep-th%2F0610112%2Chep-th%2F0610209%2Chep-th%2F0610230%2Chep-th%2F0610096%2Chep-th%2F0610030%2Chep-th%2F0610317%2Chep-th%2F0610139%2Chep-th%2F0610321%2Chep-th%2F0610333%2Chep-th%2F0610281%2Chep-th%2F0610114%2Chep-th%2F0610329%2Chep-th%2F0610080%2Chep-th%2F0610071%2Chep-th%2F0610011%2Chep-th%2F0610257%2Chep-th%2F0610319%2Chep-th%2F0610301%2Chep-th%2F0610193%2Chep-th%2F0610151%2Chep-th%2F0610178%2Chep-th%2F0610005%2Chep-th%2F0610125%2Chep-th%2F0610063%2Chep-th%2F0610004%2Chep-th%2F0610315%2Chep-th%2F0610210%2Chep-th%2F0610233%2Chep-th%2F0610243%2Chep-th%2F0610130%2Chep-th%2F0610253%2Chep-th%2F0610109%2Chep-th%2F0610156%2Chep-th%2F0610120%2Chep-th%2F0610249%2Chep-th%2F0610154%2Chep-th%2F0610240%2Chep-th%2F0610165%2Chep-th%2F0610049%2Chep-th%2F0610223%2Chep-th%2F0610024%2Chep-th%2F0610046%2Chep-th%2F0610076%2Chep-th%2F0610051%2Chep-th%2F0610006%2Chep-th%2F0610208%2Chep-th%2F0610081%2Chep-th%2F0610239%2Chep-th%2F0610241%2Chep-th%2F0610048%2Chep-th%2F0610015%2Chep-th%2F0610202%2Chep-th%2F0610310%2Chep-th%2F0610072%2Chep-th%2F0610092%2Chep-th%2F0610137%2Chep-th%2F0610171%2Chep-th%2F0610264%2Chep-th%2F0610331%2Chep-th%2F0610289%2Chep-th%2F0610177&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Observing the Geometry of Warped Compactification via Cosmic Inflation"}, "summary": "Using DBI inflation as an example, we demonstrate that the detailed geometry\nof warped compactification can leave an imprint on the cosmic microwave\nbackground (CMB). We compute CMB observables for DBI inflation in a generic\nclass of warped throats and find that the results (such as the sign of the tilt\nof the scalar perturbations and its running) depend sensitively on the precise\nshape of the warp factor. In particular, we analyze the warped deformed\nconifold and find that the results can differ from those of other warped\ngeometries, even when these geometries approximate well the exact metric of the\nwarped deformed conifold.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-th%2F0410277%2Chep-th%2F0410271%2Chep-th%2F0410265%2Chep-th%2F0410127%2Chep-th%2F0410278%2Chep-th%2F0410189%2Chep-th%2F0410064%2Chep-th%2F0410073%2Chep-th%2F0410227%2Chep-th%2F0410218%2Chep-th%2F0410099%2Chep-th%2F0410178%2Chep-th%2F0410008%2Chep-th%2F0410015%2Chep-th%2F0410258%2Chep-th%2F0610186%2Chep-th%2F0610218%2Chep-th%2F0610204%2Chep-th%2F0610152%2Chep-th%2F0610266%2Chep-th%2F0610316%2Chep-th%2F0610122%2Chep-th%2F0610037%2Chep-th%2F0610234%2Chep-th%2F0610145%2Chep-th%2F0610285%2Chep-th%2F0610259%2Chep-th%2F0610180%2Chep-th%2F0610300%2Chep-th%2F0610160%2Chep-th%2F0610163%2Chep-th%2F0610308%2Chep-th%2F0610334%2Chep-th%2F0610018%2Chep-th%2F0610290%2Chep-th%2F0610176%2Chep-th%2F0610304%2Chep-th%2F0610298%2Chep-th%2F0610032%2Chep-th%2F0610038%2Chep-th%2F0610112%2Chep-th%2F0610209%2Chep-th%2F0610230%2Chep-th%2F0610096%2Chep-th%2F0610030%2Chep-th%2F0610317%2Chep-th%2F0610139%2Chep-th%2F0610321%2Chep-th%2F0610333%2Chep-th%2F0610281%2Chep-th%2F0610114%2Chep-th%2F0610329%2Chep-th%2F0610080%2Chep-th%2F0610071%2Chep-th%2F0610011%2Chep-th%2F0610257%2Chep-th%2F0610319%2Chep-th%2F0610301%2Chep-th%2F0610193%2Chep-th%2F0610151%2Chep-th%2F0610178%2Chep-th%2F0610005%2Chep-th%2F0610125%2Chep-th%2F0610063%2Chep-th%2F0610004%2Chep-th%2F0610315%2Chep-th%2F0610210%2Chep-th%2F0610233%2Chep-th%2F0610243%2Chep-th%2F0610130%2Chep-th%2F0610253%2Chep-th%2F0610109%2Chep-th%2F0610156%2Chep-th%2F0610120%2Chep-th%2F0610249%2Chep-th%2F0610154%2Chep-th%2F0610240%2Chep-th%2F0610165%2Chep-th%2F0610049%2Chep-th%2F0610223%2Chep-th%2F0610024%2Chep-th%2F0610046%2Chep-th%2F0610076%2Chep-th%2F0610051%2Chep-th%2F0610006%2Chep-th%2F0610208%2Chep-th%2F0610081%2Chep-th%2F0610239%2Chep-th%2F0610241%2Chep-th%2F0610048%2Chep-th%2F0610015%2Chep-th%2F0610202%2Chep-th%2F0610310%2Chep-th%2F0610072%2Chep-th%2F0610092%2Chep-th%2F0610137%2Chep-th%2F0610171%2Chep-th%2F0610264%2Chep-th%2F0610331%2Chep-th%2F0610289%2Chep-th%2F0610177&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Using DBI inflation as an example, we demonstrate that the detailed geometry\nof warped compactification can leave an imprint on the cosmic microwave\nbackground (CMB). We compute CMB observables for DBI inflation in a generic\nclass of warped throats and find that the results (such as the sign of the tilt\nof the scalar perturbations and its running) depend sensitively on the precise\nshape of the warp factor. In particular, we analyze the warped deformed\nconifold and find that the results can differ from those of other warped\ngeometries, even when these geometries approximate well the exact metric of the\nwarped deformed conifold."}, "authors": ["Gary Shiu", "Bret Underwood"], "author_detail": {"name": "Bret Underwood"}, "author": "Bret Underwood", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevLett.98.051301", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/hep-th/0610151v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-th/0610151v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "4 pages, 3 figures. v2: References and clarifications added", "arxiv_primary_category": {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-th/0610151v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-th/0610151v2", "journal_reference": "Phys.Rev.Lett.98:051301,2007", "doi": "10.1103/PhysRevLett.98.051301", "fulltext": "MAD-TH-06-8\n\nObserving the Geometry of Warped Compactification via Cosmic Inflation\nGary Shiu and Bret Underwood\nDepartment of Physics, University of Wisconsin, Madison, WI 53706, USA\n\narXiv:hep-th/0610151v2 4 May 2007\n\nUsing DBI inflation as an example, we demonstrate that the detailed geometry of warped compactification can leave an imprint on the cosmic microwave background (CMB). We compute CMB\nobservables for DBI inflation in a generic class of warped throats and find that the results (such as\nthe sign of the tilt of the scalar perturbations and its running) depend sensitively on the precise\nshape of the warp factor. In particular, we analyze the warped deformed conifold and find that the\nresults can differ from those of other warped geometries, even when these geometries approximate\nwell the exact metric of the warped deformed conifold.\n\nIt has long been recognized that observational cosmology provides a powerful window for testing fundamental\nphysics, especially theories whose energy scales are far\nfrom what current accelerator experiments can reach. In\nthis regard, inflation is a particularly gratifying idea. In\naddition to the strong and growing experimental evidence\nin support of its basic picture, inflation significantly highlights the importance of microphysics. Quantum fluctuations in the early universe are stretched by the enormous\nexpansion of inflation to scales of astrophysical relevance,\nproviding the seed for density perturbations. Thus, by\nway of inflation, short distance physics may leave an imprint on cosmological observables such as the CMB [1].\nIn recent years, significant progress has been made in\nconstructing inflationary models from string theory. A\nparticularly promising framework is the idea of brane inflation [2, 3], in which the attraction between the branes\ngives rise to the inflaton potential. Advances in stabilizing moduli with fluxes [4, 5] have enabled the realization\nof this idea; some explicit models can be found in [6, 7].\nIt is therefore worthwhile to explore if any stringy features, such as the geometry of compactification, can be\ndetermined or distinguished from precision cosmology.\nIn this paper, we focus on the relativistic limit of brane\ninflation, known as DBI inflation [7, 8, 9], because of its\nstrong observational potential. In particular, the primordial non-gaussianity of the CMB in DBI inflation can be\nmuch larger than in slow roll models and is within the\nreach of current and next-generation CMB experiments\nlike WMAP and Planck [7, 10]. More importantly, the\nshape of non-gaussianities is distinct [10]. Thus, nongaussianities of such size and shape, if observed, can put\ninteresting bounds on the mass of the inflation which\nfrom [11] (see also [12]) may in turn constrain some gross\nfeatures of the compact geometry.\nA crucial element in the construction of brane inflation\nmodels are explicit solutions of warped throats, the most\nwell studied example being the warped deformed conifold\n(or the Klebanov-Strassler (KS) throat) [13]. Besides sustaining inflation by flattening the inflaton potential [6] or\nlimiting the speed of the branes [7], significant warping is\nessential in reheating the universe [14]. Far from the tip\nof the throat and the bulk of the compact space (usually\n\ntaken to be a Calabi-Yau manifold), the warped deformed\nconifold can be approximated by a product of AdS5 ×T 1,1\n(up to a logarithmic correction [15]), where T 1,1 is a 5dimensional Einstein-Sasaki manifold with the topology\nof S 2 × S 3 . Therefore, as in [16], the warp factor can\ngenerate a hierarchy of scales. However, unlike an exact\nAdS throat, the warp factor approaches a constant near\nthe tip which can be understood from AdS/CFT correspondence as a confining phase in the infrared of the dual\ngauge theory. In fact, the gauge/gravity duality suggests\nthe existence of various other warped throats which are\nasymptotically AdS but differ in their geometries near\nthe tip, though explicit metrics for such other warped\ngeometries are not yet known at present. A question\nof significance is: could the precise geometry of warped\nthroats be distinguished by observations?\nThe purpose of this Letter is to answer this question\naffirmatively. Naively, if the observed density perturbations leave the horizon in the AdS region of a warped\nthroat (which, with the exception of [8], is assumed),\nsmall corrections to the geometry due e.g. to the details\nof the tip region are irrelevant. However, we will show,\ncontrary to this expectation, that even if the last 55 efoldings of inflation takes place in the AdS region, small\ndifferences in the geometry can leave an observable effect.\nConsider a 10 dimensional geometry with a warped\nthroat whose metric takes the form,\nds210 = f −1/2 (r)ημν dxμ dxν + f 1/2 (r)(dr2 + ds2X5 ) (1)\nwhere r is the proper distance from the tip of the throat\nand f (r) is the warp factor. The angular coordinates of\nds2X5 will not affect our analysis and we will ignore them\nfrom now on.\nThe motion of a D3-brane in a warped space is given\nby the DBI action, which in terms of the canonical scalar\n1/2\nfield φ = TD3 r and a rescaled warp factor f ̃(r) =\n−1\nTD3 f (r) is,\nSDBI = −\n\nZ\n\n\u0013\n\u0013\n\u0012\n\u0012q\n1 − f ̃φ̇2 − 1 − V (φ) . (2)\nd4 x f ̃−1\n\nThe factor inside the square root of Eq.(2) must always be positive, which leads to the speed limit φ̇2 <\n\n\ff ̃(φ)−1 and a corresponding\nrelativistic gamma factor\nq\n1\n4\n′2\nγ ≡ √  ̃ 2 = 1 + 4Mp H f ̃(φ). DBI inflation oc1−f φ̇\n\ncurs when the potential is steep, e.g., when the potential\nis dominated by a mass term V (φ) = m2 φ2 , which can\narise for instance from moduli stabilization effects [11].\nIn this case the Hubble parameter H = mφ(1 − Bφ2 )/Mp\nwhere Bφ2 represent small corrections coming from the\nkinetic term of the energy\n√ density [9], and we have chosen\nto absorb a factor of 3 into the definition of m. Notice\nthat this implies γ(φ) ∝ f ̃1/2 (φ) for relativistic (γ ≫ 1)\nmotion.\nThe number of e-folds can be written as\nZ\nZ\n1\nH\nNe = Hdt = −\nγ(φ) dφ\n(3)\n2Mp2\nH′\nwhere ′ denote derivatives with respect to φ. Irrespective\ndφ\n=\nof γ, this leads to the standard Lyth bound [17] dN\ne\npr\nMp 8 where r = 16ǫD /γ is the tensor to scalar ratio.\nThe scalar spectral index and its running can be written as [9]\n\" \u0012 \u0013\n#\n2\n2Mp2\nH′\nH ′ γ′\nH ′′\nns − 1 =\n−4\n+2\n+2\nγ\nH\nH\nH γ\n2Mp2 H ′ d\nd\ndns\nns =\n=\nns\nd ln k\ndNe\nγ H dφ\n\nFIG. 1: a.) The warp factor for the AdS (blue dashed) and\nexact KS throat (black solid) are plotted as a function of the\ncanonical scalar field scaled by its value at the edge where\nthe throat is glued to the bulk space. We have chosen our parameters to be htip = 10−2 , Mp = 100ms for these plots. b.)\nThe absolute value of the spectral index for the two throats\n(blue solid for AdS and thick black solid for KS). We take the\nabsolute value of ns − 1 in order to show simultaneously the\nresults for AdS and KS throat in one plot. The cusp in the\nAdS spectral curve corresponds to the tilt changing from negative at larger φ to positive for smaller φ. This also happens\nwhere the warp factors begin to differ. c.) The absolute value\nof the running of the scalar spectral index is shown for the\nAdS (blue) and KS (thick black) throats. The cusps in the\nAdS curve correspond to the running changing from negative\nto positive to negative again, as can easily be seen in the plot\nof the spectral index, see b.).\n\n(4)\n\nThe first term of the spectral index is always negative\nand tends to make it red, while the last term is always\npositive and will tend to make it blue. The middle term is\nproportional to the small corrections of the kinetic term.\nGiven the metric of a warped throat, Eq. (3),(4) can in\ngeneral be evaluated only numerically. We will present\nour numerical results for the KS throat, but to get an\nanalytic idea that details of warped geometry can affect\nCMB observables, let us first consider a general warp\nfactor of the form [8]:\nf ̃(φ) =\n\n1\nf0 + f2 φ2 + f4 φ4\n\n(5)\n(the contributions in Eq.(6) cancel and the addition of\nextra corrections to the energy density coming from the\nkinetic terms leads to a slightly blue spectrum [9]).\nFurthermore, the running of the scalar spectral index\nfor γ ≫ 1 (ignoring higher order terms in H(φ)) can be\nwritten as,\n\nFor such warp factor, the scalar spectral index Eq.(4)\ncan be written (without any assumption for γ =\nq\n1 + 4Mp4 H ′2 f ̃ and H = mφ/Mp ) ,\ns\nns − 1 =\n\nMp\nm\n\nf0 + f2 φ2 + f4 φ4\n\n(1 +\n\nf0 +f2 φ2 +f4 φ4\n)\n2 m2\n4Mp\n2\n\n\n\n2(f2 + 2f4 φ ) \nf0 + f2 φ2 + f4 φ4 1 +\n\n[−\n\n4\n+\nφ2\n\n1\nf0 +f2 φ2 +f4 φ4\n2 m2\n4Mp\n\ndns\n2Mp 4f02 + 6f0 f2 φ2 + (f22 + 8f0 f4 )φ4 + 2f2 f4 φ6\n=−\n. (7)\nd ln k\nm\nφ4 (f0 + f2 φ2 + f4 φ4 )\n\n\n\nThe running is always negative except when f0 = f2 = 0,\nin which case higher order corrections in H need to be\nincluded. These corrections can lead to a small positive\nrunning in some cases. We see, then, that because the\ninflationary dynamics depend strongly on the warp factor through the speed-limiting behavior, details of the\nwarped geometry can show up in the inflationary observables.\n\n] (6)\n\nThe differences between throats with different warped\ngeometries can be seen readily from this equation. In\nparticular, for a warped throat with a constant warp factor f ̃−1 ≈ f0 the spectral index is red, while for an AdSlike throat f ̃−1 ≈ f4 φ4 the spectral index is slightly blue\n2\n\n\fstring theory so we will carry out our numerical analysis\nfor the exact KS metric.\nFor the KS throat, the first term in the spectral index\nin Eq.(4) dominates over the last, particularly near the\ntip where γ ′ ∝ f ′ → 0, so the spectral index is red. For\nthe AdS throat the last term is slightly bigger than the\nfirst term due to the fact that γ ′ keeps increasing near\nthe tip, so the spectral index is blue near the tip, see Figure 1. Note that the differences even become apparent\nwhen the deviation between the warp factors is small, so\nthe details of the geometry can be important. The running of the scalar spectral index can also be computed\n(the tensor spectral index and its tilt are not signficantly\ndifferent), and one can see that the magnitude and sign\nof the running strongly depend on the geometry of the\nthroat. We also show the spectral index for the two different throat geometries as a function of the number of\ne-folds in Figure 2, where one sees that the region of the\nthroat where the inflationary observables are different includes the last 60 e-folds of inflation.\nIn order to make comparisons between these throats,\none must compare the values of the spectral indices\nand their running when the observable modes cross the\nhorizon. Inflation should end for the KS throat when\nstringy effects become important φ ∼ φs = htip ms and\nfor the AdS throat when the inflaton reaches the cutoff\nφcutof f = htip λ1/4 ms . We have (numerically) evaluated\nthe inflationary observables 55 e-folds back from these\ncutoffs for each throat, and the results are displayed in\nFigure 3. It is then clear that the different throat geometries can have an observable effect on the spectral index\nand its running.\nIncidentally, we have also found that the spectral index\nfor DBI inflation in KS throat is red tilted (inclusion of\nthe logarithmic correction term to the AdS throat as in\n[15] also leads to a red tilt). Although we have only shown\nour results for ns − 1 as a function of htip in Figure 3,\nthe redness of the spectrum is robust against the change\nof the other parameter ms /MP . It is clear from Figure\n1 that the spectral index can be blue only for sufficiently\nsmall φ. In this region of the throat, a scaling of ms /MP\nis equivalent to a scaling of htip .\nFinally, let us briefly comment on the observability of\ntensor modes. For the KS throat, we find that the tensor\nto scalar ratio r is too small to be observed unless the\ninflaton moves Planckian distance as suggested by the\nLyth bound. In contrast, the tensor signal is naively observable in an AdS throat for some ranges of parameters\n[9], although whether models with observable r are under\ncontrol within effective field theory is a subject of active\ninvestigation [18]. Nonetheless, it is clear that one should\nbe cautious in using the AdS throat as an approximate\ndescription for more realistic warped geometries.\nOur results thus provide a proof of concept that the\nshape of warped throats (as encoded by the warp factor)\nmay be distinguishable by its effect on the inflationary\n\nFIG. 2: The absolute value of the spectral index for the AdS\n(thin blue line) and KS (thick black line) throats is shown\nas a function of the number of e-folds for htip = 10−2 and\nMp = 100ms . The spectral index for AdS changes sign from\nnegative to positive at the kinked point, so we see that the\nregion where spectral index for the two throats is different\nfalls within the last 60 e-folds of inflation.\n\nTo illustrate this effect more clearly, let us now turn\nto explicit warped throats in string theory. For concreteness, we will consider two different warped throats and\ntheir corresponding warp factors:\n• AdS throat, with f ̃ = φλ4 , cutoff at a fixed coordinate φcutof f = htip λ1/4 ms .\n• KS throat, with f ̃ = 22/3 (gs M α′ )2 ǫ2/3 I(τ (φ)),\nwhere M corresponds to the number of units of RR\n3-form flux, τ (φ) is a parameter along the radial direction of the throat, and I(τ (φ)) is an integral that\ncan be determined numerically [13]. ǫ is related to\nthe deformation of the conifold and is not to be\nconfused with the inflationary parameter ǫD .\nThe KS geometry is sourced by a flux-induced D3 charge,\nso the KS throat asymptotically matches the AdS solution far from the tip [13], see Figure 1. For this reason,\nthe AdS solution is often used as a simple model of the\nKS throat. Near the tip of the throat the geometry is different, however, since the AdS throat is cutoff at a finite\nvalue of the coordinate while the KS throat smoothly extends to φ = 0. It is precisely this difference that will\nbecome pronounced in the inflationary observables. The\nexact KS warp factor does not fit into our simple ansatz\nEq.(5) and hence the corresponding inflationary observables have to be determined numerically. The \"mass gap\"\nwarp factor f ̃ = λ(μ2 + φ2 )−2 , where μ ∝ ǫ2/3 is related\nto the deformation of the tip, is of this form and can be\nshown to be a reasonably good approximation to the KS\nthroat [8]. We can in principle compare the inflationary observables for a AdS throat with that of the mass\ngap warp factor to simplify our calculations. However,\nwe wish to emphasize that the observable effects of the\nthroat geometry are present in some explict solutions of\n3\n\n\f[1] For a review, see, e.g., B. Greene, K. Schalm, J. P. van\nder Schaar, G. Shiu, eConf C041213, 0001 (2004); D.P.\nSpergel, et. al., [arXiv:astro-ph/0603449], Section 5.3;\nand references therein.\n[2] G. Dvali, S.H.H. Tye, Phys. Lett. B. 450, 72 (1999)\n[3] C. P. Burgess, M. Majumdar, D. Nolte, F. Quevedo,\nG. Rajesh, R. J. Zhang, JHEP 0107, 047 (2001)\nG. R. Dvali, Q. Shafi, S. Solganik, arXiv:hep-th/0105203.\n[4] S. Gukov, C. Vafa, E. Witten, Nucl. Phys. B 584, 69\n(2000) [Erratum-ibid. B 608, 477 (2001)] K. Dasgupta,\nG. Rajesh, S. Sethi, JHEP 9908, 023 (1999) T. R. Taylor, C. Vafa, Phys. Lett. B 474, 130 (2000) B. R. Greene,\nK. Schalm, G. Shiu, Nucl. Phys. B 584, 480 (2000)\nG. Curio, A. Klemm, D. Lust, S. Theisen, Nucl. Phys. B\n609, 3 (2001) S. B. Giddings, S. Kachru, J. Polchinski,\nPhys. Rev. D 66, 106006 (2002) K. Becker, M. Becker,\nJHEP 0107, 038 (2001) S. Kachru, M. B. Schulz,\nS. Trivedi, JHEP 0310, 007 (2003)\n[5] S. Kachru, R. Kallosh, A. Linde, S.P. Trivedi, Phys. Rev.\nD, 68, 046005 (2003).\n[6] S. Kachru, R. Kallosh, A. Linde, J. Maldacena, L. McAllister, S. Trivedi, JCAP 0310 (2003) 013.\n[7] M. Alishahiha, E. Silverstein, D. Tong, Phys.Rev. D 70\n(2004) 123505; E. Silverstein, D. Tong, Phys.Rev. D 70\n(2004) 103505; X. Chen, Phys.Rev. D 71 (2005) 063506;\nJHEP 0508 (2005) 045.\n[8] S. Kecskemeti, J. Maiden, G. Shiu, B. Underwood, JHEP\n09 (2006) 076.\n[9] S. Shandera, S.-H. H. Tye, JCAP 0605 (2006) 007\n[10] X. Chen, M. Huang, S. Kachru, G. Shiu, [arXiv:hepth/0605045].\n[11] D. Baumann, A. Dymarsky, I. R. Klebanov, J. Maldacena, L. McAllister, A. Murugan, [arXiv:hepth/0607050].\n[12] M. Berg, M. Haack, B. Kors, Phys. Rev. D 71, 026005\n(2005)\n[13] I. R. Klebanov, M. J. Strassler, JHEP 0008, 052 (2000)\n[14] G. Shiu, S. H. H. Tye, I. Wasserman, Phys. Rev. D 67,\n083517 (2003); N. Barnaby, C. P. Burgess, J. M. Cline,\nJCAP 0504, 007 (2005); L. Kofman, P. Yi, Phys. Rev.\nD 72, 106001 (2005); D. Chialva, G. Shiu, B. Underwood, JHEP 0601, 014 (2006); A. R. Frey, A. Mazumdar, R. Myers, Phys. Rev. D 73, 026003 (2006); X. Chen,\nS. H. Tye, JCAP 0606, 011 (2006).\n[15] I. Klebanov, A. Tseytlin, Nucl.Phys. B 578 (2000) 123138.\n[16] L. Randall, R. Sundrum, Phys. Rev. Lett. 83, 3370\n(1999)\n[17] D. H. Lyth, Phys. Rev. Lett. 78, 1861 (1997).\n[18] D. Baumann, J. Maldacena, L. McAllister, in preparation.\n[19] A. Butti, M. Grana, R. Minasian, M. Petrini, A. Zaffaroni, JHEP 0503 (2005) 069; A. Dymarsky, I. R. Klebanov, N. Seiberg, JHEP 0601 (2006) 155.\n[20] J. P. Gauntlett, D. Martelli, J. Sparks, D. Waldram,\nAdv.Theor.Math.Phys. 8 (2004) 711-734; C. P. Herzog,\nQ. J. Ejaz, I. R. Klebanov, JHEP 0502 (2005) 009.\n[21] J. Simon, et. al., [arXiv:astro-ph/0605371].\n[22] R. Bean, S. Shandera, H. Tye, J. Xu, in preparation.\n\nFIG. 3: a.) The absolute value of the scalar spectral index is\nshown for the AdS (thin blue line) and exact KS (thick black\nline) throats as a function of the redshift factor at the tip htip\nat 55 e-folds back from the end of inflation defined in the text.\nWe have fixed Mp = 100ms . b.) The running of the spectral\nindex also evaluated at 55 e-folds back for the AdS and KS\nthroats.\n\nobservables. Interestingly, the same warped geometry\ncan also leave an observable effect on particle physics observables, e.g., the pattern of soft supersymmetry breaking masses. Hence, combined data from particle physics\nand cosmology may allow us to decipher the underlying\ncompactification geometry. While we explicitly demonstrated these differences by comparing the AdS and KS\nthroats, it is straightforward to extend our analysis to\nother warped geometries as well. For example, it would\nbe interesting to study the signatures of other throats,\ne.g. the baryonic branch of the KS solution [19] and\nother Einstein-Sasaki metrics such as the Yp,q [20], to\nlearn how various warped throats may be distinguished\nfrom each other. Compactifcation effects may show up\nin the CMB for other stringy scenarios, some issues have\nbeen explored [21]. Work along these lines is underway.\nWe thank M. Huang, I. Klebanov, L. McAllister, and\nH. Tye for discussions. We have been informed of a\nforthcoming paper on related issues [22]. This work was\nsupported in part by NSF CAREER Award No. PHY0348093, DOE grant DE-FG-02-95ER40896, a Research\nInnovation Award and a Cottrell Scholar Award from\nResearch Corporation.\n\n4\n\n\f"}