{"id": "http://arxiv.org/abs/hep-th/0304253v1", "guidislink": true, "updated": "2003-04-29T19:05:46Z", "updated_parsed": [2003, 4, 29, 19, 5, 46, 1, 119, 0], "published": "2003-04-29T19:05:46Z", "published_parsed": [2003, 4, 29, 19, 5, 46, 1, 119, 0], "title": "Consistent reductions of IIB*/M* theory and de Sitter supergravity", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-th%2F0311248%2Chep-th%2F0311266%2Chep-th%2F0311132%2Chep-th%2F0311125%2Chep-th%2F0311194%2Chep-th%2F0311127%2Chep-th%2F0311238%2Chep-th%2F0311064%2Chep-th%2F0311260%2Chep-th%2F0311215%2Chep-th%2F0304104%2Chep-th%2F0304029%2Chep-th%2F0304242%2Chep-th%2F0304055%2Chep-th%2F0304160%2Chep-th%2F0304093%2Chep-th%2F0304265%2Chep-th%2F0304027%2Chep-th%2F0304222%2Chep-th%2F0304151%2Chep-th%2F0304054%2Chep-th%2F0304141%2Chep-th%2F0304253%2Chep-th%2F0304060%2Chep-th%2F0304062%2Chep-th%2F0304002%2Chep-th%2F0304255%2Chep-th%2F0304100%2Chep-th%2F0304112%2Chep-th%2F0304001%2Chep-th%2F0304199%2Chep-th%2F0304166%2Chep-th%2F0304101%2Chep-th%2F0304024%2Chep-th%2F0304050%2Chep-th%2F0304162%2Chep-th%2F0304103%2Chep-th%2F0304208%2Chep-th%2F0304195%2Chep-th%2F0304040%2Chep-th%2F0304131%2Chep-th%2F0304157%2Chep-th%2F0304152%2Chep-th%2F0304235%2Chep-th%2F0304086%2Chep-th%2F0304030%2Chep-th%2F0304129%2Chep-th%2F0304075%2Chep-th%2F0304090%2Chep-th%2F0304211%2Chep-th%2F0304109%2Chep-th%2F0304223%2Chep-th%2F0304250%2Chep-th%2F0304180%2Chep-th%2F0304139%2Chep-th%2F0304088%2Chep-th%2F0304034%2Chep-th%2F0304121%2Chep-th%2F0304081%2Chep-th%2F0304091%2Chep-th%2F0304128%2Chep-th%2F0304231%2Chep-th%2F0304125%2Chep-th%2F0304099%2Chep-th%2F0304102%2Chep-th%2F0304191%2Chep-th%2F0304154%2Chep-th%2F0304190%2Chep-th%2F0304056%2Chep-th%2F0304058%2Chep-th%2F0304107%2Chep-th%2F0304145%2Chep-th%2F0304059%2Chep-th%2F0304260%2Chep-th%2F0304245%2Chep-th%2F0304137%2Chep-th%2F0304156%2Chep-th%2F0304049%2Chep-th%2F0304187%2Chep-th%2F0304213%2Chep-th%2F0304020%2Chep-th%2F0304209%2Chep-th%2F0304176%2Chep-th%2F0304089%2Chep-th%2F0304005%2Chep-th%2F0304095%2Chep-th%2F0304153%2Chep-th%2F0304174%2Chep-th%2F0304011%2Chep-th%2F0304178%2Chep-th%2F0304028%2Chep-th%2F0304240%2Chep-th%2F0304008%2Chep-th%2F0304016%2Chep-th%2F0304216%2Chep-th%2F0304186%2Chep-th%2F0304044%2Chep-th%2F0304239%2Chep-th%2F0304035%2Chep-th%2F0304217%2Chep-th%2F0304133&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Consistent reductions of IIB*/M* theory and de Sitter supergravity"}, "summary": "We construct consistent non-linear Kaluza Klein reduction ansatze for a\nsubset of fields arising from the reduction of IIB* and M* theory on dS_5 x H^5\nand dS_4 x AdS_7, respectively. These reductions yield four and\nfive-dimensional de Sitter supergravities, albeit with wrong sign kinetic\nterms. We also demonstrate that the ansatze may be used to lift multi-centered\nde Sitter black hole solutions to ten and eleven dimensions. The lifted dS_5\nblack holes correspond to rotating E4-branes of IIB* theory.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-th%2F0311248%2Chep-th%2F0311266%2Chep-th%2F0311132%2Chep-th%2F0311125%2Chep-th%2F0311194%2Chep-th%2F0311127%2Chep-th%2F0311238%2Chep-th%2F0311064%2Chep-th%2F0311260%2Chep-th%2F0311215%2Chep-th%2F0304104%2Chep-th%2F0304029%2Chep-th%2F0304242%2Chep-th%2F0304055%2Chep-th%2F0304160%2Chep-th%2F0304093%2Chep-th%2F0304265%2Chep-th%2F0304027%2Chep-th%2F0304222%2Chep-th%2F0304151%2Chep-th%2F0304054%2Chep-th%2F0304141%2Chep-th%2F0304253%2Chep-th%2F0304060%2Chep-th%2F0304062%2Chep-th%2F0304002%2Chep-th%2F0304255%2Chep-th%2F0304100%2Chep-th%2F0304112%2Chep-th%2F0304001%2Chep-th%2F0304199%2Chep-th%2F0304166%2Chep-th%2F0304101%2Chep-th%2F0304024%2Chep-th%2F0304050%2Chep-th%2F0304162%2Chep-th%2F0304103%2Chep-th%2F0304208%2Chep-th%2F0304195%2Chep-th%2F0304040%2Chep-th%2F0304131%2Chep-th%2F0304157%2Chep-th%2F0304152%2Chep-th%2F0304235%2Chep-th%2F0304086%2Chep-th%2F0304030%2Chep-th%2F0304129%2Chep-th%2F0304075%2Chep-th%2F0304090%2Chep-th%2F0304211%2Chep-th%2F0304109%2Chep-th%2F0304223%2Chep-th%2F0304250%2Chep-th%2F0304180%2Chep-th%2F0304139%2Chep-th%2F0304088%2Chep-th%2F0304034%2Chep-th%2F0304121%2Chep-th%2F0304081%2Chep-th%2F0304091%2Chep-th%2F0304128%2Chep-th%2F0304231%2Chep-th%2F0304125%2Chep-th%2F0304099%2Chep-th%2F0304102%2Chep-th%2F0304191%2Chep-th%2F0304154%2Chep-th%2F0304190%2Chep-th%2F0304056%2Chep-th%2F0304058%2Chep-th%2F0304107%2Chep-th%2F0304145%2Chep-th%2F0304059%2Chep-th%2F0304260%2Chep-th%2F0304245%2Chep-th%2F0304137%2Chep-th%2F0304156%2Chep-th%2F0304049%2Chep-th%2F0304187%2Chep-th%2F0304213%2Chep-th%2F0304020%2Chep-th%2F0304209%2Chep-th%2F0304176%2Chep-th%2F0304089%2Chep-th%2F0304005%2Chep-th%2F0304095%2Chep-th%2F0304153%2Chep-th%2F0304174%2Chep-th%2F0304011%2Chep-th%2F0304178%2Chep-th%2F0304028%2Chep-th%2F0304240%2Chep-th%2F0304008%2Chep-th%2F0304016%2Chep-th%2F0304216%2Chep-th%2F0304186%2Chep-th%2F0304044%2Chep-th%2F0304239%2Chep-th%2F0304035%2Chep-th%2F0304217%2Chep-th%2F0304133&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We construct consistent non-linear Kaluza Klein reduction ansatze for a\nsubset of fields arising from the reduction of IIB* and M* theory on dS_5 x H^5\nand dS_4 x AdS_7, respectively. These reductions yield four and\nfive-dimensional de Sitter supergravities, albeit with wrong sign kinetic\nterms. We also demonstrate that the ansatze may be used to lift multi-centered\nde Sitter black hole solutions to ten and eleven dimensions. The lifted dS_5\nblack holes correspond to rotating E4-branes of IIB* theory."}, "authors": ["James T. Liu", "W. A. Sabra", "W. Y. Wen"], "author_detail": {"name": "W. Y. Wen"}, "author": "W. Y. Wen", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/1126-6708/2004/01/007", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/hep-th/0304253v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-th/0304253v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "27 pages, latex", "arxiv_primary_category": {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-th/0304253v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-th/0304253v1", "journal_reference": "JHEP 0401 (2004) 007", "doi": "10.1088/1126-6708/2004/01/007", "fulltext": "CAMS/03-04\nMCTP-03-18\nhep-th/0304253\n\narXiv:hep-th/0304253v1 29 Apr 2003\n\nConsistent reductions of IIB∗ /M∗ theory and\nde Sitter supergravity\nJames T. Liu ∗ , W. A. Sabra † and W. Y. Wen ∗,1\n∗\n\nMichigan Center for Theoretical Physics\n\nRandall Laboratory, Department of Physics, University of Michigan\nAnn Arbor, MI 48109–1120, USA\n†\n\nCenter for Advanced Mathematical Sciences (CAMS) and\n\nPhysics Department, American University of Beirut, Lebanon\nAbstract\nWe construct consistent non-linear Kaluza Klein reduction ansatze for a subset of\nfields arising from the reduction of IIB∗ and M∗ theory on dS5 × H 5 and dS4 ×AdS7 ,\nrespectively. These reductions yield four and five-dimensional de Sitter supergravities,\nalbeit with wrong sign kinetic terms. We also demonstrate that the ansatze may be\nused to lift multi-centered de Sitter black hole solutions to ten and eleven dimensions.\nThe lifted dS5 black holes correspond to rotating E4-branes of IIB∗ theory.\n\n1\n\nEmail addresses: jimliu@umich.edu, ws00@aub.edu.lb, wenw@umich.edu\n\n\f1\n\nIntroduction\n\nThe recent observations on the acceleration of the universe has led to renewed interest in de\nSitter backgrounds in cosmology. At the same time, this has led to much debate on whether\nde Sitter space itself is in fact compatible with M-theory. Although several arguments may\nbe made against this possibility, it should be noted that de Sitter spaces naturally arise as\nbackgrounds for the * theories of [1,2,3,4,5]. These * theories are obtained through a timelike\nT-duality of the ordinary string theories, and admit an unconventional effective field theory\ndescription involving wrong sign kinetic energy terms for the RR fields. Because of this and\nother problems, the field theory limits of the * theories appear ill-defined. Nevertheless, so\nlong as one allows T-duality along a timelike circle, one must allow for the existence of such *\ntheories as a component of the full M-theory. It is in this spirit that we choose to investigate\nthe de Sitter supergravities which arise as consistent dimensional reductions of IIB∗ and M∗\ntheory.\nConventional wisdom indicates that de Sitter space is incompatible with supersymmetry.\nThis may be seen, for example, in the standard classification of possible supersymmetry\nalgebras, which allows for both Poincaré and anti-de Sitter superalgebras, but not for the\npossibility of a de Sitter superalgebra. Thus in order to obtain de Sitter supersymmetry,\none must relax one or more of the usual assumptions. Such possibilities were first generally\nstudied in [6, 7]. In the present case, the de Sitter supergravities which we investigate are\nunconventional in that they have wrong sign kinetic energy terms as well as non-compact\ngaugings. Of course, unitary theories do exist with non-compact gaugings. However, as will\nbe explained below, the non-compact symmetries which we consider here are of a different\nnature, and yield mixed sign kinetic terms for the gauge fields. While these properties of\nthe de Sitter supergravities are clearly undesirable, they follow as a natural consequence\nof the underlying * theory. As a result, we leave open the possibility that such de Sitter\nsupergravities would be of relevance for the * theory beyond the field theory limit. It is,\nhowever, possible that the effective field theories which we explore, being unstable, do not\nprovide an adequate description of the full * theory. Nevertheless, one may hope to gain\nadditional insight into de Sitter space and supersymmetry regardless of the ultimate fate of\nthe * theories.\nFor the case of anti-de Sitter supersymmetry, it has long been known that a general-\n\n1\n\n\fized Freund-Rubin compactification yields backgrounds of the form AdS×Sphere. Furthermore, a linearized Kaluza-Klein analysis indicates that the zero mode fluctuations about the\nAdS×Sphere background gives rise to a maximal gauged supergravity in the lower dimensional AdS space. More recently, various full and truncated non-linear Kaluza-Klein reductions have been constructed, demonstrating the consistent embedding of the corresponding\ngauged supergravities in the higher dimensional theory [8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18].\nBased on the observation that such gauged supergravities yield a negative cosmological constant of the form Λ ∼ −g 2 , one may at least formally obtain a de Sitter supergravity through\n\nthe analytic continuation to imaginary coupling constant, namely g → iĝ. While we follow\nthis approach in spirit, it is important to note that the de Sitter supergravities discussed\n\nhere (being descended from * theories) have only real bosonic fields and real gauge couplings\n(although Majorana conditions on the fermions may have to be relaxed).\nThe non-linear Kaluza-Klein ansatze for the conventional sphere reductions allow the embedding of various lower-dimensional solutions into the underlying higher-dimensional theories. For example, R-charged AdS black holes may be lifted to ten and eleven dimensions,\nwhere they take on the nature of rotating branes [9]. Similarly, the consistent reductions\nconstructed below allow us to lift dS black holes into the original * theory. In particular, multi-centered dS black holes have been constructed in [19, 20]; these were furthermore\nshown to satisfy an unconventional supersymmetry involving the imaginary coupling constant mentioned above [20, 21]. Here we demonstrate that such dS black holes provide an\ninteresting cosmological background for * theory and furthermore investigate their lifting\nto ten or eleven dimensions. Such multi-centered black holes have also been considered recently by Behrndt and Cvetič as examples of time-dependent backgrounds in the analytically\ncontinued de Sitter supergravity [22].\nIn the following section we describe the general procedure of obtaining consistent reduction ansatze for * theories. Then in sections 3 and 4 we turn to the specific cases of\nIIB∗ and M∗ reductions, respectively. The latter model is particularly interesting, as it\nadmits a dS4 ×AdS7 background, whereupon either dS4 or AdS7 may be viewed as the lower-\n\ndimensional spacetime. Since both cases arise from the same eleven-dimensional background,\nthis hints at some form of a dS4 /AdS7 duality [23]. Finally, we consider the lifting of dS\nblack holes in section 5, and conclude in section 6.\n\n2\n\n\fGeneralized sphere reductions of IIB∗ and M∗ theory\n\n2\n\nIt has been an important observation that non-dilatonic branes, in particular the D3, M2 and\nM5 branes, serve as interpolating solutions between asymptotic Minkowski and near horizon\nAdS×Sphere geometries (AdS5 × S 5 , AdS4 × S 7 and AdS7 × S 4 , respectively). Alternatively,\n\nthe AdS×Sphere geometry directly arises from a generalized Freund-Rubin compactification. In several cases, the complete non-linear Kaluza-Klein reduction corresponding to such\ngeometries is known. However, it is generally more common that only a truncated ansatz\n(often to a maximal Abelian subgroup of the full gauge group, or with a subset of scalars and\nhigher-rank potentials) has been constructed. Such truncated ansatze are often sufficient for\nthe lifting of solutions such as AdS black holes to the higher dimensional theory.\nWhile it would be desirable to obtain a complete reduction, in this paper we exclusively\nfocus on the truncation to the sector arising from the higher dimensional metric and p-form\nfields. To motivate our approach, consider the Kaluza-Klein sphere reduction ansatz to\nAdSd × S n . In this case, the metric has the general form [15, 16, 17]\nds2D = ∆2/(d−1) ds2d + g −2∆−(d−3)/(d−1) (T −1 )ij Dμi Dμj .\nHere, i and j run from 1 to n+1, and the μi 's satisfy the constraint\n\nP\n\ni\n\n(2.1)\n\nμi 2 = 1, corresponding\n\nto a parametrization of S n . The n-sphere itself is given by the coset space SO(n + 1)/SO(n),\nwhile Tij is a symmetric unimodular matrix consisting of 12 n(n + 3) scalar degrees of freedom\nparameterizing the coset SL(n+1, R)/SO(n+1). The isometry of S n gives rise to a SO(n+1)\n[ij]\n\ngauge symmetry, with gauge potentials A(1) . The gauge covariant derivative is given by, e.g.,\nj\nDμi = dμi + gAij\n(1) μ . Associated with the metric ansatz (2.1) is a corresponding one on the\n\np-form potential (F4 for D = 11, or F5 for IIB). This will be considered in more detail below,\nwhen we specialize to the various cases at hand.\nThe above analysis of the near-horizon dynamics of non-dilatonic branes may be generalized to encompass the * theories of [1, 2]. For example, the IIA∗ and IIB∗ theories admit\nbranes which are the timelike T-duals of ordinary D branes, while M∗ theory admits generalized M2 and M5 branes, all of which may have unusual signatures on their world sheets [3,4].\nIn themselves, these branes are all legitimate solutions of the * theories. However, it has\nbeen noted that they may be obtained from the ordinary brane solutions via appropriate analytic continuations2 . This fact will be important to us below in constructing the generalized\n2\n\nThat this is the case simply follows from the fact that the supergravity description of the * theories may\n\n3\n\n\fsphere reductions.\nJust as the ordinary non-dilatonic branes serve as interpolating solutions between maximally symmetric spaces, the branes of * theory serve a similar role. However, in this case,\nthe near horizon limits are generalizations of the AdS×Sphere geometries to different signatures and different signs of the spacetime and internal space curvatures. In all such cases,\nthe resulting geometries for either spacetime or the internal manifold have the maximally\nsymmetric coset form SO(s + 1, t)/SO(s, t) or SO(s, t + 1)/SO(s, t) where s and t denote\nspace and time dimensions, respectively [4]. It should be noted that the internal spaces are\noften non-compact, and may include time-like coordinates. In particular, M∗ theory admits\nan interesting dS4 ×AdS7 vacuum, which may be obtained as the near horizon of either a M2\n\n(3, 0, −) or a M5 (5, 1, +) brane. This has led to speculation on a possible AdS/CFT duality\n\nbetween the worldvolume theories of M2 and M5, with the roles of spacetime and internal\nspace interchanged [23].\n\nIn order to obtain the non-linear Kaluza-Klein ansatz for reduction on either SO(s +\n1, t)/SO(s, t) or SO(s, t + 1)/SO(s, t), we may analytically continue away from the sphere,\nS n , corresponding to SO(n + 1)/SO(n). More specifically, starting with the homogeneous\nembedding of S n in Rn+1 , given by (μ1 )2 +(μ2 )2 +* * *+(μn+1 )2 = 1, we analytically continue an\nappropriate subset of μi 's, namely3 μi → iμ̂i , while at the same time changing the signature\nof the embedding space in the natural manner. This generalization to a non-compact internal\nspace is conveniently encoded in terms of the Lorentzian metric, ηij , on the embedding space,\nwith the hyperbolic embedding specified by the constraint ηij μ̂i μ̂j = −1. In this case, the\n\ngeneralization of the metric reduction ansatz, (2.1), takes the essentially identical form\nds2D = ∆2/(d−1) ds2d + ĝ −2∆−(d−3)/(d−1) ηij (T̂ −1 )jk ηkl D μ̂i D μ̂l .\n\n(2.2)\n\nNote, however, that while the scalars are still represented by a symmetric matrix T̂ij , they\nnow parametrize the coset SL(s + 1 + t, R)/SO(s + 1, t) or SL(s + t + 1, R)/SO(s, t + 1)\nas appropriate to a generalized signature internal space. As a result, T̂ij may have negative\neigenvalues, and T̂ij = ηij corresponds to the vacuum with no scalar excitations.\nAt this point, it is important to realize that our claim of negative eigenvalues for T̂ij yields\nan unconventional version of non-compact gauging. In an ordinary gauged supergravity\nbe obtained by suitable Wick rotations and analytic continuations of the usual supergravities.\n3\nThroughout this paper, we use a caret to distinguish quantities involved in the generalized reduction\nfrom those of the usual sphere reduction.\n\n4\n\n\ftheory, one may choose to gauge a non-compact group, say, SO(p, q). Nevertheless, all\nfields have conventional kinetic energies, and the theory remains unitary. In particular, the\nequivalent of T̂ij for the conventional supergravity never has negative eigenvalues, regardless\nof the compact versus non-compact nature of the gauging. Furthermore, when the gauging\nis removed by taking g → 0, one recovers the standard ungauged supergravity. For a\n\nconventional non-compact gauging, the gauge group is spontaneously broken to its maximal\n\ncompact subgroup. In this case, it has been shown in [24, 25] that such theories arise from\ndimensional-reductions on non-compact spaces, and that they may be obtained via analytical\ncontinuation in the same spirit that we are advocating here. The difference with the present\ncase, however, is that here we choose to reduce the * theory on the maximally symmetric\nvacuum. In particular, this means that, even in the ungauged limit, we retain both compact\nand non-compact gauge fields (with both positive and negative kinetic terms, related to the\neigenvalues of ηij ). In the framework of [24], we would be expanding about an unstable\nvacuum. However we leave this issue as one that must be resolved by the underlying *\ntheory.\nWhile (2.2) is the universal form of the metric ansatz for a generalized internal space,\nwe have at the moment left the nature of the p-form field unspecified. To proceed, we must\nspecialize to a particular theory. This is what we carry out in the next section (for IIB∗\ntheory) and the subsequent one (for M∗ theory).\n\n3\n\nThe H 5 reduction of IIB∗ supergravity\n\nThe bosonic sector of IIB supergravity consists of the metric, dilaton and 3-form field strength\nH(3) in the NSNS sector, as well as F(1) , F(3) and F(5) in the RR sector. The complete\nS 5 reduction of type IIB supergravity gives rise to five-dimensional SO(6) gauged N = 8\nsupergravity. However, by considering the truncation of IIB supergravity to only the metric\nand self-dual 5-form, one ends up in five dimensions with a truncation of N = 8 supergravity\nto a bosonic system with SO(6) gauge fields and 20 scalars. The consistent S 5 reduction in\nthis subsector (which is the one most directly relevant to the D3-brane) was given in [17],\nand has the form\nds210 = ∆1/2 ds25 + g −2∆−1/2 (T −1 )ij Dμi Dμj ,\nF(5) = G(5) + ∗G(5) ,\n5\n\n\f1\nij\n∧ Dμk ∧ Dμl ,\nG(5) = −gUǫ(5) + g −1((T −1 )ij  ̄∗DTjk ) ∧ (μk Dμi ) − g −2 (T −1 )ik (T −1 )jl  ̄∗F(2)\n2\n(3.1)\nwhere\nU = 2Tij Tjk μi μk − ∆Tii ,\n\n∆ = Tij μi μj .\n\n(3.2)\n[ij]\n\nHere, ǫ(5) is the volume 5-form in the spacetime. As usual, the field strength F(2) and gauge\n[ij]\n\ncovariant derivatives are given in terms of the SO(6) gauge fields A(1) by\nkj\nij\nik\n= dAij\nF(2)\n(1) + gA(1) ∧ A(1) ,\njk\nDTij = dTij + gAik\n(1) Tkj + gA(1) Tik ,\nj\nDμi = dμi + gAij\n(1) μ .\n\n(3.3)\n\nWe mostly follow the notation of [17], except that we reserve the caret to denote quantities\nrelevant to * theory. The coordinates, μi , are subject to the constraint δij μi μj = 1, and\nparametrize the internal S 5 .\nWe now recall that IIB∗ supergravity with signature (9, 1) may be obtained from IIB\ntheory by changing the signs of the RR kinetic terms. In particular, the wrong-sign kinetic\nterm for the self-dual 5-form gives rise to the ten-dimensional Einstein equation\nRM N = −\n\n1\nF̂M P QRS F̂N P QRS ,\n2 * 2 * 4!\n\n(3.4)\n\nwhich in turn leads to a dS5 × H 5 Freund-Rubin vacuum. This simply corresponds to an\n\ninterchange of positive and negative curvatures between spacetime and internal space (as\nis evident from the extra sign in the above Einstein equation). It should now be evident\nhow the appropriate IIB∗ reduction ansatz may be obtained by the analytic continuation\nof (3.1). To generate the wrong-sign kinetic term, we take F(5) → iF̂(5) . However, since\n\nG(5) = −gUǫ(5) + * * *, we avoid a resulting imaginary Ĝ(5) by simultaneously taking g → iĝ.\n\nAt this stage, we find\n\nds210 = ∆1/2 ds25 − ĝ −2 ∆−1/2 (T −1 )ij Dμi Dμj ,\n\ni\nij\nĜ(5) = −ĝUǫ(5) − ĝ −1((T −1 )ij  ̄∗DTjk ) ∧ (μk Dμi ) − ĝ −2 (T −1 )ik (T −1 )jl  ̄∗F(2)\n∧ Dμk ∧ Dμl .\n2\n(3.5)\n\nHere, we implicitly assume that both U and ∆ remain real quantities throughout the analytic\ncontinuation. This intermediate result for the metric and 5-form is unsatisfactory in that the\n6\n\n\finternal five-dimensional space has the wrong signature and that Ĝ(5) is still complex because\nof the factor of i in the last term. Both issues may be solved by the analytic continuation\nμi → iμ̂i ,\n\nμ6 → μ̂6 ,\n\nij\nAij\n(1) → −iÂ(1) ,\n\nA(1) → −Â(1)\n\n[i6]\n\n[i6]\n\n(i, j = 1, . . . , 5).\n\n(3.6)\n\nIt is this step that changes the μi 's from parameterizing S 5 as SO(6)/SO(5) to parameterizing\nH 5 as SO(5, 1)/SO(5). At the same time, the analytic continuation of the gauge fields leads\nto the non-compact gauge group SO(5, 1).\nIn order for U and ∆ to be real, we finally continue appropriate entries in the Tij matrix,\nnamely\nTij → T̂ij ,\n\nT(i6) → iT̂(i6) ,\n\nT66 → −T̂66\n\n(i, j = 1, . . . , 5),\n\n(3.7)\n\nwith corresponding inverse\n(T −1 )ij → (T̂ −1)ij ,\n\n(T −1 )(i6) → −i(T̂ −1 )(i6) ,\n\n(T −1 )66 → −(T̂ −1 )66\n(i, j = 1, . . . , 5). (3.8)\n\nNote that T̂ has a single negative eigenvalue, and det T̂ = −1. We reiterate that this negative\n\neigenvalue results in both correct and wrong-sign gauge kinetic energy terms showing up,\n\ndepending on the non-compact versus compact nature of the corresponding generator. The\nresulting reduction ansatz for IIB∗ theory on dS5 × H 5 is most conveniently given in terms\n\nof the SO(5, 1) metric ηij = diag(+, +, +, +, +, −). We find\n\nds210 = ∆1/2 ds25 + ĝ −2 ∆−1/2 ηij (T̂ −1 )jk ηkl D μ̂i D μ̂l ,\nF̂(5) = Ĝ(5) + ∗Ĝ(5) ,\nĜ(5) = −ĝUǫ(5) + ĝ −1(ηij (T̂ −1 )jk ∗ ̄D T̂kl ) ∧ (μ̂l D μ̂i )\n1\nim\n∧ (D μ̂l ∧ D μ̂q ),\n− ĝ −2ηij (T̂ −1 )jk ηkl ηmn (T̂ −1 )np ηpq ∗ ̄F̂(2)\n2\n\n(3.9)\n\nwhere\nU = −2T̂ij η jk T̂kl μ̂i μ̂l − ∆η ij T̂ij ,\n\n∆ = −T̂ij μ̂i μ̂j ,\n\nηij μ̂i μ̂j = −1,\n\n(3.10)\n\nand the gauge covariant derivatives are given by\nij\nlj\nik\nF̂(2)\n= dÂij\n(1) + ĝηkl Â(1) ∧ Â(1) ,\nkl\nD T̂ij = dT̂ij + ĝηik Âkl\n(1) T̂lj + ĝηjk Â(1) T̂il ,\nk\nD μ̂i = dμ̂i + ĝηjk Âij\n(1) μ̂ .\n\n7\n\n(3.11)\n\n\fAlthough the structure of the non-compact gauging is perhaps obvious in this reduction, to\navoid confusion we will always retain explicit factors of the SO(5, 1) metric ηij .\nSince this reduction of IIB∗ supergravity on dS5 × H 5 was obtained by appropriate con-\n\ntinuation of the ansatz given in [17], it follows that the resulting five-dimensional Lagrangian\nmay similarly be obtained through analytic continuation. The resulting Lagrangian has the\nform [17]\n1\n1\nlq\nim\nL5 = R ∗ ̄1 − (T̂ −1 )ij  ̄∗D T̂jk ∧ (T̂ −1 )kl D T̂li + ηij (T̂ −1 )jk ηkl ηmn (T̂ −1 )np ηpq ∗ ̄F̂(2)\n∧ F̂(2)\n4\n4\n\u0010\n1\ni1 i2 i3 i4 i5 i6\ni1 i2 i3 i4 i5 j\n6\nF̂(2) Â(1) − ĝ F̂(2)\nÂ(1) Â(1) ηjk Âki\n−V ∗ ̄1 − ǫi1 i2 i3 i4 i5 i6 F̂(2)\n(1)\n48\n\u0011\n2\n+ ĝ 2 Âi1 i2 Âi3 j ηjk Âki4 Âi5 l ηlm Âmi6 .\n(3.12)\n5\nThis corresponds to a truncation of maximally symmetric SO(5, 1) gauged de Sitter supergravity.\n\nNote that the kinetic terms for the gauge fields in the compact subgroup\n\nSO(5) ⊂ SO(5, 1) have the wrong sign, as expected in the ∗ theory. In addition, the\npotential\n\n\u0011\n1 \u0010\nV = − ĝ 2 2T̂ij η jk T̂kl η li − (η ij T̂ij )2 ,\n2\n\n(3.13)\n\nhas opposite sign from the sphere case, and yields a maximally symmetric dS5 vacuum,\ninvariant under the de Sitter supergroup SU ∗ (4|4). Note that this is the opposite sign of the\nSO(6) but not the SO(5, 1) potential of [26, 27, 28] since in the present case Tij η jk has all\npositive eigenvalues.\n\n3.1\n\nTruncation to D = 5, N = 2 de Sitter supergravity\n\nThe maximal N = 8 SO(6) gauged anti-de Sitter supergravity has a natural U(1)3 truncation\nto N = 2 gauged supergravity coupled to two vector multiplets. The bosonic fields of this\ntruncation comprise the metric, two scalars and three gauge fields. The three gauge fields\nare naturally taken to be the mutually commuting subset A12 , A34 and A56 of the full SO(6)\ngauge fields. At the same time, the two scalars originate from the parametrization of Tij as\nT = diag(X1 , X1 , X2 , X2 , X3 , X3 ), with the constraint X1 X2 X3 = 1.\nTurning to the de Sitter supergravity, on the other hand, the maximal compact subgroup\nSO(5) ⊂ SO(5, 1) does not admit a U(1)3 truncation. Nevertheless, we may perform an\n\nanalogous truncation to two compact and one non-compact U(1) gauge fields. To do so, we\n\n8\n\n\flet\nA1 = Â12 ,\n\nA2 = Â34 ,\n\nA3 = Â56 ,\n\n(3.14)\n\nwhere A3 is the non-compact gauge field. In addition, the scalars may be given by T̂ =\ndiag(X1 , X1 , X2 , X2 , X3 , −X3 ), with X1 X2 X3 = 1.\n\nSince the choice of U(1)3 truncation corresponds to taking mutually commuting rota-\n\ntion (boost) planes along the 1-2, 3-4 and 5-6 directions, it is natural to parametrize the\nhyperboloid H 5 by taking\nμ̂ = {μ1 sin φ1 , μ1 cos φ1 , μ2 sin φ2 , μ2 cos φ2 , μ3 sinh φ3 , μ3 cosh φ3 }.\n\n(3.15)\n\nIn this case, the constraint ηij μ̂i μ̂j = −1 turns into μ21 + μ22 − μ23 = −1, and the reduction\n\nansatz (3.9) becomes\n\nds210 = ∆1/2 ds25 + ĝ −2 ∆−1/2\n\n3\nX\n\nXi−1 (ηi dμ2i + μ2i (dφi + ĝAi )2 ),\n\ni=1\n\nF̂(5) = Ĝ(5) + ∗Ĝ(5) ,\nĜ(5) = 2ĝ\n\n3\nX\n1\nηi Xi−1 ∗ ̄dXi ∧ d(μ2i )\n(ηi Xi2 μ2i + ∆Xi )ǫ(5) + ĝ −1\n2\ni=1\ni=1\n\n3\nX\n\n3\nX\n1\n+ ĝ −2\nηi Xi−2 d(μ2i ) ∧ (dφi − ĝAi ) ∧ ∗ ̄F i ,\n2\ni=1\n\nwhere ∆ = −\n\nP3\n\ni=1\n\n(3.16)\n\nηi Xi μ2i and ηi = (+1, +1, −1), signifying the non-compact nature of H 5 .\n\nInserting the above U(1)3 truncation into (3.12), we obtain the Lagrangian describing the\nbosonic sector of the N = 2 theory:\ne−1 L5 = R ̄∗1− 21  ̄∗dφ1 ∧dφ1 − 21 ∗ ̄dφ2 ∧dφ2 −V ∗ ̄1+ 12\n\n3\nX\ni=1\n\nηi Xi−2 ∗ ̄F i ∧F i −F 1 ∧F 2 ∧A3 . (3.17)\n\nHere we have chosen to parametrize the scalars in terms of two dilatons φ\n~ = {φ1 , φ2 }\n\naccording to\n\n1\n\nXi = e− 2 ~ai *~φ ,\n\n~ai * ~aj = 4δij − 43 .\n\n(3.18)\n\nNote that the first two compact gauge fields in (3.17) have wrong sign kinetic terms,\nwhile the non-compact gauge field, which would ordinarily have come in with the wrong\nsign, now enters with the proper one. The potential is positive definite, and has the form\nV = 4ĝ 2\n\nP\n\ni\n\nXi−1 . While we have started with a truncation of the D = 5, N = 8 theory, the\n\nN = 2 content is complete. Thus from an N = 2 perspective, we have obtained a consistent\n9\n\n\freduction of IIB∗ theory (followed by truncation) to N = 2 de Sitter supergravity in five\ndimensions coupled to two vector multiplets, at least in the bosonic sector.\n\n√\nWe may further truncate the bosonic Lagrangian (3.17) by setting F 1 = F 2 = F/ 2\n−1/2\n\nalong with X1 = X2 = X3\n\n− √1 φ\n\n=e\n\n6\n\n. The resulting Lagrangian is that of N = 2 de Sitter\n\nsupergravity coupled to a single vector multiplet\ne−1 L5 = R ̄∗1− 21 ∗ ̄dφ∧dφ−4ĝ 2(2e\n\n√1 φ\n6\n\n− √2 φ\n\n+e\n\n6\n\n) ̄∗1+ 21 e\n\n√2 φ\n6\n\n ̄∗F ∧F − 21 e−\n\n√4 φ\n6\n\n ̄∗F ∧F − 21 F ∧F ∧A.\n(3.19)\n\nHere A = A3 denotes the non-compact gauge field.\n\nThe anti-de Sitter supergravity, where both F and F have proper kinetic terms, admits\n\none further truncation to eliminate the remaining vector multiplet by setting φ = 0 and\n√\nA = 2A. However, in this case, a consistent truncation to φ = 0 involves satisfying the\ncondition  ̄∗F ∧ F +  ̄∗F ∧ F = 0, which arises from the φ equation of motion. Since this\ncondition cannot be met for real gauge fields, we are unable to reduce the de Sitter theory\nof (3.19) any further.\nIt should be noted, of course, that were one to simply analytically continue from the\ntruncated N = 2 anti-de Sitter supergravity Lagrangian to obtain the pure supergravity\n√\ntruncation of (3.17), one would have to set iF 1 = iF 2 = F 3 = F/ 3 in order to obtain\ne−1 L5 = R ̄∗1 − 12ĝ 2  ̄∗1 − 21 ∗ ̄F ∧ F +\n\n1\n√\nF\n3 3\n\n∧ F ∧ A.\n\n(3.20)\n\nWhile this appears to yield a desirable theory with proper sign kinetic term and positive\ncosmological constant, we emphasize that this cannot be viewed as a reduction of IIB nor of\nIIB∗ theory, since this would necessarily involve imaginary (or in general complex) bosonic\nfields.\n\n4\n\nReductions of M ∗-theory\n\nIn the previous section we have examined the H 5 reduction of IIB∗ supergravity, which\ngives rise to a de Sitter supergravity in five dimensions. Of course, similar techniques may\nbe applied for the reduction of M ∗ theory. In particular, we now turn to the dS4 ×AdS7\n\n∗\nreduction of M(9,2)\ntheory. Since this theory has two time directions, an interesting feature\n\narises in that we have the freedom of regarding either dS4 or AdS7 as the spacetime, with the\nother factor considered as an internal space. We now examine both possibilities in detail.\n10\n\n\f4.1\n\nThe AdS7 reduction of M∗ theory\n\nBy taking AdS7 as a compactification space, the resulting reduction will yield a fourdimensional de Sitter supergravity theory with non-compact gauge symmetry SO(6, 2). As\nbefore, we begin with the truncated S 7 reduction ansatz of M-theory, given by [15]\nds211 = ∆2/3 ds24 + g −2∆−1/3 Tij−1 Dμi Dμj ,\n\n(4.1)\n\n1\nij\nF(4) = −gUǫ(4) + g −1((T −1 )ij  ̄∗DTjk ) ∧ (μk Dμi ) − g −2 (T −1 )ik (T −1 )jl  ̄∗F(2)\n∧ Dμk ∧ Dμl ,\n2\n(4.2)\nwhere\nU = 2Tij Tjk μi μk − ∆Tii ,\n\n∆ = Tij μi μj ,\n\n(4.3)\n\nand δij μi μj = 1 (with i, j = 1, 2, . . . , 8) so that the μi coordinates parametrize a seven-sphere.\n[ij]\n\nThis ansatz retains the full set of SO(8) Yang-Mills fields, A(1) , which satisfy the standard\nrelations given by (3.3). In addition, there are 35 scalars represented by the symmetric\nunimodular matrix Tij , and which are described by the coset SL(8, R)/SO(8). Note that\nthe 35 pseudo-scalars of D = 4, N = 8 have been truncated away, and as a result this is\ntechnically not a consistent truncation. Nevertheless, this ansatz may be used to lift a large\nclass of four-dimensional solutions without axions.\nThe M∗(9,2) supergravity may be formally obtained from M-theory by analytically continuing the four-form, F(4) → iF̂(4) , while simultaneously performing a Wick rotation on one\n\nof the spatial coordinates (so as to yield a theory with two times). For the Freund-Rubin\n\nansatz leading to AdS4 × S 7 , it is clear that the Wick rotation should be performed on one\nof the seven sphere coordinates, thus yielding AdS4 ×dS7 . The analytic continuation on F(4)\n\nthen finally gives the dS4 ×AdS7 solution of M∗(9,2) . As a result, this leads us to make the\ncontinuation g → iĝ along with a reparametrization of the sphere coordinates\nμi → iμ̂i ,\n\nμm → μ̂m\n\n(i = 1, . . . , 6,\n\nm = 7, 8).\n\n(4.4)\n\nThe resulting μ̂'s now parametrize AdS7 in terms of an SO(6, 2)/SO(6, 1) coset.\nIn addition, we must analytically continue the gauge fields\nij\nAij\n(1) → −iÂ(1) ,\n\n[im]\n\n[im]\n\nA(1) → −Â(1) ,\n\n[mn]\n\n[mn]\n\nA(1) → iÂ(1)\n\n11\n\n(i, j = 1, . . . , 6,\n\nm, n = 7, 8),\n(4.5)\n\n\fas well as the scalar matrix\nTij → T̂ij ,\n\nT(im) → iT̂(im) ,\n\nTmn → −T̂mn\n\n(i, j = 1, . . . , 6,\n\nm, n = 7, 8).\n\n(4.6)\n\nThe analytic continuation of the gauge fields leads to a non-compact gauge group SO(6, 2).\nAs a result, the reduction ansatz for M∗(9,2) theory on dS4 × AdS7 is given by\nds211 = ∆2/3 ds24 + ĝ −2 ∆−1/3 ηij (T̂ −1 )jk ηkl D μ̂i D μ̂l ,\nF̂(4) = −ĝUǫ(4) + ĝ −1(ηij (T̂ −1 )jk  ̄∗D T̂kl ) ∧ (μ̂l D μ̂i )\n1\nim\n− ĝ −2ηij (T̂ −1 )jk ηkl ηmn (T̂ −1 )np ηpq ∗ ̄F̂(2)\n∧ (D μ̂l ∧ D μ̂q ),\n2\n\n(4.7)\n\nwhere\nU = −2T̂ij η jk T̂kl μ̂i μ̂l − ∆η ij T̂ij ,\n\n∆ = −T̂ij μ̂i μ̂j ,\n\nηij μ̂i μ̂j = −1.\n\n(4.8)\n\nHere, ηij = diag(+, +, +, +, +, +, −, −) is the SO(6, 2) invariant metric. The SO(6, 2) co-\n\nvariant derivatives may be written in a straightforward manner using ηij when appropriate,\nand have the same structure as those of (3.11).\nThe resulting four-dimensional Lagrangian has the form\n1\n1\nlq\nim\n∧ F̂(2)\nL4 = R ∗ ̄1 − (T̂ −1 )ij  ̄∗D T̂jk ∧ (T̂ −1 )kl D T̂li + ηij (T̂ −1 )jk ηkl ηmn (T̂ −1 )np ηpq ∗ ̄F̂(2)\n4\n4\n ̄\n−V ∗1,\n(4.9)\nand corresponds to a truncation (without pseudoscalars) of the bosonic sector of N = 8,\nSO(6, 2) gauged de Sitter supergravity. The potential is given by\n\u0011\n1 \u0010\nV = − ĝ 2 2T̂ij η jk T̂kl η li − (η ij T̂ij )2 ,\n2\n\n(4.10)\n\nand yields a maximally symmetric dS4 vacuum. In addition, the gauge fields in the compact\nsubgroup SO(6) × SO(2) ⊂ SO(6, 2) have wrong sign kinetic terms.\n\n4.2\n\nTruncation to D = 4, N = 2 de Sitter supergravity\n\nAlthough the N = 8 de Sitter supergravity has a non-compact SO(6, 2) gauge group, it\nnevertheless admits a natural U(1)4 ⊂ SO(6) × SO(2) ⊂ SO(6, 2) truncation to N = 2 de\n\nSitter supergravity coupled to three vector multiplets. The four gauge fields are naturally\ntaken as\nA1 = Â12 ,\n\nA2 = Â34 ,\n\nA3 = Â56 ,\n12\n\nA4 = Â78 ,\n\n(4.11)\n\n\fwhere we follow the notation of the previous section that i, j = 1, . . . , 6 are SO(6) indices,\nwhile m, n = 7, 8 are SO(2) indices. This choice of parametrization also suggests that we\ntake\nμ̂ = {μa sin φa , μa cos φa },\n\na = 1, . . . , 4.\n\n(4.12)\n\nNote that φ4 has the conventional interpretation as a periodic AdS7 time coordinate. Thus\nA4 , the SO(2) gauge field, is necessarily connected to gauging the isometry related to the\n∗\nsecond time direction of the M(9,2)\ntheory.\n\nCorresponding to this choice of truncation, we take the surviving scalars to be given by\nT̂ = diag(X1 , X1 , X2 , X2 , X3 , X3 , −X4 , −X4 ), where X1 X2 X3 X4 = 1. The background AdS7\n\ngeometry is determined by the constraint ηij μ̂i μ̂j = −1, or equivalently μ21 +μ22 +μ23 −μ24 = −1.\nThe truncation of (4.7) is then\n\nds211 = ∆2/3 ds24 + ĝ −2 ∆−1/3\n\n4\nX\n\nXi−1 ηi (dμ2i + μ2i (dφi + ĝAi )2 ),\n\ni=1\n\nF̂(4) = 2ĝ\n\n4\nX\n\n4\nX\n1\n(ηi Xi2 μ2i + ∆Xi )ǫ(4) + ĝ −1\nηi Xi−1 ∗ ̄dXi ∧ d(μ2i )\n2\ni=1\ni=1\n\n4\nX\n1\n+ ĝ −2\nηi Xi−2 d(μ2i ) ∧ (dφi − ĝAi ) ∧ ∗ ̄F i ,\n2\ni=1\n\nwhere ∆ = −\n\nP4\n\ni=1\n\nby the Lagrangian\n\n(4.13)\n\nηi Xi μ2i and ηi = (+1, +1, +1, −1). The resulting theory may be described\n\ne−1 L4 = R ̄∗1 −\n\n1\n2\n\n3\nX\n\nα=1\n\n∗ ̄dφα ∧ dφα +\n\nwhere\nV = 4ĝ\n\n2\n\nX\n\n1\n2\n\nXi Xj = 8ĝ\n\n2\n\n4\nX\n\nXi−2  ̄∗F i ∧ F i − V ∗ ̄1,\n\n(4.14)\n\n3\nX\n\ncosh φα\n\n(4.15)\n\ni=1\n\nα=1\n\ni<j\n\nis positive definite. Here the Xi scalars are parametrized in terms of three dilatons φ\n~ =\n{φ1 , φ2 , φ3 } according to\n1\n\nXi = e− 2 ~ai *~φ ,\n\n~ai * ~aj = 4δij − 1.\n\n(4.16)\n\nThis Lagrangian is simply the U(1)4 truncation of (4.9). Unlike the D = 5, N = 2 de\nSitter theory of (3.19), here all four U(1) fields are compact (and all have wrong sign kinetic\nterms). Note furthermore that, as already mentioned previously, (4.14) cannot be viewed as\n∗\na consistent N = 2 reduction of M(9,2)\ntheory, as it is missing three axionic scalars. Hence\n\n13\n\n\fthe vector multiples are incomplete. This truncation with only dilatonic scalars is similar to\nthat considered in [29] for the truncated N = 8 anti-de Sitter supergravity.\n\n√\nWe may further truncate the bosonic Lagrangian (4.14) by setting F 1 = F 2 = F/ 2 and\n√\n1\nF 3 = F 4 = F / 2 along with X1 = X2 = X3−1 = X4−1 = e 2 φ . The resulting Lagrangian is\n\nthat of N = 2 de Sitter supergravity coupled to a single vector multiplet\n\ne−1 L4 = R ̄∗1 − 12 ∗ ̄dφ ∧ dφ − 8ĝ 2(2 + cosh φ) ̄∗1 + 21 e−φ ∗ ̄F ∧ F + 12 eφ ∗ ̄F ∧ F .\n\n(4.17)\n\nWhile this theory is still incomplete in that it lacks an axion, one further truncation to pure\nN = 2 de Sitter supergravity is possible by equating the U(1) fields and setting φ = 0. The\npure supergravity Lagrangian is\ne−1 L4 = R ̄∗1 − 24ĝ 2∗ ̄1 + 21 ∗ ̄F ∧ F,\n\n(4.18)\n\nand concisely captures both features of * theory, namely a positive cosmological constant\nand wrong-sign kinetic term for the graviphoton.\n\n4.3\n\nThe dS4 reduction of M∗ theory\n\nWe now consider the second possibility for interpreting the dS4 ×AdS7 compactification of\n∗\nM(9,2)\ntheory, namely where we view the resulting theory as a seven dimensional anti-de\n\nSitter supergravity with SO(4, 1) gauging. This case is especially interesting in that the\ncomplete consistent Kaluza-Klein reduction of ordinary eleven-dimensional supergravity to\nseven dimensions is known from the work of [10, 11]. Thus, unlike in the cases considered\nabove, there is no need to truncate.\n∗\nTo obtain the dS4 reduction of M(9,2)\ntheory, we analytically continue and Wick rotate\n\nthe ansatz obtained in [11, 30], which is given by\nds11 = ∆1/3 ds27 + g −2∆−2/3 Tij−1 Dμi Dμj ,\n1\nij\n∧ Dμk ∧ Dμl\n∗11 F(4) = −gUǫ(7) − g −1 (Tij−1  ̄∗DTjk ) ∧ (μk Dμi ) + g −2Tik−1 Tjl−1 ∗ ̄F(2)\n2\n1 −3 −1\nm\n−4 −1\ni\nj\nTim Tjk μk ∧ Dμl1 ∧ Dμl2 ∧ Dμl3 ,\n+g ∆ Tij S(3) μ ∧ W − g ∆ ǫijl1 l2 l3 ∗ ̄S(3)\n6\n(4.19)\nwhere\nU = 2Tij Tjk μi μk − ∆Tii ,\nW =\n\n1\nǫ\nμi1 Dμi2\n4! i1 i2 i3 i4 i5\n\n∆ = Tij μi μj ,\n\n∧ Dμi3 ∧ Dμi4 ∧ Dμi5 .\n\n14\n\n(4.20)\n\n\fThe full reduction gives rise to N = 4 gauged SO(5) supergravity in seven dimensions. The\nbosonic fields consist of 14 scalars given by the symmetric unimodular Tij which describe the\n[ij]\n\ni\ncoset SL(5, R)/SO(5), the SO(5) gauge fields A(1) , and 5 three-form potentials S(3)\ntrans-\n\nforming in the fundamental of SO(5). Note that the reduction is given on the dual of the\neleven-dimensional four-form, ∗11 F(4) , with ǫ(7) corresponding to the volume 7-form in space-\n\ntime. In addition, the coordinates μi , subject to the constraint δij μi μj = 1, parameterize\nthe unit four-sphere.\n\nThe analytic continuation to * theory is different from the previous cases, since here\nthis is no need to take g → iĝ. This is because the simultaneous continuation F(4) →\n\niF̂(4) along with Wick rotation of one of the S 4 coordinates leaves the present four-form\nansatz unchanged. To see this, consider the pure AdS7 × S 4 solution, given essentially by\n\nF(4) = g dx7 ∧ dx8 ∧ dx9 ∧ dx10 . While F(4) picks up an i, so does, say, dx10 . The only\n\nimportant modification is then to replace the S 4 coset structure SO(5)/SO(4) by the dS4\n\ncoset SO(4, 1)/SO(3, 1) by analytic continuation on the μi 's. The combined transformation,\nincluding that of 1-form and 3-form potentials is given by\nμi → μ̂i ,\n\nμ5 → iμ̂5 ,\n\ni\ni\n,\n→ Ŝ(3)\nS(3)\n\n5\n5\n,\n→ iŜ(3)\nS(3)\n\n[ij]\n\n[ij]\n\n[i5]\n\nA(1) → Â(1) ,\n\n[i5]\n\nA(1) → iÂ(1)\n\n(i, j = 1, . . . , 4). (4.21)\n\nIn order for U and ∆ to be real, we also continue appropriate entries in the Tij matrix,\nnamely\nTij → T̂ij ,\n\nT(i5) → −iT̂(i5) ,\n\nT55 → −T̂55\n\n(i, j = 1, . . . , 4).\n\n(4.22)\n\n∗\nThe resulting reduction ansatz for M(9,2)\ntheory on dS4 ×AdS7 may be given in terms of the\n\nSO(4, 1) metric ηij = diag(+, +, +, +, −). We find\n\nds211 = ∆1/3 ds27 + g −2 ∆−2/3 ηij (T̂ −1 )jk ηkl D μ̂i D μ̂l ,\n∗11 F̂(4) = −gUǫ(7) − g −1(ηij (T̂ −1 )jk ∗ ̄D T̂kl ) ∧ (μ̂l D μ̂i )\n1\nim\n∧ D μ̂l ∧ D μ̂q\n+ g −2 ηij (T̂ −1 )jk ηkl ηmn (T̂ −1 )np ηpq  ̄∗F̂(2)\n2\ni\nμ̂j ∧ Ŵ\n+g −4∆−1 T̂ij Ŝ(3)\n1\nm\n− g −3 ∆−1 ǫ̂ijl1 l2 l3 η in η jp  ̄∗Ŝ(3)\nT̂nm T̂pk μk ∧ D̂μl1 ∧ D̂μl2 ∧ D̂μl3 , (4.23)\n6\nwhere\nU = 2T̂ij η jk T̂kl μ̂i μ̂l − ∆η ij T̂ij ,\nŴ =\n\n∆ = T̂ij μ̂i μ̂j ,\n\n1\nǫ̂\nμ̂i1 D̂μi2\n4! i1 i2 i3 i4 i5\n\nηij μ̂i μ̂j = 1,\n\n∧ D̂μi3 ∧ D̂μi4 ∧ D̂μi5 .\n\n15\n\n(4.24)\n\n\fNote that ǫ̂ijklm is the SO(4, 1) invariant antisymmetric tensor.\nThe resulting Lagrangian has the form\n1\n1\nlq\nim\nL7 = R ∗ ̄1 − (T̂ −1 )ij  ̄∗D T̂jk ∧ (T̂ −1 )kl D T̂li − ηij (T̂ −1 )jk ηkl ηmn (T̂ −1 )np ηpq  ̄∗F̂(2)\n∧ F̂(2)\n4\n4\n1\n1\n1\nj\nj\nj1 j2\nj3 j4\ni\ni\ni\n− T̂ij  ̄∗Ŝ(3) ∧ Ŝ(3) + ηij Ŝ(3) ∧ Ĥ(4) − ǫ̂ij1 j2 j3 j4 Ŝ(3)\n∧ F̂(2)\n∧ F̂(2)\n− V ∗ ̄1\n2\n2g\n8\n+(Chern-Simons),\n(4.25)\nwhere\nj\ni\ni\nĤ(4)\n= dŜ(3)\n+ g Âik ηkj Ŝ(3)\n.\n\n(4.26)\n\nThis resulting theory is simply an unusual non-compact gauging of maximal D = 7 supergravity. In particular, both the SO(4, 1) gauge fields and the potential\n\u0011\n1 \u0010\nV = g 2 2T̂ij η jk T̂kl η li − (η ij T̂ij )2 ,\n2\n\n(4.27)\n\n∗\nhave their usual signs, despite the M(9,2)\norigin of this theory.\n\n4.4\n\nTruncation of the D = 7 theory\n\nThe D = 7, N = 4 theory constructed above admits a truncation to N = 2 supergravity\ncoupled to an N = 2 vector. The fields in the supergravity multiplet consist of the metric gμν ,\n1 ijkl kl\nÂ(1) ,\nthree gauge bosons in the adjoint of SU(2)+ ⊂ SO(4) ⊂ SO(4, 1), namely Âij\n(1) + 2 ǫ\n5\na single three-form potential Ŝ(3)\n, and a dilaton scalar φ. In addition, the vector multiplet\n\nconsists of a single U(1) gauge potential contained in SO(2)− and three axionic scalars. In\nprinciple, it is straightforward to consistently truncate the above reduction to yield the N = 2\ntheory. However, the presence of the non-abelian graviphotons and the axionic scalars results\nin some complication. We choose here not to pursue this truncation, but instead focus on\na two U(1) truncation with U(1)2 ⊂ SO(4, 1), while simultaneously retaining two dilatonic\n\nscalars [9]. While this is not a consistent truncation, it may still be used to lift solutions to\neleven dimensions.\nTo obtain this U(1)2 truncation of the full theory, we parametrize the internal dS4 by\n\n2\n34\n(μ1 sin φ1 , μ1 cos φ1 , μ2 sin φ2 , μ2 cos φ2 , μ0). Only two gauge fields, A1 = Â12\n(1) and A = Â(1) ,\n\nare kept as well as T̂ = diag(X 1 , X 1 , X 2 , X 2 , −X 0 ). The rest of the fields are truncated.\n\nThe reduction ansatz, (4.23), then becomes\n\nds211 = ∆1/3 ds27 + g −2 ∆−2/3 (−X0−1 dμ20 +\n\n2\nX\ni=1\n\n16\n\nXi−1 (dμ2i + μ2i (dφi + gAi )2 ),\n\n\f∗11 F̂(4) = 2g\n\n2\nX\n1\nXi−1  ̄∗dXi ∧ d(μ2i )\n(Xi2 μ2i − ∆Xi )ǫ(7) − g(2X02μ20 − ∆X0 )ǫ(7) + g −1\n2\ni=1\ni=1\n\n2\nX\n\n2\nX\n1\n1\nηi Xi−2 d(μ2i ) ∧ (dφi − ĝAi ) ∧ ∗ ̄F i , (4.28)\n− g −1 X0−1 ∗ ̄dX0 ∧ d(μ20 ) + ĝ −2\n2\n2\ni=1\n\nwhere ∆ = −X0 μ20 +\n\nP2\n\ni=1\n\nXi μ2i . Inserting the above U(1)2 truncation into (4.25), we obtain\n\nthe bosonic Lagrangian\n\ne−1 L7 = R ̄∗1 − 12 ∗ ̄dφ1 ∧ dφ1 − 21 ∗ ̄dφ2 ∧ dφ2 −\n\n1\n2\n\n2\nX\ni=1\n\nXi−2 ∗ ̄F i ∧ F i − V ∗ ̄1.\n\n(4.29)\n\nHere we have chosen to parametrize the scalars in terms of two dilatons φ\n~ = {φ1 , φ2 }\n\naccording to\n\n1\n\nXi = e− 2 ~ai *~φ ,\n\n8\n~ai * ~aj = 4δij − ,\n5\n\nX0 = (X1 X2 )−2\n\n(i, j = 1, 2).\n\n(4.30)\n\nThe potential is given by\n1\nV = −g 2 (4X1 X2 + 2X0 X1 + 2X0 X2 − X02 ).\n2\n\n(4.31)\n\ncorresponding to the AdS7 vacuum. Further truncation is possible by setting φ1 = 0 and\n√\nF 1 = F 2 = F/ 2. In this case, the resulting Lagrangian becomes\ne−1 L7 = R ̄∗1 − 21  ̄∗∂φ ∧ ∂φ − 21 X −2  ̄∗F ∧ F + g 2 (4X 2 + 4X −3 − 21 X −8 ) ̄∗1.\n\n(4.32)\n\nNote that both truncations (4.29) and (4.32) have gauge fields contained in the maximally\ncompact subgroup SO(4) ⊂ SO(4, 1). As a result, they both have proper kinetic energy\n\nterms and a standard potential admitting the AdS vacuum. So, after appropriate truncation, we have in fact obtained a unitary theory (indistinguishable from the corresponding\ntruncation of ordinary N = 4 gauged supergravity in seven dimensions) from a non-unitary\none. Nevertheless, this fact is perhaps of limited usefulness, as the model before truncation\ninherits the usual drawbacks of the underlying field theory description of * theory.\n\n5\n\nLifting de Sitter black hole solutions\n\nIt is an interesting observation that, even in the absence of obvious supersymmetry, multicentered de Sitter black hole solutions are known to exist, and have been constructed in\n[19, 20] in the context of Einstein-Maxwell theory with a positive cosmological constant.\n17\n\n\fThese solutions resemble traditional BPS objects in that they satisfy a set of first order\nequations [20, 21, 22] related to the analytic continuation of the Killing spinor equation in\nAdS gauged supergravity. In the d-dimensional Reissner-Nordstrom case (for d ≥ 4), the\nsolution may be written in terms of a cosmological metric\n\nds2 = −H −2 (t, ~x )dt2 + H 2/(d−3) (t, ~x ) a2 (t)d~x 2 ,\n\n(5.1)\n\nwhere the scale factor is given by a(t) = eĝt and the harmonic function has the multi-center\nform\nH(t, ~x ) = 1 +\n\nX\ni\n\nqi\n.\n(a(t)|~x − ~xi |)d−3\n\n(5.2)\n\nIt is apparent that while the background is time-dependent, this time dependence is rather\ntrivial and is simply a reflection of the cosmological expansion in de Sitter space. For this\nreason, these black holes are natural candidates to lift to the higher dimensional * theory,\nwhere they may be interpreted as possible fundamental objects of the * theory.\nIt was demonstrated in [21] that this Reissner-Nordstrom black hole, (5.1), may be generalized to the analytically continued D = 5, N = 2 supergravity, and in particular the\nSTU model corresponding to the anti-de Sitter version of (3.17). Further generalizations to\nEinstein-Maxwell-dilaton theories in arbitrary dimensions are also possible.\n\n5.1\n\nD = 5 dS black holes\n\nWe first examine the five-dimensional case obtained by the hyperbolic reduction of IIB∗ .\nThe U(1)3 truncated theory of (3.17) admits a three-charge black hole solution, given by\nds25 = −(H1 H2 H3 )−2/3 dt2 + (H1 H2 H3 )1/3 e2ĝt d~x 2 ,\nXi = Hi−1 (H1 H2 H3 )1/3 ,\n!\n1\n1,2\ndt,\nA(1) = i 1 −\nH1,2\nwhere\nHi (t, ~x ) = 1 + e−2ĝt\n\nA3(1)\n\nX\nj\n\n\u0012\n\n\u0013\n\n1\n= 1−\ndt,\nH3\n\nqij\n.\n|~x − ~xj |2\n\n(5.3)\n\n(5.4)\n\nThis solution was given implicitly in [21], at least up to analytic continuation to the present\n* theory vacuum. The continuation is chosen here so that the metric remains real at the\n\n18\n\n\fexpense of introducing imaginary background gauge fields4 . In fact, the complexification of\nthe solution compensates for the wrong sign kinetic terms in (3.17) in just such a way that\nthe black hole solution has positive energy compared with the vacuum.\nThere is a potential difficulty associated with lifting the solution (5.3) to ten dimensions,\nin that the imaginary gauge fields A1(1) and A2(1) would lead to a complex ten dimensional\nmetric (as well as F4 ). To avoid this, we turn off the first two gauge fields, and lift the single\ncharge (A3(1) ) black hole to IIB∗ theory. The resulting metric is\ne 1/2 (−H −1 dt2 + e2ĝt d~\ne −1/2 ds2 (H\nf5 ),\nds210 = ∆\nx 2 ) + ĝ −2∆\n\n(5.5)\n\ne ≡ H 2/3 ∆ = 1 + (1 − H) sinh2 α and\nwhere ∆\n\nf5 ) = dα2 + sinh2 α dΩ2 + (1 − H) sinh2 α dα2 + H cosh2 α(dψ − ĝH −1 (1 − H)dt)2 (5.6)\nds2 (H\n3\n\nis the metric on the distorted internal hyperbolic space. Note that we have chosen an explicit\nparametrization of the maximally symmetric H 5 as\nds2 (H 5 ) = dα2 + sinh2 α dΩ23 + cosh2 α dψ 2 .\n\n(5.7)\n\nAfter applying a change of coordinates, ĝτ = eĝt , and a rearrangement of terms, the lifted\nsolution (5.5) may be written in the form\n−1/2\n\nwhere\n\nf\nds210 = H\n0\n\n1/2\n\nf [−∆H\ne −1 dτ 2 + τ 2 ds2 (H\nf5 )],\nd~x 2 + H\n0\n\nf\nf = lim H,\nH\n0\nτ →0\n\nf= 1+\nH\n\n1\n.\ne\nĝ 4 τ 4 ∆\n\n(5.8)\n\n(5.9)\n\nf in this form in anticipation of the brane interpretation of this lifted\nWe have written H\n\nsolution.\n\nIn fact, we recall that the IIB∗ theory admits an E4-brane solution of the form [1]\nds210 = H−1/2 d~x 2 + H1/2 (−dt2 + dr 2 + r 2 dΩ24 ),\n\n(5.10)\n\nwhere\nH=1+\n4\n\nĝ 4 |t2\n\n1\n.\n− r 2 |2\n\n(5.11)\n\nThe de Sitter black hole solution is a real solution for positive cosmological constant and correct sign\n\nkinetic terms for the fields. Since the first two U (1)'s of (3.17) have the wrong sign, the corresponding gauge\npotentials become imaginary in (5.3).\n\n19\n\n\fThis may be most readily compared to the lifted single charge black hole solution of (5.8)\nby taking the near brane limit t → r with t2 > r 2 . In this case, we may make a change\n\nof variables, t = τ cosh β, r = τ sinh β, and drop the one in the harmonic function. The\nresulting dS5 × H 5 metric has the form\n−1/2\n\nds210 = H0\n\n1/2\n\nd~x 2 + H0 [−dτ 2 + τ 2 (dβ 2 + sinh2 β dΩ24 )],\n\n(5.12)\n\nwhere H0 = 1/ĝ 4τ 4 . It should now be apparent that (5.8) is a generalization of this solution\n\nto the case of non-zero R-charge in five dimensions. Recalling that the R-charged AdS black\nholes may be interpreted as rotating branes [9], we see here that a similar picture holds,\nalbeit with time as a transverse as opposed to a longitudinal coordinate.\n\n5.2\n\nD = 4 dS black holes\n\nTurning now to four dimensions, we note that the U(1)4 truncation, (4.14), admits a four\ncharge dS black hole solution, given by\nds24 = −(H1 H2 H3 H4 )−1/2 dt2 + (H1 H2 H3 H4 )1/2 e2ĝt d~x 2 ,\nXi = Hi−1(H1 H2 H3 H4 )1/4 ,\n\u0013\n\u0012\n1\ni\ndt,\nA(1) = i 1 −\nHi\nwhere\nHi (t, ~x ) = 1 + e−ĝt\n\n(5.13)\nX\nj\n\nqij\n.\n|~x − ~xj |\n\n(5.14)\n\nAgain we are faced with the difficulty of imaginary gauge potentials. However, unlike the\nfive-dimensional case, all fields in the U(1)4 truncation have the wrong sign. Hence there is\nno truncation (short of setting all the charges to zero) that makes the solution real. For this\nreason, any lifting of these black holes to the M∗ theory would result in a complex metric,\nand hence it is unclear what the physical significance of these solutions is.\nNevertheless, we note that the analytic continuation of the Reissner-Nordstrom-de Sitter\nsolution is obtained by setting all four charges equal in (5.13):\nds24 = −H −2 dt2 + H 2 e2ĝt d~x 2 ,\n\u0012\n\u0013\n1\nA(1) = i 1 −\ndt.\nH\n\n(5.15)\n\nThis may be viewed as a solution to the pure N = 2 de Sitter supergravity of (4.18) where\nA(1) is taken as the graviphoton.\n20\n\n\fD = 7 AdS black holes\n\n5.3\n\nFinally, we note that the U(1)2 truncation of the seven-dimensional theory, (4.29), admits a\ntwo charge AdS black hole solution given by\nds27 = −(H1 H2 )−4/5 dt2 + (H1 H2 )1/5 e−2igt d~x 2 ,\nXi = Hi−1 (H1 H2 )2/5 ,\n!\n1\n1,2\nA(1) = 1 −\ndt,\nH1,2\nwhere\nHi (t, ~x ) = 1 + e4igt\n\n(5.16)\n\nX\nj\n\nqij\n.\n|~x − ~xj |4\n\n(5.17)\n\nAlthough the gauge fields have correct sign kinetic terms, the negative cosmological constant\nformally results a complex metric, as noted in [21]. The further truncated theory of (4.32)\nalso admits a solution by setting all Hi = H in (5.16):\nds27 = −H −8/5 dt2 + H 2/5 e−2igt d~x 2 ,\nX = H −1/5 ,\n\u0013\n\u0012\n1\ndt.\nA(1) = 1 −\nH\n\n6\n\n(5.18)\n\nDiscussion\n\nSo far we have focused only on the reduction of the bosonic sector of * theories. Nevertheless,\nit should be possible to handle the fermions in a similar manner through analytic continuation. Unlike the conventional case, where analytic continuation from an anti-de Sitter to a\nde Sitter theory would complexify the fermions and destroy the matching between bosonic\nand fermionic degrees of freedom [7], here the * theories have a twisted supersymmetry built\nin (at the expense of wrong sign kinetic terms). Thus the resulting fermion sectors should\nnot have any doubling problem.\nAlthough we do not examine the fermions in detail, the structure of the de Sitter supersymmetry transformations may be derived by an appropriate continuation of the anti-de\nSitter supergravities. For example, it is well known that the S 5 compactification of IIB\nsupergravity will lead to maximal SO(6) gauged supergravity in five dimensions [26, 27, 28].\nIn addition, the non-compact SO(p, 6 − p) gauged case has also been investigated in [28].\n21\n\n\fTurning to the H 5 compactification of IIB∗ supergravity, we have seen in section 3 that the\nappropriate analytic continuation requires sending g to iĝ. This results in an unconventional\nde Sitter supersymmetry with noncompact SO(5,1) gauge group.\nRecall that the D = 5 ungauged maximal supergravity fields consists of one graviton,\nabc\neight gravitini ψμa , 27 vector fields A[ab]\nand 42 scalars φabcd , where\nμ , 48 spin-1/2 fields λ\n\na, b, . . . are USp(8) indices. The complete scalars parametrize the noncompact coset space\nE6(6) /USp(8). However, for the truncation considered in section 3, we specialize to the\nsubgroup SO(5, 1) ⊂ SL(6, R) × SL(2, R) ⊂ E6(6) , with scalars parametrized by a 15-bein\n\nVAB cd . This 15-bein may be constructed by starting with a SL(6, R) matrix S and then\ntaking\n\n1\nV IJab = (ΓKL )ab U IJ KL ,\n8\n1\nUIα Jβ = SI J δα β ,\nVIα ab = √ (ΓKβ )ab UIα Kβ ,\n(6.1)\n2 2\nwhere the SO(5, 1) Dirac matrices satisfy {ΓI , ΓJ } = 2ηIJ with ηIJ = diag(+, +, +, +, +, −).\nU IJ KL = 2S[K [I SL] J] ,\n\nIn addition, ΓIα ≡ ΓI (α = 1); ΓIα ≡ iΓI Γ0 (α = 2) where Γ0 anticommutes with the first\n\nsix Dirac matrices. Here we are following the notations and conventions of [28].\n\nThe scalar kinetic terms Pμ abcd and the composite connection Qμa b are defined through\nb]\n\nṼcd AB Dμ VAB ab = 2Qμ[c [a δd] + Pμ ab cd ,\n\n(6.2)\n\nwhere ṼcdAB is the inverse of VAB cd . In addition, the T-tensor is defined as\nT a bcd = (2V IKae ṼbeJK − VJα ae Ṽbe Iα )η JL ṼcdIL ,\nTab = T c abc .\n\n(6.3)\n(6.4)\n\nNote that, the matrix S is related to T̂ij introduced in section 3 by\n(T̂ −1 )ij = SI i SJ j η IJ .\n\n(6.5)\n\nThis simply corresponds to the unconventional * supersymmetry with scalars parameterizing\nSL(6, R)/SO(5, 1).\nBesides introducing this noncompact gauging, we also analytically continue g → iĝ and\n\nF(2) → −iF̂(2) in order to obtain the Lagrangian (3.12). Therefore the unconventional\nsupersymmetry transformation rules for the gravitini and spin-1/2 fermions are\n2i\ni\nδψμa = Dμ ǫa − ĝTab γμ ǫb + (γμ νρ − 4δμν γ ρ )F̂νρab ǫb ,\n45\n6\n√ μ\n3i\ni\n2γ Pμ abcd ǫd − √ ĝTd[abc] ǫd + √ γ μν F̂μν[ab ǫc] ,\nδλabc =\n2\n2 2\n22\n\n(6.6)\n\n\fwhere\nij\nF̂μνab = F̂μνIJ V IJ ab = 41 F̂μν\nηim ηjn SK m SL n (ΓKL )ab ,\n\nDμ ǫa = ∂μ ǫa + Qμa b ǫb .\n\n(6.7)\n\nOne should be able to obtain these transformations by direct reduction of the IIB∗ transformations, although we have not directly verified this.\nThe multi-centered dS black holes of the previous section are half-BPS solutions of this\ntwisted supersymmetry. However it is not clear if this is sufficient to demonstrate their\nstability. Unlike for BPS objects in an ordinary supergravity theory, here the wrong-sign\nkinetic terms allows the possibility of excitations above the supersymmetric background\nthat nevertheless have negative energy. On the other hand, the existence of multi-centered\nsolutions is at least suggestive that there may be a hidden symmetry ensuring their stability.\nAlthough the de Sitter supergravities which we have investigated involve wrong sign\nkinetic terms and are hence ill-behaved as field theories, such problems were already present\nin the underlying * theory. Thus we may expect that whatever stringy phenomenon cures\nthe behavior of * theory would also stabilize the ensuing de Sitter supergravities. On the\nother hand, it is possible that the reduction on non-compact internal manifolds may yield\ninherently unstable lower dimensional theories. Of course, consistent truncations are possible\nin a standard AdS×Sphere reduction, even when states are not well separated by e.g. charge\nor mass. Hence even if the full lower dimensional de Sitter theory would be unstable, it is\npossible that a stable truncation would exist. An example of this is given by the truncated\nseven-dimensional Lagrangians (4.29) and (4.32).\nWhile presently we have only examined multi-centered de Sitter black holes, it would be\nof interest to investigate and lift other de Sitter backgrounds to the underlying IIB∗ or M∗\ntheory. In fact, such lifted solutions may additionally be T-dualized along the time direction\nso that they become conventional solutions in ten or eleven dimensions. For the case of the\nlifted D = 5 de Sitter black holes, it may be seen that the T-dual of the rotating E4-brane\nsolution, (5.8), would involve D4-branes as well as NSNS flux.\nFinally, it remains an open issue whether multi-centered anti-de Sitter black holes may\nbe constructed in ordinary gauged supergravities without resorting to complexification or\nanalytic continuation. To do so, one would have to overcome the fact that in an ordinary\nsupergravity, a background preserving some fraction of the supersymmetries necessarily ad23\n\n\fmits a timelike or null Killing vector. This is in direct contradiction to the expectation\nthat a multi-centered anti-de Sitter black hole configuration would be time dependent, due\nto the focusing effect of geodesics in anti-de Sitter space. On the other hand, there is no\nobstruction to the multi-centered de Sitter black holes, as the unconventional signs in the\nsuperalgebra relax the condition of having a timelike Killing vector. This hints, at least, that\nthe unconventional de Sitter supergravities investigated here may play a crucial role in the\nbetter understanding of de Sitter cosmologies and time dependent backgrounds for string\ntheory.\n\nAcknowledgments\nThis research was supported in part by the US Department of Energy under grant DE-FG0295ER40899.\n\nReferences\n[1] C. M. Hull, Timelike T-duality, de Sitter space, large N gauge theories and topological\nfield theory, JHEP 9807, 021 (1998) [arXiv:hep-th/9806146].\n[2] C. M. Hull, Duality and the signature of space-time, JHEP 9811, 017 (1998)\n[arXiv:hep-th/9807127].\n[3] C. M. Hull and R. R. Khuri, Branes, times and dualities, Nucl. Phys. B 536, 219 (1998)\n[arXiv:hep-th/9808069].\n[4] C. M. Hull and R. R. Khuri, Worldvolume theories, holography, duality and time, Nucl.\nPhys. B 575, 231 (2000) [arXiv:hep-th/9911082].\n[5] C. M. Hull, De Sitter space in supergravity and M theory, JHEP 0111, 012 (2001)\n[arXiv:hep-th/0109213].\n[6] J. Lukierski and A. Nowicki, All Possible De Sitter Superalgebras And The Presence Of\nGhosts, Phys. Lett. B 151, 382 (1985).\n[7] K. Pilch, P. van Nieuwenhuizen and M. F. Sohnius, De Sitter Superalgebras And Supergravity, Commun. Math. Phys. 98, 105 (1985).\n24\n\n\f[8] B. de Wit and H. Nicolai, The Consistency Of The S 7 Truncation In D = 11 Supergravity, Nucl. Phys. B 281, 211 (1987).\n[9] M. Cvetič et al., Embedding AdS black holes in ten and eleven dimensions, Nucl. Phys.\nB 558, 96 (1999) [arXiv:hep-th/9903214].\n[10] H. Nastase, D. Vaman and P. van Nieuwenhuizen, Consistent nonlinear KK reduction\nof 11d supergravity on AdS7 ×S 4 and self-duality in odd dimensions, Phys. Lett. B 469,\n\n96 (1999) [arXiv:hep-th/9905075].\n\n[11] H. Nastase, D. Vaman and P. van Nieuwenhuizen, Consistency of the AdS7 × S 4 reduc-\n\ntion and the origin of self-duality in odd dimensions, Nucl. Phys. B 581, 179 (2000)\n\n[arXiv:hep-th/9911238].\n[12] H. Lü and C. N. Pope, Exact embedding of N = 1, D = 7 gauged supergravity in\nD = 11, Phys. Lett. B 467, 67 (1999) [arXiv:hep-th/9906168].\n[13] H. Lü, C. N. Pope and T. A. Tran, Five-dimensional N = 4, SU(2) × U(1) gauged\nsupergravity from type IIB, Phys. Lett. B 475, 261 (2000) [arXiv:hep-th/9909203].\n\n[14] M. Cvetič, H. Lü and C. N. Pope, Four-dimensional N = 4, SO(4) gauged supergravity\nfrom D = 11, Nucl. Phys. B 574, 761 (2000) [arXiv:hep-th/9910252].\n[15] M. Cvetič, S. S. Gubser, H. Lü and C. N. Pope, Symmetric potentials of gauged supergravities in diverse dimensions and Coulomb branch of gauge theories, Phys. Rev. D\n62, 086003 (2000) [arXiv:hep-th/9909121].\n[16] M. Cvetič, H. Lü, C. N. Pope and A. Sadrzadeh, Consistency of KaluzaKlein sphere reductions of symmetric potentials, Phys. Rev. D 62, 046005 (2000)\n[arXiv:hep-th/0002056].\n[17] M. Cvetič, H. Lü, C. N. Pope, A. Sadrzadeh and T. A. Tran, Consistent SO(6) reduction\nof type IIB supergravity on S 5 , Nucl. Phys. B 586, 275 (2000) [arXiv:hep-th/0003103].\n[18] M. Cvetič, H. Lü and C. N. Pope, Consistent Kaluza-Klein sphere reductions, Phys.\nRev. D 62, 064028 (2000) [arXiv:hep-th/0003286].\n\n25\n\n\f[19] D. Kastor and J. Traschen, Cosmological multi-black hole solutions, Phys. Rev. D 47,\n5370 (1993) [arXiv:hep-th/9212035].\n[20] L. A. London, Arbitrary Dimensional Cosmological Multi-Black Holes, Nucl. Phys. B\n434, 709 (1995).\n[21] J. T. Liu and W. A. Sabra, Multi-centered black holes in gauged D = 5 supergravity,\nPhys. Lett. B 498, 123 (2001) [arXiv:hep-th/0010025].\n[22] K. Behrndt and M. Cvetič, Time-dependent backgrounds from supergravity with gauged\nnon-compact R-symmetry, arXiv:hep-th/0303266.\n[23] A. Batrachenko, M. J. Duff and J. X. Lu, The membrane at the end of the (de Sitter)\nuniverse, arXiv:hep-th/0212186.\n[24] C. M. Hull and N. P. Warner, Non-compact gaugings from higher dimensions, Class.\nQuant. Grav. 5, 1517 (1988).\n[25] G. W. Gibbons and C. M. Hull, de Sitter space from warped supergravity solutions,\narXiv:hep-th/0111072.\n[26] M. Günaydin, L. J. Romans and N. P. Warner, Gauged N = 8 Supergravity In FiveDimensions, Phys. Lett. B 154, 268 (1985).\n[27] M. Pernici, K. Pilch and P. van Nieuwenhuizen, Gauged N = 8 D = 5 Supergravity,\nNucl. Phys. B 259, 460 (1985).\n[28] M. Günaydin, L. J. Romans and N. P. Warner, Compact and Non-Compact Gauged\nSupergravity Theories in Five Dimensions, Nucl. Phys. B 272, 598 (1986).\n[29] M. J. Duff and J. T. Liu, Anti-de Sitter black holes in gauged N = 8 supergravity, Nucl.\nPhys. B 554, 237 (1999) [arXiv:hep-th/9901149].\n[30] M. Cvetič, H. Lü, C. N. Pope, A. Sadrzadeh and T. A. Tran, S 3 and S 4 Reductions of\nType IIA Supergravity, Nucl. Phys. B 590, 233 (2000) [arXiv:hep-th/0005137].\n\n26\n\n\f"}