{"id": "http://arxiv.org/abs/hep-ph/0205079v1", "guidislink": true, "updated": "2002-05-08T13:45:38Z", "updated_parsed": [2002, 5, 8, 13, 45, 38, 2, 128, 0], "published": "2002-05-08T13:45:38Z", "published_parsed": [2002, 5, 8, 13, 45, 38, 2, 128, 0], "title": "Constructing Confinement", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0205229%2Chep-ph%2F0205252%2Chep-ph%2F0205103%2Chep-ph%2F0205133%2Chep-ph%2F0205186%2Chep-ph%2F0205288%2Chep-ph%2F0205251%2Chep-ph%2F0205297%2Chep-ph%2F0205087%2Chep-ph%2F0205260%2Chep-ph%2F0205304%2Chep-ph%2F0205156%2Chep-ph%2F0205003%2Chep-ph%2F0205023%2Chep-ph%2F0205271%2Chep-ph%2F0205305%2Chep-ph%2F0205289%2Chep-ph%2F0205294%2Chep-ph%2F0205273%2Chep-ph%2F0205319%2Chep-ph%2F0205137%2Chep-ph%2F0205035%2Chep-ph%2F0205079%2Chep-ph%2F0205005%2Chep-ph%2F0205187%2Chep-ph%2F0205160%2Chep-ph%2F0205239%2Chep-ph%2F0205301%2Chep-ph%2F0205043%2Chep-ph%2F0205012%2Chep-ph%2F0205209%2Chep-ph%2F0205269%2Chep-ph%2F0205130%2Chep-ph%2F0205180%2Chep-ph%2F0205242%2Chep-ph%2F0205303%2Chep-ph%2F0205216%2Chep-ph%2F0205064%2Chep-ph%2F0205013%2Chep-ph%2F0205245%2Chep-ph%2F0205290%2Chep-ph%2F0205176%2Chep-ph%2F0205292%2Chep-ph%2F0205211%2Chep-ph%2F0205141%2Chep-ph%2F0205143%2Chep-ph%2F0205092%2Chep-ph%2F0205037%2Chep-ph%2F0205111%2Chep-ph%2F0205148%2Chep-ph%2F0205190%2Chep-ph%2F0205108%2Chep-ph%2F0205198%2Chep-ph%2F0205255%2Chep-ph%2F0205307%2Chep-ph%2F0205098%2Chep-ph%2F0205056%2Chep-ph%2F0205179%2Chep-ph%2F0205226%2Chep-ph%2F0205061%2Chep-ph%2F0205258%2Chep-ph%2F0205047%2Chep-ph%2F0205306%2Chep-ph%2F0205175%2Chep-ph%2F0205091%2Chep-ph%2F0205208%2Chep-ph%2F0205136%2Chep-ph%2F0205202%2Chep-ph%2F0205335%2Chep-ph%2F0205172%2Chep-ph%2F0205159%2Chep-ph%2F0205282%2Chep-ph%2F0205020%2Chep-ph%2F0205040%2Chep-ph%2F0205204%2Chep-ph%2F0205022%2Chep-ph%2F0205310%2Chep-ph%2F0205237%2Chep-ph%2F0205163%2Chep-ph%2F0205100%2Chep-ph%2F0205009%2Chep-ph%2F0205146%2Chep-ph%2F0205197%2Chep-ph%2F0205241%2Chep-ph%2F0205312%2Chep-ph%2F0205089%2Chep-ph%2F0205054%2Chep-ph%2F0205106%2Chep-ph%2F0205323%2Chep-ph%2F0205210%2Chep-ph%2F0205189%2Chep-ph%2F0205332%2Chep-ph%2F0205126%2Chep-ph%2F0205201%2Chep-ph%2F0205050%2Chep-ph%2F0205018%2Chep-ph%2F0205279%2Chep-ph%2F0205349%2Chep-ph%2F0205342%2Chep-ph%2F0205213%2Chep-ph%2F0205276&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Constructing Confinement"}, "summary": "The interaction between static quarks is derived by applying many-body\ntechniques to QCD in Coulomb gauge. The result is shown to be exact in the IR\nand UV limits, and agrees remarkably well with lattice computations.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0205229%2Chep-ph%2F0205252%2Chep-ph%2F0205103%2Chep-ph%2F0205133%2Chep-ph%2F0205186%2Chep-ph%2F0205288%2Chep-ph%2F0205251%2Chep-ph%2F0205297%2Chep-ph%2F0205087%2Chep-ph%2F0205260%2Chep-ph%2F0205304%2Chep-ph%2F0205156%2Chep-ph%2F0205003%2Chep-ph%2F0205023%2Chep-ph%2F0205271%2Chep-ph%2F0205305%2Chep-ph%2F0205289%2Chep-ph%2F0205294%2Chep-ph%2F0205273%2Chep-ph%2F0205319%2Chep-ph%2F0205137%2Chep-ph%2F0205035%2Chep-ph%2F0205079%2Chep-ph%2F0205005%2Chep-ph%2F0205187%2Chep-ph%2F0205160%2Chep-ph%2F0205239%2Chep-ph%2F0205301%2Chep-ph%2F0205043%2Chep-ph%2F0205012%2Chep-ph%2F0205209%2Chep-ph%2F0205269%2Chep-ph%2F0205130%2Chep-ph%2F0205180%2Chep-ph%2F0205242%2Chep-ph%2F0205303%2Chep-ph%2F0205216%2Chep-ph%2F0205064%2Chep-ph%2F0205013%2Chep-ph%2F0205245%2Chep-ph%2F0205290%2Chep-ph%2F0205176%2Chep-ph%2F0205292%2Chep-ph%2F0205211%2Chep-ph%2F0205141%2Chep-ph%2F0205143%2Chep-ph%2F0205092%2Chep-ph%2F0205037%2Chep-ph%2F0205111%2Chep-ph%2F0205148%2Chep-ph%2F0205190%2Chep-ph%2F0205108%2Chep-ph%2F0205198%2Chep-ph%2F0205255%2Chep-ph%2F0205307%2Chep-ph%2F0205098%2Chep-ph%2F0205056%2Chep-ph%2F0205179%2Chep-ph%2F0205226%2Chep-ph%2F0205061%2Chep-ph%2F0205258%2Chep-ph%2F0205047%2Chep-ph%2F0205306%2Chep-ph%2F0205175%2Chep-ph%2F0205091%2Chep-ph%2F0205208%2Chep-ph%2F0205136%2Chep-ph%2F0205202%2Chep-ph%2F0205335%2Chep-ph%2F0205172%2Chep-ph%2F0205159%2Chep-ph%2F0205282%2Chep-ph%2F0205020%2Chep-ph%2F0205040%2Chep-ph%2F0205204%2Chep-ph%2F0205022%2Chep-ph%2F0205310%2Chep-ph%2F0205237%2Chep-ph%2F0205163%2Chep-ph%2F0205100%2Chep-ph%2F0205009%2Chep-ph%2F0205146%2Chep-ph%2F0205197%2Chep-ph%2F0205241%2Chep-ph%2F0205312%2Chep-ph%2F0205089%2Chep-ph%2F0205054%2Chep-ph%2F0205106%2Chep-ph%2F0205323%2Chep-ph%2F0205210%2Chep-ph%2F0205189%2Chep-ph%2F0205332%2Chep-ph%2F0205126%2Chep-ph%2F0205201%2Chep-ph%2F0205050%2Chep-ph%2F0205018%2Chep-ph%2F0205279%2Chep-ph%2F0205349%2Chep-ph%2F0205342%2Chep-ph%2F0205213%2Chep-ph%2F0205276&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The interaction between static quarks is derived by applying many-body\ntechniques to QCD in Coulomb gauge. The result is shown to be exact in the IR\nand UV limits, and agrees remarkably well with lattice computations."}, "authors": ["E. S. Swanson", "A. P. Szczepaniak"], "author_detail": {"name": "A. P. Szczepaniak"}, "author": "A. P. Szczepaniak", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1142/9789812705136_0040", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/hep-ph/0205079v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-ph/0205079v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "6 pages, 3 figures, proceedings for 2002 Lake Louise Winter Institute", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-ph/0205079v1", "affiliation": "Indiana University", "arxiv_url": "http://arxiv.org/abs/hep-ph/0205079v1", "journal_reference": null, "doi": "10.1142/9789812705136_0040", "fulltext": "CONSTRUCTING CONFINEMENT\n\narXiv:hep-ph/0205079v1 8 May 2002\n\nE.S. SWANSON\nDepartment of Physics and Astronomy, University of Pittsburgh\nPittsburgh PA 15260\nA.P. SZCZEPANIAK\nDepartment of Physics and Nuclear Theory Center, Indiana University\nBloomington, IN 47405-4202\nThe interaction between static quarks is derived by applying many-body techniques\nto QCD in Coulomb gauge. The result is shown to be exact in the IR and UV\nlimits, and agrees remarkably well with lattice computations.\n\n1\n\nIntroduction\n\nOne of the key impediments to understanding QCD at low energy is a quantitative description of confinement. Here, we demonstrate how confinement\nmay be constructed with a nonperturbative many-body analysis of QCD in\nCoulomb gauge1 .\nThe starting point is the QCD Hamiltonian in Coulomb gauge, as derived\nby Schwinger2 and Christ and Lee3,4 :\n1\ndxψ † (−iα * ∇ + βm) ψ +\n2\nZ\n− g dxψ † α * Aψ + Hc .\n\nH̄ =\n\nZ\n\nZ\n\n\u0010\n\u0011\ndx J −1/2 ΠJ * ΠJ −1/2 + B * B\n(1)\n\nwhere HC is the nonabelian version of the instantaneous Coulomb interaction:\nHC =\n\n1\n2\n\nZ\n\ndxdyJ −1/2 ρa (x)J 1/2 Kab (x, y; A)J 1/2 ρb (y)J −1/2 .\n\n(2)\n\nIn this expression the total charge density is denoted by ρ, J is the FaddeevPopov determinant, J = det(∇ * D), D is the covariant derivative in adjoint\nrepresentation, Dab = δ ab ∇ − gf abc Ac , and K is the nonabelian kernel\ng\ng\n(−∇2 )\n|y, bi,\n(3)\n∇*D\n∇*D\nWe shall make use of the inverse Faddeev-Popov operator, d = g/(∇ * D) in\nthe following.\nKab (x, y; A) ≡ hx, a|\n\nllwi: submitted to World Scientific on December 22, 2018\n\n1\n\n\fCoulomb gauge is particularly efficacious in describing QCD in the confinement region because all degrees of freedom are physical (no gauge constraints need be applied) and the instantaneous interaction provides an excellent starting point for the bound state problem. Furthermore, it is easy\nto see that the Coulomb interaction must yield confinement for static quarks\nbecause transverse gluon exchange is suppressed in the heavy quark limit.\nThus it is clear that determining the behaviour of K is of central importance\nto developing an understanding of low energy QCD.\n\n2\n\nIR and UV Behaviour of QCD in Coulomb gauge\n\nThe evaluation of the Coulomb interaction is a nontrivial endeavour! However,\nthe problem simplifies dramatically if one is willing to focus on the leading\ninfrared (IR) behaviour of the theory (which, of course, is where confinement\nlies). To understand this statement it is useful to recall an old story in manybody physics.\nA naive attempt to compute the ground state energy of an electron gas\n(with an assumed positive background) at higher order is confounded by IR divergences arising from the instantaneous (abelian) Coulomb interaction. This\nproblem was resolved many years ago by Bohm and Pines5 who showed that\nsumming the leading IR-divergent diagrams (the ring diagrams) effectively replaces the divergent Coulombic 1/q 2 behaviour with a convergent 1/q 2 ǫ(ω, k)\nbehaviour. In fact, the sum has a wholly different analytic structure than any\nfinite order in perturbation theory can produce. We now demonstrate that a\nsimilar situation occurs in the nonabelian case.\nThe vertices of QCD in Coulomb gauge are shown in Figure 1 (there are\nadditional vertices where n transverse gluons are emitted from the Coulomb\ninteraction). We denote these vertices by α and call the number of vertices of a given type in a time-ordered diagram, nα . We anticipate that\nthe Coulomb kernel K does indeed cause an IR divergence when inserted in\na typical diagram. We denote the divergence due to K by λ (for concreteness, one may consider λ as an IR regulator). A general diagram then has\nan IR divergence of order λM where M = DK − Dg − Dq . Here DK , Dg ,\nDq , and Dd represent the number of Coulomb, gluon, quark, and FaddeevPopov propagators respectively. The following relationships may be easily\nverified6 : 2DK = nggK + nqgK + nKgd , 2Dd = nKgd + 2ndgd + nqqd\nP, and\nnKgd = nggd + nqqd ; employing these leads to M = 1 + 2DK + Dd − α nα ,\nand finally\n\nllwi: submitted to World Scientific on December 22, 2018\n\n2\n\n\fM = 1 − n4g − n3g − nqqg\n\n(4)\n\nThis equation is of central importance – no diagrams are more divergent than K itself, and increasing the number of four gluon, three gluon, or\nquark-gluon vertices decreases the degree of divergence. Thus the leading IR\nbehaviour of QCD is contained in matrix elements of the Hamiltonian itself –\nspecifically it is not in iterations of H.\n\nFigure 1. Vertices in Coulomb gauge QCD. The solid line is a K propagator while the\ndashed line represents a d propagator.\n\nBefore applying these results we consider the ultraviolet (UV) behaviour\nof QCD in Coulomb gauge. It is well known7 that the beta function of QCD\nmay be obtained directly from the Coulomb interaction (there is no need to\nconsider loop corrections to vertices). Thus an accurate evaluation of K is\nsufficient to determine both the long distance and short distance behaviour of\nthe static quark confinement potential!\n3\n\nCoupled Gap Equations\n\nThe previous observations simplify the evaluation of the Coulomb kernel: the\nleading IR divergent diagrams coincide with those of the rainbow ladder approximation. Furthermore, vertex corrections to the rainbow ladder Dyson\nequation are suppressed in the IR limit (see Ref. [1] for more details). Thus\nK may be evaluated by solving a relatively simple nonlinear integral equation.\nAn important additional step needs to be taken before evaluating K.\nDiagrams are all evaluated with respect to an implicit vacuum, normally taken\nto be trivial. However, a trivial vacuum is not likely to be a good starting\npoint for describing confinement. Thus we choose to introduce extra freedom\ninto the problem with the aid of a variational vacuum ansatz:\n\nllwi: submitted to World Scientific on December 22, 2018\n\n3\n\n\f\u0014\n\u0015\nZ\n1\na\na\nΨ0 [A] = hA|ωi = exp −\ndkA (k) ω(k)A (−k) .\n2\n\n(5)\n\nHere, ω is an unknown function to be determined by minimizing the vacuum\nenergy density.\nThe particular form of the trial vacuum is unimportant – it merely serves\nas a method to define the basis with which we choose to describe low energy\nQCD. The Fock space which is built on our variational vacuum consists of\nquasiparticles – constituent quarks and gluons. These degrees of freedom obey\ndispersion relations with infrared divergences due to the long-range instantaneous Coulomb interaction of the bare partons with the mean field vacuum.\nThis interaction makes colored objects infinitely heavy thereby removing them\nfrom the physical spectrum. However, color neutral states remain physical\nbecause the infrared singularities responsible for the large self-energies are\ncanceled by infrared divergences responsible for the long-range forces between\nthe constituents. This is the origin of the \"colour confinement\" phenomenon.\nHaving specified the vacuum (up to the function ω) we are ready to evaluate the Coulomb interaction. Since the result depends on ω we must also fix\nω by minimizing the vacuum energy density (this is just the gap equation).\nHowever, the vacuum energy depends on hΨ0 |HC |Ψ0 i, which depends on K!\nThus we must solve coupled equations for the gap and for K. Doing so yields a\nresult for ω which may then be used to evaluate K – the equations themselves\ndetermine the gluonic (and hence quark) quasiparticle interaction.\n10\n\nω(k)/ω(0) = ω(k)/mg\n\n10\n\n10\n\n10\n\n3\n\n2\n\n1\n\n0\n\n10\n\n-2\n\n10\n\n-1\n\n10\n\n0\n\n10\n\n1\n\n10\n\n2\n\nk/mg\n\nFigure 2. Comparison of an analytical approximation to ω(k) (dashed line) and the full\nnumerical solution (solid line).\n\nllwi: submitted to World Scientific on December 22, 2018\n\n4\n\n\fThe details of this procedure are described in Ref. [1]. The result for ω is\nshown in Figure 2. The data are presented with respect to a scale mg = ω(0)\nwhich must be determined by comparison with experiment (recall that this is\nfull QCD, the theory needs to be regulated and renormalized; the existence\nof mg is due to dimensional transmutation). Finally, the Coulomb interaction\nmay be evaluated. The result (after numerical Fourier transforming) is shown\nin Figure 3. Taking lattice data as \"experiment\" allows us to determine mg\nin terms of the lattice scale (the Sommer parameter). One finds mg ≈ 600\nMeV.\n15.0\n\nr0( VQQ(r) - VQQ(2r0) )\n\n10.0\n\n5.0\n\n0.0\n\n-5.0\n\n-10.0\n0.0\n\n2.0\n\n4.0\n\n6.0\n\n8.0\n\n10.0\n\nr/r0\n\nFigure 3. Static QQ̄ ground state potential. The solid line is the numerical solution, data\nare taken from Ref. [8].\n\nFinally, an examination of the UV limit of the coupled gap equations\nreveals that 12/11 of the one loop beta function is recovered. The reason\nis that the vacuum expectation value of the Coulomb interaction does not\ninclude the gluon loop contribution to the running coupling. This is generated\nby iterating the Hamiltonian and may be incorporated if desired. Figure 3\nmakes it clear that this will have little phenomenological effect.\n4\n\nConclusions\n\nCoulomb gauge allows dramatic simplification of the confinement (and bound\nstate) problem of QCD. Confinement must be contained in the nonabelian\nCoulomb interaction. We have shown that the combination of allowing modest\nflexibility in the vacuum and a judicious evaluation of the Coulomb kernel is\n\nllwi: submitted to World Scientific on December 22, 2018\n\n5\n\n\fsufficient to derive the lattice Wilson potential to great accuracy.\nUnfortunately, it is difficult to make cartoons which explain 'why' confinement occurs in this formalism. Nevertheless it is tempting to speculate that\nthe origin of confinement is related to the Gribov problem – the nonuniqueness\nof Coulomb gauge. A simple practical resolution of the Gribov problem is to\nrestrict the set of gauge configurations to those which form an absolute\nminiR\nmum of a functional in gauge transformation space (it is F [u] = Tr d3 x(Au )2\nwhere Au = uAu† −u∇u† ). The resulting set is called the fundamental modular region. It may be shown4 that this region is convex, includes the origin, and\nintersects the Gribov horizon (defined as the location in gauge space where the\nFaddeev-Popov operator vanishes). Two factors of the inverse Faddeev-Popov\noperator appear in the Coulomb interaction, and hence gauge configurations\nnear the horizon are naively strongly suppressed. However the horizon forms\na boundary in an infinite dimensional space and therefore carries a vast entropy. It is possible that these effects cancel, leaving a strong IR enhancement\nin the inverse Faddeev-Popov operator, d, and therefore in K. Details of this\npicture and phenomenological implications are being examined.\nAcknowledgments\nES would like to thank the organizers of the Lake Louise Winter Institute\nfor providing a truly marvelous venue for discussing physics and Dean Karlen\nand Francois Corriveau for organizing the first annual LLWI hockey game.\nThis work was supported by DOE under contracts DE-FG02-00ER41135, DEAC05-84ER40150 (ES), and DE-FG02-87ER40365 (AS).\nReferences\n1.\n2.\n3.\n4.\n5.\n6.\n7.\n\nA. P. Szczepaniak and E. S. Swanson, Phys. Rev. D 65, 025012 (2002).\nJ. Schwinger, Phys. Rev. 127, 324 (1962).\nN. H. Christ and T. D. Lee, Phys. Rev. D 22, 939 (1980).\nD. Zwanziger, Nucl. Phys. B 485, 185 (1997).\nD. Bohm and D. Pines, Phys. Rev. 42, 609 (1953).\nA. R. Swift, Phys. Rev. D 38, 668 (1988).\nF. L. Feinberg, Phys. Rev. D 17, 2659 (1978). See also T.D. Lee, Particle\nPhysics and Introduction to Field Theory, (Harwood Academic, New\nYork, 1981).\n8. K.J. Juge, J. Kuti, and C.J. Morningstar, Nucl. Phys. Proc. Suppl. 63,\n326 (1998).\n\nllwi: submitted to World Scientific on December 22, 2018\n\n6\n\n\f"}