{"id": "http://arxiv.org/abs/hep-ph/0301133v2", "guidislink": true, "updated": "2003-05-02T08:53:11Z", "updated_parsed": [2003, 5, 2, 8, 53, 11, 4, 122, 0], "published": "2003-01-17T12:55:41Z", "published_parsed": [2003, 1, 17, 12, 55, 41, 4, 17, 0], "title": "Emission of thermal photons and the equilibration time in Heavy-Ion\n  collisions", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0301069%2Chep-ph%2F0301097%2Chep-ph%2F0301249%2Chep-ph%2F0301003%2Chep-ph%2F0301071%2Chep-ph%2F0301229%2Chep-ph%2F0301133%2Chep-ph%2F0301174%2Chep-ph%2F0301275%2Chep-ph%2F0301204%2Chep-ph%2F0301137%2Chep-ph%2F0301020%2Chep-ph%2F0301057%2Chep-ph%2F0301175%2Chep-ph%2F0301143%2Chep-ph%2F0301046%2Chep-ph%2F0301220%2Chep-ph%2F0301240%2Chep-ph%2F0301217%2Chep-ph%2F0301129%2Chep-ph%2F0301233%2Chep-ph%2F0301099%2Chep-ph%2F0301009%2Chep-ph%2F0301014%2Chep-ph%2F0301192%2Chep-ph%2F0301085%2Chep-ph%2F0301029%2Chep-ph%2F0301269%2Chep-ph%2F0301083%2Chep-ph%2F0301262%2Chep-ph%2F0301093%2Chep-ph%2F0301075%2Chep-ph%2F0301008%2Chep-ph%2F0301168%2Chep-ph%2F0301238%2Chep-ph%2F0301203%2Chep-ph%2F0301256%2Chep-ph%2F0301201%2Chep-ph%2F0301186%2Chep-ph%2F0301254%2Chep-ph%2F0301161%2Chep-ph%2F0301224%2Chep-ph%2F0301164%2Chep-ph%2F0301221%2Chep-ph%2F0301166%2Chep-ph%2F0301007%2Chep-ph%2F0301178%2Chep-ph%2F0301109%2Chep-ph%2F0301037%2Chep-ph%2F0301210%2Chep-ph%2F0301089%2Chep-ph%2F0301208%2Chep-ph%2F0301235%2Chep-ph%2F0301102%2Chep-ph%2F0301226%2Chep-ph%2F0301023%2Chep-ph%2F0301191%2Chep-ph%2F0301198%2Chep-ph%2F0301241%2Chep-ph%2F0301187%2Chep-ph%2F0301271%2Chep-ph%2F0301219%2Chep-ph%2F0301026%2Chep-ph%2F0301106%2Chep-ph%2F0301251%2Chep-ph%2F0301120%2Chep-ph%2F0301156%2Chep-ph%2F0301015%2Chep-ph%2F0301154%2Chep-ph%2F0301091%2Chep-ph%2F0301246%2Chep-ph%2F0301245%2Chep-ph%2F0301065%2Chep-ph%2F0301033%2Chep-ph%2F0301067%2Chep-ph%2F0301263%2Chep-ph%2F0301077%2Chep-ph%2F0301190%2Chep-ph%2F0301188%2Chep-ph%2F0301239%2Chep-ph%2F0301112%2Chep-ph%2F0301040%2Chep-ph%2F0301078%2Chep-ph%2F0301248%2Chep-ph%2F0301121%2Chep-ph%2F0301145%2Chep-ph%2F0301211%2Chep-ph%2F0301024%2Chep-ph%2F0301113%2Chep-ph%2F0301005%2Chep-ph%2F0301031%2Chep-ph%2F0301063%2Chep-ph%2F0301115%2Chep-ph%2F0301022%2Chep-ph%2F0301138%2Chep-ph%2F0301042%2Chep-ph%2F0301257%2Chep-ph%2F0301244%2Chep-ph%2F0301274%2Chep-ph%2F0301072%2Chep-ph%2F0301167&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Emission of thermal photons and the equilibration time in Heavy-Ion\n  collisions"}, "summary": "The emission of hard real photons from thermalized expanding hadronic matter\nis dominated by the initial high-temperature expansion phase. Therefore, a\nmeasurement of photon emission in ultrarelativistic heavy-ion collisions\nprovides valuable insights into the early conditions realized in such a\ncollision. In particular, the initial temperature of the expanding fireball or\nequivalently the equilibration time of the strongly interacting matter are of\ngreat interest. An accurate determination of these quantities could help to\nanswer the question whether or not partonic matter (the quark gluon plasma) is\ncreated in such collisions. In this work, we investigate the emission of real\nphotons using a model which is based on the thermodynamics of QCD matter and\nwhich has been shown to reproduce a large variety of other observables. With\nthe fireball evolution fixed beforehand, we are able to extract limits for the\nequilibration time by a comparison with photon emission data measured by WA98.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0301069%2Chep-ph%2F0301097%2Chep-ph%2F0301249%2Chep-ph%2F0301003%2Chep-ph%2F0301071%2Chep-ph%2F0301229%2Chep-ph%2F0301133%2Chep-ph%2F0301174%2Chep-ph%2F0301275%2Chep-ph%2F0301204%2Chep-ph%2F0301137%2Chep-ph%2F0301020%2Chep-ph%2F0301057%2Chep-ph%2F0301175%2Chep-ph%2F0301143%2Chep-ph%2F0301046%2Chep-ph%2F0301220%2Chep-ph%2F0301240%2Chep-ph%2F0301217%2Chep-ph%2F0301129%2Chep-ph%2F0301233%2Chep-ph%2F0301099%2Chep-ph%2F0301009%2Chep-ph%2F0301014%2Chep-ph%2F0301192%2Chep-ph%2F0301085%2Chep-ph%2F0301029%2Chep-ph%2F0301269%2Chep-ph%2F0301083%2Chep-ph%2F0301262%2Chep-ph%2F0301093%2Chep-ph%2F0301075%2Chep-ph%2F0301008%2Chep-ph%2F0301168%2Chep-ph%2F0301238%2Chep-ph%2F0301203%2Chep-ph%2F0301256%2Chep-ph%2F0301201%2Chep-ph%2F0301186%2Chep-ph%2F0301254%2Chep-ph%2F0301161%2Chep-ph%2F0301224%2Chep-ph%2F0301164%2Chep-ph%2F0301221%2Chep-ph%2F0301166%2Chep-ph%2F0301007%2Chep-ph%2F0301178%2Chep-ph%2F0301109%2Chep-ph%2F0301037%2Chep-ph%2F0301210%2Chep-ph%2F0301089%2Chep-ph%2F0301208%2Chep-ph%2F0301235%2Chep-ph%2F0301102%2Chep-ph%2F0301226%2Chep-ph%2F0301023%2Chep-ph%2F0301191%2Chep-ph%2F0301198%2Chep-ph%2F0301241%2Chep-ph%2F0301187%2Chep-ph%2F0301271%2Chep-ph%2F0301219%2Chep-ph%2F0301026%2Chep-ph%2F0301106%2Chep-ph%2F0301251%2Chep-ph%2F0301120%2Chep-ph%2F0301156%2Chep-ph%2F0301015%2Chep-ph%2F0301154%2Chep-ph%2F0301091%2Chep-ph%2F0301246%2Chep-ph%2F0301245%2Chep-ph%2F0301065%2Chep-ph%2F0301033%2Chep-ph%2F0301067%2Chep-ph%2F0301263%2Chep-ph%2F0301077%2Chep-ph%2F0301190%2Chep-ph%2F0301188%2Chep-ph%2F0301239%2Chep-ph%2F0301112%2Chep-ph%2F0301040%2Chep-ph%2F0301078%2Chep-ph%2F0301248%2Chep-ph%2F0301121%2Chep-ph%2F0301145%2Chep-ph%2F0301211%2Chep-ph%2F0301024%2Chep-ph%2F0301113%2Chep-ph%2F0301005%2Chep-ph%2F0301031%2Chep-ph%2F0301063%2Chep-ph%2F0301115%2Chep-ph%2F0301022%2Chep-ph%2F0301138%2Chep-ph%2F0301042%2Chep-ph%2F0301257%2Chep-ph%2F0301244%2Chep-ph%2F0301274%2Chep-ph%2F0301072%2Chep-ph%2F0301167&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The emission of hard real photons from thermalized expanding hadronic matter\nis dominated by the initial high-temperature expansion phase. Therefore, a\nmeasurement of photon emission in ultrarelativistic heavy-ion collisions\nprovides valuable insights into the early conditions realized in such a\ncollision. In particular, the initial temperature of the expanding fireball or\nequivalently the equilibration time of the strongly interacting matter are of\ngreat interest. An accurate determination of these quantities could help to\nanswer the question whether or not partonic matter (the quark gluon plasma) is\ncreated in such collisions. In this work, we investigate the emission of real\nphotons using a model which is based on the thermodynamics of QCD matter and\nwhich has been shown to reproduce a large variety of other observables. With\nthe fireball evolution fixed beforehand, we are able to extract limits for the\nequilibration time by a comparison with photon emission data measured by WA98."}, "authors": ["Thorsten Renk"], "author_detail": {"name": "Thorsten Renk"}, "author": "Thorsten Renk", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevC.67.064901", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/hep-ph/0301133v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-ph/0301133v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "12 pages, 5 figures, accepted for publication at Phys. Rev. C", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-ph/0301133v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-ph/0301133v2", "journal_reference": "Phys.Rev. C67 (2003) 064901", "doi": "10.1103/PhysRevC.67.064901", "fulltext": "TUM/T39-03-01\nECT∗ -03-01\nEmission of thermal photons and the equilibration time in Heavy-Ion Collisions\n\n∗)\n\nThorsten Renka\n\narXiv:hep-ph/0301133v2 2 May 2003\n\na\n\nPhysik Department, Technische Universität München, D-85747 Garching, GERMANY\nand ECT∗ , I-38050 Villazzano (Trento), ITALY\n\nAbstract\nThe emission of hard real photons from thermalized expanding hadronic matter is dominated\nby the initial high-temperature expansion phase. Therefore, a measurement of photon emission in\nultrarelativistic heavy-ion collisions provides valuable insights into the early conditions realized in\nsuch a collision. In particular, the initial temperature of the expanding fireball or equivalently the\nequilibration time of the strongly interacting matter are of great interest. An accurate determination\nof these quantities could help to answer the question whether or not partonic matter (the quark gluon\nplasma) is created in such collisions. In this work, we investigate the emission of real photons using\na model which is based on the thermodynamics of QCD matter and which has been shown to\nreproduce a large variety of other observables. With the fireball evolution fixed beforehand, we are\nable to extract limits for the equilibration time by a comparison with photon emission data measured\nby WA98.\n\n1\n\nIntroduction\n\nIn the hot and dense system created in an ultrarelativistic heavy-ion collision (URHIC), the relevant\nmomentum scales for typical processes taking place inside the strongly interacting matter drop as a\nfunction of proper time τ : Initially, the relevant scale is set by the incident beam momentum, leading\nto hard scattering processes which presumably can be described by perturbative Quantum Chromodynamics (pQCD). Secondary inelastic scattering processes subsequently lower the momentum scales due\nto particle production. At later times, equilibration sets in and typical momenta p are determined by\nthe temperature T of a given volume element as hpi = 3T . As the matter expands, energy stored in\nrandom motion of particles (temperature) is transferred to collective motion (flow), leading to a descrease of T with τ . Therefore, by selecting an observable associated with a given momentum scale, one\nsimultaneously selects a time period in the evolution of the system.\nFor this reason, a measurement of hard real photons is an ideal tool to study the early moments of the\nfireball expansion: High momentum photons are not only sensitive to early proper times, but, being\nsubject to electromagnetic interactions only, their mean free path in the fireball matter is also much\nlarger than the spatial dimension of the system, therefore they are capable of leaving the emission region\nwithout significant rescattering. Therefore, hard photons complement a measurement of low mass, low\nmomentum dileptons which are dominantly emitted near the kinetic freeze-out point.\nIdeally, one would like to use hard photon emission as a thermometer to determine the initial temperature reached in an URHIC and use this information to verify the creation of a quark-gluon plasma\n(QGP). However, in reality one has to disentangle thermal contributions to the photon spectrum from\n∗) work\n\nsupported in part by BMBF, GSI and by the European Commission under contract HPMT-CT-2001-00370\n\n1\n\n\fcontributions coming from initial hard scattering processes. The interpretation of the photon spectrum\nalone can therefore not be unambiguous.\nIn this work, we compare a model calculation of photon emission from a fireball created in an 158\nAGeV Pb-Pb collision at SPS with data obtained by the WA98 collaboration [1]. In a recent paper\n[2], we have developed a fireball model which is based on information from hadronic observables and\nlattice QCD thermodynamics, as manifest in a quasiparticle picture of the QGP. This model has been\nshown to successfully describe low mass dilepton emission [2] and, within the framework of statistical\nhadronization, the measured abundancies of hadron species [3]. In the present work, we demonstrate\nthat the same model is also capable of describing the observed photon emission. The fixed setup of the\nmodel also enables us to establish constraints on the equilibration time τ0 , which entered the model on\nan ad-hoc basis so far.\nThis paper is organized as follows: First, we introduce the photon emission rate used in the calculation\nand discuss its interpretation in the framework of the quasiparticle picture of the QGP which has been\nused in the fireball evolution model. In the next section, we summarize the main properties of the\nevolution model and discuss constraints for the initial expansion phase. Afterwards we present the\nresulting photon spectrum and demonstrate that, in agreement with our expectation, hard photons\noriginate dominantly from the early evolution phase. We investigate the possibility of using the photon\ndata to set limits on the equilibration time of the fireball matter and conclude by comparing to the\nresults obtained by other groups.\n\n2\n2.1\n\nThe thermal photon emission rate\nThe QGP contribution\n\nAs we expect the dominant contribution to the spectrum of hard photons to come from a region of high\ntemperatures, we focus on the QGP rate. To leading order, this rate can be calculated by evaluating\nthe four diagrams shown in Fig.1. Here the last two diagrams are promoted to leading order because of\nnear-collinear singularities.\nq\n\nγ\n\nγ\nq\n\nγ\n\nq\n\nγ\n\nq\nq\n\ng\n\nq\n\nq\n\ng q ,g\n\nq ,g\n\nFigure 1: Leading order processes for photon production in the QGP (from left to right): QCD Compton\nscattering, qq annihilation, Bremsstrahlung and annihilation with scattering (aws).\nThe complete calculation of the rate to order αs has been a very involved task which has been finished\nonly recently [4, 5, 6, 7, 8, 9, 10]. For the present calculation, we use the parametrization of the rate\ngiven in [10]. There, the rate for photons of momentum k is written as\n\u0012\n\u0013\ndN\n1\n1\nA(k) ln(T /mq (T )) + ln(2E/T ) + Ctot (E/T ) ,\n=\nd4 xd3 k\n(2π)3\n2\n\n2\n\n(1)\n\n\fwith E = k and m2q (T ) = 4παs T 2 /3 the leading order large momentum limit of the thermal quark mass.\nThe leading log coefficient A(k) reads\nA(k) = 2αNC\n\nX\ns\n\nqs2\n\nm2q (T )\nfD (E).\nE\n\n(2)\n\nHere, the sum runs over active quark flavours and qs denotes the fractional quark charges in units of\nelementary charge. The Fermi-Dirac distribution fD (E) dominates the momentum dependence of the\nrate: To a good approximation it decreases exponentially with E. The dependence on the specific photon\nproduction process is contained in the term Ctot (E/T ):\nCtot (E/T ) = C2↔2 (E/T ) + Cbrems (E/T ) + Caws (E/T ).\n\n(3)\n\nAll these functions C(E/T ) involve non-trivial multidimensional integrals which can only be solved\nnumerically. In [10], parametrizations for the results are given as\nC2↔2 (E/T ) ≃ 0.041(E/T )−1 − 0.3615 + 1.01 exp[−1.35E/T ]\n\n(4)\n\nand\nCbrems (E/T )+Caws (E/T ) ≃\n!\nr\n1\n0.548 ln(12.28 + 1/(E/T ))\n0.133E/T\n1 + Nf\n.\n+p\n6\n(E/T )3/2\n1 + (E/T )/16.27\n\n2.2\n\n(5)\n\nA quasiparticle interpretation\n\nIn [2], we have used a picture of massive, non-interacting quark and gluon quasiparticles to describe the\nQGP. Close to the phase transition these quasiparticles are subject to confinement, parametrized by a\nuniversal function C(T ) which reduces the number of thermodynamically active degrees of freedom as\nR d3 p\nn(T ) = n0 (T )C(T ) with n0 (T ) = (2π)\n3 fB(D) (Ep /T ). Here, fB(D) (Ep /T ) denotes the Bose (Fermi)\ndistribution. In [11], it has been shown that this ansatz is capable of describing the lattice results for\nthe QCD thermodynamics extremely well.\nIn the case of photon emission, we cannot strictly retain this interpretation: The process qq → γ is\nkinematically impossible and all other emission processes would be suppressed by αem for non-interacting\nquasiparticles. On the other hand, the fact that we want to study hard photons implies that at least\none of the particles in the initial state is also hard. But such particles penetrate the screening cloud of\nthermal fluctuations which is ultimately responsible for the notion of weakly interacting quasiparticles.\nTherefore it appears reasonable to allow for interactions of plasma particles with momenta well above\nthe scale set by the temperature.\nThe remaining properties of the quasiparticle approach are encoded in the quasiparticle mass m(T )\nand the 'confinement factor' C(T ). In the limit of large temperatures, the quasiparticle mass in [11] is\nchosen such as to coincide with the result of hard thermal loop (HTL) resummed calculations for the\nthermal self-energy. Therefore, inserting massive quarks as degrees of freedom into the above results\nwould amount to double counting, since those already incorporate HTL resummation, at least as long\nas we consider only temperatures above 1.5 TC .\nThere is no equivalent of the confinement factor C(T ) in the calculations described in [4, 5, 6, 7, 8, 9, 10].\nWe can estimate the effect of introducing C(T ) as follows:\nA typical diagram, say qq annihilation, which contributes R0 to the total emission rate has the structure\nR0 ∼ fD (E/T )2 |M|2 (1 + fB (E/T )), with the thermal quark distributions fD in front of the squared\n3\n\n\fmatrix element M corresponding to the process in vacuum and a Bose enhancement factor for the gluon\nemitted into the final state. The modification of the rate R with respect to the rate R0 in the presence\nof C(T ) will read R ∼ C(T )2 fD (E/T )2 |M|2 (1 + C(T )fB (E/T )) which is always larger than C(T )3 R0 .\nIn the case of quarks in the final state, C(T ) leads even to a reduced Pauli blocking (the final state\nmodification becomes (1 − fD (E/T )C(T )) which is larger in the presence of confinement).\nOn the other hand, as mentioned above, at least one of the incoming particles has to have a large\nmomentum. Such high-momentum particles are not subject to confinement along with the bulk of the\nmatter. One would expect them to hadronize well outside the thermalized region, leading to C(1) = 1\nat one of the incoming legs in the diagram.\nTherefore, C(T )3 can be taken as a conservative estimate of the effect of the confinement factor on\nthe emission rate. If it can be shown that hard photon emission is dominated by a region where the\ntemperature is so large that C(T ) ≈ 1, the above expression for the emission rate can be used to\napproximately describe photon emission from a system of quasiparticles also. This is also the region\nwhere we expect the mass of quasiparticles to be given by the HTL result. We will verify this property\na posteriori.\nClearly, the prescription outlined here has to be regarded as an approximation till a more detailed version\nof a quasiparticle description of the QGP incorporating confinement is available.\n\n2.3\n\nThe hadronic contribution\n\nAs the temperatures in the hadronic evolution phase of the fireball are lower than in the QGP phase,\nwe expect the hadronic contributions to the emission of hard photons to be small. Therefore, we will\nnot discuss this contribution in great detail.\nVector mesons play an important role for the emission of photons from a hot hadronic gas. The first\ncalculation of such processes has been performed in [12] in the framework of an effective Lagrangian. It\nhas been found that the dominant processes are pion annihilation, π + π − → ργ, 'Compton scattering',\nπ ± ρ → π ± γ and ρ decay, ρ → π + π − γ.\nSeveral more refined approaches have been made since then (for an overview, see [13]). In the following,\nwe will use a parametrization of the rate from a hot hadronic gas taken from [14] which is given as\nE\n\n2.4\n\ndN\n[fm−4 GeV−2 ] ≃ 4.8T 2.15 exp[−1/(1.35ET )0.77] exp[−E/T ].\nd4 xd3 k\n\n(6)\n\nThe integrated rate\n\nIn order to compare to the experimentally measured photon spectrum [1], we have to integrate Eq. (1)\nover the space-time evolution of the fireball,\ndN\nd2 kt dy\n\ny=0\n\nπ\n=\n∆y\n\nZ\n\n2\n\ndτ R (τ )\n\nZ\n\nzmax (τ )\n\ndz\nzmin (τ )\n\nZ\n\nkmax (y(z))\n\ndkz\nkmin (y(z))\n\ndN\n.\nd4 xd3 k\n\n(7)\n\nIn this expression, R(τ ) stands for the radial expansion of the fireball, ∆y denotes the rapidity interval\ncovered by the detector, y(z) is the rapidity of a volume element at position z and the limits of the\nkz integration come from the fact that a photon emitted at the (boosted) edge of the fireball has to\nhave a longitudinal momentum in a certain range in order to be detected in the rapidity window of the\nexperiment. In this expression, we have assumed spatial homogeneity and a cylindrical fireball.\n\n4\n\n\f3\n\nThe fireball evolution model\n\nIn this section, we briefly outline the general framework of the fireball evolution model. The model is\ndescribed in greater detail in [2] and [15].\nThe underlying assumption of the model is that the strongly interacting matter produced in the initial\ncollision reaches thermal equilibrium at a timescale τ0 ≈ 1 fm/c. For simplicity, we assume spatial\nhomogeneity of all thermodynamic parameters throughout a 3-volume at a given proper time. The\nevolution dynamics is then modelled by calculating the thermodynamic response to a volume expansion\nthat is consistent with measured hadronic momentum spectra at freeze-out.\nThe volume itself is taken to be cylindrically symmetric around the beam (z-)axis. In order to account for\ncollective flow, we boost individual volume elements inside the fireball volume with velocities depending\non their position. As flow velocities in longitudinal direction turn out to be close to the speed of light,\nwe have to include the effects of time dilatation. On the other hand, we can neglect the additional\ntime dilatation caused by transverse motion, since typically v⊥ ≪ vz . The thermodynamically relevant\nvolume is then given by the collection of volume elements corresponding to the same proper time τ . In\norder to characterize the volume expansion within the given framework, we need first of all the expansion\nvelocity in longitudinal direction as it appears in the center of mass frame. For the position of the front\nof the cylinder, we make the ansatz\nZ t Z t′\np(t′′ )\nz(t) = v0 t + cz dt′ dt′′\n,\n(8)\nǫ(t′′ )\nt0\nt0\nwhere cz is a free parameter. The time t starts running at t0 such that z0 = v0 t0 is the initial longitudinal\nextension with v0 the initial longitudinal\nexpansion velocity. The longitudinal position z(t) and t itself\np\ndefine a proper time curve τ = t2 − z 2 (t). Solving for t̃ = t(τ ) one can construct z̃(τ ) = z(t̃). Then\nthe position of the fireball front z(t) in the center of mass frame can be translated into the longitudinal\nextension L(τ ) of the cylinder on the curve of constant proper time τ . One obtains\nZ z̃(τ ) r\ns\n.\n(9)\nds 1 + √\nL(τ ) = 2\n2 + τ2\ns\n0\nAt the same proper time we can define the transverse flow velocity and construct the transverse extension\nof the cylinder as a circle of radius\nZ τ Z τ′\np(τ ′′ )\nR(τ ) = R0 + c⊥\ndτ ′\ndτ ′′\n(10)\nǫ(τ ′′ )\nτ0\nτ0\nwhere R0 corresponds to the initial overlap radius, and c⊥ is a free parameter. With the values of L and\nR obtained at a given proper time we can parametrize the 3-dimensional volume as\nV (τ ) = πR2 (τ ) L(τ ) .\n\n(11)\n\nIn principle the model is fully constrained by fixing the freeze-out time tf (at the fireball front), the\nproper time τf and the two constants c⊥ and cz , such that the measured hadronic observables are\nreproduced. In practice this is achieved only at SPS energy, where the freeze-out analysis [16] allows a\ncomplete characterization on the basis of hadronic dN/dy and mt -spectra and HBT radii. For the 5%\nmost central Pb-Pb collisions one requires\nR(τf ) = Rf ,\n\nf\nv⊥ (τf ) = v⊥\n,\n\nvz (τf ) = vzf\n\nand T (τf ) = Tf\n\n(12)\n\nwhile making a trial ansatz for the ratio p/ǫ. Note that the proportionality of the acceleration to this\nratio (which is reminescent of the behaviour of the speed of sound) allows a soft point in the EoS to\ninfluence and delay the volume expansion.\n5\n\n\fAssuming entropy conservation during the expansion phase, we fix the entropy per baryon from the\nnumber of produced particles per unit rapidity. Calculating the number of participant baryons as\nZ\nZ\n\u0002\n\u0003\nin\nNp (b) = d2 s np (b, s) = d2 s TA (s) 1 − exp(−σN\n(13)\nN TB (|b − s|) + (TA ↔ TB ) ,\n\nwe find the total entropy S0 . The entropy density at a given proper time is then determined by s =\nS0 /V (τ ). Using the EoS given by the quasiparticle approach [11], thereby providing the link with lattice\nQCD, we find T (s(τ )) and also p(τ ) and ǫ(τ ), which in the next iteration replace the trial ansatz in the\nvolume parametrization. Finally we arrive at a thermodynamically self-consistent model for the fireball\nwhich is by construction able to describe the hadronic momentum spectra at freeze-out.\nIn order to find the fireball evolution relevant for the photon emission measured for the 10% most\ncentral collisions, we follow the procedure outlined in [2]. In brief, we consider an effective system which\nstarts out with a reduced number of participants and hence reduced total entropy content. Neglecting\nazimuthal asymmetries, we keep parametrizing the expanding system as a cylinder with reduced initial\nradius. Assuming that the freeze-out temperature is approximately unchanged for more peripheral\ncollisions, we determine a reduced proper evolution time and modify the geometrical freeze-out radius\nand the transverse flow velocity accordingly. However, going from the 5% to the 10% most central\ncollisions, we find differences in the early evolution phases on the level of a few percent only.\nThus, the fireball evolution is completely constrained by hadronic observables. In [2], it has been shown\nthat this scenario is able to describe the measured spectrum of low mass dileptons, and in [3] it has been\ndemonstrated that under the assumption of statistical hadronization at the phase transition temperature\nTC , the measured multiplicities of hadron species can be reproduced. None of these quantities is, however,\nsensitive to the detailed choice of the equilibration time τ0 . Therefore, we have only considered the\n'canonical' choice τ0 = 1 fm/c so far. The calculation of photon emission within the present framework\nprovides the opportunity to test this assumption and to limit the choice of τ0 .\n\n4\n\nResults\n\nThe result of the evaluation of Eq.(7) with the fireball evolution model described in the previous section\nis shown in Fig. 2.\n100\n\nWA98 data\ntotal rate\nQGP\nhadronic matter\n\n2\n\ndN/d 2 k tdy [GeV ]\n\n1\n−\n\n0.01\n0.0001\n-6\n10\n-8\n10\n-10\n10\n0.5\n\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\n3.5\n\n4\n\nk t [GeV]\n\nFigure 2: Thermal photon spectrum for 10% most central Pb-Pb collisions at SPS, 158 AGeV Pb-Pb\ncollisions, shown are calculated rate (total, contribution from QGP and hadronic gas) and experimental\ndata [1].\n6\n\n\fThe overall agreement with the data is remarkably good. Above 2 GeV, the calculation underestimates\nthe data somewhat, leaving room for a contribution of prompt photons from initial hard processes of\nabout the same magnitude as the thermal yield. Note that the spectrum is almost completely saturated\nby the QGP contribution - for kt > 3 GeV, the hadronic contribution is almost two orders of magnitude\ndown. This can in essence be traced back to the strong temperature dependence of the emission rate\nnormalization and justifies the approximate treatment of the hadronic contribution a posteriori.\nIn order to study the importance of the initial, high temperature phase in more detail, we present the\ntime evolution of the spectrum in Fig. 3.\n1\n\ntotal rate\n0.2 fm/c\n0.5 fm/c\n1.0 fm/c\n2 fm/c\n\n2\n\ndN/d 2 k tdy [GeV ]\n\n0.1\n−\n\n0.01\n0.001\n0.0001\n-5\n10\n-6\n10\n-7\n10\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\n3.5\n\n4\n\nk t [GeV]\n\nFigure 3: The total photon emission spectrum and the integrated rate at proper times τ = 0.2, 0.5, 1.0\nand 2 fm/c of the fireball evolution.\nOne observes that the large kt region is almost exclusively dominated by the first fm/c of evolution proper\ntime, whereas the yield in the low kt region is not yet saturated after 2 fm/c. However, the temperature\nassociated with these evolution times is always larger than 250 MeV, leading to C(T ) > 0.9 [11] and\nC(T )3 ≈ 0.7. This justifies neglecting the effect of quasiparticle properties on the rate a posteriori:\nThere is a 30% uncertainty introduced into the calculation, but this is comparable with other intrinsic\nuncertainties, such as the detailed choice of the numerical value of αS (T ) in this temperature regime.\nThe high kt tail of the spectrum is potentially capable of providing information about the initial temperature reached immediately after equilibration. This capability is seriously limited in practice, however, by\nthe need to assess an unknown contribution of prompt photons, which may be large in this region. Bearing this uncertainty in mind, we can nevertheless pursue this idea further in Fig. 4 where we investigate\nthe sensitivity of the result to the equilibration time τ0 of the fireball.\nWe find that the low kt region of the spectrum is hardly affected by different choices for the equilibration\ntime, while for larger kt one is increasingly sensitive to short evolution timescales. An equilibration time\nof 0.5 fm/c corresponding to an initial temperature of 370 MeV leads to a good description of the data\nwithout the inclusion of any prompt photon contribution. On the other hand, a rather slow equilibration\ncorresponding to τ0 = 2 fm/c and an initial temperature of 260 MeV requires a sizeable contribution\nfrom prompt photons.\nWithout any reference to prompt photons, we are therefore able to fix τ = 0.5 fm/c as the lower bound\nfor the equilibration time: Shorter timescales would lead to thermal photon emission overshooting the\ndata.\nIf we want to find an upper limit for the equilibration time, we have to address the issue of prompt photon\nemission. For this purpose, we use the results of two different works [17, 18] to illustrate the possible\n\n7\n\n\f10\n\nWA98 data\n\nτ = 1.0 fm/c\n0\nτ = 0.5 fm/c\n0\nτ = 2.0 fm/c\n\n0.1\n\n2\n\ndN/d 2 k tdy [GeV ]\n\n1\n\n0\n\n−\n\n0.01\n0.001\n0.0001\n-5\n10\n-6\n10\n-7\n10\n-8\n10\n0.5\n\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\n3.5\n\n4\n\nk t [GeV]\n\nFigure 4: The thermal photon emission spectrum for different choices of the equilibration time τ0 as\ncompared to experimental data [1].\nrange of predictions dependent on the average value of pt , an 'intrinsic' transverse momentum scale\nwhich is introduced as a phenomenological parameter to account for non-perturbative effects. (Fig. 5).\n10\n\n-2\n2\n\n-3\n5\n2\n\n10\n\n-4\n5\n\n3\n\n3\n\n2\n\nEd N /dk [1/GeV ]\n\n2\n\n10\n\n2\n\n<pt >=0 GeV\n2\n2\n<pt >=0.9 GeV\n2\n2\n<pt >=1.3 GeV\n2\n2\n<pt >=1.8 GeV\n2\n2\n<pt >=2.4 GeV\nWA98\n\n5\n\n2\n\n10\n\n-5\n5\n2\n\n-6\n\n10\n\n1.5\n\n2.0\n\n2.5\n\n3.0\n\n3.5\n\n4.0\n\nkt [GeV]\n\nFigure 5: Prompt photon production in Pb-Pb collisions as a function of the photon transverse momentum kt for different values of average parton intrinsic transverse momentum hp2t i [17] as compared\nto experimental data [1] (figure adapted from [17]).\nOne observes that prompt photon production is able to explain the data above 3 GeV for hp2t i ∼ 1.8\nGeV2 , but no choice of hp2t i leads to a description of the data below 3 GeV. Thus, there is a momentum\nregion between 2 and 2.5 GeV where the data are only weakly affected by a prompt photon contribution.\nOn the other hand, the present calculation of thermal photon emission indicates sensitivity to the\nequilibration time in this region (see Fig. 4). One finds that an equilibration time of 2 fm/c is unable to\ndescribe the data even in the presence of a sizeable prompt photon contribution, hence we may regard\nthis as the upper limit for the equilibration time given the results of [17].\nIf we use alternatively the results of [18] to estimate the contribution of prompt photons, the situation\nis somewhat less clear, though the main conclusions remain valid. In the momentum region near 2 GeV,\n8\n\n\fthe result obtained for the prompt photon contribution in [18] is about 50% of the thermal emission\nspectrum obtained with τ0 = 1 fm/c in the present calculation, which in turn is already on the lower end\nof the error bars of the data. Therefore, the prompt photon contribution alone is unable to explain the\nspectrum in this momentum region, and a thermal contribution with τ0 ≈ 2 fm/c is needed to describe\nthe data near kt = 2 GeV. (In [18], it is stated that the prompt photon contribution is of the same size\nas the thermal emission spectrum corresponding to a fireball with initial temperature of 300 MeV, which\nis not true in the present calculation. However, this statement is derived using Bjorken hydrodynamics,\nwhereas the present model incorporates longitudinal acceleration of the fireball matter which leads to\nless cooling initially and hence to a prolonged QGP phase.)\nHowever, there are several uncertainties in the calculation. We have already discussed the complications\nintroduced by the quasiparticle picture and the detailed choice of αS . An additional potential problem\nin the calculation is that the rate has been calculated to order αS , but αS is not a small quantity in\nthe relevant temperatur region, so there might be sizeable higher order corrections. In view of these\nuncertainties and the less urgent need for an addition al contribution to prompt photons if the results\nof [18] are taken, it is possibly better to estimate 0.5 fm/c < τ0 < 3 fm/c for the equilibration time.\nIn principle, one might try to construct a scenario with a large equilibration time, using the most\noptimistic estimate for the prompt photon contribution. Below temperatures ∼ 200 MeV, the approximations made to calculate the photon emission from the QGP phase break down, however qualitatively\nwe expect the confinement factor C(T ) to strongly reduce the emission rate. Likely candidates for photon\nyield between 2 and 2.5 GeV are therefore only the hadronic evolution phase and the pre-equilibrium\nphase.\nIn order for the hadronic phase to contribute significantly, either the emission rate or the four-volume of\nemitting matter needs to be increased significantly. The four-volume of fireball matter in the hadronic\nphase, however, is tightly constrained by the measured amount of dilepton radiation, which has been\ndiscussed in the present framework in [2]. An increase of the emissivity of a hadronic gas, on the other\nhand, would very likely be accompanied by a change in the number of active degrees of freedom, which\npresumably are driven by in-medium mass reductions of resonances as argued in [19]. A strong increase\nof active degrees of freedom, however, is not in agreement with a statistical hadronization analysis done\nin [3]. Even an overall mass reduction of 10% (excluding the pseudoscalars) is not compatible with the\nobserved hadron ratios. Therefore, within the present framework, the hadronic phase is not likely to\ngive a large contribution to the photon spectrum.\nIt remains the question of the yield from the pre-equilibrium phase. No rigorous scenario leading to\nthermal equilibrium for SPS conditions has been developed so far, however, several aspects of the preequilibrium dynamics have already been investigated.\nIn [20], the kinetic equilibration of different quark flavours was investigated under the assumption that\ngluons come to an early equilibrium and constitute a heat bath in which quark motion takes place.\nAn early non-equilibrium distribution of quarks would of course directly influence the photon emission\nspectrum. Somewhat related is the question of chemical equilibration of quarks. Here, the hot-glue\nscenario [21] has been suggested where an initial undersaturation of the quark densities with respect to\nthe thermal equilibrium densities is assumed, i.e. almost all of the entropy of the system is carried by\nthe gluons, leading to a drastically increased initial temperature.\nThe findings of [20] suggest, albeit for RHIC conditions, that the typical timescale for the kinetic equilibration of light quark flavours is of order ∼ 1 fm/c. This timescale is roughly in line with the assumptions\nmade in the present work. However, it leaves the question if the photon emission signal is affected if one\nstarts with a suitable out-of-equilibrium initial quark distribution.\nRegarding the hot-glue scenario, note that the drastically increased temperature of the partonic matter\nwould mostly affect the high momentum tail of observed photons and therefore leave the momentum\n\n9\n\n\fregion below 2.5 GeV less affected. This is especially true since also the overall normalization of the\nemission rate is reduced with respect to equilibrium conditions due to the undersaturation of the quark\ndensities.\nA different approach to pre-equilibrium dynamics has been taken in [22]. Here, transverse momentum\ndependence of dilepton emission has been calculated in a kinetic framework and calculations for different\ninitital parton distributions have been tested. While the approach is very interesting, it is hard to directly\nestimate its possible influence on photon emission within the present framework.\nIn [23], an investigation of non-equilibrium photon emission has been carried out using a parton-cascade\nmodel (PCM). Here, the essential findings were that only a very dilute partonic medium is created in\nthe collision. Photon emission from this medium was shown to explain the data above 3 GeV when\nintegrated up to the hadronization point, but below 3 GeV, the photon spectrum from the partonic\nphase falls below the data. It is difficult to relate these findings directly to the present approach, since\nno equilibrium phase in either partonic or hadronic phase is described in the PCM. However, we may take\nthis as an indication that pre-equilibrium dynamics is most likely to strongly affect the high momentum\nregion of the photon spectrum only where we find considerable uncertainties with regard to the question\nof intrinsic pt anyway.\nIn the present work, no attempt has been made to calculate a contribution to the photon spectrum from\npre-equilibrium matter. It is, however, unlikely that a long-lasting pre-equilibrium phase is characterized\nby a strong photon emission rate, since strong photon emission indicates frequent interaction processes\nin the medium which in turn would lead to fast equilibration. Furthermore, it is plausible that a preequilibrium contribution mainly affects the (uncertain) high momentum region of the spectrum, as it is\ncharacterized by hard momentum scales. Nevertheless, all results discussed in this paper are subject to\nsome uncertainties resulting from the poor knowledge of pre-equilibrium dynamics.\n\n5\n\nComparison to other works\n\nSeveral other scenarios have been investigated by different authors in order to explain the photon spectrum measured by WA98. In [24], a hydrodynamical evolution model has been used. The favoured\nscenario found in this work uses a very short equilibration time of 0.2 fm/c, corresponding to an (average) initial temperature of 335 MeV. The contribution of thermal photons is about 50% of the total\nyield, the rest is prompt photon contribution.\nWhile the result for the equilibration time is clearly very different from the findings of the present work,\nseveral other results are similar, among them the weak sensitivity to the phase transition temperature\nTC (indicating the dominance of early emission phases), the favoured large initial temperature and the\ndominance of the QGP over the hadronic signal. It remains to explain the remarkable difference in the\nconclusions about the equilibration time.\nNote that both in [24] and the present work large initial temperatures Ti >\n∼ 300 MeV are needed to give\na sizeable thermal photon emission in the momentum range in question. The choice of τ0 = 0.2 fm/c\nseems mainly driven by the need to create such large Ti . There are, however, two important differences\nbetween our model and the one in [24] which lead naturally to large initial temperatures for equilibration\ntimes above 0.5 fm/c in our approach.\nFirst, we employ an EoS as based on lattice results, which leads to a temperature increase of about 30%\nfor a given entropy density as compared to a bag model EoS. Second, the temperatures quoted in [24]\nare obtained using the Bjorken estimate [25]. Our fireball evolution, however, incorporates significant\nlongitudinal acceleration of matter, which in essence leads to a peaked initial distribution of energy\ndensity at central rapidities and hence to significantly larger initial temperatures.\n\n10\n\n\fIn [26], a number of scenarios with different EoS and initial state have been investigated within a\nhydrodynamical description. The reference scenario described there uses a bag model EoS for the QGP\nphase with a transition temperature of 180 MeV and an initial state which leads to a peak initial\ntemperature of Timax = 325 MeV and an average initial temperature of T (z = 0) = 255 MeV. There is\nclearly a discrepancy between the average initial temperature in [26] and the present work. Due to the\ndifferent space-time expansion patterns of the hot matter in the (averaged) present calculation and a\nhydrodynamics evolution, this issue could possibly best be clarified by comparing the amount of fourvolume corresponding to a given temperature instead of comparing the average at a given τ . At the\nmoment however, this has to be regarded as an open question.\nIn addition, there is a larger contribution to the photon spectrum of matter with temperatures below\n200 MeV observed in [26] (about 40% of the total yield)as compared to our model. This is presumably\ncaused the different choice of the EoS, which in the bag model case leads to faster cooling and to a\nlong-lasting mixed phase, in essence reducing the weight of contributions from high temperatures and\nenhancing the low- temperature yield.\n\n6\n\nSummary\n\nA measurement of hard real photon emission provides a good opportunity to study the early evolution of\na fireball. Due to the temperature dependence of the photon emission rate, the QGP phase is expected to\ndominate over the contribution from the hadronic phase. We have used the leading order photon emission\nrate from the QGP, along with estimates of the impact of our phenomenological quasiparticle picture\non this rate, in a simple model for the fireball evolution to calculate the resulting photon spectrum. As\nthis model was fixed beforehand, we have not introduced any new free parameters.\nFor the 'standard choice' of the equilibration time τ0 , the model has been able to give a good description\nof the data. Nevertheless, we have tried variations of this quantity in order to work out constraints.\nWith the help of an estimate for the contribution of photons from initial, hard processes, we found for\nthe equilibration time 0.5 fm/c < τ0 < 3 fm/c. This would imply that a QGP phase must be present in\nthe evolution, at least within the present model.\nOverall, our picture of the spacetime evolution of the fireball finds now support from both the low\nmomentum (late time) and the high momentum (early time) region of the evolution. More precise\nfuture measurements and calculations can be expected to tighten the constraints on the equilibration\ntime.\n\nAcknowledgements\nI would like to thank W. Weise, S.S. Räsänen, R.A. Schneider and A. Polleri for interesting and stimulating discussions and helpful comments.\n\nReferences\n[1] M. M. Aggarwal et al. (WA98 Collaboration), nucl-ex/0006007.\n[2] T. Renk, R. A. Schneider and W. Weise, Phys. Rev. C 66 (2002) 014902.\n[3] T. Renk, hep-ph/0210307.\n\n11\n\n\f[4] J. Kapusta, P. Lichard and D. Seibert, Phys. Rev. D 44 (1991) 2774.\n[5] R. Baier, H. Nakkagawa, A. Niegawa and K. Redlich, Z. Phys. C 53 (1992) 433.\n[6] P. Aurenche, F. Gelis, R. Kobes and H. Zaraket, Phys. Rev. D 58 (1998) 085003.\n[7] P. Aurenche, F. Gelis and H. Zaraket, Phys. Rev. D 61 (2000) 116001.\n[8] P. Aurenche, F. Gelis and H. Zaraket, Phys. Rev. D 62 (2000) 096012.\n[9] P. Arnold, G. D. Moore and L. G. Yaffe, JHEP 0111 (2001) 057.\n[10] P. Arnold, G. D. Moore and L. G. Yaffe, JHEP 0112 (2001) 009.\n[11] R. A. Schneider and W. Weise, Phys. Rev. C 64 (2001) 055201.\n[12] J. I. Kapusta, P. Lichard and D. Seibert, Phys. Rev. D 44 (1991) 2774.\n[13] T. Peitzmann and M. H. Thoma, Phys. Rept. 364 (2002) 175.\n[14] F. D. Steffen and M. Thoma, Phys. Lett. B 510 2001 98.\n[15] T. Renk, PhD Thesis.\n[16] B. Tomasik, U. A. Wiedemann and U. W. Heinz, nucl-th/9907096.\n[17] A. Dumitru, L. Frankfurt, L. Gerland, H. Stocker and M. Strikman, Phys. Rev. C 64 (2001) 054909.\n[18] C. Y. Wong and H. Wang, Phys. Rev. C 58 (1998) 376.\n[19] J. e. Alam, P. Roy, S. Sarkar and B. Sinha, nucl-th/0106038.\n[20] J. Alam, B. Sinha and S. Raha, Phys. Rev. Lett. 73 (1994) 1895.\n[21] E. V. Shuryak, Phys. Rev. Lett 68 (1992) 3270, E. V. Shuryak and L. Xiong, Phys. Rev. Lett 70\n(1993) 2241.\n[22] B. Kampfer and O. P. Pavlenko, Phys. Rev. C 49 (1994) 2716.\n[23] S. A. Bass, B. Muller and D. K. Srivastava, Phys. Rev. C 66 (2002) 061902.\n[24] D. K. Srivastava and B. Sinha, Phys. Rev. C 64 (2001) 034902.\n[25] J. D. Bjorken, Phys. Rev. D 27, (1983) 140.\n[26] P. Huovinen, P. V. Ruuskanen and S. S. Rasanen, Phys. Lett. B 535 (2002) 109.\n\n12\n\n\f"}