{"id": "http://arxiv.org/abs/hep-ph/0101318v2", "guidislink": true, "updated": "2001-09-12T12:40:09Z", "updated_parsed": [2001, 9, 12, 12, 40, 9, 2, 255, 0], "published": "2001-01-29T12:28:57Z", "published_parsed": [2001, 1, 29, 12, 28, 57, 0, 29, 0], "title": "Mesons on a transverse lattice", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0101060%2Chep-ph%2F0101139%2Chep-ph%2F0101028%2Chep-ph%2F0101141%2Chep-ph%2F0101133%2Chep-ph%2F0101196%2Chep-ph%2F0101037%2Chep-ph%2F0101244%2Chep-ph%2F0101253%2Chep-ph%2F0101229%2Chep-ph%2F0101126%2Chep-ph%2F0101027%2Chep-ph%2F0101356%2Chep-ph%2F0101071%2Chep-ph%2F0101328%2Chep-ph%2F0101074%2Chep-ph%2F0101010%2Chep-ph%2F0101005%2Chep-ph%2F0101129%2Chep-ph%2F0101066%2Chep-ph%2F0101276%2Chep-ph%2F0101131%2Chep-ph%2F0101006%2Chep-ph%2F0101225%2Chep-ph%2F0101318%2Chep-ph%2F0101087%2Chep-ph%2F0101329%2Chep-ph%2F0101197%2Chep-ph%2F0101016%2Chep-ph%2F0101238%2Chep-ph%2F0101090%2Chep-ph%2F0101180%2Chep-ph%2F0101015%2Chep-ph%2F0101138%2Chep-ph%2F0101282%2Chep-ph%2F0101186%2Chep-ph%2F0101235%2Chep-ph%2F0101043%2Chep-ph%2F0101086%2Chep-ph%2F0101162%2Chep-ph%2F0101259%2Chep-ph%2F0101136%2Chep-ph%2F0101143%2Chep-ph%2F0101011%2Chep-ph%2F0101204%2Chep-ph%2F0101287%2Chep-ph%2F0101116%2Chep-ph%2F0101351%2Chep-ph%2F0101153%2Chep-ph%2F0101150%2Chep-ph%2F0101022%2Chep-ph%2F0101035%2Chep-ph%2F0101042%2Chep-ph%2F0101115%2Chep-ph%2F0101299%2Chep-ph%2F0101294%2Chep-ph%2F0101169%2Chep-ph%2F0101025%2Chep-ph%2F0101175%2Chep-ph%2F0101325%2Chep-ph%2F0101346%2Chep-ph%2F0101242%2Chep-ph%2F0101014%2Chep-ph%2F0101218%2Chep-ph%2F0101091%2Chep-ph%2F0101260%2Chep-ph%2F0101231%2Chep-ph%2F0101305%2Chep-ph%2F0101101%2Chep-ph%2F0101021%2Chep-ph%2F0101217%2Chep-ph%2F0101203%2Chep-ph%2F0101355%2Chep-ph%2F0101228%2Chep-ph%2F0101333%2Chep-ph%2F0101182%2Chep-ph%2F0101164%2Chep-ph%2F0101280%2Chep-ph%2F0101073%2Chep-ph%2F0101112%2Chep-ph%2F0101249%2Chep-ph%2F0101277%2Chep-ph%2F0101075%2Chep-ph%2F0101152%2Chep-ph%2F0101003%2Chep-ph%2F0101099%2Chep-ph%2F0101183%2Chep-ph%2F0101067%2Chep-ph%2F0101174%2Chep-ph%2F0101039%2Chep-ph%2F0101032%2Chep-ph%2F0101098%2Chep-ph%2F0101054%2Chep-ph%2F0101347%2Chep-ph%2F0101295%2Chep-ph%2F0101224%2Chep-ph%2F0101068%2Chep-ph%2F0101056%2Chep-ph%2F0101239%2Chep-ph%2F0101142%2Chep-ph%2F0101309&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Mesons on a transverse lattice"}, "summary": "The meson eigenstates of the light-cone Hamiltonian in a coarse transverse\nlattice gauge theory are investigated. Building upon previous work in pure\ngauge theory, the Hamiltonian and its Fock space are expanded in powers of\ndynamical fields. In the leading approximation, the couplings appearing in the\nHamiltonian are renormalised by demanding restoration of space-time symmetries\nbroken by the cut-off. Additional requirements from chiral symmetry are\ndiscussed and difficulties in imposing them from first principles in the\nleading approximation are noted. A phenomenological calculation is then\nperformed, in which chiral symmetry in spontaneously broken form is modelled by\nimposing the physical pion-rho mass splitting as a constraint. The light-cone\nwavefunctions of the resulting Hamiltonian are used to compute decay constants,\nform factors and quark momentum and spin distributions for the pion and rho\nmesons. Extensions beyond leading order, and the implications for first\nprinciples calculations, are briefly discussed.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0101060%2Chep-ph%2F0101139%2Chep-ph%2F0101028%2Chep-ph%2F0101141%2Chep-ph%2F0101133%2Chep-ph%2F0101196%2Chep-ph%2F0101037%2Chep-ph%2F0101244%2Chep-ph%2F0101253%2Chep-ph%2F0101229%2Chep-ph%2F0101126%2Chep-ph%2F0101027%2Chep-ph%2F0101356%2Chep-ph%2F0101071%2Chep-ph%2F0101328%2Chep-ph%2F0101074%2Chep-ph%2F0101010%2Chep-ph%2F0101005%2Chep-ph%2F0101129%2Chep-ph%2F0101066%2Chep-ph%2F0101276%2Chep-ph%2F0101131%2Chep-ph%2F0101006%2Chep-ph%2F0101225%2Chep-ph%2F0101318%2Chep-ph%2F0101087%2Chep-ph%2F0101329%2Chep-ph%2F0101197%2Chep-ph%2F0101016%2Chep-ph%2F0101238%2Chep-ph%2F0101090%2Chep-ph%2F0101180%2Chep-ph%2F0101015%2Chep-ph%2F0101138%2Chep-ph%2F0101282%2Chep-ph%2F0101186%2Chep-ph%2F0101235%2Chep-ph%2F0101043%2Chep-ph%2F0101086%2Chep-ph%2F0101162%2Chep-ph%2F0101259%2Chep-ph%2F0101136%2Chep-ph%2F0101143%2Chep-ph%2F0101011%2Chep-ph%2F0101204%2Chep-ph%2F0101287%2Chep-ph%2F0101116%2Chep-ph%2F0101351%2Chep-ph%2F0101153%2Chep-ph%2F0101150%2Chep-ph%2F0101022%2Chep-ph%2F0101035%2Chep-ph%2F0101042%2Chep-ph%2F0101115%2Chep-ph%2F0101299%2Chep-ph%2F0101294%2Chep-ph%2F0101169%2Chep-ph%2F0101025%2Chep-ph%2F0101175%2Chep-ph%2F0101325%2Chep-ph%2F0101346%2Chep-ph%2F0101242%2Chep-ph%2F0101014%2Chep-ph%2F0101218%2Chep-ph%2F0101091%2Chep-ph%2F0101260%2Chep-ph%2F0101231%2Chep-ph%2F0101305%2Chep-ph%2F0101101%2Chep-ph%2F0101021%2Chep-ph%2F0101217%2Chep-ph%2F0101203%2Chep-ph%2F0101355%2Chep-ph%2F0101228%2Chep-ph%2F0101333%2Chep-ph%2F0101182%2Chep-ph%2F0101164%2Chep-ph%2F0101280%2Chep-ph%2F0101073%2Chep-ph%2F0101112%2Chep-ph%2F0101249%2Chep-ph%2F0101277%2Chep-ph%2F0101075%2Chep-ph%2F0101152%2Chep-ph%2F0101003%2Chep-ph%2F0101099%2Chep-ph%2F0101183%2Chep-ph%2F0101067%2Chep-ph%2F0101174%2Chep-ph%2F0101039%2Chep-ph%2F0101032%2Chep-ph%2F0101098%2Chep-ph%2F0101054%2Chep-ph%2F0101347%2Chep-ph%2F0101295%2Chep-ph%2F0101224%2Chep-ph%2F0101068%2Chep-ph%2F0101056%2Chep-ph%2F0101239%2Chep-ph%2F0101142%2Chep-ph%2F0101309&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The meson eigenstates of the light-cone Hamiltonian in a coarse transverse\nlattice gauge theory are investigated. Building upon previous work in pure\ngauge theory, the Hamiltonian and its Fock space are expanded in powers of\ndynamical fields. In the leading approximation, the couplings appearing in the\nHamiltonian are renormalised by demanding restoration of space-time symmetries\nbroken by the cut-off. Additional requirements from chiral symmetry are\ndiscussed and difficulties in imposing them from first principles in the\nleading approximation are noted. A phenomenological calculation is then\nperformed, in which chiral symmetry in spontaneously broken form is modelled by\nimposing the physical pion-rho mass splitting as a constraint. The light-cone\nwavefunctions of the resulting Hamiltonian are used to compute decay constants,\nform factors and quark momentum and spin distributions for the pion and rho\nmesons. Extensions beyond leading order, and the implications for first\nprinciples calculations, are briefly discussed."}, "authors": ["S. Dalley"], "author_detail": {"name": "S. Dalley"}, "author": "S. Dalley", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.64.036006", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/hep-ph/0101318v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-ph/0101318v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "31 pages, 7 figures", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "nucl-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-ph/0101318v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-ph/0101318v2", "journal_reference": "Phys.Rev. D64 (2001) 036006", "doi": "10.1103/PhysRevD.64.036006", "fulltext": "Mesons on a transverse lattice (Revised 08/01)\nSimon Dalley\n\narXiv:hep-ph/0101318v2 12 Sep 2001\n\nCentre for Mathematical Sciences, Cambridge University\nWilberforce Road, Cambridge CB3 0WA, England\n\nAbstract\nThe meson eigenstates of the light-cone Hamiltonian in a coarse transverse\nlattice gauge theory are investigated. Building upon previous work in pure\ngauge theory, the Hamiltonian and its Fock space are expanded in powers\nof dynamical fields. In the leading approximation, the couplings appearing\nin the Hamiltonian are renormalised by demanding restoration of space-time\nsymmetries broken by the cut-off. Additional requirements from chiral symmetry are discussed and difficulties in imposing them from first principles\nin the leading approximation are noted. A phenomenological calculation is\nthen performed, in which chiral symmetry in spontaneously broken form is\nmodelled by imposing the physical π-ρ mass splitting as a constraint. The\nlight-cone wavefunctions of the resulting Hamiltonian are used to compute\ndecay constants, form factors and quark momentum and spin distributions\nfor the pion and rho mesons. Extensions beyond leading order, and the implications for first principles calculations, are briefly discussed.\n\nTypeset using REVTEX\n1\n\n\fI. INTRODUCTION\n\nMany questions of a dynamical nature in QCD cannot easily be addressed in conventional\nlattice quantisation schemes [1,2]. Light-cone quantisation is a Hamiltonian framework suitable for highly-relativistic bound and scattering states [3,4], and would be ideal for extending\nthe kinds of problem that may be tackled. The corresponding light-cone wavefunctions are\nframe-invariant, contain no disconnected vacuum contributions, and matrix elements of suitable operators can be related to virtually any hadronic process. In this work, the light-cone\nHamiltonian for a version of lattice QCD with quarks is investigated. It builds upon previous\nwork of the author with B. van de Sande on the pure gauge theory [5–7], following an original idea of Bardeen et. al. [8,9]. The particular lattice gauge theory and its approximation\nconsidered here was first proposed in ref. [10].\nAll the transverse lattice treatments of non-abelian gauge theory cited above are formulated in terms of disordered link-fields M, which transform gauge covariantly but are\nnot themselves restricted to the gauge group. As such, they are expected to be well-suited\nto lattice spacings a that are coarse-enough (compared to ΛQCD ) for the use of disordered\nelementary degrees of freedom. The question then arises as to how to determine the effective\nHamiltonian. The expected level of coarseness probably rules out any reliable use of perturbation theory on the basis of asymptotic freedom. The Hamiltonian must be renormalised\nwith a non-perturbative technique. Pure QCD may be defined by gauge and Poincaré symmetries, together with an explicit connection to the asymptotically free continuum limit.\nIn transverse lattice gauge theory, one discretizes two (transverse) space directions on a\nlattice, say x = {x1 , x2 }, while maintaining lattice gauge invariance. In refs. [6,7] it was\nsuggested that, since the other space-time directions {x0 , x3 } remain continuous, tuning\nthe Hamiltonian to restore Poincaré symmetry at finite transverse lattice spacing would be\nenough to study spectral quantities in QCD. An approximation scheme for implementing this\nidea is the colour-dielectric expansion. For sufficiently massive fields M, low-lying hadronic\nlight-cone wavefunctions may converge rapidly in parton number, making expansion of the\nHamiltonian in powers of M viable. This method was tested and symmetry requirements\nalone produced a well-defined trajectory of couplings to leading order of the power expansion\nof the Hamiltonian. Glueball spectra on this trajectory scaled and agreed with results from\nother methods (the most accurate agreement has been found in 2 + 1-dimensional studies\n[11]).\nA similar method is pursued here in the light-meson sector, where a number of new features arise. In anticipation of a constituent structure appearing for boundstates when the\nultra-violet cut-off is lowered sufficiently, expansion of the Hamiltonian in powers of dynamical fields, both disordered links and quarks, will again be the basis of the approximation\nscheme. In this work, the expansion is also extended to the Hilbert space itself; an additional\nTamm-Dancoff cut-off will be put on the number of partons in a Fock space. The convergence\nof these approximations will not be studied here; rather, as a necessary first step, the lowest\norder of approximation will be solved in order to see if a reasonable phenomenology results\nat this level. The cut-off Hamiltonian will be renormalised non-perturbatively by searching\nthe space of couplings for a region where spacetime symmetries violated by the cut-off are\nbeing restored. Unlike in pure gauge theory, however, one must also confront approximate\nchiral symmetry (i.e. one must fix the quark mass). Practical problems when trying to\n2\n\n\fimpose both Poincaré and chiral symmetry in the leading approximation are noted, which\nmay require higher orders and/or renormalisation of operators other than the Hamiltonian\nto overcome. For this work, chiral symmetry in spontaneously broken form is therefore\nmodelled by demanding the π-ρ mass splitting as a phenomenological constraint. With\nthis caveat, a well-defined region in coupling space that enhances covariance of light-meson\nboundstates is found.\nUsing the bare expressions for currents (lowest order in an expansion in dynamical fields),\nthe light-cone eigenfunctions of the Hamiltonian renormalised and constrained in this way are\nused to compute decay constants, form factors and quark momentum and spin distributions\nof the pion and rho. These are compared with experimental results, where available, and\nother phenomenological and lattice results. The leading approximation is found to be a\nuseful quantitative starting point for the calculation of such observables. Issues in going\nbeyond the leading approximation and how this may allow one to use symmetry rigorously\nas a renormalisation method, are briefly discussed.\nII. TRANSVERSE LATTICE\nA. Overview\n\n√\n+\n0\n3\nLight-cone quantisation is a Hamiltonian\nmethod\nthat\ntreats\nx\n=\n(x\n+\nx\n)/\n2 as\n√\ncanonical time and {x− = (x0 − x3 )/ 2, x} as the spatial variables. Lorentz indices μ, ν\nare split into light-cone indices α, β ∈ {+, −} and transverse indices r, s ∈ {1, 2}. The\nmetric has non-zero entries g +− = −g 11 = −g 22 = 1. In transverse lattice gauge theory,\nlink variables Mr (x+ , x− , x) are associated with the link from x to x + ar̂ at fixed x+ and\nx− . They physically represent the (averaged) flux between these points. Continuum SU(N)\ngauge potentials Aα (x+ , x− , x) and fermions fields Ψ(x+ , x− , x) are associated to a transverse\nplane x = const.. A slice through spacetime at fixed x+ is illustrated in figure 1. The field\nvariables transform under transverse lattice gauge transformations V (x+ , x− , x) ∈ SU(N)\nassociated with the transverse planes as\nAα (x) → V (x)Aα (x)V † (x) + i (∂α V (x)) V † (x) ,\nMr (x) → V (x)Mr (x)V † (x + ar̂) ,\nΨ(x) → V (x)Ψ(x) .\n\n(2.1)\n\nThe most general transverse lattice Lagrangian L will consist of all operators invariant under\nlattice gauge symmetries (2.1), Poincaré symmetries manifestly preserved by the lattice cutoff, and renormalisable by dimensional counting with respect to the continuum co-ordinates\nxα . It is important to note that M need not be restricted to SU(N) [8]. It can be taken as\na general NxN complex matrix, provided it still gauge transforms covariantly.\nFor QCD, in the transverse continuum limit a → 0 one expects the couplings in L to run\nwith a such that M is forced into SU(N) [1]. Writing M = HU, where H is an hermitian\nmatrix, as the transverse continuum limit is approached, H should be expanded about a\nvacuum value H = H0 + H̃. The fluctuation H̃ should be made infinitely heavy by L as it\nruns to a = 0. Unfortunately, the light-cone quantisation of non-linear degrees of freedom U\nand vacuum modes H0 is very awkard. Even if one formulates the theory entirely in terms\n3\n\n\fof only unitary variables U from the beginning, the light-cone quantisation is still highly\nnon-trivial [12]. However, in the region of coupling space where H0 = 0, M behaves as a\nmassive linear degree of freedom and light-cone quantisation is straightforward. The colourdielectric hypothesis suggests that the renormalised trajectory [13], on which sufficiently\nlong-distance observables take the same values as in the continuum limit, passes into this\nregion at sufficiently large a [5,14]. Since weak-coupling perturbation theory is unlikely to be\nreliable for the construction of this trajectory at large a, it was suggested to use symmetry\nto reconstruct it [7,11]. In the case of a transverse lattice regulator, it is plausible that with\nthe most general cut-off L, gauge and Poincaré symmetry are sufficient to identify a unique\ntrajectory associated to QCD. Whether or not this is correct, it nevertheless motivates an\napproximate treatment of this idea.\nIn reality, one must truncate the number of operators appearing in the most general\nL and also introduce further cut-offs on the Hilbert space, beyond the transverse lattice\ncut-off a. The subset of symmetry criteria one chooses are now obviously influenced by the\napproximations made. The truncation of L, in the presence of only the cut-off a, will be based\nupon the relative importance of different field configurations expected in low-lying hadronic\nboundstates. This substitutes for the fact that one cannot make use of dimensional counting\nwith respect to transverse co-ordinates x, since a is not assumed to be small. It then makes\nsense to test symmetries only in the lowest-energy observables. Eventually, this procedure\nshould be repeated, adding more operators to L and testing symmetries at ever higher\nenergies. It is possible that the approximation scheme employed, although systematic and\nphysically motivated, is poor. That is, it restricts one to couplings to operators that poorly\napproximate a renormalised trajectory. This can only be decided by explicitly checking\nfor restoration of symmetries violated by the cut-off. The approximations will be further\nmodified by the presence of additional cut-offs on the Hilbert space. The simplest nontrivial approximation to the QCD Lagrangian and Hilbert space is used as the basis for\nan explicit computation in this paper. Issues in going beyond this approximation are also\nbriefly discussed.\nIn the rest of this section, approximation of the Hamiltonian (II.B), Hilbert space (II.C),\nand chiral symmetry issues (II.D) are addressed. The calculation within the leading approximation is detailed in section III, first with the introduction of explicit symmetry criteria\n(III.A), then applications to phenomenology (III.B & C).\nB. Approximating the Hamiltonian\n\nStarting from the most general transverse lattice Lagrangian L, we wish to arrive at a\nsystematically improvable approximation to the light-cone Hamiltonian P − . First, recall the\n(continuum) proper Poincaré generators in light-cone co-ordinates [15] for a set of singlecomponent fields labelled generically φl . At a particular light-cone time x+ ,\nν\n\nP =\nM μν =\n\nZ\n\nZ\n\ndx− d2 x T +ν\n\n(2.2)\n\n\u0010\n\ndx− d2 x xμ T +ν − xν T +μ + πl Σμν\nlm φm\n\nwhere T is the energy-momentum\n4\n\n\u0011\n\n,\n\n(2.3)\n\n\fT +μ = πl ∂ μ φl − g +μ L ,\n\n(2.4)\n\nπl are the canonical momenta\nπl =\n\nδL\n,\nδ(∂+ φl )\n\n(2.5)\n\nand the spin part for spinor or vector fields respectively is\n1 μ ν\nΣμν\nlm = [γ , γ ]lm\n4\n\nν\nμ ν\nor glμ gm\n− gm\ngl .\n\n(2.6)\n\nThe mass shell condition is\n2P + P − = M2 + (P 1 )2 + (P 2 )2 .\n\n(2.7)\n\nThere are also the discrete symmetries {P : x− ↔ x+ , x → −x} and {T : x− ↔ −x+ },\nrelated to improper Lorentz transformations. For the moment, no chiral symmetry is assumed.\nThe (classical) space-time symmetries will be classified into violated or preserved, and\nkinematic or dynamic, in the presence of the transverse lattice cut-off a. The most general\nLagrangian may only contain lattice gauge-invariant operators invariant under preserved\nPoincaré symmetries. In the continuum, the subset {P r , P + , M +r , M 12 , M −+ } can usually\nbe chosen kinematic. That is, they can be chosen - at a particular x+ and in a particular\ngauge perhaps - to be independent of interactions, quadratic in independent dynamical\nfields. As many generators as possible will be maintained in kinematic form, consistent with\nlattice gauge invariance. The imposition of a lattice cut-off on transverse directions means\nthat the continuous symmetries associated to {P r , M 12 , M +r } are violated (although there\nis a discrete subset of finite symmetry transformations that are preserved). Demanding\nthat the generators {P + , M −+ } of preserved symmetries can be chosen kinematic, they can\neasily be used to define states of non-zero longitudinal momentum. Although the symmetry\ngenerated by M +r is in general violated, at a particular time x+ = 0 it is recovered and\nkinematic, and will be used to define transversely boosted states at this time. Of the\nremaining dynamic generators {P − , M −r }, the symmetry generated by the Hamiltonian P −\nis preserved, while that generated by the boost-rotations M −r is violated. Parity P and\ntime reversal T are dynamic and preserved, though P T , hence charge congugation C (or\nG-parity), is kinematic.\nDemanding a kinematic P + restricts the possible kinetic term for L to\nLkin =\n\nXZ\nx\n\ndx−\n\nX\n\nX\n\nα,β=+,− r=1,2\n\n−\n\nn\no\n1\nαβ\nα\nTr\nF\nF\nαβ + iΨγ (∂α + iAα )Ψ\n2G2\n\n+ Tr{[(∂α + iAα (x)) Mr (x) − iMr (x)Aα (x + ar̂)][h.c.]}\nin which h.c. is hermitian conjugate and light-cone gauge A− = 0 is chosen. This partial\ngauge fixing will render A+ non-dynamical, independent of x+ according to equations of\nmotion; half the components of the fermion spinor, Ψ− = γ 0 γ − Ψ, will also be non-dynamical\n(see below).\nThe potential term for L will be expanded in powers of the dynamical fields M, Ψ+ =\n0 +\nγ γ Ψ (after elimination of non-dynamical fields A± and Ψ− ). Such a power expansion\n5\n\n\fcan only be justified in a region of coupling space where these fields are sufficiently heavy\nthat light-cone wavefunctions of interest converge quickly in parton number. For sufficiently\nheavy fields, the lowest-mass lattice hadrons will consist of a few partons M and Ψ+ with\nlittle mixing into configurations with many partons. The physical motivation for expecting\na renormalised trajectory to exist in the region of link-fields M with positive mass squared\nis the the colour-dielectric picture of confinement [8,14]. The dynamical generation of a\nconstituent quark mass in QCD makes this scenario physically plausible for quarks also. In\nboth cases, the ultra-violet cut-off on the renormalised trajectory must be lowered sufficently\nfor these constituent approximations to be viable. Dimensional counting in the continuous\ndirections (x+ , x− ), together with the power expansion in dynamical fields, limits the number\nof allowed operators to some extent. However, locality in x− cannot be assumed. Elimination\nof non-dynamical degrees of freedom will inevitably introduce non-local terms. This could,\nin principle, lead to x− -dependent couplings [4]. Demanding that P − is derived from a\ngauge-invariant Lagrangian L and that P + be kinematic appears to eliminate this possibility\nhowever, at least at level of the lattice cut-off theory.\nThe simplest approximation to the Lagrangian in QCD is then\nL=\n\nXZ\n\ndx−\n\nX\n\nX\n\nα,β=+,− r=1,2\n\nx\n\n−\n\nn\no\n1\nαβ\nTr\nF\nF\nαβ\n2G2\n\n+ Tr{[(∂α + iAα (x)) Mr (x) − iMr (x)Aα (x + ar̂)][h.c.]}\nn\n\no\n\n−μ2b Tr Mr Mr† + iΨγ α (∂α + iAα )Ψ − μf ΨΨ\n\u0010\n\n+iκa Ψ(x)γ r Mr (x)Ψ(x + ar̂) − Ψ(x)γ r Mr† (x − ar̂)Ψ(x − ar̂)\n\u0010\n\n+κs Ψ(x)Mr (x)Ψ(x + ar̂) + Ψ(x)Mr† (x − ar̂)Ψ(x − ar̂)\n\n\u0011\n\n\u0011\n\n(2.8)\n\nwhere G, μf , μb, κa , κs are coupling constants and the A− = 0 gauge is taken. This will\nbe the starting point for explicit calculations in this paper. Detailed investigation of the\ncorrections to this L, involving higher powers of fields, is left to future work.\n∗\n∗\nIn the chiral representation (Appendix A-2 of ref. [16]), Ψ† = (u∗+ , v+\n, v−\n, u∗− )/21/4 decomposes into left (right) movers v (u) with a helicity subscript h = ±. In light-cone gauge\nA− = 0, A+ and v± satisfy constraint equations of motion which are used to eliminate them\nat the classical level. Defining\n\u0011\nκs X \u0010\nFh (x) = −uh (x) +\nMr (x)uh (x + ar̂) + Mr† (x − ar̂)uh (x − ar̂)\nμf r\nn\nhiκa\nM1 (x)u−h (x + a1̂) − hiM2 (x))u−h (x + a2̂)\n+\nμf\n−M1† (x − a1̂)u−h (x − a1̂) + hiM2† (x − a2̂)u−h (x − a2̂)\n\nJ + (x) = i\n\nX\u0012\nr\n\n+\n\nX\n\n↔\n\n↔\n\nMr (x) ∂ − Mr† (x) + Mr† (x − ar̂) ∂ − Mr (x − ar̂)\n\nuh (x)u†h (x) ,\n\n\u0013\n\no\n\n(2.9)\n\n(2.10)\n\nh\n\nthe constraints are\n(∂− )2 A+ =\n\n\u0012\n\n1\nG2\nJ + − Tr J +\n2\nN\n6\n\n\u0013\n\n(2.11)\n\n\fμf\ni∂− vh = √ F−h .\n2\n\n(2.12)\n\nIntroducing gauge indices {i, j ∈ {1, 2, * * * N}}, the canonical momenta are πi (uh ) = iu∗h,i ,\n∗\nπij (Mr ) = ∂− Mr,ij\n. Hence, the generators of preserved symmetries at x+ = 0 are\nP\n\n−\n\n=\n\nZ\n\n+\nP\nM\n\n+\n\n−+\n\nM\n\n+r\n\n=\n=\n\nZ\n\nZ\n\n=−\n\n−\n\ndx\n\nX\nx\n\nμ2f\n\nX\n\n2\n\nh\n\ndx−\n\n(\n\nFh†\n\nX\n\ndx\nZ\n\nX\n\n+\n\n!\n\n!\n\n2\nn\no\nX\n1\nTr Mr Mr† ,\nFh + μ2b\ni∂−\nr=1\n\nn\n\no\n\n(2.13)\n\n2 Tr ∂− Ms (x)∂− Ms (x)† + iu∗h ∂− uh ,\n\nx,s,h\n−\n\n)\n\nn o\n1 n +o 1\n1\n+\nTr J\n−\nJ\nTr\nJ\nTr\nJ+\n2\n2\n(i∂− )\nN\n(i∂− )\n\nG2\n4\n\n−\n\nx\n\nx,s,h\n\n\u001a\n\nn\n\n2 Tr ∂− Ms (x)∂− Ms (x)\n\n\u0012\n\n\u0013\n\n†\n\no\n\n↔\ni\n+ u∗h ∂ − uh\n2\n\n(2.14)\n\u001b\n\n,\n\no\nn\na\ndx\n2 x + δ rs Tr ∂− Ms (x)∂− Ms (x)† + ixr u∗h ∂− uh .\n2\nx,s,h\n−\n\nX\n\nr\n\n(2.15)\n(2.16)\n\nThe Hamiltonian (2.13) contains cubic and quartic interactions in dynamical fields. At quartic order there would be further terms, in addition to those in (2.13), generated from quartic\nterms allowed in the Lagrangian, that have been neglected in (2.8). The lowest order of\nthe power expansion would retain only the cubic interactions in P − , but this approximation\nwould not produce confinement. One is free to include some or all of the possible terms\nat quartic order in P − . As a minimal prescription, only the quartic terms arising from the\nJ + J + interaction will be retained, as they are be responsible for confinement [8]. The effect\nof other quartic terms is left for future investigation; in particular, it is likely that they will\nbe important for parity and chiral symmetry restoration, as discussed later.\nC. Cut-offs in Fock space\n\nIn the quantum theory, there are (anti-)commutation relations at fixed x+\nh\n\ni\ni\n∗\nMr,ij (x− , x), ∂− Ms,kl\n(y − , y) = δik δjl δ(x− − y − ) δxy δrs ,\n2\nn\no\n−\n∗\n−\nuh,i (x , x), iuh′,j (y , y) = iδij δ(x− − y − ) δxy δhh′ .\n\n(2.17)\n(2.18)\n\nA convenient Fock space representation employs longitudinal momentum space but transverse position space\nZ\n\n\u0011\n∞ dk + \u0010\n1\n+ −\n+ −\n√\na−r (k + , x) e−ik x + a†r (k + , x) eik x , (2.19)\nMr (x = 0, x , x) = √\n4π 0\nk+\nh\ni\naλ,ij (k + , x), a∗ρ,kl (k̃ + , y = δik δjl δλρ δxy δ(k + − k̃ + ) ,\n(2.20)\n+\n\nh\n\n−\n\ni\n\naλ,ij (k + , x), aρ,kl (k̃ + , y) = 0 .\n\n(2.21)\n\n7\n\n\fZ\n\n\u0011\n\u0010\n∞\n1\n+ −\n+ −\nuh (x+ = 0, x− , x) = √\ndk + bh (k + , x) e−ik x + d∗−h (k + , x) eik x ,\n2π 0\nn\no\n+\n∗\n+\nbh,i (k , x), bh′ ,j (k̃ , y = δij δhh′ δxy δ(k + − k̃ + ) ,\n\nn\n\no\n\nbh,i (k + , x), bh′ ,j (k̃ + , y) = 0 .\n\n(2.22)\n(2.23)\n(2.24)\n\nHere, λ and ρ ∈ {±1, ±2}, a∗λ,ij = a†λ,ji , and similar anti-commutators exist for d. The Fock\nspace operator a†r,ij (k + , x) creates a link-parton with longitudinal momentum k + , carrying\ncolour i at x to j at x + abr. b∗h,i (k + , x) creates a quark of helicity h, colour i, momentum\nk + at site x, while d∗ does the same for anti-quarks. This Fock space is already diagonal in\nP + and serves as a basis for finding the eigenvalues of P − .\nThe 1/∂− non-local terms in P − (2.13) cause divergences at small k + . However, the\nwell-known elimination of such divergences by a suitable normal-ordering prescription in\n1 + 1-dimensional gauge and Yukawa theories [17] carries over to the transverse lattice\nHamiltonian at finite a. While the currents J + and F are normal-ordered, the Hamiltonian\nP − itself is not. This generates infinite self-inertias for the M and Ψ+ partons, which are\nrequired for finiteness of the eigenvalues of P − . Moreover, as can be seen from (2.13), the\nfinite-energy physical states |ψi satisfy\nZ\n\n−\n\n+\n\ndx J |ψi =\n\nZ\n\n−\n\ndx F± |ψi =\n\nZ\n\ndx− F±† |ψi = 0 .\n\n(2.25)\n\nThe J + condition singles out Fock states invariant under residual x− -independent gauge\ntransformations V (x) in the light-cone gauge [8]. For these singlet configurations, there is\nlinear confinement of heavy sources for generic coupling choices in the region of sufficiently\nlarge μ2b [18]. The F conditions will relate Fock space wavefunction components at small k +\nmomentum with different numbers of partons, and are the source of rising (Regge) behaviour\nof structure functions at small Bjorken x [19].\nIn order to render the Fock space finite-dimensional, suitable for study on a computer, it\nis necessary to impose further cut-offs. DLCQ [17,20] will be used to discretize longitudinal\nmomentum, by compactifying x− on circle of circumference L = 2πK/P +, where K is a\npositive integer, with (anti)-periodic boundary conditions for M (u). All k + = 0 modes\nwill be dropped, whether or not the boundary conditions allow it .1 The DLCQ cut-off is\napplied directly to the Poincaré generators and results extrapolated to K = ∞. However,\nsince the zero modes are not picked up explicitly by the K → ∞ extrapolation, further finite\nrenormalisation due to their absence is expected. General arguments about the kinds of finite\nrenormalisation expected upon omission of zero modes in light-cone QCD have been given in\nref. [4]. Previously preserved dynamical symmetries could in general be violated by DLCQ\nwithout zero modes, even in the limit K → ∞. In particular, parity invariance is violated\nby zero mode omission and some work has been done on the corresponding renormalisation\nrequired in the context of simpler field theories [21]. This is one place where quark 'kinetic'\nmass terms can persist, even in a chiral theory, leading to a viable constituent approximation.\nThe quartic terms neglected in P − (2.13) are needed to address parity restoration in general.\n\n1 This\n\njustifies post hoc the fact that boundary terms were not discussed earlier.\n\n8\n\n\fThere are also zero modes associated to the transverse and longitudinal gauge fields. To\njustify the power expansion, the link-field mass μ2b was taken sufficently large. This ensures\nthat the k + = 0 mode of the (radial part of the) transverse fields M is pushed to infinite\nenergy, so one may indeed expand about M = 0 (2.19). On the other hand, the omission of\nzero modes of Aα could lead to additional finite renormalisations for zero momentum transfer\n2\n4-parton interactions induced by the instantaneous gluon exchange kernel 1/∂−\n. While the\n+\nzero mode of A+ can be gauged away at a particular x , the zero mode of A− cannot be\ngauge fixed to zero in the presence of periodic x− boundary conditions [22]. There has been\nsome study of the effects of explicitly retaining such a mode in simpler field theories [23],\nwhich indicate that there may be a small effect in the instantaneous gluon exchange between\nM and Ψ+ . Parity symmetry again would be the obvious place to look for fixing these zeromode induced effects. No attempt to incorporate further zero-mode induced operators into\nP − will be made here.\nAlthough DLCQ at fixed K and without zero modes automatically cuts off the maximum\nnumber of partons in Fock space, it will be convenient to impose a separate Tamm-Dancoff\ncut-off on this number. Ideally, this cut-off would be extrapolated, along with the DLCQ\none, as has been done in transverse lattice studies of pure gauge theory [7]. In the present\nwork, the Tamm-Dancoff cut-off will be fixed at the smallest non-trivial value throughout\nthe calculation for simplicity. In the 'one-link' truncation of Fock space, a general P = 0\nnormalised state can be expressed in terms of orthonormal Fock states as\n|ψ(P + )i = √\n\n1 X 2X\na\nVol x\nh,h′\nn\n\nZ\n\n1\n\n0\n\ndx1 dx2 δ(x1 + x2 − 1)\n\n× ψhh′ (x1 , x2 )N −1/2 b†h (x1 , x)d∗h′ (x2 , x)|0i\n+√\nn\n\n1 X 2 X\na\nVol x\nh,h′ ,r\n\nZ\n\n0\n\n1\n\no\n\ndx1 dx2 dx3 δ(x1 + x2 + x3 − 1)\n\n× ψh(r)h′ (x1 , x2 , x3 )N −1 b†h (x1 , x)a†r (x2 , x)d∗h′ (x3 , x + ar̂)|0i\n\n+ψh(−r)h′ (x1 , x2 , x3 )N −1 b†h (x1 , x + ar̂)a†−r (x2 , x)d∗h′ (x3 , x)|0i\n\n(2.26)\n\no\n\n,\n\n(2.27)\n\nwhere Vol is the volume of transverse space; see figure 1. The M−+ boost-invariant momentum fractions x1 = k1+ /P + etc. have been introduced, which should not be confused\nwith transverse co-ordinates. DLCQ amounts to discretizing such fractions into integer or\nodd half-integer units of 1/K. The wavefunction |ψ(P + )i automatically satisfies the k +\nmomentum and helicity sum rules, even at finite K.\nStates of non-zero P are straightforwardly generated by application of M−r\nψhh′ (x1 , x2 ) → exp [iP.x] ψhh′ (x1 , x2 ) ,\nψh(r)h′ (x1 , x2 , x3 ) → exp [iP.(x1 x + x2 (x + 0.5ar̂) + x3 (x + ar̂))] ψh(r)h′ (x1 , x2 , x3 ) (2.28)\nψh(−r)h′ (x1 , x2 , x3 ) → exp [iP.(x1 (x + ar̂) + x2 (x + 0.5ar̂) + x3 (x))] ψh(−r)h′ (x1 , x2 , x3 ) .\nA fixed Tamm-Dancoff approximation will obviously lead to Fock-sector-dependent renormalisations; in the present case this means that μf is sector-dependent. The analysis of later\nsections was performed both with and without the assumption of sector dependence. The\nmain conclusions are qualitatively similar, but only results with a sector-independent mass\n9\n\n\fμf are shown, since it was possible to sweep the coupling space with greater resolution in\nthis case.\nIn the Fock space (2.27), the x− global colour-singlet states have already been picked out\nby applying the J + constraint (2.25), since it simplifies the DLCQ Fock space. (Application\nof the F condition does not simplify the DLCQ Fock space particularly, so is not imposed\nfrom the beginning; the constraint will be satisfied dynamically when P − is diagonalised).\nIn the one-link truncation, a quark and antiquark either share the same transverse lattice\nsite, or are separated by one link. It is the simplest approximation that still allows a meson\nto propagate on the transverse lattice. A correct description of the flavour-singlet sector\nwould require inclusion of quark-anti-quark annihilation processes, which are forbidden in\nthe one-link approximation. Therefore, the space (2.27) will be interpreted as appropriate\nto the flavour-non-singlet mesons, by identifying the quark and anti-quark with (degenerate)\nup and down flavours respectively. No flavour label is necessary in this case, and flavour is\nassumed to have been summed over in operators.\nProjecting 2P + P − |ψ(P = 0)i onto Fock basis states, one derives the following set of\ncoupled integral equations for individual Fock components:\n!\n\nm2f\nm2f\n′\n+\n2 ψhh (x1 , x2 ) =\nx1\nx2\nG\n2\n(k + ks2 )\n+ a\nπ\n(\nX mf ks\n√\n−\n2\nπ\nλ\n\nM2\n\nZ\n\nψhh′ (x1 , x2 ) + K(ψhh′ (x1 , x2 ))\n1\nx1\n\nZ\n\n0\n\nZ\n\nx1\n\nZ\n\n!\n\n1 x2 dy\ndy\nψhh′ (x1 , x2 )\n+\ny\nx2 0 y\n0\n!\n1\n1\ndy\nψh(λ)h′ (x1 − y, y, x2)\n+\n√\ny x1 − y x1\nx1\n\n(2.29)\n\n!\n\n1\n1\nmf ks x2 dy\nψh(λ)h′ (x1 , y, x2 − y)\n+\n+ √\n√\n2 π 0\ny x2 − y x2\n!\nSgn(λ)mf ka (hiδ|λ|1 + δ|λ|2 ) Z x1 dy\n1\n1\n√\n+\nψ−h(λ)h′ (x1 − y, y, x2)\n−\n√\n2 π\ny x1 − y x1\n0\n)\n!\nSgn(λ)mf ka (h′ iδ|λ|1 + δ|λ|2 ) Z x2 dy\n1\n1\n√\n−\nψh(λ)−h′ (x1 , y, x2 − y) ,\n−\n√\n2 π\ny x2 − y x2\n0\n!\n\nm2f\nm2f\nm2b\n′\nψh(λ)h′ (x1 , x2 , x3 ) + K(ψh(λ)h′ (x1 , x2 , x3 ))\n(x\n,\nx\n,\nx\n)\n=\nψ\n+\n+\n1\n2\n3\n2 h(λ)h\nx2\nx1\nx3\nG\n\u0012\n\u0013\nmf ks\n1\n1\n− √\n+\nψhh′ (x1 + x2 , x3 )\n2 πx2 x1 x1 + x2\n\u0012\n\u0013\nmf ks\n1\n1\n− √\n(2.30)\n+\nψhh′ (x1 , x2 + x3 )\n2 πx2 x3 x2 + x3\n\u0012\n\u0013\n(hiδ|λ|1 + δ|λ|2 )mf ka 1\n1\n−Sgn(λ)\nψ−hh′ (x1 + x2 , x3 )\n−\n√\n2 πx2\nx1 x1 + x2\n\u0012\n\u0013\n(h′ iδ|λ|1 + δ|λ|2 )mf ka 1\n1\nψh−h′ (x1 , x2 + x3 ) .\n−\n+Sgn(λ)\n√\n2 πx2\nx3 x2 + x3\n\nM2\n\nThe conventions of ref. [24] have been adopted for the instantaneous gluon kernels\n10\n\n\f1\nK(ψhh′ (x1 , x2 )) =\n2π\n\nK(ψh(λ)h′ (x1 , x2 , x3 )) =\n\n1\n2π\n\nZ\n\nZ\n\n1\n0\n\nx2 +x3\n\n0\n\n(\n\nψhh′ (x1 , x2 ) − ψhh′ (y, 1 − y)\ndy\n(y − x1 )2\ndy\n\n(x3 + 2x2 − y)\nq\n\n2(x3 − y)2 x2 (x2 + x3 − y)\n\n−ψh(λ)h′ (x1 , x2 + x3 − y, y)\n!\n\ns\n\no\n\n)\n\n,\n\n(2.31)\n\nn\n\nψh(λ)h′ (x1 , x2 , x3 )\n\nx3\n1\n− 1 ψh(λ)h′ (x1 , x2 , x3 )\n1+\n+\n2πx3\nx2\nZ\nn\n1 x1 +x2\n(x1 + 2x2 − y)\nq\n+\nψh(λ)h′ (x1 , x2 , x3 )\ndy\n2π 0\n2(x1 − y)2 x2 (x1 + x2 − y)\n−ψh(λ)h′ (y, x1 + x2 − y, x3)\n\n1\n+\n2πx1\n\n!\n\ns\n\no\n\nx1\n− 1 ψh(λ)h′ (x1 , x2 , x3 ) .\n1+\nx2\n\n(2.32)\n\nq\n\nḠ = G (N 2 − 1)/N, which has the dimensions of mass, and the following renormalisations\nhave been introduced:\n√\n√\nμf\nκa N\nκs N\nμb\n→ mb ;\n→ mf ;\n→ ka ;\n→ ks .\n(2.33)\nḠ\nḠ\nḠ\nḠ\nThe dimensionless variables {mb , mf , mf ks , mf ka } appearing in the Hamiltonian equations\n(2.29)(2.30) are to be understood as the renormalised couplings after imposing DLCQ and\nTamm-Dancoff cut-offs on the Fock space. All N-dependence of the theory has now been\nabsorbed into the couplings.\nD. Chiral symmetry\n\nChiral symmetries are subtle both on a lattice and in light-cone quantisation. Consider\nfirst the effects of the lattice cut-off. The lattice Lagrangian (2.8) explicitly breaks the chiral\nsymmetry\nΨ → e−iθγ5 Ψ ,\n\n(2.34)\n\nthrough the bare mass-term μf and Wilson term κs . The latter is needed to eliminate\nfermion doublers in the free-fermion dispersion.\nWhen chiral symmetry is not explicitly broken at the Lagrangian level (a chiral theory),\nspontaneous breaking would be signalled by vacuum degrees of freedom in a conventional\nquantisation scheme. The light-cone problem with small k + regulated does not have such\nexplicit degrees of freedom in the light-cone vacuum. There are two, somewhat related,\nmechanisms one could envisage for the manifestation of spontaneously broken chiral symmetry in this case. Zero modes, being vacuum degrees of freedom, may carry information\nabout the spontaneous breaking of chiral symmetry, and their omission may require one to\nadd counter-terms to P − that explicitly break chiral symmetry, even if it is only broken\n11\n\n\fspontaneously in the conventional sense [4]. Spontaneous breaking may occur in a more-orless conventional way through wee partons that enhance contributions from operators that\nbreak chiral symmetry in the limit that their couplings are sent to zero [25]. An explicit illustration of the latter effect was given in ref. [26]. Note that, once a Tamm-Dancoff cut-off is\nintroduced, the effects of both these mechanisms on the Hamiltonian would be similar. The\nwee partons are excluded by this cut-off, so the net result of the second mechanism would be\nto introduce finite couplings to chiral-symmetry breaking counterterms in the cut-off theory.\nAt the Lagrangian level, the chiral limit is μf → 0 and κs → 0. However, the renormalised parameters {m2f , mf ks , mf ka } need not be zero in the chiral limit. To address chiral\nsymmetry at this level, one can introduce the light-cone chiral transformation [4]\nΨ+ → e−iθγ5 Ψ+ ,\n\n(2.35)\n\n√\nwhere Ψ = (Ψ+ + Ψ− )/ 2 has been defined earlier, and Ψ− is determined through the\nconstraint equation (2.12). This is equivalent to the usual chiral transformation on Ψ (2.34)\nonly in a chiral theory. Omitting zero modes, the light-cone chiral charge that generates\n(2.35) measures helicity\nQ5 =\n=\n\nZ\n\nZ\n\ndx−\n\nX\n\nΨγ + γ5 Ψ\n\nx\n\n−\n\ndx\n\nXX\nx\n\nhu∗h uh .\n\n(2.36)\n\nh\n\nIt is equivalent to the usual chiral charge only in a chiral theory without spontaneous breaking, the difference presumably lying in contributions at x− infinity. In a chiral theory with\nspontaneous breaking of the symmetry and no explicit small k + degrees of freedom to reflect this, one therefore expects helicity-violating operators in the renormalised Hamiltonian.\nIn the Hamiltonian equations (2.29)(2.30), only the operator coupling to mf ka breaks the\nhelicity symmetry (2.35).\nConservation of the renormalised axial current Aμ defines a chiral theory. One may use\nPCAC to impose chiral symmetry on the theory, through the matrix element\nh0|∂μ Aμ |ψπ (P μ )i = fπ M2π .\n\n(2.37)\n\nWithout knowing the precise expression for Aμ in terms of bare fields, chiral symmetry can\nbe imposed by setting either fπ = 0 or Mπ = 0. To test for a phase of gauge theory with\nspontaneously broken chiral symmetry, one would then search the space of couplings for a\nregion where Poincaré symmetry is restored, Mπ = 0, and there is no instability. In the\nleading approximation considered in this paper, mf ka couples to the only hopping term that\npropagates the π and ρ at different rates on the transverse lattice. In the absence of any\nother hopping term that distinguishes the pion and rho, Poincaré symmetries would require\nthis coupling to be as small as possible, i.e. as small as stability of the theory allows. mf ka\nis also the only source of mass difference between the pion and rho. Unfortunately, stability\nis difficult to check from first principles in the one-link approximation. Any instability in\nthe quantum field theory would almost certainly be signalled by copious parton production,\nwhich is forbidden in the one-link approximation.\n\n12\n\n\fBecause of the difficulty in checking for instability in the approximation made in this\npaper, a phenomenological constraint will be introduced that is intended to model the effects of spontaneously broken chiral symmetry in the one link approximation. First, the\nexperimental string tension σ will be used to set the QCD scale. This quantity was calculated in terms of lattice quantities in ref. [7].2 Then both the π and ρ masses will be fit\nto the experimental values. This involves three fits to experimental numbers, when QCD\nitself has only two parameters (e.g. the quark mass and ΛQCD ). Thus there is a single\nphenomenological constraint. The use of π and ρ masses is intended to model the fact that\n(a) a nearly chiral theory in the Goldstone mode should have a light pion and (b) helicity\nviolation, that splits the π and ρ masses, should be present in P − when chiral symmetry\nis broken only spontaneously. The remaining freedom in the couplings present in P − will\nbe fixed by optimizing meson dispersion. This, together with the use of a more accurate\ncalculation of σ, represents the main advance over the purely phenomenological modelling\nof this lattice gauge theory performed in ref. [10].\nIII. MODEL CALCULATIONS\nA. Symmetry Tests\n\nThe one-link approximation is too simple to allow much change in a meson's size in lattice\nunits, while retaining its physical size and covariant dispersion. Therefore, the spacing a\nwill be fixed at the largest\nvalue that gave reasonable results\nin ref. [7], by setting mb = 0.2.\n√\n√\nIn this case Ḡ ≈ 3.11 σ and aḠ ≈ 4.57. If one takes σ = 440 MeV, then Ḡ = 1368 MeV\nand a ≈ (300MeV)−1 ≡ 2/3 fm. This is obviously the maximum quark separation in the\none-link approximation.\nSince the Hamiltonian (2.13) is transversely local, it makes sense to expand eigenvalues\nthus\n2P + P − = G\n\n2\n\n\u0010\n\n\u0011\n\nM20 + M21 a2 P2 + O(a4 P4 ) .\n\n(3.1)\n\nA necessary condition for Poincaré invariance is isotropy of the dispersion, i.e. the speed of\nlight c in transverse directions should satisfy\n2\n\na2 G M21 ≡ c2 = 1 .\n\n(3.2)\n\nIt makes no sense to try to tune the anharmonic terms in (3.1) separately, since only nearest\nneighbour hopping is available in the current approximation.\nThe transverse lattice has symmetry group D4 [9], with one-dimensional representations\nand a single two-dimensional irreducible representation. Since there is 90o rotational symmetry about x3 , it is possible to distinguish the angular momentum projections J3 mod 4.\n\n2 These\n\ncalculations involved no modelling, using Poincaré symmetry and the power expansion\nalone. The large-N limit was also taken. However, the present√calculation is independent of N in\nthe one-link approximation up to a trivial redefinition of G. G N in ref. [7] is identified with Ḡ.\n\n13\n\n\fThe one-dimensional representations corresponds to J3 = 0 or symmetric and antisymmetric\ncombinations of J3 = ±2. The two-dimensional contains J3 = ±1. Generically, the pion is\nsplit from the rho, while the J3 = 0 component of the rho (ρ0 ) is split from its degenerate\nJ3 = ±1 components (ρ± ). However, all these states become degenerate in the absence of\nquark helcity violating interactions. The zero-link sector serves to distinguish the various\nmeson components, since they do not mix when P = 0 as a result of D4 symmetry.\nπ : ψ+− = −ψ−+ ; ψ±± = 0 .\nρ0 : ψ+− = ψ−+ ; ψ±± = 0 .\nρ± : ψ±± 6= 0 ; ψ+− = ψ−+ = 0 .\n\n(3.3)\n(3.4)\n\nThe three-dimensional space of dimensionless couplings {mf , ka , ks } was sampled discretely and the eigenvalue problem for 2P + P − solved for various P. A χ2 -test was introduced for the conditions (3.2) on the π and ρ dispersion and for the conditions that their\nmasses assume the physical values, Mπ = 140 MeV and Mρ = 770 MeV;\nχ2 = w1 |\n\nX\nMπ\nMρ\n− 0.56 | +\n|c − 1| .\n− 0.18 | +w2 |\nMρ\nG\nπ,ρ± ,ρ0\n\n(3.5)\n\nMasses are defined as GM0 from (3.1), where Mρ is taken to be the average of the ρ0 and\nρ± masses. The weights w1 and w2 were adjusted to allow tolerance of about 100 MeV\nin satisfying the mass conditions. The following results used w1 = w2 = 10. Calculations\nwere performed for DLCQ cut-offs K = 6, 7, 8, 9, with the corresponding bases of dimension\n264, 364, 480, 612. The size of Fock space is quite modest and there is ample room for larger\nand more efficient calculations to be performed.\nFigure 2 shows the results of the χ2 test. A clear minimum appears for every coupling\nat every K. While the details will change slightly with the specific test used, the broad\nfeatures remain the same. To indicate what can be achieved at the minima of the χ2 shown\nin fig. 2, at K = 9 for example, the observables are shown in Table 1. For later calculations,\nit is convenient to fit the mid-point of the χ2 valley at each K to a smooth form A + B/K,\n0.969\n,\nK\n8.34\n,\nka = 0.162(927) +\nK\n8.29\nks = −0.323(921) +\n.\nK\n\nmf = 0.362(108) −\n\n(3.6)\n\nThis will represent the best estimate of the symmetry-restoring trajectory at each K, for\nthe range K = 6 → 9. When fitting to polynomials in 1/K, the magnitude of the last term\nin the series will be taken as an estimate of the error on the K → ∞ result (the zeroth order\nterm of the polynomial). Obviously, the fit to the couplings (3.6) does not produce a very\nuseful estimate of the their K → ∞ limit. However, the forms (3.6) are only used in the\nrange K = 6 → 9 to recompute observables at those values, with a view to extrapolation of\nthe observables themselves, whose convergence is typically faster than that of the couplings.\nThe observables were also fit to linear or quadratic polynomials in 1/K. A series in 1/K\nis the correct form for the errors introduced by DLCQ discretization of the integral equations\n14\n\n\f(2.29)(2.30), if the integrands are analytic and the couplings are polynomial in 1/K. The\nintegrands are in general not analytic, which will also produce non-integral powers of 1/K\nin the finite-K errors. However, the values of K used here are too few and too small to\nwarrant this level of complication in fitting functions. 3\nThe light-cone eigenfunctions were recomputed along the smooth trajectory (3.6) and\nused to derive a number of observables for the π and ρ. The observables are usually quoted\nat some transverse scale, which in the case of the tranvserse lattice is provided by Q =\nπ/a ∼ 1 GeV, the normalisation scale at which the non-perturbative wavefunctions have\nbeen determined. Observables will in general evolve with this scale, but a has been fixed for\nthe present calculation. The relationship between this scale and those introduced in other\nquantisation schemes (MS etc.) is non-trivial and will not be addressed here. For estimates,\nQ will be identified with the momentum transfer from the probe where appropriate.\nB. Distribution amplitudes\n\nDistribution amplitudes for the π and ρ are defined (with covariant normalisation) by\nh0|Ψ(z)γ μ γ5 Ψ(0)|ψπ (P μ )i|z 2 =0 = fπ P μ\n\nZ\n\nh0|Ψ(z)γ μ Ψ(0)|ψρ0 (P μ )i|z 2 =0 = fρ0 P μ\nμ\n\nh0|Ψ(z)σμν Ψ(0)|ψρ± (P )i|z 2 =0 =\n\n1\n\n0\n\nZ\n\neix(z.P ) φπ (x) ,\n\n1\n\n0\n\n(3.7)\n\neix(z.P ) φρ0 (x) ,\n\nfρ± (ǫ±\nμ (P )Pν\n\n−\n\nǫ±\nν (P )Pμ )\n\n(3.8)\nZ\n\n0\n\n1\n\neix(z.P ) φρ± (x) ,\n\n(3.9)\n\nwhere the φ's are normalised to one and ǫ is the polarization vector. They govern the leadingorder perturbative QCD expression for many high momentum transfer exclusive processes\n[27]. Current operators appearing in matrix elements, such as those above, will require\nfurther renormalisation to make them covariant in the presence of cut-offs, in the same\nfashion as the Poincare generators. In this paper, consistent with similar approximations\nmade on the hamiltonian and Hilbert space, the bare current operators valid to lowest order\nof the power expansion in dynamical fields will be used to estimate matrix elements.\nFor the pion, one finds\nfπ\nψ+− (x, 1 − x) =\n2\n\nr\n\nπ\nφπ (x)\nN\n\n(3.10)\n\nfrom the γ + component of (3.7). Figure 3 shows this distribution amplitude at various\nK. A cubic interpolating function is used to produce a curve from the discrete values of\nmomentum fraction x sampled in DLCQ at each K. The resulting curves are extrapolated\npointwise with a fit to a quadratic in 1/K, to yield the data points with extrapolation error\nbars shown also in figure 3. These extrapolated data points have been fit to the first two\nterms of the conformal expansion [28,29]\n\n3 The\n\nerrors introduced by extrapolation in K may make DLCQ seem inefficient compared to a\nbasis of smooth wavefunctions. However, DLCQ is superficially easier to extend to multi-parton\nFock states, which must be the eventual goal.\n\n15\n\n\fn\n\n3/2\n\nφπ (x) = 6x(1 − x) 1 + 0.133C2 (1 − 2x2 )\n\no\n\n.\n\n(3.11)\n\nThe overall normalisation yields fπ = 347(46) MeV, compared to the experimental value\nfπ (exp.) = 131 MeV. Because of error in the MeV scale setting, in the extrapolation in\nK, in the proportion of valence quarks in the pion, and/or in renormalisation, the result\nis much higher in the current approximation, compared to the real world. One would\nexpect that there are too many valence quarks at zero transverse separation in the one-link\napproximation, overestimating electroweak decay constants.\nDirect experimental measurements of φπ (x) have recently become possible from diffractive dissociation on a nucleus π + A → A + jets [30]. These experiments are carried out\nat somewhat larger Q2 ∼ 10GeV2 , to minimize initial state interactions. Although the\nnormalisation, which is Q2 -independent, is not correct, leading-order perturbative QCD\nevolution with boundary condition (3.11) produces a curve with shape consistent with the\ndata measured in ref. [30]. The moments of φπ have also been estimated from QCD sum\nrules. The most recent results [31] indicate a distribution amplitude close to the asymptotic\nform x(1 − x), even at low scales; this result is completely different from the early sum rule\n3/2\ncalculations of Chernyak and Zhitnistky [32], who suggested a large positive C2 coefficient.\nThe second moment of φπ has also been calculated from first principles in Euclidean lattice\nQCD [33]. Although there is some systematic variation in those results, assuming the form\n3/2\n(3.11), the most recent lattice results suggest a somewhat negative C2 coefficient! This\nalso appears consistent with the E791 data, provided the coefficient is not too large.\nAn analysis for the ρ yields very similar shapes and normalisations for the distributions.\nFor the helicity zero component of the rho, for example, one finds fρ0 = 315(50) MeV, again\nmuch more than the experimental value fρ0 (exp.) = 216 MeV.\nC. Parton distributions\n\nThe higher Fock state structure of the light-cone wavefunctions in general plays a role in\nany low momentum transfer process as well as high momentum transfer inclusive processes.\nFor example, deep inelastic scattering probes the parton distribution function, the probability for finding a quark carrying certain longitudinal momentum fraction of the hadron:\nV (x, Q2 ) =\n\nX\n\nh,h′\n\n|ψhh′ (x, 1 − x)|2 +\n\nXXZ\nλ h,h′\n\n0\n\n1−x\n\ndy |ψh(λ)h′ (x, y, 1 − x − y)|2 .\n\n(3.12)\n\nThe quark distribution function calculated in the pion is shown in figure 4. In this case a\nlinear extrapolation in 1/K was necessary to achieve a smooth distribution. Also shown is\na relevant phenomenological distribution that neglects sea quarks [34],\nV (x, 0.23) =\n\n√\n0.526\n(1 + 0.357 x)(1 − x)0.365 ,\n0.495\nx\n\n(3.13)\n\nwhich was produced by fitting experimental πN scattering data, after perturbative evolution\nto higher scales. (Note there is a slight difference in Q2 scale). Although the calculated\nparton distribution appears close to the one of ref. [34], the excess at large x means that\nthe calculated total quark momentum fraction (the first moment of V (x)), 0.43(1), is higher\n16\n\n\fthan typical experimental estimates [35]. Similarly, it is higher than estimates from quenched\nEuclidean lattice calculations of the low moments of V [36], which yield about 0.3 for the\nfirst moment (at a slightly higher scale). This is consistent with the fact that the neglect\nof higher numbers of links in the one-link approximation excludes many gluon channels, so\nthe quarks must pick up the momentum instead.\nThe pion elastic electromagnetic form factor depends upon a coherent overlap of the\nentire light-cone wavefunction at low momentum transfer:\n′\n\nhψ(P )|\n\nZ\n\ndx− e iq\n\n+ x−\n\nX\n\ne iq.x\n\nX\nη\n\nx\n\neη Ψη γ μ Ψη |ψ(P )i = F (−q 2 )\n\n(P ′ + P )μ\n,\n2\n\n(3.14)\n\nwhere q = P ′ − P is the exchanged photon's four-momentum and a flavour label η and\ncharges eη have been explicitly introduced to avoid confusion. The space-like form factor\nF (−q 2 ), −q 2 > 0, can be computed most simply from the + component of the current in the\nDrell-Yan frame q + = 0 [38], in which the photon's momentum is purely transverse. One\nfinds\n2\n\nF (−q ) =\n\nZ\n\n1\n\n0\n\n+2\n\ndx1 dx2\nX Z\n\nh,h′ ,r 0\n\nX\n\nh,h′\n1\n\nδ(x1 + x2 − 1)|ψhh′ (x1 , x2 )|2\n\n(3.15)\n\u0012\n\n\u0013\n\nx2\ndx1 dx2 dx3 δ(x1 + x2 + x3 − 1)Cos (x1 + )aq.r̂ |ψh(r)h′ (x1 , x2 , x3 )|2 .\n2\n\nG-parity and transverse reflection symmetries have been used to simplify the result. The\nresulting form factor, with q along a lattice axis, is shown in figure 5 (the calculated F suffers\nfrom lattice artifacts and so is not rotationally invariant). The charge radius, given by rπ2 =\n6(∂F (−q 2 )/∂q 2 )q2 =0 , will obviously be artificially reduced compared to the experimental\nvalue, rπ = 0.663 fm [39]. This distance is roughly the same as one lattice spacing, which is\nthe maximum quark separation in the one-link approximation. This explains why the curve\nin fig.5 is flatter than the true one [40]; the slope at the origin gives a charge radius about\nhalf the experimental value.\nThe quark distribution functions in the ρ are shown in figure 6. One interesting feature,\nwhich may persist in more accurate calculations, is a difference between the longitudinal\nand transversely polarized ρ. This is consistent with some of the ρ's spin coming from\norbital angular momentum of the quarks. In fact, one can directly measure the quark spin\ndistribution in a transversely polarized rho meson ρ± (it is identically zero in a ρ0 ). Define\nthe helicity asymmetry\nA(x) =\n\nV+ (x) − V− (x)\n,\nV+ (x) + V− (x)\n\n(3.16)\n\nwhere V± (x) is the probability for a quark with helicty aligned or anti-aligned with that of\nthe polarized ρ respectively; V (x) = V+ (x) + V− (x). Figure 7 shows that a large part of the\nρ spin is not carried by the quark spins; one finds s = 0.41(10) for the quark spin fraction,\ns=\n\nZ\n\n0\n\n1\n\ndx (V+ (x) − V− (x)) .\n\n(3.17)\n\nIn the non-relativistic quark model, s = 1. About half the rho's spin therefore must come\nfrom orbital angular momentum and gluon spin. Furthermore, fig. 7 exhibits the phenomena\n17\n\n\fof helicity retention - the quark tends to align its spin with that of the hadron at large x\n- which is expected on general grounds [37]. At small x the quark helicity tends to become\ndisordered, and the asymmetry A(x) may even change sign eventually [19]. Euclidean lattice\nestimates of the low moments of the rho parton distributions [36] are consistent with the\nabove results, except for the fact that, as with the pion, too much momentum is carried by\nquarks in the one-link approximation.\nThere are a number of subtleties in extracting the electromagnetic form factors of vector\nmesons from the light-cone wavefunctions; see for example, the discussion in ref. [41]. Since\nrealistic values will in any case not be obtained in the one-link approximation, an analysis\nwill not be attempted here for the ρ.\nIV. CONCLUSIONS\n\nKnowledge of the light-cone wavefunctions provides evident advantages over other methods, which determine low moments of operator matrix elements. Apart from renormalisation\nof the operators themselves, which is common to all methods, no further significant effort is\nrequired to calculate the matrix elements once the light-cone wavefunctions are determined.\nMoreover, these matrix elements are determined directly as functions of the momenta involved. On the other hand, identical low moments can give rise to functions of very different\nshape and moment integrals can often be very sensitive to inaccessible corners of phase\nspace.\nThis paper has begun a program to calculate the light-cone wavefunctions of conventional\nhadrons from a transverse lattice gauge theory, using symmetry principles to renormalise\nthe light-cone Hamiltonian. Expanding the most general Hamiltonian and the Fock space in\npowers of dynamical fields, the leading approximation led to practical difficulties in imposing\nsimultaneously both Poincaré and chiral symmetry from first principles. While Poincaré\nsymmetry could be tested through dispersion and PCAC could be imposed through Mπ ,\ntests for stability of the theory would be compromised by the one-link approximation. In the\nπ-ρ sector, the mass splitting was therefore used as a phenomenological constraint to model\nthe realisation of chiral symmetry in spontaneously broken form. The condition of isotropic\ndispersion then proved sufficient to unambiguously fix the remaining couplings appearing in\nthe leading approximation. The resulting calculation in a Fock space restricted to at most\none link reproduced a number of features of the pion and rho, known from experiment or\nestimated from Euclidean lattice calculations.\nThe next steps, which must go beyond the simplest approximations made here, will\nallow two questions to be addressed. Can symmetry principles alone be used to unambiguously renormalise the transverse lattice theory within a given approximation? Does\nthe approximation scheme converge rapidly-enough to be of practical use? By extending\nthe Tamm-Dancoff cut-off beyond one-link, it becomes easier to detect instabilities in the\ntheory. As discussed in section II.D, this is one means by which chiral symmetry could be\naddressed from first principles - requiring a massless pion in a stable, Poincaré invariant\ntheory. Beyond the one-link approximation it also becomes meaningful to add further quartic operators to the Hamiltonian. This will introduce further sources of parity and helicity\nviolation that may be used to restore some of the parity and chiral symmetry broken by\ncut-offs. The Poincaré and chiral symmetry restoration should then be demonstrated over\n18\n\n\fa range of lattice spacings a, as has been done for Poincaré symmetries in the case of pure\ngauge theories.\nFrom a phenomenological point of view, the one-link approximation, with a lattice spacing of 2/3 fm, artificially squashes light mesons. By adding more links, allowing these mesons\nto expand to their physical size, observables such as form factors and quark momentum\nfractions should move closer to their experimental values. It will also become reasonable to\ninclude P -wave mesons in the analysis, with more symmetry constraints coming from their\ndispersion. Moreover, the simplest approximation for propagating baryons on the transvere\nlattice will require configurations with two links.\n\nAcknowledgements: I thank M. Burkardt for useful discussions. This work was supported\nby PPARC grant GR/LO3965.\n\n19\n\n\fREFERENCES\n[1]\n[2]\n[3]\n[4]\n[5]\n[6]\n[7]\n[8]\n[9]\n[10]\n[11]\n[12]\n[13]\n[14]\n\n[15]\n[16]\n[17]\n[18]\n[19]\n[20]\n\n[21]\n[22]\n\n[23]\n[24]\n[25]\n[26]\n[27]\n[28]\n\nK. G. Wilson, Phys. Rev. D 10, 2445 (1974).\nJ. B. Kogut and L. Susskind, Phys. Rev. D 11, 395 (1975).\nS. J. Brodsky, H.-C. Pauli, and S. Pinsky, Phys. Rep. 301, 299 (1998).\nK. G. Wilson et. al., Phys. Rev. D 49, 6720 (1994).\nS. Dalley and B. van de Sande, Phys. Rev. D 56, 7917 (1997).\nS. Dalley and B. van de Sande, Phys. Rev. D 59, 065008 (1999).\nS. Dalley and B. van de Sande, Phys. Rev. Lett. 82, 1088 (1999); Phys. Rev. D 62,\n014507 (2000).\nW. A. Bardeen and R. B. Pearson, Phys. Rev. D 14, 547 (1976).\nW. A. Bardeen, R. B. Pearson, and E. Rabinovici, Phys. Rev. D 21, 1037 (1980).\nM. Burkardt and H. El-Khozondar, Phys. Rev. D 60, 054504 (1999).\nS. Dalley and B. van de Sande, hep-lat/0010082, to appear in Phys. Rev. D.\nP. A. Griffin, Nucl. Phys. B 139, 270 (1992).\nK. G. Wilson, in Recent Developments of Gauge Theories, eds. G. 't Hooft et al., Plenum\nNew York (1980).\nG. Mack, Nucl. Phys. B 235, 197 (1984);\nH. B. Nielsen and A. Patkos, Nucl. Phys. B 195, 137 (1982);\nH.-J. Pirner, J. Wroldsen, and M. Ilgenfritz, Nucl. Phys. B 294, 905 (1987);\nB. Grossman et. al., Int. J. Mod. Phys. A 6, 2649 (1991);\nH.-J. Pirner, Prog. Part. Nucl. Phys. 29, 33 (1992).\nJ. B. Kogut and D. E. Soper, Phys. Rev. D 1, 2901 (1970).\nC. Itzykson and J-B. Zuber, Quantum Field Theory, McGraw-Hill (1987).\nH.-C. Pauli and S. J. Brodsky, Phys. Rev. D 32, 1993 (1985); ibid 2001.\nM. Burkardt and B. Klindworth, Phys. Rev. D 55, 1001 (1997).\nF. Antonuccio, S. J. Brodsky, and S. Dalley, Phys.Lett. B 412, 104 (1997).\nA. Casher, Phys. Rev. D 14, 452 (1976);\nT. Maskawa and K. Yamawaki, Prog. Theor. Phys. 56, 270 (1976).\nC. Thorn, Phys. Lett. B 70, 77 (1977).\nM. Burkardt, Phys. Rev. D 54, 2913 (1996).\nV. A. Franke, Yu. A. Novozhilov, and E. V. Prokhvatilov, Lett. Math. Phys. 5, 239\n(1981); ibid 437;\nF. Lenz em et. al., Ann. Phys. 208, 1 (1991);\nF. Lenz, H. W. L. Naus, M. Thies, Ann. Phys. 233, 317 (1994);\nH-C. Pauli, A. C. Kalloniatis, and S. Pinsky, Phys. Rev. D 52, 1176 (1995).\nA. S. Mueller, A. C. Kalloniatis, and H-C. Pauli, Phys. Lett. B 435, 189 (1998).\nF. Antonuccio and S. Dalley, Phys. Lett. B 376, 154 (1996).\nA. Casher and L. Susskind, Phys. Rev. D 9, 436 (1974).\nM. Burkardt, Phys. Rev. D 58, 096015 (1998);\nM. Burkardt and H. El-Khozondar, Phys. Rev. D 55, 6514 (1997).\nS. J. Brodsky and G. P. Lepage, in Perturbative Quantum Chromodynamics, ed. A. H.\nMueller, (World Scientific Singapore 1989).\nG. P. Lepage and S. J. Brodsky, Phys. Lett. B 87, 359 (1979); Phys. Rev. D 22, 2157\n(1980).\n20\n\n\f[29] A. V. Efremov and A. V. Radyushkin, Phys. Lett. B 94, 245 (1980); Theor. Math. Phys.\n42, 97 (1980).\n[30] E791 Collaboration, E. M. Aitala et. al., hep-ex/0010043.\n[31] S. V. Mikhailov and A. V. Radyushkin, Phys.Rev. D 45, 1754 (1992);\nA. P. Bakulev and S. V. Mikhailov, Phys.Lett. B 436, 351 (1998);\nV. M. Braun, A. Khodjamirian, and M. Maul, Phys.Rev. D 61, 073004 (2000).\n[32] V. L. Chernyak and A. R. Zhitnitksy, Nucl. Phys. B 201, 492 (1982); B 214, 547(E)\n(1983); Phys. Rep. 112, 173 (1984)\n[33] G. Martinelli and C. Sachrajda, Phys. Lett. B 190, 51 (1987); Nucl. Phys. B 306, 865\n(1988);\nT. DeGrand and R. D. Loft, Phys. Rev. D 38, 954 (1988);\nT. Daniel, R. Gupta, and D. Richards, Phys. Rev. D 43, 3715 (1991);\nL. Del Debbio et. al., Nucl. Phys. B (Proc. Suppl.) 83, 235 (2000).\n[34] M. Glück, E. Reya, and A. Vogt, Z. Phys. C 53, 651 (1992).\n[35] NA3 Collaboration, J. Badier et al., Z. Phys. C 28, 15 (1985).\n[36] G. Martinelli and C. T. Sachrajda, Phys. Lett. B 196, 184 (1987);\nC. Best et. al., Phys. Rev. D 56, 2743 (1997)\n[37] S. J. Brodsky, M. Burkardt, and I. Schmidt, Nucl. Phys. B 441, 197 (1995).\n[38] S. D. Drell and T. M. Yan, Phys. Rev. Lett. 24, 181 (1970).\n[39] S. R. Amendolia et. al., Nucl. Phys. B 277, 168 (1986).\n[40] C. J. Bebek et. al., Phys. Rev. D 13, 25 (1976).\n[41] J. P. B. C. de Melo and T. Frederico, Phys. Rev. C 55, 2043 (1997).\n\n21\n\n\fTABLES\nK=9\n\nπ\n\nρ0\n\nρ+\n\nρ−\n\nM(MeV) 153 848 601 601\nc\n\n1.18 0.73 0.69 1.16\n\nTABLE I. Observables at the minimum χ2 for K = 9.\n\n22\n\n\fCAPTIONS\nFIGURE 1 - Transverse lattice (solid lines) at fixed x+ and meson configurations in a\nR\none-link approximation. Chain lines represent P exp dx− A− required for gauge invariance.\nFIGURE 2 - χ2 as a function of couplings for mb = 0.2 and K = 6, 7, 8, 9.\nFIGURE 3 - The distribution amplitude ψ(x) = ψ+− = −ψ−+ of the pion, at a transverse\nnormalisation scale Q2 ∼ 1 GeV2 . Grey curves correspond to DLCQ cut-offs K = 6, 7, 8, 9\n(darker means larger K). Data points are the pointwise extrapolation of finite-K curves.\nThe solid curve fits these data to the conformal expansion (3.11).\nFIGURE 4 - The quark distribution function in the pion at a transverse normalisation\nscale Q2 ∼ 1GeV2 . Grey curves correspond to DLCQ cut-offs K = 6, 7, 8, 9 (darker means\nlarger K). Data points are the pointwise extrapolation of finite-K curves. The solid curve\n(GRV) comes from a phenomenological fit to πN scattering data [34], at normalisation scale\n0.23 GeV2 .\nFIGURE 5 - The pion electromagnetic form factor F (−q 2 ). Grey curves correspond\nto DLCQ cut-offs K = 6, 7, 8, 9 (darker means larger K). Data points are the pointwise\nextrapolation of finite-K curves.\nFIGURE 6 - The quark distribution function in the longitudinally polarized (h = 0) and\ntransversely polarized (h = 1) rho meson, linearly extrapolated in 1/K.\nFIGURE 7 - The quark helicity asymmetry A(x) in a transversely polarized ρ, linearly\nextrapolated in 1/K.\n\n23\n\n\fFIGURES\n\n24\n\n\fFigure 1\n\nΨ\n\nΨ\n\nxΨ\n\nΜ\nΨ\n\nx1\nx2\n\n25\n\n\fK=6\n\nFigure 2\n\n8\n\n8\n\n8\n\n6\n\n6\n\n6\n\n4\n\n4\n\n4\n\n2\n\n2\n\nK=7\n\n0.1\n\n2\n0.5\n\n1\n\n1.5\n\n2\n\n8\n\n8\n\n8\n\n6\n\n6\n\n4\n\n4\n\n4\n\n2\n\n2\n\n\u001f2\nK=8\n\n0.3\n\n6\n\n0.1\n\n0.2\n\n0.3\n\n1\n\n1.5\n\n2\n\n8\n\n8\n\n8\n\n6\n\n6\n\n4\n\n4\n\n4\n\n2\n\n2\n0.2\n\n0.3\n\n1\n\n1.5\n\n2\n\n8\n\n8\n\n8\n\n6\n\n6\n\n4\n\n4\n\n4\n\n2\n\n2\n\n2\n\n0.2\n\nmf\n\n0.3\n\n1\n\n1.5\n\n2\n\n0.5\n\n1\n\n1.5\n\n2\n\n0.5\n\n1\n\n1.5\n\n2\n\n0.5\n\n1\n\n1.5\n\n2\n\n2\n0.5\n\n6\n\n0.1\n\n0.5\n\n2\n0.5\n\n6\n\n0.1\n\nK=9\n\n0.2\n\n0.5\n\n1\n\n1.5\n\nka\n\n26\n\n2\n\nks\n\n\fFigure 3\n\nψ\n\n200\n\n150\n\n100\n\n50\n\nx\n0.2\n\n0.4\n\n27\n\n0.6\n\n0.8\n\n1\n\n\fFigure 4\n\nV\n2.5\n\nGRV\n\n2\n\n1.5\n\n1\n\n0.5\n\nx\n0.2\n\n0.4\n\n28\n\n0.6\n\n0.8\n\n1\n\n\fFigure 5\n\nq2\n0.05\n\n0.1\n\n0.15\n\n0.95\n\nF ( q2 )\n\n2\n[GeV ]\n\n0.9\n\n0.85\n\n29\n\n0.2\n\n0.25\n\n0.3\n\n\fFigure 6\n\nV\n1.75\n1.5\n\nV\n1.75\n1.5\n1.25\n1\n0.75\n0.5\n0.25\n\nh=0\n\n1.25\n1\n0.75\n0.5\n0.25\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n30\n\n1\n\nx\n\nh=1\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n\nx\n\n\fFigure 7\n\nA\n1\n\n0.8\n\n0.6\n\n0.4\n\n0.2\n\nx\n0.2\n\n0.4\n\n-0.2\n\n31\n\n0.6\n\n0.8\n\n1\n\n\f"}