{"id": "http://arxiv.org/abs/hep-ph/0207009v1", "guidislink": true, "updated": "2002-06-30T20:24:04Z", "updated_parsed": [2002, 6, 30, 20, 24, 4, 6, 181, 0], "published": "2002-06-30T20:24:04Z", "published_parsed": [2002, 6, 30, 20, 24, 4, 6, 181, 0], "title": "Kaluza-Klein States versus Winding States: Can Both Be Above the String\n  Scale?", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0207166%2Chep-ph%2F0207271%2Chep-ph%2F0207239%2Chep-ph%2F0207195%2Chep-ph%2F0207053%2Chep-ph%2F0207050%2Chep-ph%2F0207370%2Chep-ph%2F0207001%2Chep-ph%2F0207065%2Chep-ph%2F0207179%2Chep-ph%2F0207031%2Chep-ph%2F0207160%2Chep-ph%2F0207280%2Chep-ph%2F0207249%2Chep-ph%2F0207248%2Chep-ph%2F0207366%2Chep-ph%2F0207079%2Chep-ph%2F0207114%2Chep-ph%2F0207363%2Chep-ph%2F0207329%2Chep-ph%2F0207305%2Chep-ph%2F0207002%2Chep-ph%2F0207265%2Chep-ph%2F0207213%2Chep-ph%2F0207291%2Chep-ph%2F0207091%2Chep-ph%2F0207189%2Chep-ph%2F0207268%2Chep-ph%2F0207063%2Chep-ph%2F0207302%2Chep-ph%2F0207235%2Chep-ph%2F0207184%2Chep-ph%2F0207017%2Chep-ph%2F0207263%2Chep-ph%2F0207197%2Chep-ph%2F0207238%2Chep-ph%2F0207226%2Chep-ph%2F0207318%2Chep-ph%2F0207100%2Chep-ph%2F0207003%2Chep-ph%2F0207310%2Chep-ph%2F0207009%2Chep-ph%2F0309198%2Chep-ph%2F0309046%2Chep-ph%2F0309175%2Chep-ph%2F0309149%2Chep-ph%2F0309254%2Chep-ph%2F0309010%2Chep-ph%2F0309227%2Chep-ph%2F0309307%2Chep-ph%2F0309259%2Chep-ph%2F0309210%2Chep-ph%2F0309268%2Chep-ph%2F0309256%2Chep-ph%2F0309335%2Chep-ph%2F0309069%2Chep-ph%2F0309042%2Chep-ph%2F0309048%2Chep-ph%2F0309202%2Chep-ph%2F0309271%2Chep-ph%2F0309188%2Chep-ph%2F0309282%2Chep-ph%2F0309094%2Chep-ph%2F0309291%2Chep-ph%2F0309326%2Chep-ph%2F0309347%2Chep-ph%2F0309102%2Chep-ph%2F0309165%2Chep-ph%2F0309107%2Chep-ph%2F0309177%2Chep-ph%2F0309028%2Chep-ph%2F0309314%2Chep-ph%2F0309252%2Chep-ph%2F0309344%2Chep-ph%2F0309088%2Chep-ph%2F0309232%2Chep-ph%2F0309221%2Chep-ph%2F0309125%2Chep-ph%2F0309272%2Chep-ph%2F0309208%2Chep-ph%2F0309187%2Chep-ph%2F0309273%2Chep-ph%2F0309007%2Chep-ph%2F0309189%2Chep-ph%2F0309020%2Chep-ph%2F0309075%2Chep-ph%2F0309096%2Chep-ph%2F0309139%2Chep-ph%2F0309049%2Chep-ph%2F0309127%2Chep-ph%2F0309176%2Chep-ph%2F0309073%2Chep-ph%2F0309328%2Chep-ph%2F0309241%2Chep-ph%2F0309023%2Chep-ph%2F0309199%2Chep-ph%2F0309293%2Chep-ph%2F0309086%2Chep-ph%2F0309078%2Chep-ph%2F0309163%2Chep-ph%2F0309266&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Kaluza-Klein States versus Winding States: Can Both Be Above the String\n  Scale?"}, "summary": "When closed strings propagate in extra compactified dimensions, a rich\nspectrum of Kaluza-Klein states and winding states emerges. Since the masses of\nKaluza-Klein states and winding states play a reciprocal role, it is often\nbelieved that either the lightest Kaluza-Klein states or the lightest winding\nstates must be at or below the string scale. In this paper, we demonstrate that\nthis conclusion is no longer true for compactifications with non-trivial shape\nmoduli. Specifically, we demonstrate that toroidal compactifications exist for\nwhich all Kaluza-Klein states as well as all winding states are heavier than\nthe string scale. This observation could have important phenomenological\nimplications for theories with reduced string scales, suggesting that it is\npossible to cross the string scale without detecting any states associated with\nspacetime compactification.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0207166%2Chep-ph%2F0207271%2Chep-ph%2F0207239%2Chep-ph%2F0207195%2Chep-ph%2F0207053%2Chep-ph%2F0207050%2Chep-ph%2F0207370%2Chep-ph%2F0207001%2Chep-ph%2F0207065%2Chep-ph%2F0207179%2Chep-ph%2F0207031%2Chep-ph%2F0207160%2Chep-ph%2F0207280%2Chep-ph%2F0207249%2Chep-ph%2F0207248%2Chep-ph%2F0207366%2Chep-ph%2F0207079%2Chep-ph%2F0207114%2Chep-ph%2F0207363%2Chep-ph%2F0207329%2Chep-ph%2F0207305%2Chep-ph%2F0207002%2Chep-ph%2F0207265%2Chep-ph%2F0207213%2Chep-ph%2F0207291%2Chep-ph%2F0207091%2Chep-ph%2F0207189%2Chep-ph%2F0207268%2Chep-ph%2F0207063%2Chep-ph%2F0207302%2Chep-ph%2F0207235%2Chep-ph%2F0207184%2Chep-ph%2F0207017%2Chep-ph%2F0207263%2Chep-ph%2F0207197%2Chep-ph%2F0207238%2Chep-ph%2F0207226%2Chep-ph%2F0207318%2Chep-ph%2F0207100%2Chep-ph%2F0207003%2Chep-ph%2F0207310%2Chep-ph%2F0207009%2Chep-ph%2F0309198%2Chep-ph%2F0309046%2Chep-ph%2F0309175%2Chep-ph%2F0309149%2Chep-ph%2F0309254%2Chep-ph%2F0309010%2Chep-ph%2F0309227%2Chep-ph%2F0309307%2Chep-ph%2F0309259%2Chep-ph%2F0309210%2Chep-ph%2F0309268%2Chep-ph%2F0309256%2Chep-ph%2F0309335%2Chep-ph%2F0309069%2Chep-ph%2F0309042%2Chep-ph%2F0309048%2Chep-ph%2F0309202%2Chep-ph%2F0309271%2Chep-ph%2F0309188%2Chep-ph%2F0309282%2Chep-ph%2F0309094%2Chep-ph%2F0309291%2Chep-ph%2F0309326%2Chep-ph%2F0309347%2Chep-ph%2F0309102%2Chep-ph%2F0309165%2Chep-ph%2F0309107%2Chep-ph%2F0309177%2Chep-ph%2F0309028%2Chep-ph%2F0309314%2Chep-ph%2F0309252%2Chep-ph%2F0309344%2Chep-ph%2F0309088%2Chep-ph%2F0309232%2Chep-ph%2F0309221%2Chep-ph%2F0309125%2Chep-ph%2F0309272%2Chep-ph%2F0309208%2Chep-ph%2F0309187%2Chep-ph%2F0309273%2Chep-ph%2F0309007%2Chep-ph%2F0309189%2Chep-ph%2F0309020%2Chep-ph%2F0309075%2Chep-ph%2F0309096%2Chep-ph%2F0309139%2Chep-ph%2F0309049%2Chep-ph%2F0309127%2Chep-ph%2F0309176%2Chep-ph%2F0309073%2Chep-ph%2F0309328%2Chep-ph%2F0309241%2Chep-ph%2F0309023%2Chep-ph%2F0309199%2Chep-ph%2F0309293%2Chep-ph%2F0309086%2Chep-ph%2F0309078%2Chep-ph%2F0309163%2Chep-ph%2F0309266&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "When closed strings propagate in extra compactified dimensions, a rich\nspectrum of Kaluza-Klein states and winding states emerges. Since the masses of\nKaluza-Klein states and winding states play a reciprocal role, it is often\nbelieved that either the lightest Kaluza-Klein states or the lightest winding\nstates must be at or below the string scale. In this paper, we demonstrate that\nthis conclusion is no longer true for compactifications with non-trivial shape\nmoduli. Specifically, we demonstrate that toroidal compactifications exist for\nwhich all Kaluza-Klein states as well as all winding states are heavier than\nthe string scale. This observation could have important phenomenological\nimplications for theories with reduced string scales, suggesting that it is\npossible to cross the string scale without detecting any states associated with\nspacetime compactification."}, "authors": ["Keith R. Dienes", "Arash Mafi"], "author_detail": {"name": "Arash Mafi"}, "author": "Arash Mafi", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevLett.89.171602", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/hep-ph/0207009v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-ph/0207009v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "8 pages, LaTeX, no figures", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-ph/0207009v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-ph/0207009v1", "journal_reference": "Phys.Rev.Lett.89:171602,2002", "doi": "10.1103/PhysRevLett.89.171602", "fulltext": "Kaluza-Klein States versus Winding States:\nCan Both Be Above the String Scale?\nKeith R. Dienes and Arash Mafi\n\narXiv:hep-ph/0207009v1 30 Jun 2002\n\nDepartment of Physics, University of Arizona, Tucson, AZ 85721 USA\nE-mail addresses: dienes,mafi@physics.arizona.edu\n(June 28, 2002)\nWhen closed strings propagate in extra compactified dimensions, a rich spectrum of Kaluza-Klein\nstates and winding states emerges. Since the masses of Kaluza-Klein states and winding states play a\nreciprocal role, it is often believed that either the lightest Kaluza-Klein states or the lightest winding\nstates must be at or below the string scale. In this paper, we demonstrate that this conclusion is no\nlonger true for compactifications with non-trivial shape moduli. Specifically, we demonstrate that\ntoroidal compactifications exist for which all Kaluza-Klein states as well as all winding states are\nheavier than the string scale. This observation could have important phenomenological implications\nfor theories with reduced string scales, suggesting that it is possible to cross the string scale without\ndetecting any states associated with spacetime compactification.\n\nmasses of the Kaluza-Klein excitations are independent\nof the string scale, whereas the masses of the winding\nand oscillator states depend critically on the string scale.\nThere are, of course, many instances in which it is legitimate to restrict our attention to various subsets of\nthese states. For example, in theories whose fundamental constituents are point particles, there are no winding\nor oscillator states. The Kaluza-Klein spectrum therefore provides a complete low-energy description of the\nresonances associated with spacetime compactification.\nLikewise, even within the context of string theory, it is\nagain legitimate to restrict our attention to the KaluzaKlein states if the compactification radius is significantly\nlarger than the fundamental string length. Indeed, in\nsuch cases, the winding states will be much heavier than\nthe string scale, and will affect phenomenology only at\ncorrespondingly higher energies.\nHowever, if the string scale is in the TeV range, some\nor all of the compactification radii may not differ significantly from the string scale [1,3,4]. In such cases,\nKaluza-Klein states, winding states, and even oscillator\nstates must be considered together. Their combined effects can therefore give rise to dramatic alternatives to\ntraditional weak-scale supersymmetric or Kaluza-Klein\napproaches to the gauge hierarchy problem [5]. In such\ncases, however, an important question is to determine\nwhich of these states are truly the lightest in the string\nspectrum. In other words, which states can be expected\nto appear below, at, and above the string scale?\nOrdinarily, the masses of Kaluza-Klein states and\nwinding states play a reciprocal role: if the lightest\nKaluza-Klein states are lighter than the string scale, then\nthe corresponding winding states are necessarily heavier\nthan the string scale. Similarly, the reverse situation in\nwhich the lightest Kaluza-Klein states are heavier than\nthe string scale ordinarily results in winding states which\nare lighter than the string scale (and is equivalent to the\n\nI. INTRODUCTION\n\nTheories involving large extra spacetime dimensions\nand fundamental theories at reduced energy scales have\nattracted considerable attention in recent years [1–4]. As\na result of such developments, it has become possible to\ncontemplate experimental probes not only of compactification geometry, but also of quantum gravity, grand\nunification, and even string theory. Most recent phenomenological studies of such theories have focused on\nthe effects of their low-energy Kaluza-Klein states. However, if the string scale itself is in the TeV range, then\nmany additional string states may also play a role in the\neffective low-energy phenomenology.\nIn general, closed string theories (as well as certain\nclosed-string sectors of Type I open string theories) give\nrise not only to Kaluza-Klein states, but also to string\nwinding states as well as string oscillator states. These\nstates may be differentiated by the manner in which their\nmasses depend on the scale of compactification as well\nas on the string tension (equivalently the string scale).\nKaluza-Klein states reflect the higher-dimensional momentum quantization induced by the spacetime compactification, and consequently have masses inversely proportional to the compactification radius but independent of\nthe string scale. By contrast, winding states reflect the\npossibility that the string can stretch completely around\nthe compactified dimension. These states therefore have\nmasses that grow linearly with the compactification radius as well as with the string tension. Finally, string\noscillator states correspond to the vibrational modes of\nthe fundamental string. Their masses are thus set purely\nby the string tension (or equivalently the fundamental\nstring scale). Note that while the masses of the KaluzaKlein and winding states are sensitive to the compactification geometry, the spectrum of oscillator states is\ncompletely independent of this geometry. Likewise, the\n1\n\n\fprevious configuration as a result of T -duality). The expectation, then, is that either Kaluza-Klein states or the\nwinding states must be lighter than the string scale, or\nmust at least have masses equal to the string scale. Thus,\nit would seem that it is impossible to cross the string scale\nwithout seeing at least some states (either Kaluza-Klein\nor winding) associated with the compactification geometry.\nIn this paper, we shall demonstrate that this naı̈ve\nexpectation is incorrect in the case of compactifications\nwith non-trivial shape moduli. Specifically, we shall show\nthat it is possible for the string scale to be simultaneously\nlighter than all the Kaluza-Klein states as well as all the\nwinding states. Thus, in such theories, it is possible to\ncross the string scale without seeing a single resonance\nassociated with the spacetime compactification! Needless to say, this can therefore give rise to a a low-energy\nphenomenology which is markedly different from that of\nthe usual Kaluza-Klein effective field theories.\nWe shall begin by focusing purely on the spectrum\nof Kaluza-Klein and winding modes associated with\ntoroidal compactification. After establishing our main\nresult, we shall then proceed to discuss how this result\nemerges within the context of a full string theory when\nthe string oscillator states are also taken into account.\n\nQuantizing the string in the usual fashion, we then find\nthat the resulting string states can be classified in terms\nof their Kaluza-Klein momentum numbers ni and their\nwinding numbers wi , where i = 1, ..., n. If we collect\nthese momentum and winding numbers into a vector\n\u0013\n\u0012\nnn w1 R1\nwn Rn\nn1\nT\n,\n(2)\n, ...,\n;\n, ...,\nÑ =\nR1\nRn α′\nα′\nwe find that the mass of the corresponding state takes\nthe form [6,7]\nM2ni ;wi = Ñ T Q−1 Ñ\n\n(3)\n\nwhere\nQ−1 =\n\n\u0012\n\nG−1\n−BG−1\n\nG−1 B\nG − BG−1 B\n\n\u0013\n\n.\n\n(4)\n\nIn this expression, G is the dimensionless (n × n)dimensional metric of the n-torus, now given by\nGij ≡ cos αij\n\n(5)\n\n(where αii ≡ 0), and B is the (n × n)-dimensional background antisymmetric tensor as in Eq. (1). The result in\nEq. (3) is completely standard [6]; a full derivation will\nbe given in Ref. [7].\nLet us now examine specific examples of this mass formula. For a one-dimensional torus (i.e., a circle), there\nare no shape angles αij . There is also no B-field background. We then obtain the standard spectrum associated with circle-compactification:\n\nII. SPECTRUM OF COMPACTIFICATION\nRESONANCES\n\nWe begin by considering the action for a string propagating in an n-dimensional spacetime governed by a metric Gij and a background antisymmetric tensor (torsion)\nfield Bij :\n\u0012\nZ\n√\n1\n2\n−gg αβ Gij ∂α X i ∂β X j\nd\nσ\nS=−\n4πα′\n\u0013\n(1)\n+ ǫαβ Bij ∂α X i ∂β X j .\n\nM2n1 ;w1 =\n\nw12 R2\nn21\n+\n.\nR2\nα′2\n\n(6)\n\nNote that this spectrum conforms to our usual expectations: depending on the value of the radius R, either the\nmomentum (Kaluza-Klein) or the winding √\nmodes must\nbe lighter than the string scale Mstring ≡ 1/ α′ . Specifically, the mass of the lightest Kaluza-Klein and winding\nstates are respectively given by\n\n−2\nHere α′ ≡ Mstring\nis the string Regge slope, and σ α ,\n∂α , and gαβ are the coordinates, derivatives, and metric\non the string worldsheet. The spacetime indices i, j run\nfrom 1, ..., n. Because our interest is in the spacetime\ncompactification of this theory, we have restricted the\nabove action to include only those bosonic worldsheet\nfields X i corresponding to the spacetime coordinates to\nbe compactified. Later we will discuss how this may be\nembedded in a more complete string theory.\nThe next step is to compactify these n spacetime dimensions. For simplicity, we shall take our compactification manifold to be a general, flat, n-dimensional torus.\nSuch a torus can be specified by its periodicity radii Ri\n(i = 1, ..., n) as well as by shape angles αij (i, j = 1, ..., n).\nThese shape angles parametrize the relative orientations\nbetween the ith and j th toroidal periodicities.\n\nM2KK =\n\n1\n,\nR2\n\nM2winding =\n\nR2\n.\nα′\n\n(7)\n\nThe self-dual radius R∗ (defined to be the radius at which\nthese\nmasses become equal) is therefore given by R∗ ≡\n√\nα′ , implying that\nMstring =\n\n1\n= M∗\nR∗\n\n(8)\n\nwhere M∗ ≡ MKK = Mwinding at the self-dual radius. These results are completely as expected, and\nit is possible to exploit T -duality in order to choose a\nconvention such that R−1 < Mstring (or equivalently\nMKK < Mwinding ) when we are not at the self-dual radius.\n2\n\n\fHowever, as we shall now demonstrate, these results no longer hold in the case of higher-dimensional\ntoroidal compactifications with non-trivial shape moduli\nand background B-fields. In the case of a two-torus, the\nantisymmetric B-field has a single element b ≡ B12 ; there\nis also only one shape modulus θ ≡ α12 . The corresponding mass formula then takes the form\n\u0013\n\u0012 2\nn22\nn1 n2\nn1\n1\n2\n+ 2 −2\ncos θ\nM~n;w~ =\nR2\nR1 R2\nsin2 θ R12\n\u0001\nb2 + sin2 θ\nw12 R12 + w22 R22 + 2w1 w2 R1 R2 cos θ\n2\n′2\nα sin \u0012\nθ\n2b\nn1 w1 cos θ − n2 w2 cos θ\n+ ′ 2\nα sin θ\n\u0013\nR2\nR1\n+ n1 w2\n.\n(9)\n− n2 w1\nR1\nR2\n+\n\nWithout loss of generality, let us take R1 ≥ R2 . The\nlightest Kaluza-Klein state then corresponds to the state\nwith (n1 , n2 ; w1 , w2 ) = (1, 0; 0, 0), and has mass\nMKK =\n\n1\n.\nR1 sin θ\n\n(10)\n\nK1 ≡ b212 s213 + b213 s212 − 2b12 b13 (c23 − c12 c13 ) .\n\n(16)\n\n(17)\n\nSimilar results hold for the remaining toroidal periodicities. Note that this result reduces to Eq. (13) in the\nspecial case with c13 = c23 = b13 = b23 = 0.\nSeveral features of this result are immediately apparent. First, it is straightforward to verify that\n\n(12)\n\n1\nsin2 θ\np\nM∗2 .\n=\n= p\n2\nb2 + sin2 θ R∗\nb2 + sin2 θ\n1\n\ns23\n\n√\n\nK\n≤ 1\nK + K1\n\n(18)\n\nwhenever the shape angles satisfy the constraint in\nEq. (15). Indeed, we find that K and K1 are both necessarily positive when Eq. (15) is satisfied. Thus, once\nagain, we verify that the self-dual Kaluza-Klein/winding\nmass scale is greater than Mstring . Indeed, this holds for\nall three periodicities of the torus.\nMore interestingly, however, we now observe a new feature: the self-dual radius, and indeed the mass of the\nlightest Kaluza-Klein/winding modes at the self-dual radius, are not universal for all toroidal directions! Instead,\nthey depend on the specific configuration of shape angles\nand antisymmetric B-field components involved in the\ncompactification. Thus, the whole notion of self-dual radius becomes a shape-dependent phenomenon, varying\naccording to the specific direction of compactification.\n\n(13)\n\nThis is to be compared with the case for a one-torus in\nEq. (8).\nClearly, if θ = π/2 and b = 0, we obtain the expected\nresult that M∗ = Mstring . In this case, it is impossible\nto make the Kaluza-Klein states heavier than the string\nscale without making at least one winding state lighter\nthan the string scale. However, in all other cases, we find\nfrom Eq. (13) that\nM∗ > Mstring !\n\nin order to guarantee that our three-torus is physical;\nthese inequalities are saturated only in the degenerate limit when the direction associated with the third\ntoroidal periodicity lies in the plane formed by the other\ntwo. Repeating the above procedure to calculate the\nKaluza-Klein and winding masses associated with the\nfirst toroidal periodicity, we find that Eq. (13) becomes\n\nK ≡ det G = 1 − c212 − c213 − c223 + 2c12 c13 c23 ,\n\nThus, defining as before M∗ ≡ MKK = Mwinding at the\nself-dual radius, we obtain the result\n2\nMstring\n\n(15)\n\nwhere sij ≡ sin αij , cij ≡ cos αij , and where\n\nSolving for the self-dual radius, we find\n.\nR∗2 = p\nb2 + sin2 θ\n\n|α12 − α13 | < α23 < α12 + α13\n\ns23\nK\n1\n2\n√\nMstring\n= √\n=\nM2\n2\nK + K1 R1∗\ns23 K + K1 1∗\n\nBy contrast, the lightest winding mode in the same direction associated with R1 is the state (n1 , n2 ; w1 , w2 ) =\n(0, 0; 1, 0), with mass\np\nb2 + sin2 θ\nR1 .\n(11)\nMwinding =\nα′ sin θ\n\nα′\n\nis possible to cross the energy threshold associated with\nthe string scale without having seen a single compactification resonance of either type! Choosing R2 = R∗ in\nthis situation then guarantees that all compactification\nresonances associated with this two-torus compactification will be heavier than the string scale.\nThis feature generalizes to higher-dimensional compactifications. In the case of a three-torus, for example, there are three radii Ri , three shape angles\n{α12 , α13 , α23 }, and likewise three independent components {b12 , b13 , b23 } for the background antisymmetric Bfield. Note that the shape angles must satisfy the constraint\n\n(14)\n\nThis implies that it is possible (e.g., at the self-dual radius) for the string scale to be lighter than all the KaluzaKlein modes as well as all the winding modes! Indeed, it\n3\n\n\f(with all other αij = π/2 and bij = 0), we obtain the\n2\nratio M∗2 /Mstring\n= 2 for each of the five compactified\ndimensions. Thus, in this case, the lightest Kaluza-Klein\nand winding states do not appear until at least the second\nexcited level. Of course, these particular tori are chosen\nmerely as highly symmetric illustrative examples, and it\nis likely that more dramatic ratios can be achieved in\nasymmetric compactifications for which each compactified dimension has its own value of M∗ . We have already\nseen this possibility, for example, in the three-torus case\ndiscussed above. These issues will be discussed further\nin Ref. [7].\n\nIII. GEOMETRIC BOUNDS\n\nThus far, we have demonstrated that in compactifications with non-trivial shape moduli, M∗ can generically be larger than Mstring . As we have seen, this implies that compactifications exist for which the lightest\nKaluza-Klein states as well as the lightest winding states\nare simultaneously heavier than the string scale.\nGiven this result, it is natural to wonder how large this\nseparation between the lightest compactification states\nand the string scale can become. In other words, what is\nthe maximum size for the ratio M∗ /Mstring ?\nAt first glance, it may appear that this ratio is completely unbounded. For example, in the case of a twotorus in Eq. (13), it might initially appear that we can\ntake θ ≪ 1, thereby making M∗ arbitrarily heavy. However, there is an important subtlety that must be taken\ninto account. In our derivation of the two-torus result\nin Eq. (13), we assumed that the lightest Kaluza-Klein\nand winding states are those with (n1 , n2 ; w1 , w2 ) =\n(1, 0; 0, 0) and (0, 0; 1, 0) respectively. However, this assumption is true only if two conditions are satisfied.\nFirst, this is true only if | cos θ| remains relatively small,\nso that no anomalous cancellations are induced in the\nmass formula in Eq. (9) when n1 , n2 are both non-zero\nand large. Or, to phrase this restriction more mathematically in the case of a two-torus, we must ensure\nthat τ ≡ (R2 /R1 )eiθ remains within the fundamental\ndomain of the modular group. Second, just as the radii\nand shape angles must be restricted by modular symmetries, we must also restrict the components of the antisymmetric B-field. It turns out [6] that the mass spectrum has a symmetry under which the components of\nB̂ij ≡ (Ri Rj )Bij /α′ are each individually shifted by integers. This implies that we must restrict each of the\nB-field components such that −1/2 < B̂ij ≤ 1/2 for all\ni, j.\nLet us examine these constraints for the two-torus. In\nthis case, it is easy to verify that the maximum ratio\nM∗ /Mstring is achieved for the so-called SU (3) torus:\n√\nR1 = R2 = R∗ = α′ ,\ncos θ = b = 1/2 ,\n(19)\n\nIV. EMBEDDINGS INTO STRING THEORY\n\nWe now discuss the additional features that arise when\nthese results are embedded into the full string framework.\nAs we shall see, this is important because there are significant differences between the traditional Kaluza-Klein\npicture and its ultimate realization in string theory.\nThe full mass spectrum of a toroidally compactified\nstring is generally governed by two equations of the\nform [8]\nα′ M2tot = α′ M2ni ;wi + 2 (N + N ) + 2(a + a)\nX\nni wi + a − a .\nN −N =\n(21)\ni\n\nHere M2ni ;wi represents the mass contribution from the\nKaluza-Klein and winding excitations, as defined in\nEq. (3), and (N, N ) are the total energies from the leftand right-moving string oscillator\nexcitations. These\nenP\nP\nergies are calculated as N ≡ n nNn and N ≡ n nN n ,\nwhere Nn and N n count the number of excitations of frequency n of the underlying left- and right-moving worldsheet fields. Likewise, (a, a) represent left- and rightmoving vacuum-energy contributions which we shall keep\narbitrary for now. The first of these equations indicates\nthat the total mass of a given string state receives contributions not only from Kaluza-Klein and winding excitations, but also from the oscillators and from the total\nvacuum energy. By contrast, the second of these equations is a level-matching constraint which is required for\nthe self-consistency of the string. This constraint ensures that the total mass of a given state receives equal\ncontributions from the left- and right-moving worldsheet\nexcitations, possibly offsetPby a vacuum energy difference a − a. (The quantity i ni wi represents the energy\noffset due to the Kaluza-Klein/winding modes.) While\nthere may be additional GSO constraint equations governing the string spectrum in the case of realistic string\nmodels [8,9], the constraints listed in Eq. (21) are generic\nand appear as a minimal set for all toroidally compactified string theories.\n\n2\nyielding M∗2 /Mstring\n= 4/3. Note that this solution satis√\n′\nfies R∗ = α . This implies that B̂ = B, thereby guaranteeing that this solution is also consistent with the above\nB-field constraint.\nEven greater ratios can be achieved for higherdimensional compactifications. For example, if we perform a five-dimensional compactification on the so-called\nSO(10) torus given by\n\n√\n Ri = α′ for all i ,\n(20)\nα = α23 = α34 = α35 = π/3 ,\n 12\nb12 = b23 = b34 = b35 = 1/2\n\n4\n\n\fGiven the constraints in Eq. (21), we immediately\nsee two important differences relative to the traditional\nKaluza-Klein picture which focuses only on Mni ;wi .\nFirst, we see that the total spacetime masses of our\nKaluza-Klein and winding modes are generally offset by a\nnon-zero vacuum energy a+a. The value of a+a depends\non the type of string in question (bosonic, superstring,\netc.), as well as on the type of sector (Neveu-Schwarz,\nRamond, higher-order twists, etc.) within a given string\ntheory. The important point, however, is that a + a can\nhave either sign, and is often negative in many string sectors. This implies that the lightest Kaluza-Klein states\naccording to the mass formula in Eq. (3) need not be\nthe lightest Kaluza-Klein states in the actual string spectrum. We shall see several dramatic examples of this\nbelow.\nThe second important feature is the presence of a\nlevel-matching constraint which correlates the KaluzaKlein/winding numbers (ni ; wi ) with the string oscillator energies (N, N ). This implies that whether a given\nKaluza-Klein or winding state is allowed in string theory depends not only on\nPits total mass, but also on the\nparticular combination i ni wi .\nIn order to see how these two features affect the mass\nspectrum, let us classify the various string states into\nsectors according to their values of N + N + a + a.\nIn sectors with N + N + a + a > 0, the string states are\nalready massive even before any Kaluza-Klein or winding\nmodes are excited. Such states are therefore not likely to\nbe among the lightest states in the full string spectrum.\nNext, we turn our attention to string sectors with\nN +N +a+a = 0. Since this implies that Mtot = Mni ;wi ,\nour previous results apply directly in such sectors. In\nother words, we have shown that there exist toroidal compactifications such that the Kaluza-Klein and winding\nstates in such sectors are all heavier than the string scale.\nNote that the special case with ni = wi = 0 (corresponding to the absence of any Kaluza-Klein or winding excitations) corresponds to the massless string states (such as\nthe graviton) which already exist in the spectrum prior\nto compactification. The remaining cases with non-zero\nni and wi thus correspond to the usual Kaluza-Klein\nand winding excitations of these states, as well as the\nexcitations of their Kaluza-Klein descendants [including\nthe U (1) graviphoton gauge fields which emerge from the\nmetric and antisymmetric tensor via the original KaluzaKlein mechanism]. It is important to note, however, that\nthe spectrum of Kaluza-Klein and winding excitations\nin such sectorsPis restricted to those states with a common value of i ni wi (typically zero since\nP the lightest\nKaluza-Klein states in such sectors have i ni wi = 0).\nFinally, we must consider the sectors with N + N +\na + a < 0. In such sectors, the lightest Kaluza-Klein\nand winding excitations are tachyonic and must be GSOprojected out of the spectrum. Depending on the specific\nstring model in question, there are two possible results\n\nof such GSO projections. First, it may happen that this\nentire sector of the string theory is GSO-projected out of\nthe spectrum. In such cases, no further considerations are\nnecessary. On the other hand, it may happen that these\nGSO projections affect only the lightest states, preserving\nstates with α′ M2tot ≥ 0. In such cases, then, we find that\nit is the multiply excited Kaluza-Klein/winding states in\nthese sectors which are actually the lightest states which\nappear in the string spectrum!\nAs an explicit example of this phenomenon, let us consider the bosonic string (for which a = a = −1). If\n(N, N ) = (1, 0) or (0, 1), then α′ M2tot = α′ M2ni ;wi −\n2. Thus, Kaluza-Klein or winding states for which\nα′ M2ni ;wi = 2 are actually massless. For example,\nif two dimensions in this theory are compactified on\nthe so-called SU (3) torus in Eq. (19), then the following twelve multiply excited Kaluza-Klein/winding states\n(n1 , n2 ; w1 , w2 ) have α′ Mn2i ;wi = 2 and hence are massless:\n±(1, 1; 1, 0), ± (1, 0; 1, −1), ± (0, 1; 0, 1)\n±(1, 1; 0, −1), ± (1, 0; −1, 0), ± (0, 1; 1, −1) .\n\n(22)\n\nNote\nP that the first six states [top line of Eq. (22)] have\ni ni wi = 1, while\nP the second six states [bottom line of\nEq. (22)] have i ni wi = −1. Thus the first group of\nstates can have (N, N ) = (0, 1), while the second group\ncan have (N, N ) = (1, 0). Moreover, if these oscillator excitations correspond to excitations of the spacetime coordinates of uncompactified dimensions, then these states\nare spacetime vectors.\nClearly, massless vectors must correspond to gauge\nbosons. Indeed, it turns out that these twelve states combine with the four U (1) graviphoton states which emerge\nfrom the Kaluza-Klein decomposition of the graviton\nand Bμν field, thereby enhancing the total Kaluza-Klein\ngauge symmetry from U (1)4 to SU (3)L × SU (3)R ! [It\nis for this reason that the torus in Eq. (19) is called an\nSU (3) torus.] Likewise, a five-dimensional compactification on the five-dimensional torus of Eq. (20) produces\neighty\nmultiply excited states with α′ Mn2i ;wi = 2 and\nP\ni ni wi = ±1, thereby enhancing the total Kaluza-Klein\ngauge symmetry from U (1)10 to SO(10)L × SO(10)R .\nOf course, this is nothing but the standard Narain\nmechanism by which one obtains non-abelian, simply\nlaced, level-one affine gauge symmetries via toroidal compactifications in string theory: the Kaluza-Klein/winding\nquantum numbers become identified as the charges of\na non-abelian gauge group [8,10]. (The analogous production of non-simply laced and higher-level affine gauge\ngroups is discussed in Ref. [11].) Likewise, similar results\nhold for the superstring and the heterotic string.\nThese features indicate that the simple Kaluza-Klein\neffective field-theory picture becomes far richer, but also\nfar more complex, when embedded within the full context of string theory. For example, if the SU (3) gauge\n5\n\n\fsymmetry of the strong interaction is realized in string\ntheory as an enhanced gauge symmetry, as described\nabove, then the massless gluons of the Standard Model\nare actually simultaneous combinations of Kaluza-Klein,\nwinding, and oscillator modes! In other words, such gluons correspond to string states which simultaneously resonate in extra dimensions (Kaluza-Klein), wrap around\nthose extra dimensions (winding), and also vibrate along\ntheir length with a certain frequency (oscillators). Likewise, the masses of the W ± and Z gauge bosons, ordinarily generated through the Higgs mechanism, can equivalently be generated by shifting various compactification\nradii away from the symmetric values which are needed\nto produce unbroken SU (2) × U (1) gauge symmetry.\nGiven these observations, we see that we must be very\ncareful when interpreting our results within the context\nof string theory. As an example, let us again consider the\ncase of the bosonic string with two dimensions compactified on the SU (3) torus. We have already shown that\n2\nsuch a toroidal compactification has M∗2 /Mstring\n= 4/3.\nHowever, the presence of negative vacuum energies in\nthe bosonic string requires that we must consider the\nhigher Kaluza-Klein/winding excitations as well. It turns\nout that the complete spectrum of Kaluza-Klein/winding\nmodes on this torus consists of\nα′ Mn2i ;wi = 0, 4/3, 2, 10/3, 4, 16/3, ...\nwith values\nX\nni wi = 0, 0, ± 1, ± 1, 0, {0, ±2}, ...\n\nscale. However, it is easy to show that the states with\nmasses α′ Mn2i ;wi = 2k + 1/2 in Eq. (25) all have\nn\nX\neven if k is odd\n(26)\nni wi =\nodd\nif k is even .\ni\nThe level-matching constraint thus ensures that these\n2\nstates can only appear in sectors for which α′ Mtot\n=\n′\n2\nα Mni ;wi + A where A = −4, 0, 4, .... Thus, once again,\nwe see that all of the Kaluza-Klein states and all of the\nwinding states are heavier than the string scale.\nSimilar results also hold for the superstring. In this\ncase, there are four sectors: the left- and right-moving\nworldsheet fermions can be either Neveu-Schwarz (for\nwhich a or a = −1/2) or Ramond (for which a or a = 0).\nLikewise, depending on this choice, the values of N and\nN can be restricted either to integers (Ramond) or to integers and half-integers (Neveu-Schwarz). Working out\nthe various combinations, we find that Mtot = Mni ;wi\nin all relevant sectors which are capable of yielding light\nstates. The only exception is the tachyonic NS/NS sector\nwith (N, N ) = (0, 0), but this sector is typically removed\nthrough the same GSO projection that introduces spacetime supersymmetry. Thus, we again see that it is possible to choose compactification tori such that all KaluzaKlein states and all winding states are heavier than the\nstring scale. Such results also generalize to the heterotic\nstring and (for Kaluza-Klein states) to the bulk sector of\nType I strings as well.\nWe conclude this section with several important comments and caveats.\nFirst, although our main result is that it is possible\nto cross the string scale without seeing a single KaluzaKlein or winding-mode state, we stress that this statement refers only to those states which are beyond the\nmassless level. Indeed, as we have seen, even at the\nmassless level we generically have states which are composed of non-trivial combinations of Kaluza-Klein, winding, and oscillator excitations. Such states may be even\nbe part of the Standard Model gauge group and matter\ncontent.\nSecond, we have not yet discussed the scale for the\noscillator excitations. In general, the mass scale for\nthe oscillator modes is set by Mstring . However, we see\nfrom Eq. (21) that each oscillator excitation contributes\n2\ntwo units to the net value of α′ Mtot\n. Thus, even the\nstring oscillator modes are generically heavier than the\nstring scale! Moreover, if we take the level-matching\nconstraint into account, the oscillator mass gap becomes\neven greater. As an example, let us consider the oscillator excitations of the graviton. In the bosonic string,\nthe graviton emerges as a state with (N, N ) = (1, 1) and\nni = wi = 0. However, we see from the level-matching\nconstraint in Eq. (21) that it is impossible to excite a\nsingle additional oscillator\nP mode, since this would require\nchanging the value of i ni wi by introducing simultaneous Kaluza-Klein/winding excitations. We therefore find\n\n(23)\n\n(24)\n\ni\n\nrespectively. [The states at α′ Mn2i ;wi = 2 are the\ngauge boson states listed in Eq. (22).] Likewise, there\nare only six sectors of the bosonic string which can\npossibly contain light states (defined as states with\n2\nα′ Mtot\n< 2): these are the sectors with (N, N ) =\n(0, 0), (1, 1), (1, 0), (0, 1), (2, 0), and (0, 2). The allowed\nKaluza-Klein/winding\nP(ni ; wi ) states in each of these sectors are those with i ni wi = 0, 0, 1, −1, 2, and −2 respectively. Thus, proceeding sector by sector, we find\nthat (M∗ /Mstring )2 = 4/3 in each sector. Thus, in each\nof these sectors, we conclude that all of the Kaluza-Klein\nand winding states are heavier than the string scale.\nNote that the level-matching constraint is critical in\nreaching this conclusion. For example, the complete\nspectrum for a five-dimensional compactification on the\nSO(10) torus in Eq. (20) is given by\nα′ Mn2i ;wi = 0, 2, 5/2, 4, 9/2, 6, 13/2, ...\n\n(25)\n\nClearly, our result would fail if a Kaluza-Klein/winding\nstate with α′ Mn2i ;wi = 2k + 1/2, k ∈ ZZ, were to emerge in\n2\na sector for which α′ Mtot\n= α′ Mn2i ;wi −2, since this would\n2\n2\nyield a Kaluza-Klein/winding state with Mtot\n/Mstring\n=\n1/2. Such a state would then be lighter than the string\n6\n\n\fthat we need to excite oscillator modes in groups of two,\nkeeping N = N . Thus, the first oscillator excitation of\n2\nthe graviton does not appear until α′ Mtot\n= 4.\nThird, although we have given examples where our results hold in all string sectors, it is undoubtedly possible to construct string models where this fails to be\nthe case. In such instances, the nature of the lightest\nstring states may vary with the specific string sector in\nquestion. For example, it may happen that the lightest compactification states may exceed the string scale\nin one sector (e.g., for the gauge bosons), yet be below\nthis scale in another sector (e.g., for quarks and leptons).\nThis would then give rise to an interesting low-energy\nphenomenology in which different Standard Model particles have Kaluza-Klein/winding excitations of different\nmasses, even though these excitations all correspond to\nthe same extra dimensions with fixed radii!\nFourth, we emphasize that our discussion in this section has focused only on those generic features which are\ncommon to all string theories. As such, we have not focused on a particular class of string theories, nor have we\nfocused on the compactification of all of the extra spacetime dimensions predicted within a given class of string\ntheories. In general, compactification of the full six (or\nseven) extra dimensions predicted by string theory will\ngive rise to additional constraints beyond those which we\nhave considered here. (For example, modular invariance\nrequires that the total theory be compactified on tori for\nwhich the corresponding charge lattice is even and selfdual [8,10], so that α′ Mn2i ;wi ∈ 2ZZ only.) In this paper,\nby contrast, we are only focusing on a subset of the full\ntheory.\nFifth, we remark that our results hold for all values\nof Mstring . Thus, we have not focused on the various\nmechanisms [2–4,12] by which the string scale might be\nreduced into the TeV range in a variety of different classes\nof string theories. Of course, one possibility is that this\nreduction might occur as a result of two or more extra\ndimensions taking values which are significantly larger\nthan the string length [2]. Our results clearly do not\napply for such extra dimensions. Instead, our focus here\nhas been on those extra dimensions (so-called \"TeV-sized\nextra dimensions\") whose sizes are relatively close to the\nfundamental string scale [1,3,4,12,13]. Indeed, it is only\nfor these extra dimensions that our result applies, and\nfor which it is possible to cross the string scale without\nseeing any corresponding Kaluza-Klein and/or winding\nmodes.\nFinally, we note that in this paper we have been discussing the properties of merely the tree-level string spectrum. We have therefore been identifying the Standard\nModel particles as massless string states, and focusing on\nlight excitations thereof. Needless to say, field-theoretic\neffects such as electroweak symmetry breaking and supersymmetry breaking, and even string-theoretic effects\nsuch as vacuum restablization, have the potential to shift\n\nthe particle masses away from their tree-level values [9].\nThese effects can therefore be significant in cases where\nthe string scale itself is in the TeV range.\n\nV. CONCLUSIONS\n\nIn this paper, we have shown that there exist toroidal\ncompactifications for which the lightest Kaluza-Klein\nstates and the lightest winding states are both simultaneously heavier than the string scale. The key ingredient in these compactifications is the presence of nontrivial shape moduli and background antisymmetric tensor fields.\nIt is perhaps not surprising that non-trivial shape moduli have the potential to alter some of our naı̈ve expectations concerning the masses of compactification states.\nIn Ref. [14], for example, it was shown that such moduli\nhave the potential to render certain types of large extra dimensions invisible. Moreover, in Ref. [15], it was\nshown that non-trivial shape moduli can trigger a socalled \"shadowing\" effect in which compactification geometry, much like other \"constants\" of nature, is effectively renormalized as a function of energy scale, with\nquantities such as compactification radii changing their\napparent values as functions of the energy with which\nthe compactification manifold is probed. Results such\nas these suggest that shape moduli have the potential to\ndrastically change our naı̈ve expectations based on studying simple compactifications in which shape moduli are\nignored or held fixed.\nIt is also important to stress that such compactifications are not unusual in any way, and in fact are expected on rather general grounds. Even though we do\nnot know the (presumably non-perturbative) dynamics\nwhich ultimately selects the preferred compactification,\nwe expect that any effective potential which selects this\npreferred compactification should reflect the underlying\nsymmetries of the torus and hence should be modular\ninvariant. It then follows that the extrema of this potential should correspond to tori which sit at modular fixed\npoints. However, tori such as the SU (3) and SO(10) tori\ndiscussed above correspond to highly symmetric modular\nfixed points. Indeed, as we have seen, these are exactly\nthe sorts of tori which give rise to enhanced gauge symmetries in the full string theory. It is therefore reasonable\nto assume that tori such as these are preferred dynamically.\nNeedless to say, these results could have important\nphenomenological implications in theories involving TeVsized extra dimensions [1,3,4,12,13]. Ordinarily, one\nmight have assumed that the first experimental signals\nof such extra dimensions would be the appearance of\nKaluza-Klein states, and that such Kaluza-Klein states\n(or their winding counterparts) must necessarily appear\nbelow the string scale. However, our results indicate that\n7\n\n\fthis need not be the case: if certain extra dimensions are\nnear the string scale, it is possible to cross the string scale\nwithout seeing a single corresponding state of either the\nKaluza-Klein, winding, or oscillator variety! Thus, it is\npossible that the string scale may be lower than previously imagined.\n\n[10]\n\n[11]\n\nACKNOWLEDGMENTS\n\n[12]\n\nThis work was supported in part by the National Science Foundation under Grant PHY-0071054, and by a\nResearch Innovation Award from Research Corporation.\n\n[13]\n[14]\n[15]\n\n[1] I. Antoniadis, Phys. Lett. B 246 (1990) 377; I. Antoniadis, K. Benakli and M. Quiros, Phys. Lett. B 331\n(1994) 313 [arXiv:hep-ph/9403290].\n[2] N. Arkani-Hamed, S. Dimopoulos and G. Dvali, Phys.\nLett. B 429 (1998) 263 [arXiv:hep-ph/9803315]; I. Antoniadis et al., Phys. Lett. B 436 (1998) 257 [arXiv:hepph/9804398].\n[3] K. R. Dienes, E. Dudas and T. Gherghetta, Phys. Lett.\nB 436 (1998) 55 [arXiv:hep-ph/9803466]; Nucl. Phys.\nB 537 (1999) 47 [arXiv:hep-ph/9806292]; arXiv:hepph/9807522.\n[4] E. Witten, Nucl. Phys. B 471 (1996) 135 [arXiv:hepth/9602070]; J.D. Lykken, Phys. Rev. D 54 (1996)\n3693 [arXiv:hep-th/9603133]; G. Shiu and S.-H.H. Tye,\nPhys. Rev. D 58 (1998) 106007 [arXiv:hep-th/9805157];\nZ. Kakushadze and S.-H.H. Tye, Nucl. Phys. B 548\n(1999) 180 [arXiv:hep-th/9809147].\n[5] See, e.g., K. R. Dienes, Nucl. Phys. B 611 (2001) 146\n[arXiv:hep-ph/0104274]; Nucl. Phys. B 429 (1994) 533\n[arXiv:hep-th/9402006]; K. R. Dienes, M. Moshe and\nR. C. Myers, Phys. Rev. Lett. 74 (1995) 4767 [arXiv:hepth/9503055].\n[6] See, e.g., A. Giveon, M. Porrati and E. Rabinovici, Phys.\nRept. 244 (1994) 77 [arXiv:hep-th/9401139].\n[7] K.R. Dienes and A. Mafi, Phenomenological Implications of Compactifications on Manifolds with Non-Trivial\nShape Moduli , to appear.\n[8] See, e.g., M.B. Green, J.H. Schwarz, and E. Witten, Superstring Theory (Cambridge University Press, 1987); J.\nPolchinski, String Theory (Cambridge University Press,\n1998).\n[9] For phenomenological reviews, see, e.g., L.E. Ibáñez,\narXiv:hep-th/9112050; arXiv:hep-th/9505098; I. Antoniadis, arXiv:hep-th/9307002; M. Dine, arXiv:hepph/9309319; A.E. Faraggi, arXiv:hep-ph/9405357; J.L.\nLopez\nand\nD.V.\nNanopoulos,\narXiv:hepph/9511266; J.D. Lykken, arXiv:hep-ph/9511456; Z.\nKakushadze and S.-H.H. Tye, arXiv:hep-th/9512155; F.\nQuevedo, arXiv:hep-th/9603074; arXiv:hep-ph/9707434;\nK.R. Dienes, Phys. Rept. 287 (1997) 447; Z. Kakushadze,\n\n8\n\nG. Shiu, S.-H.H. Tye and Y. Vtorov-Karevsky, Int. J.\nMod. Phys. 13 (1998) 2551.\nK. S. Narain, Phys. Lett. B 169 (1986) 41; K. S. Narain,\nM. H. Sarmadi and E. Witten, Nucl. Phys. B 279 (1987)\n369.\nK. R. Dienes and J. March-Russell, Nucl. Phys. B\n479 (1996) 113 [arXiv:hep-th/9604112]; K. R. Dienes,\nA. E. Faraggi and J. March-Russell, Nucl. Phys. B 467\n(1996) 44 [arXiv:hep-th/9510223].\nSee, e.g., I. Antoniadis and B. Pioline, Nucl. Phys. B\n550 (1999) 41 [arXiv:hep-th/9902055]; I. Antoniadis,\nS. Dimopoulos and A. Giveon, JHEP 0105 (2001) 055\n[arXiv:hep-th/0103033].\nT. Appelquist, H. C. Cheng and B. A. Dobrescu, Phys.\nRev. D 64 (2001) 035002 [arXiv:hep-ph/0012100].\nK. R. Dienes, Phys. Rev. Lett. 88 (2002) 011601\n[arXiv:hep-ph/0108115].\nK. R. Dienes and A. Mafi, Phys. Rev. Lett. 88 (2002)\n111602 [arXiv:hep-th/0111264].\n\n\f"}