{"id": "http://arxiv.org/abs/hep-ph/0411093v1", "guidislink": true, "updated": "2004-11-05T19:11:16Z", "updated_parsed": [2004, 11, 5, 19, 11, 16, 4, 310, 0], "published": "2004-11-05T19:11:16Z", "published_parsed": [2004, 11, 5, 19, 11, 16, 4, 310, 0], "title": "May Heavy neutrinos solve underground and cosmic ray puzzles?", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0411350%2Chep-ph%2F0411160%2Chep-ph%2F0411158%2Chep-ph%2F0411318%2Chep-ph%2F0411312%2Chep-ph%2F0411308%2Chep-ph%2F0411105%2Chep-ph%2F0411385%2Chep-ph%2F0411291%2Chep-ph%2F0411256%2Chep-ph%2F0411097%2Chep-ph%2F0411137%2Chep-ph%2F0411231%2Chep-ph%2F0411250%2Chep-ph%2F0411257%2Chep-ph%2F0411398%2Chep-ph%2F0411215%2Chep-ph%2F0411164%2Chep-ph%2F0411172%2Chep-ph%2F0411376%2Chep-ph%2F0411055%2Chep-ph%2F0411230%2Chep-ph%2F0411012%2Chep-ph%2F0411348%2Chep-ph%2F0411003%2Chep-ph%2F0411371%2Chep-ph%2F0411280%2Chep-ph%2F0411086%2Chep-ph%2F0411091%2Chep-ph%2F0411279%2Chep-ph%2F0411132%2Chep-ph%2F0411035%2Chep-ph%2F0411307%2Chep-ph%2F0411316%2Chep-ph%2F0411267%2Chep-ph%2F0411029%2Chep-ph%2F0411361%2Chep-ph%2F0411156%2Chep-ph%2F0411193%2Chep-ph%2F0411391%2Chep-ph%2F0411263%2Chep-ph%2F0411209%2Chep-ph%2F0411146%2Chep-ph%2F0411387%2Chep-ph%2F0411170%2Chep-ph%2F0411392%2Chep-ph%2F0411116%2Chep-ph%2F0411268%2Chep-ph%2F0411148%2Chep-ph%2F0411061%2Chep-ph%2F0411140%2Chep-ph%2F0411133%2Chep-ph%2F0411094%2Chep-ph%2F0411080%2Chep-ph%2F0411030%2Chep-ph%2F0411359%2Chep-ph%2F0411077%2Chep-ph%2F0411112%2Chep-ph%2F0411107%2Chep-ph%2F0411122%2Chep-ph%2F0411302%2Chep-ph%2F0411085%2Chep-ph%2F0411315%2Chep-ph%2F0411221%2Chep-ph%2F0411159%2Chep-ph%2F0411346%2Chep-ph%2F0411183%2Chep-ph%2F0411149%2Chep-ph%2F0411074%2Chep-ph%2F0411351%2Chep-ph%2F0411185%2Chep-ph%2F0411065%2Chep-ph%2F0411403%2Chep-ph%2F0411040%2Chep-ph%2F0411241%2Chep-ph%2F0411025%2Chep-ph%2F0411277%2Chep-ph%2F0411285%2Chep-ph%2F0411333%2Chep-ph%2F0411271%2Chep-ph%2F0411093%2Chep-ph%2F0411197%2Chep-ph%2F0411007%2Chep-ph%2F0411087%2Chep-ph%2F0411384%2Chep-ph%2F0411216%2Chep-ph%2F0411394%2Chep-ph%2F0411222%2Chep-ph%2F0411382%2Chep-ph%2F0411342%2Chep-ph%2F0411406%2Chep-ph%2F0411337%2Chep-ph%2F0411246%2Chep-ph%2F0411210%2Chep-ph%2F0411104%2Chep-ph%2F0411027%2Chep-ph%2F0411244%2Chep-ph%2F0411336%2Chep-ph%2F0411331%2Chep-ph%2F0411243%2Chep-ph%2F0411270&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "May Heavy neutrinos solve underground and cosmic ray puzzles?"}, "summary": "Primordial Heavy neutrinos of 4th generation might explain different\nastrophysical puzzles: indeed the simplest 4th neutrino scenario may be still\nconsistent with known 4th neutrino physics, cosmic ray anti-matter and gamma\nfluxes and signals in underground detectors for a very narrow neutrino mass\nwindows (46-47 GeV). We have analyzed extended Heavy neutrino models related to\nthe clumpiness of neutrino density, new interactions in Heavy neutrino\nannihilation, neutrino asymmetry, neutrino decay. We found that in these models\nthe underground signals maybe better combined with the cosmic ray imprint\nleading to a wider windows for neutrino mass (46-75 GeV) coinciding with the\nwhole range allowed from uncertainties of electro-weak parameters.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0411350%2Chep-ph%2F0411160%2Chep-ph%2F0411158%2Chep-ph%2F0411318%2Chep-ph%2F0411312%2Chep-ph%2F0411308%2Chep-ph%2F0411105%2Chep-ph%2F0411385%2Chep-ph%2F0411291%2Chep-ph%2F0411256%2Chep-ph%2F0411097%2Chep-ph%2F0411137%2Chep-ph%2F0411231%2Chep-ph%2F0411250%2Chep-ph%2F0411257%2Chep-ph%2F0411398%2Chep-ph%2F0411215%2Chep-ph%2F0411164%2Chep-ph%2F0411172%2Chep-ph%2F0411376%2Chep-ph%2F0411055%2Chep-ph%2F0411230%2Chep-ph%2F0411012%2Chep-ph%2F0411348%2Chep-ph%2F0411003%2Chep-ph%2F0411371%2Chep-ph%2F0411280%2Chep-ph%2F0411086%2Chep-ph%2F0411091%2Chep-ph%2F0411279%2Chep-ph%2F0411132%2Chep-ph%2F0411035%2Chep-ph%2F0411307%2Chep-ph%2F0411316%2Chep-ph%2F0411267%2Chep-ph%2F0411029%2Chep-ph%2F0411361%2Chep-ph%2F0411156%2Chep-ph%2F0411193%2Chep-ph%2F0411391%2Chep-ph%2F0411263%2Chep-ph%2F0411209%2Chep-ph%2F0411146%2Chep-ph%2F0411387%2Chep-ph%2F0411170%2Chep-ph%2F0411392%2Chep-ph%2F0411116%2Chep-ph%2F0411268%2Chep-ph%2F0411148%2Chep-ph%2F0411061%2Chep-ph%2F0411140%2Chep-ph%2F0411133%2Chep-ph%2F0411094%2Chep-ph%2F0411080%2Chep-ph%2F0411030%2Chep-ph%2F0411359%2Chep-ph%2F0411077%2Chep-ph%2F0411112%2Chep-ph%2F0411107%2Chep-ph%2F0411122%2Chep-ph%2F0411302%2Chep-ph%2F0411085%2Chep-ph%2F0411315%2Chep-ph%2F0411221%2Chep-ph%2F0411159%2Chep-ph%2F0411346%2Chep-ph%2F0411183%2Chep-ph%2F0411149%2Chep-ph%2F0411074%2Chep-ph%2F0411351%2Chep-ph%2F0411185%2Chep-ph%2F0411065%2Chep-ph%2F0411403%2Chep-ph%2F0411040%2Chep-ph%2F0411241%2Chep-ph%2F0411025%2Chep-ph%2F0411277%2Chep-ph%2F0411285%2Chep-ph%2F0411333%2Chep-ph%2F0411271%2Chep-ph%2F0411093%2Chep-ph%2F0411197%2Chep-ph%2F0411007%2Chep-ph%2F0411087%2Chep-ph%2F0411384%2Chep-ph%2F0411216%2Chep-ph%2F0411394%2Chep-ph%2F0411222%2Chep-ph%2F0411382%2Chep-ph%2F0411342%2Chep-ph%2F0411406%2Chep-ph%2F0411337%2Chep-ph%2F0411246%2Chep-ph%2F0411210%2Chep-ph%2F0411104%2Chep-ph%2F0411027%2Chep-ph%2F0411244%2Chep-ph%2F0411336%2Chep-ph%2F0411331%2Chep-ph%2F0411243%2Chep-ph%2F0411270&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Primordial Heavy neutrinos of 4th generation might explain different\nastrophysical puzzles: indeed the simplest 4th neutrino scenario may be still\nconsistent with known 4th neutrino physics, cosmic ray anti-matter and gamma\nfluxes and signals in underground detectors for a very narrow neutrino mass\nwindows (46-47 GeV). We have analyzed extended Heavy neutrino models related to\nthe clumpiness of neutrino density, new interactions in Heavy neutrino\nannihilation, neutrino asymmetry, neutrino decay. We found that in these models\nthe underground signals maybe better combined with the cosmic ray imprint\nleading to a wider windows for neutrino mass (46-75 GeV) coinciding with the\nwhole range allowed from uncertainties of electro-weak parameters."}, "authors": ["K. Belotsky", "D. Fargion", "M. Khlopov", "R. V. Konoplich"], "author_detail": {"name": "R. V. Konoplich"}, "author": "R. V. Konoplich", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1007/s11450-008-1016-9", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/hep-ph/0411093v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-ph/0411093v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "16 pages, 8 figures", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-ph/0411093v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-ph/0411093v1", "journal_reference": "Phys.Atom.Nucl.71:147-161,2008", "doi": "10.1007/s11450-008-1016-9", "fulltext": "arXiv:hep-ph/0411093v1 5 Nov 2004\n\nMay Heavy neutrinos solve underground and cosmic ray puzzles?\nK. Belotskya,b , D. Fargionc,d , M. Khlopova,b,c , R.V. Konoplichc,e\na\nb\n\nMoscow Engineering Physics Institute, Moscow, Russia\n\nCenter for Cosmoparticle Physics \"Cosmion\" of Keldysh Institute of Applied Mathematics,\nMoscow, Russia\nc\n\nUniversita' di Roma \"La Sapienza\" and INFN, Rome, Italy\nd\n\nINFN Section Roma1, Rome, Italy\n\ne\n\nDepartment of Physics, New York University,\nNew York, NY 10003, USA\nDepartment of Physics, Manhattan College, Riverdale, New York, NY 10471, USA\n\nAbstract\nPrimordial Heavy neutrinos of 4th generation might explain different astrophysical puzzles : indeed the\nsimplest 4th neutrino scenario may be still consistent with known 4th neutrino physics, cosmic ray antimatter and gamma fluxes and signals in underground detectors for a very narrow neutrino mass windows\n(46 − 47 GeV). We have analyzed extended Heavy neutrino models related to the clumpiness of neutrino\ndensity, new interactions in Heavy neutrino annihilation, neutrino asymmetry, neutrino decay. We found\nthat in these models the underground signals maybe better combined with the cosmic ray imprint leading to\na wider windows for neutrino mass (46 − 75 GeV) coinciding with the whole range allowed from uncertainties\nof electro-weak parameters.\n\n1\n\nIntroduction\n\nThe problem of dark matter (DM) of the Universe was revealed about 70 years ago. Several possible physical\ncandidates were suggested since that time and several approaches to probe these candidates appeared. However,\nobserved phenomena, which have unclear nature yet, could not be decisively matched with expected effects\ncaused by existing candidates.\nAn important step in exploration of DM problem was a development of direct searches for Weakly Interacting\nMassive Particles (WIMP). Underground detectors were created in which effects of nucleus recoil induced by\ninteraction of cosmic WIMP with nucleus were searched for. A positive result at 6.3 sigma C.L. was obtained\nin the DAMA/NaI underground set-up at the Gran Sasso National Laboratory of I.N.F.N. by exploiting the\ndistinctive WIMP annual modulation signature [1]. Being model independent this positive result cannot be\ndirectly compared with the single model-dependent negative results of other groups, which have also used\n\n\fdifferent target-nuclei, different experimental strategies, different set-ups and all assumptions fixed at a single\nset [1]. Moreover, it can be shown [1] that these negative results are actually not incompatible with the positive\nsignal by DAMA/NaI.\nOn the other hand, an indirect probing of DM can be based on cosmic ray (CR) data. The presence of DM\nin Galaxy in form of WIMPs can cause an appearance of cosmic particles of high energy due to an annihilation\nor decay of the WIMPs. An implication of these annihilation (decay) sources of cosmic rays could remove\npossible contradiction between observed cosmic ray fluxes and their predictions on the base of standard cosmic\nray model.\nThe result of DAMA/NaI is a challenge for DM studies, expected to shed a light on the origin of DM. In fact,\nthe existing physical candidates of dominant DM can hardly or not at all provide an explanation of the result\nof DAMA/NaI. WIMP candidates such as neutralino, axion, gravitino, sterile neutrino, axino, mirror (shadow)\nmatter are able to compose all the required missing mass of the Universe, however, all these candidates, except\nneutralino, are virtually sterile particles in respect to their interactions with an ordinary matter. Therefore,\nit looks like the measurements of DAMA/NaI as well as anomalies observed in cosmic rays spectra require a\nnon-sterile DM which, in particular, could be a non-dominant DM component in the form of Heavy neutrinos\nof the 4th generation [2].\nA possibility to explain the DAMA/NaI result within the framework of Standard Model extended to the 4th\ngeneration of fermions, revealed in [2], is the subject of current consideration.\nThe Heavy neutrino (N ) is supposed to be a neutral fermion of a new 4th generation possessing the standard\nweak interaction. According to recent analysis of precision electroweak data[4], where possible virtual contributions of 4th generation particles were taken into account, a fit is compatible with the 4th neutrino, being Dirac\nand (quasi-)stable, in a mass range about 50 GeV (47-50 GeV is 1σ interval, 46.3-75 GeV is 2σ interval) [4]\nand other 4th generation particles satisfying their direct experimental constraints (above 80-130 GeV). In the\nfollowing we will assume that the 4th neutrino mass is about 50 GeV.\nIf the fourth neutrino is sufficiently long living or absolutely stable, its primordial gas from the early Universe\ncan survive to the present time and concentrate in the Galaxy. In the case of charge symmetry of 4th generation\nparticles the primordial 4th neutrinos can not account for a bulk of missing mass in the present Universe. In\nthe mass range about 50 − 80 GeV the 4th neutrinos can make up 10−5 − 10−2 of total density of the Universe,\nbeing a non-dominant DM component. This leads to a scenario of multi component dark matter consisting of a\nsubdominant Heavy neutrino component and a sterile dominant component. A complex analysis of astrophysical\neffects induced by a presence of Heavy neutrino (non-sterile) DM component is the purpose of present paper.\nIt is worth noting that the 4th generation of quarks and leptons, considered here and neutralino, which\nis widely considered as the candidate for WIMPs, are naturally incorporated in the framework of heterotic\nstring phenomenology. 1 . It appeals to future multi-component dark matter analysis of the results of direct\nand indirect WIMP searches. However, the astrophysical uncertainties revealed below even for the model of\n4th generation neutrino, which is the simplest physical model and implies the minimal amount of parameters,\ndemonstrate all the complications to be expected in such multi-component dark matter approach.\nWe should remark that even if in principle the UHE Neutrino of fourth family might produce a very exciting\nscattering with relic Heavy neutrino (a Heavy-Z-Boson Burst) nevertheless the cosmic relic N are too diluted\nand poor in number to be anyway competitive with the much more abundant (by 13 order of magnitude)\nand effective light neutrino [6] scattering. So there is little consequence of any Heavy-Z-Boson Burst model\ninteractions. The eventuality for a UHE Neutrino (produced, for instance in Top-Down models as [7]) to be a\nsource of amplified resonant interaction with electron or quark (as for SUSY UHE neutralino scattering into\ns-electron and s-quark channels [8]) is absent: there are not s-channel interaction able to overcome the electroweak cross-sections but only much less effective t-channel processes. Finally, the UHE N created by Top-Down\nmodels may nevertheless induce charged and neutral current interactions in Neutrino Detectors (SK,UNO,km3 )\nalmost un-distinguishable from lighter UHE neutrino scattering in matter. This effect has just the ability to\nincrease by a small factor (∼ 25%) the event rate in km3 or EUSO neutrino induced events if Top-Down\nmechanism is the main source of UHECR.\n1 Mirror(shadow) matter, also naturally follows from heterotic string phenomenology. It is usually considered as sterile but its\nWIMP effects may play a role[5]\n\n2\n\n\flocal density parameter, xiloc\n\n0.01\nDAMA favourable region\n0.001\n\n0.0001\n\n40\n\n50\n\n60\n70\nNeutrino mass, GeV\n\n80\n\n90\n\nFigure 1: Plot of DAMA favorable region (between upper and lower solid lines) for Heavy neutrinos of the 4th\ngeneration. A dashed line shows the fraction corresponding to a contribution of the Heavy neutrinos to CDM\nof the Universe.\n\n2\n\nEstimation of local Heavy neutrino density from DAMA/NaI experiment\n\nA contribution of Heavy neutrinos ρloc N to the total local density ρloc is given by a ratio\nξloc =\n\nρloc N\n.\nρloc\n\n(1)\n\nApproximately this parameter can be estimated as ΩN /ΩCDM by assuming a dominance of Cold Dark Matter\n(CDM) in the Galaxy and by choosing the local fraction of relic Heavy neutrinos equal to their contribution to\nthe cosmological density of CDM.\nThe results of DAMA/NaI, based on measurements of an \"active\" DM component, i.e. in our assumptions on\ncosmic Heavy neutrinos, give the fraction ξloc of Heavy neutrinos in the local galactic density. Heavy neutrinos\ninteract with nuclei (23 N a, 127 I) of DAMA/NaI detector through the spin-independent coherent vector weak\ncoupling. A spin-dependent axial weak coupling of neutrino and nuclei would contribute significantly within\nthe considered mass range only if the corresponding WIMP-nucleon cross section exceeds the spin-independent\none by several orders of magnitude, what in general is not the case for the 4th neutrino. The value ξloc\nfor Heavy neutrinos is deduced from the result of DAMA/NaI in term of ξloc σSI , where σSI is the effective\nspin-independent WIMP-nucleon cross-section\nσSI =\n\nG2F μ2\nβN a + βI\n.\n−2\n8π VN−2\na βN a + VI βI\n\n(2)\n\nHere GF is the Fermi constant, μ = mmnucl /(m + mnucl ) is the reduced mass of neutrino m and nucleon\n(mnucl = 0.94 GeV), βi = 4mmi /(m + mi )2 , Vi = 1 − (2 − 4sin2 θW )Zi /Ai with Zi and Ai being numbers of\nprotons and nucleons in nucleus respectively, θW is the Weinberg angle.\nFigure 1 shows a favorable region for Heavy neutrinos of the 4th generation measured by DAMA and the\nfraction corresponding to a Heavy neutrinos contribution to a local galactic density. The result of DAMA/NaI\ntakes into account existing uncertainties in DM distribution parameters, in form-factor of nuclei, and in the\nother experimental parameters [1]. The fraction corresponding to a Heavy neutrinos contribution was estimated\nby taking ΩCDM = 0.3.\nNote that the present work is based on the essentially updated DAMA/NaI results in comparison with the\nprevious works [2], [3].\n\n3\n\n\f3\n\nShadows of Heavy neutrino annihilations in cosmic rays\n\nDue to a concentration in Galaxy Heavy neutrinos can annihilate. The products of such annihilation contribute\nin cosmic ray fluxes and cosmic gamma radiation. Observational data on cosmic positrons, antiprotons and\ngamma-radiation are sensitive to this contribution.\nAn analysis of cosmic rays is complicated because a description of CR production and propagation contains\nsignificant uncertainties. Observational data do not allow to choose parameters of physical models of CR in\na unique way for CR origin (injection spectra of each CR species) and CR propagation (diffusion coefficients\nand their energy dependence, parameters of convection, re-acceleration, magnetic halo parameters, matter\ndistribution in Galaxy, model of solar modulation etc.). Recently a detailed study of CR models was performed\nin [9],[10],[11].\nIn order to study effects of possible DM annihilation in Galaxy, it is reasonable to accept the most conservative CR model. Eligible models should reproduce possible CR data which are the least sensitive to effects of\nWIMP annihilation (data on nuclear component of CR, its isotope composition). \"Conventional model (C)\" in\n[10] and \"diffusion re-acceleration model (DR)\" in [11] are the most suitable. We will use in our consideration\nfluxes of secondary positrons, antiprotons and gamma-radiation predicted in these models as a \"background\".\nDark matter annihilation sources will be included in these models to reproduce DM effects.\nAn uncertainty in our analysis comes also from unknown distribution of subdominant Heavy neutrino DM\nin the Galaxy. There are many models of distribution of CDM in Galaxy. We will use models for dominant DM,\nre-scaling a dark matter density in an appropriate way for a non-dominant Heavy neutrino DM component .\nBy fixing the density distribution of DM component in Galaxy we relate the result of DAMA, sensitive to local\ndensity of DM, with results of CR analysis, sensitive to DM density distribution in Solar neighborhood.\nAs a basic model for our estimations we select Evan's halo model, which in [1] was named as C2. The values\n3\nof parameters in this model are v0 = 170 km/sec, ρloc = 0.67 GeV/cm√\n. Density distribution of DM in Galaxy\nis given by Eq(41) of [1] or Eq(34) of [12] with the parameters q = 1/ 2 and Rc = 5 kpc\nρ(R, z) = const\n\n2Rc2 + R2\n,\n(Rc2 + R2 + 2z 2 )2\n\n(3)\n\nwhere R and z are the radius in the galactic plane and the cylindrical coordinate axis perpendicular to it, const\nis defined from a condition ρ(R = R0 = 8.5kpc, z = 0) = ρloc .\nIt is worth to note the chosen DM distribution is smooth and does not have a sharp profile near the Galactic\ncenter (GC).\nAlso, to illustrate a dependence on a halo model choice, we will consider an isothermal halo model with a\nsharp behavior of density near GC. Density distribution of the isothermal halo is given by\nρ(R) = ρloc\n\nRc2 + R02\nRc2 + R2\n\n(4)\n\nwith Rc = 1 kpc, where R is the distance from GC.\nNote that the use of cuspy halo model, like Navarro-Frank-White model [13], leads to intermediate results.\n\n3.1\n\nSignature of Heavy neutrinos annihilation in cosmic gamma fluxes\n\nAn excess of cosmic gamma-radiation observed by EGRET over predicted galactic γ-emission, often called\n\"extragalactic\" γ-background, can be considered as a possible effect of dark matter sources. A flux of cosmic\ngamma-radiation near the Earth from annihilation of relic Heavy neutrinos is defined by\nZ ∞\ndNγ\n1 1\ndNγE\nI=\n=\n< σv >\nn2 dl\n.\n(5)\ndtdSdΩdE\n4π 4\ndE\n0\n4\n\n\f1\n\nIntensity*E2 , GeV*m-2 *sec-1 *sr-1\n\n0.7\n0.5\n\n0.3\n\n0.2\n0.15\n\n0.1\n0.2\n\n0.5\n\n1\n2\nEnergy, GeV\n\n5\n\n10\n\n20\n\nFigure 2: Cosmic gamma-radiation from galactic center (0.5o < l < 30.0o , 330.0o < l < 359.0o): EGRET data,\npredicted background (dot-dashed line), and the best-fit contribution from 47-80 GeV neutrino DM for Evan's\nhalo model. The set of dashed lines corresponds to pure annihilation gamma-fluxes, the set of solid lines is the\nsum of background and annihilation fluxes.\n\nHere < σv > is the product of cross section of N N̄ annihilation and a relative velocity of neutrinos averaged\nover velocity distribution, n = ρ/m is the number density of neutrinos in Galaxy. An integration is performed\nalong the line of sight with formally infinite upper limit, dNγE /dE is the mean multiplicity of photons created\nin an act of annihilation for E − (E + dE) energy interval. The factor 1/4 comes from the fact that the\nnumber densities of neutrinos and antineutrinos are equal to a half of their total number density n. To obtain\na distribution dNγE /dE a code PYTHIA 6.2 was used.\nFigures 2 and 3 show γ-fluxes at the Earth from two directions: from the Galactic center (Fig.2) and from a\nhalo in the direction of Galactic zenith (Fig.3). Corrected EGRET data for the halo were taken from [14], where\nEGRET data were re-analyzed in an advanced approach in which the galactic contribution was subtracted giving\npure isotropic \"extragalactic\" γ-radiation. Dashed/solid lines in these figures show annihilation/annihilation\nplus background γ-fluxes for neutrino mass ranging 47-80 GeV. The annihilation γ-fluxes were obtained selecting\ndensity parameter ξloc at given (Evan's) density distribution to fit in the best way the observation data for the\naccepted value of neutrino mass. In a fitting procedure χ2 criterion was used by fixing the Galactic contribution\n(background) and changing the annihilation flux by the ξloc -parameter. Neutrino masses were chosen as 47, 50,\n55, 60, 65, 70, 75, 80 GeV.\nThe low energy part of γ-spectrum from halo (Fig.3) is not reproduced by annihilation of Heavy neutrinos in\nthe halo. However this low energy part can be explained by extragalactic emission based on a blazar population\n[14],[15]. This emission is expected with a similar slope in spectra as data points exhibit. Extraction of pure\n\"extragalactic\" γ-flux in direction of Galactic center (GC) is more complicated problem. We used observational\ndata and a prediction of galactic contribution for γ-flux from GC [10] in accordance with model \"C\". The\ngalactic contribution (refereed to as a background) is shown in Fig.2 by dot-dashed line.\nAll ξloc -parameters, fitting in the best way the predicted annihilation with background fluxes to observational\ndata, will be presented in a figure below.\n\n3.2\n\nSignature of Heavy neutrinos annihilation in cosmic e+ and p fluxes\n\nThe flux of charged particles from annihilation of Heavy neutrinos in Galaxy near the Earth is defined by a\ndiffusion of particles from N N̄ annihilation to the region around the Earth of the size as large as the characteristic\ndiffusion length. For antiprotons, which do not experience significant energy loss, this region is determined by\n5\n\n\fIntensity*E2 , GeV*m-2 *sec-1 *sr-1\n\n0.05\n\n0.02\n0.01\n0.005\n\n0.002\n0.001\n\n0.2\n\n0.5\n\n1\n2\nEnergy, GeV\n\n5\n\n10\n\n20\n\nFigure 3: Cosmic gamma-radiation from zenith galactic direction: EGRET data and the best-fit gamma-flux\nfrom 47-80 GeV neutrino DM annihilation (the set of lines) for Evan's halo model.\n\nthe size of halo where they are trapped by magnetic field. For positrons the size of region of dark matter\nannihilation sources contributing to a flux near the Earth depends on energy loss of positrons. This does not\nallow positrons, created with an energy E0 , to come with energy E from distance strongly exceeding\nλ(E, E0 ) =\n\nZ\n\nE\n\nE0\n\nD(E ′ ) ′\ndE\nb(E ′ )\n\n!1/2\n\n.\n\n(6)\n\nHere D is the diffusion coefficient which is energy (rigidity) dependent, b(E) is the rate of energy loss defined\nas\ndE\n= −b(E).\n(7)\ndt\nCharged cosmic particles experience a solar modulation. To take into account this effect we will use forcefield model [16]. In this approximation the intensity measured at the top of the Earth's atmosphere (inner\nheliosphere) at the energy EEarth corresponds to a local interstellar (LIS) intensity (outer heliosphere) through\nthe relation\n(EEarth + Φ(t))2 − m2p\nIEarth (EEarth , t).\n(8)\nILIS (E = EEarth + Φ(t)) =\n2\nEEarth\n− m2p\nHere mp is the mass of cosmic particle, Φ(t) is the energy lost by the cosmic particles during their travel in the\nheliosphere. Φ(t) is the parameter of the model which can be derived from an observation of appropriate period\nof Solar activity. A dependence of solar modulation of CR on the sign of particle charge appears at low energy\n(at LIS energy, less than 1-2 GeV). It is shown in [17] this dependence during nineties (positive half-cycle of\nthe Sun) broke the force-field approximation for description of data on negatively charged particles (electrons,\nantiprotons) in low energy range. Whereas positively charged particles were well described by the force-field\nmodel in that period. We will use data on cosmic positrons and antiprotons transformed into LIS by Eq(8),\nwhat will lead to some underestimation of LIS antiproton flux at low energy. Note that the energy scale of\nmodulation is detemnined by Φ(t), being around 1GeV, and for E >> 1 GeV effect of modulation is negligible.\nFor an estimation of positron flux from N N̄ annihilation we adopted the diffusion approximation of positron\npropagation in Galaxy without inclusion of the effect of diffusion zone boundaries [18]. It is well-known that a\nstrong energy loss of high energy cosmic e± makes their spectra dependent on the space distribution of density\nof e± -sources. It disfavors the use of \"leaky-box\" model for a quantitative estimation of the effects of tangled,\ndiffusion propagation of e± in Galaxy. A diffusion coefficient and energy loss parameter were chosen following\n\n6\n\n\f\"DR\" model [11]\n\u0012\n\nE\n4 GeV\n\n\u00130.33\n\ncm2 s−1 ,\n\n(9)\n\nb(E) = βE 2 , β = 1.52 × 10−9 (0.5 + 0.5(H/3 μG)2 ) yr−1 GeV−1 ,\n\n(10)\n\nD(E) = 6.1 × 1028\n\nHere in the expression for β the dependence on the averaged galactic magnetic field H and its value 3 μG\nare taken in accordance with [19]. Such parameters (Eq(9-10)) allow positrons originated as far as at GC to\ncontribute to the flux near the Earth. A background (secondary) positron flux was taken as predicted in \"DR\"\nmodel keeping accordance with the choice of parameters (Eq(9-10)). \"DR\" model takes into account effect of\nboundaries and effect of re-acceleration, acceleration of cosmic particles (initially accelerated in their sources)\nduring their propagation in interstellar medium. A disagreement between our estimation of annihilation flux\nand the used prediction of background is not significant. An effect of boundaries of diffusion zone is not very\nimportant for Evan's DM halo model as it is seen from [20].\nThe decrease of halo size zh leads to the de-population of distribution of positrons with λ > zh (Eq(6))\nbecause they escape the diffusion zone more intensively than at larger zh and also because a contribution from\ndark matter annihilation sources situated outside the diffusion zone is not taken into account. The escape from\nthe diffusion zone leads to diminishing relative contribution of annihilation positrons from GC with a decreasing\nhalo size, what is more marked effect for halo models with a sharp density profile near GC. The use of Evan's halo\nmodel with its smoothed density distribution provides better accuracy for the used approximation than other\nmodels with sharper profiles. Also to reduce a deviation of annihilation fluxes obtained in our approximation\nfrom that one which would be predicted in \"DR\" model, induced by the neglecting of the boundaries, we\nexcluded a contribution from dark matter annihilation sources situated outside the diffusion zone of zh = 4\nkpc. Effect of re-acceleration appears below 5 GeV in positron spectra [20] (or the right part of Fig.5 in the ref.\n[21]), where the role of secondary positrons shades the possible dark matter annihilation sources contribution.\nIn Fig.4 the predicted LIS positron fluxes as compared to observational data of HEAT [22] are presented.\nThere are the secondary positron flux (dot-dashed line), the sum of secondary and the best-fit annihilation fluxes\n(the set of solid lines) and separately the last ones (the set of dashed lines), obtained for the range of neutrino\nmass 47-80 GeV. Note, that the curves corresponding to the annihilation fluxes are extended up to the energy\nequal to m of neutrino, above this energy the predicted total fluxes (secondary plus annihilation positrons) are\nthe same as the secondary flux at E > m. HEAT data were \"demodulated\" taking Φ = 664 MeV, derived from\ndata of CAPRICE [17]. A fitting was performed in the same way as described above for gamma-radiation. First\npoint of HEAT (slightly below 2 GeV in Fig.4) was omitted in the procedure of fitting. This point is apparently\ninconsistent even with the predicted secondary positron flux and also inconsistent with the other measurements\nof cosmic positrons [17]. Note that the low energy range should be considered cautiously, because predictions\nin this range depend on possible effects of re-acceleration.\nLet's consider an effect of diffusion coefficient variation, or correspondingly (see Eq(6)) a variation of positron\ndiffusion length. A decrease in D by a factor 10 modifies a little a slope (makes steeper) of spectra of annihilation\npositrons near the Earth and changes the best-fit ξloc parameter by less than 20%. The further decrease in D\ncauses no influence, because mean free path length λ becomes less than typical physical scales of the problem\n(the distance to the nearest boundary of diffusion zone or the length scale of variation in the DM density\ndistribution).\nTo estimate the flux of antiprotons from N N̄ annihilation near the Earth we accept a leaky-box model. In\nthis model the intensity can be defined by a simple expression\nI=\nR\n\nvp̄\n< ṅp̄ > τconf .\n4π\n1\n\nn2 <σv>dV dm\n\n(11)\n\np̄\nHere vp̄ is the velocity of antiproton, < ṅp̄ >= 4 VGal\ndE is the mean number of antiprotons created in\na unit volume per second per energy interval E − (E + dE), averaged over the volume of Galaxy, τconf is the\nconfinement time, the other notations are analogous to those introduced in Eq(5). Time τconf is a parameter\n\n7\n\n\f100\n\nIntensity*E2 , GeV*m-2 *sec-1 *sr-1\n\n50\n\n10\n5\n\n1\n0.5\n\n0.1\n1\n\n2\n\n5\n\n10\nEnergy, GeV\n\n20\n\n50\n\n100\n\nFigure 4: Cosmic positrons (LIS): HEAT data, predicted background (dot-dashed line), and the best-fit contribution from 47-80 GeV neutrino DM (the set of dashed lines is pure annihilation positron fluxes, the set of\nsolid lines is the sum of background and annihilation fluxes) for Evan's halo model.\n\nof the model and it has the meaning of the time of p̄ confinement in Galaxy. We chose τconf to be 107 years\nas in the early works [2]. The volume of Galaxy is supposed to be the volume of region where antiprotons are\nconfined and this region is chosen in form of a disk with radius 25 kpc and semiheight zh = 4 kpc, typical for\nCR models. Energy losses of antiprotons are neglected in Eq(11). Such simplification is justified by small mean\nmatter column (5 g/cm2 ) traveled by cosmic nuclei, , which was deduced from CR analysis. A small fraction\nof antiprotons, which lose their energy in an inelastic scattering on protons of medium (\"tertiary\" component),\nappears in antiproton spectra at very low energy [11].\nAs a background the secondary antiprotons predicted in model \"C\" of [10] were used. For a comparison with\nobservations the combined data of BESS'95 and '97 were used [23], which were demodulated with parameter\nΦ = 540 MeV, derived from BESS'95 [24]. Data BESS'98 belong to time of high solar activity what is less\nsuitable from point of view of detection of possible dark matter annihilation sources [24]. Figure 5 shows a\nspectrum of cosmic antiprotons. Unlike the cases of gamma-radiation and positrons the spectra of antiprotons\nfrom N N̄ annihilation for different values of Heavy neutrino mass coincide within an energy interval presented\nin Fig.5. A charge-sign dependence of solar modulation and an effect of re-acceleration are significant at low\nenergy, making results in this energy range less certain.\nAn increase of parameter τconf or/and a decrease of volume comprising p̄ propagation zone in Galaxy lead\nto a decrease in the best-fit density parameter ξloc . Uncertainties in τconf and VGal lead to overall uncertainty\nof about a factor 2.\nNote, that the analysis of CR carried out in this work differs from analogous analysis performed in the\nprevious works [2], [25] by more refined consideration, in particular more realistic CR models and models of\ndistribution of Heavy neutrinos in Galaxy.\n\n4\n\nHeavy neutrino in underground versus cosmic rays signals\n\nAs one can see from figures 2-5, the presence of dark matter annihilation sources in the form of Heavy neutrinos\nimproves description of existing data on cosmic gamma-radiation, positrons, antiprotons with corresponding\nξloc selected in the best way from observational data. The annihilation fluxes in these figures were obtained for\nEvan's halo model (Eq(3)) as described above. In the same manner as in case of Evan's model the parameters\nξloc , allowing to fit in the best way CR data, were obtained for isothermal halo model (Eq(4)). All these\nparameters for different values of neutrino mass are shown in Fig.6 in comparison with those preferable in\n8\n\n\fIntensity, GeV-1 *m-2 *sec-1 *sr-1\n\n0.2\n\n0.1\n\n0.05\n\n0.02\n\n0.01\n\n0.005\n\n1\n\n1.5 2\n3\nKinetic energy, GeV\n\n5\n\n7\n\n10\n\nFigure 5: Cosmic antiprotons (LIS): BESS(95+97) data, predicted background (dot-dashed line), and the bestfit contribution from 47-80 GeV neutrino DM (the set of dashed lines is pure annihilation antiproton fluxes, the\nset of solid lines is the sum of background and annihilation fluxes) for Evan's halo model. Note, that for the\nconsidered interval of neutrino masses the sets of dashed and solid lines are virtually reduced to single lines.\n\nmeasurements of DAMA. There is the set of black lines in upper half of figure, starting at m = 46 GeV and\nending at m = 80 GeV, which corresponds to ξloc parameters, inferred from CR analysis. Pairs of solid (dotdashed), dotted and dashed lines of this set are related with the best-fit ξloc for gamma-radiation from halo\n(GC), for cosmic positrons and antiprotons respectively. Upper and lower lines of each pair correspond to Evan's\nand isothermal halo models respectively. Solid and dashed grey lines, going across the picture, enclose favorable\nregion of DAMA. For consistent comparison of ξloc , inferred from CR analysis using Evan's halo model, the\nvalues of ξloc , derived from analysis of DAMA/NaI measurements based on the same Evan halo model, are\nshown by dashed grey lines.\nAll ξloc parameters, obtained from CR analysis, define parameters favored by CR data as well as upper\nconstraints imposed by CR data. So, given results allow to make a conclusion that CR data are consistent with\nmeasurements of DAMA/NaI treated in framework of hypothesis about the 4th generation neutrino.\nAn additional source of information about possible existence of WIMPs is data from the search for light\nneutrino fluxes from annihilation of WIMPs accumulated inside the Earth and Sun. But existing data of\nunderground measurements of neutrino fluxes exhibit, contrary to CR data, a lack of neutrinos as compared\nto predicted background (atmospheric neutrinos). New physics is possibly required here. An interpretation\nbased on 3-flavor neutrino oscillations fails to reproduce all appropriate existing data without an introduction\nof a new sterile neutrino. An estimation of muon neutrino fluxes from annihilation of Heavy neutrinos inside\nthe Earth gives a result comparable with the expected corresponding atmospheric neutrino flux in the energy\nrange > 3 GeV for m = 50 GeV for acceptable parameters of Evan's halo model. In this analysis the result\ndepends also on WIMP velocity distribution which affects the capture rate of WIMPs by the Earth. This ratio\nis reduced by a few times if the velocity distribution given by Evan's halo model (Eq(A1-A4) [12]) with velocity\nparameter v0 = 170 km/sec is replaced by Maxwellian distribution with r.m.s. velocity v0 = 220 km/sec. An\nanalysis of underground measurements of upward-going muons (Super-Kamiokande, MACRO, Baksan), induced\nby neutrino fluxes, requires its further development.\nA question about an agreement between all predicted parameters for the 4th generation neutrino, helping\nto improve description data of different species, is of greater interest. Striking is a relative closeness of ξloc\nparameters preferable for different observations. Figure 6 shows that \"play\" with the form of density distribution of Heavy neutrinos in Galaxy is able to change significantly ξloc derived from different observations. An\nagreement between the considered data is possible. For the chosen isothermal model all ξloc parameters (lower\nlines from pairs of lines of upper (black) lines in Fig.6) favored by CR data, a neutrino mass is close to its\n9\n\n\fgamma\n1\n\nhalo\nGC\n\nlocal density fraction xiloc\n\ne+\np0.1\n\n0.01\nDAMA favourable region\n\n0.001\n\n50\n\n60\n70\nNeutrino mass, GeV\n\n80\n\n90\n\nFigure 6: DAMA favorable region (as in Fig.1) and the best-fit density parameters deduced from cosmic gammaradiation (from halo and CG), positron and antiproton analysis. Horizontal grey dashed and solid lines enclose\nDAMA favorable region accepting Evan's halo model and other halo models, respectively. The set of upper\nlines corresponds to the ξloc parameters preferable for CR data. In this set of lines, upper and lower lines of the\nsame type correspond to Evan's halo model and to isothermal halo model, respectively. Vertical grey dashed\nand solid lines restrict 1σ and 2σ allowable range of the 4th neutrino mass deduced from the particle physics\ndata analysis.\n\nlower constraint, in the region of corresponding magnitudes, deduced from DAMA experiment accounting for\ndifferent halo models.\nIn the case of isothermal model, the value of ξloc parameter inferred from analysis of cosmic gamma-radiation\nfrom halo (solid line), differs from the other ones. This discrepancy can be due to a possible extragalactic γradiation (see Fig.3) the account for which can lead to better agreement. But, of course, results of indirect WIMP\nsearches should be treated cautiously taking into account the low precision of the corresponding experimental\ndata.\nGiven Evan's halo model, predictions of ξloc from the data on different CR species are differed by a factor\nof three. In a view of approximations in CR analysis described above it should not be considered as the\nprincipal discrepancy. An agreement achieved between predictions of parameters preferable for CR data and\nfor measurement of DAMA would require reduction of parameter ξloc , preferred by CR data, by a factor a few\n- ten in the allowed range of neutrino mass below 50 GeV. Such a reduction corresponds to an amplification of\nthe annihilation flux proportional to the square of that factor.\nIn other words, the results of DAMA/NaI experiment are compatible with indirect effects of 4th neutrino\nannihilation, but the observational indications to WIMP annihilation effects in cosmic rays and gamma radiation\ncan be explained together with these results only for some models and for a very narrow interval of neutrino\nmasses (46-47 GeV). To increase the range of neutrino masses, at which direct and indirect WIMP signals can\nfind simultaneous explanation, the rate of 4th neutrino annihilation in Galaxy should be much larger.\n\n5\n5.1\n\nThree ways to extend neutrino models and mass range\nAmplification of neutrino annihilation due to clumpiness\n\nThere is a possibility to amplify CR flux created by dark matter annihilation sources maintaining local density\nand average density distribution of DM in Galaxy. This possibility is related with a clumpy DM distribution\n10\n\n\fin Galaxy ([26] and references therein). In particular we are considering local clustering in our galactic center\nand halo with no peculiar density enhancement for our neighborhood. The opposite situation (higher Solar and\nlower global galactic density) is a possibility much less probable and attractive.\nCDM might form clumps on the stage of structure formation in the Universe. As it was shown in [26] a\nsmall fraction of total DM mass (a few×10−3 ) can survive to present time in form of clumps and it is enough to\nprovide strong enhancement (up to a few orders of magnitude) of annihilation signal. Being a non-dominating\nDM component, Heavy neutrinos most likely do not form their own clumps. A formation of clumps should be\ngoverned by the dominating CDM component. Heavy neutrinos should subserve in such processes for values\nof the formed clump mass, Mclump , exceeding some minimal one, MN min . The last one is defined by the size\nof a proto-clump equal to free-streaming length of neutrinos, λf s , when inhomogeneities start to grow. λf s\ndepends on the moment of Heavy neutrinos decoupling from an ambient plasma. For 50 GeV neutrino the\ntemperature of decoupling is estimated as Td ∼ 20 MeV, whereas the mass MN min ∼ 0.6 × 10−6 M⊙ (Eq(37) of\n[26]). Provide a dominant CDM component has a less free-streaming scale (that is, for instance, quite probable\nfor neutralinos and heavy gravitinos), there would exist the clumps with masses in the range Mclump > Mmin\nso that Mmin < MN min (for neutralino Mmin is estimated as ∼ 10−8 M⊙ [26]). For Heavy neutrinos the ranges\nof clump masses are Mmin < Mclump < MN min and Mclump > MN min . Creation of clumps only of the second\nmass range is not expected to proceed with a separation of the dominant CDM component and Heavy neutrinos.\nWe will suppose a conservation of proportionality (ratio) between densities of dominant CDM component and\nHeavy neutrinos in a such clump creation. Clumps lighter than MN min , if they are, can be populated by Heavy\nneutrinos in less degree in accordance with the mechanism of adiabatic loss of energy by collisionless particles\n(neutrinos) in an external variable gravitation field [27].\nEstimations of [26] for the enhancement factor of dominant DM annihilation flux due to the presence of\nclumps can be applied to Heavy neutrinos. This factor is defined as\nη=\n\nIclump + Ihom\nIhom\n\n(12)\n\nwhere Iclump and Ihom are the intensities of annihilation fluxes from clumps of DM and homogeneously distributed DM. It crucially depends on minimal mass of clumps, η(Mmin ), the lightest clumps give the main\ncontribution into an annihilation rate. Under assumption on proportionality between densities the predictions\nfor enhancement factor can be referred to non-dominating Heavy neutrinos DM assuming the minimal clump\nmass to be MN min\n(13)\nηN = η(MN min ).\nNote, that Fig.1 implies some deviation from such proportionality within a factor 1-100 at m = 50 GeV for\nan average local density (which is deduced from dynamical observation to be within 0.17-1.7 GeV/cm3 ), if real\nlocal density (in vicinity of the Earth) does not differ significantly from the average one.\nAdditional contribution into an enhancement of the neutrino annihilation rate will result from the clumps\nwith a mass in the range Mmin − MN min . The enhancement from these clumps can be roughly estimated\nas a corresponding estimation in [26] for Mmin reduced with respect to smaller relative compression of Heavy\nneutrino density inside the given clumps as compared to that of dominant DM. In each such clump the relative\ncompression of neutrino density, i.e. the ratio of densities inside a clump and outside it (of homogeneous\ncomponent near the clump), should be smaller than that of dominant component of matter (CDM) in accordance\nwith [27]\n\u00133/4\n\u0012\nρN clump\nρCDM clump\n=\n.\n(14)\nρN hom\nρCDM hom\nAs a first approximation we neglect details (differences) of density distributions of dominant component and\nHeavy neutrinos inside these clumps. So, the factor η is determined by squared ratio of densities above both for\nHeavy neutrinos and for CDM. The enhancement factor for Heavy neutrinos for a clump mass between Mmin\nand MN min can be estimated as\nηN add = η(Mmin )3/4 ,\n(15)\nwhere η(Mmin ) is the enhancement factor as predicted in [26] (for dominant DM component).\n11\n\n\fgamma\n1\n\nhalo\nGC\n\nlocal density fraction xiloc\n\ne+\np0.1\n\n0.01\nDAMA favourable region\n\n0.001\n\n50\n\n60\n70\nNeutrino mass, GeV\n\n80\n\n90\n\nFigure 7: Effect of neutrino clumpiness. All notations are analogous to those of fig. 6.\n\nFactor η increases with a decrease of clump mass [26], so a contribution from the clumps of mass Mmin <\nMclump < MN min , which are relatively less populated by Heavy neutrinos, can be comparable with those of\nmass Mclump > MN min . For instance, for an index of primeval perturbation spectrum np = 1.05, index of\npower-like density distribution inside the clump β = 1.8 at MN min = 0.6 × 10−6 M⊙ we have ηN ≈ 20 (see\nFig.5 of [26]), and assuming Mmin = 10−8 M⊙ we obtain ηN add ≈ (30)3/4 ≈ 13. For essentially smaller values\nof Mmin the contribution from clumps with Mmin < Mclump < MN min is turned out to prevail.\nA density parameter ξloc should decrease as a square root of enhancement factor ηN , so in example above\nwe get ξloc by a factor 5 less at 50 GeV than it is in Fig.6. For other values of neutrino mass of interest the\nresult is virtually the same. An agreement between measurement of DAMA/NaI and CR observation data is\npossible for the hypothesis of 4th neutrino with Evan's halo model within allowed neutrino mass range below\n50 GeV (see Fig.7).\nNote that in our approximation we did not pay attention to a correction for given quantitative estimations of\nan effect of clumps due to a different DM density distribution in Galaxy (Evan's) than it was supposed in [26].\nAlso note, that a destruction of clumps near GC [26] should partially decrease the enhancement of annihilation\nγ-flux from GC due to clumps. This may improve agreement between results for photons from GC and the\nhalo.\nIn the case if a minimal possible DM clump mass, Mmin , is greater than MN min (there is only a unique\nmass range), then the enhancement factor would be given by Eq(13) with Mmin instead of MN min .\n\n5.2\n\nAmplification of neutrino annihilation due to new Coulomb-like interaction\n\nAn annihilation signal as a signature of existence of DM particles like Heavy neutrinos implies a condition of\nthe presence of both particles and antiparticles. The case considered in the present article was based on an\nassumption of charge symmetry of 4th generation particles, i.e. an equality between the numbers of primordial\n4th neutrinos and antineutrinos. Such a statement can find physical foundation in superstring models. New\ncharge(s) is(are) predicted there which, being strictly conserved, can be ascribed only to 4th generation particles\n[28]. It accounts for absolute stability of the lightest particle bearing this charge (assumed to be the 4th neutrino)\nand an equality between particles and antiparticles of a new generation.\nAn important consequence of a new charge is an effect of new interaction. In a wide class of models this\ncharge is U (1)-gauge charge which leads to existence of corresponding massless gauge bosons (y-photons) and to\na Coulomb-like interaction of 4th neutrinos. It was revealed in [29], that this new interaction does not influence\n12\n\n\fgamma\n1\n\nhalo\nGC\n\nlocal density fraction xiloc\n\ne+\np0.1\n\n0.01\nDAMA favourable region\n\n0.001\n\n50\n\n60\n70\nNeutrino mass, GeV\n\n80\n\n90\n\nFigure 8: Effect of neutrino Coulomb-like new interaction. All notations are analogous to those of fig. 6.\n\nsignificantly the results of 4th neutrino freezing out in early Universe, but it can increase their annihilation signal\nin Galaxy by a few hundred times. The matter is that in the considered range of neutrino masses ordinary\nelectroweak Z-bozon resonance annihilation channel dominates over the new channel of 2yannihilation and the\nmain effect of new interaction is Coulomb-like factor in the cross sections of slow charged particles. Such factor,\nC, first deduced by A.Sakharov [30] for Coulomb interaction of slow electrically charged particles, in the case\nof Coulomb-like interaction with \"fine structure constant\" αy ∼ 1/137 − 1/14 has the form [29]\nC=\n\n2παy c/v\n,\n1 − exp(−2παy c/v)\n\n(16)\n\nwhere c is the speed of light and v is the relative velocity of charged particles. At v/c ≥ 1/10, what is the case\nfor the period of 4th neutrino freezing out in the early Unvierse, this factor is close to 1, but for v/c ≪ 1, being\nthe case for neutrinos in Galaxy, it increases their annihilation rate by the factor of Sakharov's enhancement\n[29]\n\u0013\u0012\n\u0013\n\u0012\nc\n300 km/s\nαy\nC(v) = 2παy ≃ 102\n.\n(17)\nv\n1/60\nv\nIt would provide a decrease of predicted the best-fit ξloc parameters as square root of that enhancement\n(being properly averaged over velocity distribution). The account for this new Coulomb-like interaction,\npossessed by 4th neutrinos, extends the possibility of unified explanation of CR and DAMA/NaI data in the\nframework of 4th neutrino hypothesis for the most part of considered interval of neutrino masses. Figure 8\ncorresponds to the case of αy = 1/30, which is the most natural value for this coupling constant.\nThe case of clumpiness of Heavy neutrinos with new interaction, while being possible, is more complex\nand involves both factors (η and αy ). Its combined role will offer more tunable scenarios; however for sake of\nsimplicity we wil not take it into account here.\nOn the first sight Sakharov's enhancement does not influence the annihilation rate of accumulated 4th\nneutrinos inside the Earth and Sun, which is defined by their capture rate. However, the existence of stable\nquark of 4th generation can make the picture more complicated. Being compatible [28] with the constraints on\nthe abundance of anomalous isotopes, the presence of small amount of anomalous hadrons, containing this quark\n(or antiquark) and possessing the U (1)-gauge charge can cause asymmetry in capture rates for 4th neutrino\nand antineutrino and thus influence their annihilation rate in Earth and Sun. A role of this gauge interaction,\nits charges and field in effects of Heavy neutrinos as well as the account of possible existence of stable 4th\ngeneration hadrons requires a separate discussion.\n\n13\n\n\f5.3\n\nThe role of Heavy neutrino asymmetry and decays\n\nIf neutrinos of 4th generation do not possess new U (1)-gauge charge, there does not appear any fundamental\nreason for their absolute stability as well as for their strict charge symmetry. If charge symmetry is absent,\nwhich is the case for baryons in the Universe, the 4th neutrinos would prevail over their antineutrinos (or vise\nversa) and they could decay. A magnitude of this asymmetry, being defined as the ratio of difference of present\nnumber densities of 4th neutrinos and 4th antineutrinos (δn) and present relic photon number density, is an\nadditional parameter of the problem.2 This parameter should be much less than that of baryons in order not to\nexceed an essentially relative contribution of 4th neutrino into the density of CDM derived from measurements\nof DAMA (Fig.1). A difference δn ∼ a few × nsym , where nsym is the relic Heavy neutrino density in the case of\ncharge symmetry, leads to an increase of relic 4th neutrino density by a few times and to an exponential decrease\nof density of relic 4th antineutrinos by a few orders of magnitude. As seen in Fig.1 this would be especially\nfavored for neutrino mass around 50 GeV. If relic neutrinos survive to present time, their annihilation signals\nfrom Galaxy and from the Earth and Sun weaken by a few orders of magnitude as compared to the symmetric\ncase.\nHowever, in the asymmetric case another signature of 4th neutrino DM in CR is possible. Neutrinos of 4th\ngeneration are unstable in this case and their decays in the galactic halo can lead to effects similar to the ones\nfrom stable neutrino annihilation. In this case CR data can be reproduced, if 4th neutrino decay lifetime is, for\nEvan's density distribution,\n50 GeV\n.\n(18)\nτ ≈ ξloc * (0.2 − 2) × 1019 years\nm\nHere ξloc is the local density fraction of neutrinos in charge asymmetric case. The value of the decay rate\npreferable for CR data changes weakly with variation of neutrino mass (since it is defined by the observed\nCR fluxes), so uncertainty 0.2-2 in estimation (18) is mainly induced by uncertainty of best-fit ξloc parameters\ndeduced from data of different CR species (for Evan's halo model). Note that there is a difference by a factor 2\nin energy release for annihilation reaction and decay process. But in the numerical estimations for the effects of\ndecay the predictions for CR fluxes, induced by neutrino annihilation, can be used without significant change\nwith only proper account for the change in the energy release, provided that hadron modes are present in\ndecay with sufficient probability. Parameter ξloc ≈ 0.01 − 0.001 would provide for neutrino of mass about 47-70\nGeV with the lifetime given above an agreement between the measurement of DAMA/NaI and CR data. So,\npreferable lifetime of 4th neutrino is τ ∼ (2 × 1015 − 2 × 1017 ) years. Note, that clumpiness does not affect the\nfluxes of products of Heavy neutrino decay in the Galaxy. Also note, that the annihilation rate of neutrinos\naccumulated inside the Earth and Sun in the symmetric case corresponds to a timescale less than the age of\nSolar system (much less in case of the Sun). So the decay rate with the lifetime above (18) is strongly suppressed\nas compared to a corresponding annihilation rate for the symmetric case.\n\n6\n\nConclusions\n\nIn the present work it was shown that the positive result at 6.3 sigma C.L. obtained in DAMA/NaI and\nobserved possible excesses in cosmic gamma-radiation, positrons and antiprotons can be in agreement within\nthe framework of hypothesis of a 4th neutrino mass hidden nearby half the Z-boson mass. The evident advantage\nof this hypothesis is the minimal number of physical parameters. In the simplest case it is only the mass of\nneutrino (to be compared with minimally 5 parameters in the case of SUSY dark matter).\nBut even in this simplest case we have revealed the complex model dependence on the galactic mass distribution and cosmic ray diffusion. We have shown its compatibility within realistic values of Heavy neutrino\nmass. The model may be naturally extended in the case of in-homogeneous (clumpy) galactic halo, new Heavy\nneutrino Interactions related to its necessary stability, relic neutrino asymmetry and it consequent unstability\nand decay. In those models there are room for better agreement between underground and cosmic rays signals.\n2 In the case of light neutrinos, which decouple in the conditions of thermodynamical equilibium, such asymmetry would determine\ntheir chemical potential (see review in [31]).\n\n14\n\n\fThe lightest neutrino masses (∼ 50 GeV) might be searched inside the old LEP data regarding electron pair\nannihilations into one photon with missing energy [32]; the largest ones (∼ 57 − 75 GeV) might be discovered\nby near future LHC search of invisible Higgs boson decay[33]. Additional satellites and antimatter search in\nSpace might define the exact parameter range for this extension of the lepton sector, whose existence might be\ntested also in the search for a novel pair of 4th quark family[34].\n\n7\n\nAcknowledgment\n\nWe are grateful to R.Bernabei, P.Belli and D.Prosperi for important discussions. K.B. thanks Universita' di\nRoma \"Tor Vergata\", INFN section Roma2 and Universita di Roma' \"La Sapienza\" for their support and\nhospitality and K.I. Shibaev for the help. M.Kh. is grateful to Abdus Salam ICTP (Trieste) for hospitality.\nThis work was supported in part by grant RFBR 02-02-17490 and by the Federal Program of the Russian\nMinistry of Industry, Science and Technology 40.022.1.1.1106.\n\nReferences\n[1] R. Bernabei et al., Riv. Nuovo Cim. 26 n.1 (2003) 1; astro-ph/0307403 and references therein.\n[2] D. Fargion, M.Yu. Khlopov, R.V. Konoplich and R. Mignani, JETP Lett. 68 (1998), 685;\nD. Fargion, R. Konoplich, M. Grossi, M. Khlopov, astro-ph/9902327;\nD. Fargion, et al., JETP Lett. 69 (1999), 434 ; astro-ph-9903086.\n[3] K.M. Belotsky, M.Yu. Khlopov, Gravitation and Cosmology Suppl. 8 (2002), 112.\nK.M. Belotsky, M.Yu. Khlopov, \"Non-dominating heavy neutrino dark matter\", Proceedings of XVth\nconference \"Physical cosmology\" in Blois (2003).\n[4] M. Maltoni et al., Phys. Lett. B476 (2000), 107;\nV.A. Ilyin et al., Phys. Lett. B503 (2001), 126;\nV.A. Novikov et al., Phys. Lett. B529 (2002) 111; JETP Lett. 76 (2002), 119.\n[5] R. Foot, Phys. Rev. D69 (2004), 036001; [hep-ph/0308254]; R. Foot, astro-ph/0403043.\n[6] D. Fargion, B. Mele, A. Salis, Astrophys. J. 517 (1999), 725.\n[7] V.K. Dubrovich, D. Fargion and M.Yu. Khlopov, Astropart. Phys. 22 (2004), 183.\n[8] A. Datta, D. Fargion, B. Mele, hep-ph/0410176.\n[9] I. Moskalenko, A. Strong, A.J. 493 (1998), 694; A. Strong, I. Moskalenko, A.J. 509 (1998), 212.\n[10] A. Strong, I. Moskalenko, O. Reimer, A.J. 537 (2000), 763; astro-ph/9811296.\n[11] A.Strong, I. Moskalenko, O. Reimer, M. Potgieter, A.J. 565 (2002), 280; astro-ph/0106567.\n[12] P. Belli et.al., Phys. Rev. D66 (2002), 043503.\n[13] J.F. Navarro, C.S. Frenk, S.D.M. White, A.J. 462 (1996), 563.\n[14] A. Strong, I. Moskalenko, O. Reimer, astro-ph/0306345.\n[15] D. Elsäesser, K. Mannheim, submitted to Physical Review Letters; astro-ph/0405235.\n[16] L.J. Gleeson, W.I. Axford, A.J. 154 (1968), 1011.\n[17] D. Casadei, V. Bindi, astro-ph/0302307.\n\n15\n\n\f[18] V.S. Berezinskiy, S.V. Bulanov, S.V. Dogiel, V.L. Ginzburg, V.S. Ptuskin, Astrophysics of Cosmic Rays\n(Amsterdam: North Holand, 1990)\n[19] M. Kamionkowski and M. S. Turner, Phys. Rev. D 43 (1991), 1774.\n[20] I. Moskalenko, A. Strong, Phys. Rev. D (1999); astro-ph/9905283;\nI. Moskalenko, A. Strong, Proceedings of 26th ICRC (Salt Lake City, 1999); astro-ph/9906230.\n[21] A.Strong, I.Moskalenko, Proceedings of 3d INTEGRAL Workshop \"The Extreme Universe\", 14-18 Sep.\n1998, Taormina, Italy; astro-ph/9811221.\n[22] M.A. DuVernois et.al., A.J. 559 (2001), 296-303.\n[23] S. Orito et.al., Phys. Rev. Lett. 84 (2000), 1078; astro-ph/9906426.\n[24] T. Maeno et.al., Astropart. Phys. 16 (2001), 121-128; astro-ph/0010381.\n[25] R.V. Konoplich, M.Yu. Khlopov, Yad.Fiz. 57 (1994), 452;\nYu.A. Golubkov, R.V. Konoplich, Yad.Fiz. 61 (1998), 675; Phys.Atom.Nucl. 61 (1998), 602\n[26] V. Berezinsky, V. Dokuchaev, Yu. Eroshenko, astro-ph/0301551.\n[27] Ya.B. Zeldovich, M.Yu. Khlopov, A.A. Klypin, V.M. Chechetkin, Yad.Fiz. 31 (1980), 1286.\n[28] M.Yu. Khlopov and K.I. Shibaev, Grav.& Cosmol. Suppl. 8 N1 (2002), 45.\n[29] K.M. Belotsky, M.Yu. Khlopov, K.I. Shibaev, Grav.& Cosmol. Suppl. 6 (2000), 140.\n[30] A.D. Sakharov, ZhETF 18 (1948), 631; Reprinted in Sov. Phys. Usp. 34 (1991), 375.\n[31] A.D. Dolgov Phys.Rept. 370 (2002), 333; hep-ph/0202122.\n[32] D.Fargion, M.Khlopov, R.V.Konoplich and R.Mignani, Phys. Rev. D54 (1996), 4684.\n[33] K.M.Belotsky, D. Fargion, M.Khlopov, R. Konoplich, K.Shibaev, Phys.Rev. D68 (2003), 054027;\nhep-ph/0210153.\n[34] K.M.Belotsky, D. Fargion, M.Khlopov, R. Konoplich, M.Ryskin, K.Shibaev,Grav.& Cosmol. Suppl.\n(2005). Invited talk at Cosmion 2004, Moscow-St.Petersburg-Paris(Meudon) 2-16,20-24 September 2004.\n\n16\n\n\f"}