{"id": "http://arxiv.org/abs/hep-ph/0105227v1", "guidislink": true, "updated": "2001-05-22T13:46:42Z", "updated_parsed": [2001, 5, 22, 13, 46, 42, 1, 142, 0], "published": "2001-05-22T13:46:42Z", "published_parsed": [2001, 5, 22, 13, 46, 42, 1, 142, 0], "title": "Spectral moments of two-point correlators in perturbation theory and\n  beyond", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0105137%2Chep-ph%2F0105003%2Chep-ph%2F0105080%2Chep-ph%2F0105293%2Chep-ph%2F0105028%2Chep-ph%2F0105012%2Chep-ph%2F0105237%2Chep-ph%2F0105010%2Chep-ph%2F0105115%2Chep-ph%2F0105008%2Chep-ph%2F0105026%2Chep-ph%2F0105072%2Chep-ph%2F0105170%2Chep-ph%2F0105186%2Chep-ph%2F0105138%2Chep-ph%2F0105113%2Chep-ph%2F0105243%2Chep-ph%2F0105242%2Chep-ph%2F0105039%2Chep-ph%2F0105213%2Chep-ph%2F0105158%2Chep-ph%2F0105333%2Chep-ph%2F0105163%2Chep-ph%2F0105307%2Chep-ph%2F0105103%2Chep-ph%2F0105142%2Chep-ph%2F0105141%2Chep-ph%2F0105309%2Chep-ph%2F0105253%2Chep-ph%2F0105152%2Chep-ph%2F0105284%2Chep-ph%2F0105212%2Chep-ph%2F0105318%2Chep-ph%2F0105018%2Chep-ph%2F0105049%2Chep-ph%2F0105270%2Chep-ph%2F0105084%2Chep-ph%2F0105096%2Chep-ph%2F0105123%2Chep-ph%2F0105019%2Chep-ph%2F0105109%2Chep-ph%2F0105289%2Chep-ph%2F0105126%2Chep-ph%2F0105156%2Chep-ph%2F0105258%2Chep-ph%2F0105271%2Chep-ph%2F0105255%2Chep-ph%2F0105160%2Chep-ph%2F0105122%2Chep-ph%2F0105299%2Chep-ph%2F0105292%2Chep-ph%2F0105100%2Chep-ph%2F0105216%2Chep-ph%2F0105159%2Chep-ph%2F0105300%2Chep-ph%2F0105227%2Chep-ph%2F0105256%2Chep-ph%2F0105208%2Chep-ph%2F0105034%2Chep-ph%2F0105230%2Chep-ph%2F0105167%2Chep-ph%2F0105146%2Chep-ph%2F0105225%2Chep-ph%2F0105090%2Chep-ph%2F0105319%2Chep-ph%2F0105269%2Chep-ph%2F0105205%2Chep-ph%2F0105070%2Chep-ph%2F0105345%2Chep-ph%2F0105201%2Chep-ph%2F0105179%2Chep-ph%2F0105065%2Chep-ph%2F0105143%2Chep-ph%2F0105005%2Chep-ph%2F0105064%2Chep-ph%2F0105061%2Chep-ph%2F0105241%2Chep-ph%2F0105134%2Chep-ph%2F0105334%2Chep-ph%2F0105297%2Chep-ph%2F0105161%2Chep-ph%2F0105047%2Chep-ph%2F0105155%2Chep-ph%2F0105275%2Chep-ph%2F0105120%2Chep-ph%2F0105343%2Chep-ph%2F0105116%2Chep-ph%2F0105171%2Chep-ph%2F0105349%2Chep-ph%2F0105097%2Chep-ph%2F0105189%2Chep-ph%2F0105264%2Chep-ph%2F0105226%2Chep-ph%2F0105220%2Chep-ph%2F0105302%2Chep-ph%2F0105278%2Chep-ph%2F0105055%2Chep-ph%2F0105251%2Chep-ph%2F0105328%2Chep-ph%2F0105200%2Chep-ph%2F0105337&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Spectral moments of two-point correlators in perturbation theory and\n  beyond"}, "summary": "We discuss the choice of weight functions for the moments of the spectral\ndensity for two-point correlators of hadronic currents over a finite energy\ninterval. Of phenomenological relevance is an analysis of the spectra of tau\nlepton decay on the energy interval [0,M_tau] and the low-energy hadron\nproduction in e+ e- annihilation. General arguments are given for the\ncalculability of such moments in perturbation theory using both a finite-order\nanalysis and infinite resummation on the contour. Nonperturbative contributions\nemerging from the operator product expansion for two-point correlators are\ndiscussed within explicit models for the physical spectra. The quantitative\nanalysis strongly disfavours weight functions that suppress the high-energy\ncontribution to theoretical moments. This is in agreement with expectations\nfrom qualitative considerations in perturbative QCD with asymptotic freedom. We\ndiscuss the implication of our results for the ultimate accuracy that can be\nreached in tau decays and low-energy e+ e- annihilation into hadrons with\npresent experimental data.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0105137%2Chep-ph%2F0105003%2Chep-ph%2F0105080%2Chep-ph%2F0105293%2Chep-ph%2F0105028%2Chep-ph%2F0105012%2Chep-ph%2F0105237%2Chep-ph%2F0105010%2Chep-ph%2F0105115%2Chep-ph%2F0105008%2Chep-ph%2F0105026%2Chep-ph%2F0105072%2Chep-ph%2F0105170%2Chep-ph%2F0105186%2Chep-ph%2F0105138%2Chep-ph%2F0105113%2Chep-ph%2F0105243%2Chep-ph%2F0105242%2Chep-ph%2F0105039%2Chep-ph%2F0105213%2Chep-ph%2F0105158%2Chep-ph%2F0105333%2Chep-ph%2F0105163%2Chep-ph%2F0105307%2Chep-ph%2F0105103%2Chep-ph%2F0105142%2Chep-ph%2F0105141%2Chep-ph%2F0105309%2Chep-ph%2F0105253%2Chep-ph%2F0105152%2Chep-ph%2F0105284%2Chep-ph%2F0105212%2Chep-ph%2F0105318%2Chep-ph%2F0105018%2Chep-ph%2F0105049%2Chep-ph%2F0105270%2Chep-ph%2F0105084%2Chep-ph%2F0105096%2Chep-ph%2F0105123%2Chep-ph%2F0105019%2Chep-ph%2F0105109%2Chep-ph%2F0105289%2Chep-ph%2F0105126%2Chep-ph%2F0105156%2Chep-ph%2F0105258%2Chep-ph%2F0105271%2Chep-ph%2F0105255%2Chep-ph%2F0105160%2Chep-ph%2F0105122%2Chep-ph%2F0105299%2Chep-ph%2F0105292%2Chep-ph%2F0105100%2Chep-ph%2F0105216%2Chep-ph%2F0105159%2Chep-ph%2F0105300%2Chep-ph%2F0105227%2Chep-ph%2F0105256%2Chep-ph%2F0105208%2Chep-ph%2F0105034%2Chep-ph%2F0105230%2Chep-ph%2F0105167%2Chep-ph%2F0105146%2Chep-ph%2F0105225%2Chep-ph%2F0105090%2Chep-ph%2F0105319%2Chep-ph%2F0105269%2Chep-ph%2F0105205%2Chep-ph%2F0105070%2Chep-ph%2F0105345%2Chep-ph%2F0105201%2Chep-ph%2F0105179%2Chep-ph%2F0105065%2Chep-ph%2F0105143%2Chep-ph%2F0105005%2Chep-ph%2F0105064%2Chep-ph%2F0105061%2Chep-ph%2F0105241%2Chep-ph%2F0105134%2Chep-ph%2F0105334%2Chep-ph%2F0105297%2Chep-ph%2F0105161%2Chep-ph%2F0105047%2Chep-ph%2F0105155%2Chep-ph%2F0105275%2Chep-ph%2F0105120%2Chep-ph%2F0105343%2Chep-ph%2F0105116%2Chep-ph%2F0105171%2Chep-ph%2F0105349%2Chep-ph%2F0105097%2Chep-ph%2F0105189%2Chep-ph%2F0105264%2Chep-ph%2F0105226%2Chep-ph%2F0105220%2Chep-ph%2F0105302%2Chep-ph%2F0105278%2Chep-ph%2F0105055%2Chep-ph%2F0105251%2Chep-ph%2F0105328%2Chep-ph%2F0105200%2Chep-ph%2F0105337&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We discuss the choice of weight functions for the moments of the spectral\ndensity for two-point correlators of hadronic currents over a finite energy\ninterval. Of phenomenological relevance is an analysis of the spectra of tau\nlepton decay on the energy interval [0,M_tau] and the low-energy hadron\nproduction in e+ e- annihilation. General arguments are given for the\ncalculability of such moments in perturbation theory using both a finite-order\nanalysis and infinite resummation on the contour. Nonperturbative contributions\nemerging from the operator product expansion for two-point correlators are\ndiscussed within explicit models for the physical spectra. The quantitative\nanalysis strongly disfavours weight functions that suppress the high-energy\ncontribution to theoretical moments. This is in agreement with expectations\nfrom qualitative considerations in perturbative QCD with asymptotic freedom. We\ndiscuss the implication of our results for the ultimate accuracy that can be\nreached in tau decays and low-energy e+ e- annihilation into hadrons with\npresent experimental data."}, "authors": ["S. Groote", "J. G. Körner", "A. A. Pivovarov"], "author_detail": {"name": "A. A. Pivovarov"}, "author": "A. A. Pivovarov", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.65.036001", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/hep-ph/0105227v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-ph/0105227v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "70 pages in LaTeX, 10 PostScript figures included in the text", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-ph/0105227v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-ph/0105227v1", "journal_reference": "Phys.Rev. D65 (2002) 036001", "doi": "10.1103/PhysRevD.65.036001", "fulltext": "MZ-TH/01-15\nhep-ph/0105227\nMay 2001\n\nSpectral moments of two-point correlators\n\narXiv:hep-ph/0105227v1 22 May 2001\n\nin perturbation theory and beyond\nS. Groote1, J.G. Körner1 and A.A. Pivovarov1,2\n1\n\nInstitut für Physik der Johannes-Gutenberg-Universität,\nStaudinger Weg 7, 55099 Mainz, Germany\n2\n\nInstitute for Nuclear Research of the\n\nRussian Academy of Sciences, Moscow 117312\n\nAbstract\nWe discuss the choice of weight functions for the moments of the spectral density for twopoint correlators of hadronic currents over a finite energy interval. Of phenomenological\nrelevance is an analysis of the spectra of τ lepton decay on the energy interval [0, Mτ ] and\nthe low-energy hadron production in e+ e− annihilation. General arguments are given for\nthe calculability of such moments in perturbation theory using both a finite-order analysis\nand infinite resummation on the contour. Nonperturbative contributions emerging from\nthe operator product expansion for two-point correlators are discussed within explicit\nmodels for the physical spectra. The quantitative analysis strongly disfavours weight\nfunctions that suppress the high-energy contribution to theoretical moments. This is in\nagreement with expectations from qualitative considerations in perturbative QCD with\nasymptotic freedom. We discuss the implication of our results for the ultimate accuracy\nthat can be reached in τ decays and low-energy e+ e− annihilation into hadrons with\npresent experimental data.\n\nPACS: 11.55.Hx, 12.38.Bx, 13.35.Dx, 02.70.Hm\nKeywords: hadronic correlators, spectral density, resummation techniques\n\n\f1\n\nIntroduction\n\nThe central quantities of interest for studying strong interactions in low-energy hadron phenomenology at accelerators are the spectra of produced particles as being related to the cross\nsection and described by spectral functions. The modern theory of strong interactions (QCD)\ndescribes the production processes within perturbative expansions in the strong coupling constant in terms of quarks and gluons and is unable to predict the low-energy hadron spectra\npointwise as functions of the energy. Only some integral characteristics of low-energy hadron\nspectra such as the average over an energy interval can be reliably calculated within perturbative QCD. Theoretically, the procedure of averaging is best justified for observables related\nto two-point correlators of hadronic currents with well established and simple analytic properties as functions of the energy. Phenomenologically, this is the case for e+ e− annihilation into\nhadrons and hadronic τ lepton decays where experimental data of high precision are available.\nThe process of e+ e− annihilation into hadrons has been a laboratory for studying strong\ninteractions since long ago where important results have been obtained (as a recent review, see\ne.g. Ref. [1]). As a famous example of such results one can mention the constraint on the number\nof colours Nc in QCD obtained from the normalized decay rate Re+ e− (s) of e+ e− annihilation\n√\ninto hadrons smoothed over a finite interval at low energies of about s ≈ 2 ÷ 3 GeV\n3\nNc = Re+ e− (s) (1 + O(αs )) ≈ 3\n2\nwhere αs is a strong coupling constant. During the last decade much attention has also been\npaid to a study of hadronic (semileptonic) τ lepton decays which provides a wealth of information on low-energy hadronic physics where the accuracy of experimental data is permanently\nimproving [2, 3]. This makes τ lepton physics an important area of high-precision particle\nphenomenology.\nIn the present paper we discuss in some detail the choice of the moments which are given\nby integrals of the spectral density over the energy range available in experiments. These\nintegrals may contain specific weight functions of different shape that determine the particular\nform of averaging and the kind of moments. The moments with suitable weight functions\ncan be computed theoretically in perturbative QCD while the detailed pointwise description\n2\n\n\fof low-energy spectral functions themselves as functions of the energy requires a quantitative\nunderstanding of the hadronization mechanism which is lacking at present, especially for light\nhadrons. The procedure of averaging, in its different modifications, is referred to as a property\nof duality between hadronic and quark-gluon spectra [4].\nWhile generating a particular set of the moments of the spectral density as observables\nto confronting theory with experiment, one faces the usual conflict between the precision requirements dictated by theory and experiment. In perturbative QCD a reliable computation\nis possible only at large energies where the perturbation series converges in a sense that a finite number of high-order corrections in the strong coupling constant (usually one or two) is\nconsidered to be numerically small because of the property of asymptotic freedom, so that the\nmoments which emphasize the high-energy part of the spectrum are most reliably calculated.\nHowever, such moments are not welcome from the experimental point of view because contributions coming from the high-energy part of the spectrum in the range 0 ≤ s ≤ Mτ2 usually\nhave got a poor experimental accuracy. On the other hand, moments which suppress the highenergy part of the spectrum are saturated by low-lying resonances or few-particle states which\nare easier to measure experimentally compared to the states with many particles. This gives\nrise to better experimental precision for such moments, which would induce on using these\nmoments for a theoretical analysis. However, the theoretical uncertainty for such moments is\nlarger because of both the poor convergence of the perturbation series due to the large value of\nthe effective coupling and the large nonperturbative contributions stemming from the infrared\nregion which are difficult to estimate quantitatively.\nThe semiphenomenological way for estimating the nonperturbative contributions based on\nthe operator product expansion (OPE) for two-point correlators is most advanced where the\nknowledge of the numerical values for a few low-dimension terms (gluon condensate and fourquark condensates) fixed from the data. Higher order terms of dimensionality larger than six are\nvirtually unknown; the numerical values that are commonly used derive from some approximations (mainly the factorization into condensates of lower dimensionality) or models (instantons\nfor gluonic condensates) with theoretical uncertainties being scattered over a wide range with\nrather hypothetical justification in the literature. This makes the estimate of contributions of\n\n3\n\n\fnonperturbative terms of higher orders rather imprecise.\nNowadays it is a general trend to consider restrictions imposed by perturbation theory convergence to become more important than those coming from nonperturbative terms. With the\nknowledge of higher and higher order terms of the perturbation series the asymptotic character\nof perturbation theory is more and more pronounced which forces one to move the renormalization point to larger and larger energies. In this region nonperturbative terms die out fast\nbecause being power corrections they decrease faster than the terms of the logarithmic perturbation series. On the other hand, power corrections reveal the general structure of observables\ncomputed in QCD, i.e. they account for nonperturbative effects. In this circumstances there is a\ntendency to introduce power corrections almost by brute force in case where OPE is not directly\napplicable because their existence seems to be justified by general principles. Even though the\nmotivation for such a development is clear, the present state of the analysis is definitely far\nfrom being quantitative. The obstacle is also that this kind of analysis is infrared dependent,\ni.e. it depends on the properties of strong interactions at small energies where perturbation\ntheory – the only universal tool of quantitative investigation – is not applicable. This fact\nmakes conclusions based on power corrections depend on the particular model or convention\n(for instance on a recipe of resummation).\nThe main purpose of this paper is to give explicit arguments and quantitative estimates for\nthe calculability of the moments of two-point correlators in perturbative QCD and to find a\ncompromise choice of weight functions for the moments that optimizes the precision comparison\nof theoretical input with experimental data. To be specific, we are talking about the precision\nanalysis of τ lepton decays having been of much interest recently where experimental data are\nvery good. Therefore, we concentrate on the aspects of accuracy of theoretical calculations for\nthe QCD part of the differential τ lepton decay rate and its moments. It is the high precision\nachieved in the experimental analysis of τ decays and the rather advanced stage of theoretical\ndescription that calls for a critical examination of the theoretical formulae used in the analysis\nof the physics of the τ system. In particular the criteria of reliability of theoretical formulae\nshould be considered carefully. The quantitative discussion of this issue is possible because\nof the simplicity of the Green's functions necessary to describe the process – only two-point\n\n4\n\n\fcorrelators depending on one single energy variable are relevant. The analytic properties of the\ntwo-point correlators in the energy variable are strictly fixed from general principles of quantum\nfield theory. An additional simplification for the renormalization group analysis is provided by\nthe fact that only one scale is involved in the theoretical description.\nTheoretical calculations for the τ system can be done within OPE for two-point correlators\nwhich contain perturbative and power corrections. Perturbation theory can then be further\nimproved using methods of summation of an infinite number of terms within the renormalization\ngroup. We consider these steps in turn. In Sec. 2 we give the basic ideas and fix the notation. In\nSec. 3 we consider finite-order perturbation theory, in Sec. 4 we consider power corrections. As\nan important phenomenological example we consider some peculiarities related to quark mass\ncorrections to current correlators which are important for the determination of the strange\nquark mass (Sec. 5). In Sec. 6 we consider the infinite resummation of perturbative terms\ngenerated by the running of the coupling constant within a renormalization group approach.\nSec. 7 contains our conclusions.\n\n2\n\nSetting the stage: details of the theoretical description\n\nHaving described the motivation of our work which is rather general and valid for two-point\ncorrelators of hadronic currents, we now give the specific details for the description of τ decay\nobservables. Similarities to the e+ e− annihilation into hadrons are obvious and applications to\nother hadronic channels are straightforward. In this section we mainly fix our notation; the\nconsideration is rather standard and can be found in the numerous literature on this subject [5,\n6].\nThe semileptonic (hadronic) τ lepton decay is mediated by the charged weak hadronic\ncurrent of the form\njμw (x) = Vud ūγμ (1 − γ5 )d + Vus ūγμ (1 − γ5 )s\n\n(1)\n\nwhere Vud and Vus are Cabibbo-Kobayashi-Maskawa matrix elements (elements of the weak\nmixing matrix). The correlator for the weak hadronic currents in Eq. (1) has the general form\nΠμν (q 2 ) = 12π 2 i\n\nZ\n\nhT jμ (x)jν† (0)ieiqx dx = qμ qν Πq (q 2 ) + gμν Πg (q 2 )\n5\n\n(2)\n\n\fwhere Πq (q 2 ) and Πg (q 2 ) are invariant scalar functions. These scalar functions are further\nspecified depending on which current is considered. In case of the (ūd) quark current jμ (x) =\nūγμ (1 − γ5 )d (denoted as light quark case) the massless limit is assumed in which case the\ncorrelator is transverse, i.e. both invariant functions Πq,g (q 2 ) are expressible through a single\nscalar correlator function Πud (q 2 )\nΠq (q 2 ) = Πud (q 2 ),\n\nΠg (q 2 ) = −q 2 Πud (q 2 ).\n\n(3)\n\nThe correlator in case of the (ūs) quark current (the term proportional to Vus , also referred\nto as the strange quark case) is slightly different as the nonvanishing strange quark mass is\ntaken into account. The relevant formulae are given e.g. in Refs. [6, 7, 8]. We will discuss the\nstrange case later. The rest of the consideration is rather similar to the light quark case. We\nskip the specification (ūd) in the following and use Πud (q 2 ) ≡ Π(q 2 ). We mention that we work\nwithin QCD with three light quarks and do not consider corrections due to heavy quarks (c\nquark) which would enter the calculation at high orders of perturbation theory through loop\neffects [9, 10, 11]. In addition to the different current specifications as in Eqs. (1) and (3) it is\nconvenient to consider the vector and axial parts of the correlator separately,\nΠV +A (q 2 ) = ΠV (q 2 ) + ΠA (q 2 )\n\n(4)\n\nwith ΠV (q 2 ) beging related to the pure vector part and ΠA (q 2 ) related to the pure axial part.\nWe introduce the spectral density of a correlator as the discontinuity across the physical cut,\nρ(s) =\n\n1\n1\nDisc Π(s) =\n(Π(s + i0) − Π(s − i0)),\n2πi\n2πi\n\ns>0\n\n(5)\n\nwhich splits into vector and axial-vector parts accordingly,\nρV +A (s) = ρV (s) + ρA (s).\n\n(6)\n\nHere we mainly concentrate on the massless limit for the correlator. The case of the strange\nquark with nonvanishing mass will be discussed later. In the following the indices V and A\nwill be omitted in the generic case as well if no confusion arises. The correlator in Eq. (2) is\nnormalized to the number of colours Nc (the same holds true for the spectral density which\nmeans that ρ(s) → Nc for s → ∞) in the leading parton model approximation with massless\n6\n\n\fquarks. In the following we will occasionally use also a slightly different normalization which\nexplicitly accounts for the number of colours, resulting in a correlator which is normalized to\nunity.\nThe above considerations are general and are also used by experimentalists to classify the\nappropiate channels: strange particles (K mesons) form the strange channel, non-strange axialvector mesons (as a1 and the like) form the axial-vector channel, and the classical vector meson\nρ represents the non-strange vector channel. In this respect the pion is somewhat special. It is\na Goldstone boson with spin zero and gives a contribution to the axial correlator ΠA (q 2 ) in the\nmassless limit.\nBefore specifying the theoretical calculations we give the general form of an important\nobservable of τ decays. The basic observable is the normalized τ lepton decay rate for the\ndecay of the τ lepton into hadrons written in the standard form as\nRτ =\n\n\u0010\n\u0011\nΓ(τ → hadrons + ντ )\n= Nc SEW |Vud |2 (1 + δud ) + |Vus |2 (1 + δus ) .\nΓ(τ → l + ν̄l + ντ )\n\n(7)\n\nThe leading terms in Eq. (7) are the parton model results while the terms δud and δus represent\nthe effects of QCD interactions and mass effects (in case of nonvanishing quark masses) [12, 13,\n14, 15, 16]. Vud and Vus are matrix elements of the weak mixing matrix as defined in Eq. (1),\nand SEW describes the electroweak radiative corrections to the τ decay rate [17]. Now we take\na deeper look into the physics of hadronic τ decays. In the massless limit the expression for\nthe τ decay rate relevant for the QCD part of the quark current is given by the phase-space\nintegral\nRτQCD\n\n= Nc\n\nZ\n\n0\n\nMτ2\n\ns\n1− 2\nMτ\n\n!2\n\n!\n\ns\nds\n1 + 2 2 ρV +A (s) 2 .\nMτ\nMτ\n\n(8)\n\nThe spectral density ρ(s) is related to Adler's function D(Q2 ) through the dispersion relation\nZ\nρ(s)ds\nd\n2\n2\nΠ(Q ) = Q\nD(Q ) = −Q\n2\ndQ\n(s + Q2 )2\n2\n\n2\n\n(9)\n\nwhere Q2 = −q 2 . At this point theory enters. It is Adler's function D(Q2 ) that is most\nconvenient to compute theoretically in the Euclidean domain. It allows one to theoretically\npredict τ observables through a theoretically computable spectral density ρ(s). Still, to extract\nthe theoretical prediction for ρ(s) from D(Q2 ) is not straightforward. The point is that D(Q2 )\nis only known as an asymptotic expansion at large Euclidean values Q2 while ρ(s) is obtained\n7\n\n\fFigure 1: experimentally measured values for the relative cross section in the e+ e− channel,\nthe data set is taken from Ref. [18].\nas a discontinuity of the correlator across the physical cut. Therefore, an analytic continuation\ninto the complex q 2 -plane is necessary. Analytic continuation is an improperly posed problem,\ni.e. small errors in the initial function D(Q2 ) can produce big errors in ρ(s). This instability\nis especially important for a theoretical computation of ρ(s) at low energies. This situation\ncan also be reformulated in the language of integral equations. The dispersion relation in\nEq. (9) gives the spectral density ρ(s) through Adler's function D(Q2 ) as a solution of the\nintegral equation. The integral equation given by Eq. (9) is a Fredholm integral equation of\nthe second kind which is known to lead to an improperly posed problem. Thus, errors for the\nfunction ρ(s) (as solution of this integral equation) are not continuously related to errors for\nD(Q2 ) (as initial data of the integral equation) and can be very large. The general procedure\nof constructing approximate solutions for such a problem was suggested by Tikhonov and is\nknown as smoothing. Averaging the spectral density over a finite energy interval (as in sum\nrules that correspond to the duality concept) can be considered as a particular realization of\nTikhonov's smoothing procedure.\nThe function ρ(s) at low energies is the main object entering Eq. (8), therefore we want to\nconcentrate our studies on it. The counterpart of ρ(s) on the experimental side is the hadronic\nspectral density ρhad (s) which can be measured in τ decays in the finite squared energy interval\n[0, Mτ2 ] with Mτ = 1.777 GeV [3]. The hadronic spectral density ρhad (s) is a rapidly varying\n8\n\n\ffunction in the vicinity of resonances (for the experimental data set in the vector channel see\ne.g. Fig. 1), therefore there is no hope that one is able to compute this function theoretically\npointwise within perturbation theory. This fact is related to the so-called confinement (or\nhadronization) problem. Instead of a pointwise description of the spectrum at low energies, the\nappropriate quantities to be analyzed theoretically in perturbative QCD are the moments or\nintegrals of the spectrum with a complete set of weight functions.\nWe define moments of the spectral density by\nMl = (l + 1)\n\nZ\n\n0\n\nMτ2\n\nρ(s)\n\nsl ds\n=: 1 + ml .\n(Mτ2 )l+1\n\n(10)\n\nThe factor (l+1) in the definition of the moments is chosen to have all contribution of the parton\npart uniformly normalized to unity, as it is written explicitely in Eq. (10). This corresponds to\nthe parton contribution which is independent of QCD interactions. Equivalently one can say\nthat all measures\ns\nsl\nds = d\n(l + 1)\n2\nl+1\n(Mτ )\nMτ2\n\n!l+1\n\n(11)\n\ndefined on the interval [0, Mτ2 ] are normalized to 1 for the volume of the integration space\nwhich in this case is the interval [0, Mτ2 ]. The quantities ml defined in Eq. (10) are related to\nthe interaction. They are of real interest because they contain a wealth of information about\nthe hadronic spectral density ρhad (s) and are sufficient for theoretical studies.\nTheoretical calculations of the moments can be done within OPE which contain perturbative\nand power corrections. The perturbation theory can then be further improved using methods\nof summation. We consider these steps in turn.\n\n3\n\nFinite-order perturbation theory\n\nIn this section we start the analysis of the moments given in Eq. (10) with the consideration\nof the ordinary perturbative part of the theoretical spectrum or Adler's function D(Q2 ). The\ntheoretical prediction for the function D(Q2 ) has been calculated with a very high degree of\naccuracy within perturbation theory (see e.g. Refs. [19, 20, 21]).\nIn the massless limit for light quarks (u, d) the perturbation theory expression for Adler's\n\n9\n\n\ffunction is the same for both the axial and the vector channel. In the MS-scheme it reads\nαs\nαs\nD(Q ) = 1 +\n+ k1\nπ\nπ\n\u0012\n\n2\n\n\u00132\n\n+ k2\n\n\u0012\n\nαs\nπ\n\n\u00133\n\n+ k3\n\n\u0012\n\nαs\nπ\n\n\u00134\n\n+ O(αs5)\n\n(12)\n\nwhere the running coupling αs is normalized at the scale μ2 = Q2 , αs ≡ αs (Q2 ). Here\n299\n− 9ζ(3) ≈ 1.63982,\n24\n75\n58057 779\n−\nζ(3) + ζ(5) ≈ 6.37101\n=\n288\n4\n2\n\nk1 =\nk2\n\n(13)\n\nfor nf = 3 light flavours. ζ(z) is Riemann's ζ function. The fourth-order MS-scheme coefficient\nk3 in Eq. (12) is related to the divergent parts of five-loop diagrams and is not yet known\nat present. Eqs. (12) and (13) constitute the set of theoretical information necessary for a\nperturbation theory analysis of the τ system. The analysis of finite-order perturbation theory\nwas presented in Ref. [22].\nStarting with Adler's function given in Eq. (12) we deduce the spectral density ρ(s) within\nthe MS-scheme,\nαs (s)\nαs (s)\nρ(s) = 1 +\n+ k1\nπ\nπ\n\n!2\n\nπ2\n+ k2 − β02\n3\n\n!\n\nαs (s)\nπ\n\n!3\n\n+ ...\n\n(14)\n\nwhere the term proportional to π 2 is a result of the analytic continuation from the Euclidean\ndomain, β0 is the leading coefficient of the β-function.\nThe first step in studying the perturbative part of the moments ml in Eq. (10) is to fix our\ncriteria on how to decide which weight functions are theoretically preferable. In ordinary (or finite order) perturbation theory a natural criterion is the explicit convergence of the perturbation\nseries, i.e. the pattern of numerical behaviour of consecutive terms of the perturbation series. In\ngeneral, one expects the convergence of the perturbation series to be better for moments which\nare more 'perturbative', i.e. sensitive to larger scales. However, the explicit convergence can\nbe concealed by the use of a particular scheme, for instance by defining the coupling constant\nin the MS-scheme which is most widely used. Therefore, the criterion of explicit convergence\nis scheme dependent. Besides physical reasons of the applicability of perturbation theory to a\ngiven observable the explicit convergence for the moments (numerical structure of the perturbation theory series with finite number of terms) can look better or worse depending on the\n\n10\n\n\fchoice of the expansion parameter in a given scheme. This is an artefact of the definition of\nthe coupling (renormalization or subtraction).\nTo eliminate such an artificial influence of the scheme definition on physical conclusions one\nshould use scheme independent criteria of theoretical calculability within perturbation theory.\nThe invariant content of the investigation of the spectrum in perturbative QCD, independent\nof any definition of the charge or the coupling parameter, is the simultaneous analysis of a set\nof moments. Technically, an efficient way to do this is to factor out all unrelated constants by\nredefining the charge and introducing an effective coupling which absorbs all constant terms of\nthe perturbative expansion for the polarization function or the spectral density. The purpose of\nthe effective coupling is to get rid of artificial scheme-dependent constants in the perturbation\ntheory expressions. Therefore, in order to analyze a set of moments ml in the most transparent\nway (see e.g. Refs. [23, 24, 25]) we express the spectral density in terms of an effective coupling\nfor the τ system.\nNote that the use of an effective coupling is a technical trick which simplifies the analysis.\nSuch a parameter is necessary in order to be able to assess the explicit convergence of the\nperturbation series. The really invariant measure is given by the mutual relations between\nmoments while the effective coupling is still a parameter of the theory to which one cannot\nprescribe any special physical meaning. Despite this fact, the introduction of a natural internal coupling parameter allows one to extend the perturbation theory series available for the\ndescription of the relations between observables by one more term as compared to the analysis\nin e.g. the MS-scheme (see e.g. Refs. [23, 26]).\nIn this section we work within finite-order perturbation theory (FOPT) and define an effective coupling aM (s) on the physical cut for sufficiently large values of s by the relation\nαs (s)\nαs (s)\n+ k1\naM (s) =\nπ\nπ\n\n!2\n\nπ2\n+ k2 − β02\n3\n\n!\n\nαs (s)\nπ\n\n!3\n\n+ ...\n\n(15)\n\nsuch that\nρ(s) = 1 + aM (s).\n\n(16)\n\nThe subscript \"M\" stands for a Minkowskian definition of the effective coupling, i.e. the definition on the physical cut. The decomposition of the spectral density in Eq. (16) reflects the fact\nthat within perturbation theory the correlator contains the parton part which is independent\n11\n\n\fof αs . All the constants that may appear in the perturbation theory expression for the spectral\ndensity ρ(s) due to a particular choice of the renormalization scheme are absorbed into the\ndefinition of the effective charge (see e.g. Refs. [27, 28, 29, 30]), so that only effects of the\nrunning of the coupling itself are left. The solution of the evolution equation for the effective\ncoupling,\ns\n\n\u0010\n\u0011\ndaM (s)\n= β(aM (s)) = −aM (s) β0 aM (s) + β1 aM (s)2 + β2 aM (s)3 + O(aM (s)4 )\nds\n\n(17)\n\nresulting from the renormalization group analysis of the correlator with a given effective βfunction β(a) can be obtained by quadrature,\naM (s) = aM +\n\nZ\n\ns\nMτ2\n\nβ(aM (s′ ))\n\nds′\ns′\n\n5\n= aM + β0 La2M + (β1 L + β02 L2 )a3M + (β2 L + β1 β0 L2 + β03 L3 )a4M + O(a5M ) (18)\n2\nwhere aM = aM (Mτ2 ) and L = ln(Mτ2 /s). Moments of the spectral density with different weight\nfunctions emphasize different regions of the evolution trajectory of the renormalization group\nequation. Because we are interested in the running of the effective coupling, we can also use this\nsolution in terms of an expansion in L which is more relevant for our particular setup, instead\nof an expansion in aM (which is standard). At any given order of perturbation theory for the\neffective or for the exact function β(α) the running coupling aM (s) is given by the evolution\ntranslation of the initial value aM according to the renormalization group equation. The result\nreads\n1\n∂β(a) 2 1\n∂\n∂β(a) 3\nL − β(aM ) β(aM )\nL + O(L4 )\naM (s) = aM − β(aM )L + β(aM )\n2\n∂a a=aM 6\n∂a\n∂a a=aM\n!\n\n∂\na\n= exp −Lβ(a)\n∂a\n\n(19)\na=aM\n\nwhere the solution of Eq. (17) is written in a symbolic operator form. Note that this expression\nis useful for the so-called 't Hooft scheme where, by definition, the β-function of perturbation\ntheory is given by the concise expression β(α) = −β0 (α/π)2 − β1 (α/π)3 [31].\nDefining the effective coupling aM (s) directly through the spectrum ρ(s) itself one obtains\nperturbative corrections to the moments in Eq. (10) only because of running. Without running\n(as, for instance, in the conformal limit of QCD with a vanishing β-function or at the infrared\n12\n\n\ffixed point) one would have\nMl = 1 + aM (Mτ2 ) or ml = aM (Mτ2 )\n\n(20)\n\nwith ml defined in Eq. (10). In this situation the whole theoretical description of the physics of\nthe τ system in the massless approximation (i.e. without strange particles and including only\nperturbative corrections without possible power corrections) would reduce to the determination\nof a single number aM (Mτ2 ) and consequently there would be no problems with the convergence\nof the perturbation theory series. This reminds one of the situation in QED where the coupling\nis defined through the subtraction on the mass shell and simply gives the cross section in the\nThomson limit. But because of the running of aM (s) (which is important numerically because\nboth aM (Mτ2 ) and β0 are large), different observables, i.e. different moments of the spectral\ndensity, generate different perturbation series from the original object ρ(s) in Eq. (16) and\nthis difference is now within the reach of experiments. Thus, moments just allow one to study\nthe evolution or β-function of the effective coupling aM (s). We remind the reader that in\nthis section we discuss only the perturbative part of the theoretical spectrum where power\ncorrections are neglected.\nThe contributions of powers of logarithms (from Eqs. (18) or (19)) to the normalized moments in Eq. (10) are given by\n(l + 1)\n\nZ\n\nMτ2\nln\ns\n\nMτ2\n\n0\n\nsl ds\n1\n=\n2\nl+1\n(Mτ )\nl+1\n\n(21)\n\nsl ds\n2\n=\n.\n2\nl+1\n(Mτ )\n(l + 1)2\n\n(22)\n\n!\n\nand\n(l + 1)\n\nZ\n\nMτ2\n\n0\n\n2\n\nln\n\nMτ2\ns\n\n!\n\nA general formula for an arbitrary (integer) power of the logarithm reads\n(l + 1)\n\nZ\n\n0\n\nMτ2\n\nln\n\np\n\nMτ2\ns\n\n!\n\nsl ds\np!\n=\n.\n2\nl+1\n(Mτ )\n(l + 1)p\n\n(23)\n\nTherefore, at any fixed order of the perturbation series expansion the effects of running die out\nfor large values of l improving the (explicit) asymptotic structure of the perturbative series for\nthe moments in Eq. (10). This is obvious and expected in QCD with its property of asymptotic\nfreedom because the moments with weight functions sl suppress the infrared (small s) region\nof integration where perturbation theory is not applicable. Note that for a given order of\n13\n\n\fperturbation theory the real effects of running are connected with powers of logarithms and\nnot with powers of the coupling aM . Therefore one computes an expansion of the spectral\ndensity ρ(s) as a Taylor series with the initial value at Mτ ,\nρ(s) = ρ0 (Mτ ) + ρ1 (Mτ )L + ρ2 (Mτ )L2 + . . .\n\n(24)\n\nIt is just the coefficients of this Taylor series (coefficients ρi (Mτ ) of the powers of logarithms)\nthat are calculated by a perturbative expansion in the coupling constant. In the effective scheme\nusing aM one finds\nρ0 (Mτ ) = aM ,\nρ1 (Mτ ) = −β(aM ),\nρ2 (Mτ ) =\n\n∂β(aM )\n1\n, ...\nβ(aM )\n2\n∂aM\n\n(25)\n\nwhile for the MS-scheme one would have\nαs (Mτ )\nαs (Mτ )\n+ k1\nρ0 (Mτ ) =\nπ\nπ\n\n!2\n\nπ2\n+ k2 − β02\n3\n\n!\n\nαs (Mτ\nπ\n\n!3\n\n+ ...\n\n(26)\n\nThe technical advantage of introducing the effective scheme becomes obvious. The effects of\nrunning as given by powers of logarithms can be obtained in a concise form as explicit functions\nof aM from Eq. (23) if the β-function is known. Note that only for the leading order β-function\nthe powers of logarithms coincide with the powers of the coupling a.\nThe behaviour at fixed l and large p, i.e. the convergence (or asymptotic structure) of the\nperturbation series with an infinite number of terms for the moments is another story. This\nquestion was intensively discussed in the literature. We present our analysis of this problem in\nSec. 6.\nTherefore, the set of moments in Eq. (10) has a simple and clear structure of perturbative\nconvergence in finite-order perturbation theory: larger values of l are better behaved from\nthe perturbation theory point of view. However, in practice and for an efficient comparison\nwith experimental data the choice of weight functions is also dictated by the precision of the\navailable experimental data. With this constraint taken into account, sl -moments for large\nvalues of l are not welcome from an experimental point of view. They are dominated by the\ncontributions coming from the high-energy part of the τ decay spectrum (and therefore show\n14\n\n\fa better perturbative convergence) while the experimental accuracy for the moments basically\ndeteriorates with increasing l because poorly known contributions close to the high-energy end\nof the interval are enhanced. Therefore, with respect to the precision aimed for the the structure\nof the set of the sl -moments on the experimental side is opposite to that on the theory side:\nfor larger l the precision for the calculation of moments using experimental data is worsening\nfast.\nTo balance the precision requirements from the experimental and theoretical sides one can\nconsider a modification of the set of moments (see e.g. Refs. [32, 33]). Note that in general any\npolynomial in s can be used as a weight function for a finite interval. In a sense a complete\nsystem of orthogonal polynomials (like the Jakobian polynomials P (a,b) (x) with the rather\ngeneral weight function xa (1 − x)b which are orthogonal on the finite interval (0, 1) [34]) could\nprovide an exact expansion of the function ρ(s) in term of its moments and allows for its full\nreconstruction of the special shape of the coefficients of the expansion (supposing that ρ(s) is\na continuous function). Therefore, the particular choice of weight functions is determined by\nthe efficiency of solving concrete problems. Actually, the basis {sl ; l = 0, . . . , ∞} is complete\nfor continuous functions on the interval [0, Mτ2 ], and the choice of this basis allows for the\nmost direct evaluation of the structure of the moments from the perturbation theory point of\nview which is the most relevant for the theoretical analysis. At s = Mτ2 the spectrum is quite\nperturbative and for large values of l the sl -moments are basically determined by ρ(Mτ2 ).\nAs the simplest modification done in order to suppress experimental errors from the highenergy end of the spectrum, we introduce the system of modified moments with weight functions\ns\n(k + l + 1)!\n1− 2\nwkl (s) =\nk!l!\nMτ\n\n!k\n\ns\nMτ2\n\n!l\n\n.\n\n(27)\n\nEven in the case l = 0 we can consider the modified moments as mixed moments, because they\nare just linear combinations of the direct moments with weight functions sl as given in Eq. (10).\nThe modified moments\n(k + l + 1)!\nMkl =\nk!l!\n\nZ\n\n0\n\nMτ2\n\ns\n1− 2\nMτ\n\n!k\n\ns\nMτ2\n\n!l\n\nρ(s)ds\n≡ 1 + mkl\nMτ2\n\n(28)\n\nare normalized to unity. Within the set given in Eq. (28) the best choice from the experimental\npoint of view is to use large values for k and small values for l. This choice was also advocated\n15\n\n\fcomplex q 2 plane\n\nA\n\nFigure 2: contour of integration in the complex q 2 -plane\n\nto be justified theoretically as improving the precision based on the integration over the contour\nin the complex q 2 -plane (see Fig. 2). The reasoning was that the weight functions (1 − s/Mτ2 )k\nsuppress the contribution of that part of the contour that is close to the real positive semi-axis\nwhere OPE is not applicable (region A in Fig. 2) which in turn, according to standard wisdom,\ncan improve the accuracy of theoretical predictions. Below we give arguments that this is\nnot the case: the weight functions (1 − s/Mτ2 )k simply ruin the perturbative structure of the\nmoments for large values of k. Let us demonstrate this in more detail.\nWithin finite-order perturbation theory the integration over the contour [35, 36, 37] is completely equivalent to the integration over the cut along the positive semi-axis because of the\nanalytic properties of the functions lnp (−Mτ2 /q 2 ) occuring in the expansion of the correlator.\nThis can easily be seen from the spectral density according to Eq. (16). All polynomial moments can be rewritten as contour integrals in the complex q 2 -plane. Therefore, for finite-order\nperturbation theory it makes no difference which particular representation for the moments is\nused: integrals over the contour in the complex q 2 -plane and integrals over the cut along the\npositive semi-axis are mathematically equivalent at any order of perturbation theory. Power\ncorrections and infinite summation in perturbation theory will be discussed later on.\nIn the framework of finite-order perturbation theory we will discuss in the following our\nstatement that weight functions (1 − s/Mτ2 )k with large k are a bad choice for moments from\nthe perturbation theory point of view, i.e. they are strongly nonperturbative. Indeed, the weight\nfunction in Eq. (27) has its maximum value at smax = Mτ2 l/(l + k) (see Fig. 3). The integral\n16\n\n\fin Eq. (28) is dominated by contributions from around this value smax for a smooth function\nρ(s) as it is given by perturbation theory. The disadvantage of choosing such moments is that\nthe factor (1 − s/Mτ2 )k strongly enhances the infrared region of integration where perturbation\ntheory is not valid. This can be seen by looking at the explicit convergence of the perturbation\nseries for the moments [7].\nTo show this explicitly, we consider the integration of the running coupling with the modified\nweight functions in Eq. (27). The analogues of Eqs. (21), (22), and (23) are necessary in order\nto find the behaviour of contributions due to logarithms (see Eq. (19)). The values of the\ncoefficients of such contributions can be readily found in a concise form for arbitrary values of\nk at any giving finite order of perturbation theory (for a given power of the logarithm). For\ninstance, the contribution of the term proportional to L = ln(Mτ2 /s) is given by\n(k + 1)\n\nZ\n\nMτ2\n\n0\n\ns\n1− 2\nMτ\n\n!k\n\nMτ2\nln\ns\n\nk+1\nX1\nds\n=\n= γE + ψ(k + 2)\nMτ2\nj=1 j\n\n!\n\n(29)\n\nwhere γE is Euler's constant and ψ(z) is the digamma function. In contrast to Eq. (21) the\ncontributions in Eq. (29) increase as ln(k) for large k. so the coefficients of the perturbation\nseries for the moments grow relatively larger with increasing k. The contribution of the L2 -term\nreads\n(k +1)\n\nZ\n\n0\n\nMτ2\n\ns\n1− 2\nMτ\n\n!k\n\nln2\n\nMτ2\ns\n\n!\n\n2\n\n\n\nk+1\nk+1\nX1\nX 1\nds\n\n +\n=\n= (γE +ψ(k +2))2 +ψ ′ (k +2) (30)\n2\nMτ2\nj\nj\nj=1\nj=1\n\nwhere ψ ′ (z) is the first derivative of the digamma function. The coefficients in Eq. (30) grow as\nln2 (k) for large k which has to be compared with Eq. (22). For higher powers of L the expressions\nbecome too lengthy to be presented here. The asymptotic behaviour of the perturbation theory\n\ncoefficients for large k and fixed p is totally different from the behaviour obtained for the sl moments, the direct moments from Eq. (10).\nThe property of convergence of the resulting perturbation series for the moments can be\nreformulated in the language of effective scales for the moments themselves. This is similar\nto the approach where moments are reexpressed by moments [23]. Indeed, let us take the\nexpansion of Eq. (18) up to next-to-leading order,\naM (s) = aM + β0 La2M + O(a3M ) = aM + β0 a2M ln(Mτ2 /s) + O(a3M )\n17\n\n(31)\n\n\fFigure 3: Different weight functions wkl (s) for (k, l) = (3, 0), (2, 1), (1, 2), and (0, 3).\nThen for the sl -moments (i.e. the moments M0l of Eq. (28)) one has\nm0l = aM +\n\nβ0 2\na + O(a3M )\nl+1 M\n\n(32)\n\nwhich translates into the effective scale Mτ2 e−1/(l+1) through the relation\naM +\n\nβ0 a2M\n+ O(a3M ) = aM (Mτ2 e−1/(l+1) ) + O(a3M ).\nl+1\n\n(33)\n\nOn the other hand, for the (Mτ2 − s)k -moments given by Eq. (28) with large values for k and\nl = 0 the result of integrating Eq. (31) reads\nmk0 = aM + β0 a2M ln(k) + O(a3M ) = aM (Mτ2 /k) + O(a3M ).\n\n(34)\n\nThis leads to the effective scale Mτ2 /k for large k. The results of these explicit calculations agree\nwith a qualitative estimate based on the observation that the essential region of integration\nwhere integrals for the moments are saturated for reasonably smooth functions ρ(s) (which\nare just powers of logarithms in finite-order perturbation theory) is located around smax =\nMτ2 l/(l + k). Obviously, the quantity aM (Mτ2 /k) cannot be evaluated in perturbative QCD for\nlarge values of k. To be specific, for k = 2 we have\nm20 = aM + β0 a2M\n\n11\n+ O(a3M ) = aM (Mτ2 e−11/6 ) + O(a3M ) = aM (0.16Mτ2 ) + O(a3M ),\n6\n\n(35)\n\n25\n+ O(a3M ) = aM (Mτ2 e−25/12 ) + O(a3M ) = aM (0.12Mτ2 ) + O(a3M ).\n12\n\n(36)\n\nand for k = 3\nm30 = aM + β0 a2M\n\n18\n\n\fThus we find that ,in the language of effective scales, even a value of k = 3 requires the\ncalculation of the effective coupling at a low scale which is definitely located in a nonperturbative\nregime. In this context we remind the reader that the effective scale ΛM for the effective coupling\naM as defined in Eq. (15) is given by\nΛ2M = exp(k1 /β0 )Λ2MS = 2.07Λ2MS.\n\n(37)\n\nTo fix the scale we take the value of ΛMS = 350 MeV as determined from τ decays [38]. Then\nthe process dependent parameter ΛM determining the effective coupling is numerically given\nby\nΛ2M = 2.07 × (0.35 GeV)2 ≈ 0.1 GeV2 .\n\n(38)\n\nThis is to be compared with the effective scale from Eqs. (35) and (36). For Mτ = 1.777 GeV\none finds 0.12 × Mτ2 = 0.36 GeV2 which is definitely located in the nonperturbative region for\nthe process under consideration.\nThis is the situation with finite-order perturbation theory which is expected on the basis\nof asymptotic freedom of QCD and which is readily confirmed by a direct calculation. As the\nmain output of this analysis we observe the movement of the related scale to where integrals are\nsaturated and conclude that (Mτ2 −s)k -moments for large k cannot be calculated in perturbation\ntheory. Because the picture of explicit convergence due to the effects of running can be concealed\nby the use of a particular scheme (the MS-scheme, for instance) we have discussed the essence of\nthe situation in an effective scheme where only effects of running are seen for the moments but\nno artificial constants related to the definition of an expansion parameter in a specific scheme\noccur.\nTo conclude this section, we summarize our findings saying that demands from the theory\nside, basically dictated by the calculability in perturbation theory, and from the experiment\nside, basically dictated by the precision of experimental data, lead to conflicting requirements\nfor the choice of weight functions as for where they should give the dominant contribution.\nThus, one faces the usual conflict between experimental and theoretical accuracy which in\nour case is reflected by the range of (k, l)-values for the modified moments that are chosen as\noptimal observables. Having explicit perturbation theory formulae at hand (see e.g. Eq. (12),\n(14), (15), (16), (17), and (18)) one can establish the ultimate theoretical accuracy implied by\n19\n\n\fthe asymptotic character of the perturbation series for a given experimental observable with\nany stated precision. This allows one to conclude which error – experimental or theoretical –\ndominates the uncertainty of an observable related to τ decay physics. From the point of view\nof perturbation theory, large values of l are preferable while large values of k cannot be used.\nHowever, perturbation theory is not the end of the story. Instead, if the convergence is not\nsatisfactory, this is an indicator that something is going wrong. There are contributions beyond\nperturbation theory, so if perturbation theory convergence is slow, perturbation theory itself\nis not reliable and nonperturbative terms become important. Nonperturbative terms for twopoint correlators can be analyzed within OPE which can (and people believe, does) describe\nthe spectrum at low energies better than ordinary perturbation theory.\n\n4\n\nPower corrections\n\nIn this section we consider the contribution of power corrections within OPE to the systems\nof moments given in Eqs. (10) and (28), and the interplay between the magnitude of this\ncontribution and the structure of the perturbation theory series. In doing so we neglect, as\nusual, the weak ln(Q2 ) dependence of the coefficient functions of local operators within OPE\nstemming from the anomalous dimension of the local operators to see the net effect of a powertype behaviour. Though this is a rather common practice in phenomenological applications,\nwe do it for simplicity only; this dependence can be readily taken into account (see e.g. the full\nanalysis of a realistic case below). The standard power corrections due to nonvanishing vacuum\nexpectation values of local operators within OPE are relatively small for τ decays but can play\na crucial role for particular observables determined by special weight functions that lead to\nnonperturbative moments. Indeed, we saw in the previous section that (Mτ2 − s)k -moments are\nnot computable in perturbation theory for large values of k. Here we will see that one needs all\npower corrections which are known (or at least many terms) to bring the experimental results\nfor the (Mτ2 − s)k -moments in consistency with the theoretical framework based on OPE, i.e.\nthe expansion in power corrections.\nFor the system of moments in Eq. (10) the contribution of power corrections reduces to a\nsingle term of the form (Λ2 /Mτ2 )l which decreases with l for Λ < Mτ where Λ is a typical scale\n20\n\n\fof the power corrections related to the nonperturbative scale of QCD. This restriction for Λ is\na necessary condition for the applicability of perturbation theory. In fact, for Λ2 /Mτ2 < 1 the\nperturbation theory contribution dominates in the total result for the direct sl -moments, being\na necessary condition for using the technique. It is not quite clear, however, which numerical\nvalue should be chosen for Λ. The choice Λ ∼ ΛQCD is just too vague. In practice, a better\nchoice for the scale could be Λ ∼ mρ or the mass of the respective low-lying resonance in the\ncorresponding channel as for example the mass of the a1 meson for the axial correlator (see the\ndiscussion below).\nThe perturbative contribution to the sl -moments with large values of l is saturated by highenergy contributions and therefore converges perturbatively, the convergence becomes even\nbetter with increasing l. Therefore, the sl -moments are theoretically computable with a strict\ncontrol over the precision in perturbation theory. On the contrary, for l ∼ 0 and large values of\nk the system of mixed moments in Eq. (28) (which we call large k moments in the following)\nis saturated by low-energy contributions, i.e. basically by the contribution of the ground-state\nresonance, the existence of which is a common feature of the low-energy part of hadronic spectra.\nThe large k moments are therefore completely nonperturbative. Power corrections to the large\nk moments come from many terms of OPE with local operators of high dimensionality. While\nthese contributions are certainly decisive for reproducing the experimental spectrum, nothing\ndefinite can be said theoretically about such a sum of power corrections in any realistic case\nbecause high-dimensional power corrections are completely unknown numerically.\nAn instructive example for the importance of power corrections to mixed moments with\nlarge k needed to reproduce the experimental spectrum of hadrons at low energies is the comparison of moments for vector and axial channels. In the massless limit the perturbation theory\nseries for the spectral density is the same both for the vector and axial channel leading to identical expressions for the large k moments in perturbation theory. Experimentally, the large k\nmoments are saturated by the contributions of the first resonances which are completely different for both channels: the pion as a Goldstone boson in the axial channel and the ρ meson\nin the vector channel. Therefore, no method of summation of perturbation theory series alone\ncan bring the perturbation theory results for the mixed moments with large k in agreement\n\n21\n\n\fwith the experiment: if the method of summation is a regular one, the result is the same for\nboth channels because it sums the same initial series. In this case perturbation theory for large\nk moments is in trouble and the power corrections have to provide the correct result. Because\nthe asymptotic regime of very large k requires the consideration of all power corrections, this\nexample shows that large k moments as in Eq. (28) cannot be used within the perturbation\ntheory framework even if they are preferable from the experimental point of view. On the\ncontrary, the system of direct moments in Eq. (10) (also called l moments) can be calculated\nreliably in perturbation theory. These moments are saturated by perturbation theory which\nis also valid phenomenologically and known since long ago (chiral invariance, Weinberg sum\nrules) while the contribution of power corrections in this case is small and provides a necessary\nfine-tuning for better accuracy.\nAnother way to understand what has been said up to now is to state that mixed moments\nwith large values for k resolve the point-by-point structure of the spectral density at the origin\nwhich is definitely nonperturbative while mixed moments for large values for l resolve the pointby-point structure of the spectral density at large values for s where perturbation theory is more\nreliable and the standard asymptotic analysis is possible.\nAfter these preliminary remarks we give a realistic example where the magnitude of power\ncorrections and perturbative terms can be seen quantitatively. In the consideration below we\nuse the vector channel for the e+ e− annihilation into hadrons as an example which is relevant\nfor the calculation of the electromagnetic coupling constant at MZ . This is the classical channel\nfor vector mesons (ρ, ω). We give some details to elaborate the real situation in QCD within\nOPE. This example serves as a base for the next step – to simplify this picture to a model\nwhich contains only the gross features of the phenomenological structure of the spectrum but\nis simple and efficient for the purpose of investigating higher order power corrections within\nOPE.\n\n4.1\n\nThe vector channel contribution\n\nIn this subsection we discuss the relative magnitude of perturbative and power corrections for\na particular quantity related to the two-point correlator of hadronic currents of light quarks.\n\n22\n\n\fThe quantity which is chosen is the value of the vacuum polarization function at the origin.\nThis quantity is infrared (IR) sensitive, a fact that allows one to see the interplay between\nperturbative and power corrections.\nFor light quarks the perturbative part of the vector (and axial) correlator is calculable for\nlarge values of Q2 = −q 2 within the Euclidean domain. For the MS renormalization scheme it\nis given by\n5 αs\nμ2\nμ2\nln\n+ +\n+\nΠ (μ , Q ) = ln\nQ2\n3\nπ\nQ2\n! \u0012\n\u0012 \u00132\n\u0013\nαs\n9 2 μ2\n299\n+\n+\nln\n− 9ζ(3) ln\nπ\n8\nQ2\n24\nlight\n\n2\n\n2\n\n!\n\n!\n\n!\n\n55\n− 4ζ(3)\n(39)\n12\n!\n!\n34525 715\n25\nμ2\n+\n−\nζ(3) + ζ(5) .\nQ2\n864\n18\n3\n\nEq. (39) is written for nf = 3 active light quarks with the effective coupling αs ≡ αs(3) (μ2 ). One\nis interested in an estimate for the value Πlight (μ2 , 0). However, Πlight (μ2 , Q2 → 0) cannot be\nobtained from Eq. (39) because there is no scale for light quarks, one can therefore not avail of\na perturbative expression. Because singularities at small momenta are related to IR problems,\nit suffices to modify only the IR structure of the correlator Πlight (μ2 , Q2 ) in order to obtain an\nexpression for all values of Q2 . It is convenient to modify just the contribution of low-energy\nstates to the correlator by using the dispersion relation\nΠlight (Q2 ) =\n\nZ\n\n∞\n0\n\nρlight (s)ds\ns + Q2\n\n(40)\n\nwhere dimensional regularization is understood to be used for ρlight (s). In fact, Eq. (40) can be\nused for the bare quantities Πlight (Q2 ) and ρlight (s). The modification should be done locally\n(i.e. with a finite support in the squared energy variable s in Eq. (40)) without changing the\nperturbative behaviour, in order not to affect any ultraviolet (UV) properties (μ2 dependence)\nof the correlator Πlight (μ2 , Q2 ). This requirement is important for retaining the renormalization\ngroup properties of the correlator. The low-energy modification of the perturbative expression\nfor the spectrum is inspired by experiment: at low energies there is a well-pronounced bound\nstate as a result of the strong interaction between quarks. Therefore, we adopt a model of\nthe IR modification where the high-energy tail of the integral in Eq. (40) is computed within\nperturbation theory retaining the renormalization group structure of the result while in the\nlow-energy domain there is a contribution of a single resonance.\n23\n\n\fFor a generic light quark correlator in the massless perturbative approximation one introduces the IR modification\n2\nlight\nρlight (s) → ρlight\n(s)θ(s − s0 )\nIRmod (s) = FR δ(s − mR ) + ρ\n\n(41)\n\nwhere FR , mR , and s0 are IR parameters of the spectrum. Note that they may not correspond\nto the actual experimental numbers. Substituting the IR modified spectrum in Eq. (41) into\nEq. (40), one finds\n5 αs\nμ2\nFR\n+ +\nln\n= 2 + ln\nmR\ns0\n3\nπ\n! \u0012\n\u0012 \u00132\n\u0013\nαs\n9 2 μ2\n299\n+\n+\nln\n− 9ζ(3) ln\nπ\n8\ns0\n24\n!\n\n2\nΠlight\nIRmod (μ , 0)\n\n55\nμ2\n+\n− 4ζ(3)\n(42)\ns0\n12\n!\n!\n34525 715\n25\n3π 2\nμ2\n+\n.\n−\nζ(3) + ζ(5) −\ns0\n864\n18\n3\n8\n!\n\n!\n\nWe identify mR with a mass of the low-lying resonance which is the only input giving a scale\nto the problem. The IR modifying parameters FR and s0 are fixed from quark-hadron duality\narguments. Notice the O(αs2) difference between Eq. (39) and Eq. (42) given by the additional\nterm −3π 2 /8. This is the so-called \"π 2 -correction\" (see e.g. Ref. [39]) which can be rewritten\nthrough ζ(2) = π 2 /6.\nNext we use the OPE with power corrections that semi-phenomenologically encode the\ninformation about the low-energy domain of the spectrum through the vacuum condensates of\nlocal gauge invariant operators [40] in order to supplement the perturbative contribution. The\nOPE for the light quark correlator reads\nlight\n2\n2\n2\n2\nΠlight\nOPE (μ , Q ) = ΠIRmod (μ , Q ) +\n\nhO4 i hO6 i\n+ 6 + ...\nQ4\nQ\n\n(43)\n\nThe quantities hO4,6 i denote nonperturbative contributions of dimension-four and dimension-six\nvacuum condensates. These contributions are UV soft (they do not change the short distance\nproperties of the correlator) and are related to the IR modification of the spectrum. For the\npurposes of fixing the numerical values of the parameters FR and s0 which describe the IR\nmodification of the spectrum one needs only the first two power corrections 1/Q2 and 1/Q4 .\nNote, however, that the coefficient of the 1/Q2 correction vanishes because there are no gauge\ninvariant dimension-two operators in the massless limit. Computing the IR modified and OPE\nsupplemented correlation function, we find finite energy sum rules (FESR) that alow one to fix\n24\n\n\fthe parameters FR and s0 [41],\nFR\nFR m2R\n\n(\n\nαs\n= s0 1 +\n+\nπ\n(\nαs\ns20\n1+\n+\n=\n2\nπ\n\nμ2\nαs 2\nβ0 ln\n+ k1 + β0\n+ O(αs3 ),\nπ\ns0\n!\n!)\nβ0\nαs 2\nμ2\n+ k1 +\n− hO4 i + O(αs3).\nβ0 ln\nπ\ns0\n2\n\n\u0012\n\n!\n\n\u0013\n\n!)\n\n(44)\n\nWe treat hO4 i as a small correction and take its coefficient function as a constant (the total\ncontribution is renormalization group invariant). Eqs. (44) fix FR and s0 through m2R and\nhO4 i. In using higher order terms in the OPE expansion (for instance, hO6 i/Q6 ) one could\navoid substituting m2R from experiment because within the IR modification given in Eq. (41)\nthe IR scale is determined by the dimension-six vacuum condensate hO6 i [41]. We do not do this\nbecause the primary purpose of the present analysis is to find the low-scale normalization for\nthe electromagnetic coupling and not to describe the spectrum in the low-energy domain. The\nuse of the experimental value for the resonance mass m2R makes the calculation more precise\nbecause the numerical value for the hO6 i condensate is not known well (cf. Ref. [42]).\nThe leading order solution for Eqs. (44) (upon neglecting the perturbative and nonperturbative corrections) is given by the parton model result s0 = 2m2R and FR = s0 = 2m2R which\nis rather precise. This solution has been used for predicting masses and residues of the radial\nexcitations of vector mesons within the local duality approach where the experimental spectrum is approximated by a sequence of infinitely narrow resonances [43]. The condensate of\ndimension-four operators for light quarks is given by\n7αs αs 2\nαs\nπ2\n ̄\n1+\nh G i + 2π 2 1 +\n(mu + md )(hūui + hddi).\nhO4 i =\n3\n6π\nπ\n3π\n\u0012\n\n\u0013\n\n\u0012\n\n\u0013\n\n(45)\n\nThe order αs corrections to the gluon condensate were calculated in Ref. [44]. We retain small\ncorrections proportional to the light quark masses and treat them according to the approxima ̄ which is rather precise\ntion of isotopic symmetry for the light quark condensates, hūui = hddi,\nfor u and d quarks. The quark condensate part of Eq. (45) is given by the partially conserved\naxial current (PCAC) relation for the π meson,\n ̄ = −f 2 m2 .\n(mu + md )hūu + ddi\nπ π\n\n(46)\n\nHere fπ = 133 MeV is the decay constant of the charged pion and mπ = 139.6 MeV is the mass\nof the charged pion. For the numerical standard value h(αs /π)G2 i = 0.012 GeV4 of the gluon\n25\n\n\fρ (s )\n\n2m 2V\n\nV\n\nvector correlator\n\n1\ncontinuum\n\nρ\n\nρA(s )\n\nmV2\n\ns\n\n2m V2\n\nmA2\n\nmA2\n\naxial−vector correlator\n\n1\nπ\n\na1\n\ncontinuum\n\ns\n\n2m 2A\n\n0\n\nFigure 4: Spectral densities for the models for the vector channel (corresponding to Eq. (48)\nand the axial-vector channel (corresponding to Eq. (57). The arrows indicate the narrow width\nresonances, given by distributions.\ncondensate [40] and αs /π = 0.1 one finds\nhO4 i =\n\nπ2\n7αs αs 2\nαs\n1+\nh G i − 2π 2 1 +\nf 2 m2 = 0.037 GeV4 .\n3\n6π\nπ\n3π π π\n\u0012\n\n\u0013\n\n\u0012\n\n\u0013\n\n(47)\n\nThe relation s0 = 2m2ρ , where mρ = 768.5 MeV is a mass of the lowest (ρ meson) resonance\nin the non-strange isotopic I = 1 vector channel, is rather precise numerically. The gluon\ncondensate gives a small correction to the basic duality relation s0 = 2m2R for light quarks.\nThe same is true for the I = 0 channel where the lowest resonance is the ω meson with a mass\nmω = 781.94 MeV. So we conclude that the model in Eq. (41) is rather accurate if the scale is\nfixed by the low-lying resonance.\n\n4.2\n\nModels for the vector and axial-vector channel\n\nBased on the above example we investigate models for non-perturbative effects resulting from\nstandard power corrections [40] that allow us to obtain all power corrections in a concise form.\nWe adhere to models for the vector and axial channels which are simple enough to be calculable\nand which retain the main features of the spectra. These models are depicted in Fig. 4. With\nthese models at hand we have all power corrections available for the discussion of their role in\nmoments for the spectral density in different channels.\n\n26\n\n\fAs a model for the vector channel we take the spectral density of the previous subsection\nin a simplified form (m ≡ mV ),\nρV (s) = 2m2 δ(s − m2 ) + θ(s − 2m2 ).\n\n(48)\n\nBy using the dispersion relation we obtain the correlation function\nμ2\n2m2\n+\nln\nΠV (Q ) = 2\nm + Q2\n2m2 + Q2\n2\n\n!\n\n+ subtractions\n\n(49)\n\nwith necessary subtractions. The expression in Eq. (49) is used to generate all power corrections.\nIndeed, for Q2 ≫ m2 one finds\nμ2\nΠV (Q ) = ln\nQ2\n2\n\n!\n\n+\n\n∞\nX\n\nn=1\n\n2m2\n− 2\nQ\n\n!n \u0012\n\n1\n1\n− n−1\nn 2\n\n\u0013\n\n(50)\n\nwhere the first term is the leading order perturbative contribution in αs and the remaining\nterms are power corrections. Note that the analytic properties of the expansion in Eq. (50) up\nto any finite order are different from the exact (though model-dependent) result in Eq. (49).\nThis is rather a common feature: analytic properties of approximations for the correlators can\nbe different from those of the exact result. In some instances this restricts the precision and\nmay lead to a misuse of approximations in areas where they do not work.\nWriting the OPE for the correlator in the general form\nμ2\nΠV (Q ) = ln\nQ2\n2\n\n!\n\n+\n\n∞\nX\n\ncn\n,\n2 n\nn=1 (Q )\n\n(51)\n\nfor the model in Eq. (49) we find\ncn =\n\n\u0012\n\n1\n1\n− n−1 (−2m2 )n .\nn 2\n\u0013\n\n(52)\n\nThe first two coefficients vanish, c1 = c2 = 0. The vanishing of c1 is in full agreement with\nthe fact that there exist no dimension-two operators in realistic cases while the vanishing of c2\nmeans that the gluon condensate is neglected in this model (which is justified numerically for\nthe realistic case of τ decays, see also the previous section). Note that these two constraints are\nbuilt-in requirements for our models. We just constructed the models in this way. The third\ncoefficient reads\n2\nc3 = − m6 .\n3\n27\n\n(53)\n\n\fPhenomenologically this coefficient is related to the vacuum expectation value of local fourquark operators which in factorized approximation is given by\nhO6V i = −\n\n896π 3\nαs hq̄qi2 .\n81\n\n(54)\n\nIts numerical value is approximated reasonably well by the expression in Eq. (53) with m = mρ .\nFor further comparison we give the value of the dimension-six term in the axial channel,\nhO6A i =\n\n1408π 3\nαs hq̄qi2 .\n81\n\n(55)\n\nThis vacuum expectation value is larger and has a sign opposite to that of the vector channel.\nThe first few terms of the model OPE in the vector channel read explicitely\nμ2\nΠV (Q ) = ln\nQ2\n2\n\n!\n\n−\n\n2m6 2m8 22m10 26m12\n+ 8 −\n+\n+ ...\n3Q6\nQ\n5Q10\n3Q12\n\n(56)\n\nThe term of dimension eight is still available in OPE as expressed through the vacuum expectation value of local operators, even though it is very poorly known numerically [45], while higher\norder terms were never used in phenomenological applications. The expression in Eq. (50)\nshows also the actual scale of the expansion in the vector channel, s0 = 2m2 . The scale Λ\nwith Λ ∼ ΛQCD ∼ ΛMS ∼ 350 ÷ 400 MeV or Λ2 ∼ 0.25m2 does not fit the scale of the power\ncorrections in this model.\nThere is a numerical cancellation between the resonance and continuum contributions to the\ncoefficients cn of the first several terms while for higher order terms (large values of n) the scale\ns0 = 2m2 dominates. This cancellation is one of the reasons for the success of the Borel sum\nrules for the ρ meson in the vector channel. One can go very low in the Borel parameter M and\nstill finds power corrections to be small if only power corrections up to dimension-six operators\nare included (with a nonvanishing gluon condensate there is also an additional cancellation\nbetween the dimension-four and dimension-six terms). Note that the expansion for Adler's\nfunction D(Q2 ) (or for the renormalized correlator function Π(Q2 )) converges for Q2 > 2m2 .\nThis is related to the simplicity of the analytic structure of the correlator in the model and\ntherefore to the simplicity of the model spectrum. Therefore, if one is to believe that the shape\nof the spectrum is really close to that of the model in Eq. (48), the scale of power corrections\nshould be close to the value s0 = 2m2 . We discuss this issue later on in more detail for a variety\nof different models.\n28\n\n\fNext we consider the axial part of the correlator or the axial channel. Because of the\npresence of the pion, in this case the spectrum at low energies is drastically different from the\none for the vector channel. All axial-vector resonances (with spin 1) have a finite mass. In the\nmassless limit there is theoretically a Goldstone mode – corresponding to the observed pion –\nwith spin zero contributing to the correlator of the axial-vector current (this is the reason why\nwe call it more generally axial correlator or axial channel). The main mass scale is the mass\nma1 of the axial-vector meson a1 which we express by m2a1 = 2m2A for further convenience. The\nunderlying reason for this is Weinberg's relation: at some point one can identify the scale mA\nwith the scale in the vector channel which is given by the ρ meson mass mρ . A possible model\nfor the spectrum in the axial channel reads\nρA (s) = m2A δ(s) + m2A δ(s − 2m2A ) + θ(s − 2m2A )\n\n(57)\n\nwhere the first term is the pion contribution, the second one is contribution of the a1 meson,\nand the third represents the continuum. There is no gap left between the second resonance and\nthe continuum. The correlator in the axial channel is given by\nm2A\nμ2\nm2\n+\nln\n,\nΠA (Q2 ) = A2 +\nQ\n2m2A + Q2\n2m2A + Q2\n!\n\n(58)\n\nthe expansion at large Q2 reads\nμ2\nΠA (Q ) = ln\nQ2\n\n!\n\n+\n\n2\n\n!\n\n+\n\n2\n\n= ln\n\nμ\nQ2\n\n∞\nX\n\nn=1\n\n2m2\n− 2A\nQ\n\n!n \u0012\n\n1 1\n− (1 + δn1 )\nn 2\n\n\u0013\n\n4m6A 4m8A 48m10\n64m12\nA\nA\n−\n+\n−\n+ ...\n6\n8\n10\n12\n3Q\nQ\n5Q\n3Q\n\n(59)\n\nwhere δn1 is the Kronecker symbol. Here the contribution of the dimension-four operator is\nagain zero while the dimension-six contribution is positive and larger than that in the vector\nchannel, which is the case also in the (model independent) OPE (see Eq. (55)). While the\ncontinuum contribution (the logarithm and the 1/n part in the sum in Eq. (50)) remains the\nsame, the factor −1/2n−1 in case of the vector channel is replaced by −1/2 (for n > 1) in\nEq. (59). Therefore, higher order power corrections for the vector channel are dominated by\nthe continuum while for the axial channel they are dominated by the resonance contributions\nand are generally larger – the mass of the a1 meson gives the scale both for the resonance\ncontributions and the continuum threshold in this particular model. However, this cannot be\n29\n\n\fquantitatively checked at present because the numerical values of the higher order condensates\nare not known phenomenologically with sufficient accuracy.\nIt is instructive to compare the results for the model OPE expansions in the two channels,\nμ2\nΠV (Q ) = ln\n−\nQ2\n!\n2\nμ\n+\nΠA (Q2 ) = ln\nQ2\n2\n\n!\n\n2m6V\n2m8V\n22m10\n26m12\nV\nV\n+\n−\n+\n+ ...\n3Q6\nQ8\n5Q10\n3Q12\n4m6A 4m8A 48m10\n64m12\nA\nA\n−\n+\n−\n+ ...\n6\n8\n10\n12\n3Q\nQ\n5Q\n3Q\n\n(60)\n\nThe coefficients of the power corrections are different and the signs of corresponding terms are\nopposite. A numerical comparison is possible if one identifies the scales mA = mV = m in both\nchannels which is a rather reasonable phenomenological approximation because of Weinberg's\nrelation m2a1 = 2m2ρ . However, one should keep in mind that both models only capture the\ngross features of the spectra while the fine details (visible at high resolution in the energy)\nare different and of importance for the numerical magnitude of higher order power corrections.\nIndeed, higher order power corrections are sensitive to the fine details of the spectra and\ncannot be reliably determined within rough models. Therefore, while the models proposed in\nthis subsection allow one to calculate power corrections up to any order, a reasonable accuracy\nis expected only for low orders in 1/Q2 – high-order power corrections can resolve the fine\nstructure of the spectrum which is not caught by the gross models. It is expected that for the\nfirst few terms of the power expansion the accuracy is rather good while for high-order terms\nit can be only an order of magnitude approximation. Still such simple models based on the\ngross features of the spectrum are definitely useful for a general analysis. Higher order terms\nare more sensitive to details of the spectrum and can be predicted only with large errors. We\ndiscuss these issues below.\nThe moments corresponding to the model spectral density for the vector channel for k = 0\nread (assuming 2m2 < Mτ2 )\n2m2\nM0l = 1 −\nMτ2\n\n!l+1\n\n!\n\nl+1\n1− l\n.\n2\n\n(61)\n\nOne observes that the perturbative contribution is represented by the first term on the right\nhand side of Eq. (61). The power corrections are given in what follows. The combined perturbative and power correction structure is a natural order for the direct sl -moments. For\n30\n\n\flarge l the contribution of the power corrections decreases and the moments are saturated by\nperturbation theory, i.e. if m2 ≪ Mτ2 , the power corrections for the moments M0l die out fast.\nFor mixed moments Mkl with l = 0 and arbitrary k we obtain (again for 2m2 < Mτ2 )\nMk0\n\n2m2\n= 1−\nMτ2\n\n!k+1\n\nm2\n2m2\n+ (k + 1) 2 1 − 2\nMτ\nMτ\n\n!k\n\n.\n\n(62)\n\nThe magnitude of these moments tends to zero for large values of k and definitely cannot be\nrepresented perturbatively. Indeed, according to the structure of OPE one should represent the\nmoments as\nMk0 = 1 + ∆k0\n\n(63)\n\nwhere ∆k0 gives the contribution of the power correction terms which are usually considered to\nbe small. For large values of k, however, one has Mk0 → 0 (as Eq. (62) shows) and ∆k0 → −1\nfrom Eq. (63), i.e. the moments are not given by an expansion near the perturbation theory\nresult, Mk0 = 1. The decomposition in Eq. (63) is therefore useless for large values of k because\n∆k0 is not small. For the first few orders in k one has\n∆00 = ∆10 = 0,\n\n∆20\n\nm2\n= −2\nMτ2\n!4\n\n!3\n\n,\n\n∆30\n\n∆40\n\nm2\n= −20\nMτ2\n\n!3\n\nm2\n+ 40\nMτ2\n\n∆50\n\nm2\n= −40\nMτ2\n\n!3\n\nm2\n+ 120\nMτ2\n\n!4\n\nm2\n− 132\nMτ2\n\n!5\n\nm2\n+ 52\nMτ2\n\n∆60\n\nm2\n= −70\nMτ2\n\n!3\n\nm2\n+ 280\nMτ2\n\n!4\n\nm2\n− 462\nMτ2\n\n!5\n\nm2\n+ 364\nMτ2\n\nm2\n− 22\nMτ2\n\n!5\n\nm2\n= −8\nMτ2\n\n!3\n\nm2\n+8\nMτ2\n\n!4\n\n,\n\nm2\n− 114\nMτ2\n\n!7\n\n.\n\n,\n!6\n!6\n\n(64)\n\nIf m2 ≪ Mτ2 , the power corrections for the moments Mk0 are still basically given by the lowest\norder term. If 2m2 is close to Mτ2 as it is actually the case in τ decays (the conclusion is based\non the model spectrum), power corrections for the moments M0l are given by a single operator\nof dimension l and are relatively small while for the moments Mk0 the power corrections are\ngiven by a linear combination of all operators up to the specified order. It is instructive to\nrewrite the k moments in terms of the actual scale 2m2 . One has\n∆00 = ∆10 = 0,\n∆40\n\n5\n= −\n2\n\n2m2\nMτ2\n\n!3\n\n∆20\n5\n+\n2\n\n1\n= −\n4\n2m2\nMτ2\n\n!4\n\n2m2\nMτ2\n\n11\n−\n16\n\n!3\n\n,\n\n2m2\nMτ2\n31\n\n∆30\n!5\n\n,\n\n2m2\n= −\nMτ2\n\n!3\n\n1\n+\n2\n\n2m2\nMτ2\n\n!4\n\n,\n\n\f∆50\n\n2m2\n= −5\nMτ2\n\n∆60\n\n35\n= −\n4\n\n!3\n\n2m2\nMτ2\n\n2m2\nMτ2\n\n15\n+\n2\n\n!3\n\n35\n+\n2\n\n!4\n\n2m2\nMτ2\n\n33\n−\n8\n\n!4\n\n2m2\nMτ2\n\n231\n−\n16\n\n!5\n\n2m2\nMτ2\n\n13\n+\n16\n!5\n\n2m2\nMτ2\n\n91\n+\n16\n\n!6\n\n2m2\nMτ2\n\n!6\n\n57\n−\n64\n\n2m2\nMτ2\n\n!7\n\n. (65)\n\nLooking at Eq. (65) one can conclude that keeping only the first contribution can give a completely wrong answer for the total result for ∆k0 at large k. Therefore, being expressed through\nthe natural scale, i.e. the scale where the analytic properties of the correlator change, the two\nsets of moments behave differently. The direct moments have power corrections in accordance\nwith the expectation that these corrections are powers of the relevant scale while the numerical\nmagnitude of mixed moments is non-predictable on general grounds without a detailed knowledge of the spectrum at low energies. Note again that we neglect the effects of the anomalous\ndimensions of local operators in our simplified consideration based on a model spectrum which,\nhowever, is also a common practice in phenomenological applications.\nThe dominance of the resonances for the axial channel becomes obvious if we consider the\nmoments. For 2m2A < Mτ2 the direct moments are given by\nM00 = 1,\n\n2m2A\nM0l = 1 +\nMτ2\n\n!l+1\n\n!\n\nl+1\n1−\n,\n2\n\n(66)\n\nwhile the mixed moments for l = 0 read\nMk0\n\n2m2A\n= 1−\nMτ2\n\n!k+1\n\n2m2A\nm2\n+ (k + 1) A2 + (k + 1) 1 −\nMτ\nMτ2\n\n!k\n\nm2A\n.\nMτ2\n\n(67)\n\nBecause of the second term in Mk0 which comes from the pion resonance at s = 0, the moments\nMk0 will not vanish for increasing values of k but will increase linearly in k. This is a feature\nworth emphasizing. For higher and higher values of k the moments Mk0 in Eq. (62) go to zero\nif used for smooth spectral functions on the cut which is the case if the spectral densities are\ncalculated in perturbation theory. However, the experimental shape of the spectrum is different,\nand the spectral density partially behaves like a distribution. The total pion contribution for\nexample is concentrated at one point which is not affected by the decrease of the essential\nsupport of the measure with increasing k. Therefore, due to the normalization chosen the pion\ncontribution grows with k. These two features of the experimental k moments, namely the\ndecrease of the vector contribution and the increase of the axial contribution due to the pion\n32\n\n\fl=2\nM0lV\n\nex\n\nV (3)\n\nM0l\n\nl=3\n\nl=4\n\nl=5\n\nl=6\n\nl=7\n\n0.98692 0.99021 0.99497 0.99777 0.99909 0.99964\n0.98692\n\n1.0000\n\n1.0000\n\n1.0000\n\n1.0000\n\n1.0000\n\nex\n\n1.0262\n\n1.0196\n\n1.0110\n\n1.0055\n\n1.0026\n\n1.0011\n\nM0l\n\nA(3)\n\n1.0262\n\n1.0000\n\n1.0000\n\n1.0000\n\n1.0000\n\n1.0000\n\nM0lex\n\n1.0065\n\n1.0049\n\n1.0030\n\n1.0016\n\n1.0008\n\n1.0004\n\n1.0065\n\n1.0000\n\n1.0000\n\n1.0000\n\n1.0000\n\n1.0000\n\nM0lA\n\n(3)\n\nM0l\n\nTable 1: Moments Mkl for k = 0 for the vector cannel and the axial channel model, using the\n(3)\n\nexact result M0lex as well as the power series expansion up to the third order term in 1/Q2 , M0l .\nWe use the estimate m2A = m2V = m2ρ = 769.3 MeV [3].\n\n(as found in Eqs. (62) and (67)) are very essential for the comparison with the theoretical\ndescription of the τ -moments to be successful. Indeed, one has\nτ\nMkl\n\n=\n\nτ\nNkl\n\nZ\n\n0\n\nMτ2\n\ns\n1− 2\nMτ\n\n!k+2\n\ns\nMτ2\n\n!l\n\n2s\n1+ 2\nMτ\n\n!\n\nρ(s)ds\nMτ2\n\n(68)\n\nτ\nτ\n(the normalization factor Nkl\nis chosen so that Mkl\n= 1 for ρ(s) = 1). Remark that the\nτ\nnormalized τ lepton decay rate Rτ as in Eq. (7) is just M00\n. The theoretical expression for the\n\nmoments changes slowly with k, therefore the sum of vector and axial parts behave better than\nthese two parts separately.\nWith the explicit models in Eqs. (48) and (57) at hand we can make a quantitative analysis.\nWe assume that these models give the exact results at any order of the power expansion. Then\nwe consider the moments and figure out when it is enough to keep only the three terms usually\navailable in phenomenology in order to have a reasonable (given) accuracy. Table 1 shows the\nsituation for the l moments. One sees that the perturbation theory contribution dominates the\nresults. For both vector and axial correlators the accuracy of the three-term approximation is\nbetter than 2% and improves for large values of l as expected.\nTable 2 shows the corresponding situation for the k moments. Here one sees the dominance\nof nonperturbative contributions to the vector and axial correlator results. For k = 4 the\naccuracy is already about 10% and deteriorates fast. For the sum of vector and axial correlators\n33\n\n\fk=2\n\nk=3\n\nk=4\n\nk=5\n\nk=6\n\nk=7\n\nV ex\nMk0\n\n0.98692 0.95745 0.91306 0.85716 0.79358 0.72591\n\nV (3)\n\n0.98692 0.94766 0.86915 0.73830 0.54203 0.26725\n\nMk0\n\nA ex\nMk0\n\n1.0262\n\n1.0851\n\n1.1748\n\n1.2902\n\n1.4256\n\n1.5761\n\nMk0\n\nA(3)\n\n1.0262\n\n1.1047\n\n1.2617\n\n1.5234\n\n1.9159\n\n2.4655\n\nex\nMk0\n\n1.0065\n\n1.0213\n\n1.0439\n\n1.0737\n\n1.1096\n\n1.1510\n\n1.0065\n\n1.0262\n\n1.0654\n\n1.1308\n\n1.2290\n\n1.3664\n\n(3)\n\nMk0\n\nTable 2: Moments Mkl for l = 0 for the vector cannel and the axial channel model, using the\n(3)\n\nex\nexact result Mk0\nas well as the power series expansion up to the third order term in 1/Q2 , Mk0 .\n\nWe use the estimate m2A = m2V = m2ρ = 769.3 MeV [3].\n\nl=7\n\n−0.00 −0.01\n\n−0.02 −0.02\n\n−0.03 −0.03\n\n−0.02 −0.00\n\nl=6\n\n−0.01 −0.01\n\n−0.02 −0.02\n\n−0.02 −0.01\n\n+0.00\n\n+0.02\n\nl=5\n\n−0.01 −0.02\n\n−0.02 −0.02\n\n−0.01\n\n+0.00\n\n+0.01\n\n+0.02\n\nl=4\n\n−0.01 −0.02\n\n−0.02 −0.01\n\n−0.00\n\n+0.00\n\n+0.01\n\n+0.02\n\nl=3\n\n−0.01 −0.01\n\n−0.01 −0.01\n\n−0.00\n\n+0.01\n\n+0.04\n\n+0.10\n\nl=2\n\n+0.02\n\n+0.06\n\n+0.14\n\n+0.66\n\n+1.27\n\n+2.33\n\n+4.11\n\nl=1\n\n+0.02\n\n+0.02 −0.02 −0.21\n\nl=0\n\n−0.01 −0.01\nk=0\n\nk=1\n\n+0.32\n\n−0.71 −1.88\n\n−4.34 −9.24\n\n−0.02 −0.02\n\n−0.01\n\n+0.01\n\n+0.00 −0.05\n\nk=2\n\nk=4\n\nk=5\n\nk=6\n\nk=3\nτ (3)\n\nTable 3: Relative deviation of the moments Mkl\n\nk=7\n\nfor the power series up to the third order\n\nτ\nfrom the moments Mkl\nfor the full result containing the vector and the axial-vector channel\n\nmodel. We use the estimate m2A = m2B = m2ρ = 769.3 MeV [3].\n\n34\n\n\fthe accuracy of the three-term approximation is better as one can see from the last line of\nTable 2. This proves our statement about the behaviour of the sum of vector and axial part\nwhich can also be seen from the expansions in Eqs. (60). It is known up to the third order\nterm from phenomenology where the corresponding values are given in Eqs.(54) and (55). Note,\nhowever, that the phenomenological results are obtained only in the factorization approximation\nfor the vacuum expectation values of the four-quark operators. Thus, the pion contribution\nis crucial in keeping a reasonable accuracy for the sum of axial and vector correlators for the\nlarge k moments. This corresponds to the local duality picture.\nOur general arguments are becoming more transparent if we consider mixed moments Mkl\nwith non-zero values of l. This is done in Table 3 where we give ratios\nτ (3)\n\nτ\nMkl\n− Mkl\nτ\nMkl\n\n(69)\n\nfor the τ -moments defined in Eq. (68). Then only τ -moments for large values of l and small\nvalues of k show perturbative behaviour. The bottom line in Table 3 is drastically different\nfrom the rest of the table, the reason being that the massless pion only contributes to moments\nwith l = 0. This makes the large k moments still reasonably precise using only third-order\npower corrections.\n\n4.3\n\nModifications of the model for the axial channel\n\nHere we discuss the choice of the spectrum in the axial channel. One can suggest forms differing\nfrom those given in Eq. (57). The reason for this freedom is that we have two resonances which\nare essential at low energies – the pion and a1 meson – that bring in four free parameters: the\ntwo residues of the resonances, the mass of the a1 meson, and the beginning of the continuum.\nTherefore, two requirements for the vanishing of the power corrections 1/Q2 and 1/Q4 are not\nsufficient to uniquely fix the low-energy spectrum in a simple way (with only one scale). There\ncan be many different additional requirements all reasonably close to the experimental data.\nNote that the a1 meson shows up as a broad resonance which provides additional freedom in\nparameterizing its contribution to the spectrum. For a precision application the best choice is\nto fix the pion residue and the mass of the a1 meson to their experimental values while leaving\n\n35\n\n\fρA(s )\n\n4π 2 f π2\n\n4π 2 f a2\n\naxial−vector correlator\n\n1\nπ\n0\n\ncontinuum\n\na1\n2m A2\n\ns\n\ns0\n\nFigure 5: Spectral density for the modified axial-vector channel model given by Eq. (72).\nits residue and the continuum threshold to be determined from OPE. In fact, the experimental\nvalue of fπ and simple duality requirements give a rather good description of the axial channel.\nAnother possibility is to fix the residue of the a1 meson to be 2m2A as in the vector channel\n(see Eq. (48)). Then the spectrum in the axial-vector channel reads\n√\n√\nρA (s) = 2( 2 − 1)m2A δ(s) + 2m2A δ(s − 2m2A ) + θ(s − 2 2m2A )\n\n(70)\n\nwhich also leads to a result in which the coefficients of the first two power corrections vanish.\nThe third coefficient of the large Q2 expansion of the axial correlator now reads\n√\n2\n8\ncA\n3 = (3 − 2 2) = 0.457528 <\n3\n3\n\n(71)\n\n(cf. Eq. (60)) which is smaller than in the model given by Eq. (57). It is also smaller than in\nthe vector channel which can lead to a (slight) contradiction with the phenomenology if the\nscales mV and mA are identified and factorization of the four-quark condensate is taken as\nbeing exact. Still it is numerically acceptable from the phenomenological point of view.\nHaving fixed the mass of the a1 meson to 2m2A one has a one-parameter family of spectra\nin the axial-vector channel\nρA (s) = 4π 2 fπ2 δ(s) + 4π 2 fa2 δ(s − 2m2A ) + θ(s − s0 )\n\n(72)\n\nwith s0 being a free parameter. Then\n4π 2 fa2 =\n\ns20\n,\n4m2A\n\n4π 2 fπ2 = s0 −\n\ns20\n.\n4m2A\n\n(73)\n\nThe spectral density of is modified model for the axial channel is shown in Fig. 5. One constraint\nfor the construction of the model is s0 > 2m2A . However, this constraint is quite weak. One\ncan actually admit a resonance as a bump in the continuum which is almost the case for\n36\n\n\fthe a1 meson. The positivity constraint for fπ2 is given by s0 < 4m2A and has to be taken\nseriously. Note that at s0 = 4m2A the pion decouples and does not contribute (fπ = 0) to\nthe spectrum of the correlator which is not the case in reality. For some values of s0 in the\ninterval 2m2A < s0 < 4m2A the spectrum can be fixed by taking the experimental value for\nfπ . A possible additional constraint is given by the value of the dimension-six condensate.\nThis was used for the finite-energy sum rule analysis and turned out to be rather successful\nphenomenologically [41].\nThe residue of the a1 meson and the continuum threshold for the model in Eq. (72) (as\nbeing expressed in terms of the pion decay constant fπ and the mass ma1 of the a1 meson) are\ngiven by\ns0 =\n\n2m2A\n\n\u0012\n\n1+\n\nq\n\n1−\n\n4π 2 fπ2 /m2A\n\n\u0013\n\n,\n\n4π 2 fa2 = s0 − 4π 2 fπ2 .\n\n(74)\n\nThe consistency constraint reads\n4π 2 fπ2 /m2A ≤ 1.\n\n(75)\n\nExperimentally we have 4π 2 fπ2 ≈ m2A which is close to the model without a gap. Our conclusions\nabout moments are valid for these models as well.\nThe considerations obtained for the simple models lead to the conclusion that the structure\nof power corrections for the moments with weight (1 − s/Mτ2 )k is strongly infrared sensitive\nand nonperturbative. One can expect that this conclusion will be retained for a realistic model\n(QCD), i.e. that power corrections are very important and that the perturbation theory contribution is strongly suppressed for the moments with weight (1 − s/Mτ2 )k . This was to be\nexpected because these moments are saturated by resonances.\n\n4.4\n\nA note on theoretical models for power corrections\n\nFor the theoretical analysis of large k moments one needs all power corrections. These are\navailable only in specific models. In the previous parts of this section we have discussed models\nfor the spectra based on the experimentally measured shape of the spectra while taking into\naccount only main characteristic features of them. However, there are also theoretical results\nfor the spectra that are usually obtained in simplified models of quantum field theory and\nwhich, as one believes, can have some relation to the low-energy hadron spectra in QCD.\n37\n\n\fρ (s )\nV\n\nvector correlator\n\n1\n\n2m 2\n\n2m 2\n\n2m 2\n\n... s\n\nρ\nm 2 =m ρ2\n\nρA(s )\n\n5m 2\n\naxial−vector correlator\n\n1\n\n2m 2\n\nm2\nπ\n0\n\n3m 2\n\n2m 2\n\n...\n\na1\n2m 2 =m 2a\n\n1\n\ns\n\n4m 2\n\nFigure 6: Spectral density of the narrow resonance models for the vector and axial-vector\nchannel as given in Eqs. (78) and (82).\nThe old example is two-dimensional QED (QED2 ) which was solved by Schwinger [46]. The\nOPE for current correlators in QED2 was analyzed in Ref. [47]. In this model the scale of\npower corrections is given by the dimensional charge e (the model is super-renormalizable).\nBoth vector and axial-vector currents have the same scale e2 /π, in fact they are given by a free\nmassive field and are trivial in this respect. The photon acquires a mass due to the anomaly.\nThe interesting channels are that of the scalar and pseudoscalar currents, the correlators for\nwhich are known exactly and give an example of a really nontrivial spectrum [47].\nThere are some results concerning all-order perturbation theory diagrams calculations in a\nladder approximation [48]. These results can be used for constructing realistic four-dimensional\nmodels where all power corrections are explicitly known. The sum rule analysis of OPE in such\nmodels can reveal some features different from the standard phenomenlogy [49].\nA popular model is the 1/Nc approximation both in four and two-dimensional Abelian and\nnon-Abelian theories (see e.g. Ref. [50, 51]) where the spectrum is given by infinitely narrow\nresonances, as shown in Fig. 6. This type of spectrum is predicted by a Regge analysis or by\nlocal duality arguments. A recent analysis along this line was presented in Refs. [52, 53].\nThe model of narrow resonances inspired by the 't Hooft model was analyzed in QCD on\nthe basis of local duality [43]. The spectrum was studied within the local duality approach\n\n38\n\n\fwhere one has [43]\nm2n = (2n + 1)m2ρ ,\n\nfn2 = 2m2ρ\n\nn = 0, 1, . . .\n\n(76)\n\nfor the vector channel and where mρ is the mass of the the ground state ρ meson. For the\naxial-vector channel including a massless pion as Goldstone boson (axial channel) the result of\nthe local duality approach coupled with the 1/Nc approximation reads [43]\n1\nf02 = 4π 2 fπ2 = m2a1 = m2ρ ,\n2\n\nm2n = nm2a1 ,\n\nfn2 = 2m2ρ = m2a1 ,\n\nn = 1, 2 . . .\n\n(77)\n\nwhere ma1 is the mass of the ground state a1 meson. The structure of the spectrum reflects the\nclassical results on chiral symmetry and Weinberg's relations for axial-vector and vector meson\nmasses which is realized if one identifies the scales in both channels, m2a1 = 2m2ρ = 2m2 . This\nidentification leads to a simplified picture where two chains of resonances are simply shifted by\nan amount m2ρ = m2 . This is the gross structure of the spectrum. Experimental results differ\nquite a bit from this picture, but such details can be accounted for by using the OPE [41].\nWithin the model based on the local duality approach the summation of all resonances\nresults in the vector correlator\nΠV (Q2 ) =\n\n∞\nX\n\n∞\nX\nfn2\n2m2\n=\n=\n2\n2\n2\n2\nn=0 mn + Q\nn=0 (2n + 1)m + Q\n∞\nX\n\nQ2 + m2\n1\n=\n−ψ\n=\n2\n2\n2\n2m2\nn=0 n + (Q + m )/(2m )\n\n!\n\n+ subtractions.\n\n(78)\n\nHere ψ(z) is the digamma function. To find the link to the OPE we consider the large Q2\nbehaviour of the model correlator in Eq. (78). The large z expansion of the digamma function\nψ(z) reads\nn−1\nX B2k\n1\n1\nψ(z) = ln z −\n−\n+ O 2n\n2k\n2z k=1 2kz\nz\n\n\u0012\n\n\u0013\n\n(79)\n\nB2k+1 = 0\n\n(80)\n\nwhere B2k are the Bernoulli numbers\nB2k =\n\n(−1)k−1 (2k)!\nζ(2k),\n22k−1 π 2k\n\nand ζ(2k) is the Riemann ζ function. This expansion is an asymptotic expansion. For the\ncorrelator one then obtains\nμ2\nΠV (Q ) = ln\nQ2\n2\n\n!\n\nm4\nm6\n7m8\nm10\n−\n+0 6 +\n+ 0 10 + . . .\n6Q4\nQ\n60Q8\nQ\n39\n\n(81)\n\n\fwhere the renormalization scale μ comes in through the subtraction term. Note that the\nexpression in Eq. (81) is quite different from the result obtained in Eq. (50).\nIn the axial channel the model based on local duality (with parameters from Eq. (77)) leads\nto the expression\nΠA (Q2 ) =\n\n∞\nX\nm2a1\nf02\nfn2\n=\n+\n=\n2\n2\nQ2 n=1 m2a1 n + Q2\nn=0 mn + Q\n∞\nX\n\n∞\nm2a1\nm2a1 X\n1\nQ2\n+\n−\nψ\n=\n−\n=\n2Q2 n=1 n + Q2 /m2a1\n2Q2\nm2a1\n\n!\n\n+ subtractions\n\n(82)\n\nand the large Q2 behaviour reads\n\nμ2\nΠA (Q ) = ln\nQ2\n2\n\n!\n\n+\n\nm4a1\nm6a1\nm8a1\nm10\na1\n+\n0\n−\n+\n0\n+ ...\n12Q4\nQ6\n120Q8\nQ10\n\n(83)\n\nIn this case all power corrections of dimension 2(2k + 1) vanish because of B2k+1 = 0. This\ncontradicts the results of OPE since there is no explicit (symmetry) reason for such a property.\nAt moderate orders of n the structure of the expansion of Eq. (82) as given in Eq. (83) is inconsistent with the asymptotic expansion expected from the OPE (see Eqs. (48), (49), (50), (58),\nand (59)) and, therefore, is not supported by phenomenology. Though the model of infinitely\nnarrow resonances is rather attractive, this inconsistency was the reason that this model was\nnot analyzed quantitatively in the literature and was instead considered only as a rough approximation for the first few moments (duality relation). Indeed, the zeroth moment is correct\n(no 1/Q2 terms) and the first moment is correct in the approximation of a vanishing gluon condensate contribution but the vanishing of the dimension-six terms are definitely unacceptable\nphenomenologically. The high order 1/Q2 behaviour can be easily corrected by shifting the\nparameters of the first one or two resonances. But then the simplicity of the functional form\nof this model with its one-parameter dependence for the whole spectrum is lost.\nThe qualitative difference of the models given in Eqs. (81) and (83) from the previous case\nwith a continuum contribution, however, is the analytic structure of the correlators. In the\nnarrow resonance model one only has a single dimensional parameter m2 and one would expect\nthe power corrections to behave as (m2 /Q2 )n with m2 determining the scale. However, the\ncoefficients of the power corrections given by the Bernoulli numbers grow quite fast as the large\nk behaviour demonstrates,\nB2k = 4(−1)\n\nk−1\n\n√\n\nk\nπk\nπe\n40\n\n!2k\n\n(1 + o(1))\n\n(84)\n\n\f(the notation o(xp ) indicates contributions which fall off to zero faster than xp for x → 0).\nThus, the expansion in Eqs. (81) and (83) is only asymptotic. The reason for the divergent\nnature of the series of power corrections is that for the models given in Eqs. (78) and (82)\nthere are poles located arbitrarily far away from the origin Q2 = 0. In this model, therefore,\nthere is in fact an infinite number of scales nm2 for positive integers n. This is the reason\nwhy perturbation theory does not work even at sufficiently large s. But if one approximates a\nchain of resonances by a continuum starting from some threshold s0 , one instead gets a finite\nradius of convergence of the order s0 , Q2 > s0 and a well working perturbation theory picture\nat s > s0 .\nLet us compare the behaviour of moments for such models. Because of the complicated\nargument of the ψ function in Eq. (78) for the vector correlator, power corrections in the form\nof an expansion in 1/Q2 are not directly given by the expansion of the ψ function. This makes\nthe calculation of an arbitrary term for the vector correlator clumsy. In case of the axial\ncorrelator this expansion is straightforward as one can see from Eq. (82). Therefore, we shall\nonly analyze the axial channel but will give a functional relation that holds for both correlators\nin these models. Identifying 2m2 with m2a1 , m2a1 = 2m2 one finds\nm2\nQ2\n\n(85)\n\nm2\n.\nq2\n\n(86)\n\nΠA (Q2 ) = ΠV (Q2 − m2 ) −\nor, when rewritten in the Minkowskian domain,\nΠA (q 2 ) = ΠV (q 2 + m2 ) +\n\nThis relation is inspired by particular models for the spectra but can be checked for experimental\ndata as well (for Adler's functions which are independent of subtractions).\nThe narrow resonance model for the vector and axial channel does not display the difference\nbetween low and high energies. The only criterion of perturbation theory calculability is the\nlength of the averaging interval while its position in terms of energies is almost unimportant.\nThis is a natural feature of the translation invariance of the spectra in these models. We now\ndiscuss the moments in the axial channel in more detail. In order to obtain simple estimates\nwe take the averaging interval to be 5m2 (in \"real life\" the averaging interval is given by Mτ2 =\n5.15m2ρ but 5m2 = 5m2ρ is a good approximation). We check the quality of the decomposition\n41\n\n\fvector\n\nn=0\n\nn=1\n\nn=2\n\nn=3\n\nn=4\n\nn=5\n\nn = 10 n = 20\n\n∆V0n\n\n+0.00 +0.00\n\n−0.03\n\n−0.06 −0.09\n\n−0.13\n\n−0.40\n\n−0.82\n\n∆Vn0\n\n+0.00 +0.00\n\n−0.03\n\n−0.06 −0.09\n\n−0.13\n\n−0.40\n\n−0.82\n\naxial\n\nn=0\n\nn=2\n\nn=3\n\nn=4\n\nn=5\n\nn = 10 n = 20\n\n∆A\n0n\n\n+0.00 −0.04 −0.04\n\n−0.08 −0.13\n\n−0.19\n\n−0.53\n\n−0.90\n\n∆A\nn0\n\n+0.00 +0.04\n\n+0.16\n\n+0.39\n\n+1.23\n\n+3.20\n\nn=1\n\n+0.08\n\n+0.26\n\nTable 4: Deviations ∆Vkl and ∆A\nkl (see Eq. (87)) of the moments for the narrow resonance vector\nV /A\n\nand axial channel model with respect to the parton contribution ∆kl\n\n= 1 for k = 0 or l = 0.\n\nfrom the perturbation theory point of view, i.e. we write the result in the form\nMkl = 1 + ∆kl .\n\n(87)\n\nThe direct l moments obtained for the power expansion in Eq. (83) are (for l > 0) given by\nm2a\nM0l = 1 + (l + 1)\nMτ2\n\n!2l\n\nB2l .\n\n(88)\n\nFor large values of l the decomposition as given in Eq. (87) is useless because the coefficients\nare growing very fast and thus the second term becomes large (see Eq. (84)). Still, for odd\nmoments the decomposition is precise because then only one power correction is picked up and\nits contribution vanishes. However, the result based on the asymptotic value M0l = 1 is quite\ndifferent from the exact answer\nM0l =\n\nm2a\nMτ2\n\n!2l\n\n2m2a\n+\nMτ2\n\n!2l\n\n.\n\n(89)\n\nThe reason for this is that the asymptotic behaviour is too crude to resolve the position of the\npoles near the origin. This can be seen from the expression for the vector channel where the\nappropiate expansion parameter for power corrections is 1/(Q2 + m2 ) instead of 1/Q2 . In other\nwords, the scale Mτ2 is two small to be able to reflect any information about remote poles which\ngive contributions to the asymptotic behaviour at large Q2 .\nFor the mixed moments in the axial channel our result are given in the lower part of\nTable 4. We give only numerical results because it is not straightforward to represent the\n42\n\n\fdecomposition analytically. The message is clear: both systems of moments – direct and mixed\n– are nonperturbative which is expected for this model where for any energy region the spectrum\nhas nonperturbative character (close to a singularity).\nAn even more symmetric picture emerges in the vector channel. In this case one does not\nsee such a drastic difference between moments as should be expected from the perturbation\ntheory point of view: the situation is symmetric, the scale of \"bumpiness\" is the same at the\nboth ends of the spectra. This fact makes both systems of moments almost equivalent. If we\ntake the average interval 6m2 , the result for exact moments is the same for both systems of\nmoments because of the relation\n(1 − 1/6)n + (1 − 3/6)n + (1 − 5/6)n = (1/6)n + (3/6)n + (5/6)n ,\n\n(90)\n\nas shown in the upper part of Table 4. In general, for the vector current there is just an exact\nsymmetry of the model spectrum s → (2km2 − s) which makes the result of the calculation for\nboth systems of moments simply equal. Still the contribution of power corrections is different\nfor different systems of moments and, moreover, does not allow to restore the shape of the exact\nspectrum.\nThis symmetry of the simplified model spectrum is definitely violated in the realistic phenomenological spectrum, making the region of high energy essentially different from the low\nenergy domain. This is because of the asymptotic freedom in QCD where at large energies the\nspectrum becomes a more and more continuous function because the features of the resonances\nas distributions becomes less and less pronounced. This also means that the model for the\nspectrum as an infinite chain of infinitely narrow resonances does not properly incorporate the\nasymptotic freedom of QCD in a sense of scale invariance violation.\nWe should note here that if there is a new situation at large energies (as the production of\nheavy quarks near their threshold) one should do the analysis as if the energy were counted\nfrom the respective thresholds. It is not the absolute value of the energy that matters but the\ndistance from the strong interaction region.\nAs a last remark we stress that even the formal knowledge of the asymptotic series in\n1/Q2 does not allow one to restore the spectrum point-wise. This reflects the same situation\nas in phenomenological analyses, namely that the determination of the spectral density is\n43\n\n\fan improperly posed problem (inverse problem). In our particular example one can actually\nobserve this feature. For the axial channel one can still figure out the spectrum from the\ncoefficients by restoring the full function but for the vector channel it is not straightforward.\nThere is actually no systematic method for doing so. Taking just the \"leading\" asymptotics for\nthe coefficients one can easily obtain identical results for the axial and vector channels which is\ndefinitely an unwelcome result as regards low-energy phenomenology. Therefore, the technique\nwhich could produce such a result (like the Borel summation of the \"leading\" asymptotics) can\nbe quite misleading for calculating the low-energy spectrum as we know it from phenomenology.\n\n5\n\nOn the determination of the strange quark mass\n\nIn case of the (ūs) current the mass of the strange quark should be taken into account. This was\ndiscussed recently in Refs. [6, 7, 8]. The conclusions we have previously drawn about moments\nwith weight function (1 − s/Mτ2 )k for the massless case remain the same. We comment only\non a new feature of the massive correlators with the s quark mass ms considered as a small\ncorrection. The occurrence of the strange quark mass leads to an additional freedom in the\nchoice of the scalar function for the momentum-type analysis because the correlator is no\nlonger transverse (unlike in Eq. (3)). In the literature there are different suggestions about\nwhich of the correlator parts Πq (q 2 ) and Πg (q 2 ) in Eq. (2) is better suited for the extraction\nof the strange quark mass. It is worth to have a closer look at the situation. While in present\ncalculations radiative corrections are taken into account, the important term is still the leading\norder contribution. Because ms is small, this gives a correction which should be taken at the\nlowest order available in order to have a reasonable accuracy. The leading order spectral density\nfor the current ūγμ (γ5 )s related to the part Πq (q 2 ) of the correlator in Eq. (2) reads\n3m4s 2m6s\nρq (s) = 1 − 2 + 3 θ(s − m2s ).\ns\ns\n!\n\n(91)\n\nThis spectral density is perturbatively insensitive to m2s because at large s the expression in\nEq. (91) starts with a term proportional to m4s . A term of order m2s appears only after the\nintegration of the spectrum over s with weight functions which are hard (nonvanishing) at the\norigin (at s ∼ m2s or s = 0 for small m2s ). Moments given by powers of s (as sl , l > 0) have no\n44\n\n\fcontribution of order m2s . Indeed, for the zeroth order direct moment one finds\nq\nM00\n\n=\n\nZ\n\nMτ2\n\nm2\n\nm2s\nm2s\nρq (s)ds\n=\n1\n−\n3\n+\n3\nMτ2\nMτ2\nMτ2\n\n!2\n\nm2s\n−\nMτ2\n\n!3\n\n(92)\n\nwhere a term of order m2s occurs. On the other hand, for the first moment\nq\nM01\n\n=2\n\nZ\n\nMτ2\n\nm2\n\ns\nMτ2\n\n!\n\nρq (s)ds\nm2s\n=\n1\n+\n3\nMτ2\nMτ2\n\n!2\n\nm2s\n−4\nMτ2\n\n!3\n\nm2s\n+6\nMτ2\n\n!2\n\nm2s\nln\nMτ2\n\n!\n\n(93)\n\nthere is only a logarithmically enhanced m4s contribution. For higher moments there are only\nhigher order corrections, e.g. for l = 2 one has\nq\nM02\n\n=3\n\nZ\n\nMτ2\n\nm2\n\ns\nMτ2\n\n!2\n\nρq (s)ds\nm2s\n=\n1\n−\n9\nMτ2\nMτ2\n\n!2\n\nm2s\n+8\nMτ2\n\n!3\n\nm2s\n−6\nMτ2\n\n!3\n\nm2s\n.\nln\nMτ2\n!\n\n(94)\n\nTherefore, perturbative sl -moments of Πq (q 2 ) have no sensitivity to m2s . This is also expected\nfor this correlator part because the mass corrections start from power corrections and lead to\nno cut which is a perturbative singularity in QCD and reliable for large s. Note in passing that\nthis is also the reason why the perturbation theory expansion for the coefficient function of m2s\nin the correlator part Πq (q 2 ) is known by one term less than that for the part Πg (q 2 ): for the\ncorrelator part Πg (q 2 ) only divergent parts of the four-loop diagrams are necessary while for\nthe part Πq (q 2 ) one has to calculate the finite contributions of the four-loop diagrams which is\nbeyond the scope of present computational algorithms.\nThe afore mentioned structure of the spectral density also means that there is no way to\nimprove the theoretical accuracy of the contribution of the mass by making the corresponding\ncoefficient function more perturbative: as soon as one tries to make the coefficient function\nmultiplying m2s more perturbative by introducing an additional suppression by a power of s (or\nby increasing l for the modified moments), the contribution of the mass becomes parametrically\nsmaller, so instead of m2s one has m4s in the leading order. When the anomalous dimension of\nthe mass is taken into account, the power s then leads to an additional suppression by a power\nof αs .\nOn the other hand, the (Mτ2 −s)k -moments all have the same contribution of order m2s given\n\nq\nsimply by the zero order direct moment M00\nof Eq. (92),\n\nq\nMk0\n\n= (k + 1)\n\nZ\n\nMτ2\n\nm2\n\ns\n1− 2\nMτ\n\n!k\n\nm2s\nρq (s)ds\nm2s\n= 1 − 3(k + 1) 2 + o\n.\nMτ2\nMτ\nMτ2\n!\n\n45\n\n(95)\n\n\fThis amplitude is used in Ref. [8] where a better stability in the MS scheme was detected.\nIn contrast to ρq (s), for the spectrum ρg (s) of the amplitude Πg (q 2 ) in Eq. (2) one has\n3m2s\nm6\nρg (s) = −s +\n− s2 θ(s − m2s )\n2\n2s\n!\n\n(96)\n\nwhich is sensitive to m2s for large s. Any perturbative moment of this amplitude has m2s\ncontributions and can be used in the perturbation theory analysis of m2s corrections. Namely,\nM0lg\n\n= (l + 1)\n\nZ\n\nMτ2\n\nm2s\n\ns\nMτ2\n\n!k\n\nl+1\nm2s\n3m2s\nds\n+\no\n−\nρg (s) 2 = −Mτ2\nMτ\nl + 2 2Mτ2\nMτ2\n(\n\n!)\n\n.\n\n(97)\n\nTherefore, the choice of the correlator part Πg (q 2 ) is definitely more reliable perturbatively\nfor analyzing mass corrections, a fact that is also discussed in Refs. [6, 7]. However, the\nexperimental situation is again less favourable to the choice of Πg (q 2 ) in comparison to Πq (q 2 ).\nThe correlator part Πq (q 2 ) contains a contribution of the K meson which is well pronounced\nand can be easily seen while the amplitude Πg (q 2 ) contains only spin-one states and is poorly\nmeasured. In order to benefit from a better experimental accuracy, the use of the amplitude\nΠq (q 2 ) is favoured, but this choice leads to sum rules which are rather similar to the pseudoscalar\nsum rules (see e.g. Ref. [54]) and does not provide new aspects for the strange quark mass\ndetermination specific to τ decays.\n\n6\n\nIntegration of running effects to all orders\n\nIn this section we discuss the technique of resumming the effects of renormalization group\ncaused running of the strong coupling and other parameters (simply called \"running\" in the\nfollowing) by taking the integration path along the contour of a circle in the complex q 2 plane. As was discussed earlier in Sec. 3, the integration along the contour of a circle in\nthe complex q 2 -plane is completely equivalent to the integration along the cut if finite-order\nperturbation theory expressions for the polarization functions are used. This is the direct\nmathematical consequence of the analytic properties of the functions lnp (−Mτ2 /q 2 ) for positive\ninteger values p. However, if the renormalization group improved polarization function is used\nfor the integration, some new features appear. This was also discussed in Sec. 4. The reason\nfor this is that the analytic properties of resummed polarization functions are different from\nthose in finite-order perturbation theory.\n46\n\n\fThe integration along the contour including a full renormalization group resummation is\nnow the most popular technique of accounting for the running of perturbative quantities: it\nefficiently resums an infinite number of terms generated by the evolution of the coupling constant [55, 56]. Clearly it also includes some nonperturbative features when an infinite number\nof terms is resummed which means that this also constitutes a special recipe for resummation of\nperturbation series [57]. The formulae for the integration along the circle are known in a closed\nform as one-fold integrals but the final integration itself is usually done numerically. An analysis of the analytical form of these integral expressions is useful for clarifying the real content of\nsuch a resummation technique. In doing this we discuss how our general considerations given\nin the previous sections work within this resummation technique. It should definitely give the\nresults confirming the physical considerations (effective scale structure) qualitatively, otherwise\nthe technique of resummation would be irrelevant for physical applications. As we shall see, the\nresummation technique fully agrees with the conclusions about perturbative calculability and\nasymptotic structure of the moments found in the analysis on the cut in the previous sections.\n\n6.1\n\nQuantities on the circle\n\nAs in the case of the analysis on the physical cut, our main concern is to account for the\nrunning. Therefore, the introduction of an effective coupling is helpful. Here we introduce an\neffective coupling in the Euclidean domain which requires some new notation.\nWe start with Adler's function in Eq. (12), introducing the effective strong coupling αE (Q2 ),\nD(Q2 ) = −Q2\n\nd\nαE (Q2 )\n2\nΠ(Q\n)\n=\n1\n+\n.\ndQ2\nπ\n\n(98)\n\nThe effective coupling αE (Q2 ) obeys the renormalization group equation (see e.g. [58])\nd\nQ\ndQ2\n2\n\nαE (Q2 )\nπ\n\n!\n\n= β(αE (Q2 )).\n\n(99)\n\nFor the considerations we are aiming at it is enough to use only leading order in the β-function\nwhich contains already the bulk of the whole effect. Effects due to higher order corrections of\nthe β-function are really small and do not change the basic picture. They only slightly affect\nthe conclusions numerically [59]. Therefore, we consider the renormalization group equation\nd\nQ\ndQ2\n2\n\nαE (Q2 )\nπ\n\n!\n\n= −β0\n\n47\n\nαE (Q2 )\nπ\n\n!2\n\n.\n\n(100)\n\n\fThe resummed correlation function reads\nμ2\nΠ(Q ) = ln\nQ2\n2\n\n!\n\n1\nαE (Q2 )\nln\n+ subtractions\n+\nβ0\nπ\n!\n\n(101)\n\nwhere\nατ\n1 + (β0 ατ /π) ln(Q2 /Mτ2 )\n\nαE (Q2 ) =\n\n(102)\n\nwith ατ = αE (Mτ2 ). Taking this into account and parameterizing the contour by Q2 = Mτ2 eiφ\none obtains\nΠ(Mτ2 eiφ ) = −iφ −\n\n1\nln(1 + iβ0 ατ φ/π) + subtractions\nβ0\n\n(103)\n\nwhere appropriate subtractions are added. The first term is the parton contribution which is\nindependent of ατ . This term is readily be taken into account. We therefore concentrate on\nthe contribution coming from the second term which is ατ dependent.\nThe analysis of this second part can now be done for the moments Mkl , given by\nMkl\n\n(−1)l (k + l + 1)!\n= 1 + mkl =\nΠ(Mτ2 z)(1 + z)k z l dz =\n2πi\nk!l!\n|z|=1\nZ\n(−1)l (k + l + 1)! π\nΠ(Mτ2 eiφ )(1 + eiφ )k ei(l+1)φ dφ.\n=\n2π\nk!l!\n−π\nI\n\n(104)\n\nTaking the polarization function as given in Eq. (103), the first part leads to the parton result\nMkl = 1 while the second, ατ -dependent part gives the moment mkl where\n(−1)l+1 (k + l + 1)!\nmkl =\n2πβ0\nk!l!\n\nZ\n\nπ\n\n−π\n\n(1 + eiφ )k eilφ ln(1 + iβ0 ατ φ/π)eiφ dφ.\n\n(105)\n\nNote that the estimate of the saturation region for the moments given by integrals like the one\nin Eq. (105) is a bit trickier than in the case of the integration on the cut. On the cut the\nmeasure is positive and is normalized to 1 for any type of moments with n ≥ 0,\n(n + 1)\n\nZ\n\n0\n\n1\n\nxn dx = 1\n\nand\n\n(n + 1)\n\nZ\n\n1\n\n0\n\n(1 − x)n dx = 1\n\n(106)\n\nwhich makes the estimate of integrals\n(n + 1)\n\nZ\n\n1\n\n0\n\nxn f (x)dx\n\n(107)\n\nfor continuous (and rather smooth) functions f (x) straightforward. In the present case, however, the measure of the integration region is oscillating and vanishes for constant functions\n(k ≥ 0, l ≥ 0),\n\nZ\n\nπ\n\n−π\n\n(1 + eiφ )k eilφ eiφ dφ = 0.\n48\n\n(108)\n\n\fTherefore, some additional care in the consideration of essential regions of integration is necessary for the formulation of moments on the contour. Note that we have already encountered\nsuch a problem while analyzing the moments of the narrow resonance contributions. Therefore,\nthe intuition gained from the situation with continuous functions generally does not work for\ndistributions.\n\n6.2\n\nTechniques for the calculation of contour moments\n\nBecause explicit functions are given in Eqs. (101), (103), (104), and (105), the discussion of the\nrepresentation and properties of the moments on the contour is a pure mathematical problem.\nSince that moments on the circle (as in Eq. (105)) are just Fourier coefficients of the correlation\nfunctions Π(Q2 ), the technique for working with these is well-known. One finds similarities\nto the evaluation of sunset diagrams for the case when the problem is reduced to a Fourier\ntransform.\nFor β0 ατ < 1 the moments in Eq. (105) can be expanded in a convergent series in ατ . The\nfinite radius of convergence within this technique of resummmation is a general feature which\npersists in higher orders of the β-function and was studied in some detail [59]. The convergence\nradius decreases when higher orders of the β-function are included. If we compare the value of\nthe effective coupling in τ decays (not to be mistaken with the coupling within the MS-scheme)\nατexp\n= 0.14\nπ\n\n(109)\n\n1\n4\n=\n= 0.1415 . . . ,\nπβ0\n9π\n\n(110)\n\nwith\n\nthe relation β0 ατ < 1 is still valid, though almost marginally. However, the exact expression\ngiven in Eq. (105) without expansion of the logarithm provides an analytic continuation beyond\nthe convergence radius even when ατ lies outside the convergence radius.\nWe first consider the basic moment m00 . The discussion of this basic moment leads to the\ntechnically simplest (shortest) expressions while containing already all features of the general\ncase. The generalization to other moments (and types of moments) is then straightforward.\nThe most direct way of calculation is to expand the logarithm in the integrand in Eq. (105)\nin a series in ατ which gives nothing new in comparison with the finite-order perturbation\n49\n\n\ftheory case. However, one can generate all terms of the series because the function is known.\nThe series obtained by this procedure represents an analytic function of the coupling constant\nat the origin. Therefore, for small ατ this series can be used for a numerical evaluation of the\nmoments. This procedure may not be the best one concerning economy of evaluation since many\nterms may be needed to determine values of ατ close to the convergence boundary. A finite\npiece of the convergent series gives different accuracy and can also completely misrepresent the\nfunction if ατ is beyond the convergence radius (which is not so dramatic for positive values of\nατ , though).\nOne can proceed with the analysis of the moments in a different way by constructing just\nan efficient computational scheme. Integrating n times by parts one obtains (we remind the\nreader that we use the zeroth order moment for simplicity)\nm00\n\nn−1\nX\n1\nβ0 ατ\n=\nφ + (j − 1)!\nπβ0\nπr\nj=1\n\n(\n\n!j\n\n(n − 1)!\nsin(jφ) +\n2\n\nβ0 ατ\nπ\n\n!n Z\n\nπ\n−π\n\neiφ dφ\n. (111)\n(1 + iβ0 ατ φ/π)n\n)\n\nwith the polar coordinate functions r and φ (note the difference to φ!) defined by\n1 ± iβ0 ατ = re±iφ ,\n\nr=\n\nq\n\n1 + β02 ατ2 ,\n\nφ = arctan(β0 ατ ).\n\n(112)\n\nThe n-fold integration by parts removes a polynomial of order n from the expansion of the\nlogarithm in Eq. (103).\nOne can see that the result is an asymptotic expansion as the residual term, i.e. the last term\nin Eq. (111) is of the formal order ατn . However, the obtained result is not a series expansion\nin the original coupling determined in the Euclidean domain but a more complicated system\nof functions related to it. The system of functions is ordered and the asymptotic expansion\nis valid in the sense of Poincaré. The system of functions is obtained by using the expression\nfor the running coupling in Eq. (102) in the Euclidean domain and continuing it into the\ncomplex plane and onto the cut. When the analytic structure of the initial function is known,\nasymptotic expansions which converge fast for the first few terms (as a representation in the\nform of Eq. (111)) are more useful for practical calculations than formal convergent series that\nrequire many terms for getting a reasonable accuracy.\nThe expansion in Eq. (111) can give a better accuracy (for some n and ατ ) than a direct\nexpansion in αs . Indeed, this expansion includes a partial resummation of the π 2 terms which\n50\n\n\fis a consequence of the analytic continuation [39]. Therefore, the expansion can be understood\nas being done in terms of quantities defined on the cut. This is evident because in some sense\nthe procedure consists in calculating derivatives of the spectral density on the cut. Because the\nregion near the real axis is important, the continuation causes a change of the effective expansion\nq\n\nparameter ατ → ατ / 1 + β02 ατ2 . The first term in the expansion shown in Eq. (111) is just the\nvalue for the spectral density expressed through the coupling in the Euclidean domain. It can\nbe considered as a change of the scheme at large values of s.\nWith the concise expression for the moments at hand one can change the form of the residual\nterm. The relation\nβ0 ατ\n(n − 1)!\nπ\n\n!n Z\n\n= 2πe−π/β0 ατ\n\neiφ dφ\n=\n−π (1 + iβ0 ατ φ/π)n\n!n \u0012Z\nZ ∞\u0013\n−π\nβ0 ατ\neiφ dφ\n− (n − 1)!\n+\nπ\n(1 + iβ0 ατ φ/π)n\n−∞\nπ\nπ\n\n(113)\n\nvalid for any n leads to a representation of the zeroth order moment in the form\nm00\n\nn−1\nX\nβ0 ατ\n1\n(j − 1)!\nπe−π/β0 ατ + φ +\n=\nπβ0\nπr\nj=1\n\n(\n\n(n − 1)!\n−\n2\n\nβ0 ατ\nπ\n\n!n \u0012Z\n\n−π\n\n−∞\n\n+\n\nZ\n\n∞\u0013\n\nπ\n\n!j\n\nsin(jφ)\n\neiφ dφ\n.\n(1 + iβ0 ατ φ/π)n\n)\n\n(114)\n\nHere an explicit nonperturbative term e−π/β0 aτ has appeared. Eq. (114) and Eq. (111) are\nformally different but actually identical. Therefore, the choice for the expansion (or representation) for the moment is a question of calculating the residual term. This quantitative\nconsideration is, of course, only possible if one has a concise expression for the function from\nwhich the series is generated as given by Eq. (105) in our case. Any conclusions about the\nprecision or the analytic structure of the sum of the series based on the terms of the series only\nwithout a specification of the residual term are rather useless as one can see from Eq. (113).\nWe stress that the moments in Eq. (105) are analytic functions of ατ for small values of the\ncoupling ατ . This means that the non-analytic piece in Eq. (113) cancels the corresponding piece\nin the residual term. If the residual term is dropped, the analytic structure drastically changes\ndepending on which representation, either Eq. (111) or (114), is used. This demonstrates the\ndanger of reaching conclusions about power corrections emerging from the extrapolation of the\nrunning to the IR region. Mathematically, or from a theoretical point of view, a conclusion of\n51\n\n\fR\n\noo\ncomplex\nφ −plane\n\n−π\n\nπ\n\nFigure 7: the integration contour in the complex φ-plane\n\nthis type is a hypothesis, especially having in mind that such power corrections are not necessary\nin any way for the consistency of the theory (in contrast to the OPE corrections which are welldefined in perturbation theory and are motivated by, say, explicitly distinguishing different\nchannels). Physically, the use of such corrections is very difficult to appreciate if higher order\nterms of the expansion in αs are taken into account, i.e. an explicit nonperturbative term in the\nexpression, not being special in any general way, does not numerically differ from the higher\norder terms as well.\nYet another representation for the moments can be readily obtained. It is possible to recover\nthe form of the moments as integrals over a spectral density (see below). But because moments\nare calculated as explicit functions, we can obtain a result by using a simple change of variables\nin a pure mathematical sense. In order to obtain this new representation we go to the complex\nplane in φ (see Fig. 7). As a technical trick we first integrate once by parts to obtain\nm00 =\n\nατ\n2π 2\n\nZ\n\nπ\n\n−π\n\n(1 + eiφ )dφ\n1 + iβ0 ατ φ/π\n\n(115)\n\nThis representation is somewhat different from the representation in Eq. (111) for n = 1. They\ndiffer by an integral which can be explicitly computed,\n!\nατ Z π\ndφ\n1\n1\n1 + iβ0 ατ\n=\n=\nln\narctan(β0 α).\n2\n2π −π 1 + iβ0 ατ φ/π\n2πiβ0\n1 − iβ0 ατ\nπβ0\n\n(116)\n\nNow we consider the integration over a rectangular contour in the complex φ-plane. The\npart of the contour on the real axis from −π to π leads to the moments. The integral over the\n\n52\n\n\fcontour is given by the residue at the pole φ = iπ/β0 ατ . We thus have\nm00\n\nατ π (1 + eiφ )dφ\n=\n=\n2π 2 −π 1 + iβ0 ατ φ/π\n!\niατ 1 + eiφ\n+\n=\nπ iβ0 ατ /π φ=iπ/β0 ατ\nZ\n\nατ ∞\n(1 + eiπ−ξ )idξ\n+\n(φ = π + iξ)\n2π 2 0 1 + iβ0 ατ − β0 ατ ξ/π\nZ\n(1 + e−iπ−ξ )idξ\nατ ∞\n+\n(φ = −π + iξ)\n+ 2\n2π 0 1 − iβ0 ατ − β0 ατ ξ/π\nZ π\nατ\n(1 + eiφ̃−R )dφ̃\n+ 2 lim\n.\n(φ = φ̃ + iR)\n2π R→∞ −π 1 + iβ0 ατ φ̃/π − β0 ατ R/π\nZ\n\n−\n\n(117)\n\nwhere we have indicated the substitutions for the different parts of the path. The last part\nvanishes because the integrand vanishes for R → ∞ while the integration range is finite. We\nthus obtain\nm00 =\n\n1\n1\n(1 + e−π/β0 ατ ) −\nβ0\nβ0\n\nZ\n\n∞\n\n0\n\n(1 − e−ξ )dξ\n.\nπ 2 + (ξ − π/β0 ατ )2\n\n(118)\n\n(1 − s/Mτ2 )ds\n.\n(π 2 + ln2 (s/Λ2 ))s\n\n(119)\n\n\n\n(120)\n\nNext we replace −π/β0 ατ = ln(Λ2 /Mτ2 ) and substitute −ξ = ln(s/Mτ2 ), so that e−ξ = s/Mτ2\nand −dξ = ds/s. One obtains\nm00\n\n1\nΛ2\n=\n1+ 2\nβ0\nMτ\n\n!\n\n1\nβ0\n\n−\n\nZ\n\n0\n\nMτ2\n\nA further transformation gives\nm00 =\n\n1\nβ0\n\n2\n\nΛ\nMτ2\n\n!\n\n+\n\n1\nπβ0\n\nZ\n\n\n\nMτ2\n\n2\n\nds\nln(s/Λ )\n\n.\narccos  q\n2\n2\nπ 2 + ln (s/Λ2 ) Mτ\n\n0\n\nOne easily recognizes this representation as an integration over the singularities of Π(q 2 ) in\nEq. (101). In addition to a cut along the positive semi-axis there appears also a part of the\nsingularity on the negative real s-axis. This part is a pure mathematical feature of the concrete\napproximation chosen for Π(q 2 ) and is not related to the physical content of the problem.\nIndeed, if moments are written as explicit functions we can calculate them in the way we find\nmost convenient for a concrete application. The result reads\nm00 =\n\nZ\n\nMτ2\n\n−Λ2\n\nwith\n\nσ(s)ds\nMτ2\n\n(121)\n\n\n\n\n\n1\n1\nln(s/Λ2 )\n.\nσ(s) = θ(Λ2 + s)θ(−s) +\nθ(s) arccos  q\nβ0\nπβ0\nπ 2 + ln2 (s/Λ2 )\n53\n\n(122)\n\n\fThis formal result can be reformulated as integration over the spectrum σ(s) using Cauchy's\ntheorem. Indeed, from Eq. (101) one readily deduces the singularity of the resummed polarization function with the discontinuity\nDisc Π(s) =\n\n\n\n(\n\n2\n\n)\n\n2πi\n1\nln(s/Λ )\n\nθ(Λ2 + s)θ(−s) + θ(s) arccos  q\n2\nβ0\nπ\n2\n2\nπ + ln (s/Λ )\n\n(123)\n\nwhich coincides with σ(s) in Eq. (122) and, thereby, simply represents the spectrum.\nThis spectral function σ(s) is shown in Fig. 8. The part of the spectrum on the positive\nreal axis is an analytic continuation of the renormalization group improved correlator function\nΠ(Q2 ) to the cut [39, 55, 60, 61, 62]. It can be conveniently written in the form\n\n\nln(s/Λ2 )\n\n\n\n\n\n\n\nπ\n = arcsin  q\n = arctan\narccos  q\n2\n2\nln(s/Λ2)\nπ 2 + ln (s/Λ2)\nπ 2 + ln (s/Λ2 )\nπ\n\n!\n\n(124)\n\nwith the appropiate branches of the relevant functions. Introducing\nα(s) =\n\nπ\nβ0 ln(s/Λ2)\n\n(125)\n\none can write\nπ\narctan\nln(s/Λ2 )\n\n!\n\n= arctan(β0 α(s))\n\n(126)\n\nTaking the value of the spectral density at Mτ2 as initial value,\nσ(Mτ2 ) =\n\nατ\n1\narctan(β0 ατ ) =\n+ O(α2).\nπβ0\nπ\n\n(127)\n\nwe can introduce the continuum part of the spectral density,\nσc (s) =\n\n1\narctan(β0 α(s)).\nπβ0\n\n(128)\n\nThe differential equation determining the continuum part σc (s) through its initial value σ(Mτ2 )\ncan be constructed by differentiating Eq. (128) with respect to s,\ndσc (s)\nα(s)\ns\n= −β0\nds\nπ\n\n!2\n\n1\n1 + β02 α(s)2\n\n(129)\n\nwith α(s) taken from Eq. (125). By inverting Eq. (128) we have\nβ0 α(s) = tan(πβ0 σc (s)) for s > 0\n54\n\n(130)\n\n\fFigure 8: The spectral function σ(s) as a function of s. Shown is the exact result for the\ndiscontinuity (full line) as well as results for non-closed circle integrals approaching the axis\nalong a full circle from both sides, see Fig. 2. The numerical values for the distances orthogonal\nto the real axis towards the positive and negative imaginary semi-plane in s are given in units\nof Mτ2 .\n\nand therefore obtain\ns\n\n1\nd\nσc (s) = − 2 sin2 (πβ0 σc (s)) for s > 0.\nds\nπ β0\n\n(131)\n\nThis equation can indeed be considered as an evolution equation for the spectral density σc (s)\ndetermining σc (s) through its initial value σ(Mτ2 ). Therefore, one can simply introduce an\neffective charge\nαM (s) = πσc (s) or aM (s) =\n\nαM (s)\n= σc (s)\nπ\n\n(132)\n\n(see Eq. (16)). The evolution equation for aM (s) is then given by\ns\n\ndaM (s)\n1\n= − 2 sin2 (πβ0 aM (s)).\nds\nπ β0\n\n(133)\n\nTherefore, we now define the coupling as the value of the spectral density on the cut far from\nthe IR region. This is a perturbation theory definition. The evolution of this coupling, however,\nis calculated by taking into account the analytic continuation. Then it has an IR fixed point\nwith the coupling value\naM (0) = 1/β0\n55\n\n(134)\n\n\f(we assume that all transformations are made for small aM so that this is the first IR point).\nStarting from finite-order perturbation theory one therefore can find the all-order result\nbecause of analytic continuation and running in the IR domain – it happens to be finite (no\npoles for the spectrum at small values of s). Therefore, the function σc (s) can be used to\ngenerate moments by integration on the cut. Note that in this approach the part of the\nspectrum at negative s is lost and cannot be recovered from finite-order perturbation theory.\nNote, however, that the value at zero mentioned in Eq. (134) is not a universal quantity. If\nAdler's function starts with a proper power of the coupling constant as it is the case for gluonic\nobservables, for instance, this picture will change. For instance, we take\n2\n\nD(Q ) =\n\n!2\n\nαE (Q2 )\nπ\n\n.\n\n(135)\n\nThen the corresponding spectral density in leading order β-function approximation reads\n1\nα2 (s)\n1\n=\n.\nβ02 ln2 (s/Λ2 ) + π 2\nπ 2 (1 + β02 α2 (s))\n\nρ(s) =\n\n(136)\n\nAs in previous cases, we can define an effective coupling in the Euclidean domain,\nα(s)\n.\nāM (s) = q\nπ 1 + β02 α2 (s)\n\n(137)\n\nFor this effective coupling we indeed have (cf Eq. (134))\nāM (0) = 0.\n\n(138)\n\nThe β-function for the effective coupling obtained from Eq. (137),\nβ̄M (āM ) =\n\n−β0 ā2M\n\nq\n\n1 − (πβ0 āM\n\n)2\n\n=\n\n−β0 ā2M\n\n1\n1 − (πβ0 āM )2 + O(ā4M )\n2\n\n\u0012\n\n\u0013\n\n(139)\n\ndiffers from the β-function of the effective coupling aM (c.f. Eq. (133))\n1\n1\nβM (aM ) = − 2 sin (πβ0 aM ) = −β0 a2M 1 − (πβ0 aM )2 + O(a4M )\nπ β0\n3\n\u0012\n\n\u0013\n\n(140)\n\nat next-to-leading order.\nThe consideration can be generalized to higher powers of the coupling in the Euclidean\ndomain. For\n2\n\nDp (Q ) =\n\nαE (Q2 )\nπ\n56\n\n!p+1\n\n(141)\n\n\fFigure 9: The spectral function ρp (s) as a function of s, given by Eq. (142). All spectral\nfunctions for p > 0 are going to zero for s → 0, for p ≥ 2 they have nontrivial zeros and a\nfluctuating behaviour near the origin.\n\nwe obtain\nρp (s) =\n\n1 sin(pφ(s))\nπβ0 pr p (s)\n\nr(s) = β0 ln2 (s/Λ2) + π 2 ,\n\ntan φ(s) =\n\n(142)\n\nwhere\nq\n\nπ\n= β0 α(s).\nln(s/Λ2 )\n\n(143)\n\nFor p = 0 we retain Eq. (128),\nρ0 (s) =\n\n1\n1\nφ(s) =\narctan(β0 α(s)).\nπβ0\nπβ0\n\n(144)\n\nBut for large values of p the function ρp (s) starts to fluctuate when starting at ρ(Mτ2 ) and\napproaching s = 0 where it finally reaches zero. Because if this behaviour, shown in Fig. 9 in\nsome detail for the first four values of p, ρp (s) fails to be interpreted as a (positive) spectral\ndensity in a region which enlarges with increasing values of p.\nWe conclude that the two recipes of resummation (on the contour and on the positive\nsemi-axis for s) are different: they differ by the integral over the negative real semi-axis for\ns or, more generally, by the integral passing through the infrared region. This point is worth\ndiscussing in more detail. In the contour formulation it is not essential what particular pointby-point behaviour in the IR region exists. For the analytically continued correlator this is not\n57\n\n\fcomplex q 2 plane\n\nB\n\ncomplex q 2 plane\n\nA\n\nB''\n\nB' B\n\nA\nCd\n\nCa\nCb\nCc\n\nFigure 10: Contours in the complex plane with a fixation in the region A, taking into account\npossible occurrences of singularities. The figure part on the left hand side shows the standard\ncircle path which circumvents the singular region B while the occurence of other singularity\nregions as discussed in the text (regions B′ and B′′ ) may lead to different possibilities for\nchoosing a path (Ca , Cb , Cc ). The path Cd crosses the singularity region and, therefore, cannot\nbe used from the perturbation theory point of view.\n\nimportant unless the contour crosses a nonanalytic region. Whatever singularities exist in the\nIR region (Regions B, B', or B\" in Fig. 10), the contour includes them. This is the definition\nof resummation on the contour which is explicitly perturbative.\nFor the formulation on the cut the extrapolation of the running of the coupling constant to\nthe IR region is crucial because it provides an interpretation of the spectral density in the IR\nregion. One can formally write\nZ\n\n0\n\nMτ2\n\nα(s)ds\n\n(145)\n\nand try to interpret this integral. The naive substitution of the expression in Eq. (125) leads to\na singularity which is known as Landau pole. Still, further formal manipulations readily give\n(t = β0 α(Mτ2 ) ln(Mτ2 /s))\nZ\n\n0\n\nMτ2\n\nα(s)ds =\n\nZ\n\n0\n\nMτ2\n\nMτ2\nα(Mτ2 )ds\n=\n1 + β0 α(Mτ2 ) ln(s/Mτ2 )\nβ0\n\nZ\n\n0\n\n∞\n\n2\n\ne−t/β0 α(Mτ ) dt\n.\n1−t\n\n(146)\n\nBoth equations are not well-defined from the beginning, the second form being a Borel representation. The same problem can be reformulated as a divergence of the asymptotic series.\nIndeed, by expanding the expression for the running coupling under the integration sign in a\n\n58\n\n\fperturbation theory series one has\nZ\n\n0\n\nMτ2\n\nα(s)ds =\n\nX\nn\n\nβ0 α(Mτ2 )\nn!\nπ\n\n!n\n\n.\n\n(147)\n\nThe summation of the series in Eq. (147) is equivalent to the interpretation of the integral,\nindependent on what form is chosen for it, so either Eq. (145) or Eq. (146). Therefore, an\nintegrable behaviour of the coupling constant at small s (whatever the definition of this quantity\nis) can solve the problem of divergence of the integral or the summation of the asymptotic series.\nBut this solution is strongly model dependent because the extrapolation of the evolution into the\nIR region is essentially arbitrary and higher order corrections are important. The explicit form\nof the extrapolation in Eq. (122) gives an extrapolation motivated by analytic continuation. It\ncan also be considered as a special change of the renormalization scheme [26]. Indeed, for the\ncoupling aM with the evolution given in Eq. (133) one obtains an IR fixed point. In any case\nthe result depends on the IR region which is strongly nonperturbative.\nAs it has become popular as being used as an extrapolation, for the analytic continuation\nthe moments are defined simply by\nmanal\n00 =\n\nZ\n\nMτ2\n\n0\n\nσc (s)ds\n,\nMτ2\n\n(148)\n\nexcluding totally the negative part of the spectrum that emerges in the exact treatment of\nquantities originally defined in the Euclidean domain (see Eq. (121)). Using Eq. (120) one can\nrelate these moments to the moments on the contour by\nmanal\n00 = −\n\n1 −π/β0 ατ\ne\n+ m00 .\nβ0\n\n(149)\n\nThe contour definition for the moments is a strictly perturbative one and in this particular\ncase simply gives the analytic function of ατ at the origin ατ = 0, i.e. m00 (ατ ) is analytic at small\nατ . Then the decomposition in Eq. (149) is at least meaningful, the right hand side does contain\nterms of different analytic structure. We can, of course, reproduce the contour moments by\nsumming on the cut (which gives manal\n00 ) and adding a pole (giving the \"nonperturbative\" term\nin Eq. (149)) which is an allowed extrapolation as well (because the IR region behaviour cannot\nbe found in perturbation theory). But it is difficult to imagine that one could suggest such a\ntreatment of the situation just as it is, if not derived naturally from the contour definition. Note\n59\n\n\fthat this is completely analogous to the situation with Coulomb resummation: by summing on\nthe cut 4m2 < s < ∞ one can never restore the pole contributions generated by the bound\nstates. Only an explicit analytic continuation can reveal the whole analytic structure of the\ncorrelator. The result of Eq. (149) can readily be generalized to any power of ατ as a basic\nquantity which is important for correlators of hadronic currents with nonvanishing anomalous\ndimensions.\nNote that the problem of a particular choice for the extrapolation of the evolution into the\nIR region cannot be uniquely solved from the point of view of the perturbation theory because\nthe IR region is nonperturbative and there is no tool to choose a \"correct\" extrapolation in\ncases when there is no explicit analytic structure known. Therefore, the extrapolation is rather\narbitrary for basically all cases except the case of two-point correlators. Still, a particular\nchoice for the extrapolation can be important numerically for the theoretical description of\nthe available high precision data. In τ decays the special role of contour moments is related to\nperturbation theory – they are really computable in perturbation theory without any additional\nhypotheses. For the sl -moments the problem is less important numerically while for the (Mτ2 −\ns)k -moments it is crucial (see Table 5). This is obvious because the (Mτ2 − s)k -moments are\nsaturated at small s and the particular way of treating this region is important. In order to\ndiscuss this issue, we now leave the special case k = l = 0 and turn to the description of\nmodified moments, discussing the differences.\n\n6.3\n\nThe moments m0l\n\nIn general, for any given moment m0l one finds\nm0l\n\nn−1\nX\nβ0 ατ\n1\n(j − 1)!\nφ+\n=\nπβ0\n(l + 1)πr\nj=1\n\n(\n\n−(l + 1)(−1)\n\nl+1 (n\n\n− 1)!\n2\n\n!j\n\nβ0 α\n(l + 1)π\n\nsin(jφ) +\n!n Z\n\nπ\n\n−π\n\nei(l+1)φ dφ\n.\n(1 + iβ0 ατ φ/π)n\n)\n\n(150)\n\nThe representation obtained by using integration by parts shows an improvement in the convergence for moments at large l equivalent to the replacement ατ → ατ /(l + 1). This coincides\nwith conclusions drawn from finite-order perturbation theory. For arbitrary l one can also find\n\n60\n\n\fa representation containing an explicit nonperturbative term,\nm0l\n\n1\n=\nπβ0\n\n(\n\n− π(−1)\n\n+(l + 1)(−1)\n\nl+1 −(l+1)π/β0 ατ\n\ne\n\nl+1 (n\n\n− 1)!\n2\n\nn−1\nX\n\nβ0 ατ\n(j − 1)!\n+φ+\n(l + 1)πr\nj=1\n\nβ0 α\n(l + 1)π\n\n!n \u0012Z\n\n−π\n\n−∞\n\n+\n\nZ\n\n∞\u0013\n\nπ\n\n!j\n\nsin(jφ)\n\nei(l+1)φ dφ\n. (151)\n(1 + iβ0 ατ φ/π)n\n)\n\nThese formulae give a direct generalization to large l moments and can be treated perturbatively.\n\n6.4\n\nThe moments mk0\n\nThe moments for l = 0 corresponding to the ατ dependent part of the correlator in the leading\norder are given by\nmk0\n\nk+1\n=−\n2πβ0\n\nZ\n\nπ\n\n−π\n\n(1 + eiφ )k ln(1 + iβ0 ατ φ/π)eiφ dφ.\n\n(152)\n\nThese moments can also be expanded in a convergent series in ατ for small values of ατ ,\nrecovering the results from finite-order perturbation theory.\nThe usual arguments given for the preferred use of these moments from the theoretical point\nof view is that they suppress contributions close to the real axis where OPE is not applicable\n(region A in Fig. 10)). They do suppress these contributions because of eiφ ∼ −1 in this region.\nOne can also obtain this result by looking at the integral measure for the moments mk0 ,\n(1 + eiφ )k eiφ dφ = (2 cos(φ/2))k eikφ/2 eiφ dφ\n\n(153)\n\nwhere the suppression is given by the factor (1 + eiφ )k . The suppression of oscillations starts at\nlarger values of the integration parameter φ than for the moments m0l but there is a suppression\nby the power of cos(φ/2), cos(φ/2) = 0 at φ = ±π. However, one can see that these moments\nare almost insensitive to the value of ατ for large k (or, more precisely, to the perturbative\nstructure). It is clear that these functions determine integrals which really have no relation\nto perturbative running because such a running is completely suppressed. This makes an\nasymptotic expansion in ατ almost useless (we could not find any efficient asymptotic expansion\nin ατ for this moments at large values of k). However, it is straightforward to write down a\nnonperturbative representation for these moments at large values of k. A representation in\nterms of integral over the spectrum is particularly convenient. One has\nmk0\n\nZ M2\nτ\ns\nk+1Z π\niφ k\niφ\n1− 2\n=−\n(1 + e ) ln(1 + iβ0 ατ φ/π)e dφ =\n2πβ0 −π\nMτ\n−Λ2\n\n61\n\n!k\n\nσ(s)ds\n.\nMτ2\n\n(154)\n\n\fl = 3 −0.000\n\n−0.000 −0.000 −0.000\n\n−0.000 −0.001 −0.002\n\n−0.003\n\nl=2\n\n+0.002\n\n+0.013\n\n+0.030\n\n+0.042\n\n+0.000\n\n+0.004\n\n+0.008\n\n+0.020\n\nl = 1 −0.003\n\n−0.009 −0.018 −0.032\n\n−0.052 −0.078 −0.113\n\n−0.160\n\nl=0\n\n+0.186\n\n+0.305\n\n+0.396\n\n+0.469\n\n+0.530\n\n+0.582\n\n+0.626\n\n+0.665\n\nk=0\n\nk=1\n\nk=2\n\nk=3\n\nk=4\n\nk=5\n\nk=6\n\nk=7\n\nTable 5: Contribution of the integral taken over the interval from −Λ2 to +Λ2 for the moments\nmkl in Eq. (159) relative to the integral taken over to the whole integration range.\n\nThe part of the spectrum on the negative real axis is given by a constant. For large values of\nk the integral is saturated at the left boundary of the integration region and reads\n\n\n1 \nΛ2\n=\n1+ 2\nβ0\nMτ\n\nmk0\n\n!k+1\n\n\n\n− 1 + (k + 1)\n\nZ\n\nMτ2\n\n0\n\ns\n1− 2\nMτ\n\n!k\n\nσc (s)ds\n.\nMτ2\n\n(155)\n\nThe contribution of the integral is suppressed because the spectrum σc (s) is a smooth and finite\nfunction leading to a finite result for the integral.\nAnother way to look at the problem is given by integrating by parts once. One has\nmk0 =\n\nατ Z π (1 + eiφ )k+1 dφ\n.\n2π 2 −π 1 + iβ0 ατ φ/π\n\n(156)\n\nIn this case the boundary terms vanish. One obtains\nmk0\n\n1\nΛ2\n=\n1+ 2\nβ0\nMτ\n\n!k+1\n\n1\n−\nβ0\n\nZ\n\nMτ2\n\n0\n\ns\n1− 2\nMτ\n\n!k+1\n\nπ2\n\nds\n1\n.\n2\n2\n+ ln (s/Λ ) s\n\n(157)\n\nHere it is easy to estimate the contribution of the integral as well. One has\nZ\n\n0\n\nMτ2\n\ns\n1− 2\nMτ\n\n!k+1\n\nds Z Mτ2\nds\n1\n1\n<\n< 1.\n2\n2\n0\nπ 2 + ln (s/Λ2 ) s\nπ 2 + ln (s/Λ2 ) s\n\n(158)\n\nNote that the whole function mk0 is still represented by a convergent series for small values of\nατ .\nIn general we determine the contribution of the nonperturbative region determined by the\nscale Λ2 to the modified moments\nmkl =\n\nZ\n\nMτ2\n\n−Λ2\n\ns\n1− 2\nMτ\n62\n\n!k\n\ns\nMτ2\n\n!l\n\nσ(s)ds\n.\nMτ2\n\n(159)\n\n\fl = 3 −0.000\n\n−0.000 −0.000 −0.000\n\n−0.001 −0.001 −0.002\n\n−0.004\n\nl=2\n\n+0.001\n\n+0.009\n\n+0.022\n\n+0.031\n\n+0.000\n\n+0.003\n\n+0.005\n\n+0.014\n\nl = 1 −0.006\n\n−0.018 −0.036 −0.061\n\n−0.093 −0.134 −0.187\n\n−0.256\n\nl=0\n\n+0.117\n\n+0.195\n\n+0.256\n\n+0.308\n\n+0.353\n\n+0.392\n\n+0.428\n\n+0.460\n\nk=0\n\nk=1\n\nk=2\n\nk=3\n\nk=4\n\nk=5\n\nk=6\n\nk=7\n\nTable 6: Contribution of the integral taken over the interval from −Λ2 to 0 for the moments\nmkl in Eq. (159) relative to the integral taken over to the whole integration range.\n\nin order to consider the enhancement of this region in relation to the moment as a whole. In\nTable 5 we give values for the contribution of the interval range [−Λ2 , Λ2 ] to the contribution\nfor the whole range [−Λ2 , Mτ2 ] for different values of k and l, taking Λ2 = 0.2 GeV2 . A strong\nenhancement can be observed especially for the case l = 0 and large values for k. One observes\nthat the first term is larger than the second one already for k > 3. Though weakened, the same\ntendency can be seen in Table 6 where we considered the contribution of the interval range\n[−Λ2 , 0] relative to the whole range.\nThis observation also suggests the question of sensitivity of the moments to the parameters\ndescribing the strength of strong interactions, namely the values of aτM and Λ. As expected, the\nsl -moments are sensitive to the spectrum at large energies, i.e. σ(Mτ2 ) which is almost equal to\naτM . The large k moments are directly sensitive to Λ as one can see from Eq. (157). However,\nperturbation theory is insufficient for these moments, and thus the theoretical formulae for large\nk moments like Eq. (157) cannot be confronted with experiment and should be supplemented\nby a quantitative hadronization mechanism.\n\n6.5\n\nHigher orders of running\n\nThe formulae obtained for the polarization function can readily be generalized to higher orders\nof the β-function. For Adler's function one has\nD(Q2 ) = 1 + aE (Q2 ).\n\n63\n\n(160)\n\n\fThe polarization function is then determined by the equation\n− Q2\n\nd\nΠ(Q2 ) = 1 + aE (Q2 ).\n2\ndQ\n\n(161)\n\nA simple way to calculate Π(Q2 ) is to use the ansatz\nμ2\nΠ(Q ) = ln\nQ2\n2\n\n!\n\n\u0010\n\n\u0011\n\n+ ln f aE (Q2 ) .\n\n(162)\n\nOne then obtains a differential equation for f (aE ) which reads\n− Q2\n\n\u0010\n\u0011\nd\n1\nf ′ (aE (Q2 )) 2 daE (Q2 )\n2\n2 d\n2\nΠ(Q\n)\n=\n1\n−\nQ\nf\na\n(Q\n)\n=\n1\n−\nQ\n.\nE\ndQ2\nf (aE (Q2 )) dQ2\nf (aE (Q2 ))\ndQ2\n\n(163)\n\nUsing the renormalization group equation\nQ2\n\n\u0010\n\u0011\ndaE (Q2 )\n2\n=\nβ\na\n(Q\n)\nE\ndQ2\n\n\u0011\n\n\u0010\n\n(164)\n\none finds\n\u0010\n\n\u0011\n\n\u0010\n\n\u0011\n\nf ′ aE (Q2 ) β aE (Q2 ) = −f aE (Q2 ) aE (Q2 ).\n\n(165)\n\nThis differential equation can be solved in quadrature,\nln f = −\n\nZ\n\naE daE\n.\nβ(aE )\n\n(166)\n\nThe solution for Π(Q2 ) is therefore given by the trajectory\n2\n\nΠ(Q ) = −\n\nZ\n\ndQ2\nμ2\n2\nD(Q ) = ln\nQ2\nQ2\n\n!\n\n−\n\nZ\n\naE daE\n.\nβ(aE )\n\n(167)\n\nEq. (167) can be used for any β-function (with the restriction that no singularity should occur).\nFor β(a) = −β0 a2 we obtain the former result,\nβ(a) = −β0 a2\n\n\u0011\n1 \u0010\nln aE (Q2 ) .\nβ0\n\n(168)\n\n1\nβ0 aE (Q2 )\nln\n.\n+\nβ0\nβ0 + β1 aE (Q2 )\n\n(169)\n\n⇒\n\nln f =\n\nFor β(a) = −β0 a2 − β1 a3 we explicitly obtain\nμ2\nΠ(Q ) = ln\nQ2\n2\n\n!\n\n!\n\nThe generalization to any polynomial function that may occur in perturbation theory is straightforward.\n64\n\n\fAs a last note we comment on the Landau singularity which occurs at the leading order\nof the running. For two-point correlators the problem is completely solved by the contour\nintegration to any order of the β-function. We stress that the pole is inside the circle (see\nthe discussion in Ref. [57]). One cannot deform the contour to be close to the origin because\nthis region is completely nonperturbative and should therefore be avoided. This situation is\ncompletely analogous to the situation with Coulombic poles [63] or with a spectrum below\nthreshold for a gluonic operator induced by a heavy quark loop [64]. Any type of singularity is\navoided by moving the contour far from the origin and keeping the singularity inside, thereby\nincluding also the integral of the spectrum.\n\n7\n\nConclusion\n\nWe have shown that the direct sl -moments are perturbative and can be reliably calculated\nwithin operator product expansion (OPE). The mixed moments with the weight functions\n(1 − s/Mτ2 )k are strongly nonperturbative. This is natural and is expected in QCD with asymptotic freedom. We have analyzed finite-order perturbation theory, power corrections and resummation. The results agree with each other and the picture is completely consistent. An\nasymptotic analysis (large values for l or k) definitely disfavours the large k moments despite\narguments that they suppress the non-OPE region along the contour – these arguments are\nnot valid. In practical applications to τ decays and the determination of ms the second mixed\nmoment with weight function (1−s/Mτ2 )2 is sometimes used. Along with the initial phase space\nweight (1 − s/Mτ2 )2 (see Eq. (8)) the total results gives a moment with the weight (1 − s/Mτ2 )4\nwhich is marginal in the sense that it enhances nonperturbative contributions. Our consideration show that this moment is really on the border of what is still theoretically computable.\nThe theoretical error becomes larger than one would expect for such an analysis. Note that\nan estimate of the systematic theoretical error, i.e. the error due to the functional dependence\nlike perturbation series truncation, is complicated as compared to a simple statistical error of\ntheoretical formulae due to uncertainties in the parameters used. The theoretical error for the\nmoment with weight (1 − s/Mτ2 )4 appearing in the phenomenological analysis is big enough to\nbe concerned. The point is whether we should worry about the size of this error in compar65\n\n\fison with the gain due to the improvement in the accuracy of the experimental moments or\nto trade this moment for a more reliable theoretical expression confronted with a less precise\nexperimental moment. This still remains to be seen.\n\nAcknowledgements\nWe topics of the present paper were discussed with many people at different times. We acknowledge discussions and correspondence with M. Beneke, K. Chetyrkin, A. Kataev, N. Krasnikov,\nJ. Kühn, K. Maltman, S. Narison, K. Schilcher, D. Shirkov, N. Uraltsev, and V. Zakharov.\nA.A. Pivovarov is indebted to V. Matveev for support and interest in the work.\nThe present work is supported in part by the Russian Fund for Basic Research under\ncontracts 99-01-00091 and 01-02-16171. A.A. Pivovarov is Alexander von Humboldt fellow.\nS. Groote acknowledges a grant given by the Deutsche Forschungsgemeinschaft, Germany.\n\nReferences\n[1] P.M. Zerwas, Nucl. Instrum. Meth. A398 (1997) 19\n[2] R. Barate et al. [ALEPH Collaboration], Z. Phys. C76 (1997) 15;\nR. Barate et al. [ALEPH Collaboration], Eur. Phys. J. C11 (1999) 599\n[3] D.E. Groom et al. [Particle Data Group Collaboration], Eur. Phys. J. C15 (2000) 1\n[4] E.D. Bloom and F.J. Gilman, Phys. Rev. Lett. 25 (1970) 1140; A. De Rujula, H. Georgi\nand H.D. Politzer, Phys. Lett. B64 (1977) 428\n[5] A. Pich, Nucl. Phys. Proc. Suppl. 98 (2001) 385\n[6] K.G. Chetyrkin, J.H. Kühn and A.A. Pivovarov, Nucl. Phys. B533 (1998) 473\n[7] J.G. Körner, F. Krajewski and A.A. Pivovarov, \"Determination of the strange quark mass\nfrom Cabibbo-suppressed τ decays with resummed perturbation theory in an effective\nscheme,\" Report No. MZ-TH-99-66 [hep-ph/0003165], to be published in Eur. Phys. J. C.\n[8] A. Pich and J. Prades, JHEP 9806 (1998) 013; JHEP 9910 (1999) 004\n66\n\n\f[9] K.G. Chetyrkin, Phys. Lett. B307 (1993) 169\n[10] S.A. Larin, T. van Ritbergen and J.A. Vermaseren, Nucl. Phys. B438 (1995) 278\n[11] A.A. Pivovarov, Phys. Lett. B263 (1991) 282; Sov. J. Nucl. Phys. 54 (1991) 656;\nA.A. Penin and A.A. Pivovarov, Phys. Rev. D49 (1994) 265\n[12] K. Schilcher and M.D. Tran, Phys. Rev. D29 (1984) 570\n[13] E. Braaten, Phys. Rev. Lett. 60 (1988) 1606\n[14] E. Braaten, Phys. Rev. D39 (1989) 1458\n[15] S. Narison and A. Pich, Phys. Lett. B211 (1988) 183\n[16] E. Braaten, S. Narison and A. Pich, Nucl. Phys. B373 (1992) 581\n[17] W.J. Marciano and A. Sirlin, Phys. Rev. Lett. 61 (1988) 1815;\nE. Braaten and C. Li, Phys. Rev. D42 (1990) 3888\n[18] R. Barate et al. [ALEPH Collaboration], Z. Phys. C76 (1997) 15\n[19] K.G. Chetyrkin, J.H. Kühn and A. Kwiatkowski, Phys. Rept. 277 (1996) 189\n[20] S.G. Gorishnii, A.L. Kataev and S.A. Larin, Phys. Lett. B259 (1991) 144;\nL.R. Surguladze and M.A. Samuel, Phys. Rev. Lett. 66 (1991) 560, 2416(E);\nM.A. Samuel and L.R. Surguladze, Phys. Rev. D44 (1991) 1602\n[21] K.G. Chetyrkin, Phys. Lett. B391 (1997) 402\n[22] J.G. Körner, F. Krajewski and A.A. Pivovarov,\nEur. Phys. J. C12 (2000) 461; Eur. Phys. J. C14 (2000) 123\n[23] S. Groote, J.G. Körner, A.A. Pivovarov and K. Schilcher,\nPhys. Rev. Lett. 79 (1997) 2763\n[24] S.J. Brodsky, J.R. Pelaez and N. Toumbas, Phys. Rev. D60 (1999) 037501\n\n67\n\n\f[25] J.R. Pelaez, S.J. Brodsky and N. Toumbas, \"New tests of perturbative QCD inspired\nby hypothetical tau leptons,\" Talk given at 34th Rencontres de Moriond \"QCD and\nHadronic Interactions,\" Les Arcs, France, 20-27 Mar 1999 Report No. SLAC-PUB-8147\n[hep-ph/9905435]\n[26] N.V. Krasnikov and A.A. Pivovarov, Mod. Phys. Lett. A11 (1996) 835\n[27] G. Grunberg, Phys. Lett. B95 (1980) 70; Erratum ibid. B110 (1982) 501\n[28] N.V. Krasnikov, Nucl. Phys. B192 (1981) 497\n[29] A.L. Kataev, N.V. Krasnikov and A.A. Pivovarov, Phys. Lett. B107 (1981) 115;\nNucl. Phys. B198 (1982) 508; Erratum ibid. B490 (1997) 505\n[30] A. Dhar and V. Gupta, Phys. Rev. D29 (1984) 2822\n[31] G. 't Hooft, \"Can we make sense out of 'Quantum Chromodynamics' ?,\" Lectures given\nat the Int. School of Subnuclear Physics, Erice, Sicily, Jul 23 – Aug 10, 1977\n[32] K. Maltman, Nucl. Phys. A663 (2000) 977;\nPhys. Lett. B462 (1999) 195; Phys. Lett. B440 (1998) 367\n[33] C.A. Dominguez and K. Schilcher, \"Finite energy chiral sum rules in QCD,\"\nReport No. UCT-TP-257/99 [hep-ph/9905411]\n[34] I.S. Gradshteyn and I.M. Ryzhik,\n\"Tables of integrals, series, and products\", Academic Press, 1994\n[35] C. Bernard, A. Duncan, J. LoSecco and S. Weinberg, Phys. Rev. D12 (1975) 792;\nE.C. Poggio, H.R. Quinn and S. Weinberg, Phys. Rev. D13 (1976) 1958\n[36] R. Shankar, Phys. Rev. D15 (1977) 755\n[37] K.G. Chetyrkin, N.V. Krasnikov and A.N. Tavkhelidze, Phys. Lett. B76 (1978) 83\n[38] J.G. Körner, F. Krajewski and A.A. Pivovarov, Phys. Rev. D63 (2001) 036001\n[39] N.V. Krasnikov and A.A. Pivovarov, Phys. Lett. B116 (1982) 168\n68\n\n\f[40] M.A. Shifman, A.I. Vainshtein and V.I. Zakharov, Nucl. Phys. B147 (1979) 385\n[41] N.V. Krasnikov, A.A. Pivovarov and N.N. Tavkhelidze,\nJETP Lett. 36 (1982) 333; Z. Phys. C19 (1983) 301\n[42] A.A. Pivovarov, Phys. Atom. Nucl. 62 (1999) 1924\n[43] N.V. Krasnikov and A.A. Pivovarov, Phys. Lett. B112 (1982) 397\n[44] K.G. Chetyrkin, V.P. Spiridonov and S.G. Gorishnii, Phys. Lett. B160 (1985) 149;\nG.T. Loladze, L.R. Surguladze and F.V. Tkachov, Phys. Lett. B162 (1985) 363\n[45] A.G. Grozin and Y.F. Pinelis, Phys. Lett. B166 (1986) 429\n[46] J. Schwinger, Phys. Rev. 125 (1962) 397; 128 (1962) 2425\n[47] A.A. Pivovarov and V.F. Tokarev, Yad. Fiz. 41 (1985) 524;\nA.A. Pivovarov, A.N. Tavkhelidze and V.F. Tokarev,\nTheor. Math. Phys. 60 (1985) 765; Phys. Lett. B132 (1983) 402\n[48] N.I. Ussukina and A.I. Davydychev, Phys. Lett. B305 (1993) 136;\nD. Broadhurst, Phys. Lett. B307 (1993) 132\n[49] A.A. Penin and A.A. Pivovarov, Phys. Lett. B357 (1995) 427\n[50] G. 't Hooft, Nucl. Phys. B72 (1974) 461\n[51] G. 't Hooft, Nucl. Phys. B75 (1974) 461\n[52] B. Chibisov, R.D. Dikeman, M. Shifman and N. Uraltsev,\nInt. J. Mod. Phys. A12 (1997) 2075\n[53] I. Bigi, M. Shifman, N. Uraltsev and A. Vainshtein, Phys. Rev. D59 (1999) 054011\n[54] M. Jamin and M. Munz, Z. Phys. C66 (1995) 633;\nK.G. Chetyrkin, C.A. Dominguez, D. Pirjol and K. Schilcher,\nPhys. Rev. D51 (1995) 5090\n\n69\n\n\f[55] A.A. Pivovarov, Sov. J. Nucl. Phys. 54 (1991) 676, Z. Phys. C53 (1992) 461;\nNuovo Cim. A105 (1992) 813\n[56] F. Le Diberder and A. Pich, Phys. Lett. B286 (1992) 147\n[57] A. A. Pivovarov, Nucl. Phys. Proc. Suppl. 64 (1998) 339; \"Spectrality, coupling constant\nanalyticity and the renormalization group,\" Report No. MZ-TH/01-13 [hep-ph/0104213]\n[58] N.N. Bogoliubov and D.V. Shirkov, \"Quantum fields\", Benjamin, New York 1983\n[59] S. Groote, J.G. Körner and A.A. Pivovarov,\nPhys. Lett. B407 (1997) 66; Mod. Phys. Lett. A13 (1998) 637\n[60] A.V. Radyushkin, JINR-E2-82-159-mc (microfiche), Feb 1982,\nJINR Rapid Commun. 78 (1996) 96\n[61] A. Bottino and C.W. Kim, Lett. Nuovo Cim. 30 (1981) 353;\nM.R. Pennington and G.G. Ross, Phys. Lett. B102 (1981) 167\n[62] D.V. Shirkov and I.L. Solovtsov, Phys. Rev. Lett. 79 (1997) 1209\n[63] J.H. Kühn, A.A. Penin and A.A. Pivovarov, Nucl. Phys. B534 (1998) 356\n[64] S. Groote and A.A. Pivovarov, \"Low-energy gluon contributions to the vacuum polarization of heavy quarks,\" Report No. MZ-TH/01-06 [hep-ph/0103047];\nS. Groote and A.A. Pivovarov, \"Heavy quark induced effective action for gauge fields in\nthe SU(Nc ) × U(1) model and the low-energy structure of heavy quark current correlators,\" Report No. MZ-TH/01-10 [hep-ph/0103313]\n\n70\n\n\f"}