{"id": "http://arxiv.org/abs/hep-ph/0210216v1", "guidislink": true, "updated": "2002-10-15T16:27:02Z", "updated_parsed": [2002, 10, 15, 16, 27, 2, 1, 288, 0], "published": "2002-10-15T16:27:02Z", "published_parsed": [2002, 10, 15, 16, 27, 2, 1, 288, 0], "title": "Chiral symmetry restoration in hadron spectra", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0210125%2Chep-ph%2F0210371%2Chep-ph%2F0210295%2Chep-ph%2F0210277%2Chep-ph%2F0210258%2Chep-ph%2F0210447%2Chep-ph%2F0210184%2Chep-ph%2F0210025%2Chep-ph%2F0210299%2Chep-ph%2F0210216%2Chep-ph%2F0210217%2Chep-ph%2F0210284%2Chep-ph%2F0210325%2Chep-ph%2F0210040%2Chep-ph%2F0210205%2Chep-ph%2F0210364%2Chep-ph%2F0210266%2Chep-ph%2F0210431%2Chep-ph%2F0210045%2Chep-ph%2F0210418%2Chep-ph%2F0210096%2Chep-ph%2F0210197%2Chep-ph%2F0210199%2Chep-ph%2F0210200%2Chep-ph%2F0210273%2Chep-ph%2F0210222%2Chep-ph%2F0210054%2Chep-ph%2F0210346%2Chep-ph%2F0210115%2Chep-ph%2F0210065%2Chep-ph%2F0210024%2Chep-ph%2F0210042%2Chep-ph%2F0210228%2Chep-ph%2F0210348%2Chep-ph%2F0210140%2Chep-ph%2F0210305%2Chep-ph%2F0210073%2Chep-ph%2F0210303%2Chep-ph%2F0210124%2Chep-ph%2F0210067%2Chep-ph%2F0210192%2Chep-ph%2F0210384%2Chep-ph%2F0210251%2Chep-ph%2F0210260%2Chep-ph%2F0210033%2Chep-ph%2F0210318%2Chep-ph%2F0210436%2Chep-ph%2F0210331%2Chep-ph%2F0210322%2Chep-ph%2F0210435%2Chep-ph%2F0210356%2Chep-ph%2F0210019%2Chep-ph%2F0210198%2Chep-ph%2F0210385%2Chep-ph%2F0210390%2Chep-ph%2F0210170%2Chep-ph%2F0210367%2Chep-ph%2F0210191%2Chep-ph%2F0210341%2Chep-ph%2F0210186%2Chep-ph%2F0210134%2Chep-ph%2F0210398%2Chep-ph%2F0210376%2Chep-ph%2F0210005%2Chep-ph%2F0210383%2Chep-ph%2F0210050%2Chep-ph%2F0210286%2Chep-ph%2F0210247%2Chep-ph%2F0210201%2Chep-ph%2F0210165%2Chep-ph%2F0210395%2Chep-ph%2F0210035%2Chep-ph%2F0210185%2Chep-ph%2F0210429%2Chep-ph%2F0210196%2Chep-ph%2F0210252%2Chep-ph%2F0210129%2Chep-ph%2F0210389%2Chep-ph%2F0210156%2Chep-ph%2F0210193%2Chep-ph%2F0210009%2Chep-ph%2F0210087%2Chep-ph%2F0210136%2Chep-ph%2F0210301%2Chep-ph%2F0210394%2Chep-ph%2F0210079%2Chep-ph%2F0210415%2Chep-ph%2F0210430%2Chep-ph%2F0210059%2Chep-ph%2F0210002%2Chep-ph%2F0210146%2Chep-ph%2F0210421%2Chep-ph%2F0210013%2Chep-ph%2F0210368%2Chep-ph%2F0210239%2Chep-ph%2F0210111%2Chep-ph%2F0210409%2Chep-ph%2F0210141%2Chep-ph%2F0210296%2Chep-ph%2F0210249%2Chep-ph%2F0210127&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Chiral symmetry restoration in hadron spectra"}, "summary": "The evidence and the theoretical justification of chiral symmetry restoration\nin high-lying hadrons is presented.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0210125%2Chep-ph%2F0210371%2Chep-ph%2F0210295%2Chep-ph%2F0210277%2Chep-ph%2F0210258%2Chep-ph%2F0210447%2Chep-ph%2F0210184%2Chep-ph%2F0210025%2Chep-ph%2F0210299%2Chep-ph%2F0210216%2Chep-ph%2F0210217%2Chep-ph%2F0210284%2Chep-ph%2F0210325%2Chep-ph%2F0210040%2Chep-ph%2F0210205%2Chep-ph%2F0210364%2Chep-ph%2F0210266%2Chep-ph%2F0210431%2Chep-ph%2F0210045%2Chep-ph%2F0210418%2Chep-ph%2F0210096%2Chep-ph%2F0210197%2Chep-ph%2F0210199%2Chep-ph%2F0210200%2Chep-ph%2F0210273%2Chep-ph%2F0210222%2Chep-ph%2F0210054%2Chep-ph%2F0210346%2Chep-ph%2F0210115%2Chep-ph%2F0210065%2Chep-ph%2F0210024%2Chep-ph%2F0210042%2Chep-ph%2F0210228%2Chep-ph%2F0210348%2Chep-ph%2F0210140%2Chep-ph%2F0210305%2Chep-ph%2F0210073%2Chep-ph%2F0210303%2Chep-ph%2F0210124%2Chep-ph%2F0210067%2Chep-ph%2F0210192%2Chep-ph%2F0210384%2Chep-ph%2F0210251%2Chep-ph%2F0210260%2Chep-ph%2F0210033%2Chep-ph%2F0210318%2Chep-ph%2F0210436%2Chep-ph%2F0210331%2Chep-ph%2F0210322%2Chep-ph%2F0210435%2Chep-ph%2F0210356%2Chep-ph%2F0210019%2Chep-ph%2F0210198%2Chep-ph%2F0210385%2Chep-ph%2F0210390%2Chep-ph%2F0210170%2Chep-ph%2F0210367%2Chep-ph%2F0210191%2Chep-ph%2F0210341%2Chep-ph%2F0210186%2Chep-ph%2F0210134%2Chep-ph%2F0210398%2Chep-ph%2F0210376%2Chep-ph%2F0210005%2Chep-ph%2F0210383%2Chep-ph%2F0210050%2Chep-ph%2F0210286%2Chep-ph%2F0210247%2Chep-ph%2F0210201%2Chep-ph%2F0210165%2Chep-ph%2F0210395%2Chep-ph%2F0210035%2Chep-ph%2F0210185%2Chep-ph%2F0210429%2Chep-ph%2F0210196%2Chep-ph%2F0210252%2Chep-ph%2F0210129%2Chep-ph%2F0210389%2Chep-ph%2F0210156%2Chep-ph%2F0210193%2Chep-ph%2F0210009%2Chep-ph%2F0210087%2Chep-ph%2F0210136%2Chep-ph%2F0210301%2Chep-ph%2F0210394%2Chep-ph%2F0210079%2Chep-ph%2F0210415%2Chep-ph%2F0210430%2Chep-ph%2F0210059%2Chep-ph%2F0210002%2Chep-ph%2F0210146%2Chep-ph%2F0210421%2Chep-ph%2F0210013%2Chep-ph%2F0210368%2Chep-ph%2F0210239%2Chep-ph%2F0210111%2Chep-ph%2F0210409%2Chep-ph%2F0210141%2Chep-ph%2F0210296%2Chep-ph%2F0210249%2Chep-ph%2F0210127&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The evidence and the theoretical justification of chiral symmetry restoration\nin high-lying hadrons is presented."}, "authors": ["L. Ya. Glozman"], "author_detail": {"name": "L. Ya. Glozman"}, "author": "L. Ya. Glozman", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/S0146-6410(03)00017-6", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/hep-ph/0210216v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-ph/0210216v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Invited talk given at Int. School on Nuclear Physics \"Quarks in\n  Hadrons and Nuclei\", September 2002, Erice/Sicily/Italy; to appear in Progr.\n  Part. Nucl. Phys., vol. 50; 10 pages", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-ex", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-lat", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "nucl-ex", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "nucl-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-ph/0210216v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-ph/0210216v1", "journal_reference": "Prog.Part.Nucl.Phys. 50 (2003) 247-257", "doi": "10.1016/S0146-6410(03)00017-6", "fulltext": "CHIRAL SYMMETRY RESTORATION IN HADRON\nSPECTRA ∗\nL. Ya. GLOZMAN\n\narXiv:hep-ph/0210216v1 15 Oct 2002\n\nInstitute for Theoretical Physics, University of Graz, Universitätsplatz 5, A-8010 Graz, Austria\n\nAbstract\nThe evidence and the theoretical justification of chiral symmetry restoration\nin high-lying hadrons is presented.\nI. CHIRAL SYMMETRY RESTORATION OF THE SECOND KIND\n\nIt has recently been suggested that the parity doublet structure seen in the spectrum of\nhighly excited baryons may be due to effective chiral symmetry restoration for these states\n[1]. This phenomenon can be understood in very general terms from the validity of the\noperator product expansion (OPE) in QCD at large space-like momenta and the validity\nof the dispersion relation for the two-point correlator, which connects the spacelike and\ntimelike regions (i.e. the validity of Källen-Lehmann representation) [2,3].\nConsider a two-point correlator ΠJα of the current Jα (x) (that creates from the vacuum\nthe hadrons with the quantum numbers α) at large spacelike momenta Q2 , where the language of quarks and gluons is adequate and where the OPE is valid. The only effect that\nchiral symmetry breaking can have on the correlator is through the nonzero value of condensates associated with operators which are chirally active (i.e. which transform nontrivially\nunder chiral transformations). To these belong hq̄qi and higher dimensional condensates\nthat are not invariant under axial transformation. At large Q2 only a small number of condensates need be retained to get an accurate description of the correlator. Contributions of\nthese condensates are suppressed by inverse powers of Q2 . At asymptotically high Q2 , the\ncorrelator is well described by a single term-the perturbative term. The essential thing\nto note from this OPE analysis is that the perturbative contribution knows nothing about\nchiral symmetry breaking as it contains no chirally nontrivial condensates. In other words,\nthough the chiral symmetry is broken in the vacuum and all chiral noninvariant condensates\nare not zero, their influence on the correlator at asymptotically high Q2 vanishes. This is in\ncontrast to the situation of low values of Q2 , where the role of chiral condensates is crucial.\nThis shows that at large spacelike momenta the correlation function becomes chirally\nsymmetric. In other words, two correlators ΠJ1 (Q2 ) and ΠJ2 (Q2 ), where J1 = UJ2 U † ,\n\n∗ Invited\n\ntalk given at International School on Nuclear Physics \"Quarks in Hadrons and Nuclei\",16th -24th September 2002, Erice/Sicily/Italy; to appear in Progr. Part. Nucl. Phys., vol.\n50\n\n1\n\n\fU ∈ SU(2)L × SU(2)R , become essentially the same at large Q2 . The dispersion relation\nprovides a connection between the spacelike and timelike domains. In particular, the large\nQ2 correlator is completely dominated by the large s spectral density ρ(s). (The spectral\ndensity has the physical interpretation of being proportional to the probability\ndensity that\n√\nthe current when acting on the vacuum creates a state of a mass of s.) Hence the large\ns spectral density must be insensitive to the chiral symmetry breaking in the vacuum. I.e.\nρ1 (s) and ρ2 (s) must coincide at asymptotically large s. This is in contrast to the low s\nspectral functions which are crucially dependent on the quark condensates in the vacuum.\nThis manifests a smooth chiral symmetry restoration from the low-lying spectrum, where the\nchiral symmetry breaking in the vacuum is crucial for physics, to the high-lying spectrum,\nwhere chiral symmetry breaking becomes irrelevant and the spectrum is chirally symmetric.\nMicroscopically this is because the typical momenta of valence quarks should increase\nhigher in the spectrum and once it is high enough the valence quarks decouple from the chiral\ncondensates of the QCD vacuum and the dynamical (quasiparticle or constituent) mass of\nquarks drops off and the chiral symmetry gets restored [1,4]. This phenomenon does not\nmean that the spontaneous breaking of chiral symmetry in the QCD vacuum disappears, but\nrather that the chiral asymmetry of the vacuum becomes irrelevant sufficiently high in the\nspectrum. The physics of the highly excited states is such as if there were no chiral symmetry\nbreaking in the vacuum. One of the consequences is that the concept of constituent quarks\n(which are directly related to the quark condensates of the QCD vacuum), which is adequate\nlow in the spectrum, becomes irrelevant high in the spectrum.\nHow should one refer to such a phenomenon? Typically under chiral symmetry restoration people understand that the chiral properties of the vacuum are changed with temperature or/and density. E.g. at critical temperature the phase transition occurs and the quark\nvacuum becomes trivial: all the quark condensates of the vacuum vanish. On the contrary,\nin our case one does not affect the QCD vacuum by exciting the hadrons. The symmetry\nrestoration is achieved via different mechanism. Namely, by exciting the hadrons one decouples the valence degrees of freedom from the QCD vacuum. So even if the quark condensates\nof the vacuum (which break the chiral symmetry) are not zero, their role gets smaller and\nsmaller once we go up in the spectrum and smoothly the chiral symmetry gets restored. We\ncan refer to such a phenomenon as chiral symmetry restoration of the second kind.\nAll this is in a very good analogy with the similar phenomenon in condensed matter\nphysics. Consider a metal which is in a superconducting phase. There is a condensation of\nthe Cooper pairs - which is analogous to the condensation of right-left quark pairs in the QCD\nvacuum - and as a consequence the low-lying excitations of the system are the excitations of\nquasiparticles - which are analogous to the constituent quarks in the low-lying hadrons. Now\nwe want to study this superconductor by external probe, e.g. by photons. If we probe the\nsuperconductor by the low-energy photons h̄ω ∼ ∆, then the condensation of the Cooper\npairs and the quasiparticle structure of the low-lying excitations are of crucial importance.\nOne clearly sees a gap ∆ and a quasiparticle structure in the response functions. However, if\none probes the same superconductor by the high-energy photons h̄ω ≫ ∆, then the response\nof the superconductor is the same as of the normal metal - the high energy photons do not\nsee quasiparticles and instead they are absorbed by the bare electrons. This is because the\nlong-range phase coherent correlations in the superconductor become irrelevant in this case\nand the external probe sees a bare particle rather than a quasiparticle. Similar, in the QCD\n2\n\n\fcase in order to create a hadron of a large mass one has to probe the QCD vacuum by\nthe high energy (frequency) external probe (current) and hence the physics (masses) of the\nhighly excited hadrons should be insensitive to the condensation of the chiral pairs in the\nvacuum.\nII. A SIMPLE PEDAGOGICAL EXAMPLE\n\nIt is instructive to consider a very simple quantum mechanical example of symmetry\nrestoration high in the spectrum. Though there are conceptual differences between the field\ntheory with spontaneous symmetry breaking and the one-particle quantum mechanics (where\nonly explicit symmetry breaking is possible), nevertheless this simple example illustrates how\nthis general phenomenon comes about.\nThe example we consider is a two-dimensional harmonic oscillator. We choose the harmonic oscillator only for simplicity; the property that will be discussed below is quite general\none and can be seen in other systems. The Hamiltonian of the system is invariant under\nU(2) = SU(2) × U(1) transformations. This symmetry has profound consequences on the\nspectrum of the system. The energy levels of this system are trivially found and are given\nby\nEN,m = (N + 1); m = N, N − 2, N − 4, * * * , −(N − 2), −N ,\n\n(1)\n\nVSB = A θ(r − R),\n\n(2)\n\nwhere N is the principle quantum number and m is the (two dimensional) angular momentum. As a consequence of the symmetry, the levels are (N + 1)-fold degenerate.\nNow suppose we add to the Hamiltonian a SU(2) symmetry breaking interaction (but\nwhich is still U(1) invariant) of the form\nwhere A and R are parameters and θ is the step function. Clearly, VSB is not invariant under\nthe SU(2) transformation. Thus the SU(2) symmetry is explicitly broken by this additional\ninteraction, that acts only within a circle of radius R. As a result one would expect that the\neigenenergies will not reflect the degeneracy structure of seen in eq. (1) if the coefficients\nR, A are sufficiently large. Indeed, we have solved numerically for the eigenstates for the\ncase of A = 4 and R = 1 in dimensionless units and one does not see a multiplet structure\nin the low-lying spectrum as can be seen in Fig. 1.\nWhat is interesting for the present context is the high-lying spectrum. In Fig. 1 we have\nalso plotted the energies between 70 and 74 for a few of the lower m's. A multiplet structure\nis quite evident-to very good approximation the states of different m's form degenerate\nmultiplets and, although we have not shown this in the figure these multiplets extend in m\nup to m = N.\nHow does this happen? The symmetry breaking interaction plays a dominant role in the\nspectroscopy for small energies. Indeed, at small excitation energies the system is mostly\nlocated at distances where the symmetry breaking interaction acts and where it is dominant.\nHence the low-lying spectrum to a very large extent is motivated by the symmetry breaking\ninteraction. However, at high excitation energies the system mostly lives at large distances,\nwhere physics is dictated by the unperturbed harmonic oscillator. Hence at higher energies\nthe spectroscopy reveals the SU(2) symmetry of the two-dimensional harmonic oscillator.\n3\n\n\fFIGURES\n7\n\n0\n\n2\n\n4\n\n0\n\n2\n\n4\n\nEnergy\n\nEnergy\n\n6\n5\n4\n3\n2\n1\n\nm quantum number\n\n74\n73.5\n73\n72.5\n72\n71.5\n71\n70.5\n\n0\n\n2\n\n4\n\n6\n\n8\n\n0\n\n2\n\n4\n\n6\n\n8\n\nm quantum number\n\nFIG. 1. The low-lying (left panel) and highly-lying (right panel) spectra of two-dimensional\nharmonic oscillator with the SU (2)-breaking term.\nIII. IMPLICATIONS FOR BARYON SPECTRA\n\nIf chiral symmetry restoration of the second kind happens in the regime where the spectrum is still quasidescrete (i.e. the successive excitations with the given spin are well separated), then the symmetry restoration imposes very strong constraints on the spectrum,\nwhich will be discussed below. A question then arises as to which extent and where the\nhadron spectrum is still quasidescrete? Clearly it is the case for the low-lying resonances.\nHowever, the resonances with the given spin are still well separated in the mass region\nM ∼ 2 GeV and higher, which can be seen from the nucleon spectrum, see Fig. 2, as well\nas from the meson spectrum [5,6]. In addition, if the linear-like behaviour of both angular\n(M 2 ∼ J) and radial (M 2 ∼ n, where n numerates radial excitations of the states with the\ngiven spin) Regge trajectories is valid up to large masses, then the spectrum should be still\nquasidescrete in the region of validity of Regge phenomenology.\nWhat are the implications of the chiral symmetry restoration for a quasidiscrete spectrum? The equality of the spectral functions ρ1 (s) and ρ2 (s) means that both masses m1\nand m2 as well as the amplitudes h0|J1 |n1 i and h0|J2|n2 i coincide for all the successive radial\nexcitations. In other words, the excited states must fill in the irreducible representations\nof the parity-chiral group [2,3]. Thus the task is to find all possible representations of the\nSU(2)L ×SU(2)R group that are compatible with the definite parity of the physical state. We\nemphasize parity because the irreducible representations of the chiral group (IL , IR ) ( with\nIL and IR being isospins of the left and right subgroups) are not generally eigenstates of the\nparity operator, because under parity operation the left quarks transform into the right ones\nand vice versa. However, a direct sum of two irreducible representations (IL , IR ) ⊕ (IR , IL )\ndoes contain eigenstates of the parity operator and hence the corresponding multiplet should\nbe considered as a set of basis states for physical hadrons. What crucially important is that\nsuch a multiplet necessarily includes baryons with opposite parity.\nSince the total isospin I of a baryon can be obtained from the left and right isospins\nIL and IR according to a standard angular momentum addition rules and since there are\nno baryons with isospin greater than 3/2, one immediately obtains the following allowed\n4\n\n\fparity-chiral multiplets (1/2, 0) ⊕ (0, 1/2), (3/2, 0) ⊕ (0, 3/2), (1/2, 1) ⊕ (1, 1/2). The first\nmultiplet corresponds to parity doublets of any spin in the nucleon spectrum. The second\none describes the parity doublets of any spin in the delta spectrum. However, the latter\nmultiplet combines one parity doublet in the nucleon spectrum with the parity doublet in\nthe delta spectrum with the same spin.\nSummarizing, the phenomenological consequence of the chiral symmetry restoration of\nthe second kind high in N and ∆ spectra is that the baryon states will fill out the irreducible\nrepresentations of the parity-chiral group. If (1/2, 0) ⊕ (0, 1/2) and (3/2, 0) ⊕ (0, 3/2) multiplets were realized in nature, then the spectra of highly excited nucleons and deltas would\nconsist of parity doublets. However, the parity doublet with given spin in the nucleon spectrum a-priori would not be degenerate with the doublet with the same spin in the delta\nspectrum; these doublets would belong to different representations , i.e. to distinct multiplets and their energies are not related. On the other hand, if (1/2, 1) ⊕ (1, 1/2) were\nrealized, then the high-lying states in N and ∆ spectrum would have a N parity doublet\nand a ∆ parity doublet with the same spin and which are degenerate in mass. In either of\ncases the high-lying spectrum must systematically consist of parity doublets. We stress that\nthis classification is the most general one and does not rely on any model assumption about\nthe structure of baryons. What is interesting is that the same classification can be trivially\nobtained if one assumes that the chiral properties of baryons in the chirally restored regime\nare determined by three massless valence quarks.\nNow we have to analyze an empirical spectrum of baryons in order to see whether there\nare signs of chiral symmetry restoration. What is immediately evident from the empirical\nlow-lying spectrum is that positive and negative parity states with the same spin are not\nnearly degenerate. Even more, there is no one-to-one mapping of positive and negative parity\nstates of the same spin with masses below 1.7 GeV. This means that one cannot describe the\nlow-lying spectrum as consisting of sets of chiral partners. It is not so surprising since the\nlow-lying spectrum is mostly driven by the chiral symmetry breaking effects. The absence\nof parity doublets low in the spectrum is one of the most direct pieces of evidence that chiral\nsymmetry in QCD is spontaneously broken (and very strongly).\n3000\n[MeV]\n\n**\n2500\n\n2000\n\n*\n\n*\n\n**\n\n**\n\n**\n**\n\n**\n\n1500\n\n1000\n\n1\n2\n\n3\n2\n\n5\n2\n\n7\n2\n\n5\n\n9\n2\n\n11\n2\n\n13\n2\n\n\fFIG. 2. Excitation spectrum of the nucleon. The real part of the pole position is shown. Boxes\nrepresent experimental uncertainties. Those resonances which are not yet established are marked\nby two or one stars according to the PDG classification. The one-star resonances with J = 1/2\naround 2 GeV are given according to the recent Bonn (SAPHIR) results.\n\nStarting at the mass M ∼ 1.7 GeV one observes three almost perfect parity doublets\nwith spins J = 1/2, 3/2, 5/2. It is important that all these states are well established and\nhave **** or *** status according to PDG classification. The next excitations with the same\nquantum numbers are not yet established though existing crude data support parity doubling\nphenomenon. The lowest excitations with spin 9/2 are also well established states and they\nrepresent another good example of parity doubling. There are well established states with\nJ = 7/2 and J = 11/2 where the chiral partners have not yet been identified. According\nto a chiral symmetry restoration scenario they must exist. So it is a very interesting and\nimportant experimental task to find such states as well as to clear up a situation for J =\n1/2, 3/2, 5/2 resonances around 2 GeV.\nIn the delta spectrum there are also obvious parity doublets starting from the mass region\n1.9 - 2 GeV. Again, there are well established states (like J P = 7/2+ at 1950 MeV) where\nthe chiral partner has not yet been identified. So similar to the nucleon spectrum, the upper\npart of the delta spectrum must be experimentally explored.\nIV. IMPLICATIONS FOR MESON SPECTRA\n\nRecent data on highly excited mesons also suggest an evidence for chiral symmetry\nrestoration in hadron spectra [4]. Consider, as an example, the pseudoscalar and scalar\nmesons π, f0 , a0 , η within the two-flavor QCD. The corresponding currents (interpolating\nfields) Jπ (x), Jf0 (x),Ja0 (x) and Jη (x) belong to the (1/2, 1/2) ⊕ (1/2, 1/2) irreducible representation of the U(2)L × U(2)R = SU(2)L × SU(2)R × U(1)V × U(1)A group. Specifically\nthe pairs (Jπ (x), Jf0 (x)) and (Ja0 (x), Jη (x)) form the basis of the (1/2, 1/2) representation of the chiral group SU(2)L × SU(2)R . If the vacuum were invariant with respect to\nU(2)L × U(2)R transformations, then all four mesons, π, f0 , a0 and η̄ would be degenerate\n(as well as all their excited states). Once the U(1)A symmetry is broken explicitly through\nthe axial anomaly, but the chiral SU(2)L × SU(2)R symmetry is still intact in the vacuum,\nthen the spectrum would consist of degenerate (π, f0 ) and (a0 , η̄) pairs.1 If in addition the\nchiral SU(2)L × SU(2)R symmetry is spontaneously broken in the vacuum, the degeneracy\nis also lifted in the pairs above and the pion becomes a (pseudo)Goldstone boson. Indeed,\nthe masses of the lowest mesons are\nmπ ≃ 140MeV, mf0 ≃ 400 − 1200MeV, ma0 ≃ 985MeV, mη̄ ≃ 782MeV.\n\nThis immediately tells that both SU(2)L × SU(2)R and U(1)V × U(1)A are broken in the\nQCD vacuum to SU(2)I and U(1)V , respectively.\n\n1 η̄\n\nrepresents the two-flavor singlet state; its mass for the lowest mesons can be extracted from\nthe physical η and η ′ states.\n\n6\n\n\fSystematic data on highly excited mesons are still missing in the PDG tables. We will\nuse recent results of the partial wave analysis of mesonic resonances from 1.8 GeV to 2.4 GeV\nobtained in pp̄ annihilation at LEAR, see Table below. We note that the f0 state at 2102±13\nMeV is not considered by the authors as a q q̄ state (but rather as a candidate for glueball)\nbecause of its very unusual decay properties and very large mixing angle. This is in contrast\nto all other f0 mesons in this region, for which the mixing angles are small. Therefore these\nmesons are regarded as predominantly u, d = n states. Hence, in the following we will\nexclude the f0 state at 2102 ± 13 from our analysis which applies only to nn̄ states.\nMeson\nf0\nf0\nf0\nf0\nη\nη\nπ\nπ\nπ\na0\n\nI\n0\n0\n0\n0\n0\n0\n1\n1\n1\n1\n\nJP\n0+\n0+\n0+\n0+\n0−\n0−\n0−\n0−\n0−\n0+\n\nMass (MeV)\n1770 ± 12\n2040 ± 38\n2102 ± 13\n2337 ± 14\n2010+35\n−60\n2285 ± 20\n1801 ± 13\n2070 ± 35\n2360 ± 25\n2025±?\n\nWidth (MeV)\n220 ± 40\n405 ± 40\n211 ± 29\n217 ± 33\n270 ± 60\n325 ± 30\n210 ± 15\n310+100\n−50\n300+100\n−50\n320±?\n\nReference\n[7]\n[5]\n[5]\n[5]\n[5]\n[5]\n[8]\n[6]\n[6]\n[6]\n\nThe prominent feature of the data is an approximate degeneracy of the three highest\nstates in the pion spectrum with the three highest states in the f0 spectrum:\nπ(1801 ± 13) − f0 (1770 ± 12),\n\n(3)\n\nπ(2070 ± 35) − f0 (2040 ± 38),\n\n(4)\n\nπ(2360 ± 25) − f0 (2337 ± 14).\n\n(5)\n\nThis can be considered as a manifestation of chiral symmetry restoration high in the\nspectra. The approximate degeneracy of these physical states indicates that the chiral\nSU(2)L × SU(2)R transformation properties of the corresponding currents are not violated\nby the vacuum. This means that the chiral symmetry breaking of the vacuum becomes\nirrelevant for the high-lying states and the physical states above form approximately the\nchiral pairs in the (1/2, 1/2) representation of the chiral group. The physics of the highlying hadrons is such as if there were no spontaneous chiral symmetry breaking.\nA similar behaviour is observed from a comparison of the a0 and η masses high in the\nspectra:\na0 (2025±?) − η(2010+35\n−60 ).\n\n(6)\n\nUpon examining the experimental data more carefully one notices not only a degeneracy\nin the chiral pairs, but also an approximate degeneracy in U(1)A pairs (π, a0 ) and (f0 , η)\n(in those cases where the states are established). If so, one can preliminary conclude that\n7\n\n\fnot only the chiral SU(2)L × SU(2)R symmetry is restored, but the whole U(2)L × U(2)R\nsymmetry of the QCD Lagrangian. Then the approximate (1/2, 1/2) ⊕ (1/2, 1/2) multiplets\nof this group are given by:\nπ(1801 ± 13) − f0 (1770 ± 12) − a0 (?) − η(?);\n\n(7)\n\nπ(2070 ± 35) − f0 (2040 ± 40) − a0 (2025±?) − η(2010+35\n−60 );\n\n(8)\n\nπ(2360 ± 25) − f0 (2337 ± 14) − a0 (?) − η(2285 ± 20).\n\n(9)\n\nThis preliminary conclusion would be strongly supported by a discovery of the missing\na0 meson in the mass region around 2.3 GeV as well as by the missing a0 and η mesons\nin the 1.8 GeV region. That these missing mesons should indeed exist is also supported\nby the hypothesis of the linear radial Regge trajectories for highly excited states [5,6]. We\nhave to stress, that the U(1)A restoration high in the spectra does not mean that the axial\nanomaly of QCD vanishes, but rather that the specific gluodynamics (e.g. instantons) that\nare related to the anomaly become unimportant there. It should also be emphasized that the\nonly restoration of U(1)V × U(1)A symmetry (without the SU(2)L × SU(2)R ) is impossible.\nThis was discussed in ref. [2]. The reason is that even if the effects of the explicit U(1)A\nsymmetry breaking via the axial anomaly vanish, the U(1)V × U(1)A would still be spontaneously broken once the SU(2)L × SU(2)R were spontaneously broken. This is because the\nsame quark condensates in the QCD vacuum that break SU(2)L × SU(2)R do also break\nU(1)V × U(1)A .\n\nV. IMPLICATIONS FOR MODELING OF HADRONS\n\nIt is quite natural to assume that the physics of the highly excited hadrons is due to\nconfinement in QCD. If so it follows that the confining gluodynamics is still important in\nthe regime where chiral symmetry breaking in the vacuum has become irrelevant. Then it\nfollows that the mechanisms of confinement and chiral symmetry breaking in QCD are not\nthe same.\nThe phenomenon of chiral symmetry restoration high in the spectra rules out the potential description of high-lying hadrons in the spirit of the constituent quark model. Clearly,\nthe chiral symmetry restoration by itself implies that constituent quarks as effective degree\nof freedom (whose mass is directly related to spontaneous chiral symmetry breaking in the\nvacuum) become inadequate high in the spectrum, though it is a fruitful concept for the\nlow-lying hadrons. That the potential description is incompatible with the parity doubling\nis also seen from the following.\nConsider, for instance, mesons. Within the potential description of mesons the parity\nof the state is unambiguously prescribed by the relative orbital angular momentum L of\nquarks. For example, all the states on the radial pion Regge trajectory are 1 S0 q q̄ states,\nwhile the members of the f0 trajectory are the 3 P0 states. Clearly, such a picture cannot\nexplain the systematical parity doubling as it would require that the stronger centrifugal\n8\n\n\frepulsion in the case of 3 P0 mesons (as compared to the 1 S0 ones) as well as the strong and\nattractive spin-spin force in the case of 1 S0 states (as compared to the weak spin-spin force\nin the 3 P0 channel) must systematically lead to an approximate degeneracy for all radial\nstates. This is very improbable. Similar conclusions can be easily obtained for baryons [1].\nMore generally, the chiral symmetry restoration of the second kind is in contradiction with\nall models where chiral symmetry breaking is induced by confinement.\nThe potential picture also implies strong spin-orbit interactions between quarks while the\nspin-orbit splittings are absent or very small for excited mesons and baryons in the u, d sector.\nThe strong spin-orbit interactions inevitably follow from the Thomas precession (once the\nconfinement is described through a scalar confining potential)2 , and this very strong spinorbit force must be practically exactly compensated by other strong spin-orbit force from\ne.g. the one-gluon-exchange interaction in this picture. In principle such a cancellation could\nbe provided by tuning the parameters for some specific (sub)families of mesons. However, in\nthis case the spin-orbit forces become very strong for other (sub)families. This is a famous\nspin-orbit problem of constituent quark model.\nThis picture should be contrasted with the string description of highly excited hadrons\n[9]. Within the latter one these hadrons are the relativistic strings (with the color-electric\nfield in the string) with practically massless bare quarks at the ends; these massless quarks\nare combined into parity-chiral multiplets. The string picture is compatible with the chiral\nsymmetry restoration because there always exists a solution for the right-handed and lefthanded quarks at the end of the string with exactly the same energy and total angular\nmomentum. Since the nonperturbative field in the string is pure electric and the electric\nfield is \"flavor-blind\", the string dynamics itself is not sensitive to the specific flavor of\na light quark once the chiral limit is taken. This picture explains the empirical paritydoubling because for every intrinsic quantum state of the string there necessarily appears\nparity doubling of the states with the same total angular momentum of hadron. Hence\nthe string picture is compatible not only with the SU(2)L × SU(2)R restoration, but more\ngenerally with the U(2)L × U(2)R one. In addition, there is no spin-orbit force at all once\nthe chiral symmetry is restored. This is because the helicity operator does not commute\nwith the spin-orbit operator and a motion of a quark with the fixed helicity is not affected\nby the spin-orbit force.\n\n2 Note\n\nalso that a scalar potential explicitly breaks the chiral symmetry in contradiction to the\nrequirement that the chiral symmetry must be restored high in the spectra.\n\n9\n\n\fREFERENCES\n[1]\n[2]\n[3]\n[4]\n[5]\n[6]\n[7]\n[8]\n[9]\n\nL. Ya. Glozman, Phys. Lett. B 475 (2000) 329.\nT. D. Cohen and L. Ya. Glozman, Phys. Rev. D 65 (2002) 016006.\nT. D. Cohen and L. Ya. Glozman, Int. J. Mod. Phys. A 17 (2002) 1327.\nL. Ya. Glozman, Phys. Lett. B 539 (2002) 257.\nA. V. Anisovich et al, Phys. Lett. B 491 (2000) 47.\nA. V. Anisovich et al, Phys. Lett. B 517 (2001) 261.\nA. V. Anisovich et al, Phys. Lett. B 449 (1999) 154.\nParticle Data Group, D. Groom et al, Eur. Phys. J C15 (2000) 1.\nL. Ya. Glozman, Phys. Lett. B 541 (2002) 115.\n\n10\n\n\f"}