{"id": "http://arxiv.org/abs/hep-ph/0112124v2", "guidislink": true, "updated": "2002-02-21T03:52:12Z", "updated_parsed": [2002, 2, 21, 3, 52, 12, 3, 52, 0], "published": "2001-12-08T19:08:50Z", "published_parsed": [2001, 12, 8, 19, 8, 50, 5, 342, 0], "title": "Massive quark propagator and competition between chiral and diquark\n  condensate", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0102003%2Chep-ph%2F0102123%2Chep-ph%2F0102261%2Chep-ph%2F0102293%2Chep-ph%2F0102346%2Chep-ph%2F0102343%2Chep-ph%2F0102226%2Chep-ph%2F0102158%2Chep-ph%2F0102065%2Chep-ph%2F0102257%2Chep-ph%2F0102095%2Chep-ph%2F0102132%2Chep-ph%2F0102049%2Chep-ph%2F0102064%2Chep-ph%2F0102146%2Chep-ph%2F0102072%2Chep-ph%2F0102272%2Chep-ph%2F0102111%2Chep-ph%2F0102192%2Chep-ph%2F0102038%2Chep-ph%2F0102183%2Chep-ph%2F0102113%2Chep-ph%2F0102014%2Chep-ph%2F0112195%2Chep-ph%2F0112301%2Chep-ph%2F0112271%2Chep-ph%2F0112229%2Chep-ph%2F0112049%2Chep-ph%2F0112333%2Chep-ph%2F0112237%2Chep-ph%2F0112295%2Chep-ph%2F0112099%2Chep-ph%2F0112086%2Chep-ph%2F0112023%2Chep-ph%2F0112273%2Chep-ph%2F0112272%2Chep-ph%2F0112331%2Chep-ph%2F0112157%2Chep-ph%2F0112114%2Chep-ph%2F0112223%2Chep-ph%2F0112117%2Chep-ph%2F0112334%2Chep-ph%2F0112027%2Chep-ph%2F0112001%2Chep-ph%2F0112066%2Chep-ph%2F0112322%2Chep-ph%2F0112182%2Chep-ph%2F0112214%2Chep-ph%2F0112151%2Chep-ph%2F0112165%2Chep-ph%2F0112100%2Chep-ph%2F0112220%2Chep-ph%2F0112312%2Chep-ph%2F0112112%2Chep-ph%2F0112347%2Chep-ph%2F0112300%2Chep-ph%2F0112045%2Chep-ph%2F0112130%2Chep-ph%2F0112194%2Chep-ph%2F0112191%2Chep-ph%2F0112174%2Chep-ph%2F0112292%2Chep-ph%2F0112060%2Chep-ph%2F0112222%2Chep-ph%2F0112303%2Chep-ph%2F0112256%2Chep-ph%2F0112171%2Chep-ph%2F0112285%2Chep-ph%2F0112200%2Chep-ph%2F0112053%2Chep-ph%2F0112317%2Chep-ph%2F0112319%2Chep-ph%2F0112133%2Chep-ph%2F0112143%2Chep-ph%2F0112308%2Chep-ph%2F0112124%2Chep-ph%2F0112250%2Chep-ph%2F0112306%2Chep-ph%2F0112351%2Chep-ph%2F0112357%2Chep-ph%2F0112226%2Chep-ph%2F0112097%2Chep-ph%2F0112108%2Chep-ph%2F0112337%2Chep-ph%2F0112190%2Chep-ph%2F0112057%2Chep-ph%2F0112167%2Chep-ph%2F0112082%2Chep-ph%2F0112268%2Chep-ph%2F0112208%2Chep-ph%2F0112270%2Chep-ph%2F0112113%2Chep-ph%2F0112258%2Chep-ph%2F0112346%2Chep-ph%2F0112176%2Chep-ph%2F0112265%2Chep-ph%2F0112047%2Chep-ph%2F0112084%2Chep-ph%2F0112336%2Chep-ph%2F0112235%2Chep-ph%2F0112020&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Massive quark propagator and competition between chiral and diquark\n  condensate"}, "summary": "The Green-function approach has been extended to the moderate baryon density\nregion in the framework of an extended Nambu--Jona-Lasinio model, and the\nthermodynamic potential with both chiral and diquark condensates has been\nevaluated by using the massive quark propagator. The phase structure along the\nchemical potential direction has been investigated and the strong competition\nbetween the chiral and diquark condensate has been analyzed by investigating\nthe influence of the diquark condensate on the sharp Fermi surface. The\ninfluence of the diquark condensate on the quark properties has been\ninvestigated, even though the quarks in the color breaking phase are very\ndifferent from that in the chiral breaking phase, the difference between quarks\nin different colors is very small.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0102003%2Chep-ph%2F0102123%2Chep-ph%2F0102261%2Chep-ph%2F0102293%2Chep-ph%2F0102346%2Chep-ph%2F0102343%2Chep-ph%2F0102226%2Chep-ph%2F0102158%2Chep-ph%2F0102065%2Chep-ph%2F0102257%2Chep-ph%2F0102095%2Chep-ph%2F0102132%2Chep-ph%2F0102049%2Chep-ph%2F0102064%2Chep-ph%2F0102146%2Chep-ph%2F0102072%2Chep-ph%2F0102272%2Chep-ph%2F0102111%2Chep-ph%2F0102192%2Chep-ph%2F0102038%2Chep-ph%2F0102183%2Chep-ph%2F0102113%2Chep-ph%2F0102014%2Chep-ph%2F0112195%2Chep-ph%2F0112301%2Chep-ph%2F0112271%2Chep-ph%2F0112229%2Chep-ph%2F0112049%2Chep-ph%2F0112333%2Chep-ph%2F0112237%2Chep-ph%2F0112295%2Chep-ph%2F0112099%2Chep-ph%2F0112086%2Chep-ph%2F0112023%2Chep-ph%2F0112273%2Chep-ph%2F0112272%2Chep-ph%2F0112331%2Chep-ph%2F0112157%2Chep-ph%2F0112114%2Chep-ph%2F0112223%2Chep-ph%2F0112117%2Chep-ph%2F0112334%2Chep-ph%2F0112027%2Chep-ph%2F0112001%2Chep-ph%2F0112066%2Chep-ph%2F0112322%2Chep-ph%2F0112182%2Chep-ph%2F0112214%2Chep-ph%2F0112151%2Chep-ph%2F0112165%2Chep-ph%2F0112100%2Chep-ph%2F0112220%2Chep-ph%2F0112312%2Chep-ph%2F0112112%2Chep-ph%2F0112347%2Chep-ph%2F0112300%2Chep-ph%2F0112045%2Chep-ph%2F0112130%2Chep-ph%2F0112194%2Chep-ph%2F0112191%2Chep-ph%2F0112174%2Chep-ph%2F0112292%2Chep-ph%2F0112060%2Chep-ph%2F0112222%2Chep-ph%2F0112303%2Chep-ph%2F0112256%2Chep-ph%2F0112171%2Chep-ph%2F0112285%2Chep-ph%2F0112200%2Chep-ph%2F0112053%2Chep-ph%2F0112317%2Chep-ph%2F0112319%2Chep-ph%2F0112133%2Chep-ph%2F0112143%2Chep-ph%2F0112308%2Chep-ph%2F0112124%2Chep-ph%2F0112250%2Chep-ph%2F0112306%2Chep-ph%2F0112351%2Chep-ph%2F0112357%2Chep-ph%2F0112226%2Chep-ph%2F0112097%2Chep-ph%2F0112108%2Chep-ph%2F0112337%2Chep-ph%2F0112190%2Chep-ph%2F0112057%2Chep-ph%2F0112167%2Chep-ph%2F0112082%2Chep-ph%2F0112268%2Chep-ph%2F0112208%2Chep-ph%2F0112270%2Chep-ph%2F0112113%2Chep-ph%2F0112258%2Chep-ph%2F0112346%2Chep-ph%2F0112176%2Chep-ph%2F0112265%2Chep-ph%2F0112047%2Chep-ph%2F0112084%2Chep-ph%2F0112336%2Chep-ph%2F0112235%2Chep-ph%2F0112020&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Green-function approach has been extended to the moderate baryon density\nregion in the framework of an extended Nambu--Jona-Lasinio model, and the\nthermodynamic potential with both chiral and diquark condensates has been\nevaluated by using the massive quark propagator. The phase structure along the\nchemical potential direction has been investigated and the strong competition\nbetween the chiral and diquark condensate has been analyzed by investigating\nthe influence of the diquark condensate on the sharp Fermi surface. The\ninfluence of the diquark condensate on the quark properties has been\ninvestigated, even though the quarks in the color breaking phase are very\ndifferent from that in the chiral breaking phase, the difference between quarks\nin different colors is very small."}, "authors": ["Mei Huang", "Pengfei Zhaung", "Weiqin Chao"], "author_detail": {"name": "Weiqin Chao"}, "author": "Weiqin Chao", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.65.076012", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/hep-ph/0112124v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-ph/0112124v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Revtex, 34 pages, 7 figures, section V revised, accepted by PRD", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "nucl-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-ph/0112124v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-ph/0112124v2", "journal_reference": "Phys.Rev. D65 (2002) 076012", "doi": "10.1103/PhysRevD.65.076012", "fulltext": "Massive quark propagator and competition between\nchiral and diquark condensate\nMei Huang1 , Pengfei Zhuang1 , Weiqin Chao2\n1\n\nPhysics Department, Tsinghua University, Beijing 100084, China\n\narXiv:hep-ph/0112124v2 21 Feb 2002\n\nhuangmei@mail.tsinghua.edu.cn\nzhuangpf@mail.tsinghua.edu.cn\n2\n\nCCAST, Beijing 100080, China\n\nInstitute of High Energy Physics, CAS, Beijing 100039, China\nchaowq@hp.ccast.ac.cn\n\nThe Green-function approach has been extended to the moderate baryon\ndensity region in the framework of an extended Nambu–Jona-Lasinio model,\nand the thermodynamic potential with both chiral and diquark condensates\nhas been evaluated by using the massive quark propagator. The phase structure along the chemical potential direction has been investigated and the\nstrong competition between the chiral and diquark condensate has been analyzed by investigating the influence of the diquark condensate on the sharp\nFermi surface. The influence of the diquark condensate on the quark properties has been investigated, even though the quarks in the color breaking\nphase are very different from that in the chiral breaking phase, the difference\nbetween quarks in different colors is very small.\n\n1\n\n\fI. INTRODUCTION\n\nQCD phase transitions along the baryon density direction has attracted much attention\nrecently since it was found that the color-superconducting gap can be of the order of 100MeV\n[1] and [2], which is two orders larger than early perturbative estimations [3]. However, till\nnow, there is no uniform framework discussing the phase structure in the wide region of\nchemical potential μ from about 300MeV to 108 MeV .\nIn the idealized case at asymptotically high baryon densities, the color superconductivity\nwith two massless flavors and the color-flavor-locking (CFL) phase with three degenerate\nmassless quarks have been widely discussed from first principle QCD calculations, see [4] and\nreferences therein. Usually, the diagrammatic methods are used in the asymptotic densities.\nThe Green-function of the eight-component field and the gap equation were discussed in\ndetails in [5] [6]. Neither current quark mass nor chiral condensate are necessary to be\nconsidered because they can be neglected compared with the very high Fermi surface. At\nless-than-asymptotic densities, the corrections of non-zero quark mass to the pure CFL phase\ncan be treated perturbatively by expanding the current quark mass around the chiral limit\n[8] [9].\nFor physical applications, we are more interested in the moderate baryon density region,\nwhich may be related to the neutron stars and, in very optimistic cases even to heavy-ion\ncollisions. Usually, effective models such as instanton, as well as Nambu-Jona-Lasinio (NJL)\nmodel, are used. The model parameters are fixed in the QCD vacuum. In this region,\nthe usual way is to use the variational methods working out the gap equations from the\nthermodynamic potential [10]- [23], except for [13] and [16] in the instanton model, where\nthe quark propagator was evaluated explicitly, but the form is complicated.\nOne of our main aims in this paper is to apply the Green-function approach in the\nmoderate baryon density region. To work out the phase structure from hadron phase to\nthe color superconducting phase, one should deal with the chiral condensate and diquark\ncondensate simultaneously. Because the chiral condensation contributes a dynamic quark\n2\n\n\fmass, it is not reasonable any more in this density region to treat the quark mass term\nperturbatively, like in [9]. By using the energy projectors for massive quark, we will evaluate\nthe Nambu-Gorkov massive quark propagator, which will help us deal with the chiral and\ndiquark condensate simultaneously.\nIn the normal phase, the quarks in different colors are degenerate, while in the color\nbreaking phase, it is natural to assume that the quarks involved in the diquark condensate\nare different from that not participating in the diquark condensate. In [13] and [16], different\nmasses for the quarks which participate and not participate in the diquark condensate are\nintroduced. However, we will see it difficult to get the mass expression for the quarks\nparticipating in the diquark condensate, because the particles and holes mix with each other\nand the elementary excitations are quasi-particles and quasi-holes near the Fermi surface.\nIn our case, the difference between quarks in different colors has been reflected by their\npropagators, we read the difference through calculating the quarks' chiral condensate, but\nnot trying to work out their masses. In the chiral limit, the chiral condensate disappears\nentirely in the color superconducting phase, it is not possible to investigate the influence of\ncolor breaking on quarks in different colors, so we will keep the current quark mass finite in\nthis paper.\nIn the moderate baryon density region, people are interested in the question whether\nthere exists a region where both the chiral symmetry and color symmetry are broken [10][15]. In the chiral limit it was found that the existence of the mixed broken phase depends\non the coupling constants GS and GD in the quark anti-quark and diquark channels [12] [14].\nIn the case of small ratio of GD /GS < 1 the calculations in the instanton model [10] [11],\nNJL model [12] and random matrix model [14] show a strong competition between the chiral\nand diquark condensates, i.e., where one condensate is nonzero the other vanishes. While\nfor GD /GS > 1 the calculations in the random matrix model [14] and NJL model [12] show\nthat there exists a region where both chiral (dynamical) symmetry and color symmetry are\nbroken, and the chiral and diquark condensate coexist. The larger value of GD /GS is, the\nwider region of the mixed broken phase has been found in the random matrix model [14].\n3\n\n\fThe presence of a small current quark mass will induce that chiral symmetry only restores\npartially and there will always exist a mall chiral condensate in the color superconducting\nphase, this phenomena had been called coexistence of chiral and diquark condensates in [10]\n[11]. In order to differ from this coexistence of the diquark and the small chiral condensate\ninduced by current quark mass, we will call the coexistence region of the diquark and large\nchiral condensate induced by large GD /GS before the chiral phase transition as mixed broken\nphase.\nIn the coexistence region resulted by current quark mass, the chiral condensate is small\ncomparing with the diquark condensate, and the role of the chiral condensate can be prescribed by the Anderson theroem [15], i.e., in this phase, the contribution of the chiral\ncondensate to thermodynamic quantities becomes strongly suppressed, and one can calculate the diquark condensate neglecting the influence of the chiral condensate.\nIn this paper, we will explain the existence of the mixed broken phase induced by larger\nGD /Gs by analyzing the influence of the diquark condensate on the Fermi surface. In the\nmean-field approximation of the NJL model, the thermal system of the constituent quarks\nis a nearly ideal Fermi gas, and there is a sharp Fermi surface. The chiral symmetry begins\nto restore when the chemical potential is larger than the quark mass in the vacuum. When\na diquark condensate is formed, the Cooper pair extends the Fermi surface, which induces\nthe chiral symmetry restoring at a smaller chemical potential. The stronger the coupling\nconstant in the diquark channel, the larger the diquark condensate and the smoother the\nFermi surface.\nIn the following, we briefly introduce the extended NJL model in Sec. II, then in Sec III,\nwe evaluate the thermodynamic potential using the massive quark propogator. In Sec. IV,\nwe get the gap equations and condensates. The numerical results and conclusions are given\nat the end.\n\n4\n\n\fII. THE EXTENDED NJL MODEL\n\nThe choice of the NJL model [24] is motivated by the fact that this model displays the\nsame symmetries as QCD and that it describes well the spontaneous breakdown of chiral\nsymmetry in the vacuum and its restoration at high temperature and density. The model we\nused in this paper is an extended version of the two-flavor NJL model including interactions\nin the color singlet quark-antiquark channel and color anti-triplet diquark channel, which is\nnot directly extended from the NJL model, but from the QCD Lagrangian [25]- [27].\nThe importance of color 3̄ diquark degree of freedom is related to the fact that one can\nconstruct a color-singlet nucleon current based on it. Because the gluon exchange between\ntwo quarks in the color 3̄ channel is attractive, one can view a color singlet baryon as a\nquark-diquark bound state. And experimental data from pp collisions indicate the existence\nof this quark-diquark component in nucleons.\nThe first attempt to investigate the diquark properties in the NJL model was taken in [28].\nStarting from an NJL model for scalar, pseudoscalar, vector and axial-vector interactions of\nthe (q̄q) × (q̄q) type and Fierz-transforming away the vector and axial-vector interactions,\nthe scalar and pseudoscalar mesons, and diquarks can be obtained. However, this method\ncould not get a consistent treatment of vector and axial-vector particles.\nThe extended NJL model we used was derived directly from QCD Lagrangian [25] [26].\nIntegrating out gluon degrees of freedom from QCD Lagrangian, and performing a local approximation for the (nonperturbative) gluon propagator, one gets a contact current-current\ninteraction. By using a special Fierz-rearrangement [29], one can completely decompose the\ntwo-quark-current interaction term into \"attractive\" color singlet (q̄q) and color antitriplet\n(qq) channels. In this way, a complete simultaneous description of scalar, pseudo-scalar,\nvector, and axial-vector mesons and diquarks is possible, thus the extended NJL model\nincluding (q̄q) × (q̄q) interactions is completed by a corresponding (q̄q̄) × (qq) interaction\npart.\nIn our present work, we only consider scalar, pseudoscalar mesons and scalar diquark,\n5\n\n\fand using the following Lagrangian density\nL = q̄(iγ μ ∂μ − m0 )q + GS [(q̄q)2 + (q̄iγ5~τ q)2 ] + GD [(iq̄ C εǫb γ5 q)(iq̄εǫb γ5 q C )],\n\n(1)\n\nwhere q C = C q̄ T , q̄ C = q T C are charge-conjugate spinors, C = iγ 2 γ 0 is the charge conjugation matrix (the superscript T denotes the transposition operation), m0 is the current quark\nmass, the quark field q ≡ qiα with i = 1, 2 and α = 1, 2, 3 is a flavor doublet and color triplet,\nas well as a four-component Dirac spinor, ~τ = (τ 1 , τ 2 , τ 3 ) are Pauli matrices in the flavor\nspace, where τ 2 is antisymmetric, and (ε)ik ≡ εik , (ǫb )αβ ≡ ǫαβb are totally antisymmetric\ntensors in the flavor and color spaces.\nIn (1), GS and GD are independent effective coupling constants in the scalar quarkantiquark and scalar diquark channel. The former is responsible for the meson excitations,\nand the later for the diquark excitations, which in principle can be determined by fitting\nmesons' and baryons' properties in the vacuum. The attractive interaction in different\nchannels in this Lagrangian will give rise to a very rich structure of the phase diagram.\nAt zero temperature and density, the attractive interaction in the color singlet channel is\nresponsible for the appearance of a quark anti-quark condensate and for the spontaneous\nbreakdown of the chiral symmetry, and the interaction in the qq channel binds quarks into\ndiquarks (and baryons), but is not strong enough to induce diquark condensation. As\nthe density increases, Pauli blocking suppresses the q̄q interaction, while the attractive\ninteraction in the color anti-triplet diquark channel will induce the quark-quark condensate\naround the Fermi surface which can be identified as a superconducting phase.\nAfter bosonization [25] [26], one can obtain the linearized version of the model (1)\n1\n1\nL̃ = q̄(iγ μ ∂μ − m0 )q − q̄(σ + iγ 5~τ ~π )q − ∆∗b (iq̄ C εǫb γ5 q) − ∆b (iq̄εǫb γ5 q C )\n2\n2\nσ 2 + ~π 2 ∆∗b ∆b\n−\n−\n,\n4GS\n4GD\n\n(2)\n\nwith the bosonic fields\n∆b ∼ iq̄ C εǫb γ5 q, ∆∗b ∼ iq̄εǫb γ5 q C , σ ∼ q̄q, ~π ∼ iq̄γ 5~τ q.\n6\n\n(3)\n\n\fClearly, the σ and ~π fields are color singlets, and the diquark fields ∆b and ∆∗b are\ncolor antitriplet and (isoscalar) singlet under the chiral SU(2)L × SU(2)R group. σ 6= 0 and\n∆b 6= 0 indicate that chiral symmetry and color symmetry are spontaneously broken. We\nassume that the two condensates coexist, i.e.,\nσ 6= 0, ~π = 0;\n∆1 = ∆2 = 0, ∆3 6= 0,\n\n(4)\n\nHere it has been regarded that only the first two colors participating in the condensate,\nwhile the third one does not. In the later expressions, we will simply use ∆ ≡ ∆3 .\nThe real vacuum will be determined by the minimum of the thermodynamic potential at\nT = 0 and μ = 0, and the minimum of the thermodynamic potential at any T, μ determines\nthe stable state at that point.\n\nIII. PARTITION FUNCTION AND THERMODYNAMIC POTENTIAL\n\nA. Nambu-Gorkov formalism\n\nThe partition function of the grand canonical ensemble can be evaluated by using standard method [30] [31],\nZ = N′\n\nZ\n\n[dq̄][dq]exp{\n\nZ\n\nβ\n\n0\n\ndτ\n\nZ\n\nd3~x (L̃ + μq̄γ0 q)},\n\n(5)\n\nwhere μ is the chemical potential, and β = 1/T is the inverse of temperature T .\nAccording to the mean field approximation Eq. (4), we can write the partition function\nas a product of three parts,\nZ = Zconst Zq1,2 Zq3 .\n\n(6)\n\nThe constant part is\n′\n\nZconst = N exp{−\n\nZ\n\n0\n\nβ\n\ndτ\n\nZ\n\n7\n\nd3~x [\n\n∆∗ ∆\nσ2\n+\n}.\n4GS\n4GD\n\n(7)\n\n\fFor the quarks in the first two colors (named as \"the first two quarks\" in the following)\nQ = q1,2 participating in the quark condensate, one has\nZq1,2 =\n\n1\nd3~x [ Q̄(iγ μ ∂μ − m + μ)Q +\n2\n0\n1 C μ\n1\n1\nC\nQ̄ (iγ ∂μ − m − μ)Q + Q̄∆− QC + Q̄C ∆+ Q]}.\n2\n2\n2\n\nZ\n\n[dQ̄][dQ]exp{\n\nβ\n\nZ\n\ndτ\n\nZ\n\n(8)\n\nHere we have introduced the constituent quark mass\nm = m0 + σ,\n\n(9)\n\n∆− = −i∆εǫb γ5 , ∆+ = −i∆∗ εǫb γ5\n\n(10)\n\nand defined ∆± as\n\nwith the relation ∆+ = γ 0 (∆− )† γ 0 .\nFor the quark in the third color (named as \"the third quark\" in the following), which is\nnot involved in the diquark condensate, one has\nZq3 =\n\nZ\n\n[dq̄3 ][dq3 ]exp{\n\nZ\n\n0\n\nβ\n\ndτ\n\nZ\n\n1\n1\nd3~x [ q̄3 (iγ μ ∂μ − m + μ)q3 + q̄3C (iγ μ ∂μ − m − μ)q3C ]}. (11)\n2\n2\n\nIntroducing the 8-component spinors for the third quark and the first two quarks, respectively\n\n\n\nΨ3 = \n\n\n\n\nΨ=\n\n\n\n\nq3 \n\nq3C\n\n,\n\n\n\nQ \nC\n\nQ\n\n,\n\n\nΨ̄3 = (q̄3 q̄3C ),\n\n(12)\n\nΨ̄ = (Q̄ Q̄C ),\n\n(13)\n\nand using the Fourier transformation in the momentum space,\n1 X X −i(ωn τ −~p*~x)\ne\nq(~p),\nq(x) = √\nV n p~\n\n(14)\n\nwhere V is the volume of the thermal system, we can re-write the partition function Eqs.\n(8) and (11) in the momentum space as\n8\n\n\fZq1,2 =\n\nZ\n\n[dΨ]exp{\n\n1 X G−1\nΨ̄\nΨ}\n2 n,~p\nT\n\n= Det1/2 (βG−1 ),\n\n(15)\n\nand\nZq3 =\n\nZ\n\nG−1\n1X\nΨ̄3 0 Ψ3 }\n[dΨ3 ]exp{\n2 n,~p\nT\n\n= Det1/2 (βG−1\n0 ),\n\n(16)\n\nwhere the determinantal operation Det is to be carried out over the Dirac, color, flavor\nand the momentum-frequency space. In Eqs. (15) and (16), we have defined the quark\npropagator in the normal phase\nh\n\nG0 −1 = \n\n\n\ni−1\nG+\n0\n\n\n\n0\nh\n\nG−\n0\n\n0\n\n\n\ni−1  ,\n\n(17)\n\nwith\n−1\n[G±\n= (p0 ± μ)γ0 − ~γ * p~ − m\n0]\n\n(18)\n\nand p0 = iωn , and the quark propagator in the color-breaking phase\nG−1 =\n\nh\ni\n+ −1\n G0\n\nh\n\n\n∆\n\nG−\n0\n\n+\n\n∆\n\n\n\n−\n\n\n\ni−1  .\n\n(19)\n\nThe Nambu-Gorkov propagator G(p) is determined from solving 1 = G−1 G, resulting in\n\n\n\nG=\n\n\nG\nΞ\n\n+\n\n+\n\n−\n\n\n\nΞ \n\nG\n\n−\n\n\n\n\n,\n\n(20)\n\nwith the components\n±\n\nG ≡\n\n\u001ah\n\ni−1\nG±\n0\n\n±\n\n−Σ\n\n\u001b−1\n\n±\n, Σ± ≡ ∆∓ G∓\n0 ∆ ,\n\n∓\n± ±\nΞ± ≡ −G∓ ∆± G±\n0 = −G0 ∆ G .\n\nHere all components depend on the 4-momentum pμ .\n9\n\n(21)\n\n\fIn the case of the mass term m = 0, i.e., both the current quark mass m0 and the chiral\ncondensate < σ > are zero, the Nambu-Gorkov quark propogator has a simple form which\ncould be derived from the energy projectors for massless particles [5] [6], while if there is\na small mass term, the quark propagator can be expanded perturbatively around m = 0,\nbut its form is very complicated [9]. In our case the quark mass term can not be treated\nperturbatively, we have to find a general way to deal with the massive quark propagator.\nFortunately, we can evaluate a simple form for the massive quark propagator by using\nthe energy projectors for massive particles. The energy projectors onto states of positive\nand negative energy for free massive particles are defined as\nγ0 (~γ * p~ + m)\n1\n),\nΛ± (~p) = (1 ±\n2\nEp\nwhere the quark energy Ep =\n\n√\n\n(22)\n\np~2 + m2 . Under the transformation of γ0 and γ5 , we can get\n\nanother two energy projectors Λ̃± ,\n1\nγ0 (~γ * p~ − m)\nΛ̃± (~p) = (1 ±\n),\n2\nEp\n\n(23)\n\nγ0 Λ± (~p)γ0 = Λ̃∓ (~p), γ5 Λ± (~p)γ5 = Λ̃± (~p).\n\n(24)\n\nwhich satisfy\n\nThe normal quark propagator elements can be re-written as\nG±\n0 =\n\nγ0 Λ̃−\nγ0 Λ̃+\n+\n,\n±\np0 + Ep\np0 − Ep∓\n\n(25)\n\nwith Ep± = Ep ± μ. The propagator has four poles, i.e.,\np0 = ±Ep− ,\n\np0 = ∓Ep+ ,\n\n(26)\n\nwhere the former two correspond to the excitation energies of particles and holes, and the\nlatter two are for antiparticles and antiholes, respectively.\nThe quark propagator including the diquark condensate's contribution can be evaluated\nas\n10\n\n\fG± = (\n\np0 − Ep±\n\np20\n\nγ Λ̃ +\n±2 0 +\n\n− E∆\n\np0 + Ep∓\np20\n\n−\n\nγ Λ̃ )(δαβ\n∓2 0 −\nE∆\n\n− δα3 δβ3 )δ ij\n\n(27)\n\nand\nΞ± = (\n2\n\n∆±\n\nΛ̃ +\n±2 +\n\np20 − E∆\n\n∆±\n∓\np20 − E∆\n\n2 Λ̃− ),\n\n(28)\n\n2\n\n±\nwith E∆\n= Ep± + ∆2 . This propagator is very similar to the massless propagator derived\n\nin [5].\nFrom the Nambu-Gorkov propagator, it is difficult to obtain the mass of the quark which\nparticipates in the diquark condensate. The four poles of the Nambu-Gorkov propagator,\ni.e.,\n−\np0 = ±E∆\n,\n\n+\n,\np0 = ∓E∆\n\n(29)\n\ncorrespond to the excitation energies of quasi-particles (quasi-holes) and quasi-antiparticle\n(quasi-antiholes) in the color breaking phase. These quasiparticles are superpositions of\nparticles and holes.\nWe plot the excitation spectrum at μ = 500MeV as a function of Ep with different values\nof ∆/μ in Fig. 1. ∆/μ = 0 (the circles) correspond to the excitation spectrum in the\nnormal phase, ∆/μ = 0.2 (the squares), 0.5 (the stars) and 1 (the triangles) correspond\nto the excitation spectrum in the color superconducting phase, the black points are for the\n−\nparticles and the white points are for the holes. (a) is for the (quasi-)particles Ep− (E∆\n) and\n−\n+\n(quasi-)holes −Ep− (−E∆\n), and (b) is for the (quasi-)antiparticles −Ep+ (−E∆\n) and (quasi+\n).\n)antiholes Ep+ (E∆\n\nIt can be easily seen from (a) that the quasi-particles and the quasi-holes mix particles\nand holes, which are called \"Bogoliubons\". In the normal phase, to excite a pair of particle\nand hole on the Fermi surface does not need energy, while in the superconducting phase,\nto excite a pair of quasi-particle and quasi-hole at least needs the energy 2∆ when Ep = μ.\nWith increasing ∆, it is found that to excite a quasi-particle needs a larger energy, and the\ndifference between the excitation energies at Ep 6= μ and that at Ep = μ becomes smaller.\n11\n\n\fFrom (b), we see that to excite an antiparticle is much more difficult, and the diquark\ncondensate has little effects on the excitation spectrum of (quasi-)antiparticles and (quasi)antiholes.\n\nB. The calculation of lnZq3\n\nFor the third quark which does not participate in the diquark condensate, from Eq. (16),\nwe have\n1\n1\n−1\n− −1\nlnZq3 = ln{Det(β[G0 ]−1 ) = ln[Det(β[G+\n0 ] )Det(β[G0 ] )].\n2\n2\n\n(30)\n\nUsing the Dirac matrix, we first perform the determinant in the Dirac space,\n−1\nDet β [G+\n= Det β [(p0 + μ)γ0 − ~γ * p~ − m]\n0]\n\n\n\n\n= Det β \n\n\n(p0 + μ) − m\n\n~σ * ~p\n\n−~σ * ~p\n\n−(p0 + μ) − m\n\n= −β 2 [(p0 + μ)2 − Ep2 ],\n\n\n\n\n,\n\n\n(31)\n\nand in the similar way, we get\n−1\nDet β [G−\n= −β 2 [(p0 − μ)2 − Ep2 ].\n0]\n\n(32)\n\nAfter performing the determinant in the Dirac space, we have\n−1\n− −1\nDet β [G+\n= β 2 [p20 − (Ep + μ)2 ] β 2 [p20 − (Ep − μ)2 ].\n0 ] Det β [G0 ]\n\n(33)\n\nConsidering the determinant in the flavor, color, spin spaces and momentum-frequency\nspace, we get the standard expression\nlnZq3 = Nf\n\nXX\nn\n\np\n~\n\n{ln(β 2 [p20 − (Ep + μ)2 ]) + ln(β 2 [p20 − (Ep − μ)2 ])},\n\nremembering that the color space for the third quark is one-dimensional.\n\n12\n\n(34)\n\n\fC. The calculation of lnZq1,2\n\nIt is more complicated to evaluate the thermodynamic potential for the quarks participating in the diquark condensate. From Eq. (15), we have\n1\nlnZq1,2 = lnDet(βG−1 ).\n2\n\n(35)\n\nFor a 2 × 2 matrix with elements A, B, C and D, we have the identity\n\n\n\nDet \n\n\n\n\nA B\n\nC D\n\n\n\n\n= Det(−CB + CAC −1 D) = Det(−BC + DC −1 AC).\n\n(36)\n\nTo prove the above equation, we have used\n\n\n\n\n\n\n\nA B\n\nC D\n\n\n\n\n\n\n\n≡\n\n\n\n\n0 B \n\nC 0\n\n\n\n\n1\nB\n\n−1\n\nC\nA\n\n−1\n\n1\n\n\n\nD\n\n\n\n\n\n\n≡\n\n\nBC\n\n−1\n\nDC\n\n−1\n\nAB\n\n−1\n\nCB\n\n−1\n\n\n\n\n\n\n\n\n0 C\n\nB 0\n\n.\n\n\n(37)\n\nReplacing A, B, C and D with the corresponding elements of G−1 , we have\n−1\n+ −1\n− −1\nDet(βG−1 ) = β 2 DetD1 = β 2 Det[−∆+ ∆− + ∆+ [G+\n0 ] [∆ ] [G0 ] ]\n−1\n− −1\n+ −1 −\n= β 2 DetD2 = β 2 Det[−∆+ ∆− + [G−\n0 ] [∆ ] [G0 ] ∆ ].\n\n(38)\n\nUsing the energy projectors Λ̃± , we can work out D1 and D2 as\nD1 = ∆2 + γ5 [γ0 (p0 − Ep− )Λ̃+ + γ0 (p0 + Ep+ )Λ̃− ]γ5 [γ0 (p0 − Ep+ )Λ̃+ + γ0 (p0 + Ep− )Λ̃− ]\n2\n\n2\n\n= −[(p20 − Ep− − ∆2 )Λ̃− + (p20 − Ep+ − ∆2 )Λ̃+ ],\nD2 = −[(p20 − (Ep− )2 − ∆2 )Λ̃+ + (p20 − (Ep+ )2 − ∆2 )Λ̃− ].\n\n(39)\n\nUsing the properties of the energy projectors, we can get\n2\n\n2\n\n−\n+\nD1 D2 = [(p20 − (Ep− )2 − ∆2 )] [(p20 − (Ep+ )2 − ∆2 )] = [p20 − E∆\n][p20 − E∆\n].\n\n(40)\n\nWith the above equations, Eq. (35) can be expressed as\n1\n1\nlnZq1,2 = ln[DetβG−1 ] = Trln[β 2 D1 β 2 D2 ]\n2\n4\n1\n2 2\n−2\n+2\n)] + Trln[β 2 (p20 − E∆\n)]}\n= {Trln[β (p0 − E∆\n4\n= 2Nf\n\nXX\nn\n\np\n\n2\n\n2\n\n−\n+\n{ln[β 2 (p20 − E∆\n)] + ln[β 2 (p20 − E∆\n)]}.\n\n13\n\n(41)\n\n\fD. The thermodynamic potential\n\nThe frequency summation of the free-energy\nlnZf =\n\nX\nn\n\nln[β 2 (p20 − Ep2 )]\n\n(42)\n\ncan always be obtained by performing the frequency summation of the propagator 1/(p20 −\nEp2 ). Differentiate Eq. (42) with respect to Ep :\nX\n∂lnZf\n1\n= β[1 − 2f ̃(Ep )],\n= −2Ep\n2\n2\n∂Ep\nn p0 − Ep\n\n(43)\n\nwhere f ̃(x) = 1/(eβx + 1) is the usual Fermi-Dirac distribution function. Then integrating\nwith respect to Ep , one can get the free-energy\nlnZf = β[Ep + 2T ln(1 + e−βEp )].\n\n(44)\n\nWith the help of the above expression, and replacing\nX\np\n\n→V\n\nZ\n\nd3 p\n,\n(2π)3\n\n(45)\n\nwe get the expressions\nlnZq3 = Nf βV\n\n+\n−\nd3 p\n[Ep+ + 2T ln(1 + e−βEp ) + Ep− + 2T ln(1 + e−βEp )],\n3\n(2π)\n\nZ\n\nlnZq1,2 = 2Nf βV\n\nZ\n\n+\n−\nd3 p\n+\n−βE∆\n−\n−βE∆\n[E\n+\n2T\nln(1\n+\ne\n)\n+\nE\n+\n2T\nln(1\n+\ne\n)].\n∆\n∆\n(2π)3\n\n(46)\n\n(47)\n\nFinally, we obtain the familiar expression of the thermodynamic potential\nΩ = −T\n\nlnZ\n∆2\nσ2\n+\n− 2Nf\n=\nV\n4GS 4GD\n\nZ\n\nd3 p\n−βEp+\n−βEp−\n[E\n+\nT\nln(1\n+\ne\n)\n+\nT\nln(1\n+\ne\n)\np\n(2π)3\n\n+\n\n+\n−\n+E∆\n+ 2T ln(1 + e−βE∆ ) + E∆\n+ 2T ln(1 + e−βE∆ )].\n−\n\n14\n\n(48)\n\n\fIV. CONDENSATES AND GAP EQUATIONS\n\nA. Condensates\n\nWith the Nambu-Gorkov quark propagator Eqs. (27) and (28), the diquark condensate\nis generally expressed as\nC\n\n< q̄ γ5 q >= (iT\n\nd3 p\ntr[Ξ− γ5 ].\n(2π)3\n\nX Z\n\n)\n\nn\n\n(49)\n\nFrom general consideration, there should be eight scalar diquark condensates [5] [7]. In the\ncase of the NJL type model, the diquark condensates related to momentum vanish, and there\nis only one independent 0+ diquark gap with Dirac structure Γ = γ5 for massless quark, and\nthere exists another 0+ diquark condensate with Dirac structure Γ = γ0 γ5 at nonzero quark\nmass. In our paper, we assume the contribution of the diquark condensate with Γ = γ0 γ5 is\nsmall, and only consider the diquark condensate with Γ = γ5 .\nPerforming the Matsubara frequency summation and taking the limit T → 0, we get the\ndiquark condensate at finite chemical potential\n< q̄ C γ5 q >= −2∆Nc Nf\n\nZ\n\n1\n1\nd3\n[ −+\n+ ].\n3\n(2π) 2E∆ 2E∆\n\n(50)\n\nFor the third quark, its chiral condensate can be evaluated by using the quark propagator\nin the normal phase,\n3\n\n< q̄3 q >= −iT\n\nXZ\nn\n\nd3 p\ntr[G+\n0 ],\n(2π)3\n\n(51)\n\nwhile for the quarks participating in the diquark condensate, the chiral condensate should\nbe evaluated by using the quark propagator in the color breaking phase,\n1\n\n< q̄1 q >= −iT\n\nXZ\nn\n\nd3 p\ntr[G+ ].\n3\n(2π)\n\n(52)\n\nWe have no explicit mass expression for the first two quarks which participate in the\ndiquark condensate, the influence of diquark condensate has been reflected in the quark\npropagator. The difference between the first two quarks which participate in the diquark\n15\n\n\fcondensate and the third quark which does not participate in the diquark condensate can\nbe read from their chiral condensates and can be defined as\nδ =< q̄1 q1 >1/3 − < q̄3 q3 >1/3 ,\n\n(53)\n\nwhere δ has the dimension of energy. In the case of chiral limit, the quark mass m decreases\nto zero in the color superconducting phase, and the influence of the diquark condensate on\nquarks in different colors vanishes.\nAfter performing the Matsubara frequency summation and taking the limit T → 0, we\nget the expressions of the condensates at μ 6= 0,\nd3 p 1\n[θ(μ − Ep ) − 1],\n(2π)3 2Ep\nZ\nd3 p 1\n1\n< q̄1 q > = 4mNf\n[n+ − n−\np ],\n(2π)3 2Ep p\n3\n\n< q̄3 q > = 4mNf\n\nZ\n\n(54)\n\nwhere\nEp∓\n1\n=\n(1\n∓\nn±\np\n∓)\n2\nE∆\n\n(55)\n\nare the occupation numbers for quasi-particles and quasi-antiparticles at T = 0. Correspondingly, 1 − n±\np are the occupation numbers of quasi-holes and quasi-antiholes, respectively.\n+\nWe plot the occupation numbers for (quasi-)particles n+\np and (quasi-)holes 1 − np in Fig.\n−\n2 (a), and the occupation numbers for (quasi-)antiparticles n−\np and (quasi-)antiholes 1 − np\n\nin (b) as a function of Ep with respect to ∆/μ = 0 (circles), 0.2 (squares), 0.5 (stars) and 1\n(triangles); the black and white points correspond to particles and holes, respectively.\nIt is seen that the Fermi surface is very sharp in the normal phase ∆/μ = 0, and becomes\nsmooth when diquark condensate appears. The smearing is a consequence of the fact that\nthe \"Bogliubons\" are superpositions of particle and hole states. The smearing of the Fermi\nsurface induces the chiral symmetry restoring at a smaller chemical potential. The larger\nthe diquark condensate is, the smoother the Fermi surface will be.\nFrom Fig. 2(b), it can be seen that the occupation numbers for the (quasi-)antiparticles\n(antiholes) in the normal phase or color breaking phase are not sensitive to the magnitude\nof the diquark condensate.\n16\n\n\fB. Gap equations\n\nThe two gap equations m and ∆ can be derived by minimizing the thermodynamic\npotential Eq. (48) with respect to m and ∆,\n∂Ω\n∂Ω\n=\n= 0.\n∂m\n∂∆\n\n(56)\n\nTaking into account the general expressions for the diquark condensate and chiral condensates, one can get the relations between the chiral gap m and the chiral condensate < q̄q >,\ni.e.,\nm = m0 + σ,\nσ = −2GS < q̄q >,\n\n(57)\n\nhere the chiral condensate should perform summation in the color space\n< q̄q >= 2 < q̄1 q 1 > + < q̄3 q 3 >;\n\n(58)\n\nand the relation between the diquark gap ∆ and the diquark condensate < q̄ C γ5 q >, i.e.,\n∆ = −2GD < q̄ C γ5 q >,\n\n(59)\n\nsubstituting Eq. (50) into the above equation, the gap equation for the diquark condensate\nEq. (59) in the limit of T → 0 can be written as\n1 = 4Nc Nf GD\n\nZ\n\n1\n1\nd3 p\n+\n[\n−\n+ ].\n(2π)3 2E∆ 2E∆\n\n(60)\n\nV. NUMERICAL RESULTS\n\nIn this section, through numerical calculations, we will investigate the phase structure\nalong the chemical potential direction, analyze the competition mechanism between the\nchiral condensate and diquark condensate, and discuss the influence of the color breaking\non the quarks in different colors.\n17\n\n\fBefore the numerical calculations, we should fix the model parameters. The current\nquark mass m0 = 5.5MeV, the Fermion momentum cut-off Λf = 0.637GeV, and the coupling\nconstant in color singlet channel GS = 5.32GeV−2 are determined by fitting pion properties.\nThe corresponding constituent quark mass in the vacuum is taken to be m(μ = 0) =\n330MeV. The coupling constant in the color anti-triplet channel GD can in principle be\ndetermined by fitting the nucleon properties. In [26] GD /GS ≃ 2.26/3 was chosen by fitting\nthe scalar diquark mass of ≃ 600MeV to obtain a realistic baryon mass in the order of\n≃ 900MeV. In our case, to investigate the influence of diquark condensate on the chiral\nphase transition, we will set GD /GS = 0, 2/3, 1, 1.2, 1.5, respectively.\n\nA. Phase structure at zero temperature\n\nFirst, we investigate the phase structure along the chemical potential direction with\nrespect to different magnitude of GD /GS . In the explicit chiral symmetry breaking case, we\ndefine the point at which the chiral condensate has maximum change as the critical chemical\npotential μχ for the chiral phase transition, and the point at which the diquark condensate\nstarts to appear as the critical chemical potential μ∆ for the color superconductivity phase\ntransition.\nThe two gaps m (white points) and ∆ (black points) determined by Eqs. (57) and (59)\nare plotted in Fig. 3 as functions of μ with respect to different GD /GS = 2/3, 1, 1.2, 1.5\nin (a), (b), (c) and (d), respectively. In Fig. 4, they are plotted as functions of the scaled\nbaryon density nb /n0 , where n0 is the normal nuclear matter density.\nIn Fig. 3 (a), i.e., in the case of GD /GS = 2/3, we see that in the region where the\nconstituent quark mass keeps its value in the vacuum m(μ = 0), the diquark condensate\nkeeps zero. The chiral phase transition and the color superconductivity phase transition\nnearly occur at the same chemical potential μχ ≃ μ∆ = 340MeV. The two phase transitions\nare of first order. In the explicit chiral symmetry breaking case, there is a small chiral\ncondensate in the color superconductivity phase μ > μχ . This phenomena has been called\n18\n\n\fthe coexistence of chiral and diquark condensate in [10] [11]. In this coexistence region, the\nchiral condensate is small and can be described by the Andersom theorem [15].\nIn (b), with GD /GS = 1, the diquark condensate starts to appear at μ∆ = 298MeV, then\nchiral symmetry restores at μχ = 304.8MeV. Both μ∆ and μχ are smaller than those in the\ncase of GD /GS = 2/3. In the region from μ∆ to μχ , both chiral and color symmetries are\nbroken, which is called the mixed broken phase. The diquark gap increases continuously\nfrom zero to 82MeV in this mixed broken phase, and jumps up to 152MeV at the critical\npoint μχ . The chiral symmetry phase transition is still of the first order, and the jump of\nthe diquark gap can be regarded as the influence of the first order chiral phase transition.\nIn (c) and (d), we see that with increasing of GD /GS , the diquark condensate starts to\nappear at smaller μ∆ , and chiral symmetry restores at smaller μχ , while the width of the\nregion of mixed broken phase, μχ −μ∆ , becomes larger. This phenomena has also been found\nin Ref. [14] in the random matrix model. It is also seen that with increasing of GD /GS , the\nfirst order phase transition of chiral symmetry restoration becomes the second order one,\nwhere the critical point μχ is still defined by the maximum change of quark mass m.\nWe summarize the phase structure along the chemical potential direction: 1) when μ <\nμ∆ , chiral symmetry is broken; 2) in the region from μ∆ to μχ , both chiral and color\nsymmetries are broken, and 3) when μ > μχ , chiral symmetry restores partially and the\nphase is dominated by color superconductivity. The phase transition from chiral broken\nphase to the mixed broken phase is of second order, and the phase transition from the\nmixed broken phase to color superconductivity phase is of first order for small GD /GS , and\nof second order for large GD /GS . The phase structure depends on the magnitude of GD /GS .\nIf GD /GS is very small, the diquark condensate will never appear; If GD /GS < 1 but not\ntoo small, there will be no mixed broken phase, the chiral phase transition and the color\nsuperconductivity phase transition occur at the same critical point μχ = μ∆ , and the two\nphase transitions are of first order like in [10].\n\n19\n\n\fB. The Competition between the chiral and diquark condensate\n\nWith increasing of GD /GS , the diquark condensate starts to appear at smaller μ∆ and\nchiral symmetry restores at smaller μχ , while the width of the mixed broken phase, μχ − μ∆ ,\nincreases.\nIn order to understand the competition mechanism and explicitly show how the diquark\ncondensate influences the chiral phase transition, we plot the constituent quark mass m and\nthe diquark gap ∆ as functions of μ for different values of GD /GS in Fig. 5.\nIn the case of GD /GS = 0, only chiral phase transition occurs, the thermal system in the\nmean-field approximation is nearly a free Fermi gas made of constituent quarks. In the limit\nof T = 0, there is a very sharp Fermi surface of the constituent quark. When the chemical\npotential is larger than the constituent quark mass in the vacuum, the chiral symmetry\nrestores, and the system of constituent quarks becomes a system of current quarks. When\na diquark gap ∆ forms in the case of GD /GS 6= 0, it will smooth the sharp Fermi surface of\nthe constituent quark. In other words, the diquark pair lowers the sharp Fermi surface, and\ninduces a smaller critical chemical potential of chiral restoration.\nIn TABLE I, we list the chemical potentials μ∆ , at which the diquark gap starts appearing, and μχ , at which the chiral symmetry restores, for different values of GD /GS .\nμ0F = 345.3MeV is the critical chemical potential in the case of GD /GS = 0. ∆χ is the value\nof diquark gap at μχ , if there is a jump, it is the lower value.\nWe see that for larger GD /GS , the diquark condensate appears at a smaller chemical\npotential μ∆ , and the chiral phase transition occurs at a smaller critical chemical potential\nμχ , the gap of the diquark condensate ∆χ at μχ becomes larger, and the region of mixed\nbroken phase becomes wider.\nWe assume the relation between ∆χ and μχ as\nμχ = μ0F − x∆χ ,\nand the relation between ∆χ and μ∆ as\n20\n\n(61)\n\n\fμ∆ = μ0F − y∆χ .\n\n(62)\n\nIn TABEL I, we listed the values of x = (μ0F − μχ )/∆χ and y = (μ0F − μ∆ )/∆χ for\ndifferent GD /GS . It is found that x is almost GD /GS independent and equal to 1/2. As for\ny, it is larger than 1/2 and increases with increasing of GD /GS . From the Eqs. (61) and\n(62), we have the relation\nμχ − μ∆ = (y − 1/2)∆χ\n\n(63)\n\nfor the mixed broken phase. With increasing of GD /GS , y and ∆χ increase, and then the\nwidth of the mixed broken phase, μχ − μ∆ , becomes larger.\nNow we turn to study how the chiral gap influences the color superconductivity phase\ntransition. Firstly, we change the constituent quark mass in the vacuum from 330MeV to\n486MeV. To fit the pion properties, the coupling constant in the quark-antiquark channel\nis correspondingly increased from GS to 1.2GS . We plot the diquark gap as a function of μ\nin Fig. 6a for the two vacuum masses and for GD /GS = 2/3, 1, 1.2, 1.5. We find that for the\nsame GD /GS , the diquark gap starts to appear at much larger chemical potential μ∆ when\nthe vacuum mass increases from 330MeV to 486MeV.\nThen we withdraw the quark mass, i.e., taking m = 0 even in the vacuum. We plot\nthe diquark gap as a function of μ in Fig. 6 b for m(μ = 0) = 0 and 330MeV and for\nGD /GS = 2/3, 1, 1.2, 1.5. We find that for any GD /GS , the diquark condensate starts\nto appear at a much smaller chemical potential μ∆ for m(μ = 0) = 0 compared with\nm(μ = 0) = 330MeV.\nFrom Fig. 6 a and b, we can see that quark's vacuum mass only changes the critical point\nof color superconductivity μ∆ , the diquark gaps for different quark's vacuum mass coincide in\nthe overlap region of color superconductivity phase, where chiral symmetry restores partially.\nFrom the influcence of the diquark gap on the chiral phase transition and the influence\nof the chiral gap on the color superconductivity phase transition, it is found that there does\nexist a strong competition between the two phases. The competition starts at μ∆ and ends\nat μχ . We call the mixed broken phase as the competition region, which becomes wider with\n21\n\n\fincreasing of GD /GS . This competition region is the result of the diquark gap smoothing\nthe sharp Fermi surface of the constituent quark. If the attractive interaction in the diquark\nchannel is too small, there will be no diquark pairs, the system will be in the chiral breaking\nphase before μχ , and in the chiral symmetry restoration phase after μχ . If the attractive\ninteraction in the diquark channel is strong enough, diquark pairs can be formed and smooth\nthe sharp Fermi surface, and induce a smaller critical chemical potential of chiral symmetry\nrestoration.\n\nC. The influence of color breaking on quarks' properties\n\nFinally, we study how the diquark condensate influences the quark properties.\nIn the normal phase, the quarks in different colors are degenerate. However, in the color\nbreaking phase, the first two quarks are involved in the diquark condensate, while the third\none is not.\nThe quark mass m appeared in the formulae of this paper is the mass for the third\nquark which does not participate in the diquark condensate. We have seen from Fig. 5 (a)\nthat the diquark condensate influences much the quark mass m in the competition region\nμ∆ < μ < μχ . In the color breaking phase, i.e., when μ > μ∆ , the quark mass m in\ndifferent cases of GD decreases slowly with increasing μ, and reaches the same value at\nabout μ = 500MeV.\nThe difference of the chiral condensates for quarks in different colors δ defined in Eq.\n(53) is shown in Fig. 7 as a function of the chemical potential μ with respect to GD /GS =\n2/3, 1, 1.2, 1.5. It is found that in any case δ is zero before μ∆ , then begins to increase at\nμ∆ and reaches its maximum at μχ , and starts to decrease after μ > μχ , and approaches to\nzero at about μ = 500MeV, when μ > 500MeV, δ becomes negative. With increasing GD ,\nδ(μχ ) increases from 1MeV for GD /GS = 2/3 to 13MeV for GD /GS = 1.5. Comparing with\nthe magnitude of the diquark condensate, δ is relatively small in the color superconductivity\nphase.\n22\n\n\fVI. CONCLUSIONS\n\nIn summary, in an extended NJL model and considering only the attractive interactions\nin the 0+ color singlet quark anti-quark channel and color anti-triplet diquark channel,\nthe Nambu-Gorkov form of the quark propogator has been evaluated with a dynamical\nquark mass. The Nambu-Gorkov massive propagator makes it possible to extend the Greenfunction approach to the moderate baryon density region, and the familiar expression of the\nthermodynamic potential has been re-evaluated by using the massive quark propagator. In\nthis paper, we have neglected another scalar diquark condensate with Dirac structure γ0 γ5 ,\nwhich is assumed to be small.\nThe phase structure along the chemical potential direction has been investigated. The\nsystem is in the chiral breaking phasei before μ∆ , in the color superconducting phase after μχ ,\nand the two phases compete with each other in the mixed broken phase with width μχ − μ∆ .\nThe width depends on the magnitude of GD /GS . If GD /GS is small, the width is zero, and\nthe chiral phase transition and the color superconductivity phase transition occur at the\nsame chemical potential. The width increases with increasing of GD /GS . The competition\nmechanism has been analyzed by investigating the influence of the diquark condensate on\nthe sharp Fermi surface. The diquark condensate smoothes the sharp Fermi surface, and\ninduces the chiral phase transition occuring at a smaller chemical potential, and the diquark\ncan be formed more easily. The phase transition is of second order from the chiral symmetry\nbroken phase to the mixed broken phase, and the phase transition from the mixed broken\nphase to the partial chiral symmetry phase, i.e., the color superconductivity phase is of first\norder for small GD /GS , and is of second order for large GD /GS .\nThe influence of the diquark condensate on the properties of quarks in different colors\nhas also been investigated. It is found that the difference of the chiral condensates between\nquarks in different colors induced by the diquark condensate is very small.\n\n23\n\n\fACKNOWLEDGEMENTS\n\nOne of the authors (M.H.) thanks valuable discussions with Dr. Qishu Yan. This work\nwas supported in part by China Postdoctoral Science Foundation, the NSFC under Grant\nNos. 10105005, 10135030 and 19925519, and the Major State Basic Research Development\nProgram under Contract No. G2000077407.\n\n24\n\n\f[1] M.Alford, K. Rajagopal and F. Wilczek, Phys.Lett.B 422,247(1998)[hep-ph/9711395].\n[2] R.Rapp,\n\nT.Schäfer,E.V.Shuryak\n\nand\n\nM.Velkovsky,\n\nPhys.Rev.Lett.81,53(1998)\n\n[hep-ph/9711396].\n[3] D.Bailin and A.Love, Phys. Rep. 107, 325(1984).\n[4] K.Rajagopal and F.Wilczek, hep-ph/0011333.\n[5] R.D.Pisarsiki, D.H.Rischke, Phys.Rev.D 60(1999) 094013, [nucl-th/9903023].\n[6] R.D.Pisarsiki, D.H.Rischke, Phys.Rev.D 61(2000) 074017, [nucl-th/9910056].\n[7] R.D.Pisarsiki, D.H.Rischke, Phys.Rev.Lett.83(1999) 37, [nucl-th/9811104].\n[8] T.Schäfer, hep-ph/0109052.\n[9] M.Rho, E.Shuryak, A.Wirzba, I.Zahed, Nucl.Phys.A 676,273 (2000) (hep-ph/0001104).\n[10] J.Berges and K. Rajagopal, Nucl.Phys.B 538,215(1999) [hep-ph/9804233].\n[11] J.Berges, Nucl.Phys.A642(1998) 51.\n[12] T.M.Schwarz,S.P.Klevansky and G.Papp, Phys.Rev.C60 (1999) 055205.\n[13] G.W.Carter and D.Diakonov, Phys.Rev.D60(1999) 016004.\n[14] B.Vanderheyden and A.D.Jackson, Phys.Rev.D62 (2000) 094010.\n[15] B.O.Kerbikov, hep-ph/0106324.\n[16] R.Rapp, T.Schafer, E.V.Shuryak and M. Velkovsky, Ann.Phys.280, 35(2000), [hepph/9904353].\n[17] K.Langfeld and M.Rho, Nucl.Phys.A660, 475(1999), [hep-ph/9811227].\n[18] R.Nebauer, F.Gastineau and J.Aichelin, hep-ph/0101289.\n\n25\n\n\f[19] M.Buballa, J. Hosěk and M.oertel, hep-ph/0105079.\n[20] M.Buballa, M.oertel, hep-ph/0109095.\n[21] D.Ebert, K.G. Klimenko, H.Toki, Phys.Rev.D64, 014038(2001), [hep-ph/0011273].\n[22] D.Ebert, K.G. Klimenko, H.Toki and V.ch.Zhukovsky, hep-th/0106049.\n[23] D.Ebert, V.V.Khudyakov, V.ch.Zhukovsky and K.G. Klimenko,hep-ph/0106110.\n[24] Y.Nambu and G.Jona-Lasinio, Phys.Rev. 122,345(1961); 124,246(1961).\n[25] H.Reinhardt, Phys.Lett.B 244, 316(1990).\n[26] D.Ebert, L.Kaschluhn and G.Kastelewicz, Phys.Lett.B264,420 (1991).\n[27] D.Ebert, Yu.L.Kalinovsky,L.Münchow and M.K.Volkov, Int.J.Mod.Phys.A 8, 1295 (1993).\n[28] U.Vogl, Z.Phys.A337,191(1990).\n[29] R.T.Cahill, J.Praschifka and C.J.Burden, Aust.J.Phys. 42, 161 (1989).\n[30] J.Kapusta, \"Finite-temperature Field Theory\", Cambridge University Press, 1989.\n[31] M. L. Bellac, \"Thermal Field Theory\", Cambridge University Press, 1996.\n\n26\n\n\fFIG. 1. The excitation spectrum at μ = 500MeV for (quasi-)particles and (quasi-)holes in (a)\nand for (quasi-)antiparticles and (quasi-)antiholes in (b) as a function of Ep with different values\nof ∆/μ, ∆/μ = 0 (circles), 0.2 (squares), 0.5 (stars) and 1 (triangles). The black and white points\nare for the particles and holes, respectively.\n\n27\n\n\f+\nFIG. 2. The occupation numbers for (quasi-)particles n+\np and (quasi-)holes 1 − np in (a), and\n−\nfor (quasi-)antiparticles n−\np and (quasi-)antiholes 1 − np in (b) as a function of Ep with respect\n\nto ∆/μ = 0 (circles), 0.2 (squares), 0.5 (stars) and 1 (triangles). The black and white points\ncorrespond to particles and holes, respectively.\n\n28\n\n\fFIG. 3. The two gaps m (white points) and ∆ (black points) as functions of chemical potential\nμ for GD /GS = 0, 2/3, 1, 1.2, 1.5, respectively.\n\n29\n\n\fFIG. 4. The two gaps m (white points) and ∆ (black points) as functions of the scaled baryon\ndensity nb /n0 for GD /GS = 0, 2/3, 1, 1.2, 1.5, respectively.\n\n30\n\n\fFIG. 5. The gaps m in (a) and ∆ in (b) as a function of the chemical potential μ with respect\nto GD /GS = 0, 2/3, 1, 1.2, 1.5, respectively.\n\n31\n\n\fFIG. 6. The influcence of chiral gap on the color superconductivity phase transition in the case\nof m(μ = 0) = 486MeV in (a) and m(μ = 0) = 0 in (b).\n\n32\n\n\fFIG. 7. The difference of the chiral condensates for quarks in different colors δ as a function of\nthe chemical potential μ with respect to GD /GS = 0, 2/3, 1, 1.2, 1.5, respectively.\n\n33\n\n\fGD /GS\n\nμ∆ (MeV)\n\nμχ (MeV)\n\nμχ − μ∆ (MeV)\n\n∆χ (MeV)\n\n(μ0F − μχ )/∆χ\n\n(μ0F − μ∆ )/∆χ\n\n1\n\n298\n\n304.8\n\n6\n\n82\n\n0.49\n\n0.57\n\n1.2\n\n242\n\n266\n\n24\n\n162\n\n0.49\n\n0.64\n\n1.5\n\n70\n\n190\n\n120\n\n310\n\n0.50\n\n0.89\n\nTABLE I. The GD dependence of chemical potentials μ∆ and μχ , μ0F = 345.3MeV.\n\n34\n\n\f"}