{"id": "http://arxiv.org/abs/hep-ph/0208037v3", "guidislink": true, "updated": "2002-08-16T06:46:59Z", "updated_parsed": [2002, 8, 16, 6, 46, 59, 4, 228, 0], "published": "2002-08-05T09:28:54Z", "published_parsed": [2002, 8, 5, 9, 28, 54, 0, 217, 0], "title": "Andreev reflection in superconducting QCD", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0208140%2Chep-ph%2F0208163%2Chep-ph%2F0208222%2Chep-ph%2F0208252%2Chep-ph%2F0208234%2Chep-ph%2F0208196%2Chep-ph%2F0208246%2Chep-ph%2F0208150%2Chep-ph%2F0208156%2Chep-ph%2F0208147%2Chep-ph%2F0208106%2Chep-ph%2F0208264%2Chep-ph%2F0208034%2Chep-ph%2F0208011%2Chep-ph%2F0208274%2Chep-ph%2F0208152%2Chep-ph%2F0208151%2Chep-ph%2F0208051%2Chep-ph%2F0208029%2Chep-ph%2F0208155%2Chep-ph%2F0208240%2Chep-ph%2F0208266%2Chep-ph%2F0208176%2Chep-ph%2F0208089%2Chep-ph%2F0208074%2Chep-ph%2F0208073%2Chep-ph%2F0208170%2Chep-ph%2F0208250%2Chep-ph%2F0208236%2Chep-ph%2F0208260%2Chep-ph%2F0208255%2Chep-ph%2F0208227%2Chep-ph%2F0208136%2Chep-ph%2F0208100%2Chep-ph%2F0208112%2Chep-ph%2F0208042%2Chep-ph%2F0208208%2Chep-ph%2F0208205%2Chep-ph%2F0208267%2Chep-ph%2F0208272%2Chep-ph%2F0208059%2Chep-ph%2F0208278%2Chep-ph%2F0208219%2Chep-ph%2F0208263%2Chep-ph%2F0208254%2Chep-ph%2F0208081%2Chep-ph%2F0208110%2Chep-ph%2F0208175%2Chep-ph%2F0208085%2Chep-ph%2F0208209%2Chep-ph%2F0208202%2Chep-ph%2F0208201%2Chep-ph%2F0208145%2Chep-ph%2F0208277%2Chep-ph%2F0208164%2Chep-ph%2F0208010%2Chep-ph%2F0208166%2Chep-ph%2F0208033%2Chep-ph%2F0208184%2Chep-ph%2F0208167%2Chep-ph%2F0208162%2Chep-ph%2F0208046%2Chep-ph%2F0208123%2Chep-ph%2F0208178%2Chep-ph%2F0208195%2Chep-ph%2F0208131%2Chep-ph%2F0208276%2Chep-ph%2F0208223%2Chep-ph%2F0208191%2Chep-ph%2F0208215%2Chep-ph%2F0208235%2Chep-ph%2F0208016%2Chep-ph%2F0208200%2Chep-ph%2F0208023%2Chep-ph%2F0208249%2Chep-ph%2F0208248%2Chep-ph%2F0208082%2Chep-ph%2F0208086%2Chep-ph%2F0208226%2Chep-ph%2F0208169%2Chep-ph%2F0208056%2Chep-ph%2F0208004%2Chep-ph%2F0208036%2Chep-ph%2F0208102%2Chep-ph%2F0208198%2Chep-ph%2F0208125%2Chep-ph%2F0208079%2Chep-ph%2F0208221%2Chep-ph%2F0208015%2Chep-ph%2F0208139%2Chep-ph%2F0208037%2Chep-ph%2F0208128%2Chep-ph%2F0208006%2Chep-ph%2F0208060%2Chep-ph%2F0208030%2Chep-ph%2F0208109%2Chep-ph%2F0208265%2Chep-ph%2F0208054%2Chep-ph%2F0208096%2Chep-ph%2F0208022%2Chep-ph%2F0208189&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Andreev reflection in superconducting QCD"}, "summary": "In this paper we discuss the phenomenon of the Andreev reflection of quarks\nat the interface between the 2SC and the Color-Flavor-Locked (CFL)\nsuperconductors appeared in QCD at asymptotically high densities. We also give\nthe general introduction to the Andreev reflection in the condensed matter\nsystems as well as the review of this subject in high density QCD.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0208140%2Chep-ph%2F0208163%2Chep-ph%2F0208222%2Chep-ph%2F0208252%2Chep-ph%2F0208234%2Chep-ph%2F0208196%2Chep-ph%2F0208246%2Chep-ph%2F0208150%2Chep-ph%2F0208156%2Chep-ph%2F0208147%2Chep-ph%2F0208106%2Chep-ph%2F0208264%2Chep-ph%2F0208034%2Chep-ph%2F0208011%2Chep-ph%2F0208274%2Chep-ph%2F0208152%2Chep-ph%2F0208151%2Chep-ph%2F0208051%2Chep-ph%2F0208029%2Chep-ph%2F0208155%2Chep-ph%2F0208240%2Chep-ph%2F0208266%2Chep-ph%2F0208176%2Chep-ph%2F0208089%2Chep-ph%2F0208074%2Chep-ph%2F0208073%2Chep-ph%2F0208170%2Chep-ph%2F0208250%2Chep-ph%2F0208236%2Chep-ph%2F0208260%2Chep-ph%2F0208255%2Chep-ph%2F0208227%2Chep-ph%2F0208136%2Chep-ph%2F0208100%2Chep-ph%2F0208112%2Chep-ph%2F0208042%2Chep-ph%2F0208208%2Chep-ph%2F0208205%2Chep-ph%2F0208267%2Chep-ph%2F0208272%2Chep-ph%2F0208059%2Chep-ph%2F0208278%2Chep-ph%2F0208219%2Chep-ph%2F0208263%2Chep-ph%2F0208254%2Chep-ph%2F0208081%2Chep-ph%2F0208110%2Chep-ph%2F0208175%2Chep-ph%2F0208085%2Chep-ph%2F0208209%2Chep-ph%2F0208202%2Chep-ph%2F0208201%2Chep-ph%2F0208145%2Chep-ph%2F0208277%2Chep-ph%2F0208164%2Chep-ph%2F0208010%2Chep-ph%2F0208166%2Chep-ph%2F0208033%2Chep-ph%2F0208184%2Chep-ph%2F0208167%2Chep-ph%2F0208162%2Chep-ph%2F0208046%2Chep-ph%2F0208123%2Chep-ph%2F0208178%2Chep-ph%2F0208195%2Chep-ph%2F0208131%2Chep-ph%2F0208276%2Chep-ph%2F0208223%2Chep-ph%2F0208191%2Chep-ph%2F0208215%2Chep-ph%2F0208235%2Chep-ph%2F0208016%2Chep-ph%2F0208200%2Chep-ph%2F0208023%2Chep-ph%2F0208249%2Chep-ph%2F0208248%2Chep-ph%2F0208082%2Chep-ph%2F0208086%2Chep-ph%2F0208226%2Chep-ph%2F0208169%2Chep-ph%2F0208056%2Chep-ph%2F0208004%2Chep-ph%2F0208036%2Chep-ph%2F0208102%2Chep-ph%2F0208198%2Chep-ph%2F0208125%2Chep-ph%2F0208079%2Chep-ph%2F0208221%2Chep-ph%2F0208015%2Chep-ph%2F0208139%2Chep-ph%2F0208037%2Chep-ph%2F0208128%2Chep-ph%2F0208006%2Chep-ph%2F0208060%2Chep-ph%2F0208030%2Chep-ph%2F0208109%2Chep-ph%2F0208265%2Chep-ph%2F0208054%2Chep-ph%2F0208096%2Chep-ph%2F0208022%2Chep-ph%2F0208189&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In this paper we discuss the phenomenon of the Andreev reflection of quarks\nat the interface between the 2SC and the Color-Flavor-Locked (CFL)\nsuperconductors appeared in QCD at asymptotically high densities. We also give\nthe general introduction to the Andreev reflection in the condensed matter\nsystems as well as the review of this subject in high density QCD."}, "authors": ["Mariusz Sadzikowski", "Motoi Tachibana"], "author_detail": {"name": "Motoi Tachibana"}, "author": "Motoi Tachibana", "arxiv_comment": "14 pages, 1 figure", "links": [{"href": "http://arxiv.org/abs/hep-ph/0208037v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-ph/0208037v3", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-ph/0208037v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-ph/0208037v3", "journal_reference": "Acta Phys.Polon. B33 (2002) 4141-4164", "doi": null, "fulltext": "Andreev reflection in superconducting QCD\nMariusz Sadzikowski1,2 and Motoi Tachibana3\n1) Center of Theoretical Physics, Massachusetts Institute of Technology, Cambridge, MA 02139, USA\n2) Institute of Nuclear Physics, Radzikowskiego 152, 31-342 Kraków, Poland\n3) Theoretical Physics Laboratory, RIKEN, 2-1 Hirosawa, Wako, Saitama 351-0198, Japan\n\narXiv:hep-ph/0208037v3 16 Aug 2002\n\nMIT-CTP-3289\nIn this paper we discuss the phenomenon of the Andreev reflection of quarks at the interface\nbetween the 2SC and the Color-Flavor-Locked (CFL) superconductors appeared in QCD at asymptotically high densities. We also give the general introduction to the Andreev reflection in the\ncondensed matter systems as well as the review of this subject in high density QCD.\n\nI. INTRODUCTION\n\nQuantum Chromodynamics is a non-abelian quantum field theory describing interactions between quarks and\ngluons. It describes the effect of confinement at low energy [1] and asymptotic freedom at high energy [2] compared to\nthe QCD scale ΛQCD ∼ 200 MeV. The only known systematic approach to low energy QCD are lattice calculations.\nThe physics of the high energy QCD can be controled by the perturbation analysis in strong coupling constant. There\nare three different types of phenomena of strong interactions which one can hope to describe in the perturbative\nregime: high energy scattering processes, high temperature and high baryon\ndensity systems. The energy scale for\np\nthese phonomena are set by: the value of the four-momentum transfer Q2 exchanged in the process, the value of\ntemperature T and the value of the Fermi energy EF (or quark chemical potential μ) respectively. The high energy\nscattering processes were already well tested in deep inelastic scattering of leptons on protons or electron-positon\nannihilation (DESY, CERN). The samples of the matter at high temperature (T ∼ 200 − 300 MeV) and low baryon\ndensity one can hope to achieve in high energy ions colliders (RHIC). However lattice calculations show that the\nexpected temperatures are too low by the factor of 3-4 for the application of the perturbative QCD. Then one has to\nrely on the non-perturbative analysis: lattice calculations, universal features of phase transitions or models. Finally\nthe high baryon density quark matter at low temperatures is expected to exist in the cores of the compact stars [3].\nUnfortunately, here also the densities are not high enough for direct perturbative calculations (by many orders of\nmagnitude). Then the only possible approches are based on universal features of the phase transitions and models.\nThe lattice approach fails at non-zero density physics because of the sign problem.\nIn this paper we focus on the high baryon density phases at T = 0. Since long ago one expected supeconducting\nphenomena in this kinematical region [4]. However only recently there have been a new interest in the subject because\nnew features were found in the theory [5–7]. If the energy scale is set by the quark chemical potential μ one can\nexpect that at high enough densities there are a gas of free quarks and gluons. However the interaction between quarks\nmediated by the one-gluon exchange is attractive in the color 3̄ channel. This leads to the well known phenomenon of\nthe Cooper instability of the Fermi sea and finally results in the creation of a new vacuum - the condensate of Cooper\npairs. This is the version of the BCS theory of superconductivity [8] applied to the interacting quark matter. The\npicture is generally correct, however somehow oversimplified. There are subtle but important differences between BCS\ntheory and superconductivity in QCD which follow from the non-abelian character of the interation in quark-quark\nscattering (eg. [7]). The review of the whole subject can be found in [9]. Despite of some differences the high density\nQCD shares a lot of features with condensed matter systems. Indeed at high density the relativistic quantum field\ntheory effects are suppressed and one can apply just non-relativistic field theory or relativistic quantm mechanics to\nstudy interesting phenomena.\nOur subject of interest are scattering processes at the interfaces between different types of QCD phases. These\nare the analogs of the Andreev reflection [10] in condensed matter systems. This reflection apperas at the junction\nbetween conductors and superconductors. In the case of dense QCD the role of conductor is played by the free Fermi\ngas of quarks and superconductor is 2SC or CFL phase of QCD. In this paper we consider the interface between 2SC\nand CFL phase. We shall show that this interface is the most general in a sense that it already contains the other\ncases: free quarks/2SC [11] and more: 2SC/2SC' and one only peculiar to 2SC/CFL. The case of free quarks/CFL\ninterface [12] has to be considered independently.\nThe interest in the dynamics of the matter flow through the phase boundaries is of importance because such\ninterfaces can be present in the protoneutron stars. Indeed in the final stage of neutron star cooling one expects that\nthe star can go through the all possible phase transitions [13] including 2SC/CFL case. This last transition is expected\n\n1\n\n\fto be the first order [14] thus one expects the existence of the mixed phase: CFL-bubbles in the 2SC medium as well\nas 2SC-bubbles in the CFL medium. In such the conditions the Andreev reflection is frequent phenomena and should\nbe taken into account in the calculations of detail processes of the protoneutron star evolution.\nIn the sections 2 and 3 we provide the general introduction to superconductivity and Andreev reflection in condensed\nmatter systems. Section four contains short description of 2SC and CFL phases, whereas in Section five we describe\nthe Andreev reflection in QCD. There are also three Appendices which gives more detailed calculations.\n\nII. CONDUCTORS AND SUPERCONDUCTORS\n\nLet us start with the simple effective hamiltonian describing superconducting state of the system at zero temperature:\n\n\n\u0013\n\u0012\nZ\n2\nX\n∇\nH = d3 x \n− EF ψα (t, ~r) + ∆(~r)ψ↑† (t, ~r)ψ↓† (t, ~r) + ∆∗ (~r)ψ↓ (t, ~r)ψ↑ (t, ~r) .\n(1)\nψα† (t, ~r) −\n2m\nα=↑,↓\n\nThe fermi field operator ψα (t, ~r) (ψα† (t, ~r)) describes the annihilation (creation) of the particle of mass m and spin\nα at the point ~r and the time t. The particles also carry charge however in our simple example we do not consider\nthe electromagnetic fields thus this feature is unimportant for our purpose. The quantity EF defines the Fermi\nsurface below which all energy levels are occupied in accordance with Pauli principle. The so called pair potential\n∆(~r) varies in space and describes the superconducting gap in excitation spectrum of the system - the essence of\nsuperconductivity. The last 2 terms in the above effective hamiltonian are a mean-field approximation of attractive\nfour-fermi point interaction. The pair potential ∆ is related to the anomalous particle-particle correlator:\n∆αβ (t, ~r) = hψα (t, ~r)ψβ (t, ~r)i = ∆(t, ~r)ǫαβ .\n\n(2)\n\nOne can treat this hamiltonian as the description of the interation between particles ψ and given classical pair potential\n∆(~r). We assumed that this interaction is independent of the spin. In that sense the spin is not dynamical degree of\nfreedom but only a quantum number that distinguishes between 2 types of particles.\nLet us mention that the hamiltonian (1) does not conserve particle number1 . This results from the fact that the\npair potential describes the condensate of Cooper pairs which is a source of particles in our approximation. Let us\nalso notice that the energy is conserved however not necessarily momentum. The momentum conservation is related\nto the space dependence of the gap parameter ∆(~r).\nThe equations of motion that follow from the hamiltonian (1) and standard anticomutation relations for fermi fields\ntake the form of so called Bogoliubov - de-Gennes equations [15]:\n!\u0012\n\u0013\n\u0012\n\u0013\n∇2\nψ↑ (t, ~r)\nψ↑ (t, ~r)\n− EF\n∆(~r)\n− 2m\n.\n(3)\n=\ni∂t\n2\n†\n†\n∇\nψ↓ (t, ~r)\nψ↓ (t, ~r)\n+ EF\n∆∗ (~r)\n2m\n\nThese operator equations are linear which means that we are free to treat them as the usual wavefunction equations\n(hermitian conjugate changing to complex conjugate). The physical interpretation of the wavefunctions comes from\nthe following reasoning. In the case of ∆ = 0 the equations (3) decouple from each other:\n\u0012\n\u0013\n∇2\niψ̇↑ (t, ~r) = −\n(4)\n− EF ψ↑ (t, ~r)\n2m\n\u0013\n\u0012 2\n∇\n∗\n+ EF ψ↓∗ (t, ~r).\niψ̇↓ (t, ~r) =\n2m\nThe plane wave solutions:\nφ≡\n\n1\n\n\u0012\n\nψ↑ (t, ~r)\nψ↓∗ (t, ~r)\n\n\u0013\n\n=\n\n\u0012\n\nf exp(−iEt + i~q~r)\ng exp(−iEt + i~q~r)\n\nIn this situation charge is also not conserved.\n\n2\n\n\u0013\n\n(5)\n\n\flead to the dispersion relations:\nE = ǫq for particles\nE = −ǫq\nfor holes,\n\n(6)\n\nwhere ǫq = ~q 2 /2m − EF is a measure of the kinetic energy with respect to Fermi level and E describes the energy\nexcitation above (below) Fermi energy for particles (holes)2 . Let us mention the interesting detail that for the holes\nthe group velocity is opposite to momentum ~v = −~q/m thus the wavefunction ψ↑∗ (t, ~r) describes the hole which is\nmoving from right to left for ~r = (0, 0, z)3 . The above physical picture can be treated as a simple description of the\nconductors. The energy spectrum contains particles and holes in the vicinity of Fermi surface which can be excited\neasily for the negligible cost of energy.\nLet us now consider equations (3) with ∆(~r) = const., which gives us the model of superconductor. The plane-waves\nare still the solutions of (3):\n\u0013\n\u0012\nfq exp(−iEt + i~q~r)\n,\n(7)\nφ=\ngq exp(−iEt + i~q~r)\nwhere momentum dependent constants satisfy the equations:\n\u0012\n\u0013\u0012\n\u0013\n−E + ǫq\n∆\nfq\n= 0.\n∆∗\n−E − ǫq\ngq\n\n(8)\n\nThe selfconsistency condition for the set of homogenous equations gives the dispersion relation:\nE 2 = ǫq2 + |∆|2 .\n\n(9)\n\nThis is famous gapped energy spectrum of the quasiparticles in the superconductor. The wavefunction describing\nquasiparticles are given by the solutions of (8):\n q\n\n\n q\n1\n1\n(1\n+\nξ/E)\nexp(iδ/2)\n(1\n−\nξ/E)\nexp(iδ/2)\n2\n exp(i~q+~r − iEt) + F  q 2\n exp(i~q−~r − iEt), (10)\nφ = D q\n1\n1\n2 (1 − ξ/E) exp(−iδ/2)\n2 (1 + ξ/E) exp(−iδ/2)\np\nwhere ξ = E 2 − |∆|2 , δ is a phase of the gap parameter, D, F some constants and momenta of the excitations are\ngiven by the relations:\n2\nq~±\n= EF ± ξ.\n2m\n\n(11)\n\nThe first (second) wave-function of (10) is particle-like (hole-like) excitation because for E >> |∆| it reduces to the\nparticle (hole) wavefunction. Let us notice that for the excitation with energy E < |∆| the momenta are complex and\nthus quasiparticles do not propagate in the medium in such a case.\nIII. ANDREEV REFLECTION IN CONDENSED MATTER SYSTEMS\n\nLet us consider the conductor - superconductor juction (NS). This can be modeled by the equations (3) when the\npair potential takes appropriate shape. In the simplest case one can consider the plane junction perpendicular to\nthe z - axis located in the point z = 0. Then the gap parameter is only a function of z coordinate ∆(~r) = ∆(z).\nThe exact form of the pair potential depends on the details of the junction however some general features can be\nalready obtained in the simple model of the step junction ∆(z) = ∆Θ(z) which describes a conductor for z < 0 and\nsuperconductor with a constant gap ∆ for z > 0. The task is to solve the stationary problem of coupled Schrodinger\nequations (3) with boundary conditions:\n\n2\n\nThe apparent correlation between spin and particle-hole interpretation is accidental. We can have the same set of equations\nwith exchanged spin indices.\n3\nOne can also say that the hole has a negative mass.\n\n3\n\n\f1. For z → −∞ excitations are particles or holes (conductor)\n2. For z → +∞ excitations are quasiparticles (superconductor)\n3. For z = 0 wavefunctions and their first spatial derivatives are continuous.\nFor definitness let us consider that the particle of given energy E incoming from the left hits the junction at z = 0.\nAfter the collision the particle and/or hole can be reflected back and the qusiparticles can be excited in superconductor.\nThus for the conductor side (z < 0):\n\u0013\n\u0012\nexp(ikz) + B exp(−ikz)\n(12)\nφ< =\nC exp(ipz)\np\np\nwhere k = 2m(EF + E), p = 2m(EF − E) and the constants B and C are related to the probability of the\nreflection for the particle and hole, respectively. For the superconductor side (z > 0) the wave-functions\nare given by\nq\np\nformula (10) with ~r = (0, 0, z). The momenta are given by: q± = ±w + im|ξ|/w where w = m(EF + EF2 − ξ 2 )\np\nfor E < ∆ and q± = ± 2m(EF ± ξ) for E > ∆. The constants D and F describe the probability of the particle-like\nand hole-like quasiparticles excitations. The continuity conditions at z = 0 lead to the 4 equations for 4 constants\nB, C, D and F . The solutions of these equations are:\nB = O(\n\n1\n)\nEF\n\nC=\n\ns\n\n1\nE−ξ\n)\n+ O(\nE+ξ\nEF\n\nD=\n\ns\n\n1\n2E\n)\n+ O(\nE+ξ\nEF\nF = O(\n\n(13)\n\n1\n)\nEF\n\nThus one can conclude that the dominant contribution comes from the hole reflection in conductor and particlelike excitation in superconductor. The other contributions are suppresed by the powers of Fermi energy. For the\ninterpretation of our result let us consider the transition coefficients. From the equations (3) follows the conservation\nof probability current:\n\u0011\n\u0010\n∂\n~ ∗ − ψ ∗ ∇ψ\n~ ↓ = 0.\n~ ∗ + ψ↓ ∇ψ\n~ ↑ − ψ↑ ∇ψ\n~ * 1 ψ ∗ ∇ψ\n(|ψ↑ |2 + |ψ↓ |2 ) + ∇\n↓\n↓\n↑\n↑\n∂t\n2mi\n\nThis probability current through the NS junction has a form:\n\u001a\n0\njz =\n2ξ\n1\nE+ξ vF + O( EF )\n\nfor E < |∆|\nfor E > |∆|\n\n(14)\n\n(15)\n\np\nwhere vF = 2EF /m is Fermi velocity. The result of the vanishing current for energies below the gap is exact. The\ntransition and reflection coefficients read:\nRhole\n\nRhole = 1, Tquasi = 0\nE−ξ\n2ξ\n=\n, Tquasi =\nE+ξ\nE+ξ\n\nfor E < |∆|\n\n(16)\n\nfor E > |∆|\n\nThus for the energies of the incoming particle below the gap only the hole is reflected. This is easy to understand\nbecause there is no possibility to transport energy into the superconductor below the gap. Let us notice that in the\nAndreev reflection the charge is not conserved. This follows from the fact that our hamiltonian does not conserve\nparticle number. Obviously at the microscopic level the charge is conserved. The interpretation of the process is\nsimple: the incoming particle creates the Cooper pair with another particle from the Fermi sea and \"dilutes\" in the\ncondensate. The lack of the second particle is visible as a hole. Additionally the Andreev reflection process conserves\nthe energy and momentum (up to 1/EF corrections). It is also called retro-reflection because the outgoing hole after\nreflection is a time reversal picture of the incoming particle before the reflection. This is approximate picture exact\n4\n\n\fonly in the limit of the vanishing particle energy E = 0. Although the probability current vanishes at the NS junction\nthe charge current is excessed. Indeed the charge current at the conductor side is double because the particle and hole\ncurrents add to each other. The charge current is conserved at the interface thus at the superconducting side we also\nhave to encounter doubled charge current. This current is carried by the condensate (supercurrent) itself because the\nquasiparticles penetrate only on the depth of the order vF /|ξ|.\nFor the energy of the incoming particle above the gap the coefficients Rhole and Tquasi give us the probabilities of\nthe reflection of the hole or the transmission of the quasiparticle into superconductor. For E >> |∆| the coefficients\nRhole → 0, Tquasi → 1 as it should be.\nThese predictions were checked experimentally many times, e.g., by the direct measurement of the reflected holes\n[16]. The Andreev reflection can influence transport processes at the NS junctions which were already shown by\nAndreev [10]. Other effects like excess current, charge imbalance and supercurrent conversion were also considered\n(e.g., [17]).\n\nIV. SUPERCONDUCTIVITY IN QCD\n\nThe perturbative approach to high density QCD is well established at much higher densities than one can expect\nin the cores of the compact stars. Thus the use of models are inevitable in the description of interesting physics. This\nis the approach we chose in this paper. The one gluon exchange suggests that the diquark condensate is created in\ncolor and flavor anti-symmetric scalar channel. Similar feature one can also find using instanton-based models. The\neffective hamiltonian describing quark interaction with the pseudoscalar condensate at the high baryon density can\nbe written in the general form (for the review see [9]):\n\n\nZ\nX ij ∗\nX\n~ − μ)ψai +\nψai † (−i~\nα*∇\nH = d3 x \n∆ab (ψai T Cγ5 ψbj ) + h.c\n(17)\na,i\n\na,b,i,j\n\nwhere ψai are Dirac bispinors, a, b color indices, i, j flavor indices, C the charge conjugation matrix and μ is the\nquark chemical potential. At zero temperature the condensate ∆ij\nab is a vacuum expectation value of the 2-point field\ncorrelator:\nhψai T Cγ5 ψbj i = ∆ij\nab\n\n(18)\n\nThe formula (17) is a relativistic generalization of the hamiltonian (1) with the more complicated gap structure.\nIn the case of two flavors, the gap matrix (18) becomes:\n ̃ ij\n∆ij\nab = ∆ǫ ǫab3\n\n(19)\n\nwhere the third direction in color space was chosen arbitrarily. This combination breaks gauge symmetry SU (3)c →\nSU (2)c whereas chiral symmetry SU (2)L × SU (2)R remains untouched. This is the 2SC phase. The Cooper pairs are\ncreated between the quarks of different two colors and flavors and third color quarks are unpaired. The lowest energy\n ̃ from the vacuum. The value\nexcitations are of course unpaird quarks. The quasiparticles are separeted by the gap ∆\nof the gap depends on the model and is usualy in the range 50 − 150 MeV.\nFor the case of three flavors the gap parameter takes the form4 :\nijk\n∆ij\nǫkab .\nab = ∆ǫ\n\n(20)\n\nThis is color-flavor locked (CFL) phase. The gauge symmetry and global chiral symmetry are broken according to\nthe scheme SU (3)c × SU (3)L × SU (3)R → SU (3)L+R+c . The baryon U (1) symmetry is also broken. All quarks are\ngapped in Cooper pairs with different colors and flavors. The lowest excitations are nine Nambu-Goldstone bosons\nrelated to the spontaneous symmetry breaking of global symmetries. There is also additional Nambu-Goldstone boson\nconnected to the breaking of restored axial symmetry UA (1). The value of the gap is model dependent of the order\nof the 2SC gap but usualy slightly smaller.\nThe gap matrix can be written in general as:\n\n4\n\nThere is also a small admixture of the condensate in color symmetric 6 channel but we neglect it in our considerations.\n\n5\n\n\f0 ∆ud ∆us\n ∆ud 0 ∆ds\n\n ∆us ∆ds 0\n\n0\n−∆ud\n\n\n−∆ud\n0\n=\n\n0\n−∆us\n\n\n−∆us\n0\n\n\n\n\n∆ab\nij\n\nin the basis\n\n\n\n0\n−∆ds\n−∆ds\n0\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n(21)\n\n(ured , dgreen , sblue , dred , ugreen , sred , ublue , sgreen , dblue ),\n\n(22)\n\n ̃ for 2SC\n∆us = ∆ds = 0, ∆ud = ∆\n∆us = ∆ds = ∆ud = ∆,\nfor CFL\n\n(23)\n(24)\n\nwhere:\n\nFrom the gap matrix structre one can easily recognize the (ured , dgreen ), (ugreen , ured ) pairings in 2SC phase. The\nquasiparticle excitations are two doublet representations of the remaining unbroken symmetry SU (2)L × SU (2)c\nof given chirality L. The second similar set exists for oposite chirality. The unpaird quarks are singlets under color rotations SU (2)c and doublets under chiral symmetries. All of the excitations have the same gap\n ̃ The detail wave-functions of quasiparticle are given in Appendix B. For the CFL phase we have pairings:\n∆.\n(dred , ugreen ), (sred , ublue ), (sgreen , dblue ) similar to the 2SC and the combination of (ured , dgreen , sblue ) which is essentialy new for the CFL phase. After diagonalization of the matrix we can find 8 excitations with the gap ∆ and one\nexcitation with the gap 2∆. These are octet and singlet representations of the unbroken SU (3)L+R+c symmetry. The\ndetail calculations are given in Appendix C.\nV. ANDREEV REFLECTION IN SUPERCONDUCTING QCD\n\nIn this section, let us consider the Andreev reflection at the interface consisting of two different superconductors\nin QCD, that is, the 2SC/CFL interface since we find it is the most general case among the possible interfaces. As\nis obvious from the expression of the gap matrix (21) with the conditions (23) and (24), there are three kinds of\npossibilities of the quark scatterings at this interface.\n• (sred , ublue ) and/or (sgreen , dblue ): in this case, the Andreev reflection is similar to QGP/2SC because strange\nquark as well as blue up and down quarks are unpaired in the 2SC phase. This interface has already been\nstudied [11].\n• (dred , ugreen ): in this case, the reflection is 2SC/2SC' - like because the gap of each phase is, in general, different.\n• (ured , dgreen , sblue ): in this case, the reflection is a mixture of (QGP-2SC)/CFL interface. This happens because\nin the 2SC phase the ured , dgreen quarks are paired whereas strange quarks remain free.\nSince the last two cases are specific to the 2SC/CFL interface and have not been studied so far, let us restrict our\nconsideration into those cases. The comparison to other possibilities would be given at the end of this section.\nLet us start with the 2SC/2SC' case. Physical setup we are interested in is that the interface is placed at z = 0 in\nspace. For z < 0, we have 2SC phase and for z > 0, CFL phase and we provide the boundary condition that matches\nthe wavefunctions at z = 0.\nFor z < 0, the wavefunction takes the form as (below we put m = 0 for simplicity)\n\nq\n\nδs\nu\nei 2 E+λ\nφ\nq 2E ↑R  eik1 z−iEt\nΨ< (z) = \n(25)\nE−λ d†T\n−i δ2s\ne\n2E h↓L\nq\nq\n\n\n\n\nδs\nE−λ u\ni δ2s\nu\ne\nφ\nφ\nei 2 E+λ\nq 2E ↑R  e−ik1 z−iEt + B \nq 2E ↑R  e−ik2 z−iEt ,\n+A \nE−λ d†T\nE+λ d†T\n−i δ2s\n−i δ2s\ne\ne\n2E h↓L\n2E h↓L\n6\n\n\fwhile for z > 0,\n\n\nΨ> (z) = C \n\nei\n\nδc\n2\nδc\n\ne−i 2\n\nq\n\nE+ξ u\nφ\nq 2E ↑R\nE−ξ d†T\n2E h↓L\n\n\n\n\n\n eip1 z−iEt + D \n\nδc\n\nei 2\n\nδc\n\ne−i 2\n\nq\n\nE−ξ u\nφ\nq 2E ↑R\nE+ξ d†T\n2E h↓L\n\n\n\n eip2 z−iEt ,\n\n(26)\n\np\n√\n ̃ 2. ∆\n ̃ is the gap in\nwhere k1 = μ + λ, k2 = −μ + λ, p1 = μ + ξ and p2 = −μ + ξ. ξ ≡ E 2 − ∆2 and λ ≡ E 2 − ∆\nthe 2SC phase. The angles δs and δc are phases of the gap parameters in 2SC and CFL superconductors respectively.\nThe bispinors φR , hL are desribed in Appendix A.\nBy matching these wavefunctions at z = 0, we find the results as follows;\nA = 0,\np\np\n(E − ξ)(E + λ)eiα − (E + ξ)(E − λ)\np\nB= p\n+ O(1/μ),\n(E + ξ)(E + λ) − (E − ξ)(E − λ)eiα\nα\n\n2λei 2\np\n+ O(1/μ),\nC= p\n(E + ξ)(E + λ) − (E − ξ)(E − λ)eiα\nD = 0,\n\n(27)\n\nwhere α = δs − δc is a phase difference of the gaps crossing the interface. Note here that the coefficients A and D\n ̃ are given\nexactly vanish in the massless limit. First of all, the transition and reflection coefficients, when E > ∆, ∆,\nby the formulae:\n1\n4λξ\nξ\n|C|2 =\n.\n2\nλ\n(E + ξ)(E + λ) 1 + r − 2r cos α\nR=1−T\n\nT =\n\n(28)\n\nwhere\nr=\n\ns\n\n(E − λ)(E − ξ)\n(E + λ)(E + ξ)\n\n(29)\n\n†\n†\n ̃ T = 0 and of course R = 1. The conserved current is defined as j = ψ>\nwhereas for ∆ < E < ∆,\nα\n~ ψ> = ψ<\nα\n~ ψ< and\ncoincides at both sides of the interface:\n(\n ̃\n0\nfor ∆ > E > ∆\nj=\n(30)\nξ\n4λ2\n ̃\n2μ E (E+ξ)(E+λ)(1+r2 −2r cos α) for E > ∆, ∆\n\nThe coefficients and currents depend on the phase difference α of the gap parameters. We suggest that this combination\nis a gauge invariant quantity. Indeed in the case of U (1) superconductors α variable is responsible for many interesting\nphysical phenomena like, for example, the Josephson effect.\nLet us move to the case (QGP - 2SC)/CFL interface (the mixed case). In this case, the basis of the wavefunction\nmust be\n u \nψred\nd\n\n ψgreen\n\n s\n ψblue \n u†T \n(31)\n\n ψ\nred \n d†T\n ψgreen \ns†T\nψblue\nFor z > 0, we can use the equation (58) from Appendix C. In the 2SC side the wavefunction takes the form:\nq\nq\nq\n\n\n\n\n\n\nδs\nE+λ u\nE−λ u\ni δ2s\ni δ2s\nu\nei 2 E+λ\ne\ne\nφ\nφ\nφ\n↑R\n↑R\n↑R\n2E\n2E\n2E\n\n\n\n\n\n\n\n\n\n\n\n\n0\n0\n0\n\n\n\n\n\n\n0\n0\n0\n ik1 z\n −ik1 z\n −ik2 z\n\n\n\nΨ< (z) ≡ \n+ A\n+B\ne\ne\ne\n0\n0\n0\n\n\n\n\n\n\nq\nq\nq\n\n\n\n\n\n\nδs\nδ\nδ\ns\ns\n e−i 2 E−λ hd†T \n e−i 2 E−λ hd†T \n e−i 2 E+λ hd†T \n2E\n\n0\n\n↓L\n\n2E\n\n0\n\n↓L\n\n7\n\n2E\n\n0\n\n↓L\n\n\f\n\ni δ2s\n\nq0\n\nE+λ d\n e\n\n2E φ↑R\n\n\nq0\n+C\n e−i δ2s E−λ hu†T\n\n↓L\n2E\n\n0\n0\n\n\n\n\n\ni δ2s\n\nq0\n\nE−λ d\n\n e\n\n\n2E φ↑R\n\n\n −ik1 z\n\nq0\n+D\ne\n\n e−i δ2s E+λ hu†T\n\n\n↓L\n2E\n\n\n0\n0\n\n\n\n\n\n\n −ik2 z\ne\n\n\n\n\n0\n 0\n s\nφ\n+ F  ↑R\n 0\n 0\n0\n\n\n\n\n\n\n\n\n\n\n\n −ik3 z\n\ne\n+\nG\n\n\n\n\n\n\n\n0\n0\n0\n0\n0\nhs†T\n↓L\n\n\n\n\n\n −ik z\n e 4 , (32)\n\n\n\n\nThe first wavefunction describes the incoming quasiparticle, second and third the reflected quasiparticles of the same\nkind. The next two wavefunctions are quasiparticles of the second kind whereas the last two describe the posssibility\nof the reflection of the unpaired strange quark. The momenta of the strange quark and hole are k3 = μ + E and\nk4 = −μ + E, the other were already given previously. On the other hand, for z > 0, we have the wavefunction given\nby the formula (54) in Appendix C. In the massless limit we consider here the momenta in the wave function (54)\nare given by q1 = μ + ξ, q2 = −μ + ξ, p1 = μ + ζ and p2 = −μ + ζ. Solving the boundary condition which connects\nΨ< (z) with Ψ> (z), we find the following results (the phase exp(iδs /2) was absorbed into the redefinition of constants\nG, H, K and N ):\n2eiα (eiα lx(x − 2z) + x + z)λ\n(1 − eiα lx)(3 + eiα x(x − 2z))(E + λ)\n2eiα (2x − z)λ\nD=−\n(1 − eiα lx)(3 + eiα l(x − 2z))(E + λ)\nr\n(x + z)e−iδc\n2E\nλ\nG=\nE E + λ 3 + eiα l(x − 2z)\nr\nλ\nx(1 + l(x − z)eiα )e−iδc\n2E\nH=−\nE E + λ (1 − eiα lx)(3 + eiα l(x − 2z))\nr\n2E\nλ\nxe−iδc\nK=\nE E + λ 3 + eiα l(x − 2z)\nr\nze−iδc\n2E\nλ\nN=\nE E + λ 3 + eiα l(x − 2z)\n\nB = −l +\n\n(33)\n\nwhere\nx=\n\ns\n\nE−ξ\n, l=\nE+ξ\n\nr\n\nE−λ\n, x=\nE+λ\n\ns\n\nE−ζ\n,\nE+ζ\n\n(34)\n\nOther coefficients (A, C, D, F, J, L and P ) vanish. Let us notice that the modulus square of the above coefficients\ndepends only on the phase difference α crossing the interface. Similarly to the case of 2SC/2SC' junction this quantity\nwe consider is gauge independent.\n ̃ 2∆ is\nThe probability current for z < 0 and E > ∆,\nj ≡ Ψ†< α\n~ Ψ< = 2μ[\n\nξ\n(1 − |B|2 − |D|2 ) − |G|2 ].\nE\n\n(35)\n\nThe analytical result is not given by short expression thus we rather show the current dependence on the energy in the\nFig. 1 for generic set of parameters. Let us notice that the current starts at energy E = ∆ and then rises linearly up\nto the point E = 2∆ where there is a jump. This behaviour is expected because below the gap there is no probability\ncurrent and at the energy twice the gap additional current appears from the singlet excitation in the CFL phase.\n\n8\n\n\f1\n0.8\n0.6\n0.4\n0.2\n\n75\n\n100\n\n125\n\n150\n\n175\n\n200\n\n225\n\nFIG. 1. Dependence of the probability current (35) as a function of energy E [MeV] for two sets of parameters: ∆ = 80\n ̃ = 60 MeV (black curve) and ∆ = 100 MeV, ∆\n ̃ = 60 MeV (gray curve).\nMeV, ∆\n\nFor comparison let us show the result for transition and reflection coefficients in the QGP/CFL scattering:\n\u001a\n0\nfor E < |∆|\n3\nT =\nξ\nfor E > |∆|\nE+ξ\n\u001a\n0\nfor E < |∆|\nT8 =\nξ\nfor E > |∆|\n3(E+ξ)\n\u001a\n0\nfor E < 2|∆|\nT9 =\n2ζ\nfor\nE > 2|∆|\n3(E+ζ)\n\n(36)\n\nwhere T A are transition coefficients for quasiparicles in the CFL basis described by the wavefunctions (58) given in\nthe Appendix C. Let us note that because of the energy conservation there is always only one hole reflected in the\nQGP phase:\n 5\n2\n2\n\n 9 − 9|∆|2 [(E + |ζ||ξ|) cos(2δ) − E(|ζ| − |ξ|) sin(2δ)] forE < |∆|\n4(E−ξ)\n1\n2\nu\nfor|∆| < E < 2|∆|\nRred\n=\n(37)\n9 + 9(E+ξ) − 9(E+ξ) [E cos(2δ) − |ζ| sin(δ)]\n\n 1 E−ζ + 4 E−ξ − 2 E−ζ cos(2δ)\nforE\n>\n2|∆|\n9 E+ζ\n9 E+ξ\n9 E+ξ\n 2\n1\n2\n\n 9 + 9|∆|2 [(E + |ζ||ξ|) cos(2δ) − E(|ζ| − |ξ|) sin(2δ)] forE < 2|∆|\nE−ξ\n1\n1\nd\ns\nfor|∆| < E < 2|∆|\nRgreen\n= Rblue\n=\n9 + 9(E+ξ) + 9(E+ξ) [E cos(2δ) − |ζ| sin(δ)]\n\n 1 E−ζ + 1 E−ξ + 1 E−ζ cos(2δ)\nforE > 2|∆|\n9 E+ζ\n9 E+ξ\n9 E+ξ\n\np\np\nwhere |ζ| = 4|∆|2 − E 2 , |ξ| = |∆|2 − E 2 . Reflection and transition coefficients sum up to unity for any value of\nenergy E of incoming particle. The coefficients (37) depends on the phase δ of the gap parameter. However this single\nphase is a gauge dependent quantity. Thus to get the physical answer we have to avarage over the phase angle. The\nsinus and cosinus avarage to zero giving the final answer in the form:\n 5\nforE < |∆|\n\n 9\n4(E−ξ)\n1\nu\nfor|∆| < E < 2|∆|\nRred =\n(38)\n9 + 9(E+ξ)\n\n 1 E−ζ + 4 E−ξ forE > 2|∆|\n9 E+ζ\n9 E+ξ\n\n2\n\nforE < 2|∆|\n 9\nE−ξ\n1\nd\ns\n+\nfor|∆|\n< E < 2|∆|\nRgreen\n= Rblue\n=\n9\n9(E+ξ)\n\n 1 E−ζ + 1 E−ξ forE > 2|∆|\n9 E+ζ\n9 E+ξ\n\nFor the case of QGP/2SC scattering the results are the same as given by equations (15,16). The only difference\nis that instead of Fermi velocity vF in the probability current (15) we have relativistic expression 2pF (the Fermi\nmomentum pF is essentialy equal to quark chemical potential μ in our approximation). Let us notice that the reflection\nand transition coefficients are exactly the same like in the non-relativistic case.\n\n9\n\n\fVI. CONCLUSIONS\n\nIn this paper we consider the general structure of the Andreev reflection between two superconductors 2SC and\nCFL in the high density QCD. We also give the review of the Andreev reflection between QGP/2SC and QGP/CFL\nphases as well as in condensed matter systems.\nThe essence of the AR stems from the peculiar behaviour of particles which hit the interface. If the energy of\nthe incoming particle from the conductor side is below the energy gap in superconductor then the hole is reflected\nfrom the interface. The energy and momentum5 are conserved, however, there is an apparent violation of the charge\nconservation. This last effect stems from the fact that the superconductor serves as an infinite suply of Cooper\npairs. At the microscopic level charge is conserved, of course. The Andreev reflection can be understood as follows:\nthe incoming particle takes another particle from the Fermi sea and creates a Cooper pair which dissolves in the\ncondensate. Then the hole is left in the conductor with the appropriate kinematics constaraind by energy and\nmomentum conservation.\nThis pattern is exactly repeated in QCD superconductors. The differences come from the more complicated structure\nof Cooper pairing of quarks. There are more quantum numbers describing QGP phase as well as the quasiparticle\nstructure in QCD superconductors are richer. The treatment of the Andreev reflection processes are similar to the\ncase of nonrelativistic physics, however, more attention has to be taken for the gauge invariance of the final results.\nIt appears that the probability currents are gauge independent quantities but the transition T and the reflection R\ncoefficients require more attention. Our effective hamiltonian (17) is not gauge invariant, nevertheless one can trace\nthe gauge behaviour by tracing the dependence of the final result on the phase δ of the gap parameter. Obviously\nthe phase δ itself is not gauge invariant quantity. In the QGP/2SC case the coefficents T and R are gauge invariant,\nhowever, this is not true for the QGP/CFL interface (37). Let us first notice that one should expect the gauge\ninvariant answers for T and R coefficents because the reflected holes can be distinguished by their flavor quantum\nnumber (not a color). We suggest that the avaraging of the final result over the phase δ rebuilts the gauge invariant\nanswer. This is reasonable. Indeed to perform the Andreev reflection experiment one has to prepare the ensemble\nof the QGP/CFL interfaces. Then each sample has its own unphysical gap phase. Then performing the experiment\non the unsamble is equivalent to avarage over the phase δ. Finally in the case of 2SC/CFL interface the physical\nquantities depend on the phase difference α crossing the boundary. This is actualy expected result because, similarly\nto U (1) superconductors, the angle α is a gauge independent variable.\nThe Andreev reflection has many interesting physical effects in condensed matter systems [10,16,17]. In the high\ndensity QCD situation is more complicated. The only known place one can expect the color superconductors are\nthe cores of protoneutron or Neutron Stars. Any subtle effets of Andreev reflection that happen inside these objects\nfar away from our laboratories may be never observed. However there is at least one possibility one can imagine.\nThe Andreev reflection affects the transport properties at the interfaces. If the protoneutron stars go through the\nfirst order phase transitions between QGP or/and 2SC or/and CFL phases during their history cooling then one can\nexpect the mixed phase to be present in the core of the stars. In this situation the Andreev reflection influences the\ndynamics of the bubbles grow between different phases. These in turn influence the neutrino emmission. Thus the\ntime dependence of neutrino luminosity from supernovae can carry the information of the Andreev processes which\ntook place inside the protoneutron stars. These intriguing possibilities require more attention.\nAcknowledgement. M.S was supported by a fellowship from the Foundation for Polish Science. M.S. was also\nsupported in part by Polish State Committee for Scientific Reasearch, grant no. 2P 03B 094 19.\nAPPENDIX A - Particles, holes and Dirac algebra\nLet us consider the equations of motion for free quarks at chemical potential μ.\n~ + mγ0 − μ)ψ(t, ~r),\niψ̇(t, ~r) = (−i~\nα*∇\n~ † (t, ~r) * α\niψ̇ † (t, ~r) = −i∇ψ\n~ − ψ † (t, ~r)(mγ0 − μ).\n\n(39)\n\nRemembering that relativistic effects are suppressed at high density the Dirac field operator ψ(t, ~r) can have a oneparticle interpretation of annihilating a fermion of given spin at the point (t, ~r) in space-time. We can also change\n\n5\n\nThe momentum conservation is violated at the O(1/EF ) level and can be neglected in the first approximation.\n\n10\n\n\fthe operator equation (39) into the wavefunction equation. The first equation of (39) describes the particles and the\nsecond one the holes. Using the decomposition:\nX\nψ(t, ~r) =\nαr φr,R (~q) exp(i~q * ~r − iǫt),\n(40)\nr\n\nψ † (t, ~r) =\n\nX\nr\n\nγr∗ h†r,L (−~q) exp(i~q * ~r − iǫt),\n\none can easily solve the equations (39). To finish this let us define the bispinors φr,R (~k) and φr,L (~k) through the\nequations:\n(α * ~k + mγ0 − μ)φr,R (~k) = ǫφr,R (~k)\nφ† (~k)(α * ~k + mγ0 − μ) = ǫφ† (~k)\nr,L\n\n(41)\n\nr,L\n\nwhere r describes the spin and momentum ~k can be in general complex vector. From this reason one has to distinguish\nbetween the right- and left-handed eigenvectors, which are denoted by the capital letters L, R. For complex ~k φ†r,L is\nnot hermitian conjugate to φr,R . The solutions of the equations take the form:\n!\n√\nm + ǫ + μχr\n(42)\nφr,R (~k) =\nσ*~\nk\n√ ~\nχ\nm+ǫ+μ r\n!\n~σ * ~k\n†\n†√\n†\n~\nφr,L (k) = χ̄r m + ǫ + μ, χ̄r √\nm+ǫ+μ\nwhere χr , χ̄†r are spinors and where ǫ =\n\np\n~k 2 + m2 − μ6 . The spinors can be defined in the helicity basis:\n~σ * ~kχ↑,↓ = ±kχ↑,↓\nχ̄†↑,↓~σ * ~k = ±k χ̄†↑,↓\n\nwhere k =\n\np\n~k 2 . Let us also define the additional bispinors:\n\nh†r,L (~k)(α * ~k − mγ0 + μ) = ǭh†r,L (−~k)\n\n(43)\n\n(44)\n\n(α * ~k − mγ0 + μ)hr,R (−~k) = ǭhr,R (−~k)\nwhere ǭ = −ǫ and bispinors are given by formulae:\n\nh†r,L (−~k) =\n\n!\n√\nm − ǫ + μχr\nhr,R (−~k) =\nσ *~\nk\n√ ~\nχ\nm−ǫ+μ r\n!\n~σ * ~k\n†√\n†\nχ̄r m − ǫ + μ, −χ̄r √\nm−ǫ+μ\n\nThe bispinors defined above fulfill simple algebraic relations which are useful in the calculations:\np\nφ†r,L φs,R = h†r,L hs,R = 2 k 2 + m2 δrs\n\u001a\np\n−1 s =↑ r =↓\nT\nφ†s,L Cγ5 h†r,L\nhs,R = φTs,R Cγ5 hr,R = 2 k 2 + m2\n1 s =↓ r =↑\n\n(45)\n\n(46)\n\nThe bispinors defined above together with (40) are solutions of (39) and have simple physical meaning. The\nwavefunction:\n\n6\n\nThere is another solution with ǫ = −\n\np\n\n~k2 + m2 − μ which is not interesting for our purposes\n\n11\n\n\fψ(t, ~r) = φ↑ R (~k) exp (−iǫt + i~k * ~r)\n(47)\np\n~\nk\n, where E = ~k 2 + m2 and energy ǫ above the Fermi Sea.\ndescribes the particle of spin projection up, velocity ~v = E\nFrom the other hand the wavefunction:\nψ † (t, ~r) = h†↓ L (−~k) exp (−iǫt + i~k * ~r)\n\n(48)\n\ndescribes the hole of spin projection down, velocity −~v , and energy ǫ below the Fermi Sea.\nAPPENDIX B - 2SC quasiparticles\nFrom the hamiltonian (17) and the gap structure (21) for 2SC phase (23), using usual commutation relations for\nfermi fields, one can derive the equation of motion:\nu\n~ + mγ0 − μ)ψ u − ∆Cγ5 ψ d∗ ,\niψ̇red\n= (−i~\nα*∇\nred\ngreen\nd\nd\n~\n= (−i~\nα * ∇ + mγ0 − μ)ψ\n− ∆Cγ5 ψ u∗\niψ̇\ngreen\n\nred\n\ngreen\n\n(49)\n\nwhere we exchange the field operators by the wave functions similarly like in the nonrelativistic case. This can be\ndone because the presence of the Fermi sea suppresses the contribution of antiquarks. There is similar set of equations\nfor another (ugreen , dred ) pair. It is convenient to use the plane wave decomposition:\nX\nu\nψred\n(t, ~r) =\nαr φur,R (~q) exp(i~q * ~r − iEt),\nr\n\nd\nψgreen\n(t, ~r)\n\n=\n\nX\nr\n\nβr φdr,R (~q) exp(i~q * ~r − iEt)\n\n(50)\n\nwhere the bispinors φ and h are defined in Appendix A. αr , βr are some constants. The subscripts u, d and s describe\nflavor and color of quarks. Plugging (50) into (49), using the relations given in Appendix A one can find the wave\nfunctions [11]:\n\n\nq\n\u0012 u \u0013\nu\n′ u\nexp(iδ/2) E+λ\n(Cφ\n−\nC\nφ\n)\nψred\n↑R\n↓R\n eip1 z−iEt +\nq 2E\n(51)\n=\nΨ(t, ~r) ≡\nd†T\nψgreen\nexp(−iδ/2) E−λ (Chd†T + C ′ hd†T )\n2E\n\n↓L\n\n↑L\n\n\nq\nu\n′ u\nexp(iδ/2) E−λ\n(Dφ\n−\nD\nφ\n)\n↑R\n↓R\n eip2 z−iEt ,\n\nq 2E\nd†T\n′ d†T\n(Dh\n+\nD\nh\n)\nexp(−iδ/2) E+λ\n↓L\n↑L\n2E\n\n\nq\np\n ̃ 2 and C, C ′ , D, D′ are some\nwhere δ is a phase of the gap parameter, p1,2 =\n(μ ± λ)2 − m2 , λ =\nE 2 − |∆|\nconstants. The first wavefunction describes the particle-like excitation whereas the second one describes the hole-like\nquasiparticle. This is quite similar to the description of the nonrelativistic quasiparticles. Indeed if one compares (51)\nwith the wavefunctions (10) the similarity is striking. It also occurs that the Andreev reflection in the QGP/2SC case\nis a direct analog of the Andreev reflection at the nonrelativistic conductor/superconductor junction.\nThe extension of the wave function (51) to the case of the 2SC superconductor with 3 flavors is strightforward. The\nexact expressions are given in Section V.\nAPPENDIX C - CFL quasiparticles\nLet us now discuss the CFL quasiparticle waveufunctions for the states ured , dgreen , sblue . The equations of motions\nthat follow from (17) take the form:\nu\n~ + mγ0 − μ)ψ u − ∆Cγ5 (ψ d∗ + ψ s∗ ),\niψ̇red\n= (−i~\nα*∇\nblue\nred\ngreen\n\nd\nd\nu∗\ns∗\n~ + mγ0 − μ)ψgreen\niψ̇green\n= (−i~\nα*∇\n− ∆Cγ5 (ψred\n+ ψblue\n),\ns\ns\nu∗\nd∗\n~ + mγ0 − μ)ψ\niψ̇\n= (−i~\nα*∇\n− ∆Cγ5 (ψ + ψ\n),\n\nblue\nu†\niψ̇red\nd†\niψ̇green\ns†\niψ̇blue\n\nblue\n\nred\n\ngreen\n\nu†\n∗\ndT\nsT\n~ u† * α\n= −i∇ψ\nred ~ − ψred (mγ0 − μ) − ∆ (ψgreen + ψblue )Cγ5 ,\n\nd†\nd†\nuT\nsT\n~ green\n= −i∇ψ\n*α\n~ − ψgreen\n(mγ0 − μ) − ∆∗ (ψred\n+ ψblue\n)Cγ5 ,\ns†\ns†\ndT\n∗\nuT\n~\n= −i∇ψ\n*α\n~ −ψ\n(mγ0 − μ) − ∆ (ψ + ψ\n)Cγ5 .\nblue\n\nred\n\nblue\n\n12\n\ngreen\n\n(52)\n\n\fTo find the quasiparticle wavefunctions for ∆ = const, it is convenient to use the following decompositions:\nX\nX\nu†\nu\nψred\n(t, ~r) =\nαr φur,R (~\nq ) exp(i~q * ~r − iEt), ψred\n(t, ~r) =\nα∗r hu†\nq) exp(i~q * ~r − iEt),\nr,L (−~\nr\n\nd\nψgreen\n(t, ~r) =\n\nX\nr\n\ns\nψblue\n(t, ~r)\n\n=\n\nX\n\nr\n\nβr φdr,R (~\nq ) exp(i~q * ~r − iEt),\n\nd†\nψgreen\n(t, ~r) =\n\nγr φsr,R (~\nq ) exp(i~q\n\ns†\nψblue\n(t, ~r)\n\nr\n\n* ~r − iEt),\n\nX\nr\n\n=\n\nX\nr\n\nβr∗ hu†\nq ) exp(i~q * ~r − iEt),\nr,L (−~\n\nγr∗ hu†\nq ) exp(i~q * ~r − iEt),\nr,L (−~\n\n(53)\n\nwhere φ and h are defined in Appendix A. αr , βr and γr are some constants. The subscripts u, d and s describe flavor\nand color of quarks in obvious way.\nPlugging (53) into (52), using the bispinor algebraic relations given in Appendix A and assuming constant value of\nthe gap parameter ∆, one obtains the wavefunction describing the quasiparticle excitations of given energy E in the\nCFL phase:\n\n E−ξ\n E+ξ\n\n u    E+ξ u \nu\nu\nψred\n∆∗ φ↑R\n∆∗ φ↑R\n∆∗ φ↑R\n − E−ξ φd \n\n\n − E+ξ φd \nd\n \n ψgreen\n0\n\n ∆∗ ↑R \n\n\n∗\n  \n s\nE+ξ s \n\n\n\n ∆ 0 ↑R \n ψblue  \n−\n0\n∗ φ↑R  i~\n\n\n\n\n\n\ni~\nq\n*~\nr\ni~\nq\n*~\nr\n∆\n\nΨ(t, ~r) ≡ \nH\ne 1 +J \ne 2 +K \n e q1 *~r +\nu†T\nu†T\nu†T\n ψ u†T  = \n\n\n\n\n\n\n\n−h\n−h\n−h\nred \n d†T\n↓L\n↓L\n↓L\n\n\n\n\n\n\nd†T\n ψgreen  \n\n\n\n\n\n  hd†T\n0\nh↓L\n↓L\ns†T\ns†T\nψblue\nh\n0\n0\n↓L\n\n 2∆ u \n 2∆ u \n\n E−ξ\nu\nE−ζ φ↑R\nE+ζ φ↑R\n∆∗ φ↑R\n\n 2∆ φd↑R \n 2∆ φd↑R \n\n\n0\n\n E−ζ\n\n\n E+ζ\n\n\n2∆\n2∆\nE−ξ\ns\ns \n\n\n\n\n−\ns \nφ\nφ\n E−ζ ↑R  i~p1 *~r\n E+ζ ↑R  i~p2 *~r \n ∆∗ φ↑R  i~q2 *~r\n+N\n+P \n(54)\n+L \ne\ne\ne\n exp (−iEt)\nu†T\nu†T\nu†T\n\n h↓L\n\n\n h↓L\n\n −h↓L\n\n\n\n\n\n\n\n\n hd†T\n\n\n hd†T\n\n\n0\n↓L\n↓L\ns†T\ns†T\ns†T\nh↓L\nh↓L\nh↓L\np\np\np\np\nwhere ξ = E 2 − |∆|2 and ζ = E 2 − 4|∆|2 . q1,2 = (μ ± ξ)2 − m2 and p1,2 = (μ ± ζ)2 − m2 . H, J, K, L, N\nand P are arbitrary constants. Similar expression is obtained for the opposite spin content. Instead of using\nured , dgreen , sblue basis one can use the CFL-basis:\nψαi =\nin which the gap matrix (21) is diagonal, where\n\n9\nX\n(λA )iα A\n√ ψ\n2\nA=1\n\n(55)\n\n9\n\nA\n\nλ , A = 1, ..., 8 are Gell-Mann matrices and λ =\nExplicitly:\n\nr\n\n2\n1̂\n3\n\n(56)\n\n1\nu\nd\n− ψgreen\n)\nψ 3 = √ (ψred\n2\n1\nu\nd\ns\nψ 8 = √ (ψred\n+ ψgreen\n− 2ψblue\n)\n6\n1\nu\nd\ns\nψ 9 = √ (ψred\n+ ψgreen\n+ ψblue\n)\n6\nIn the CFL-basis one can write quasiparticle wavefinctions as:\n!\n\u0012 9\n\u0013\n2∆\n√\n√\nψparticle\n9\nE−ζ φ↑ R\nei~p1 *~r + 3P\nψCF L ≡\n= 3N\n†T\n9\nψhole\nh↓ L\n!\nr\n\u0012 8\n\u0013 r\nE+ξ\n3\n3\nφ\nψ\n∗\n↑\nR\n8\ni~\nq1 *~\nr\nparticle\n∆\nψCF L ≡\ne\n+\n=\nK\nL\n8\nψhole\n−h†T\n2\n2\n↓L\n!\n\u0012 3\n\u0013\nE+ξ\n2J + L\n2H + K\nψparticle\n∗ φ↑ R\n3\n∆\n√\nei~q1 *~r + √\nψCF L ≡\n=\n†T\n3\nψhole\n−h↓ L\n2\n2\n13\n\n(57)\n\n!\n\nei~p2 *~r\n\nE−ξ\n∆∗ φ↑ R\n−h†T\n↓L\n\n!\n\nei~q2 *~r\n\nE−ξ\n∆∗ φ↑ R\n−h†T\n↓L\n\n!\n\nei~q2 *~r\n\n2∆\nE+ζ φ↑ R\nh†T\n↓L\n\n(58)\n\n\f9\n3\n8\nThe excitation ψCF\nL describes the singlet quasiparticle with the gap 2∆ wheras ψCF L , ψCF L describe octet quasiparticles with the gap ∆. The probability currents:\nA†\nA\nA\n~j A = ψ A†\n~ ψparticle\n+ ψhole\nα\n~ ψhole\nparticle α\n\n(59)\n\nare conseved and can be used to calculte the transition coefficients in the scattering procesess.\n\n[1] For example, see Proceedings of Quantum Chromodynamics and Color Confinement, edited by H. Suganuma et al. (World\nScientific, 2001).\n[2] D. Gross and F. Wilczek, Phys. Rev. Lett. 30 (1973) 1343; H.D. Politzer, Phys. Rev. Lett. 30 (1973) 1346.\n[3] G. Baym and S.A. Chin, Phus. Lett B62 (1976) 241; G. Chaplin and M. Nauenberg, Nature 264 (1976) 235; Phys. Rev.\nD16 (1977) 456; B.D. Keister and L.S. Kisslinger, Phys. Lett B64 (1976) 117; W. B. Fechner and P.C. Joss, Nature 274\n(1978) 347.\n[4] F. Barrois, Nucl. Phys. B129 (1977) 390; D. Bailin and A. Love, Nucl. Phys. bf B190 (1981) 175; Nucl. Phys. B190 (1981)\n751; Nucl. Phys. B205 (1982) 119; Phys. Rep. 107 (1984) 325.\n[5] M. Alford, K. Rajagopal and F. Wilczek, Phys. Lett. B422 (1998) 247; R. Rapp, T. Schäfer, E. Shuryak and M. Velkovsky,\nPhys. Rev. Lett. 81 (1998) 53.\n[6] M. Alford, K. Rajagopal and F. Wilczek, Nucl. Phys. B537 (1999) 443.\n[7] D. Son, Phys. Rev. D59 (1999) 094019.\n[8] J. Bardeen, L.N. Cooper and J.R. Schrieffer, Phys. Rev. 106 (1957) 162; bf 108 (1957) 1175.\n[9] K. Rajagopal and F. Wilczek, Chap. 35 in \"At the Frontier of Particle Physics/ andbook of QCD\", M. Shifman ed. (World\nScientific) [hep-ph/0011333].\n[10] A.F. Andreev, Zh. Eksp. Teor. Fiz. 46 (1964) 1823.\n[11] M. Sadzikowski, Acta Phys. Pol. B (2002)\n[12] M. Sadzikowski and M. Tachibana, hep-ph/0201223, to be published in Phys. Rev. D.\n[13] G.W. Carter and S. Reddy, Phys. Rev. D62 (2000) 103002.\n[14] M. Alford, J. Berges and K. Rajagopal, Nucl. Phys. B558 (1999) 219.\n[15] N. N. Bogoliubov, Zh. Exp. Teor. Fiz 34 (1958) 58, 73 (JETP 34 (1958) 41, 51); Y. Nambu, Phys. Rev. 117 (1960) 648;\nP. G. de Gennes, \"Superconductivity of Metals and Alloys\" (Addison-Wesley, New York, 1992).\n[16] P.A.M. Benistant, H. van Kempen and P, Wyder, Phys. Rev. Lett. 51 (1983) 817.\n[17] G.E. Blonder, M. Tinkham and T.M. Klapwijk, Phys. Rev. B25 (1982) 4515.\n\n14\n\n\f"}