{"id": "http://arxiv.org/abs/hep-ph/0607036v3", "guidislink": true, "updated": "2007-02-09T09:04:00Z", "updated_parsed": [2007, 2, 9, 9, 4, 0, 4, 40, 0], "published": "2006-07-04T13:01:47Z", "published_parsed": [2006, 7, 4, 13, 1, 47, 1, 185, 0], "title": "A remark on the low mass dilepton yield in heavy ion collisions", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0607095%2Chep-ph%2F0607262%2Chep-ph%2F0607023%2Chep-ph%2F0607238%2Chep-ph%2F0607239%2Chep-ph%2F0607047%2Chep-ph%2F0607241%2Chep-ph%2F0607085%2Chep-ph%2F0607334%2Chep-ph%2F0607155%2Chep-ph%2F0607129%2Chep-ph%2F0607261%2Chep-ph%2F0607266%2Chep-ph%2F0607123%2Chep-ph%2F0607226%2Chep-ph%2F0607288%2Chep-ph%2F0607131%2Chep-ph%2F0607020%2Chep-ph%2F0607212%2Chep-ph%2F0607028%2Chep-ph%2F0607113%2Chep-ph%2F0607247%2Chep-ph%2F0607135%2Chep-ph%2F0607332%2Chep-ph%2F0607152%2Chep-ph%2F0607161%2Chep-ph%2F0607094%2Chep-ph%2F0607027%2Chep-ph%2F0607066%2Chep-ph%2F0607031%2Chep-ph%2F0607299%2Chep-ph%2F0607203%2Chep-ph%2F0607157%2Chep-ph%2F0607024%2Chep-ph%2F0607337%2Chep-ph%2F0607062%2Chep-ph%2F0607291%2Chep-ph%2F0607144%2Chep-ph%2F0607112%2Chep-ph%2F0607172%2Chep-ph%2F0607275%2Chep-ph%2F0607149%2Chep-ph%2F0607035%2Chep-ph%2F0607281%2Chep-ph%2F0607154%2Chep-ph%2F0607120%2Chep-ph%2F0607103%2Chep-ph%2F0607068%2Chep-ph%2F0607173%2Chep-ph%2F0607148%2Chep-ph%2F0607083%2Chep-ph%2F0607013%2Chep-ph%2F0607076%2Chep-ph%2F0607166%2Chep-ph%2F0607017%2Chep-ph%2F0607057%2Chep-ph%2F0607048%2Chep-ph%2F0607145%2Chep-ph%2F0607124%2Chep-ph%2F0607318%2Chep-ph%2F0607246%2Chep-ph%2F0607284%2Chep-ph%2F0607201%2Chep-ph%2F0607342%2Chep-ph%2F0607327%2Chep-ph%2F0607255%2Chep-ph%2F0607105%2Chep-ph%2F0607227%2Chep-ph%2F0607185%2Chep-ph%2F0607093%2Chep-ph%2F0607213%2Chep-ph%2F0607051%2Chep-ph%2F0607345%2Chep-ph%2F0607179%2Chep-ph%2F0607040%2Chep-ph%2F0607271%2Chep-ph%2F0607029%2Chep-ph%2F0607036%2Chep-ph%2F0607223%2Chep-ph%2F0607341%2Chep-ph%2F0607206%2Chep-ph%2F0607021%2Chep-ph%2F0607319%2Chep-ph%2F0607235%2Chep-ph%2F0607300%2Chep-ph%2F0607305%2Chep-ph%2F0607169%2Chep-ph%2F0607296%2Chep-ph%2F0607133%2Chep-ph%2F0607058%2Chep-ph%2F0607335%2Chep-ph%2F0607030%2Chep-ph%2F0607331%2Chep-ph%2F0607168%2Chep-ph%2F0607322%2Chep-ph%2F0607330%2Chep-ph%2F0607230%2Chep-ph%2F0607317%2Chep-ph%2F0607045%2Chep-ph%2F0607101%2Chep-ph%2F0607114&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A remark on the low mass dilepton yield in heavy ion collisions"}, "summary": "The recent data on the enhancement of the low mass dilepton yield in heavy\nion collisions are interpreted as an effect of the \"prolonged life\" of\nresonances in the hadron gas phase. The value of the enhancement factor gives\nan upper limit for the duration time of this phase.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0607095%2Chep-ph%2F0607262%2Chep-ph%2F0607023%2Chep-ph%2F0607238%2Chep-ph%2F0607239%2Chep-ph%2F0607047%2Chep-ph%2F0607241%2Chep-ph%2F0607085%2Chep-ph%2F0607334%2Chep-ph%2F0607155%2Chep-ph%2F0607129%2Chep-ph%2F0607261%2Chep-ph%2F0607266%2Chep-ph%2F0607123%2Chep-ph%2F0607226%2Chep-ph%2F0607288%2Chep-ph%2F0607131%2Chep-ph%2F0607020%2Chep-ph%2F0607212%2Chep-ph%2F0607028%2Chep-ph%2F0607113%2Chep-ph%2F0607247%2Chep-ph%2F0607135%2Chep-ph%2F0607332%2Chep-ph%2F0607152%2Chep-ph%2F0607161%2Chep-ph%2F0607094%2Chep-ph%2F0607027%2Chep-ph%2F0607066%2Chep-ph%2F0607031%2Chep-ph%2F0607299%2Chep-ph%2F0607203%2Chep-ph%2F0607157%2Chep-ph%2F0607024%2Chep-ph%2F0607337%2Chep-ph%2F0607062%2Chep-ph%2F0607291%2Chep-ph%2F0607144%2Chep-ph%2F0607112%2Chep-ph%2F0607172%2Chep-ph%2F0607275%2Chep-ph%2F0607149%2Chep-ph%2F0607035%2Chep-ph%2F0607281%2Chep-ph%2F0607154%2Chep-ph%2F0607120%2Chep-ph%2F0607103%2Chep-ph%2F0607068%2Chep-ph%2F0607173%2Chep-ph%2F0607148%2Chep-ph%2F0607083%2Chep-ph%2F0607013%2Chep-ph%2F0607076%2Chep-ph%2F0607166%2Chep-ph%2F0607017%2Chep-ph%2F0607057%2Chep-ph%2F0607048%2Chep-ph%2F0607145%2Chep-ph%2F0607124%2Chep-ph%2F0607318%2Chep-ph%2F0607246%2Chep-ph%2F0607284%2Chep-ph%2F0607201%2Chep-ph%2F0607342%2Chep-ph%2F0607327%2Chep-ph%2F0607255%2Chep-ph%2F0607105%2Chep-ph%2F0607227%2Chep-ph%2F0607185%2Chep-ph%2F0607093%2Chep-ph%2F0607213%2Chep-ph%2F0607051%2Chep-ph%2F0607345%2Chep-ph%2F0607179%2Chep-ph%2F0607040%2Chep-ph%2F0607271%2Chep-ph%2F0607029%2Chep-ph%2F0607036%2Chep-ph%2F0607223%2Chep-ph%2F0607341%2Chep-ph%2F0607206%2Chep-ph%2F0607021%2Chep-ph%2F0607319%2Chep-ph%2F0607235%2Chep-ph%2F0607300%2Chep-ph%2F0607305%2Chep-ph%2F0607169%2Chep-ph%2F0607296%2Chep-ph%2F0607133%2Chep-ph%2F0607058%2Chep-ph%2F0607335%2Chep-ph%2F0607030%2Chep-ph%2F0607331%2Chep-ph%2F0607168%2Chep-ph%2F0607322%2Chep-ph%2F0607330%2Chep-ph%2F0607230%2Chep-ph%2F0607317%2Chep-ph%2F0607045%2Chep-ph%2F0607101%2Chep-ph%2F0607114&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The recent data on the enhancement of the low mass dilepton yield in heavy\nion collisions are interpreted as an effect of the \"prolonged life\" of\nresonances in the hadron gas phase. The value of the enhancement factor gives\nan upper limit for the duration time of this phase."}, "authors": ["K. Fialkowski"], "author_detail": {"name": "K. Fialkowski"}, "author": "K. Fialkowski", "arxiv_comment": "Minor changes in text, one reference added. Version to be published\n  in the XXXVI ISMD proceedings, Brazilian Journal of Physics", "links": [{"href": "http://arxiv.org/abs/hep-ph/0607036v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-ph/0607036v3", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-ph/0607036v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-ph/0607036v3", "journal_reference": "Braz. J. Phys. 37, 788 (2007)", "doi": null, "fulltext": "arXiv:hep-ph/0607036v3 9 Feb 2007\n\nA remark on the low mass dilepton yield\nin heavy ion collisions1\n\nK. Fialkowski2\n\nM. Smoluchowski Institute of Physics, Jagellonian University,\n30-059 Kraków, ul.Reymonta 4, Poland\n\nAbstract\nThe recent data on the enhancement of the low mass dilepton yield in heavy\nion collisions are interpreted as an effect of the \"prolonged life\" of resonances in the\nhadron gas phase. The value of the enhancement factor gives an upper limit for the\nduration time of this phase.\n\nPACS: 25.75.-q\nKeywords: Heavy ion collisions, dileptons\n\n1\n\nPresented at the XXXVI ISMD, Paraty, Brasil, September 2-8, 2006,\nto be published in the conference proceedings in Brazilian Journal of Physics\n2\ne-mail address: uffialko@th.if.uj.edu.pl\n\n\f1\n\nIntroduction\n\nIn the last decade a lot of attention has been paid to the spectra of dileptons produced in\nheavy ion collisions. In particular, CERES data of 1995-1996 [1] were extensively analyzed\nand discussed both by the CERES collaboration (which released only recently the definite\nversion of their results [2]) and by many theorists [3]. Whereas the spectra from pBe and\npAu collisions agree satisfactorily with a \"decay cocktail\" Rc (m) (R calculated from the\nknown yield of various hadrons and their decay processes, dominated by ρ in the mass\nrange 0.6 − 0.9 GeV /c2 ), already the SAu collisions show a clear excess of dileptons with\nmasses in the range 0.2 − 0.8 GeV /c2 , and no clear peak at the ρ mass [2]. More recently,\nthe dimuon spectra from the In-In ion collisions were presented [4] from an experiment\nwhich collected thousand times as many events. However, these data are not normalized\nto the charged hadron spectra. The excess of dileptons was established assuming no excess\nfor the ω and φ peaks and the standard ratio ρ/ω ≃ 1.2 for the \"cocktail\" contribution. In\nthis note we suggest to use the dilepton results for a very simple test of basic assumptions\nconcerning the space-time development of particle production in heavy ion collisions.\nLet us remind first that many hadron-nucleus data are reasonably described if the\nprocess is treated in the first approximation as a superposition of nucleon-nucleon interactions (more precisely, an idea of \"wounded nucleons\" is used, where the number of\ninteracting - \"wounded\" - nucleons, and not the number of interactions, determines the\nmultiplicity) [5, 6]. This idea was also implemented successfully in the string-like MC\ngenerators [7]. On the other hand, nucleus-nucleus (heavy ion) collisions are known to\nproduce more particles, than the \"wounded nucleon model\" predicts, and many \"collective effects\" contradicting the superposition picture were found to exist [8]. There are\nmany proposals to cure this problem (\"wounded quarks\" [9], string interactions leading\nto \"color ropes\" [10] etc.), but no satisfactory global description of data in this framework\nwas presented.\nTherefore the different description is used, where the collision is supposed to produce\n(after some preliminary stages) a \"hadron gas\" expanding and cooling thermodynamically\n(in a chemical equilibrium?) until the \"freeze-out\" stage, from which hadrons flow freely to\nthe detectors (obviously subject to decays on their way) [11]. Both the transverse spectra\nand the relative hadron multiplicities were successfully described in this picture [12] as\nwell as many other data [13]. However, this fact cannot be regarded as disqualifying\ndefinitely a \"superposition\" picture, as it is possible to imitate \"thermal spectra\" of\ntransverse momenta by the string decays, when the string tension fluctuations are taken\ninto account [14] (in fact, similar spectra are seen for elementary collisions [15]). Also the\n\"chemical composition\" of hadrons may be explained similarly.\nIn the last decade the majority of physicists accepted the suggestion that the collision\nleads to a \"quark-gluon plasma formation\" [16] (possibly preceded by a \"color glass condensate\" state [17], whose interaction explains some features of the plasma state). The\nevolution of this plasma, ruled by the equations of QCD, leads eventually to the hadronization, possibly followed by a \"hadron gas\" phase before the \"freeze-out\". However, some\ncharacteristics of plasma survive in measured hadron quantities [18].\nDileptons belong to the small class of signals which may collect the contributions\nfrom all the stages of the process, since the lack of strong interactions allows them to\n1\n\n\fescape both from \"quark-gluon plasma\" and from \"hadron gas\", and, obviously, they\nmay result from the electromagnetic decays of hadrons on their way to detectors. In the\ncase of neutral pions, for which no competition from strong decays exists, this last process\nis certainly a dominant component, and the \"lowest mass\" dilepton spectrum is simply\nproportional to the number of final pions (and thus rather independent of the adopted\nassumptions on production process). This is, however, not the case for heavier mesons,\nfor which the branching ratios for the electromagnetic decays are small. In particular, the\ndileptons from ρ decay were investigated and their yield was found to depend crucially\non the process.\n\n2\n\nData and their interpretation\n\nThe data are usually shown as the ratio of the dilepton yield (as a function of dilepton\nmass) to the charged hadron yield for the same range of rapidity and transverse momentum\nR\n\nee\ndyd2pt dyddN\n2 p dm\nt\n\nR(m) = R\n\ndNch\ndyd2pt dyd\n2p\nt\n\n.\n\nAs already noted, the SAu CERES data show a clear excess of dileptons with masses\nin the range 0.2 − 0.8 GeV /c2 , and no clear peak at the ρ mass [2]. This contradicts the\n\"superposition\" scenario, unless very serious corrections are introduced.\nThe P bAu data for semi-central events (28%) [2] reinforce this conclusion. Below the\nmass of 0.2 GeV /c (where the π 0 decay dominates) the data agree well with the \"decay\ncocktail\" and the ratio of the integrated yields is compatible with one\nR=\n\nR 0.2\n0\n\nRP bAu (m)dm\n= 0.92 ± 0.17\nc\n0 R (m)dm\n\nR 0.2\n\nwith the error dominated by systematical effects.\nHowever, for the mass range between 0.2 and 0.9 GeV /c2 the ratio of integrated yields\nis significantly bigger than 1\nR=\n\nR 0.9\n\nP bAu\n(m)dm\n0.2 R\nR 0.9\nc\n0.2 R (m)dm\n\n≃ 2.5\n\n(with combined systematic and decay uncertainty of the order of 1). The excess seems to\ngrow with centrality. Again, no clear peak at the ρ mass is visible. The data for transverse\npair momenta below 0.5 GeV /c are obviously similar to the spectra integrated over full\npt range (which they dominate); for higher pt the shape is more similar to the \"cocktail\"\ncurve, but the enhancement factor for the yield integrated over all the 0.3 − 0.9 GeV /c2\nmass range does not depend visibly on pt .\nThese results are interpreted by the CERES group [2] as an evidence for two effects.\n\"Medium-modification\" of the ρ spectral function is responsible for the disappearance of\nthe peak at ρ mass. The enhancement of the global dilepton yield is interpreted as due to\nthe binary ππ (or qq) annihilation processes (growing faster than linearly with the pion\ndensity).\n2\n\n\fWe agree that the strong change of shape of the mass spectrum suggests the need of\nsome modification of the ρ contribution (mass decrease and/or width increase). However,\nwe would like to point out that there is an obvious reason for the enhancement of the\nglobal yield other than the \"binary annihilation processes\".\nThis reason is the very existence of \"chemical equilibrium\" phase, where the ratio of\nρ/π is governed by the temperature and thus strong decays of ρ are effectively balanced\nby the formation of ρ in the ππ collisions. If for the freely decaying ρ the branching ratio\nfor decay into dielectrons is about 5 * 10−5, the number of electromagnetic decays from the\nρ \"forced to live longer\" will be obviously higher. In the first approximation, one expects\nin this mass range the enhancement factor\nR = t/τ,\nwhere t is the lifetime of \"hadronic gas\" phase, and τ the free ρ lifetime (τ ≃ 1f m/c). In\nfact, an effective Lorentz factor should be included here, but for the central rapidity bin\nits value is not much different from one.\nThe remark equivalent to the relation proposed above was made recently by Renk and\nRuppert [19], who argue that the dilepton data may be successfully described and used\nto discriminate between various models of \"in-medium modifications of vector mesons\".\nHowever, we are convinced that simple relation may be useful without invoking any specific\nmodel.\nObviously, our reasoning is rather simplistic. The spectral function is modified strongly\nin the hadron gas phase. If the ρ mass is reduced and/or its shape changed \"in-medium\",\nthe branching ratio for electromagnetic decay may be also changed; the ρ/π ratio should\nnot be constant, but rather decrease with decreasing temperature during the evolution of\n\"hadron gas\" phase. However, we feel that the suggested value of t ≃ 2.5 f m/c (much\nsmaller than the global lifetime of the \"fireball\" measured by Bose-Einstein interference\neffects) is rather intriguing.\nLet us stress here once more that we discuss only the dilepton yield integrated over\nrather wide mass range, and not the shape. Thus the detailed changes of the spectral\nfunction are irrelevant for our argument. We compare just the dilepton yield (proportional to the four dimensional volume) and the hadron yield (proportional to the three\ndimensional volume), thus estimating the life time of the hadron gas phase.\nIf the significant part of the observed dilepton spectra originates from the \"binary\nannihilation processes\", as suggested in [2], the value of t should be even smaller, since\nobviously\nAA\nAA\nRAA (m) = Rhg\n(m) + Rann\n(m)\nand thus\n\nAA\nRhg\nRAA\nt\n=\n<\n≃ 2.5.\nτ\nRc\nRc\nThe moderate value of the \"enhancement factor\" makes the statement about the rejection of \"superposition scenario\" less categorical. One may imagine that some coalescence\nof \"color strings\" into \"color ropes\" characterized by larger transverse dimensions, higher\nstring tension and its fluctuations may lead to the states quite similar to the \"hadron gas\nphase\" (and/or \"quark gluon plasma phase\"). Their lifetime may be easily of the order\nof few f m/c, but still much shorter than the global time of the hadroproduction process.\n\n3\n\n\fIn the high statistics NA60 experiment [4] a similar value of the enhancement factor\n(increasing with centrality from ≃ 1.5 to 4) was found. The new data suggest, however,\nthat the ρ peak is broadened rather than moved to lower mass values in comparison to\nthe free ρ decay.\nThe NA60 analysis agrees qualitatively with the naive expectations from the \"hadron\ngas enhancement effect\". If the duration time of hadron gas phase is of the order of few\nfm/c, the enhancement of the ω contribution is very mild, and for the φ, η or η ′ completely\nnegligible, as the lifetimes of these particles are much longer (however, the annihilation\nprocesses contribute significantly for higher masses increasing the experimental value of\nR). Thus the NA60 data seem to support our suggestions that the main reason of the\nenhancement of the dilepton yield in the ρ mass region is the \"extended lifetime\" of ρ.\n\n3\n\nComments and conclusions\n\nOur suggestion tells nothing about the \"quark-gluon plasma phase\", if it does not contribute dominantly to the low mass dilepton production. However, the small lifetime of\n\"hadron gas\" phase suggests that the plasma phase (and possibly other state) is likely to\nprecede it.\nAn intriguing difference between the spectra for dilepton transverse momenta belowand above 0.5 GeV /c (qualitatively explained within the formalism of the \"in-medium\nmodification\" [2]) does not extend, as noted above, to the integrated yield. The \"enhancement factors\" for the full mass range are nearly the same in both cases. Thus no\nsignificant difference between the freeze-out times for two ranges of pt is suggested. The\nNA60 data, on the other hand, imply a stronger pt dependence of the enhancement factor.\nSummarizing, we suggest that main reason for the enhancement of the ratio of the\nnumber of the low mass dilepton pairs to the charged hadron density for heavy ion collisions is just the existence of the \"hadron gas phase\" in which there is a chemical equilibrium between pions and heavier mesons. However, the observed moderate value of the\n\"enhancement factor\" leads to the conclusion that this phase is rather short-lived. A detailed quantitative analysis of this problem may be very helpful for the proper description\nof the space-time development of the hadroproduction processes in heavy ion collisions.\nAcknowledgements\nI would like to thank Romek Wit, Andrzej Kotanski and in particular Andrzej Bialas\nfor reading the manuscript and helpful remarks. I am grateful to Torsten Renk and Sanja\nDamjanovic for bringing to my attention refs.[19] and [4], respectively. Critical remarks\nof Ralf Rapp are gratefully acknowledged. This work has been partly supported by the\nPolish Ministry of Education and Science grant 1P03B 045 29 (2005-2008).\n\nReferences\n[1] G. Agakichiev et al., CERES Collaboration, Phys. Rev. Lett. 75, 1272 (1995); P.\nWurm, CERES Collaboration, Nucl. Phys. A590, 103c (1995).\n[2] G. Agakichiev et al., CERES Collaboration, e-print nucl-ex/0506002 v1.\n4\n\n\f[3] E.g. G.E. Brown and M. Rho, Phys. Rev. Lett. 66, 2720 (1991), Phys. Repts. 363,\n85 (2002); R. Rapp and J. Wambach, Adv. Nucl. Phys. 25, 1 (2000). An extensive\nbibliography is listed in the previous reference.\n[4] R. Arnaldi et al, NA60 Collaboration, Phys. Rev. Lett. 96, 162302 (2006).\n[5] A. Bialas, M. Bleszynski and W. Czyz, Nucl. Phys. B111, 461 (1976).\n[6] For a recent applicationa see e.g. A. Bialas and W. Czyz, Acta Phys. Pol. B36, 905\n(2005).\n[7] B. Andersson, The Lund model, Cambridge Univ. Press, Cambridge 1998.\n[8] E.g. G. Roland, Acta Phys. Pol. B34, 5751 (2003).\n[9] A. Bialas, L. Lesniak and W. Czyz, Phys. Rev. D25, 2328 (1982); for a recent\napplication see e.g. R. Nouicer, Proc. of the XXXV ISMD, V. Simak et al., Eds.,\nAIP Conf. Proceedings 828, 11 (2006).\n[10] T.S. Biro, H.B. Nielsen and J. Knoll, Nucl. Phys. B245, 449 (1984); H. Sorge, Phys.\nRev. C52, 3291 (1995).\n[11] R. Hagedorn, Nuovo Cim. Suppl. 3, 147 (1965); F. Cooper and G. Frye, Phys. Rev.\n10D, 1186 (1974).\n[12] E.g. W. Broniowski and W. Florkowski, Phys. Rev. Lett. 87, 272302 (2002); Phys.\nRev. C65, 024905 (2002).\n[13] For a recent review see e.g. P. Huovinen and P.V. Ruuskanen, Annu. Rev. Nucl.\nParticle Science 56, 163 (2006).\n[14] A. Bialas, Phys. Lett. B466, 301 (1999)\n[15] See e.g. F. Becattini and G. Passaleva, Eur. Phys. J., C23, 551 (2002).\n[16] E.g. E.V. Shuryak, Phys. Rep., 61, 71 (1980).\n[17] E. Iancu, A. Leonidov and L.D. McLerran, Nucl. Phys. A692, 553 (2001).\n[18] E.g. J.P. Blaizot, Nucl. Phys. A661, 3 (1999).\n[19] T. Renk and J. Ruppert, What the NA60 dilepton data can tell, e-print hepph/0605130.\n\n5\n\n\f"}