{"id": "http://arxiv.org/abs/hep-ph/0001027v1", "guidislink": true, "updated": "2000-01-04T16:48:37Z", "updated_parsed": [2000, 1, 4, 16, 48, 37, 1, 4, 0], "published": "2000-01-04T16:48:37Z", "published_parsed": [2000, 1, 4, 16, 48, 37, 1, 4, 0], "title": "Atmospheric Neutrino Flux: A Review of Calculations", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0001191%2Chep-ph%2F0001107%2Chep-ph%2F0001024%2Chep-ph%2F0001062%2Chep-ph%2F0001205%2Chep-ph%2F0001045%2Chep-ph%2F0001124%2Chep-ph%2F0001306%2Chep-ph%2F0001208%2Chep-ph%2F0001237%2Chep-ph%2F0001251%2Chep-ph%2F0001238%2Chep-ph%2F0001174%2Chep-ph%2F0001178%2Chep-ph%2F0001130%2Chep-ph%2F0001155%2Chep-ph%2F0001032%2Chep-ph%2F0001198%2Chep-ph%2F0001222%2Chep-ph%2F0001002%2Chep-ph%2F0001203%2Chep-ph%2F0001188%2Chep-ph%2F0001245%2Chep-ph%2F0001008%2Chep-ph%2F0001080%2Chep-ph%2F0001148%2Chep-ph%2F0001276%2Chep-ph%2F0001255%2Chep-ph%2F0001189%2Chep-ph%2F0001229%2Chep-ph%2F0001156%2Chep-ph%2F0001274%2Chep-ph%2F0001006%2Chep-ph%2F0001065%2Chep-ph%2F0001109%2Chep-ph%2F0001200%2Chep-ph%2F0001022%2Chep-ph%2F0001199%2Chep-ph%2F0001225%2Chep-ph%2F0001010%2Chep-ph%2F0001254%2Chep-ph%2F0001134%2Chep-ph%2F0001144%2Chep-ph%2F0001039%2Chep-ph%2F0001228%2Chep-ph%2F0001027%2Chep-ph%2F0001294%2Chep-ph%2F0001179%2Chep-ph%2F0001313%2Chep-ph%2F0001128%2Chep-ph%2F0001312%2Chep-ph%2F0001252%2Chep-ph%2F0001236%2Chep-ph%2F0001210%2Chep-ph%2F0001102%2Chep-ph%2F0001159%2Chep-ph%2F0001020%2Chep-ph%2F0001257%2Chep-ph%2F0001293%2Chep-ph%2F0001284%2Chep-ph%2F0001269%2Chep-ph%2F0001177%2Chep-ph%2F0001095%2Chep-ph%2F0001131%2Chep-ph%2F0001285%2Chep-ph%2F0001206%2Chep-ph%2F0001160%2Chep-ph%2F0001248%2Chep-ph%2F0001015%2Chep-ph%2F0001154%2Chep-ph%2F0001110%2Chep-ph%2F0001297%2Chep-ph%2F0001217%2Chep-ph%2F0001013%2Chep-ph%2F0001126%2Chep-ph%2F0001332%2Chep-ph%2F0001324%2Chep-ph%2F0001019%2Chep-ph%2F0001132%2Chep-ph%2F0001232%2Chep-ph%2F0001071%2Chep-ph%2F0001211%2Chep-ph%2F0001302%2Chep-ph%2F0001278%2Chep-ph%2F0001275%2Chep-ph%2F0001327%2Chep-ph%2F0001141%2Chep-ph%2F0001212%2Chep-ph%2F0001272%2Chep-ph%2F0001259%2Chep-ph%2F0001168%2Chep-ph%2F0001028%2Chep-ph%2F0001117%2Chep-ph%2F0001115%2Chep-ph%2F0001049%2Chep-ph%2F0001075%2Chep-ph%2F0001140%2Chep-ph%2F0001185%2Chep-ph%2F0001108%2Chep-ph%2F0001029%2Chep-ph%2F0001104&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Atmospheric Neutrino Flux: A Review of Calculations"}, "summary": "Interpretation and understanding of the evidence for neutrino oscillations\ndepends on knowledge of the atmospheric neutrino beam. In this talk I assess\nhow well various features are known. The goal is to determine to what extent\nuncertainties in the neutrino beam may limit the conclusions about neutrino\nproperties and which features of the evidence for neutrino oscillations are\nmost robust.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0001191%2Chep-ph%2F0001107%2Chep-ph%2F0001024%2Chep-ph%2F0001062%2Chep-ph%2F0001205%2Chep-ph%2F0001045%2Chep-ph%2F0001124%2Chep-ph%2F0001306%2Chep-ph%2F0001208%2Chep-ph%2F0001237%2Chep-ph%2F0001251%2Chep-ph%2F0001238%2Chep-ph%2F0001174%2Chep-ph%2F0001178%2Chep-ph%2F0001130%2Chep-ph%2F0001155%2Chep-ph%2F0001032%2Chep-ph%2F0001198%2Chep-ph%2F0001222%2Chep-ph%2F0001002%2Chep-ph%2F0001203%2Chep-ph%2F0001188%2Chep-ph%2F0001245%2Chep-ph%2F0001008%2Chep-ph%2F0001080%2Chep-ph%2F0001148%2Chep-ph%2F0001276%2Chep-ph%2F0001255%2Chep-ph%2F0001189%2Chep-ph%2F0001229%2Chep-ph%2F0001156%2Chep-ph%2F0001274%2Chep-ph%2F0001006%2Chep-ph%2F0001065%2Chep-ph%2F0001109%2Chep-ph%2F0001200%2Chep-ph%2F0001022%2Chep-ph%2F0001199%2Chep-ph%2F0001225%2Chep-ph%2F0001010%2Chep-ph%2F0001254%2Chep-ph%2F0001134%2Chep-ph%2F0001144%2Chep-ph%2F0001039%2Chep-ph%2F0001228%2Chep-ph%2F0001027%2Chep-ph%2F0001294%2Chep-ph%2F0001179%2Chep-ph%2F0001313%2Chep-ph%2F0001128%2Chep-ph%2F0001312%2Chep-ph%2F0001252%2Chep-ph%2F0001236%2Chep-ph%2F0001210%2Chep-ph%2F0001102%2Chep-ph%2F0001159%2Chep-ph%2F0001020%2Chep-ph%2F0001257%2Chep-ph%2F0001293%2Chep-ph%2F0001284%2Chep-ph%2F0001269%2Chep-ph%2F0001177%2Chep-ph%2F0001095%2Chep-ph%2F0001131%2Chep-ph%2F0001285%2Chep-ph%2F0001206%2Chep-ph%2F0001160%2Chep-ph%2F0001248%2Chep-ph%2F0001015%2Chep-ph%2F0001154%2Chep-ph%2F0001110%2Chep-ph%2F0001297%2Chep-ph%2F0001217%2Chep-ph%2F0001013%2Chep-ph%2F0001126%2Chep-ph%2F0001332%2Chep-ph%2F0001324%2Chep-ph%2F0001019%2Chep-ph%2F0001132%2Chep-ph%2F0001232%2Chep-ph%2F0001071%2Chep-ph%2F0001211%2Chep-ph%2F0001302%2Chep-ph%2F0001278%2Chep-ph%2F0001275%2Chep-ph%2F0001327%2Chep-ph%2F0001141%2Chep-ph%2F0001212%2Chep-ph%2F0001272%2Chep-ph%2F0001259%2Chep-ph%2F0001168%2Chep-ph%2F0001028%2Chep-ph%2F0001117%2Chep-ph%2F0001115%2Chep-ph%2F0001049%2Chep-ph%2F0001075%2Chep-ph%2F0001140%2Chep-ph%2F0001185%2Chep-ph%2F0001108%2Chep-ph%2F0001029%2Chep-ph%2F0001104&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Interpretation and understanding of the evidence for neutrino oscillations\ndepends on knowledge of the atmospheric neutrino beam. In this talk I assess\nhow well various features are known. The goal is to determine to what extent\nuncertainties in the neutrino beam may limit the conclusions about neutrino\nproperties and which features of the evidence for neutrino oscillations are\nmost robust."}, "authors": ["T. K. Gaisser"], "author_detail": {"name": "T. K. Gaisser"}, "author": "T. K. Gaisser", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/S0920-5632(00)00654-X", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/hep-ph/0001027v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-ph/0001027v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "7 pages, 4 figures, submitted to TAUP99", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-ph/0001027v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-ph/0001027v1", "journal_reference": "Nucl.Phys.Proc.Suppl.87:145-151,2000", "doi": "10.1016/S0920-5632(00)00654-X", "fulltext": "1\n\nAtmospheric Neutrino Flux: A Review of Calculations\nT.K. Gaissera∗\na\n\narXiv:hep-ph/0001027v1 4 Jan 2000\n\nBartol Research Institute, University of Delaware,\nNewark, DE 19716, USA\nInterpretation and understanding of the evidence for neutrino oscillations depends on knowledge of the atmospheric neutrino beam. In this talk I assess how well various features are known. The goal is to determine to\nwhat extent uncertainties in the neutrino beam may limit the conclusions about neutrino properties and which\nfeatures of the evidence for neutrino oscillations are most robust.\n\n1. Introduction\nThe concept of using the atmospheric neutrino\nbeam to look for neutrino oscillations is illustrated in Fig. 1 [1]. With a single detector it is\npossible simultaneously to cover a range of pathlengths from ∼ 10 to ∼ 104 km, corresponding respectively to downward moving and upward moving neutrinos. The atmospheric neutrino beam\nhas an energy spectrum determined by the steeply\nfalling primary cosmic-ray spectrum, which generates the neutrinos by interactions of the cosmic\nray nucleons in the atmosphere. Examples of calculated neutrino fluxes are shown in Fig. 2.\nThe neutrino spectrum, which falls with energy, must be folded with the rising neutrino cross\nsection to obtain the expected event rate as a\nfunction of neutrino energy. Most neutrino interactions are in the range from a few hundred\nMeV to a few tens of GeV. Thus atmospheric\nneutrinos have the potential to probe the range\n1 < L/E < 3 × 104 km/GeV. From the standard\ntwo-flavor oscillation equation,\n\u0015\n\u0014\n2\n2\n2\n2 Lkm\n, (1)\nPνμ νμ = 1 − sin 2θ sin 1.27δm (eV )\nEGeV\nwe find, therefore, that the atmospheric neutrino\nbeam can in principle probe down to δm2 as small\nas ∼ 2 × 10−5 eV2 . (The actual lower limit to\nsensitivity in δm2 is somewhat higher than this\nbecause of the relatively large scattering angle be∗ Research\n\nsupported in part by the U.S. Department of\nEnergy under Grant No. DE-FG02-91ER40626\n\ntween neutrino and lepton in charged current interactions of low energy neutrinos.)\nAtmospheric neutrinos originate with the π →\nμ → e decay chain. Therefore at sufficiently low\nenergy such that muons as well as pions decay,\none expects\n1\nνe + ν̄e\n≈ .\nνμ + ν̄μ\n2\n\n(2)\n\nThe anomalous value of this ratio[2–5] (for which\nmany sources of uncertainty cancel in the calculations) suggests neutrino oscillations involving νμ and/or νe as a possible explanation. The\ntelltale evidence [6] for oscillations as the source\nof this anomaly comes from the pathlength dependence of the neutrino fluxes. The energydependence of the up-down asymmetry for muonlike events, coupled with the fact that events initiated by electron neutrinos appear to have the\nexpected energy and angular dependence, indicates that the primary effect is oscillations involving muon neutrinos with large mixing and\nδm2 ≈ 3 × 10−3 eV2 [6].\nIn the remainder of this paper I will describe\nhow the geomagnetic field affects the interpretation of the atmospheric neutrino data, review\nthe primary cosmic-ray spectrum, discuss the uncertainties in the treatment of pion production\nand mention the comparison of the calculations to\nmeasurements of muons high in the atmosphere.\nIt is important to review these points at this time\nbecause of the recent publication of two new calculations [7,8], which are three-dimensional, as\ncompared to previous one-dimensional calcula-\n\n\f2\n\nE d Nν/dEν\n\n-2 -1\n\n(cm s )\n\nNeutrino Fluxes (integrated over angle, no cutoff)\n10\nBartol, νμ\nFLUKA, νμ\nBartol, νe\nFLUKA, νe\n1\n\n0.1\n\n0.01\n0.1\nEν\n\n1\n(GeV)\n\n10\n\nFigure 2. Fluxes of atmospheric neutrinos from\ntwo calculations: FLUKA [7], dashed; Bartol [24],\nsolid.\n\nFigure 1. Illustration of up-down symmetry of\natmospheric neutrinos in the absence of effects\nof the geomagnetic field and assuming no oscillations.\n\ntions.\n2. Geomagnetic field effects\nIn the absence of oscillations, the only significant deviation from isotropy of the atmospheric\nneutrino beam is caused by the geomagnetic field,\nwhich prevents low energy primary cosmic rays\nfrom reaching the atmosphere at low geomagnetic\nlatitudes. For example, at Kamioka the geomagnetic cutoff is ≈ 10 GeV for primary protons\nnear the vertical. The downward neutrino flux\nat Kamioka is therefore lower than, for example, at Soudan, where the vertical cutoff is negligible. Approximately half the downward neu-\n\ntrinos with Eν < 1 GeV at Soudan come from\nprimary protons with E < 10 GeV. This contribution is absent from the downward neutrino\nflux at Kamiokande. As a consequence the downward flux of sub-GeV neutrinos at Kamiokande\nis roughly half that at Soudan. The neutrino flux\nfrom the lower hemisphere is similar at the two\ndetectors and intermediate between the downward fluxes at the two locations. This is because\nthe neutrinos from below are produced over a\nlarge fraction of the Earth's surface and so average over a range of high and low geomagnetic\ncutoffs. Thus the up-down asymmetry at each detector location is a combination of geomagnetic\neffects together with the effects of any oscillations that may be present, and the combination\ndepends on detector location. Moreover, the geomagnetic effects become less important as energy\nincreases. It is therefore useful to start by considering the atmospheric neutrino analysis without\nthe geomagnetic field.\nFor a flux of primary cosmic rays that is spa-\n\n\f3\n\nsub\nGeV\n\n4\n\n(3)\n\ndepends only on local zenith angle, θ, and altitude, h. In these circumstances one can show\nfrom the geometrical construction of Fig. 1, that\nthe neutrino flux is up-down symmetric; i.e. symmetric about cos θ ↔ − cos θ. Since neutrinos\nfrom decay of pions, muons and other secondary\ncosmic rays are produced over a range of altitudes\npeaking around 15 to 20 km above sea level [9],\nit follows that local variations in surface altitude\nintroduce a negligible deviation from this symmetry. The symmetry also requires that differences\ncaused by local variations of pressure are negligible.\nA detector like Super-Kamiokande has an acceptance that is up-down symmetric. In the absence of geomagnetic effects, therefore, a simple measurement of the up-down asymmetry as\na function of energy is a probe of neutrinos oscillations. Therefore the simplest and most robust\nevidence for oscillations is a deviation from updown symmetry in an energy range high enough\nso geomagnetic effects are small. Fig. 3 [10]\nshows the distribution of neutrino energy for four\nclasses of neutrino interactions. The corresponding distributions in energy per nucleon for the\nprimary cosmic-rays are about a factor of ten\nhigher. Thus the median primary of the multiGeV events is about 50 GeV/nucleon, which is\nhigh enough so that geomagnetic effects are unimportant. Neutrino-induced upward muons provide a higher energy sample, but it is not possible to make a simple up-down comparison because the downward muon flux is dominated by\nmuons produced from pion decay in the atmosphere rather than by interactions of neutrinos.\nInterpreting the up-down asymmetry of the\nneutrino fluxes in the GeV range and below requires that the geomagnetic effects be well understood. Geomagnetic effects on the primary cos-\n\ndN/dlnE, (Kt.yr) -1\n\ndNν\nS(θ, h) =\n,\ndΩ dV\n\n0.015\n\n5\n\nthrough-going\nmuons\n\nmulti\nGeV\n\n0.01\n3\n\n2\n0.005\n\nstopping\nmuons\n\n1\n\n0\n\n10 -1\n\n10 0\n\n10 1\n\n10 2\n\n10 3\n\n10 4\n\n0\n\n10 5\n\nE ν , GeV\n\nFigure 3. Distribution of neutrino energies for\nvarious classes of atmospheric neutrino events.\n\nmic radiation are indeed very well understood.\nThey form the basis for an entire subfield of\ncosmic-ray physics [11]. Low energy particles\n(few GeV) at low geomagnetic latitudes cannot\nreach the atmosphere to interact. Particles of intermediate energy (∼ 10 to 20 GeV) that reach\nthe atmosphere show a strong east-west asymmetry, while high energy particles (∼ 100 GeV and\nhigher) are essentially unaffected by the geomagnetic field.\nThe east-west effect is a consequence of bending of positive primaries in the geomagnetic field.\nIn fact, it was the observation of the excess of\nprimary cosmic rays from the west [12,13] from\nwhich it could be deduced that the primaries were\npredominantly positively charged. The expected\nazimuthal dependence of the neutrino flux associated with the east-west effect is the same whether\nor not the neutrinos oscillate because the distribution of pathlengths that contribute to a particular zenith angle band is independent of azimuth. Comparison between expected and observed azimuthal distributions is therefore a good\ncheck of the systematics of the whole chain of data\nanalysis and calculations [14]. The measurements\n\n(m 2 .yr.ster) -1\n\ntially isotropic, the atmosphere is a spherical shell\nsource of neutrinos with equal luminosity per unit\nvolume independent of latitude and longitude.\nThe number of neutrinos produced per unit volume of atmosphere into solid angle dΩ,\n\n\f4\nshow the expected azimuthal dependence for both\nmuon and electron neutrinos [15], indicating that\nthe geomagnetic effects are well understood.\n\nin Fig. 4.\n\n3. Primary spectrum\n\n(m-2sr-1s-1GeV-1)\n\n10\n\nDifferential spectrum\n\nA standard procedure for calculating the flux of\natmospheric neutrinos is to generate atmospheric\ncascades for a spectrum of primary protons and\nnuclei and form the neutrino spectra in the absence of the geomagnetic fields. The resulting\nneutrino spectra can be filtered through the geomagnetic configuration relevant for a particular\ndetector location, discarding those neutrinos produced by primaries that would not have reached\nthe atmosphere. An alternative approach [16]\nstarts from the measured muon fluxes high in the\natmosphere and uses the genetic relation between\nneutrinos and muons to obtain the muon spectrum. In either case, the normalization of the\nneutrino flux depends on the absolute normalization of a measured spectrum of charged particles\n(either the primary cosmic rays or the muons).\nThe advantage of starting with the muons is that\none bypasses uncertainties in knowledge of pion\nproduction, which have a similar effect on both\nneutrinos and muons. A disadvantage is that\nthe acceptance for muons is sensitive to details\nof propagation in the geomagnetic field. In addition, the measurements of the primary flux are\nmade with relatively long exposures at or above\nthe atmosphere while the relevant muon measurements are generally made during a short balloon\nascent.\nThe mixture of nuclei in the primary spectrum\nis such that approximately 80% of nucleons in\nthe cosmic radiation are free protons, 15% are\nbound in alpha particles and the remainder are\nin heavier nuclei. Spectra of protons and helium with E < 100 GeV/nucleon have been measured at the top of the atmosphere in a series\nof balloon-borne spectrometer experiments. Recent measurements [17–21] cluster around a lower\nnormalization [22] than an earlier standard reference [23]. At higher energy, measurements have\nso far been possible only with calorimeters, which,\nbecause of punchthrough, may have larger systematic uncertainties. The data are summarized\n\nPrimary proton spectra\n3\n\nCAPRICE [17]\nMASS91 [18]\nAMS [19]\nIMAX [20]\nBESS98 [21]\nLEAP [22]\nWebber [23]\n\n102\n\n101\n\n100\n\n10-1\n\n10-2\n\n1\n\n10\nEkinetic\n\n100\n(GeV)\n\nFigure 4. Primary spectra.\n\n4. Comparison of calculations\nThere are now five independent calculations of\nthe neutrino spectrum that start from the primary cosmic-ray spectrum filtered by the geomagnetic field. The calculations of Refs. [24–\n26] are one-dimensional, assigning all produced\nneutrinos the directions of the primary particle\nthat produced them. The ingredients of these\ncalculations have been compared previously [27].\nRecently two three-dimensional calculations have\n\n\f5\nbeen published [7,8]. Treatment of the geomagnetic cutoffs, which now depend on 4 variables\ninstead of 2, makes the calculation significantly\nmore complex. These calculations are very important because they check the major, technical\nsimplifying assumption made by the previous calculations.\nA conclusion reported in Ref. [7] is that differences for predicted event rates and how they\ndepend on direction and energy are relatively\nsmall between one-dimensional and three dimensional versions of the same calculation. This has\nthe important consequence that the simpler onedimensional calculations can be used to explore\nthe consequences of uncertainties in input to the\ncalculations. Fig. 2 compares the Bartol neutrino\nflux [24] with the 3-dimensional flux of Ref. [7].\nBoth calculations use the primary spectrum of\nRef. [24], and the geomagnetic field has been\nturned off. Most of the difference, therefore, is\npresumed to be caused by differences in the treatment of pion production.\n5. Pion production\nMost pions with E < 100 GeV in the atmosphere decay before they interact. Therefore, for\nneutrinos in the sub- and multi-GeV range, only\ninteractions of protons and helium play a significant role. The most important information\nneeded about these interactions is the inclusive\ncross sections for pion production. The important range of interaction energies extends up to\n∼ 100 GeV for sub-GeV and ∼ 1 TeV for multiGeV interactions. The most probable energy of a\nprimary proton for a sub-GeV event at Super-K is\n≈ 20 GeV. The corresponding number at Soudan\nis about 10 GeV because of the lower geomagnetic\ncutoff. The parent energies for multi-GeV events\nare correspondingly higher. The distributions of\nsecondary nucleons is also important because a\nsignificant fraction of the neutrino production occurs in secondary or tertiary interactions of the\nnucleons. Neutral pions (and η mesons) are also\nimportant in the sense that energy deposited in\nthe electromagnetic part of the cascade is not\navailable for production of neutrinos. Distributions of kaons begin to be important for multi-\n\nGeV events (and they are dominant for neutrinoinduced upward muons [24]).\nData on pion production have been discussed\nrecently in Ref. [10]. Existing measurements\ncover a significant fraction, but not all, of the\nrelevant range of phase space for charged pion\nproduction in proton collisions on beryllium and\naluminum. New, more precise measurements covering all phase for proton interactions on a range\nof light nuclei (including nitrogen and oxygen)\nwould be of great interest. Use of a helium beam\nwould also be of interest.\nThe difference between the neutrino calculations shown in Fig. 2 most probably mainly reflects a difference in the fraction of energy going\ninto production of charged pions. The calculation of Ref. [24] uses a phenomenological hadronic\nevent generator (TARGET) developed for cosmicray cascade calculations. FLUKA [30] uses a\nmore sophisticated microscopic model of particle\nproduction with intranuclear cascading. It incorporates the event generator as an integral part\nof a cascade code capable of simulating interactions and cascades in complex detector geometries. The philosophies are quite different. The\nFLUKA interaction model is tested and adjusted\nby comparing directly to double differential cross\nsections for a wide range of data sets as measured\n(e.g. Eπ\n\ndNπ (Ep )\n).\ndpL d2 pT\n\nThe strategy with TARGET is to fit pT distributions at each longitudinal momentum, pL , extrapolate into unmeasured regions of phase space at\neach pL , and integrate to obtain the energy flow\ninto each secondary channel,\nEπ\n\ndNπ (Ep )\n.\ndEπ\n\nA detailed investigation of the sources of difference between these two models and others [25],\nand their implications, is currently in progress.\n6. Comparison to atmospheric muons\nMost muons and neutrinos are produced between 10 and 30 kilometer altitudes [9] in closely\nrelated processes. Measurements of muons at\n\n\f6\nthese altitudes therefore in principle provide a\ncheck of the neutrino calculations in which the uncertainties in pion production cancel to the extent\nthat they are common to both the neutrinos and\nthe muons. Recently there have been several comprehensive measurements of muons during ascent\nof balloon payloads [18,28,29], and some discrepancies with calculations have been noted. Generally, the agreement is best at float altitude, where\nonly the first interaction plays a role. An important limitation to the use of muons to normalize the neutrinos, however, is that the muons\nare more sensitive to details of the calculation.\nFor example, since most muons decay in flight,\na change in interaction lengths, which moves the\ncascade up or down, can change the muon flux at\na particular altitude without changing the corresponding neutrino flux, which is an integral\nover the whole atmosphere. Since muons follow\ncurved trajectories in the geomagnetic field, approximating by straight lines can have a similar\neffect (by moving the muon decays lower in the\natmosphere). In addition, since positive and negative muons have opposite curvature [31] their response to cutoffs of the primary cosmic radiation\nare somewhat different. Three-dimensional calculations of atmospheric muons are in progress. [32].\n7. Summary\n• The observed pathlength dependence of the\nmuon-like events in Super-Kamiokande [6]\npoints to neutrino oscillations as the source\nof the atmospheric neutrino anomaly.\n• Three-dimensional calculations of the atmospheric neutrino flux remove an important\napproximation present in previous calculations. It appears, however, that the simpler one-dimensional calculations are adequate for exploring differences among calculations.\n• Uncertainty in the normalization of the primary spectrum is now reduced to ≈ ±15%,\nso the main remaining source of uncertainty\nis the representation of pion production.\n• If the neutrino flux is significantly lower\n\nthan calculated in Refs. [24] and [25], then\nthere is a potential problem accounting for\nthe relatively large number of electron-like\nevents seen in SuperKamiokande within a\npredominantly νμ ↔ ντ oscillation scheme.\n• New measurements of atmospheric muons\nare being considered in airplanes and with\nslow balloon ascents.\n• Uncertainties in expected event rates due to\nthe imprecise knowledge of neutrino cross\nsections in the GeV energy range have not\nbeen discussed here, but may be important. [33]\nAcknowledgments. I am grateful to Todor\nStanev and Ralph Engel for collaboration on\nthis work and to Todor Stanev for reading the\nmanuscript. I thank Giuseppe Battistoni and Alfredo Ferrari for providing information about the\ncalculation of Ref. [7]. I also thank John Ellis and\nAlvaro De Rujula for hospitality during \"Neutrino Summer\" at CERN where I began work on\nthis talk.\nREFERENCES\n1. D. Ayres et al., Phys. Rev. D29 (1984) 902.\n2. R. Becker-Szendy et al. (IMB Collaboration),\nPhys. Rev. D46 (1992) 3720 and references\ntherein.\n3. Y. Fukuda al. (Kamiokande Collaboration)\nPhys. Lett. B335 (1994) 237 and references\ntherein.\n4. W.W.M. Allison et al. (Soudan Collaboration), Phys. Lett. B391 (1997) 491.\n5. Y. Fukuda et al., Phys. Lett. B433 (1998) 9\n(sub-GeV) and B436 (1998) 33 (multi-GeV).\n6. Y. Fukuda et al., (Super-Kamiokande Collaboration) Phys. Rev. Letters 81 (1998) 1562.\nSee also Kate Scholberg in Proc. 8th Int.\nWorkshop on Neutrino Telescopes (ed. Milla\nBaldo Ceolin, 1999) p. 183 and M. Nakahata,\nTAUP99 (these Proceedings).\n7. G. Battistoni et al.,, hep-ph/9907408, Astropart. Phys. (to be published).\n8. Y. Tserkovnyak et al., hep-ph/9907450.\n9. T.K. Gaisser & Todor Stanev, Phys. Rev. D57\n(1998) 1977.\n\n\f7\n10. Ralph Engel, T.K. Gaisser & Todor Stanev,\nhep-ph/9911394, Physics Letters B (to be\npublished).\n11. A.M. Hillas Cosmic Rays, (Pergamon Press,\n1972) Chapter 2.\n12. Thomas H. Johnson, Phys. Rev. 43 (1933)\n834. See also Thomas H. Johnson & E.C.\nStreet, Phys. Rev. 44 (1933) 125.\n13. L.W. Alvarez & A.H. Compton, Phys. Rev.\n43 (1933) 835.\n14. Paolo Lipari, Todor Stanev & T.K. Gaisser,\nPhys. Rev. D58 (1998) 073003.\n15. T. Futagami et al., Phys. Rev. Letters 82\n(1999) 5194.\n16. D.H. Perkins, Astroparticle Physics 2 (1994)\n249.\n17. M. Boezio et al., Ap.J. 518 (1999) 457.\n18. R. Bellotti et al. Phys. Rev. D60 (1999)\n052002.\n19. AMS Collaboration, Phys. Letters (to be published).\n20. W. Menn et al., Proc. 25th Int. Cosmic Ray\nConf. (Durban) vol. 3 (1997) 409.\n21. T. Sanuki et al. Proc. 26th Int. Cosmic Ray\nConf. (Salt Lake City) vol. 3 (1999) 93.\n22. E.S. Seo et al. (LEAP) Ap.J. 378 (1991) 763.\n23. W.R. Webber, R.L. Golden & S.A. Stephens,\nProc. 20th Int. Cosmic Ray Conf. (Moscow)\nvol. 1 (1987) 325.\n24. Vivek Agrawal, T.K. Gaisser, Paolo Lipari &\nTodor Stanev, Phys. Rev. D53 (1996) 1314.\n25. M. Honda, T. Kajita, K. Kasahara & S. Midorikawa, Phys. Rev. D52 (1995) 4985.\n26. E.V. Bugaev & V.A. Naumov, Phys. Lett.\nB232 (1989) 391.\n27. T.K. Gaisser, M. Honda, K. Kasahara, H.\nLee, S. Midorikawa, V. Naumov & Todor\nStanev, Phys. Rev. D54 (1996) 5578.\n28. M. Boezio et al., Phys. Rev. Letters 82 (1999)\n4757.\n29. S. Coutu et al., Proc. 26th Int. Cosmic Ray\nConf. (Salt Lake City) vol. 2 (1999) 68.\n30. A. Fassò, A. Ferrari, J. Ranft and P.R. Sala,\nProc. of the 3rd Workshop on Simulating Accelerator Radiation Environment, SARE-3,\nKEK-Tsukuba, May 7-9, 1997, (H. Hirayama,\ned.) KEK Report 97-5, p. 32 (1997).\n31. Thomas H. Johnson, Phys. Rev. 59 (1941) 11.\n\n32. T. Stanev, S. Coutu, T.K. Gaisser & G. Barr,\nProc. 26th Int. Cosmic Ray Conf. (Salt Lake\nCity) vol. 2, p. 96 (1999).\n33. Paolo Lipari in Proc. 8th Int. Workshop on\nNeutrino Telescopes (ed. Milla Baldo Ceolin,\n1999) p. 245.\n\n\f"}