{"id": "http://arxiv.org/abs/hep-ph/0007201v1", "guidislink": true, "updated": "2000-07-19T09:13:06Z", "updated_parsed": [2000, 7, 19, 9, 13, 6, 2, 201, 0], "published": "2000-07-19T09:13:06Z", "published_parsed": [2000, 7, 19, 9, 13, 6, 2, 201, 0], "title": "Transverse momentum distributions and their forward- backward\n  correlations in the percolating colour string approach", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0007179%2Chep-ph%2F0007148%2Chep-ph%2F0007246%2Chep-ph%2F0007263%2Chep-ph%2F0007040%2Chep-ph%2F0007289%2Chep-ph%2F0007201%2Chep-ph%2F0007276%2Chep-ph%2F0007161%2Chep-ph%2F0007169%2Chep-ph%2F0007133%2Chep-ph%2F0007307%2Chep-ph%2F0007165%2Chep-ph%2F0007332%2Chep-ph%2F0007253%2Chep-ph%2F0007039%2Chep-ph%2F0007255%2Chep-ph%2F0007126%2Chep-ph%2F0007208%2Chep-ph%2F0007031%2Chep-ph%2F0007050%2Chep-ph%2F0007292%2Chep-ph%2F0007242%2Chep-ph%2F0007320%2Chep-ph%2F0007155%2Chep-ph%2F0007027%2Chep-ph%2F0007138%2Chep-ph%2F0007226%2Chep-ph%2F0007125%2Chep-ph%2F0007338%2Chep-ph%2F0007257%2Chep-ph%2F0007139%2Chep-ph%2F0007152%2Chep-ph%2F0007123%2Chep-ph%2F0007251%2Chep-ph%2F0007071%2Chep-ph%2F0007010%2Chep-ph%2F0007001%2Chep-ph%2F0007233%2Chep-ph%2F0007102%2Chep-ph%2F0007112%2Chep-ph%2F0007005%2Chep-ph%2F0007114%2Chep-ph%2F0007264%2Chep-ph%2F0007286%2Chep-ph%2F0007080%2Chep-ph%2F0007163%2Chep-ph%2F0007099%2Chep-ph%2F0007237%2Chep-ph%2F0007041%2Chep-ph%2F0007317%2Chep-ph%2F0007081%2Chep-ph%2F0007011%2Chep-ph%2F0007117%2Chep-ph%2F0007045%2Chep-ph%2F0007244%2Chep-ph%2F0007143%2Chep-ph%2F0007274%2Chep-ph%2F0007124%2Chep-ph%2F0007076%2Chep-ph%2F0007172%2Chep-ph%2F0007224%2Chep-ph%2F0007079%2Chep-ph%2F0007052%2Chep-ph%2F0007166%2Chep-ph%2F0007238%2Chep-ph%2F0007235%2Chep-ph%2F0007051%2Chep-ph%2F0007177%2Chep-ph%2F0007281%2Chep-ph%2F0007187%2Chep-ph%2F0007158%2Chep-ph%2F0007120%2Chep-ph%2F0007359%2Chep-ph%2F0007147%2Chep-ph%2F0007140%2Chep-ph%2F0007212%2Chep-ph%2F0007193%2Chep-ph%2F0007130%2Chep-ph%2F0007322%2Chep-ph%2F0007014%2Chep-ph%2F0007018%2Chep-ph%2F0007046%2Chep-ph%2F0007330%2Chep-ph%2F0007105%2Chep-ph%2F0007028%2Chep-ph%2F0007341%2Chep-ph%2F0007107%2Chep-ph%2F0007171%2Chep-ph%2F0007119%2Chep-ph%2F0007029%2Chep-ph%2F0007353%2Chep-ph%2F0007287%2Chep-ph%2F0007145%2Chep-ph%2F0007326%2Chep-ph%2F0007207%2Chep-ph%2F0007314%2Chep-ph%2F0007073%2Chep-ph%2F0007106%2Chep-ph%2F0007357%2Chep-ph%2F0007354&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Transverse momentum distributions and their forward- backward\n  correlations in the percolating colour string approach"}, "summary": "The forward-backward correlations in the $p_T$ distributions, which present a\nclear signature of non-linear effects in particle production, are studied in\nthe model of percolating colour strings. Quantitative predictions are given for\nthese correlations at SPS, RHIC and LHC energies. Interaction of strings also\nnaturally explains the flattening of $p_T$ distributions and increase of\n$<p_T>$ with energy and atomic number for nuclear collisions", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0007179%2Chep-ph%2F0007148%2Chep-ph%2F0007246%2Chep-ph%2F0007263%2Chep-ph%2F0007040%2Chep-ph%2F0007289%2Chep-ph%2F0007201%2Chep-ph%2F0007276%2Chep-ph%2F0007161%2Chep-ph%2F0007169%2Chep-ph%2F0007133%2Chep-ph%2F0007307%2Chep-ph%2F0007165%2Chep-ph%2F0007332%2Chep-ph%2F0007253%2Chep-ph%2F0007039%2Chep-ph%2F0007255%2Chep-ph%2F0007126%2Chep-ph%2F0007208%2Chep-ph%2F0007031%2Chep-ph%2F0007050%2Chep-ph%2F0007292%2Chep-ph%2F0007242%2Chep-ph%2F0007320%2Chep-ph%2F0007155%2Chep-ph%2F0007027%2Chep-ph%2F0007138%2Chep-ph%2F0007226%2Chep-ph%2F0007125%2Chep-ph%2F0007338%2Chep-ph%2F0007257%2Chep-ph%2F0007139%2Chep-ph%2F0007152%2Chep-ph%2F0007123%2Chep-ph%2F0007251%2Chep-ph%2F0007071%2Chep-ph%2F0007010%2Chep-ph%2F0007001%2Chep-ph%2F0007233%2Chep-ph%2F0007102%2Chep-ph%2F0007112%2Chep-ph%2F0007005%2Chep-ph%2F0007114%2Chep-ph%2F0007264%2Chep-ph%2F0007286%2Chep-ph%2F0007080%2Chep-ph%2F0007163%2Chep-ph%2F0007099%2Chep-ph%2F0007237%2Chep-ph%2F0007041%2Chep-ph%2F0007317%2Chep-ph%2F0007081%2Chep-ph%2F0007011%2Chep-ph%2F0007117%2Chep-ph%2F0007045%2Chep-ph%2F0007244%2Chep-ph%2F0007143%2Chep-ph%2F0007274%2Chep-ph%2F0007124%2Chep-ph%2F0007076%2Chep-ph%2F0007172%2Chep-ph%2F0007224%2Chep-ph%2F0007079%2Chep-ph%2F0007052%2Chep-ph%2F0007166%2Chep-ph%2F0007238%2Chep-ph%2F0007235%2Chep-ph%2F0007051%2Chep-ph%2F0007177%2Chep-ph%2F0007281%2Chep-ph%2F0007187%2Chep-ph%2F0007158%2Chep-ph%2F0007120%2Chep-ph%2F0007359%2Chep-ph%2F0007147%2Chep-ph%2F0007140%2Chep-ph%2F0007212%2Chep-ph%2F0007193%2Chep-ph%2F0007130%2Chep-ph%2F0007322%2Chep-ph%2F0007014%2Chep-ph%2F0007018%2Chep-ph%2F0007046%2Chep-ph%2F0007330%2Chep-ph%2F0007105%2Chep-ph%2F0007028%2Chep-ph%2F0007341%2Chep-ph%2F0007107%2Chep-ph%2F0007171%2Chep-ph%2F0007119%2Chep-ph%2F0007029%2Chep-ph%2F0007353%2Chep-ph%2F0007287%2Chep-ph%2F0007145%2Chep-ph%2F0007326%2Chep-ph%2F0007207%2Chep-ph%2F0007314%2Chep-ph%2F0007073%2Chep-ph%2F0007106%2Chep-ph%2F0007357%2Chep-ph%2F0007354&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The forward-backward correlations in the $p_T$ distributions, which present a\nclear signature of non-linear effects in particle production, are studied in\nthe model of percolating colour strings. Quantitative predictions are given for\nthese correlations at SPS, RHIC and LHC energies. Interaction of strings also\nnaturally explains the flattening of $p_T$ distributions and increase of\n$<p_T>$ with energy and atomic number for nuclear collisions"}, "authors": ["M. A. Braun", "C. Pajares"], "author_detail": {"name": "C. Pajares"}, "author": "C. Pajares", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevLett.85.4864", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/hep-ph/0007201v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-ph/0007201v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "6 pages in LaTex, 3 figures in Postscript", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-ph/0007201v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-ph/0007201v1", "journal_reference": "Phys.Rev.Lett. 85 (2000) 4864-4867", "doi": "10.1103/PhysRevLett.85.4864", "fulltext": "1\n\nTransverse momentum distributions and their forward-backward\ncorrelations in the percolating colour string approach\nM.A.Brauna and C.Pajaresb\na\n\nb\n\nDepartment of High Energy Physics, University of St. Petersburg,\n198904 St. Petersburg, Russia\nDepartamento de Fı́sica de Partı́culas, Universidade de Santiago de Compostela,\n\narXiv:hep-ph/0007201v1 19 Jul 2000\n\n15706-Santiago de Compostela, Spain\nThe forward-backward correlations in the pT distributions, which present a clear signature of nonlinear effects in particle production, are studied in the model of percolating colour strings. Quantitative\npredictions are given for these correlations at SPS, RHIC and LHC energies. Interaction of strings\nalso naturally explains the flattening of pT distributions and increase of hpT i with energy and atomic\nnumber for nuclear collisions.\n\nThe study of pT distributions in hadronic and nuclear reactions at high energies offers\na unique opportunity to observe non-linear effects in high-density nuclear matter. Indeed\nin a simple picture in which particle production goes via formation of several independent\nemitters, colour strings stretched between the projectile and target, the pT distribution is\nindependent of the number of strings and coincides with the pT distribution from a single\ncolour string. As a result, in this picture the observed pT distribution does not depend on the\nenergy nor on the atomic number of the colliding particles. Experimentally this prediction is\nfulfilled only in a very crude manner. In fact the average hpT i grows with energy and also with\nthe atomic number of the participants (the \"Cronin effect\"). This behaviour clearly shows\nthat particles are produced by different strings not independently. In other words, strings\ninteract with each other and these non-linear effects result in the experimentally observed\nbehavior of the pT distributions.\nSome time ago the authors introduced a simple model which introduces the interaction\nbetween strings via their fusion and percolation [1,2]. In this note we study the pT distributions in this model. We show that the model describes both qualitatively and quantatively\nthe behaviour of the pT distributions of the produced particles with the growth of both the\nenergy and atomic number of the participants. We also study the forward-backward correlations (FBC) in the pT distributions. We find that their mere existence is a signature of\nnon-linear effects in particle production. Our model predicts a very concrete form of these\ncorrelations, which can be tested in present-day and future experiments.\nWe start from the particle spectra produced by a single colour string. The standard idea\nexploited in their description is that the observed particles are formed via quark-antiquark\npair emissions by the colour field of the string. According to [3], the probability rate for this\nproduction then has a Gaussian form as a function of pT . As soon as a q q̄ pair is created,\nthe colour charge Q of the string diminishes, so that at the next step the production rate\nis different (although also of the Gaussian form in pT ). Detailed caluclations show that the\nresulting hp2T i of particles produced after the complete break-up of the string is proportional\n\n\f2\nto Q [4]\nhp2T iQ = Qhp2T i1 ,\n\n(1)\n\nwhere hp2T i1 is the average p2T of particles produced by a \"single\" string, created by colour\nQ0 corresponding to a single q q̄ pair. In future we measure all colours in units Q0 , which is\nequivalent to putting Q0 = 1. To simplify the notation we also omit the subindex T in the\nmomentum distribution, since we shall only consider the transverse momenta.\nThe Gaussian distribution in p can be however theoretically supported only for infinitely\nhigh energies, which correspond to a string infinitely long in rapidity. For realistic strings\nwith a finite length in rapidity one expects corrections due to energy conservation. Also\nfluctuations of the string tension may change the form of the p-distribution, as advocated\nin [5]. Finally an evident restriction comes at large p where the hard collision mechanism is\nexpected to be responsible for particle creation. As a result one expects the p distribution to\nhave a power behaved tail.\nA realistic form of the p distribution corresponding to a single colour string can be extracted from the experimentally measured one in pp̄ soft collisions at 630 and 1800 GeV/c\n[6]. Assuming that the effects of string interactions are small for pp̄ interactions, we may take\nthat the measured distribution coincides with the one for a single ordinary (Q = 1) string.\nThis distribution has a form\nw1 (p) =\n\n(k − 1)(k − 2)\npk0\n.\n(p + p0 )k\n2πp20\n\n(2)\n\nComparing the distributions at 630 and 1800 GeV and also taking into account the behaviour\nof the minimum bias distributions in all the energy interval from 63 to 1800 GeV [7] we\nparametrize\np0 = 2GeV/c, k = 19.7 − 0.86 ln E,\n(3)\nwhere E is the c.m. energy in GeV. With (2) the averages hpi and hp2 i are given by\np1 ≡ hpi1 = p0\n\n2\n,\nk−3\n\nhp2 i1 = p20\n\n6\n.\n(k − 3)(k − 4)\n\n(4)\n\nPassing to the string with colour Q, to satisfy (1), we change p20 → Qp20 , so that our\ndistribution corresponding to the string with colour Q is\n√\n(k − 1)(k − 2) (p0 Q)k\n√\n.\n(5)\nwQ (p) =\n2πQp20\n(p + p0 Q)k\nWe stress that this distribution only refers to the soft part of the spectrum, which supposedly\nis generated by the string decay. The observed spectrum also contains a contribution from\nhard events (with a produced cluster having p >1.1 GeV/c, in the definition of [6]).\nOur picture for the high-energy particle production consists in assuming that in the\ncollision several colour strings are created which may overlap in the transverse space. In the\noverlap area the colour fields of the strings add algebraically. Due to the vector character\nof color charge, the resulting colour squared of the overlap area is just a sum of the colour\nsquared of the overlapping strings. Thus in the overlap of n strings a new colour string is\n\n\f3\n√\nformed corresponding to colour Qn = n. The fact that the colour of the overlapping strings\nis proportional to the square root of their number and not to their number has an immediate\nconsequence of damping the multiplicities of the produced particles by a factor of the order\nthree at the LHC energies [8]. Here we study its influence on the p-distribution.\nTo find the latter we have to know the distribution in the areas of overlaps of n strings,\nwhich gives the weights with which different overlaps contribute to particle production. It\nhas been shown in [8] that in the \"thermodynamic limit\", that is for an idealized system\nwith a very large total interaction area S and corresponsingly large number of strings N ,\nthe properties of the system and the overlap distribution in particular are governed by a\ndimensionless parameter\nN\nη = σ0 = σ0 ρ.\n(6)\nS\nHere σ0 is an area of a single string and ρ the string density. Note that at η > ηc ≃ 1.12−1.20\nthe percolation phase transition occurs, most of the space being occupied by a single cluster\nformed by many overlapping strings.\nIt has been shown in [8] that in the thermodynamic limit the distribution in the overlaps\nareas with different n follows the Poisson law with an average value equal to η:\nλ(n) =\n\nSn\nηn\n= a(η)\nS\nn!\n\n(7)\n\nwith a = exp(−η). Here Sn is the total area in which exactly n strings overlap. Eq. (7) is\nvalid for n = 0, 1, 2..., λ(0) giving the part of the area in which there are no strings at all.\nEvidently the latter part does not produce particles. So we are only interested in the relative\ncontribution to particle production of overlaps with n = 1, 2, .... This will be given by (7)\nwith a different normalization factor a = 1/(exp η − 1).\nThe overall p distribution P (p) is obtained by convoluting the distribution (5) in p for\n√\nfixed Q and (7) in n and taking into account that for an overlap of n strings Q = n:\nP (p) =\n\nX\n\nλ(n)w√n (p).\n\n(8)\n\nηn\n.\nn!\n\n(9)\n\nn=1\n\nAs a consequence of (1) we find\nhpi = p1 a(η)\n\nX\n\nn=1\n\nn1/4\n\nFor small η this gives hpi/p1 = 1 + 0.094η. The behaviour of hpi/p1 for 0.5 < η < 4 can also\nbe well described by a linear dependence 1 + 0.098η.\nSo even with a fixed average p1 for a single string, the overall average grows with η. On\nthe other hand, η grows both with the energy E and the atomic number A of the colliding\nparticles [8], so that fusion of strings by itself leads to the growth of the average transverse\nmomentum with E and A. With the distribution (2) the average p1 also rises with energy\nfrom 0.28 GeV/c at 19.4 GeV to 0.43 GeV/c at 5500 GeV. This rise has to be combined with\nthat due to the growth of η for collisions with nuclei. Using our earlier calculations [8] we\nfind the values of η for central p-PB and Pb-Pb collisions at c.m. energies 19.4, 200 and 5500\nGeV shown in the second and fourth columns of the Table. In the third and fifth columns we\n\n\f4\npresent the corresponding values of hpi which follow from Eq (9) with the distribution (5).\nComparing these values with the experiment, one should remember that they refer only to\nthe soft part of the spectra.\nThe form of the p distribution in p-Pb and Pb-Pb collisons corresponding to Eq.(8) is\nshown in Fig. 1. With the growth of E and A the high p tail is strongly enhanced. This\ncorresponds to the well-known Cronin effect. In Fig. 2 we present the ratio of the distributions\nfor the p-Pb and Pb-Pb to p-p reactions. They are well compatible with the experimental\nones [9].\nNow we pass to the FBC in the p-distributions. They can be studied from the observation\nof the average p in the backward hemisphere hpB ipF for events with given p = pF in the\nforward hemisphere. In absence of any interaction between colour strings (independent colour\nstring model) the average p in both hemispheres evidently is identical with this average for a\nsingle string. Then\nF (pF ) ≡ hpB ipF /p1 = 1.\n(10)\nOf course, one should have in mind that correlations between different strings are imposed not\nonly but their fusion and percolation, but also on purely kinematical grounds, due to energy\nconservation. However this latter effect diminishes with energy and becomes neglegible in\nthe mid-rapidity region at large enough energy. Modulo this kinematical effect, the mere\nexistence of FBC, that is, the difference of the right-hand side of Eq. (10) from unity is a\nclear signature of a dynamical interaction between strings. In our percolation string model\nfunction F can be found explicitly.\nWith two different observables pB and pF we introduce the corresponding probability\nw(pF , pF ) which generalizes Eq. (5) and shows the probability to find the observed particle\nwith transverse momenta pF and pB in the forward and backward hemispheres. Technically\nit can be found from the inclusive cross-section 2Ed3 σ/d3 p integrated over the angles in the\nforward or backward hemispheres respectively and properly normalized. Our starting point\nwill be an assumption that there is no correlation between emission of particles in the forward\nand backward hemispheres for a single string:\nwQ (pF , pB ) = wQ (pF )wQ (pB ),\n\n(11)\n\nwhere each of the functions w on the right-hand side is given by Eq. (5). Then for a single\nstring of colour Q\np\nhpF iQ = hpB iQ = hpiQ = Qp1 .\n(12)\nPassing to the system of percolating strings with different overlaps we find the final distribution in pF and pB as a suitable generalization of (8)\nP (pF , pB ) =\n\nX\n\nλ(n)w√n (pF , pB ).\n\n(13)\n\nn=1\n\nIntegrating this expression over pF one obtains the distribution in pF :\nP (pF ) =\n\nZ\n\nd2 pB P (pF , pB ) =\n\nX\n\nn=1\n\nλ(n)w√n (pF ) = P (p).\n\n(14)\n\n\f5\nAs expected, it coincides with the overall distribution (8).\nThe conditional probability to see a particle with momentum pB in the backward hemisphere, provided one observes a particle with momentum pF in the forward hemispere, is\ngiven by the ratio\nP (pF , pB )\n,\n(15)\nP (pB )pF =\nP (pF )\nso that the average value of any observable A(pF , pB ) for a given fixed pF is given by\nhAipF = P\n\n−1\n\nZ\n\n(pF )\n\nd2 pB A(pF , pB )P (pF , pB ).\n\n(16)\n\nTaking A(pF , pB ) = pB we obtain for the function F in (10)\nF (pF ) =\n\nP\n\nn=1 n\n\nP\n\n1/4 λ(n)w√\n\nn (pF )\n\n√\nn=1 λ(n)w n (pF )\n\n.\n\n(17)\n\nIts difference from unity measures the FBC in the transverse momentum distributions.\nAt small η we find\n(1.189(p + p0 ))k\nF (pF ) = 1 + 0.0669 η\n.\n(18)\n(p + 1.189p0 )k\nSo positive correlations follow (as expected), which grow with the momentum from a non-zero\nvalue to saturate at a certain larger value depending on the energy (via k).\nThe behaviour of F (pF ) − 1 for the reactions p-Pb and Pb-Pb at different energies is\nillustrated in Fig.3. The FBC rise with energy and atomic number, their magnitude well\nallowing for the experimental observation.\nSummarizing, we have shown that interaction of strings predicts sizable FBC in the transverse momenta, which can be tested in the forthcoming experiments. Also the dependence\nof the p-spectra on E and A is naturally explained for collisions with nuclei.\nThis work has been done under the contract AEN99-0589-C02-02 from CICYT of Spain.\n\nReferences\n[1] M.A.Braun and C.Pajares, Phys. Lett. B287 154 (1992); Nucl. Phys. B390 542,549\n(1993); N.S.Amelin, M.A.Braun and C.Pajares, Phys. Lett. B306 312 (1993); Z.Phys. C63\n507 (1994).\n[2] N.Armesto, M.A.Braun, E.G.Ferreiro and C.Pajares, Phys. Rev.Lett. 77 3736 (1996).\n[3] J.Schwinger, Phys. Rev.82 664 (1951); T.S.Biro, H.B.Nielsen and J.Knoll, Nucl. Phys.\nB245 449 (1984).\n[4] A.Bialas and W.Czyz, Nucl. Phys. B267 242 (1986) .\n[5] A.Bialas, hep-ph/9909417\n[6] CDF Collab, F.Rimondi, Talk presented at IX Int. Workshop on Multiparticle Production, Torino (2000), to appear in Nucl. Phys. B (Proc).\n[7] UA1 Colab, G. Arnison et al., Phys. Lett. 118 B (1982) 167; CDF Collab., F.Abe et\nal., Phys. Rev. Lett., 61 (1988) 1819.\n\n\f6\n[8] M.A.Braun and C.Pajares, to be published in Eur. Phys. J. C; N.Armesto and\nC.Pajares, Int. J. Mod. Phys. A 15 (2000) 2019\n[9] J.Schukraft, in Proc. Int. Workshop on Quark-Gluon Plasma Signatures, Strasbourg,\nFrance (1990)\n\nFigure captions\nFig. 1. Transverse momentum distributions in the reactions p-Pb and Pb-Pb at different\nc.m.energies (normalized to unity). Curves 1,2 and 3 correspond to p-Pb, and curves 4,5 and\n6 to Pb-Pb at 19.4, 200 and 5500 GeV respectively.\nFig. 2. Ratio of pT -distributions for the reactions p+Pb and Pb-Pb to p-p at c.m.\nenergies 19.4, 200 and 5500 GeV. For p-Pb the curves go down with energy. For Pb-Pb the\nslope rises with energy\nFig. 3. The FBC parameter F-1 (Eq. (23)) as a function of pF for the reactions p-Pb\nand Pb-Pb at c.m. energies 19.4, 200 and 5500 GeV. For p-P the curves rise with energy.\n\nTable\np-Pb\nEnergy (GeV)\n\nη\n\n19.4\n\n0.53\n\n200\n5500\n\nPb-Pb\n\nhpT i (GeV/c)\n\nη\n\nhpT i (GeV/c)\n\n0.30\n\n1.19\n\n0.32\n\n0.60\n\n0.35\n\n1.82\n\n0.39\n\n0.76\n\n0.46\n\n3.54\n\n0.58\n\n\f10\n\n1\n\nP(p)\n\n0.1\n\n0.01\n\n6\n\n0.001\n\n3\n5\n0.0001\n\n2\n4\n1\n\n1e-05\n0\n\n0.5\n\n1\n\n1.5\np, GeV/c\n\n2\n\n2.5\n\n\f2\n\n1.8\nPb-Pb\n1.6\n\nP_AB/P_pp\n\n1.4\n\n1.2\np-Pb\n1\n\n0.8\n\n0.6\n\n0.4\n0\n\n0.2\n\n0.4\n\n0.6\np, GeV/c\n\n0.8\n\n1\n\n1.2\n\n\f0.4\n\nPb-Pb at 5500\n\n0.35\n\n0.3\n\nF(p_F)-1\n\n0.25\n\nPb-Pb at 200\n\n0.2\n\n0.15\n\nPb-Pb at 19.4\np-Pb\n\n0.1\n\n0.05\n\n0\n0\n\n0.2\n\n0.4\n\n0.6\np, GeV/c\n\n0.8\n\n1\n\n1.2\n\n\f"}