{"id": "http://arxiv.org/abs/hep-ph/0506221v1", "guidislink": true, "updated": "2005-06-22T19:21:13Z", "updated_parsed": [2005, 6, 22, 19, 21, 13, 2, 173, 0], "published": "2005-06-22T19:21:13Z", "published_parsed": [2005, 6, 22, 19, 21, 13, 2, 173, 0], "title": "Exotic Acceleration Processes and Fundamental Physics", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0506059%2Chep-ph%2F0506005%2Chep-ph%2F0506020%2Chep-ph%2F0506084%2Chep-ph%2F0506060%2Chep-ph%2F0506240%2Chep-ph%2F0506067%2Chep-ph%2F0506046%2Chep-ph%2F0506031%2Chep-ph%2F0506316%2Chep-ph%2F0506218%2Chep-ph%2F0506063%2Chep-ph%2F0506133%2Chep-ph%2F0506024%2Chep-ph%2F0506037%2Chep-ph%2F0506004%2Chep-ph%2F0506021%2Chep-ph%2F0506175%2Chep-ph%2F0506014%2Chep-ph%2F0506318%2Chep-ph%2F0506256%2Chep-ph%2F0506214%2Chep-ph%2F0506135%2Chep-ph%2F0506173%2Chep-ph%2F0506272%2Chep-ph%2F0506295%2Chep-ph%2F0506027%2Chep-ph%2F0506025%2Chep-ph%2F0506227%2Chep-ph%2F0506300%2Chep-ph%2F0506223%2Chep-ph%2F0506197%2Chep-ph%2F0506117%2Chep-ph%2F0506047%2Chep-ph%2F0506239%2Chep-ph%2F0506201%2Chep-ph%2F0506278%2Chep-ph%2F0506314%2Chep-ph%2F0506267%2Chep-ph%2F0506051%2Chep-ph%2F0506101%2Chep-ph%2F0506200%2Chep-ph%2F0506086%2Chep-ph%2F0506015%2Chep-ph%2F0506148%2Chep-ph%2F0506058%2Chep-ph%2F0506317%2Chep-ph%2F0506333%2Chep-ph%2F0506250%2Chep-ph%2F0506119%2Chep-ph%2F0506155%2Chep-ph%2F0506185%2Chep-ph%2F0506003%2Chep-ph%2F0506136%2Chep-ph%2F0506269%2Chep-ph%2F0506208%2Chep-ph%2F0506298%2Chep-ph%2F0506283%2Chep-ph%2F0506109%2Chep-ph%2F0506131%2Chep-ph%2F0506309%2Chep-ph%2F0506190%2Chep-ph%2F0506146%2Chep-ph%2F0506130%2Chep-ph%2F0506273%2Chep-ph%2F0506279%2Chep-ph%2F0506156%2Chep-ph%2F0506245%2Chep-ph%2F0506013%2Chep-ph%2F0506069%2Chep-ph%2F0506243%2Chep-ph%2F0506183%2Chep-ph%2F0506030%2Chep-ph%2F0506122%2Chep-ph%2F0506180%2Chep-ph%2F0506268%2Chep-ph%2F0506178%2Chep-ph%2F0506107%2Chep-ph%2F0506093%2Chep-ph%2F0506232%2Chep-ph%2F0506275%2Chep-ph%2F0506111%2Chep-ph%2F0506193%2Chep-ph%2F0506221%2Chep-ph%2F0506167%2Chep-ph%2F0506169%2Chep-ph%2F0506280%2Chep-ph%2F0506326%2Chep-ph%2F0506302%2Chep-ph%2F0506313%2Chep-ph%2F0506308%2Chep-ph%2F0506320%2Chep-ph%2F0506153%2Chep-ph%2F0506216%2Chep-ph%2F0506057%2Chep-ph%2F0506235%2Chep-ph%2F0506075%2Chep-ph%2F0506219%2Chep-ph%2F0506293%2Chep-ph%2F0506261%2Chep-ph%2F0506038&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Exotic Acceleration Processes and Fundamental Physics"}, "summary": "Gamma-ray bursts and ultra-high-energy cosmic rays provide an important\ntesting ground for fundamental physics. A simple-minded analysis of some\ngamma-ray bursts would lead to a huge estimate of the overall energy emitted,\nand this represents a potential challenge for modelling the bursts. Some cosmic\nrays have been observed with extremely high energies, and it is not easy to\nenvision mechanisms for the acceleration of particles to such high energies.\nSurprisingly some other aspects of the analysis of gamma-ray bursts and\nultra-high-energy cosmic rays, even before reaching a full understanding of the\nmechanisms that generate them, can already be used to explore new ideas in\nfundamental physics, particularly for what concerns the structure of spacetime\nat short (Planckian) distance scales.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0506059%2Chep-ph%2F0506005%2Chep-ph%2F0506020%2Chep-ph%2F0506084%2Chep-ph%2F0506060%2Chep-ph%2F0506240%2Chep-ph%2F0506067%2Chep-ph%2F0506046%2Chep-ph%2F0506031%2Chep-ph%2F0506316%2Chep-ph%2F0506218%2Chep-ph%2F0506063%2Chep-ph%2F0506133%2Chep-ph%2F0506024%2Chep-ph%2F0506037%2Chep-ph%2F0506004%2Chep-ph%2F0506021%2Chep-ph%2F0506175%2Chep-ph%2F0506014%2Chep-ph%2F0506318%2Chep-ph%2F0506256%2Chep-ph%2F0506214%2Chep-ph%2F0506135%2Chep-ph%2F0506173%2Chep-ph%2F0506272%2Chep-ph%2F0506295%2Chep-ph%2F0506027%2Chep-ph%2F0506025%2Chep-ph%2F0506227%2Chep-ph%2F0506300%2Chep-ph%2F0506223%2Chep-ph%2F0506197%2Chep-ph%2F0506117%2Chep-ph%2F0506047%2Chep-ph%2F0506239%2Chep-ph%2F0506201%2Chep-ph%2F0506278%2Chep-ph%2F0506314%2Chep-ph%2F0506267%2Chep-ph%2F0506051%2Chep-ph%2F0506101%2Chep-ph%2F0506200%2Chep-ph%2F0506086%2Chep-ph%2F0506015%2Chep-ph%2F0506148%2Chep-ph%2F0506058%2Chep-ph%2F0506317%2Chep-ph%2F0506333%2Chep-ph%2F0506250%2Chep-ph%2F0506119%2Chep-ph%2F0506155%2Chep-ph%2F0506185%2Chep-ph%2F0506003%2Chep-ph%2F0506136%2Chep-ph%2F0506269%2Chep-ph%2F0506208%2Chep-ph%2F0506298%2Chep-ph%2F0506283%2Chep-ph%2F0506109%2Chep-ph%2F0506131%2Chep-ph%2F0506309%2Chep-ph%2F0506190%2Chep-ph%2F0506146%2Chep-ph%2F0506130%2Chep-ph%2F0506273%2Chep-ph%2F0506279%2Chep-ph%2F0506156%2Chep-ph%2F0506245%2Chep-ph%2F0506013%2Chep-ph%2F0506069%2Chep-ph%2F0506243%2Chep-ph%2F0506183%2Chep-ph%2F0506030%2Chep-ph%2F0506122%2Chep-ph%2F0506180%2Chep-ph%2F0506268%2Chep-ph%2F0506178%2Chep-ph%2F0506107%2Chep-ph%2F0506093%2Chep-ph%2F0506232%2Chep-ph%2F0506275%2Chep-ph%2F0506111%2Chep-ph%2F0506193%2Chep-ph%2F0506221%2Chep-ph%2F0506167%2Chep-ph%2F0506169%2Chep-ph%2F0506280%2Chep-ph%2F0506326%2Chep-ph%2F0506302%2Chep-ph%2F0506313%2Chep-ph%2F0506308%2Chep-ph%2F0506320%2Chep-ph%2F0506153%2Chep-ph%2F0506216%2Chep-ph%2F0506057%2Chep-ph%2F0506235%2Chep-ph%2F0506075%2Chep-ph%2F0506219%2Chep-ph%2F0506293%2Chep-ph%2F0506261%2Chep-ph%2F0506038&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Gamma-ray bursts and ultra-high-energy cosmic rays provide an important\ntesting ground for fundamental physics. A simple-minded analysis of some\ngamma-ray bursts would lead to a huge estimate of the overall energy emitted,\nand this represents a potential challenge for modelling the bursts. Some cosmic\nrays have been observed with extremely high energies, and it is not easy to\nenvision mechanisms for the acceleration of particles to such high energies.\nSurprisingly some other aspects of the analysis of gamma-ray bursts and\nultra-high-energy cosmic rays, even before reaching a full understanding of the\nmechanisms that generate them, can already be used to explore new ideas in\nfundamental physics, particularly for what concerns the structure of spacetime\nat short (Planckian) distance scales."}, "authors": ["Giovanni Amelino-Camelia"], "author_detail": {"name": "Giovanni Amelino-Camelia"}, "author": "Giovanni Amelino-Camelia", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1029/156GM27", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/hep-ph/0506221v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-ph/0506221v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "5 pages, LaTex; Brief overview of the contributions to the section\n  \"Exotic Acceleration Processes and Fundamental Physics\" of the Huntsville\n  Workshop monograph (proceedings) \"Particle Acceleration in Astrophysical\n  Plasmas: Geospace and Beyond\"", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-ph/0506221v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-ph/0506221v1", "journal_reference": null, "doi": "10.1029/156GM27", "fulltext": "Exotic Acceleration Processes and Fundamental Physics\nGiovanni AMELINO-CAMELIA\n\narXiv:hep-ph/0506221v1 22 Jun 2005\n\nDipartimento di Fisica, Università di Roma \"La Sapienza\" and INFN Sez. Roma1,\nP.le Moro 2, 00185 Roma, Italy\nGamma-ray bursts and ultra-high-energy cosmic rays provide an important testing ground for\nfundamental physics. A simple-minded analysis of some gamma-ray bursts would lead to a huge\nestimate of the overall energy emitted, and this represents a potential challenge for modelling the\nbursts. Some cosmic rays have been observed with extremely high energies, and it is not easy to\nenvision mechanisms for the acceleration of particles to such high energies. Surprisingly some other\naspects of the analysis of gamma-ray bursts and ultra-high-energy cosmic rays, even before reaching\na full understanding of the mechanisms that generate them, can already be used to explore new\nideas in fundamental physics, particularly for what concerns the structure of spacetime at short\n(Planckian) distance scales.\n\nI. INTRODUCTION\n\nMuch of the work in astrophysics concerns the use of the presently-accepted laws of fundamental physics in the\ndevelopment of consistent descriptions of the observations. In some cases the key challenge comes from an energybalance issue. For example, for some gamma-ray bursts the overall observed fluences can be as large as 10−4 ergs/cm2 ,\nwhich would correspond to a luminosity of 1052 ergs/s and higher, if one can assume isotropy. It would be difficult\nto describe such levels of luminosity in terms of conventional physics. We now understand [1] that most gamma-ray\nbursts are narrowly beamed (not at all isotropic) and this lowers the luminosity estimate to a more mundane level;\nhowever, there is still no real consensus on the mechanism of emission of gamma-ray bursts.\nAnother energy-balance issue is encountered in the study of cosmic rays. In fact, recent data suggest [2] [3] that\nsome cosmic rays have energies of 1020 eV and higher. And it has been argued [4] that at least some of these cosmic\nrays could originate from within our galaxy. But we are unable to find within our galaxy sources which are good\ncandidates for accelerating particles to such high energies.\nIn the study of these issues some \"exotic acceleration mechanisms\" are being considered. Usually the relevant\nacceleration mechanisms are deemed \"exotic\" not because of some role for new laws of physics, but rather because of\nthe role played by creative ways to rely on the presently-accepted laws of fundamental physics to devise mechanisms\nthat could explain the energetics of the system of interest. Only in a few of the most speculative papers on these\nsubjects it has been argued that new physics might be responsible for the emission mechanism.\nWhile the possibility of new physics is at best a marginal hypothesis for the study of emission mechanisms, surprisingly these fascinating problems in astrophysics do provide, independently of the understanding of the emission\nmechanisms, some of the best arenas for testing ideas for new laws of fundamental physics, especially for what concerns\nthe structure of spacetime at Planckian distance scales. We do not need to know exactly how gamma-ray bursts are\nemitted in order to observe that a gamma-ray burst is a very rich signal which propagates over very large distances.\nThe analysis of gamma-ray bursts is therefore a wonderful opportunity for high-sensitivity studies of the laws of\npropagation of signals through space. Similarly we do not need to know exactly how a 1020 eV cosmic ray is produced\nin order to observe that the collisions between such a cosmic ray and the low-energy photons it encounters on the way\nto our Earth laboratories provide a rare opportunity to test the nature of boost transformations. In fact, the same\ncollisions are studied in our particle-physics laboratories but only relatively close to the center-of-mass frame.\nII. ON THE EMISSION OF GAMMA-RAY BURSTS\n\nEven taking into account the fact that most gamma-ray bursts are narrowly beamed, in some cases the inferred\nluminosity is as high as 1051 ergs/s. This is still rather large but does not represent a record-setting energy release,\nsince the total energy emitted is comparable to the one of supernovae [1].\nThe structure of a gamma-ray burst, viewed from a signal-analysis perspective, is extremely rich, and this of course\nrepresents a challenge for emission models. We need a model that would be able to reproduce faithfully all aspects\nof that rich structure. A popular idea is the one of the \"fireball internal-external shocks model\" [1], but it is perhaps\ntoo early to speak of a general consensus.\n\n1\n\n\fAn example of the issues that are being discussed in the effort of establishing the emission mechanism is provided\nby the contribution by Kaneko et al [5], which stresses how important insight on the emission mechanism of gammaray bursts can be obtained by establishing the proper description of gamma-ray-burst spectra. On the basis of an\ninteresting broadband spectral analysis of two spectrally-hard gamma-ray bursts Kaneko et al conclude that gammaray-burst spectra evolve on time scales that are much longer than the synchrotron cooling time. This may be consistent\nwith some arguments discussed in the gamma-ray-burst literature (see, e.g., Ref. [6]), but Kaneko et al argue that\ninstead this should lead to the conclusion that the acceleration mechanism is more complicated than predicted by\nsome popular gamma-ray-burst models.\n\nIII. GAMMA-RAY BURSTS AS A QUANTUM-SPACETIME LABORATORY\n\nGamma-ray bursts have recently attracted much interest (see, e.g., the recent reviews [8] [9] [10] [11]) also from\nthe research community exploring the hypothesis that spacetime might have to be \"quantized\", i.e. that there might\nbe a quantization of spacetime observables in a way somehow analogous to the quantizations of all other observables\nencountered in other aspects of fundamental physics.\nSome scenarios for spacetime quantization involve a sort of granularity of spacetime, and as a result one may expect\nsome departures from the smooth laws of Lorentz symmetry [15]. The mechanism would be analogous1 to the one\nthat applies to phonons: the law of propagation of phonons is formally relativistic at low energies, when the reticular\nstructure of the underlying material can be ignored, but at high energies there are departures from the relativistic\nbehaviour. If spacetime itself was granular then some analogous effect might be present. A sort of light-cone fuzziness\nis essentially inevitable in presence of spacetime granularity, and recently it was realized that some specific schemes for\nintroducing the granularity length scale may also affect the propagation of photons by introducing a small dependence\nof the speed on the photon energy.\nThese effects on photon propagation are expected to be very small, since their magnitude is set by the ratio of\nthe photon energy over the Planck energy scale (∼ 1028 eV ), but, as I stress in my contribution [14], through the\nanalysis of observations of gamma-ray bursts one has a chance to discover (or rule out) these Planck-scale effects.\nThe properties of gamma-ray bursts that are used in this type of analysis are [15] [16]\n• the fact that gamma-ray bursters are often at cosmological distances,\n• the fact that a typical gamma-ray-burst spectrum should extend up to the tens of M eV and higher,\n• and the fact that some \"microbursts\" within a gamma-ray burst can have very short duration, as short as 10−3 s\n(or even 10−4 s).\nThe key point I want to stress here is that this use of gamma-ray burst for quantum-spacetime studies is largely\ninsensitive on the nature of the emission mechanism. The properties of gamma-ray bursts which are used are well\nestablished, and the analysis is largely independent of the modelling of the emission mechanism. So the convergence\nof interest on gamma-ray bursts form the exotic-acceleration-mechanisms community and the quantum-spacetime\ncommunity is accidental.\nIV. ON THE MOST ENERGETIC COSMIC RAYS\n\nSeveral mysteries surround the observation of cosmic rays. This is particularly true for the \"ultra-high-energy\n(UHE) cosmic rays\", with energies higher than 1019 eV . The identification of the particles is problematic, since we\nreveal them indirectly through their interactions in the atmosphere. It appears however that most UHE cosmic rays\nare protons.\nMost UHE cosmic rays are believed to be of cosmological origin, but this then should imply that the so-called \"GZK\ncutoff\" [17] should be observed: the spectrum of observed cosmic rays should basically stop around Egzk ≃ 5 * 1019 eV ,\nwhere photons in the Cosmic Microwave Background (CMB) become viable targets for photopion production. A\ncosmic ray that starts its journey with energy higher than Egzk should loose rather rapidly the energy in excess of\nEgzk in the form of pions. There is great interest in recent observations of cosmic rays with energies beyond the\n\n1\n\nSome authors have also argued (see, e.g., Ref. [12]) that the quantum-spacetime environment might act in a way that to some\nextent resembles the one of a thermal environment. It is well established (see, e.g., Ref. [13]) that in a thermal environment\nthe energy-momentum dispersion relations are naturally modified.\n\n2\n\n\fGZK cutoff [2] [3]. 2 . It has been suggested [4] that perhaps some of the UHE cosmic rays originate from within our\ngalaxy. This would allow them to evade the GZK cutoff, since over \"short\" (galactic) distances the expected energy\nloss through photopion production is negligible. But then we should identify within our galaxy some sources that\ncould accelerate protons to such high energies.\nSo there are issues of interest for the analysis of acceleration mechanisms also in the context of cosmic-ray studies,\nalthough of rather different nature with respect to the case of gamma-ray bursts.\n\nV. COSMIC-RAYS AS A QUANTUM-SPACETIME LABORATORY\n\nAs I stress in my contribution [14], the mentioned fact that some cosmic-ray observatories have reported above-GZK\nevents has also generated strong interest [19] [20] [21] from the quantum-spacetime research community. This interest\noriginates from the observation that spacetime granularity, besides affecting the laws of particle propagation, can\nalso affect the energetic balance of particle-physics processes. The conventional estimate of the GZK cutoff implicitly\nassumes that the photopion-production process would occur in an exactly smooth classical spacetime. The GZK scale\nis set by the minimum energy that, in classical spacetime, is required of a proton to produce a pion in a collision with\na photon of CMB energy. In some quantum spacetimes this estimate of the minimum energy is shifted upward by a\nPlanck-scale effect. Of course if the \"quantum-spacetime GZK scale\" is higher than estimated classically it would be\nnatural to expect some cosmic-ray observations that are above the classical GZK scale.\nEssentially these quantum-spacetime-inspired studies are using the cosmic-ray context to probe a regime of high\nboosts which is not accessible in laboratory experiments. The photopion-production process, p + γ → p + π, is well\nunderstood and studied in the laboratory at center-of-mass energies that are comparable to the ones available in\ncollisions between a 1020 eV proton and a CMB photon, but in our laboratories (when the center-of-mass energies are\nso high) we are only able to study the process in frames that are not highly boosted with respect to the center-ofmass frame. In the observation of ultra-high-energy cosmic rays we are instead observing (some consequences of) the\nphotopion-production process in a frame which is highly boosted with respect to the center-of-mass frame, involving\nindeed an extremely hard proton and a very soft photon. The nature of boosts is in one-to-one relation [14] with the\nshort-distance structure of spacetime, and therefore it is not surprising that these studies would be of interest for the\nquantum-spacetime community.\nI here want to stress that once again the convergence of interest on a problem (in this case the cosmic-ray-spectrum\nproblem) by the \"acceleration mechanisms community\" and the \"quantum-spacetime community\" is accidental. The\nnew physics associated with spacetime quantization is not being advocated as a way to explain the high energies\nreached by cosmic rays. Instead the quantum-spacetime community just uses the experimentally-established fact that\nsome cosmic rays have huge energies. From a quantum-spacetime perspective it does not matter how cosmic rays are\naccelerated to such high energies; it is just a wonderful opportunity that such high-energy particles are available for\nstudy.\nVI. INTERPLAY BETWEEN THE UNDERSTANDING OF THE EMISSION MECHANISMS AND THE\nQUANTUM-SPACETIME STUDIES\n\nUp to this point I have stressed that the growing number of instances in which the interests of the \"acceleration\nmechanisms community\" and of the \"quantum-spacetime community\" converge is largely accidental. This needed to\nbe stressed since readers who have not been following closely the development of these fields might quickly assume that\nthe new physics of quantum spacetime is being advocated just as a way to device new acceleration mechanisms, while\nthis is usually not the case. However, I should also stress that there are some issues that require clarification from an\nacceleration-mechanism perspective and that are quite crucial for the success of the quantum-spacetime studies.\n\n2\nThis AGASA-data-based \"GZK puzzle\" has been very important in providing motivation for studies of Planck-scale departures from Lorentz symmetry. Even if a future improved understanding of the cosmic-ray spectrum ends up removing the\npuzzle, the lessons learned for the study of the quantum-gravity problem will still be very valuable. An analogous situation\nhas been rather recently encountered in the particle-physics literature: the discussion of the so-called \"centauro events\" led to\nstrong theoretical progress in the understanding of the possibility of \"misaligned vacua\" in QCD (see, e.g., Ref. [18]), and this\nprogress on the theory side remains valuable event though now most authors believe that \"centauro events\" might have been\na mirage\n\n3\n\n\fI want to illustrate this point through a specific example that is relevant for the gamma-ray-burst studies here\nmentioned in Sections 2 and 3. Basically the quantum-spacetime interest in gamma-ray-burst observations originates\nfrom the fact that the new Planck-scale laws of particle propagation might attribute different speeds to photons of\ndifferent energies. The fact that we see some microbursts within a given burst that reach different energy channels of\nour detectors at the same time, within the accuracy available at our observatories, allows us to set limits on this energy\ndependence of the speed of photons. The Planck-scale effect could be \"discovered\" if future more sensitive observatories\neventually showed this energy dependence. But of course the analysis would be severely affected if there were poorly\nunderstood at-the-source correlations between energy of the photons and time of emission. As observed recently in\nRef. [7] it appears that one can infer such an energy/time-of-emission correlation from gamma-ray-burst data. The\nquantum-spacetime studies will be therefore confronted with a severe challenge of background/noise removal. It will\nbe crucial for the quantum-spacetime analysis to have available a reliable description of the emission mechanism,\nwhich could allow to remove the undesired at-the-source effect.\nVII. OTHER AREAS OF FUNDAMENTAL PHYSICS\n\nI have so far focused on the fact that some areas of interest from the acceleration-mechanism perspective are also\nof interest for the investigation of certain quantum-spacetime scenarios. In closing, I want to stress that some of the\nrelevant phenomena are also relevant for other types of fundamental-physics studies. Again, I just illustrate this point\nthrough a specific example, which is relevant for the cosmic-ray studies here mentioned in Sections 4 and 5.\nAs mentioned, the most energetic cosmic rays are most likely protons; however, this does not necessarily imply\nthat they are emitted as protons. We infer that they are protons on the basis of the nature of their interactions in\nthe atmosphere, but it is plausible that the cosmic ray might have started off as some other particle, which then\ndecays into a proton at a relatively small distance from the Earth. This would also be another way to describe the\nobservations of cosmic rays with energies higher than the GZK scale: it could well be that the cosmic ray is originally\nsome exotic particle, which does not loose energy through interactions with CMB photons, and then this particle\ndecays into a proton (plus other particles) only at a relatively small distance from the Earth, when the residual time\nof travel is not sufficient for substantial energy loss through interactions with CMB photons.\nVarious new types of particles, that are independently of interest from a particle-physics model-building perspective,\nhave been considered (see, e.g., Refs. [22] [23] [24]) in this cosmic-ray context. Progress in the understanding of the\ncosmic-ray spectrum could provide insight on these new particle-physics scenarios.\n\n[1]\n[2]\n[3]\n[4]\n[5]\n[6]\n[7]\n[8]\n[9]\n[10]\n[11]\n[12]\n[13]\n[14]\n[15]\n[16]\n[17]\n[18]\n[19]\n[20]\n[21]\n\nT. Piran, astro-ph/0405503.\nM. Takeda et al: Phys. Rev. Lett. 81 (1998) 1163.\nR.U. Abbasi, astro-ph/0407622.\nJ.N. Bahcall and E. Waxman, hep-ph/0206217, Phys. Lett. B556 (2003) 1.\nY. Kaneko et al, in this volume\nT. Piran, astro-ph/9810256, Phys. Rept. 314 (1999) 575; astro-ph/9907392, Phys. Rept. 333 (2000) 529.\nT. Piran, astro-ph/0407462.\nG. Amelino-Camelia, gr-qc/9910089, Lect. Notes Phys. 541 (2000) 1.\nG. Amelino-Camelia, gr-qc/0012049, Nature 408 (2000) 661.\nS. Sarkar, gr-qc/0204092.\nN.E. Mavromatos, hep-th/0210079.\nL.J. Garay, Phys. Rev. Lett. 80 (1998) 2508.\nG. Amelino-Camelia and S.-Y. Pi, hep-ph/9211211, Phys. Rev. D47 (1993) 2356.\nG. Amelino-Camelia, in this volume\nG. Amelino-Camelia, J. Ellis, N.E. Mavromatos, D.V. Nanopoulos and S. Sarkar, astro-ph/9712103, Nature 393 (1998)\n763.\nS.D. Biller et al., Phys. Rev. Lett. 83 (1999) 2108.\nK. Greisen, Phys. Rev. Lett. 16 (1966) 748; G. T. Zatsepin and V. A. Kuzmin, Sov. Phys.-JETP Lett. 4 (1966) 78 .\nG. Amelino-Camelia, J.D. Bjorken and S.E. Larsson, hep-ph/9706530, Phys.Rev.D56:6942-6956,1997\nT. Kifune: Astrophys. J. Lett. 518 (1999) L21 .\nR. Aloisio, P. Blasi, P.L. Ghia and A.F. Grillo: Phys. Rev. D62 (2000) 053010.\nG. Amelino-Camelia and T. Piran: astro-ph/0008107, Phys. Rev. D64 (2001) 036005.\n\n4\n\n\f[22] L. Anchordoqui, T. Paul, S. Reucroft and J. Swain, Int. J. Mod. Phys. A18 (2003) 2229; hep-ph/0206072\n[23] H.J. de Vega and N.G. Sanchez, Phys. Rev. D67 (2003) 125019.\n[24] J. Ellis, V.E. Mayes and D.V. Nanopoulos, hep-ph/0403144\n\n5\n\n\f"}