{"id": "http://arxiv.org/abs/hep-ph/0311314v1", "guidislink": true, "updated": "2003-11-24T23:10:58Z", "updated_parsed": [2003, 11, 24, 23, 10, 58, 0, 328, 0], "published": "2003-11-24T23:10:58Z", "published_parsed": [2003, 11, 24, 23, 10, 58, 0, 328, 0], "title": "Electric Dipole Moments in the MSSM at Large tan(beta)", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0311176%2Chep-ph%2F0311367%2Chep-ph%2F0311250%2Chep-ph%2F0311293%2Chep-ph%2F0311308%2Chep-ph%2F0311149%2Chep-ph%2F0311234%2Chep-ph%2F0311118%2Chep-ph%2F0311120%2Chep-ph%2F0311246%2Chep-ph%2F0311340%2Chep-ph%2F0311232%2Chep-ph%2F0311364%2Chep-ph%2F0311225%2Chep-ph%2F0311267%2Chep-ph%2F0311114%2Chep-ph%2F0311026%2Chep-ph%2F0311139%2Chep-ph%2F0311357%2Chep-ph%2F0311171%2Chep-ph%2F0311152%2Chep-ph%2F0311351%2Chep-ph%2F0311040%2Chep-ph%2F0311185%2Chep-ph%2F0311365%2Chep-ph%2F0311158%2Chep-ph%2F0311279%2Chep-ph%2F0311358%2Chep-ph%2F0311165%2Chep-ph%2F0311043%2Chep-ph%2F0311337%2Chep-ph%2F0311212%2Chep-ph%2F0311222%2Chep-ph%2F0311213%2Chep-ph%2F0311249%2Chep-ph%2F0311143%2Chep-ph%2F0311057%2Chep-ph%2F0311063%2Chep-ph%2F0311356%2Chep-ph%2F0311145%2Chep-ph%2F0311154%2Chep-ph%2F0311233%2Chep-ph%2F0311011%2Chep-ph%2F0311247%2Chep-ph%2F0311259%2Chep-ph%2F0311070%2Chep-ph%2F0311056%2Chep-ph%2F0311323%2Chep-ph%2F0311332%2Chep-ph%2F0311102%2Chep-ph%2F0311307%2Chep-ph%2F0311071%2Chep-ph%2F0311348%2Chep-ph%2F0311140%2Chep-ph%2F0311092%2Chep-ph%2F0311002%2Chep-ph%2F0311119%2Chep-ph%2F0311027%2Chep-ph%2F0311330%2Chep-ph%2F0311201%2Chep-ph%2F0311061%2Chep-ph%2F0311237%2Chep-ph%2F0311180%2Chep-ph%2F0311220%2Chep-ph%2F0311100%2Chep-ph%2F0311173%2Chep-ph%2F0311302%2Chep-ph%2F0311281%2Chep-ph%2F0311033%2Chep-ph%2F0311354%2Chep-ph%2F0311075%2Chep-ph%2F0311001%2Chep-ph%2F0311078%2Chep-ph%2F0311014%2Chep-ph%2F0311131%2Chep-ph%2F0311077%2Chep-ph%2F0311280%2Chep-ph%2F0311164%2Chep-ph%2F0311121%2Chep-ph%2F0311031%2Chep-ph%2F0311239%2Chep-ph%2F0311126%2Chep-ph%2F0311167%2Chep-ph%2F0311263%2Chep-ph%2F0311248%2Chep-ph%2F0311335%2Chep-ph%2F0311311%2Chep-ph%2F0311312%2Chep-ph%2F0311111%2Chep-ph%2F0311018%2Chep-ph%2F0311284%2Chep-ph%2F0311129%2Chep-ph%2F0311041%2Chep-ph%2F0311159%2Chep-ph%2F0311106%2Chep-ph%2F0311148%2Chep-ph%2F0311084%2Chep-ph%2F0311314%2Chep-ph%2F0311034%2Chep-ph%2F0311081%2Chep-ph%2F0311128&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Electric Dipole Moments in the MSSM at Large tan(beta)"}, "summary": "Within the minimal supersymmetric standard model (MSSM), the large tan(beta)\nregime can lead to important modifications in the pattern of CP-violating\nsources contributing to low energy electric dipole moments (EDMs). In\nparticular, four-fermion CP-violating interactions induced by Higgs exchange\nshould be accounted for alongside the constituent EDMs of quarks and electrons.\nTo this end, we present a comprehensive analysis of three low energy EDM\nobservables - namely the EDMs of thallium, mercury and the neutron - at large\ntan(beta), in terms of one- and two-loop contributions to the constituent EDMs\nand four-fermion interactions. We concentrate on the constrained MSSM as well\nas the MSSM with non-universal Higgs masses, and include the CP-violating\nphases of mu and A. Our results indicate that the atomic EDMs receive\nsignificant corrections from four-fermion operators, especially when Im(A) is\nthe only CP-violating source, whereas the neutron EDM remains relatively\ninsensitive to these effects. As a consequence, in a large portion of the\nparameter space, one cannot infer a separate bound on the electron EDM via the\nexperimental constraint on the thallium EDM. Furthermore, we find that the\nelectron EDM can be greatly reduced due to the destructive interference of one-\nand two-loop contributions with the latter being dominated by virtual staus.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0311176%2Chep-ph%2F0311367%2Chep-ph%2F0311250%2Chep-ph%2F0311293%2Chep-ph%2F0311308%2Chep-ph%2F0311149%2Chep-ph%2F0311234%2Chep-ph%2F0311118%2Chep-ph%2F0311120%2Chep-ph%2F0311246%2Chep-ph%2F0311340%2Chep-ph%2F0311232%2Chep-ph%2F0311364%2Chep-ph%2F0311225%2Chep-ph%2F0311267%2Chep-ph%2F0311114%2Chep-ph%2F0311026%2Chep-ph%2F0311139%2Chep-ph%2F0311357%2Chep-ph%2F0311171%2Chep-ph%2F0311152%2Chep-ph%2F0311351%2Chep-ph%2F0311040%2Chep-ph%2F0311185%2Chep-ph%2F0311365%2Chep-ph%2F0311158%2Chep-ph%2F0311279%2Chep-ph%2F0311358%2Chep-ph%2F0311165%2Chep-ph%2F0311043%2Chep-ph%2F0311337%2Chep-ph%2F0311212%2Chep-ph%2F0311222%2Chep-ph%2F0311213%2Chep-ph%2F0311249%2Chep-ph%2F0311143%2Chep-ph%2F0311057%2Chep-ph%2F0311063%2Chep-ph%2F0311356%2Chep-ph%2F0311145%2Chep-ph%2F0311154%2Chep-ph%2F0311233%2Chep-ph%2F0311011%2Chep-ph%2F0311247%2Chep-ph%2F0311259%2Chep-ph%2F0311070%2Chep-ph%2F0311056%2Chep-ph%2F0311323%2Chep-ph%2F0311332%2Chep-ph%2F0311102%2Chep-ph%2F0311307%2Chep-ph%2F0311071%2Chep-ph%2F0311348%2Chep-ph%2F0311140%2Chep-ph%2F0311092%2Chep-ph%2F0311002%2Chep-ph%2F0311119%2Chep-ph%2F0311027%2Chep-ph%2F0311330%2Chep-ph%2F0311201%2Chep-ph%2F0311061%2Chep-ph%2F0311237%2Chep-ph%2F0311180%2Chep-ph%2F0311220%2Chep-ph%2F0311100%2Chep-ph%2F0311173%2Chep-ph%2F0311302%2Chep-ph%2F0311281%2Chep-ph%2F0311033%2Chep-ph%2F0311354%2Chep-ph%2F0311075%2Chep-ph%2F0311001%2Chep-ph%2F0311078%2Chep-ph%2F0311014%2Chep-ph%2F0311131%2Chep-ph%2F0311077%2Chep-ph%2F0311280%2Chep-ph%2F0311164%2Chep-ph%2F0311121%2Chep-ph%2F0311031%2Chep-ph%2F0311239%2Chep-ph%2F0311126%2Chep-ph%2F0311167%2Chep-ph%2F0311263%2Chep-ph%2F0311248%2Chep-ph%2F0311335%2Chep-ph%2F0311311%2Chep-ph%2F0311312%2Chep-ph%2F0311111%2Chep-ph%2F0311018%2Chep-ph%2F0311284%2Chep-ph%2F0311129%2Chep-ph%2F0311041%2Chep-ph%2F0311159%2Chep-ph%2F0311106%2Chep-ph%2F0311148%2Chep-ph%2F0311084%2Chep-ph%2F0311314%2Chep-ph%2F0311034%2Chep-ph%2F0311081%2Chep-ph%2F0311128&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Within the minimal supersymmetric standard model (MSSM), the large tan(beta)\nregime can lead to important modifications in the pattern of CP-violating\nsources contributing to low energy electric dipole moments (EDMs). In\nparticular, four-fermion CP-violating interactions induced by Higgs exchange\nshould be accounted for alongside the constituent EDMs of quarks and electrons.\nTo this end, we present a comprehensive analysis of three low energy EDM\nobservables - namely the EDMs of thallium, mercury and the neutron - at large\ntan(beta), in terms of one- and two-loop contributions to the constituent EDMs\nand four-fermion interactions. We concentrate on the constrained MSSM as well\nas the MSSM with non-universal Higgs masses, and include the CP-violating\nphases of mu and A. Our results indicate that the atomic EDMs receive\nsignificant corrections from four-fermion operators, especially when Im(A) is\nthe only CP-violating source, whereas the neutron EDM remains relatively\ninsensitive to these effects. As a consequence, in a large portion of the\nparameter space, one cannot infer a separate bound on the electron EDM via the\nexperimental constraint on the thallium EDM. Furthermore, we find that the\nelectron EDM can be greatly reduced due to the destructive interference of one-\nand two-loop contributions with the latter being dominated by virtual staus."}, "authors": ["Durmus Demir", "Oleg Lebedev", "Keith A. Olive", "Maxim Pospelov", "Adam Ritz"], "author_detail": {"name": "Adam Ritz"}, "author": "Adam Ritz", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/j.nuclphysb.2003.12.026", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/hep-ph/0311314v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-ph/0311314v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "39 pages, 17 figures", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-ph/0311314v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-ph/0311314v1", "journal_reference": "Nucl.Phys.B680:339-374,2004", "doi": "10.1016/j.nuclphysb.2003.12.026", "fulltext": "arXiv:hep-ph/0311314v1 24 Nov 2003\n\nUMN–TH–2222/03\nFTPI–MINN–03/34\nDAMTP–2003–126\nUVIC–TH–03/09\nDESY 03-187\nhep-ph/0311314\nNovember 2003\n\nElectric Dipole Moments in the MSSM at Large tan β\nDurmus Demir (a) , Oleg Lebedev (b) , Keith A. Olive (a) , Maxim Pospelov (c,d) and\nAdam Ritz (e)\n(a)\n\nTheoretical Physics Institute, School of Physics and Astronomy,\nUniversity of Minnesota, Minneapolis, MN 55455, USA\n(b)\n\n(c)\n\nDESY Theory Group, D-22603 Hamburg, Germany\n\nCentre for Theoretical Physics, CPES, University of Sussex, Brighton BN1 9QJ, UK\n(d)\n\nDeptartment of Physics and Astronomy, University of Victoria,\nVictoria, BC, V8P 1A1 Canada\n\n(e)\n\nDepartment of Applied Mathematics and Theoretical Physics,\nCentre for Mathematical Sciences,\nUniversity of Cambridge, Wilberforce Rd., Cambridge CB3 0WA, UK\n\nAbstract\nWithin the minimal supersymmetric standard model (MSSM), the large tan β regime\ncan lead to important modifications in the pattern of CP-violating sources contributing\nto low energy electric dipole moments (EDMs). In particular, four-fermion CP-violating\ninteractions induced by Higgs exchange should be accounted for alongside the constituent\nEDMs of quarks and electrons. To this end, we present a comprehensive analysis of three\nlow energy EDM observables – namely the EDMs of thallium, mercury and the neutron –\nat large tan β, in terms of one- and two-loop contributions to the constituent EDMs and\nfour-fermion interactions. We concentrate on the constrained MSSM as well as the MSSM\nwith non-universal Higgs masses, and include the CP-violating phases of μ and A. Our\nresults indicate that the atomic EDMs receive significant corrections from four-fermion\noperators, especially when Im(A) is the only CP-violating source, whereas the neutron\nEDM remains relatively insensitive to these effects. As a consequence, in a large portion\nof the parameter space, one cannot infer a separate bound on the electron EDM via the\nexperimental constraint on the thallium EDM. Furthermore, we find that the electron EDM\ncan be greatly reduced due to the destructive interference of one- and two-loop contributions\nwith the latter being dominated by virtual staus.\n\n\f1\n\nIntroduction\n\nElectric dipole moments (EDMs) of the neutron [1] and heavy atoms and molecules [2, 3,\n4, 5, 6, 7, 8] are primary observables in testing for flavor-neutral CP violation. The high\ndegree of precision with which various experiments put limits on possible EDMs translates\ninto stringent constraints on a variety of extensions of the Standard Model at and above the\nelectroweak scale (see, e.g. [9]). The experiments that currently champion the best bounds\non CP-violating parameters are the atomic EDMs of thallium and mercury and that of the\nneutron:\n|dTl | < 9 × 10−25 e cm\n|dHg | < 2 × 10−28 e cm\n|dn | < 6 × 10−26 e cm.\n\n(1.1)\n\nIn this paper we address the theory of electric dipole moments in supersymmetric\n(SUSY) models with a large ratio of Higgs vacuum expectation values, or tan β. Models with large tan β have recently received significant attention, stimulated in part by the\nfinal LEP results that impose significant constraints on the Higgs sector of the MSSM and\nimply a relatively large tan β, tan β >\n∼ 5 [10]. Another motivation for large tan β stems\nfrom unified theories, which allow for the unification of top and bottom Yukawa couplings\nwhen tan β ∼ 50 [11].\n\nSupersymmetric models with the minimal field content (MSSM) allow for the presence\nof several CP-violating phases even in the most restrictive ansatz of flavor universality in\nthe squark and slepton sectors. The null experimental EDM results pose a serious problem\nfor the MSSM with superpartner masses around the electroweak scale. Indeed, a typical\nCP-violating SUSY phase of order one combined with O(100 GeV − 1 TeV) masses for\nsuperpartners would violate experimental constraints by up to three orders of magnitude\n[12]. This generally requires the CP-violating phases to be very small, unless there are\ncancellations among different contributions [13, 14, 15] but these are largely disfavored by\nthe mercury EDM constraint [16, 17, 18]. In string models, there are further complications\nsince large EDMs are generally induced even if the SUSY breaking dynamics conserve CP (in\nthe sense that the SUSY breaking F–terms are all real) [19]. Suppression of these unwanted\neffects requires rather special circumstances, e.g. dilaton domination with an approximate\naxial symmetry [20]. Other options to avoid overproduction of EDMs in SUSY models\ninclude heavy sfermions [21], the presence of extra dimensions [22], additional symmetries\n[23, 24], etc. Yet, despite the sizeable literature on EDMs in supersymmetric models, EDM\nconstraints at large tan β remain poorly explored.\nWith this situation in mind, it is natural to ask what changes to the EDM predictions\nwill occur at large tan β? One simple observation is that the EDMs of the down quarks\nand the electrons, as induced by SUSY CP-violating phases, tend to grow because of their\ndependence on the down-type Yukawa couplings which translates into a linear enhancement\nin tan β. The second and in some sense more profound change was for a long time overlooked\nin the SUSY–EDM literature. At large tan β, the observable EDMs of neutrons and heavy\n1\n\n\fatoms receive contributions not only from the EDMs of the constituent particles, such as\nelectrons and quarks, but also from CP-odd four-fermion operators. The latter operators,\nsince they are induced by Higgs exchange, receive an even more significant enhancement by\nseveral powers of tan β. The necessity of including these operators in the EDM analysis was\nshown by Barr [25] for the case of a two Higgs doublet model with spontaneous breaking of\nCP, and recently by Lebedev and Pospelov [26] for the MSSM with explicit CP violation.\nIn this paper, we present a thorough analysis of EDMs in the large tan β regime. We\nanalyze the predictions for the three observables that champion the best constraints on\nthe CP-odd sector of the theory: the atomic EDMs of thallium and mercury [2, 3], and\nthe neutron EDM [1]. The restrictive assumption of Ref. [26] on the parametrically large\nsuperpartner mass scale will be lifted in this paper, and the effects of the four-fermion operators are analyzed alongside the usual electron and quark EDM and color EDM (CEDM)\ncontributions. We first consider a framework in which the scalar and gaugino masses, m0\nand m1/2 , as well as the tri-linear terms A0 , are unified at the GUT scale, i.e. the constrained MSSM (CMSSM) [27, 28]. In the CMSSM, the Higgs mixing mass, μ, and the\npseudoscalar Higgs mass, mA , are determined by the GUT scale parameters, m1/2 , m0 , A0 ,\nand tan β using the radiative electroweak symmetry conditions. The sign of μ is also free\nin the CP-conserving version of the CMSSM. We then repeat the same analysis for the\ncase when scalar universality is relaxed in the Higgs sector (NUHM) [29, 30]. In this case,\nthe Higgs soft masses m1 and m2 can be chosen independently of the squark and slepton\nmasses, which remain unified at the GUT scale. Alternatively, one may choose μ and mA\nas free parameters and use the RGEs to determine m1 and m2 at the GUT scale. The\npositivity of m21 and m22 at the GUT scale may impose a restriction on the parameter space\nin this case.\nThe universality of the gaugino masses at the GUT scale limits the number of physical\nSUSY CP-violating phases to two1 , which in the real gaugino mass basis can be identified\nwith the phases of the μ and A parameters. We perform the analysis separately for these\ntwo phases, as the scaling of the EDMs with tan β is quite different in each case.\nThe paper is organized as follows. In the next section we review the structure of the\neffective CP-odd Lagrangian at 1 GeV. We argue that at large tan β it should be modified\nby the presence of four-fermion operators. We then estimate the SUSY parameter regimes\nwhere these contributions become important sources for EDMs. Section 3 calculates the\nsupersymmetric threshold corrections that induce CP violation via Higgs exchange. Section\n4 addresses the modifications of the thallium, mercury and neutron EDMs due to the\npresence of four-fermion operators and provides general formulae for these observables. In\nsection 5 we perform a numerical analysis of EDMs at tan β = 50 in the CMSSM and\nthe NUHM. Section 6 concludes the paper by summarizing the modifications to the EDM\nbounds at large tan β and discussing the importance of different contributions to the EDMs.\n1\n\nThis is a consequence of the U(1)R and Peccei–Quinn symmetries which allow us to eliminate two\nCP-violating phases (those of Bμ and gaugino masses). In the flavor–nonuniversal case, some of the phases\ncan also be rotated away by redefining the quark superfields, such that the physical SUSY CP-violating\nphases are reparametrization invariant combinations of the SUSY and SM flavor structures [31].\n\n2\n\n\fSome additional details on relevant hadronic calculations are given in appendices A and B.\n\n2\n\nThe structure of the low energy Lagrangian\n\nWe begin by recalling the standard structure of the effective CP-odd Lagrangian normalized\nat 1 GeV, which is the lowest scale allowing for a perturbative quark-gluon description. It\nincludes the theta term, the Weinberg operator, the EDMs of quarks and electrons, and\nthe color EDMs of quarks:\nLef f =\n\ngs2\ne μν,a + 1 w f abc Ga G\ne νβ,b G μ,c\nθ̄ Gaμν G\nμν\nβ\n2\n32π\n3\ni X\ni X e\n−\ndi ψ i gs (Gσ)γ5 ψ + * * *\ndi ψ i (F σ)γ5 ψ −\n2 i=e,u,d,s\n2 i=u,d,s\n\n(2.2)\n\nFor a given pattern of supersymmetry breaking di , d ̃i , and w can be calculated explicitly, via\none or two-loop SUSY diagrams, and evolved down to 1 GeV using perturbative QCD. On\nthe other hand, only the additive radiative corrections to the theta term can be calculated,\nleaving θ̄ as a free parameter subject to an arbitrary initial condition. In supersymmetric\nmodels with CP-violating phases larger than ∼ 10−8 in the flavor-diagonal sector the only\nreasonable strategy to avoid the strong CP problem is to postulate the existence of the\nPeccei-Quinn relaxation mechanism [32], which removes the theta term from the list of\ncontributing operators. We will therefore adopt this strategy and discard θ̄. When tan β\nis low, possible four fermion CP-odd operators (e.g. (q̄q)(q̄iγ5 q) and alike) can be safely\nneglected. Indeed, these operators involve a double flip of helicity associated with an\nadditional (mq /vEW )2 suppression, and this makes these operators effectively of dimension\n8, and thus totally negligible.\nThe dependence of the experimentally measured EDMs of neutrons, and paramagnetic\nand diamagnetic atoms, on the Wilson coefficients in (2.2), as calculated at low tan β, can\nbe symbolically presented in the following way:\ndTl = dTl (de )\ndn = dn (θ̄, di , d ̃i , w)\ndHg = dHg (θ̄, d ̃i , di , w)\n\nat low tan β.\n\n(2.3)\n\nThe dependence of the EDMs of paramagnetic atoms and molecules (such as thallium)\non the electron EDM alone makes them the most valuable observables for SUSY models,\nas they allow us to link the experimental results directly to a calculable combination of\nCP-violating phases, and slepton and gaugino masses, while the uncertainty of atomic\ncalculations enters as an overall factor. In fact, due to this property of paramagnetic\nEDMs, it is customary to quote the limit on de directly, skipping the actual experimental\nlimit on the EDM of the paramagnetic atom. The EDMs of the neutron and mercury are\nfar more complicated as a variety of hadronic (and in the case of mercury also nuclear and\n3\n\n\fatomic) matrix elements are needed in order translate the experimental results into limits\non a specific combination of the Wilson coefficients.\nThe structure of the effective Lagrangian becomes even more complicated if tan β is\ntaken to be a large parameter. Indeed, the operators induced by Higgs exchange that\ninvolve down-type quarks and charged leptons grow rapidly with tan β [26]. For now, we\nparametrize these operators by coefficients Cij ,\nL4f\nef f =\n\nX\n\nCij (ψ̄i ψi )(ψ̄j iγ5 ψj ),\n\n(2.4)\n\ni,j=e,d,s,b\n\nwhere i, j run over flavor indices and the second index always indicates the fermion flavor\nthat enters (2.4) via a pseudoscalar bilinear. These operators represent a subclass of the\nlarger set of all possible CP-odd flavor-conserving four-fermion operators considered in\n[33, 34, 35]. Note that the b-quark is heavy compared to the scale of 1 GeV and thus can be\nintegrated out, producing new dimension 7 operators ψ̄i ψi (Gaμν G̃μν,a ) and ψ̄i iγ5 ψi (Gaμν Gμν,a )\nand leading to new higher loop contributions to di , d ̃i and w. With this procedure in mind,\nwe prefer to keep the coefficients Cbi and Cib explicitly so that integrating out the b-quarks\nis interpreted as part of taking the corresponding matrix element.\nWhen the contributions from Cij are not negligible, the relation between the observables\nand the SUSY parameters encoded in the Wilson coefficients of Eqs. (2.2) and (2.4) becomes\nconsiderably more involved:\ndTl = dTl (de , Cde , Cse , Cbe )\ndn = dn (θ̄, di , d ̃i , w, Cq1q2 )\ndHg = dHg (θ̄, di , d ̃i , w, Cij ).\n\nat large tan β.\n\n(2.5)\n\nParamagnetic EDMs lose their one-to-one relation to de , as they also become dependent on\noperators that involve quarks and gluons, and as a consequence are subject to considerable\nhadronic uncertainties. Hence, at large tan β, a separate bound on de simply may not\nexist, and the bound on the EDM of the paramagnetic atom (molecule) as a whole should\nbe used instead. The mercury EDM receives a number of additional contributions from\nsemileptonic and pure hadronic four-fermion operators. As a consequence, (d ̃u − d ̃d ) may\nno longer be the dominant contribution to dHg in contrast to the situation at low tan β\n[16]. Thus, the large tan β regime is qualitatively different from tan β ∼ O(1) and requires\na separate dedicated analysis.\nTo conclude this section, we will determine a combination of SUSY parameters that\nregulates which effect is more important: one-loop EDMs or four-fermion operators. The\nrequired interpolating parameter can be deduced from the asymptotics of the one-loop\nEDMs and four-fermion operators in the limit of a generic heavy superpartner mass scale\nM. For simplicity, and in this section only, we will not differentiate among different superpartners and assume the same mass for squarks, sleptons, gauginos, etc.\nLet us first consider a non-zero μ–phase (relative to the gaugino mass). While the oneloop EDMs generally scale as di /mi ∼ μmλ tan β sin θμ /M 4 , the leading order contributions\n4\n\n\fto Cij scale as C ∼ μmλ (tan β)3 sin θμ /(M 2 m2A ) [26], where θμ is the CP-violating phase,\nmλ is a gaugino mass, and M = max(m0 , m1/2 ) stands for a sfermion or gaugino mass,\nwhichever is larger. Thus, we can introduce the following combination of SUSY parameters\nthat interpolates between the two regimes:\nξ≡\n\nM\ntan β.\nmA\n\n(2.6)\n\nIn the limit of large M, with mA fixed at the electroweak scale, all EDM-like observables\nare dominated by the four-fermion operators [26]. When M is kept finite, there is a certain\ncritical value for ξ below which the usual one-loop EDMs dominate the observables, and\nabove which the four-fermion operators are more important.\nUsing the results of Refs. [26, 16], we can estimate the critical value for ξ in the limit\nwhen all superpartner masses are approximated by some heavy scale m0 ∼ m1/2 ∼ M >\n∼\nvEW ∼ 246 GeV, while mA is kept fixed near the electroweak scale. If all CP violation is\ninduced by θμ , the relative importance of the two sources is determined by the ratio\n\u0014\n\ndTl (Cij )\nM\ntan β\n≃ 10−5\ndTl (de )\nmA\n\n\u00152\n\n= 10−5 ξ 2 ,\n\n(2.7)\n\nwhich suggests a critical value for ξ,\nξc ∼ 300\n\nfor\n\nθμ 6= 0.\n\n(2.8)\n\nFrom this estimate it becomes clear that when mA ≃ M the effects of the four-fermion\noperators are subleading but not negligible, reaching 20% of the de contribution at maximal\ntan β. On the other hand, even a mild hierarchy between the mass scales, M >\n∼ 5mA , may\nlead to a contribution to atomic EDMs comparable to de , or even to dominance of the\nfour-fermion contributions.\nIn the case of the other CP-violating phase θA , the relative phase of the A parameter\nand the gaugino mass, we estimate that the transition to dominance of the four-fermion\noperators takes place at\nξc tan1/2 β ∼ 500\n\nfor\n\nθA 6= 0.\n\n(2.9)\n\nHere, the additional power of tan β arises from the fact that the one-loop induced de (θA )\ndoes not grow with tan β. Thus in this case, even for mA ∼ M, the contribution of the\nfour-fermion operators may become comparable to de .\nBoth conditions (2.8) and (2.9) can be realized in a generic SUSY spectrum, but how realistic are they for the constrained MSSM and the MSSM with non-universal Higgs masses?\nWe note that the simple comparison of de and Cij made in this section may be subject to\nsignificant modifications, as the masses of sleptons and squarks as well as other superpartners are affected by the renormalization group evolution from the GUT scale to the\nelectroweak scale. Therefore, we now turn to a numerical comparison of all contributions\nto the EDMs for different CP-violating phases and different patterns of SUSY breaking at\nlarge tan β, as detailed in the next four sections.\n5\n\n\f3\n\nCP-odd four-fermion operators in the MSSM\n\nWe now turn to specific SUSY mechanisms that generate Cij . As shown in Ref. [26], Cij are\ngenerated primarily through the exchange of the pseudoscalar and scalar Higgs particles A\nand H with CP violation entering through vertex corrections. This dominates the one-loop\ninduced Cij due to large O(tan3 β) enhancements. Other contributions, such as CP-odd\nhigher-loop effects, SUSY box diagrams, etc., can have an even stronger dependence on\ntan β. However, these effects are further suppressed either by additional loop factors or by\nadditional powers of small Yukawa couplings and in this sense are subleading. Nevertheless,\nA − H mixing may be numerically important [26], and therefore its contribution has to be\nincluded in the EDM analysis.\n\n3.1\n\nHiggs-mediated CP-odd four-fermion operators\n\nThe tan β enhancement of certain loop corrections in the down-type quark and charged\nlepton sectors is a well studied phenomenon [36]. Supersymmetric threshold corrections,\nsuch as those in Fig. 1, generate a new Yukawa interaction which is absent in the limit of\nexact supersymmetry. As a result, below the superpartner scale, the Yukawa interactions\nin the D-quark and charged lepton sectors are given by\n−LY\n\n(0)\n\n(1)\n\n†\n†\n= (YD + YD )H1 DR\nDL + YD H2† DR\nDL\n(0)\n\n(1)\n\n+(YE + YE )H1 ER† EL + YE H2† ER† EL + h.c. ,\n\n(0)\n\n(3.10)\n\n(1)\n\nwhere YD,E are the tree level Yukawa couplings and YD,E and YD,E are the one-loop-induced\ncouplings. Thus, instead of being the Yukawa sector of a type II two-Higgs doublet model,\nEq. (3.10) represents a generic two Higgs doublet model where Higgs exchange may lead\nto violation of CP. One should keep in mind that Eq. (3.10) is valid in the limit of heavy\nsuperpartners. If the scale of SUSY breaking is close to the electroweak scale one should\n†\nalso include additional radiatively generated operators, e.g. (H2† H2 )n H2† DR\nDL .\nDue to flavor universality in the soft-breaking sector, flavor-changing effects can be\n(0)\nignored in EDM calculations, and a simple linear relation between YD,E and YD,E holds for\nevery D and E flavor:\n(0)\n(0)\nY D = JD Y D ,\nY E = JE Y E .\n(3.11)\nThe calculation of the loop functions JD and JE is straightforward but tedious, as a large\nnumber of SUSY diagrams contribute. Nevertheless, an analytical result for this set of loop\ndiagrams is possible, and we present it in the next subsection.\nSUSY CP violation arises from a mismatch between the phases of the μ and A parameters, and m1/2 , and leads to complex masses and Yukawa couplings. The quark and lepton\nmasses,\n(0)\n\n(1)\n\n†\n†\n−Lmass = (YD + YD )hH1 iDR\nDL + YD hH2 iDR\nDL\n(0)\n\n(1)\n\n+(YE + YE )hH1 iER† EL + YE hH2 iER† EL + h.c. ,\n6\n\n(3.12)\n\n\f~\nDL\n\n~\nQL\n\n~\nDR\n\nD\n\n~\nDR\n\nD\nλ1 , λ 3\n\nD\nλ1 , λ 2\n\n(a)\n\n~\nH\n\n(b)\n\nλ1\n\n~\nH\n\n(c)\n~t\nL\n\n~t\nR\n\nb\n~\nH\n\n(d)\n\nFigure 1: One-loop SUSY threshold corrections in the down quark and charged lepton\nYukawa sectors. All four types of diagrams are relevant for the b-quark, while only (a)-(c)\ncontribute in the case of d and s quarks, and the electron. Here λi denote the gauginos.\nThe vacuum insertion of hH2 i indicated by a cross is for illustrative purposes only as all\ncalculations are performed in the mass eigenstate basis.\n\ncan be made real via a chiral rotation of the D and E fields,\n(m)\n\n(m)\n\nER → e−iδE ER ,\n\nDR → e−iδD DR ,\n\n(3.13)\n\nwhere the rotation angles are defined by tan β and the loop functions Ji :\n(m)\n\nδi\n\n(0)\n\n= Arg(Yi\n\n(1)\n\n+ Yi\n\n(0)\n\n+ Yi tan β) ≃ Arg(Yi\n\n(1)\n\n+ Yi ) + Arg(1 + Ji tan β),\n\n(3.14)\n\n(1)\n\nwhere i = d, s, b, e are the flavors of interest. Yi contains a loop suppression factor and\nthus can be neglected. However, a large value of tan β can compensate the loop suppression\nof Yi so that the phases Arg(1 + Ji tan β) can be of order one. The vertices of the A and H\nHiggs bosons and fermions, as derived from the Lagrangian (3.10), also contain a complex\nphase:\n(H)\n(0)\n(1)\n(0)\n(1)\nδi = Arg((Yi + Yi ) tan β + Yi ) ≃ Arg(Yi + Yi ).\n(3.15)\nThis equation is written under the assumption that tan β is a large parameter. The difference between these two phases,\n(m)\n(H)\nδi = δi − δi ,\n(3.16)\nconstitutes a physical CP-violating phase that enters into the interactions of H and A with\nphysical fermions ψi ,\nLCPV = −\n\n\u0010\n\u0011\nY\n√i sin δi ψ̄i ψi A + ψ̄i iγ5 ψi H .\n2\ni=d,s,b,e\nX\n\n7\n\n(3.17)\n\n\fe\n\ne\n\nCP\n\nA\n\nH\nD\n\nD\nCP\n\n(a)\n\n(b)\n\nFigure 2: The Higgs-mediated electron-quark interaction Cqe with CP violation at the\nHiggs-quark vertex (a) and at the Higgs-electron vertex (b).\n(0)\n\n(1)\n\nNote that the phase Arg(Yi + Yi ) drops out of the expression for δi as it should. An\nexchange by the physical Higgses, as in Fig. 2, will then produce CP–odd four–fermion\ninteractions with the following coefficients\n(vc)\n\nCij (i, j = e, d, s, b) = −\n\ntan2 β YiSM YjSM sin(δi − δj )\n.\n2m2A |1 + Ji tan β||1 + Jj tan β|\n\n(3.18)\n\n√\nHere YfSM denote the Standard Model values for the Yukawa couplings, YfSM ≡ 2mf /v\n(vc)\n(v=246 GeV), and the superscript of Cij signifies that this contribution originates from\na vertex correction. Note also that at leading order in tan β an exchange by the (lightest)\nh-Higgs does not contribute to Cij , the difference between mA and mH can be ignored, and\nthe neutral Higgs mixing angle is trivial, cos2 α ≃ 1.\nExamining expression (3.18), we notice immediately that\n(vc)\n\nCij\n\n(vc)\n\n= −Cji ,\n\n(3.19)\n\nand thus vertex corrections do not generate four-fermion operators that involve a single\n ̄ diγ\n ̄ 5 d.\nflavor such as, for example, dd\nCombining Eqs. (3.14) and (3.18), we observe that the coefficients Cij grow as O(tan3 β)\nas long as Ji(j) tan β < 1, which is true for almost the entire available domain of tan β.\nMoreover, the cubic growth of Cij generated at one loop due to explicit CP violation in\nthe soft breaking sector is distinct from the O(tan2 β)-behavior of Cij in two-Higgs doublet\nmodels with spontaneous CP violation [25].\n3.1.1\n\nBeyond the limit of heavy superpartners\n\nIn order to go beyond the approximation of heavy superpartners, one\n√ should reformulate\n(0)\n(0)\nEq. (3.18) in terms of the tree-level fermion masses mi = Yi v1 / 2 and the one-loop\nSUSY corrections to the fermion masses ∆mi , where all operators neglected in Eq. (3.10)\n\n8\n\n\fA\n\nD, E\n\nλ\n\nD\n\nD, E\n~~\nt,b\n\n~\nD\n\nH\n\n~\nD\n\nD\n\nD\n\nλ\n\n(a)\n\n~\nE\n\nE\n~\nH\n\nλ\n\nλ\n\n~\nH\n~\nD\n\n(c)\n\n(b)\n\nFigure 3: Diagrams that generate subleading contributions to Cij . (a) is the radiatively\ngenerated H − A mixing, and (b)-(c) are typical box diagrams.\n\nare included2 . The one-loop-corrected mass terms can be made real by a phase redefinition\n(3.13) with the phase now given by\n(m)\n\nδi\n\n(0)\n\n= Arg(1 + ∆mi /mi ) .\n\n(3.20)\n\n(0)\n\nHere we assume for convenience that mi is real. In the large tan β regime, the couplings\n(0)\nof A and H Higgses to fermions can be obtained as a derivative of mi + ∆mi with respect\nto hH1 i = v1 at v1 = 0, and thus the phase δ (H) is now given by\n(H)\nδi\n\n\n\n\n\n(0)\n\n∂(mi + ∆mi ) \n= Arg \n.\n∂v1\n(H)\n\n(3.21)\n(m)\n\nIn the large tan β regime it is natural to expect that δi ≪ δi , so that the physical CP(0)\nviolating phase δi is given by Arg(1+∆mi /mi ). However, in practice it often happens that\n(H)\nδi cannot be neglected (see Sec. 5.1). Finally, the coefficients 1 + Ji tan β appearing in the\n(0)\ndenominator of Eq. (3.18) should also be replaced by the expression 1 + ∆mi /mi (which\n(0)\n(0)\nis independent of mi because ∆mi is proportional to mi ). With these modifications,\nEq.(3.18) takes the form\n(vc)\n\nCij (i, j = e, d, s, b) = −\n\nYiSM YjSM sin(δi − δj )\ntan2 β\n,\n(0)\n2m2A |1 + ∆mi /m(0)\ni ||1 + ∆mj /mj |\n\n(3.22)\n\nwhere the phases δi are given in the expressions (3.16), (3.20) and (3.21). Eq. (3.22)\nshows that the crucial step in calculating the CP-odd operators Cij is finding the one-loop\ncorrection to the masses of the d, s, b quarks and the electron.\nAt subleading order in tan β, there are a large number of diagrams that contribute to\nCij , examples of which are given in Fig. 3. The complete calculation of these diagrams\ngoes beyond the scope of the present paper. However, as shown in Ref. [26], the CP-odd\n2\n\nA more complete approach would necessitate the use of the Coleman–Weinberg effective potential. For\nour purposes, however, it suffices to truncate the series of non–renormalizable operators.\n\n9\n\n\fmixing of H − A Higgs bosons may sometimes be numerically important and comparable\nto (3.22). However, since the H − A mixing term contains either a loop factor which is\nSM 2\nnot compensated by large tan β or a suppression by (Yb(τ\n) ) tan β, H − A mixing may\nonly become significant with the help of an additional mass hierarchy. In particular, if the\nfollowing combination is large [26, 37],\nA2 μ2 v 2\n≫ 1,\nm4squark m2A\n\n(3.23)\n\nH − A mixing may provide a sizeable contribution to the EDMs. The box diagrams scale\ndifferently and lose their importance when the superpartners are heavy, m0 ∼ m1/2 ≫ v.\nSince this is one of the most interesting domains of the parameter space, we include the\neffects of H − A mixing and neglect the box diagrams.\n\nThe coefficients Cij induced by diagrams 3a can be calculated with the use of the\nfollowing formula:\n(AH)\nCij\n\nYiSM YjSM\nhAHi tan2 β\n,\n≃\n(0)\n(0)\n2m4A\n|1 + ∆mi /mi ||1 + ∆mj /mj |\n\n(3.24)\n\nwhere i, j = d, s, b, e and hAHi stands for the one-loop–generated amplitude in the effective\nHiggs Lagrangian,\n1\n1\nLH,A = − m2A A2 − m2H H 2 − hAHiAH + * * * ,\n2\n2\n\n(3.25)\n\nwhere the hAHi mixing parameter has the dimension of mass squared. Eq. (3.24) also uses\nm2H ≃ m2A ≫ hAHi and tan β ≫ 1. The effect of A−h mixing, where h ∼ Re (H2 −hH2 i), is\nnegligible under these conditions. In this approximation, it is not necessary to re-diagonalize\nthe 3 × 3 Higgs mass matrix. It suffices to simply account for hAHi by a direct insertion\n(AH)\non the Higgs line in Fig. 3a. Note that Cij\nare flavor-symmetric,\n(AH)\n\nCij\n\n(AH)\n\n= Cji\n\n,\n\n(3.26)\n\nand, unlike the vertex corrections, can generate a single flavor four-fermion operator.\n\n3.2\n\nSUSY threshold corrections in the mass sector and scalarpseudoscalar mixing\n\nIn this subsection we provide a complete set of threshold corrections ∆mi , at leading order\nin tan β, to the quark and lepton masses (ignoring flavor mixing). Let us first briefly\nsummarize our notation which, unless noted below, follows that of Ref. [38]. The chargino\nand neutralino mass matrices are diagonalized by\nU ∗ Mχ+ V † = diag(mχ+1 , mχ+2 ) ,\nN ∗ Mχ0 N † = diag(mχ01 , ..., mχ04 ) ,\n10\n\n(3.27)\n\n\fwhere U, V, and N are unitary matrices. In addition, the sfermion mass matrix is diagonalized by the matrix\n\u0012\n\u0013\ncf\nsf eiφf\n,\n(3.28)\n−sf e−iφf\ncf\n\nthat rotates the basis (f ̃L , f ̃R ) to the mass eigenstate basis (f ̃1 , f ̃2 ). Here cf ≡ cos θf ,\nsf ≡ sin θf , and θf is the sfermion mixing angle (see [38] for the explicit form of the mass\nmatrices). In our convention the CP-violating phase appearing in the sfermion mixing mass\nis given by3\nh\ni\nφf = Arg −(A∗f + μRf ) ,\n(3.29)\nwhere Rf = tan β for I3 = −1/2 and Rf = cot β for I3 = 1/2.\n\nAs argued in the previous section, a large value of tan β can compensate the loop\nsuppression of ∆mi such that the consequent CP-violating phase is of order one. Below we\nlist the relevant supersymmetric contributions to ∆mi which grow linearly with tan β. We\n(0)\nomit the superscript in mi for brevity.\n\n(i) Corrections to the down–type quark masses\nFor all three down-type flavors, d, s and b (where m3 and φ3 denote the gluino mass and\nits phase, and αW = g 2 /4π):\n2αs −i(φd +φ3 )\ne\nsd cd m3 (m2d ̃1 − m2d ̃2 )I(m2d ̃1 , m2d ̃2 , m23 ) ,\n3π\nh\ni\nX\nα md\n= − √ W\nUi2∗ Vi1∗ mχ+ c2u B̃0 (m2ũ1 , m2χ+ ) + s2u B̃0 (m2ũ2 , m2χ+ ) ,\ni\ni\ni\n4 2πmW cos β i\nX\nα\nNi1∗ (Ni1∗ tan θW − 3Ni2∗ )mχ0i\n= − W e−iφd tan θW sd cd (m2d ̃1 − m2d ̃2 )\n36π\ni\n\n(∆md )λ3 =\n(∆md )χ+\n(∆md )χ0\n\n× I(m2d ̃1 , m2d ̃2 , m2χ0 )\ni\nh\nX\nαW md\nNi3∗ (Ni1∗ tan θW − 3Ni2∗ )mχ0i c2d B̃0 (m2d ̃1 , m2χ0 )\n+\ni\n24πmW cos β i\ni\n\n+ s2d B̃0 (m2d ̃2 , m2χ0 )\n(3.30)\ni\nh\ni\nX\nαW md\nNi3∗ Ni1∗ mχ0i s2d B̃0 (m2d ̃1 , m2χ0 ) + c2d B̃0 (m2d ̃2 , m2χ0 ) .\n−\ntan θW\ni\ni\n12πmW cos β\ni\n\nIn addition, for the b-quark there is a \"pure higgsino\" contribution:\n(∆mb )χ+ = −\n\nX\nαW mt mb\niφt\n2\n2\ne\nc\ns\n(m\n−\nm\n)\nUi2∗ Vi2∗ mχ+\nt\nt\nt̃1\nt̃2\ni\n8πm2W sin β cos β\ni\n\n× I(m2t̃1 , m2t̃2 , m2χ+ ) .\ni\n\n3\n\n(3.31)\n\nThis convention for the phase of A corresponds to the following normalization of the left-right mixing\nterms in the squark mass matrix: m2LR = −mf (A∗f + μRf ).\n\n11\n\n\f(ii) Corrections to the charged lepton masses\nX\nα me\nUi2∗ Vi1∗ mχ+ B̃0 (m2ν̃L , m2χ+ ) ,\n(∆me )χ+ = − √ W\ni\ni\n4 2πmW cos β i\nX\nαW −iφe\nNi1∗ (Ni2∗ + tan θW Ni1∗ )mχ0i\ne\ntan θW se ce (m2ẽ1 − m2ẽ2 )\n(∆me )χ0 =\n4π\ni\n\n(3.32)\n\n× I(m2ẽ1 , m2ẽ2 , m2χ0 )\ni\nh\nαW me X ∗ ∗\n−\nNi3 (Ni1 tan θW + Ni2∗ )mχ0i c2e B̃0 (m2ẽ1 , m2χ0 )\ni\n8πmW cos β i\ni\n\n+ s2e B̃0 (mẽ22 , m2χ0 )\n(3.33)\ni\nh\ni\nX\nαW me\n−\nNi3∗ Ni1∗ mχ0i s2e B̃0 (m2ẽ1 , m2χ0 ) + c2e B̃0 (m2ẽ2 , m2χ0 ) .\ntan θW\ni\ni\n4πmW cos β\ni\nThe two loop functions entering these expressions, I and B̃0 , are given by\nxy ln x/y + yz ln y/z + xz ln z/x\n,\n(x − y)(y − z)(x − z)\nx ln x − y ln y\nB̃0 (x, y) =\n,\nx−y\n\nI(x, y, z) =\n\n(3.34)\n\nwhere the tilde in B̃0 serves to distinguish this \"truncated\" version4 of the Passarino–\nVeltman function [39] (following the definitions of [40]).\nLet us briefly discuss these results. Firstly, to gain some intuition on the relative contributions, it is instructive to consider a limiting case, where the left–right mixing is considered\na perturbation. The dominant corrections arise from (∆m(d,s,b) )λ3 and (∆mb )χ+ . For the\nfirst of these, taking m3 ∼ md ̃1 ∼ md ̃2 , we have (for d = (d, s, b))\n\u0012\n\n∆md\nmd\n\n\u0013\n\nλ3\n\n∼\n\nαs m3\n(μ tan β + A∗ ).\n3π m2d ̃\n\n(3.35)\n\nThe contribution of these threshold corrections to δd arises only from Im(μ), as the contri(m)\n(H)\nbution from Im(A) is cancelled in constructing δd − δd . From (3.35), we see that when\nμ is negative (θμ = π) there is destructive interference with the tree-level mass term.\nThe presence of an extra diagram sets the b flavor apart from d and s, for which the\nfollowing relation is expected if the soft-breaking sector is flavor-blind:\n∆ms\n∆md\n=\n, and δd = δs .\n(3.36)\nmd\nms\nFor the b quark mass, in a regime where the gaugino–higgsino mixing is also small, namely\nμ, mi ≫ mW with mi being the gaugino masses, we also find\n\u0012\n\n∆mb\nmb\n\n\u0013\n\nχ+\n\n∼ −\n\n(YtSM )2 μ∗ A∗t\ntan β,\n32π 2\nm2t̃\n\n4\n\n(3.37)\n\nNote that the expression for B̃0 requires a regulator scale. However, our physical results do not depend\non this scale.\n\n12\n\n\fwhich indicates that when μ is real and positive, so that (∆m(d,s,b) )λ3 is real, the contribution\nto δb is positive when 0 < θA < π.\nAs is apparent from the limiting cases above, we observe the appearance of the reparametrization invariant CP-violating phases. In particular, at large tan β\nφd −→ θμ + π ,\n\n(3.38)\n\nwhere θμ ≡ Arg (μ), such that the CP-odd phase entering the gluino expression is Arg (μm3 ).\nThe analogous behavior of the neutralino contributions is seen most easily in the limit\nμ, mi ≫ mW . Then,\ni\n(3.39)\nNi1∗ −→ δi1 e− 2 Arg m1 ,\nand the consequent CP-odd phase in the gaugino piece of the neutralino contribution\n√\nis Arg (μm1 ) (or Arg (μ m1 m2 )). For the higgsino contribution, the relevant phase is\nArg (Aμ) ≡ θA + θμ .\n\nIt is worth noting that the origin of the tan β–enhancement, which is not manifest in\nthe general expressions. For the gaugino contributions proportional to the I-function, this\narises implicitly via the relation\nm2d ̃1 − m2d ̃2 ∝ md tan β\n\n(3.40)\n\nat large tan β, whereas the mixing angle stays constant in this limit.\nThe tan β enhancement of the amplitudes involving the B̃0 function deserves special\ndiscussion. The relevant diagrams in the mass eigenstate basis appear to be divergent since\nthey are proportional to the Passarino–Veltman B0 function. However their tan β–enhanced\nimaginary parts are finite. As an example, let us consider the chargino contribution which\ninvolves gaugino–higgsino mixing. The relevant expression appearing in the amplitude is\nG=\n\n1 X ∗ ∗\nUi2 Vi1 mχ+ B̃0 (m2ũ1 , m2χ+ ) .\ni\ni\ncos β i\n\n(3.41)\n\nThere are in fact several compensating factors of tan β in this expression. To see this, we\nnote that Eq.(3.27) implies\nh\n\ni\n\nh\n\ni\n\nU ∗ f Mχ+ Mχ†+ Mχ+ V † = f diag(m2χ+ , m2χ+ ) diag(mχ+ , mχ+ )\n1\n\n2\n\n1\n\n2\n\n(3.42)\n\nfor any (analytic) function f . Therefore,\nG=\n\ni∗\n\u0011\n1 h \u0010 2\n.\nB̃0 mũ1 , Mχ+ Mχ†+ Mχ+\n21\ncos β\n\n(3.43)\n\nIf B̃0 here is replaced\nby a constant independent of Mχ+ , no tan β enhancement appears\n√\nsince [Mχ+ ]21 = 2mW cos β. This is the reason why the tan β–enhanced contribution is\nfinite and the original Passarino–Veltman function gets replaced by its \"truncated\" version.\n13\n\n\fIt is instructive to expand B̃0 in powers of (Mχ+ Mχ†+ − m2ũ1 )/m2ũ1 and extract the first\ntan β-enhanced term. Using the explicit form of the chargino mass matrix, one finds\nμ∗ m∗\nG −→ √ 22 mW tan β .\n2mũ1\n\n(3.44)\n\nThis result can be understood via the mass–insertion approximation [41, 42]. To obtain\ntan β enhancement, it is necessary to introduce three mass insertions on the chargino line:\nμ – to mix H̃1 with H̃2 , mW sin β – to mix the higgsinos and gauginos, and m2 – to get the\nchirality flip in the diagram. Similar considerations apply to the neutralino contributions.\nWe note that analogous calculations have been performed in Refs.[42] and [43].\n(iii) Scalar-pseudoscalar mixing\nThe computation of H −A mixing is straightforward, especially in the limit m2A ≫ hAHi\n[44]. Non-negligible contributions arise only from stop, sbottom and stau loops:\n\"\n\n3\nm4t |μ|2 |At |2\nhAHi =\nE(m2t̃2 /m2t̃1 ) sin(2θAt + 2θμ )\n8π 2 v 2 (m2t̃1 − m2t̃2 )2\n+\n\nm4b |μ|2 |Ab |2 tan4 β\nE(m2b̃2 /m2b̃1 ) sin(2θAτ + 2θμ )\n(m2b̃ − m2b̃ )2\n1\n\n2\n\n(3.45)\n#\n\nm4 |μ|2|Aτ |2 tan4 β\n+ τ 2\nE(m2τ̃2 /m2τ̃1 ) sin(2θAτ + 2θμ ) ,\n3(mτ̃1 − mτ̃22 )2\n\nwhere the loop function is given by E(a) = −2 + (a + 1)(a − 1)−1 ln a. At moderate tan β\nthe stau and sbottom contributions are heavily suppressed due to the factor of m4b(τ ) in\nthe numerator. However, this is not true at large tan β, as the fourth power of tan β can\novercome this suppression.\nIt is important to note that hAHi is even under flipping the sign of A, unlike the\neffects of the vertex corrections. Thus, these two sources can interfere constructively or\ndestructively, depending on the position in parameter space. For example, choosing θμ = 0\n(vc)\n(AH)\nand 0 < θA < π/2 leads to destructive interference between Cij and Cij .\n\n4\n\nSynopsis of the EDM formulae\n\nIn this section, we compile the different contributions into physical observables measured in\nvarious EDM experiments. Such observables can be subdivided into three main categories:\nEDMs of paramagnetic atoms and molecules, EDMs of diamagnetic atoms, and the neutron\nEDM.\n\n4.1\n\nEDMs of paramagnetic atoms – thallium EDM\n\nAmong various paramagnetic systems, the EDM of the thallium atom currently provides\nthe best constraints on fundamental CP violation and is often interpreted directly in terms\n14\n\n\fof the EDM of the electron. We therefore specialize our analysis to the case of Tl, noting\nthat the conditions making Cij important for thallium will also be applicable to other\nparamagnetic systems such as the YbF and PbO molecules, where significant experimental\nimprovements in EDM measurements are likely [7, 8].\nThe semileptonic four-fermion operators (2.4) induce the following T-odd nucleonelectron interactions5 [9],\nLeN = CS ēiγ5 eN̄N + CP ēeN̄iγ5 N + CT ǫμναβ ēσ μν eN̄ σ αβ N,\n\n(4.46)\n\nwhere the isospin dependence is suppressed. Among these couplings, CS plays by far the\nmost important role for the EDM of paramagnetic atoms because it couples to the spin of\nthe electron and is enhanced by the large number of nucleons in heavy atoms.\nA number of atomic calculations [45, 46, 47] (see also Ref. [9] for a more complete list)\nhave established the relation between the EDM of thallium, de , and the coefficients of the\nCP-odd electron-nucleon interactions CS :\ndTl = −585de − e 43 GeV × (CSsing − 0.2CStrip ).\n\n(4.47)\n\nThe relevant atomic matrix elements are calculated to within 10 − 20% accuracy [48]. Here\nthe relative contribution of the isospin-triplet coupling is suppressed by (N − Z)/A ≃ 0.2,\nand the effects of CP and CT are negligible.\nBefore turning to the contributions to CS , we recall for completeness (and to fix our\nconventions) that the electron EDM de receives a number of well-known contributions from\nsuperpartner loops. At one-loop order, threshold corrections from ẽ − χ+ and ẽ − χ0 loops\ndominate, and we follow the notation of Ibrahim and Nath [14] for these terms (up to a\ndifferent convention for the squark mixing angles as specified earlier). At two-loop order,\nnon-negligible Barr-Zee–type Higgs-mediated graphs contribute [49], where CP violation\nenters through the couplings of (s)fermions to the pseudoscalar Higgs A. We follow the\nwork of Chang, Keung and Pilaftsis [49] (though our phase conventions are somewhat\ndifferent) and to emphasize an additional contribution, we quote the full expression below:\ndtwo−loop\ne\n\n\n\n\n\n\n\n\n\n\n\nm2j̃2\nm2j̃1\nαem me X\n2\n\n tan β,\n\n\n\n= |e|Qe\n−F\nζj Qj Nj F\n32π 3 m2A j=t,b,τ\nm2A\nm2A\n\n(4.48)\n\nwhere j = t, b, τ are flavors running in the sfermion loop. Nt = Nb = 3, and Nτ = 1,\naccounts for the trace over color, while the two-loop function F (z) is given explicitly in\n[49]. The CP-violating couplings in our conventions are:\nζj =\n\nsin(2θj )mj Rj Im(μe−iφj )\n,\nv 2 sin β cos β\n\n(4.49)\n\nNote that while there are in principle a large number of possible diagrams in this class\n[50], those containing stop, sbottom, and stau loops should be dominant at large tan β. We\n5\n\nNote that we differ from Ref. [9] in the definition of γ5 , so that we use PL = (1 − γ5 )/2.\n\n15\n\n\femphasize here that the stau-loop contribution, which has hitherto been neglected in the\nliterature, is a significant addition – in fact for the CMSSM and NUHM at tan β = 50 to\nbe considered here, it often provides the dominant contribution due to the generically light\nstaus.\nIn order to see the dependence on the reparametrization invariant phases, it is useful to\nagain consider the small-mixing regime where m2L ∼ m2R ≫ m2A , m2LR . For large tan β, the\nEDM then reduces to\n\n\n\n\nm2j̃\ntwo−loop\n2\nSM 2 αem me |μAj |\n sin(θA + θμ ) tann β,\n\nln\nde\n(j = t, b, τ ) ∼ −Qj Nj (Yj )\nj\n192π 3 m4j̃\nm2A\n\n(4.50)\n\nwhere we used Qe = −1, and defined n as n = 1 for j = t and n = 3 for j = b, τ . It is\nimportant to recognize that when θμ = 0 the two-loop contribution to the electron EDM is\nnegative which interferes destructively with the one-loop contribution referred to above6 .\nHaving accounted for de , the calculation of CS induced by (2.4) follows from the lowenergy theorem that expresses the nucleon matrix element of αs Gμν Gμν in terms of the\nmass of the nucleon and the QCD beta function [52]. As a consequence of this theorem, for\na heavy quark Q, hN|mQ Q̄Q|Ni ≃ 70 MeV. This theorem is valid in the exact chiral limit,\nand thus receives corrections from the non-zero values of the light quark masses. Following\n[26], we parametrize the ms s̄s matrix element as κ ≡ hN|ms ss|Ni/220 MeV. Using this\nparametrization, as well as the measured value of (mu + md )hN|uu + dd|Ni/2 ≃ 45 MeV\nand the ratio of the quark masses mu /md ≃ 0.55, we arrive at the following general formula\nfor CS in terms of Cqe ,\n29 MeV\nκ × 220 MeV\n66 MeV(1 − 0.25κ)\n+ Cse\n+ Cbe\n,\nmd\nms\nmb\n1 − 3 MeV\n.\n∼ −Cde\nmd\n\nCSsing = Cde\nCStrip\n\n(4.51)\n\nIn this formula, Cde /md and Cse /ms should be taken at the normalization scale 1 GeV, while\nCbe /mb must be normalized at mb . In the case of minimal SUSY models, these combinations\nare scale invariant, as Cqe ∼ mq . There is a rather large uncertainty in the isospin triplet\n ̄\ncoupling due to the poorly known value of (md − mu )hp|ūu − dd|pi.\nFortunately, CStrip\nis numerically small and a further suppression via (4.47) makes the contribution of CStrip\ncompletely negligible for all applications. Thus, from now on, we neglect CStrip and drop\nthe superscript in CSsing .\nThe largest uncertainty in CS (4.51) that may significantly affect numerical values of\nEDMs originates from the poorly known value of κ. The assumption that the s quark\nbehaves as a heavy quark would give κ ≃ 0.3, which we regard as a lower bound. The\nanalysis of the baryon octet mass splitting at leading order in chiral perturbation theory\ninstead suggests κ ≃ 1, while an improved next-to-leading order calculation gives a prediction κ ≃ 0.50 ± 0.25 [53] that we use as the central point for our numerical analysis. From\n6\n\nNote that Barr-Zee–type diagrams with chargino loops also contribute for θμ 6= 0 [51, 37].\n\n16\n\n\fthese numbers it is clear that the overall precision with which this matrix element can be\nestimated is not better than 30%.\nSubstituting Eqs. (3.22) and (3.24) into (4.51), we arrive at the final expression for CS\nin terms of mA , ∆mi , δi and hAHi:\n5.5 × 10−10 tan2 β\n\n\"\n\n!\n\nhAHi\nsin(δb − δe ) −\nCS ≃ −\n(0)\n(0)\n2\nm2A\nmA |1 + ∆me /me | |1 + ∆mb /mb |\n!\nhAHi\n3.3κ\nsin(δs − δe ) −\n+\n(0)\nm2A\n|1 + ∆ms /ms |\n(1 − 0.25κ)\n\nhAHi\nsin(δ\n−\nδ\n)\n−\n+\nd\ne\n(0)\nm2A\n|1 + ∆md /md |\n0.5\n\n!#\n\n(4.52)\n.\n\nWe use this calculation of CS , along with the standard SUSY calculations of de reviewed\nabove, in the analysis of the thallium EDM as a function of SUSY masses and phases which\nwill be discussed in Section 5.\n\n4.2\n\nNeutron EDM\n\nThe calculation of the neutron EDM in terms of the Wilson coefficients of Eq. (2.5) represents a difficult non-perturbative problem. The most common approach invokes \"naive\ndimensional analysis\" (NDA) [54, 55] which gives an order of magnitude estimate for\ndn (di , d ̃i , w) with uncertain signs. Some partial calculations have also been performed with\nthe use of chiral perturbation theory [56, 57] and lattice QCD [58]. Recently, a universal\ntreatment of all operators within the same method was developed in Refs. [59, 60] using\nQCD sum rule techniques. We briefly summarize these results below.\nIt is natural to expect that the dominant contribution to the neutron EDM comes from\nthe EDMs and color EDMs of u and d quarks. We recall that the θ̄-dependence is removed\nby the Peccei-Quinn mechanism, which at the same time reduces the contribution of the\ncolor EDM of the s-quark [59]. The QCD sum rule analysis [59] leads to the following\nresult:\ndn (di , d ̃q ) = 0.7(dd − 0.25du ) + 0.55e(d̃d + 0.5d ̃u ),\n(4.53)\nwhere the value of the quark vacuum condensate hq̄qi = (225 MeV)3 has been used. Here\nd ̃q and dq are to be normalized at the hadronic scale which we assume to be 1 GeV. The\nrelation to the Wilson coefficients at the weak scale is as follows,\nd ̃q (1 GeV) ≃ 0.91d ̃q (MZ );\n\ndq (1 GeV) ≃ 1.2dq (MZ ).\n\n(4.54)\n\nNote that d ̃q as defined by Eq. (2.2) has a much milder QCD scaling than an alternative\ndefinition for d ̃q which includes a factor of gs in its definition. The reader should also note\nthat the quark masses used for the SUSY calculations of dq and d ̃q should be taken at the\nweak scale, where their numerical values are smaller than the low energy values by a factor\nof ∼ 0.35, e.g. md (MZ ) ≃ 9.5 MeV × 0.35.\n17\n\n\fThe expression (4.53) has several nice features. Its flavor composition agrees with the\npredictions of the SU(6) constituent quark model, while the proportionality to dq hq̄qi ∼\nmq hq̄qi ∼ fπ2 m2π removes any sensitivity to the absolute value of the light quark mass. The\nquark EDM part of (4.53) is in good agreement with lattice calculations [58]. Finally, the\noverall uncertainty of (4.53) is estimated to be at the 30%–50% level [59]. For completeness,\nwe recall that there are standard SUSY one- and two-loop contributions to dq and d ̃q in\nanalogy with those discussed for the electron EDM above. For 1-loop quark EDMs and\nCEDMs we follow [14] and note that, in comparison to the electron EDM, for quarks there\nare additional one-loop diagrams containing squark-gluino loops. The two-loop Barr-Zee–\ntype contributions to the quark EDMs [49] also receive a significant correction from the\nstau-loop in addition to those containing stops and sbottoms.\nThe Weinberg operator can also be an important source of CP violation, especially when\nthe third generation of squarks is lighter than the first two generations. Unfortunately, a\nreliable calculation of its contribution to the neutron EDM is problematic at this point.\nThe QCD sum rule approach [60] produces an estimate that is close to the NDA result but\nthis calculation is at the border–line of applicability of the method. With w normalized at\nthe 1 GeV scale one finds:\ndn (w) ∼ 20MeV × e w.\n(4.55)\n\nThis estimate is assessed to be valid within a factor of 2–3 [60]. However, it seems unlikely\nthat this uncertainty can be significantly reduced. An important implication is then that\neven the sign cannot be reliably inferred, as the next order corrections to the QCD sum\nrule determination (4.55) are not calculable and plausibly are large.\nWhen tan β is large, we expect that a generically dominant contribution to the Weinberg\noperator will be induced by the b-quark color EDM (see also [61, 62]). Thus, the expression\nfor w(d̃b) linearly enhanced by tan β takes the form:\nw(1 GeV) = 0.72w(mb ) = −0.72 ×\n\ngs3d ̃b (MZ )\ngs3d ̃b (mb )\n=\n−0.68\n×\n.\n32π 2 mb\n32π 2 mb\n\n(4.56)\n\nIt is well known that the t and c quark two-loop contributions are just a fraction of the total\nEDM at low tan β [63]. Since they do not grow with tan β, their effect is expected to be\nnegligible but nonetheless they are included in our analysis. We remark at this point that\nit is common in the SUSY-EDM literature to quote the Weinberg operator at the hadronic\nscale as 3.3 × w(MZ ). This relation originates from Ref. [62] where the contributions to w\ninduced by d ̃b and d ̃c were added at the b and c thresholds with some specific assumptions\nabout the SUSY spectrum and a fixed (rather low) value of tan β. For any other point\nin the parameter space this coefficient is going to be different, and therefore an explicit\nsummation of the b and c thresholds should be performed separately.\nThere are many different types of four-fermion operators generated via the vertex correction mechanism that contribute to the neutron EDM at leading order: Cds , Csd , Cbd , Cdb ,\nCbs , and Csb . The contribution of the first two operators to dn could be important a priori\n[35]. We note, however, that the CP-violating phases induced under renormalization are\nthe same for the d and s quarks to very high accuracy within the framework of a flavor-blind\n18\n\n\fsoft-breaking sector. Thus, δs ≈ δd and Cds ≈ −Csd ≈ 0, from Eq. (3.36). This however\ndoes not apply to Cbd and Cdb or Cbs and Csb due to an additional chargino contribution\nto the b–quark mass. The estimates of dn induced by Cbd and Cdb can be obtained along\nthe lines of Ref. [60]. We supply some of the details of this calculation in Appendix B, and\nquote here the result:\ne 0.65 × 10−3 GeV2\nCbd ,\n(4.57)\ndn (Cbd ) ∼\nmb\nwhere we took into account that Cbd ≃ −Cdb . The Yukawa couplings Yd and Yb that enter\nthe coefficient Cbd in (4.57) are normalized at 1 GeV and mb respectively. In the final result\nfor dn , Cbs and Csb may be as important as Cbd and Cdb . However, we are not aware of any\nreliable way to estimate dn (Cbs , Csb ).\nCombining the different contributions, (4.53), (4.55) and (4.57), we arrive at a final\nformula for the neutron EDM as a function of the different Wilson coefficients:\ndn = dn (dq , d̃q ) + dn (w) + dn (Cbd ).\n\n(4.58)\n\nOne should keep in mind at this point that, as emphasized above, Eqs. (4.55) and (4.57) are\nundoubtedly of poorer precision than (4.53). Therefore, a reliable calculation of dn in terms\nof a specific combination of SUSY CP-violating phases is possible only if both the second\nand third terms in (4.58) are smaller than dn (dq , d̃q ). When instead they contribute at a\nlevel comparable to the EDMs and color EDMs of quarks, an interpretation of the neutron\nEDM bound in terms of constraints on specific CP-violating phases becomes problematic.\n\n4.3\n\nEDMs of diamagnetic atoms – mercury EDM\n\nEDMs of diamagnetic atoms, i.e. atoms with total electron angular momentum equal to\nzero, also provide an important test of CP violation [9]. The current limit on the EDM of\nmercury [3] furnishes one of the most sensitive constraints on SUSY CP-violating phases\n[16]. However, the calculation of dHg is undoubtedly the most difficult as it requires QCD,\nnuclear, and also atomic input.\nThe atomic EDM of mercury arises from several important sources, namely, the Schiff\nmoment S [64], the electron EDM de , and also the electron-nucleus interactions CS and CP\n(see, e.g. Ref. [9] for a comprehensive review). Schematically, the mercury EDM can be\nrepresented as\n\u0010\n\u0011\ndHg = dHg S[ḡπN N (d ̃i , Cq1q2 )], CS [Cqe ], CP [Ceq ], de ,\n(4.59)\nwhere ḡπN N collectively denotes the CP-odd pion-nucleon couplings. The atomic and nuclear parts of the calculation have been performed by different groups, and several results\nsuch as dHg (S) [65] and S(ḡπN N ) [66] have been updated recently. The most important\nnumerical change comes from a new QCD sum-rule calculation of ḡπN N (d ̃i ) [67], that obtained a preferred range and \"best\" value for this coupling. Previous estimates [33, 16] are\nwithin this preferred range, but close to the largest possible value for the ḡπN N (d ̃i ) matrix\nelement. The best value that follows from the sum-rule analysis [67] is a factor of ∼ 2.5 − 3\n19\n\n\fsmaller than previously used values [16]. Incorporating the changes in the atomic matrix\nelements, the current theoretical estimate for the mercury EDM induced by dimension 5\noperators stands as:\ndHg = 7 × 10−3e(d ̃u − d ̃d ) + 10−2 × de .\n(4.60)\n\nNote that the electron EDM also contributes to dHg , although less significantly than to\ndTl which provides a more stringent bound. Therefore, the most valuable feature of dHg is\nits sensitivity to the triplet combination of color EDM operators d ̃i , which surpasses the\nneutron EDM sensitivity to this combination of these operators by a factor of a few. The\noverall uncertainty in the QCD part of the calculation is considerably larger than that for\nthe neutron due to significant cancellations, reflecting the fact that the result vanishes in the\nvacuum factorization approximation (see Appendix B). However, the dominant dependence\non the (d ̃u − d ̃d ) combination ensures that these uncertainties enter as an overall factor and\ntherefore do not significantly alter the shape of the unconstrained band of the parameter\nspace in the θμ − θA plane.\n\nOne should note that the mercury EDM also receives contributions from the color EDM\nof the strange quark [16] and the EDMs of light quarks, although their contribution is\nsubleading. Finally, the Weinberg operator does not provide any appreciable contribution\nto dHg because its contribution to ḡπN N is suppressed by an additional chiral factor of\nmq /1 GeV ∼ 10−2 .\n\nAt large tan β one should also include additional contributions to the Schiff moment\ncoming from the four-quark operators, as well as the effects of the semi-leptonic operators\nCS and CP :\ndHg = 7 × 10−3 e (d ̃u − d ̃d ) + 10−2 de\n\u0012\n\u0013\nCsd Cbd\n2 0.5Cdd\n−5\n−1.4 × 10 e GeV\n+ 3.3κ\n+\n(1 − 0.25κ)\nmd\nms\nmb\n+3.5 × 10−3GeV e CS + 4 × 10−4 GeV e CP .\n\n(4.61)\n\nThe second line in (4.61) is the contribution of the four-quark operators to the Schiff\nmoment. The details of the ḡπN N (Cq1 q2 ) estimates, based on a factorization assumption, are\ngiven in Appendix B. The result depends on the same parameter κ (the nucleon strangeness\nin the 0+ channel) as the coefficient CS . As emphasized before, Csd and Cdd are not induced\nvia vertex corrections, and arise only through A − H mixing. Finally, the contribution of\nCP is given primarily by Ced [26] while the contributions from Ces and Ceb are consistent\nwith zero. The QCD normalization of all operators is the same as in the thallium and\nneutron cases.\nIn the region of parameter space where the color EDM contribution to dHg is dominant,\nthe mercury EDM limit is extremely valuable since, as noted above, it constrains the triplet\ncombination of up and down color EDMs, and therefore a calculable combination of the CPviolating phases. On the other hand, when other terms in Eq. (4.61) contribute at a level\ncomparable to that of d ̃u − d ̃d , which in fact is expected at large tan β, different uncertainties\nno longer factorize in front of a given phase combination, and the interpretation of the\nmercury EDM constraint becomes more difficult.\n20\n\n\f5\n\nNumerical analysis of EDMs at large tan β\n\nIn this section we analyze all three observables, dTl , dn and dHg , within two classes of\nMSSM models. In both cases we assume flavor-blind SUSY breaking, a common trilinear\nsoft-breaking parameter A0 , and a universal (real) gaugino mass parameter m1/2 at the\nGUT scale. This narrows down the number of SUSY CP-violating phases to two, which\ncan be identified with the phases of the μ and A0 parameters. We then perform an EDM\nanalysis separately for these two phases. In all numerical runs the value of tan β was chosen\nto be nearly maximal, tan β = 50. We defer an analysis of the constraints on the SUSY CPviolating phases to a subsequent publication [68] and now focus on the relative importance\nof various EDM contributions.\nThe constrained MSSM (CMSSM) is a popular framework defined by the following set\nof universal SUSY parameters at the GUT scale:\nn\n\no\n\ntan β, m0 , m1/2 , |A0 |, θA , θμ .\n\n(5.62)\n\nThe magnitude of the μ–parameter and the pseudoscalar mass are determined by the radiative electroweak symmetry breaking conditions (i.e. by reproducing the observed value\nof MZ ). We note that, in models with CP violation, the usual sign ambiguity of μ becomes\na phase ambiguity.\nThe renormalization group running from the GUT scale introduces considerable mass\nsplittings in the spectrum of superpartners. For example, the gluino becomes much heavier\nthan (roughly triple) the rest of the gauginos. The RG running can also make the scalar\nquarks quite heavy,\nm2sq (MZ ) ≃ m20 + 6m21/2 + O(MZ2 ),\n(5.63)\nespecially if m1/2 is large. In our analysis, the masses of the A and H Higgs bosons are\nfunctions of the above input parameters and are of particular importance. In the CMSSM\nwith large tan β, they tend to be as heavy as the sleptons. As a consequence, the parameter\nξ determining the relative importance of the four-fermion operators (2.6) cannot be varied\nover a large range once tan β is fixed.\nIn contrast, ξ becomes a free parameter in another version of the MSSM, a CMSSM–type\nmodel with non-universal Higgs masses (NUHM). In this model the squarks and sleptons\nare still mass degenerate at the GUT scale, but the Higgs soft masses are not. The model\ndiffers from the CMSSM in having two additional Higgs mass parameters, which can be\ntaken to be the mass of the pseudoscalar mA and μ evaluated at the weak scale, so that\nthe parameter set becomes\nn\n\no\n\ntan β, m0 , m1/2 , mA , |μ|, |A0 |, θA , θμ .\n\n(5.64)\n\nRelaxing the scalar mass universality brings an interesting new degree of freedom into\nweak-scale phenomenology while preserving the flavor-degeneracy of the CMSSM. For this\nstudy it is important that mslepton /mA and msquark /mA can be varied over a large range,\n21\n\n\fthus presenting an opportunity to study the transition to a regime of dominance for the\nfour-fermion operators.\nIn what follows, we present our numerical results for the EDMs using three twodimensional slices through the parameter space – planes of m1/2 –m0 (typical of the CMSSM)\nand μ–mA and mA –m0 (as examples of the NUHM). For each EDM observable, we plot one\nCMSSM figure with θμ = 0 and θA = π/2. Note that the phase of A runs in the RGEs, so\nthat at low energies, the phases of the various Ai are different and those of the squarks are\ntypically ≪ π/2, whereas the phases of Al̃ remain relatively large. In contrast, the phase\nof μ does not run so that θμ (EW ) = θμ (GUT ). We also plot for each EDM, three different\nNUHM cases: one for θμ = 10−3 π and θA = 0 and two different parameter planes for θμ = 0\nand θA = π/2. In all cases we fix tan β = 50 and |A0 | = 300 GeV as well as mt = 175 GeV\nfor the pole mass, and mb = 4.25 GeV for the running MS mass evaluated at mb itself.\nNote that our results for the EDMs are not particularly sensitive to the choice of |A0 |.\n\nIn all cases, we apply a set of phenomenological constraints that we describe briefly.\nWe apply the constraints on new particles from direct LEP searches, namely mχ± >\n104 GeV [69] and Higgs mass limits [10] of mh > 114 GeV. The light Higgs mass has\nbeen computed using FeynHiggs [70]. We also require the calculated branching ratio for\nb → sγ to be consistent with experimental measurements [71]. For each set of parameters,\nwe calculate the relic density of neutralinos having set the CP-violating phases to 0. As\nsuch the domains we display for a given relic density are only indicitive. However, we note\nthat in the CMSSM (and more generally when sfermion masses are not too degenerate\nat the weak scale), the relic density of binos is not significantly affected by these phases\n[13]. For the relic density of neutralinos χ, we show regions of the parameter planes with\n0.1 ≤ Ωχ h2 ≤ 0.3. We use this more conservative range in addition to that suggested by\nthe recent WMAP data [72] (0.094 ≤ Ωχ h2 ≤ 0.129) for clarity in the figures. The effect of\nthe WMAP densities in the CMSSM was discussed in [73] and in the NUHM in [74]. We\nalso require that the lightest supersymmetric particle (LSP) be a neutralino. For further\ndetails on these constraints see [75].\n\n5.1\n\nThallium EDM\n\nAs emphasized in section 4.1, the thallium EDM receives two main contributions at large\ntan β, from de and CS , while the EDM of the electron itself can be generated in different\nways at both one- and two-loop order. Figure 4a plots contours of constant dTl (CS )/dTl\n(solid, blue) and de2−loop /dtotal\n(dashed, red) in the CMSSM as a function of m1/2 and m0 .\ne\nThe GUT-scale phase of A0 is set to be maximal, θA = π/2, while θμ = 0. The dark (red)\nshaded lower-right half of the plane corresponds to a stau-LSP region which is excluded if\nthe LSP is stable. The medium (green) shaded region is excluded by b → sγ (computed\nwith non-zero phases). In the broad light shaded region the relic density of neutralinos is\n0.1 < Ωh2 < 0.3 (computed in the absence of phases) and the thin slightly darker region\nshows the WMAP relic density. In this figure, the relic density is determined primarily by\nco-annihilations with the nearly degenerate τ̃ and/or strong s-channel annihilation through\n22\n\n\fθμ = 0, θΑ = 0.5π\n\n1500\n-0.5\n\n0.5\n\nm1/2 = 500 GeV, m0 = 500 GeV, θμ = 0, θΑ = 0.5π\n\n1000\n\nCs/dTl=-0.1 -0.05\n\n900\n2\n\n-2\n\n-0.01\n\n800\n\nm0 (GeV)\n\nmA (GeV)\n\n2loop = -1\n\n1000\n\n700\n-0.5\n2loop= -1\n\n600\n-1\n\n500\n\nCs/dTl=-0.1\n-2\n\n400\n\n0\n100\n\n-1\n\n1.1\n\n1\n\n200\n\n1 04 1 05\n\n300\n\n1\n\n100\n1000\n\n2000\n\n3000\n\n0\n\n1000\n\n1000\n\n2000\n\n2500\n\nμ (GeV)\n\nm1/2 (GeV)\nm1/2 = 600 GeV, μ = 400 GeV, θμ = 0, θΑ = 0.5π\n\nm1/2 = 600 GeV, μ = 400 GeV, θμ = 0.001π, θΑ = 0\n\n2000\n\n12\n-1 -0.5\n\n-0.2\n\nCs/dTl=-0.01\n\n-0.05\n\nCs/dTl=-0.1\n\nm0 (GeV)\n\nm0 (GeV)\n\n2loop= -1\n-0.05\n\n-2\n\n0\n100\n\n200\n\n300\n\n1000\n\n400\n\n500\n\n600\n\n700\n\n800\n\n900\n\n1000\n\n0\n100\n\n200\n\n300\n\n400\n\nmA (GeV)\n0\n(χ DM)\n\n500\n\n600\n\n700\n\n800\n\n900\n\nmA (GeV)\n(b−> s γ )\n\n(WMAP)\n\n(stau LSP)\n\nFigure 4: Contributions of four-fermion operators (CS ) and the electron EDM (de ) to the\nEDM of thallium as functions of the SUSY parameters. Blue (solid) lines are contours of\n.\n/dtotal\nconstant dTl (CS )/dTl , and red (dashed) lines are the contours of constant d2−loop\ne\ne\nA thick solid black line marks the current experimental constraint on |dTl |, and black\ndashed and dot-dashed lines represent constraints from direct searches for charginos and\nthe Higgs. The legend indicates the color(grey-scale)-coding of the excluded regions and\npreferred domains as described in the text.\n23\n\n1000\n\n\fthe heavy Higgses H, A. In almost all of the unshaded portions of this figure, the relic\ndensity is too high and these parameter choices would be excluded if the LSP is stable.\nAlso shown by the nearly vertical black dashed line is the LEP bound on the chargino mass\n(smaller values of m1/2 are excluded) and the black dot-dashed curve is the LEP bound on\nthe Higgs mass (which also exlcudes small values of m1/2 and m0 ).\nThe importance of CS and d2−loop\ngrow as one moves to lower m1/2 and higher m0 as\ne\nindicated by the blue (solid) and red (dashed) lines. In particular, the contribution from\nCS changes dramatically, from merely a 5% effect to a 100% contribution, while the two–\nloop contributions are generically large. Moreover, since the effects of CS and d2−loop\nhave\ne\nthe opposite sign relative to the one-loop contribution to de , the overall consequence is a\nsignificant reduction of the predicted observable thallium EDM over a large portion of the\nparameter space. In fact, the total EDM of thallium is generically several times smaller\nthan either dTl (CS ) or dTl (dtotal\n) individually. The band in parameter space where there\ne\nis greater than 80% cancellation between CS and de is shaded in blue (dark grey), i.e.,\ndTl (CS )/dTl > 5. In the center of this band, dTl actually vanishes. Our results for CS are\nweakly dependent on κ. The 50% uncertainty in κ, translates into a 10% uncertainty in\nCS . This lack of sensitivity to κ can be inferred from Eq. (4.52) where the first term in the\nsquare bracket is dominant.\nAs noted earlier, the importance of the two-loop de contribution stems primarily from\nstau loops since the staus are generically lighter than the rest of the squarks and sleptons.\nThe left-most band, shaded green (light grey), in the parameter space shows the region\nwhere these two–loop contributions nearly screen the one–loop effects in de (to 95%). In\nthis band, d2−loop\n/de > 20. In the center of the band, de = 0 and the observable atomic\ne\n(vc)\nEDM is given entirely by CS . Note that CS is dominated by vertex corrections, Cij , and\nthe contribution due to H-A mixing is not very important.\nTurning now to the NUHM, we observe that the cosmologically preferred region of\nparameter space can be substantially wider. Figure 4b presents the thallium EDM results\nin the μ−mA plane, and one can see that even for mA as high as 500 GeV CS may contribute\n10% of the total thallium EDM, while for mA < 300 GeV CS often provides the dominant\ncontribution. Here, we have fixed m1/2 = m0 = 500 GeV. For this choice of parameters,\npositivity of the Higgs soft masses at the GUT scale would require μ <\n∼ 1600 GeV [30]. In\nthis figure, the τ̃ -LSP region is now in the upper left corner and the region excluded by\nb → sγ extends down from that. The region with the relic density between 0.1 and 0.3\nare the two funnel-like strips which become nearly horizontal at large μ. This region is\nallowed by the rapid s-channel annihilation of χ's through heavy H, A. Note that mχ ≈\n0.4m1/2 ≈ mA /2 here. Between these two strips, the relic density is less than 0.1 and so\nis not excluded. The WMAP region corresponds to the thin strips in the interior of the\nfunnel. Once again, we see the blue band with dTl (CS )/dTl > 5 at mA <\n∼ 250 GeV which\nnow intersects the WMAP region at μ ∼ 400 GeV and mA ∼ 200 GeV. At slightly lower\nmA , the 2-loop contribution cancels the 1-loop contribution to de and dTl = dTl (CS ).\nPerhaps the most interesting slice to consider is the mA − m0 plane plotted in Fig. 4c.\nFrom Fig. 4b, we see that in order to maximize the size of the WMAP cosmological region,\n24\n\n\fwe should choose μ = 400 GeV. Here, m1/2 is fixed to 600 GeV. Indeed, in Figs 4c and\n2\n4d, we see a large region with mA <\n∼ 300 GeV (and mA ∼ 650 GeV) where Ωχ h ≈ 0.11.\nFor intermediate values of mA the relic density is small and a dark matter candidate is\nnot provided. The τ̃ -LSP region now excludes the lower portion of the figure and b → sγ\nexcludes a small area at higher m0 when mA is large.\nIn Fig. 4c, one can see that over most of the cosmologically preferred region, CS provides\nthe dominant contribution to the atomic EDM. It follows that nowhere within this region\ncan the observable EDM be interpreted purely in terms of de alone. Moreover, one observes\nthat within the same cosmologically preferred region there is a large band of the parameter\nspace where the two contributions to the total atomic EDM cancel, implying no constraint\non the CP-violating phase. Once again, 50% changes in κ lead to 10% changes in CS .\nThe final figure (4d) presents the same slice of parameter space within the NUHM as\nFig. 4c for θA = 0 and θμ = 10−3 π. In this regime, the one-loop contribution to de is\ntan β–enhanced, and provides the dominant effect. We see that even for θμ ∼ O(10−3 ) the\ndomain of parameter space with m0 <\n∼ 1100 GeV is excluded by the thallium EDM bound\nas shown by the thick solid black curve. The contribution of CS reaches 20% on this plot\nfor low mA and high values of m0 . Clearly, in this case, over the range of parameter space\nthat is potentially accessible at future colliders, the one-loop electron EDM provides the\nleading contribution to the atomic EDM of thallium. Here, we note that when θμ 6= 0, the\nsensitivity to κ is larger and a 50% change in κ leads to a comparable change in CS .\nIn summary, this numerical analysis indicates that although CS plays a very important\nrole for paramagnetic EDMs at large tan β, the precise values are somewhat (a factor of a\nfew) smaller than one would naively expect from the simple scaling arguments presented\nin Sec. 2. The main reason for this is that CS is driven mostly by squark loops while de\nalso receives contributions from selectrons, and as a consequence CS tends to be further\nsuppressed due to the generically heavy masses of the squarks. Another important factor\nis the renormalization group evolution from the GUT scale down to the electroweak scale\nthat considerably suppresses the size of ImAt relative to ImAe leading to an additional\nsuppression of CS /de .\n\n5.2\n\nNeutron EDM\n\nRepeating the same sequence of plots for the neutron EDM, we observe important differences with respect to thallium. In all four panels of Fig. 5, the phenomenological and\ncosmological considerations are identical to those described for Fig. 4. In the CMSSM,\nwith θA = π/2, the current experimental bound, shown as the thick black curve, for dn\nexcludes much more of the plane than that for dTl (due to the absence of any significant\ncancellations). Indeed, for low values of m1/2 around 100 GeV, scales for m0 above 1 TeV\nare probed by the experimental constraint. In the other planes, the choices for m1/2 and\nm0 and/or μ were made so as to satisfy ab initio the current experimenatal bounds over the\ndisplayed plane. Furthermore, there is little sensitivity to θμ = 10−3 π compared to that of\nthe thallium EDM. The contribution of the two-loop quark EDMs and CEDMs is in gen25\n\n\fθμ = 0, θΑ = 0.5π\n\n1500\n0.05\n\ndw/dn=0.1\n2loop= 0.08\n\nm1/2 = 500 GeV, m0 = 500 GeV, θμ = 0, θΑ = 0.5π\n\n1000\n\n0.08\n\n900\n0.01\n\nm0 (GeV)\n\nmA (GeV)\n\n800\n1000\n\ndw/dn= -0.01\n\n0.05\n\n700\n-0.05\n0.1\n\n600\n\n2loop= 0.1\n\n500\n400\n300\n\n1\n\nCbd/dn=-0.01\n\n-0.02\n\n200\n\n0.2\n\n0\n100\n\n100\n1000\n\n2000\n\n3000\n\n0\n\n1000\n\nm1/2 = 600 GeV, μ = 400 GeV, θμ = 0, θΑ = 0.5π\n\n1000\n-0.1\n\n2000\n\n2500\n\nμ (GeV)\n\nm1/2 (GeV)\n2000\n\nm1/2 = 600 GeV, μ = 400 GeV, θμ = 0.001π, θΑ = 0\n\ndw/dn= 0.1\n\n-0.02\ndw/dn=0.035\n\nm0 (GeV)\n\nm0 (GeV)\n\n2loop= 0.1\n0.03\n\nCbd/dn= -0.01\n\n0\n100\n\n200\n\n300\n\n400\n\n500\n\n600\n\n700\n\n800\n\n900\n\n1000\n\nmA (GeV)\n\n1000\n\n0\n100\n\n2loop=-0.01\n\n200\n\n300\n\n400\n\n500\n\n600\n\n700\n\n800\n\n900\n\nmA (GeV)\n\nFigure 5: Contributions of the Weinberg operator, dn (w) ≡ dw , and four-fermion opera-\n\ntors, dn (Cij ) denoted as Cbd here, to the neutron EDM as functions of SUSY parameters.\nBlue (solid grey) lines denote contours of constant dn (d2−loop\n)/dn , while red (dashed) lines\ni\nare contours of constant dn (Cbd )/dn , and finally green (dot-dashed) lines are contours of\nconstant dw /dn . The thick solid black line delineates the experimental bound on |dn |, and\nblack dashed and dot-dashed lines represent constraints from direct searches for neutralinos and the Higgs.\n\n26\n\n1000\n\n\feral very small, not exceeding 10% of the total dn . Moreover, of particular relevance here,\na scan over the parameter space of the CMSSM and NUHM reveals that the four-quark\ninteractions and the Weinberg operator contribute at the 10% level at most. Both the\nscale as (two-loop factor)× tan β\nWeinberg operator and the two loop contributions d2−loop\ni\nand therefore it is natural that they both contribute at a similar level. The contribution of\nfour-fermion operators is dominated by Cbd and increases when m0 is increased and/or mA\nis lowered. Although outside the parameter regime included in the plots, it is worth noting\nthat a factor of 3 increase in the maximum value of m0 to around 3 TeV in Fig. 5c (at low\nmA ) would bring the Cbd contribution to a level comparable with dn (di , d ̃i ).\nWe conclude that for all m0 < 1 TeV the neutron EDM at large tan β can be reliably\ncalculated in terms of the the EDMs and CEDMS of quarks. The hadronic uncertainties\nassociated with the matrix elements of four-fermion and Weinberg operators, which we can\nonly estimate within a factor of 3, do not significantly disrupt the predictions for dn . This\nmeans that even at large tan β the calculation of dn can provide meaningful constraints on\nspecific combinations of the quark EDMs and CEDMs.\n\n5.3\n\nMercury EDM\n\nIn many ways, the mercury EDM occupies an intermediate position between dn and dTl .\nResults for the Hg EDM are shown in Fig. 6. Once again, the phenomenological and\ncosmological considerations are identical to those described for Fig. 4. In the CMSSM with\nθA 6= 0 and θμ = 0, the current experimental constraint on dHg shows even greater sensitivity\nto m0 than does dn . On the other hand, the contribution of four-fermion operators to dHg\nis relatively less important than for dT l , but more important than for dn . It is interesting\nto note that the contribution of CS has a similar magnitude, but the opposite sign, to that\nof Cq1 q2 , and over a large part of the parameter space these two effects tend to compensate\neach other. An exact cancellation would be an accident, as Cq1 q2 has considerable hadronic\nuncertainties associated with the calculation of the pion-nucleon CP-violating coupling and\nthe Schiff moment. The contribution from CP is negligible.\nThe effects of four-fermion operators become much more pronounced in the NUHM\nmodel. Fig.6c shows that for low mA the mercury EDM receives contributions of up to 50%\nfrom CS and Cq1 q2 (for the chosen parameters dHg (CS ) ≈ −dHg (Cq1 q2 ) and only CS is shown\non the plot). These contributions drop quickly with increasing mA and for mA > 250 GeV\ndo not exceed 10% of the total EDM. It is also important to note that for both the CMSSM\nand the NUHM the electron EDM remains subdominant for θA 6= 0 and θμ = 0. This\nprovides us with some confidence in the calculation of the mercury EDM at θA 6= 0, θμ = 0\nin the range mA > 250 GeV and m0 < 1.5 TeV where both de and four-fermion operators\nprovide contributions of less than 10%. We conclude that in this part of the parameter\nspace the mercury EDM is dominated by contributions from (d ̃u − d ̃d ).\nThis situation changes when we consider the case of θA = 0, θμ 6= 0, shown in Fig.\n6d. One can readily see that the electron EDM becomes important everywhere within the\ndomain of parameter space included in the plot, and its inclusion leads to a significant\n27\n\n\fθμ = 0, θΑ = 0.5π\n\n1500\nCs/dHg= 0.01\n\n0.01\n\nm1/2 = 500 GeV, m0 = 500 GeV, θμ = 0, θΑ = 0.5π\n\n1000\n\nde/dHg= -0.05\n\nde/dHg= 0.05\n\n900\n800\n\nmA (GeV)\n\nm0 (GeV)\n\n0.1\n\n1000\nCbd/dHg= -0.01\n\n700\nCs/dHg= 0.01\n\n600\n500\n0.02\n\n400\n\n-0.01\n\n1.1\n\n1\n\n200\n\n-0.01\n1 04 1 05\n\n300\n\n0.1\n\n0\n100\n\nCbd/dHg= -0.02\n\n0.01\n\n-0.1\n\n100\n1000\n\n2000\n\n3000\n\n0\n\n1000\n\nm1/2 = 600 GeV, μ = 400 GeV, θμ = 0, θΑ = 0.5π\n\n1000\n0.5\n\n0.1\n\n0.05\n\n2000\n\n2500\n\nμ (GeV)\n\nm1/2 (GeV)\n2000\n\nCs/dHg=0.01\n\nm1/2 = 600 GeV, μ = 400 GeV, θμ = 0.001π, θΑ = 0\n0.3\n\n0.1\n\nCs/dHg=0.05\n\n-0.01\n\nm0 (GeV)\n\nm0 (GeV)\n\nde/dHg= -0.02\n\n-0.05\n\n-1\n\nde/dHg= -1.5\n\n1000\n\n-2\n\n-5\n\n0\n100\n\n200\n\n300\n\n400\n\n500\n\n600\n\n700\n\n800\n\n900\n\n1000\n\nmA (GeV)\n\n0\n100\n\n200\n\n300\n\n400\n\n500\n\n600\n\n700\n\n800\n\n900\n\nmA (GeV)\n\nFigure 6: Contributions of the four-fermion operators and the electron EDM to the\nEDM of mercury as functions of the SUSY parameters. Blue (solid grey) lines denote\ncontours of constant dHg (CS )/dHg , while red (dashed) lines are the contours of constant\ndHg (de )/dHg (indicated as de /dHg ), and green (dot-dashed) lines are contours of constant\ndHg (Cq1 q2 )/dHg (indicated as Cbd /dHg on the plot). The thick solid black line denotes the\nexperimental bound on |dHg |, while black dashed and dot-dashed lines represent constraints\nfrom direct searches for neutralinos and the Higgs.\n\n28\n\n1000\n\n\freduction in the total mercury EDM. In practice, however, in this regime dTl is dominated\nby de and, on taking the bound on dTl into account, the effect of de on dHg will be suppressed.\nWe note finally that, unlike the previous observables, at θA = 0, θμ 6= 0 the mercury EDM\nalso depends sensitively on CS and the four-fermion contributions to the Schiff moment.\n\n6\n\nConclusions\n\nIn this paper, we have presented the results of SUSY-EDM calculations in the large tan β\nregime. Large values of tan β are motivated by a variety of theoretical models and the\nSUSY Higgs searches at LEP also suggest that tan β >\n∼ 5. Our main goal was to combine\nthe existing one and two-loop calculations of the EDMs of the constituents (electrons,\nquarks, etc.) with the effects of four-fermion CP-odd interactions, the importance of which\nwas recently emphasized in Ref. [26]. We concentrated on comparing the relative size of\nthese contributions, while a more detailed analysis of the constraints on SUSY phases will\nappear elsewhere [68].\nWe have compiled the most accurate formulae to date to obtain the three observables:\nthe EDMs of the neutron, mercury and thallium as functions of the Wilson coefficients,\nwhich in turn are expressed in terms of SUSY parameters. Mostly these are compilations\nof existing QCD/nuclear/atomic calculations, although in certain cases such as dn (Cbd ) and\ndHg (Cbd ), new QCD estimates have been obtained. On the SUSY side, we have performed\na complete calculation of 1–loop corrections to the quark and lepton masses in the large\ntan β regime, including the effects of SUSY CP-violating phases. These mass corrections\n(or rather their imaginary parts) determine the strength of the CP-violating Higgs-fermion\ninteraction, the leading source for the CP-odd quark-quark and quark-electron interactions.\nAt the subleading level, only the effects of scalar-pseudoscalar mixing were taken into\naccount as these are important for low pseudoscalar masses mA , although a large class\nof box diagrams can contribute as well. We also included the stau-loop contribution to\nthe two-loop corrections to the EDMs, and recalculated the corresponding sign to firmly\nestablish the pattern of interference between one- and two-loops.\nThe impact of the four-fermion operators is most striking for the thallium EDM. We\nobserve that for low mA and high m0 the electron EDM is no longer dominant, and CS\nprovides as large a contribution (or possibly even larger) to dTl as does de . A similar conclusion will apply to other paramagnetic species as well. This is an important point because it\nillustrates that in SUSY models with large tan β, the EDM of a heavy paramagnetic atom\nor molecule cannot be entirely attributed to de . Should the next generation of paramagnetic\nEDM experiments [7, 8] detect a non-zero signal, only a combination of positive measurements with different atoms or molecules could unambiguously separate the two effects. It\nis also noteworthy that the total electron EDM is reduced due to destructive interference\nbetween the one- and two-loop contributions, particularly due to τ̃ -loops.\nIn the CS -dominated regime for dTl , the main uncertainty in the theoretical calculation\ncomes from the uncertainty of the strange quark scalar matrix element over the nucleon.\n29\n\n\fThis translates into a 10% uncertainty when the EDM is induced by θA and 30 − 50%\nuncertainty for the θμ –induced EDM. The transition to dominance of CS for θμ 6= 0 occurs at\na very large mass scale for the superpartners, and in reality for m0 < 2 TeV the contribution\nof CS (θμ ) is always subdominant. Yet, in the case that the EDM is induced by θA , we find\nthat the four-fermion operators can easily contribute as much as the electron EDM7 . We also\nfind that, in certain parts of the parameter space, the physical observable dTl is considerably\nsmaller than the individual contributions.\nIn the case of the mercury EDM, there are a variety of different contributions that have\nto be taken into account. We find that at large tan β the contribution of CS and other fourfermion operators may become important. From our analysis it is clear that the main problem with the interpretation of the mercury EDM at large tan β is that a rather large number\nof contributions appear with many of them having different hadronic/nuclear/atomic matrix elements. Therefore, a reliable calculation (i.e. better than 100% uncertainty) becomes\nproblematic at large tan β. This contrasts with low and moderate tan β where the EDM\nof mercury is usually dominated by the color EDMs of the light quarks, and the hadronic\nuncertainties are a less harmful overall factor. Nevertheless, for θμ = 0, mA >\n∼ 250 GeV and\n<\nm0 ∼ 1.5 TeV the effects of four-fermion operators and the electron EDM are subdominant\nand a meaningful estimate for dHg is possible.\nWe determined that the EDM of the neutron is the least susceptible observable, with\nthe contributions of four fermion operators never exceeding 10% of the total EDM for\nm0 <\n∼ 1 TeV. On the other hand, for θA 6= 0 the contribution of the Weinberg operator\ncan be quite substantial. According to our estimates for the matrix elements, it is <\n∼\n10% of the total EDM in much of the parameter space considered (if an NDA estimate\nof dn (w) is employed, this contribution is larger). Although subleading, we infer that at\nlarge tan β the calculation of the neutron EDM can be prone to uncertainties related to\nthe matrix element of the Weinberg operator. It is also worth noting that the dominant,\ntan β-enhanced, contribution to the Weinberg operator comes from the color EDM of the\nb-quark.\nFinally, we remark that low values of mA <\n∼ 300 GeV can be preferred by considerations\nof the cosmological neutralino abundance. This is related to the new annihilation channels\ndue to Higgs exchange that open up when mA is not excessively large. In that part of\nthe parameter space the effects of four-fermion operators are very important, and therefore\nmodels that include both CP violation and neutralino dark matter should incorporate the\neffects of four-fermion interactions into the EDM constraints.\n\nAcknowledgments\nWe would like to thank Y. Nir and Y. Santoso for helpful conversations. The work of DD\nand KAO was supported in part by DOE grant DE–FG02–94ER–40823. The work of MP\n7\n\nWe note also that additional tan β–enhanced contributions may arise through the electron EDM via\ntwo-loop renormalization group evolution of the gaugino masses. We will address these effects in more\ndetail elsewhere [68].\n\n30\n\n\fwas supported in part by NSERC of Canada and PPARC of the UK. AR would like to\nthank the FTPI at the University of Minnesota for generous hospitality while this work\nwas completed.\n\nAppendices\nA\n\nNeutron EDM induced by four-fermion operators\n\nAs discussed in Section 4, the direct QCD sum-rule analysis for the neutron EDM becomes\nproblematic for sources of dimension six, due in part to the presence of unknown condensates. For the contribution of the Weinberg operator, one can nonetheless obtain a useful\nestimate [60] by relating dn to the neutron anomalous magnetic moment, μn , by a chiral\nrotation of the nucleon wavefunction. For similar reasons, we will adopt the same approach\nhere in estimating the contribution of the four fermion sources to the neutron EDM.\nTo proceed, it is convenient to first introduce a redefined set of Wilson coefficients, so\nthat\n ̄ 5 d + C̃db (mb )mb dd\n ̄ b̄iγ5 b,\nδL = C̃bd (mb )mb b̄bdiγ\n(A.65)\nat the b-quark mass scale, where C̃ = C/mb . Below this scale, the b-quarks can be integrated\nout leading to dimension-7 quark-gluon operators. Making use of the standard low energy\ntheorems we obtain\nδL = −\n\nαs (μ)C̃bd (μ)  ̄\nαs (μ)C̃db (μ)  ̄\ndiγ5 dGG −\nddGG̃.\n12π\n16π\n\n(A.66)\n\nThe evolution of the coefficients to the hadronic scale μ ∼ 1 GeV requires knowledge of\nthe anomalous dimensions of these dimension-7 operators. Since (with hindsight), the\noverall contribution of these operators is small, we will approximate this by the anomalous\ndimension of q̄q, recalling that αs GG is RG–invariant. Thus, we run C̃bd and C̃db to μ ∼\n1 GeV, using γαs qqGG ∼ 4/9.\nTo gain some intuition about the dependence of dn on C̃(μ), we first utilize \"naive\ndimensional analysis\" [54, 55]. The quark-gluon operators are of dimension-7, so the reduced\ncoupling is M 3 /(4π)2 with M ∼ 4πfπ . The corresponding estimate for dn is given by e/M\nmultiplied by the reduced coupling of the source, and so we find\n|dn (NDA)| ∼ e 2.1 × 10−3 GeV2\n\n\u0010\n\n\u0011\n\nC̃bd (μ) + 0.75 C̃db (μ) ,\n\n(A.67)\n\non using the usual matching condition αs = 4π, i.e. at a very low (apparent) scale. As it\nturns out, our final estimate is quite close to this, assuming we choose the matching scale\nnot too far from 1 GeV.\nWe now turn to a sum-rule analysis. As alluded to above, a direct calculation appears\nintractable due to the presence of unknown condensates. Therefore, we will pursue instead\n31\n\n\f<qGσ q>\n\nCdb\n\n<qGσ q>\n\nFigure 7: The leading contribution to the γ5 structure induced by the CP-odd source.\nan indirect method first considered by Bigi and Uraltsev [76], and used recently within\nQCD sum-rules to estimate dn induced by the Weinberg operator GGG̃. One considers the\nγ5 -rotation of the nucleon wavefunction induced by δL, leading to an estimate for dn in\nterms of the corresponding rotation of the anomalous magnetic moment μn :\ndn ∼ μn\n\nhN|δL|Ni\n.\nmn N̄ iγ5 N\n\n(A.68)\n\nIn the present context, we require the ratio of the leading contributions to the structures\n1 and iγ5 in the mass sum-rule correlator. We have\nZ\n\nd4 xeip*x hηn (0)η̄n (x)i =\n\nh\ni\n1\n2\n2\n2\nhqqi\np\nln(−p\n)1\n+\nf\n(p\n)iγ\n,\nδ\n5\n16π 2\n\n(A.69)\n\nwhere ηn is the neutron current, which for the mass sum-rule we take at the \"Ioffe point\"\n[77], fδ is the contribution induced by the CP-odd souce δL that is to be determined, and\nwe have retained only the leading order contribution to the structure 1.\nFortunately, in this case the leading contribution enters in a tractable form without the\nneed for additional perturbative vertices – i.e. the gluon structure of the source δL can\nbe extracted at the nonperturbative level. The relevant class of diagrams is exhibited in\nFig. 7. Using standard methods, we calculate the quark propagators in the background of\nthe two sources in δL making use of the known guark-gluon condensate8 :\nhq̄gs (Gσ)qi = m̃20 |hqqi| ≈ 0.8GeV2 hqqi.\n\n(A.70)\n\nOne then obtains,\n\n\u0010\n\u0011\nm̃40\nhqqi\nC̃\n+\n0.75\nC̃\n,\n(A.71)\nbd\ndb\n6p2\nand we proceed by performing a Borel transform and comparing the two terms in (A.69)\nat the neutron mass scale in terms of the Borel parameter M. This fixes the ratio of the\n\nfδ (p2 ) = −\n\n8\n\nWe have introduced a tilde atop m0 in order to distinguish this QCD condensate from the mass of the\nSUSY scalars.\n\n32\n\n\ftwo structures in (A.69) which is the quantity that enters the estimate (A.68), leading to\nthe result,\n|dn | ∼ |μn |\n\n\u0010\n\u0010\n\u0011\n\u0011\nm̃40\n2\n−3\nhqqi\nC̃\n+\n0.75\nC̃\n∼\ne\n2.6\n×\n10\nGeV\nC̃\n+\n0.75\nC̃\n,\nbd\ndb\nbd\ndb\n6M 4\n\n(A.72)\n\nwhich necessarily comes with a precision estimate not better than O(100%). On reexpresing this result in terms of Cbd and Cdb , we obtain the result quoted in (4.57).\nFinally, for completeness, we note that the operators Cdd , Cds , Csd and Css can be\ngenerated via H − A mixing. Their contribution to the neutron EDM can be estimated as\n[9, 35]:\ndn (Csd )\ndn (Cdd )\n∼\n∼ 2 × 10−2 GeV,\nCdd\nCsd\n\nB\n\ndn (Cds )\ndn (Css )\n∼\n∼ 2 × 10−3 GeV.\nCds\nCss\n\n(A.73)\n\nMercury EDM induced by four-fermion operators\n\nThe main source for the Schiff moment of the mercury nucleus arises through a pionexchange contribution with CP violation in the pion-nucleon vertex,\n(0)\n\n(1)\n\n(2)\n\nLπN N = ḡπN N N̄τ a Nπ a + ḡπN N N̄Nπ 0 + ḡπN N (N̄ τ a Nπ a − 3N̄τ 3 Nπ 0 ),\n\n(B.74)\n\n(1)\n\nof which the contribution of ḡπN N is the most important [67, 66]. We recall here that\nthe main technical difficulty in the derivation of this coupling, as induced by color EDM\noperators, is the existence of two compensating diagrams. The direct chiral commutator\n[J05 , q̄(Gσ)γ5 q] tends to cancel against a pion re-scattering diagram (see Ref. [67] for de(1)\ntails). The resulting expression for ḡπN N is given by the following linear combination of\nnucleon matrix elements for q̄gs (Gσ)q and q̄q:\nd ̃u − d ̃d\n ̄ s (Gσ)d − m̃2 (ūu + dd)|Ni.\n ̄\nhN|ūgs (Gσ)u + dg\n0\n4fπ\n\n(B.75)\n\nThis vanishes if hN|q̄gs (Gσ)q|Ni = m̃20 hN|q̄q|Ni, a relation that holds in the vacuum\nfactorization approximation. Thus, in order to obtain a non-zero result, one has to go\nbeyond the factorization approximation. A full QCD sum-rule analysis [67] produces a\npreferred range for this coupling with the \"best\" value given by\n(1)\nḡπN N = 2 × 1014 (d ̃u − d ̃d ) cm−1 .\n\n(B.76)\n\n(1)\n\nCombined with the relevant nuclear, S(ḡπN N ), and atomic, dHg (S), pieces of the calculation,\nthis expression enters the first line of Eq. (4.61).\n(1)\n\nAfter this brief review of the color EDM contributions to ḡπN N , for large tan β we also\n(1)\nneed to generalize this derivation to include ḡπN N (Cq1q2 ). Both diagrams, the direct chiral\ncommutator and the pion re-scattering diagram, are present in this case as well. Luckily,\n33\n\n\fin contrast with the case of CEDM sources, vacuum factorization does now produce a nonzero result. Combining these two diagrams, we find a contribution that corresponds to the\ndirect factorization of the pseudoscalar bilinear q̄iγ5 q via the chiral commutator with the\n(1)\npion. The final expression for ḡπN N takes the form,\n(1)\n\nhqqi\n ̄ + Csd s̄s + Cbd b̄b|Ni\nhN|Cdd dd\n2fπ\n\u0012\n\u0013\n0.5Cdd\nCsd Cbd\n= −8 × 10−2 GeV2\n+ 3.3κ\n+\n(1 − 0.25κ) .\nmd\nms\nmb\n\nḡπN N =\n\n(B.77)\n\nNote that within the factorization approximation Cdb , Cds , Css and Cbb do not contribute\n(1)\nto ḡπN N . The final expression (B.77) depends on the same matrix element of s̄s over the\nnucleon as previously encountered in the calculation of CS , and parametrized by κ.\n\nReferences\n[1] P. G. Harris et al., Phys. Rev. Lett. 82 (1999) 904.\n[2] B. C. Regan et al., Phys. Rev. Lett. 88 (2002) 071805.\n[3] M. V. Romalis, W. C. Griffith and E. N. Fortson, Phys. Rev. Lett. 86 (2001) 2505.\n[4] D. Cho, K. Sangster, E.A. Hinds, Phys. Rev. Lett. 63 (1989) 2559.\n[5] M. A. Rosenberry and T. E. Chupp, Phys. Rev. Lett. 86 (2001) 22.\n[6] S.A. Murthy at al., Phys. Rev. Lett. 63 (1989) 965.\n[7] J. Hudson, B. E. Sauer, M. R. Tarbutt, and E. A. Hinds, Phys. Rev. Lett. 89 (2002)\n023003.\n[8] D. DeMille et al., Phys. Rev. A 61 (2000) 052507.\n[9] I.B. Khriplovich and S.K. Lamoreaux, \"CP Violation Without Strangeness\", Springer,\n1997.\n[10] LEP Higgs Working Group for Higgs boson searches, OPAL Collaboration, ALEPH\nCollaboration, DELPHI Collaboration and L3 Collaboration, Phys. Lett. B 565 (2003)\n61 [arXiv:hep-ex/0306033]. Searches for the neutral Higgs bosons of the MSSM: Preliminary combined results using LEP data collected at energies up to 209 GeV, LHWGNOTE-2001-04, ALEPH-2001-057, DELPHI-2001-114, L3-NOTE-2700, OPAL-TN699, arXiv:hep-ex/0107030; LHWG Note/2002-01,\nhttp://lephiggs.web.cern.ch/LEPHIGGS/papers/July2002 SM/index.html;\nJ. R. Ellis, G. Ganis, D. V. Nanopoulos and K. A. Olive, Phys. Lett. B 502 (2001)\n171; See also H. E. Haber, \"Higgs theory and phenomenology in the standard model\nand MSSM,\" arXiv:hep-ph/0212136.\n34\n\n\f[11] For some recent papers see: T. Blazek, R. Dermisek and S. Raby, Phys. Rev. Lett. 88\n(2002) 111804; U. Chattopadhyay, A. Corsetti and P. Nath, Phys. Rev. D 66 (2002)\n035003; K. Tobe and J. D. Wells, Nucl. Phys. B 663 (2003) 123; D. Auto, H. Baer,\nC. Balazs, A. Belyaev, J. Ferrandis and X. Tata, JHEP 0306, 023 (2003).\n[12] J. R. Ellis, S. Ferrara and D. V. Nanopoulos, Phys. Lett. B 114 (1982) 231; W. Buchmuller and D. Wyler, Phys. Lett. B 121 (1983) 321; J. Polchinski and M. B. Wise,\nPhys. Lett. B 125 (1983) 393; M. Dugan, B. Grinstein and L. Hall, Nucl. Phys. B255\n(1985) 413.\n[13] T. Falk and K. A. Olive, Phys. Lett. B 375 (1996) 196; T. Falk and K.A. Olive, Phys.\nLett. B439 (1998) 71.\n[14] T. Ibrahim and P. Nath, Phys. Lett. B 418 (1998) 98; Phys. Rev. D 57 (1998) 478;\n[Erratum-ibid. D 58 (1998) 019901]; Phys. Rev. D 58 (1998) 111301.\n[15] M. Brhlik, G. J. Good and G. L. Kane, Phys. Rev. D 59 (1999) 115004; M. Brhlik,\nL. L. Everett, G. L. Kane and J. Lykken, Phys. Rev. Lett. 83 (1999) 2124; A. Bartl,\nT. Gajdosik, W. Porod, P. Stockinger and H. Stremnitzer, Phys. Rev. D 60 (1999)\n073003; S. Pokorski, J. Rosiek and C. A. Savoy, Nucl. Phys. B 570, (2000) 81.\n[16] T. Falk, K.A. Olive, M. Pospelov and R. Roiban, Nucl. Phys. B 560 (1999) 3.\n[17] V. D. Barger, T. Falk, T. Han, J. Jiang, T. Li and T. Plehn, Phys. Rev. D 64 (2001)\n056007.\n[18] S. Abel, S. Khalil and O. Lebedev, Phys. Rev. Lett. 86 (2001) 5850; Nucl. Phys. B\n606 (2001) 151.\n[19] S. Abel, S. Khalil and O. Lebedev, Phys. Rev. Lett. 89 (2002) 121601.\n[20] O. Lebedev and S. Morris, JHEP 0208 (2002) 007.\n[21] P. Nath, Phys. Rev. Lett. 66 (1991) 2565; Y. Kizukuri and N. Oshimo, Phys. Rev. D\n45 (1992) 1806; D46 (1992) 3025; A. G. Cohen, D. B. Kaplan and A. E. Nelson, Phys.\nLett. B 388 (1996) 588.\n[22] J. Kubo and H. Terao, Phys. Rev. D 66 (2002) 116003.\n[23] R. N. Mohapatra and G. Senjanovic, Phys. Lett. B 79 (1978) 283; S. M. Barr, Phys.\nRev. Lett. 53 (1984) 329; A. E. Nelson, Phys. Lett. B 136 (1984) 387.\n[24] S. Dimopoulos and S. Thomas, Nucl. Phys. B 465 (1996) 23; R. Kuchimanchi, Phys.\nRev. Lett. 76 (1996) 3486; R. N. Mohapatra and A. Rasin, Phys. Rev. Lett. 76 (1996)\n3490; M. E. Pospelov, Phys. Lett. B 391 (1997) 324; G. Hiller and M. Schmaltz, Phys.\nLett. B 514 (2001) 263.\n[25] S. M. Barr, Phys. Rev. Lett. 68 (1992) 1822; Phys. Rev. D 47 (1993) 2025.\n35\n\n\f[26] O. Lebedev and M. Pospelov, Phys. Rev. Lett. 89 (2002) 101801.\n[27] J. R. Ellis, T. Falk, G. Ganis, K. A. Olive and M. Srednicki, Phys. Lett. B 510, 236\n(2001); M. Battaglia et al., Eur. Phys. J. C22 (2001) 535; J. R. Ellis, K. A. Olive\nand Y. Santoso, New J. Phys. 4 (2002) 32.\n[28] Some additional recent papers include: A. B. Lahanas, D. V. Nanopoulos and\nV. C. Spanos, Phys. Lett. B 518 (2001) 94; V. D. Barger and C. Kao, Phys. Lett.\nB 518 (2001) 117; L. Roszkowski, R. Ruiz de Austri and T. Nihei, JHEP 0108 (2001)\n024; A. Djouadi, M. Drees and J. L. Kneur, JHEP 0108 (2001) 055; U. Chattopadhyay, A. Corsetti and P. Nath, Phys. Rev. D 66 (2002) 035003; H. Baer, C. Balazs,\nA. Belyaev, J. K. Mizukoshi, X. Tata and Y. Wang, JHEP 0207 (2002) 050.\n[29] V. Berezinsky, A. Bottino, J. R. Ellis, N. Fornengo, G. Mignola and S. Scopel, Astropart. Phys. 5 (1996) 1; P. Nath and R. Arnowitt, Phys. Rev. D 56 (1997) 2820;\nA. Bottino, F. Donato, N. Fornengo and S. Scopel, Phys. Rev. D 59 (1999) 095004;\nPhys. Rev. D 63, 125003 (2001); R. Arnowitt, B. Dutta and Y. Santoso, Nucl. Phys.\nB 606 (2001) 59; V. Bertin, E. Nezri and J. Orloff, JHEP 0302 (2003) 046.\n[30] J. R. Ellis, K. A. Olive and Y. Santoso, Phys. Lett. B 539 (2002) 107; J. R. Ellis,\nT. Falk, K. A. Olive and Y. Santoso, Nucl. Phys. B 652 (2003) 259.\n[31] O. Lebedev, Phys. Rev. D 67 (2003) 015013.\n[32] R. D. Peccei and H. R. Quinn, Phys. Rev. Lett. 38 (1977) 1440.\n[33] V. M. Khatsimovsky, I. B. Khriplovich and A. S. Yelkhovsky, Annals Phys. 186 (1988)\n1.\n[34] X. G. He and B. McKellar, Phys. Lett. B 390 (1997) 318.\n[35] C. Hamzaoui and M. Pospelov, Phys. Rev. D 65 (2002) 056002.\n[36] R. Hempfling, Phys. Rev. D 49 (1994) 6168; L. J. Hall, R. Rattazzi and U. Sarid, Phys.\nRev. D 50 (1994) 7048; T. Blazek, S. Raby and S. Pokorski, Phys. Rev. D 52 (1995)\n4151; C. Hamzaoui, M. Pospelov and M. Toharia, Phys. Rev. D 59 (1999) 095005;\nK. S. Babu and C. F. Kolda, Phys. Rev. Lett. 84 (2000) 228.\n[37] A. Pilaftsis, Nucl. Phys. B 644 (2002) 263.\n[38] H. E. Haber and G. L. Kane, Phys. Rept. 117 (1985) 75; J. F. Gunion and H. E. Haber,\nNucl. Phys. B 272 (1986) 1.\n[39] G. Passarino and M. J. Veltman, Nucl. Phys. B 160 (1979) 151.\n[40] O. Lebedev and W. Loinaz, Phys. Rev. D 65 (2002) 033005.\n[41] T. Blazek, S. Raby and S. Pokorski, in Ref.[36].\n36\n\n\f[42] D. M. Pierce, J. A. Bagger, K. T. Matchev and R. J. Zhang, Nucl. Phys. B 491 (1997)\n3.\n[43] T. Ibrahim and P. Nath, Phys. Rev. D 67 (2003) 095003 [Erratum-ibid. D 68 (2003)\n019901]; arXiv:hep-ph/0311242.\n[44] A. Pilaftsis, Phys. Lett. B 435 (1998) 88; D. A. Demir, Phys. Rev. D 60 (1999) 055006;\nA. Pilaftsis and C. E. M. Wagner, Nucl. Phys. B 553 (1999) 3.\n[45] Z. W. Liu and H. P. Kelly, Phys. Rev. A 45 (1992) R4210.\n[46] A.-M. Martensson-Pendrill, Methods in Computational Chemistry, Volume 5: Atomic,\nMolecular Properties, ed. S. Wilson (Plenum Press, New York 1992).\n[47] E. Lindroth, A.-M. Martensson-Pendrill, Europhys. Lett. 15 (1991) 155.\n[48] J. S. M. Ginges and V. V. Flambaum, arXiv:physics/0309054.\n[49] D. Chang, W. Y. Keung and A. Pilaftsis, Phys. Rev. Lett. 82 (1999) 900 [Erratum-ibid.\n83 (1999) 3972].\n[50] A. Pilaftsis, Phys. Lett. B 471 (1999) 174.\n[51] D. Chang, W. F. Chang and W. Y. Keung, Phys. Rev. D 66 (2002) 116008.\n[52] M. A. Shifman, A. I. Vainshtein and V. I. Zakharov, Phys. Lett. B 78 (1978) 443.\n[53] H.-Y. Cheng, Phys. Lett. B219 (1989) 347; J. Gasser, H. Leutwyler, and M. E.\nSainio, Phys. Lett. B253 (1991) 252; H. Leutwyler, hep-ph/9609465; B. Borasoy and\nU. G. Meissner, Annals Phys. 254 (1997) 192; M. Knecht, PiN Newslett. 15 (1999)\n108 [arXiv:hep-ph/9912443].\n[54] A. Manohar and H. Georgi, Nucl. Phys. B 234 (1984) 189.\n[55] S. Weinberg, Phys. Rev. Lett. 63 (1989) 2333.\n[56] R. J. Crewther, P. Di Vecchia, G. Veneziano and E. Witten, Phys. Lett. B 88 (1979)\n123 [Erratum-ibid. B 91 (1980) 487].\n[57] V. M. Khatsymovsky and I. B. Khriplovich, Phys. Lett. B 296 (1992) 219.\n[58] S. Aoki et al., Phys. Rev. D56 (1997) 433.\n[59] M. Pospelov and A. Ritz, Phys. Rev. Lett. 83 (1999) 2526; Nucl. Phys. B 573 (2000)\n177; Phys. Rev. D 63 (2001) 073015.\n[60] D. A. Demir, M. Pospelov and A. Ritz, Phys. Rev. D 67 (2003) 015007.\n[61] D. Chang, T. W. Kephart, W. Y. Keung and T. C. Yuan, Phys. Rev. Lett. 68 (1992)\n439.\n37\n\n\f[62] R. Arnowitt, J.L. Lopez and D. V. Nanopoulos, Phys. Rev. D 42 (1990) 2423.\n[63] J. Dai, H. Dykstra, R. G. Leigh, S. Paban and D. Dicus, Phys. Lett. B 237 (1990) 216\n[Erratum-ibid. B 242 (1990) 547].\n[64] L.I. Schiff, Phys. Rev. 132 (1963) 2194.\n[65] V. A. Dzuba, V. V. Flambaum, J. S. Ginges and M. G. Kozlov, Phys. Rev. A 66 (2002)\n012111\n[66] V. F. Dmitriev and R. A. Sen'kov, arXiv:nucl-th/0304048.\n[67] M. Pospelov, Phys. Lett. B 530 (2002) 123.\n[68] D. Demir, O. Lebedev, K. Olive, M. Pospelov and A. Ritz, in preparation.\n[69] Joint LEP 2 Supersymmetry Working Group, Combined LEP Chargino Results, up to\n208 GeV,\nhttp://lepsusy.web.cern.ch/lepsusy/www/inos moriond01/charginos pub.html.\n[70] S. Heinemeyer, W. Hollik and G. Weiglein, Comput. Phys. Commun. 124 (2000) 76;\nS. Heinemeyer, W. Hollik and G. Weiglein, Eur. Phys. J. C 9 (1999) 343.\n[71] M.S. Alam et al., [CLEO Collaboration], Phys. Rev. Lett. 74 (1995) 2885 as updated\nin S. Ahmed et al., CLEO CONF 99-10; BELLE Collaboration, BELLE-CONF-0003,\ncontribution to the 30th International conference on High-Energy Physics, Osaka, 2000.\nSee also K. Abe et al., [Belle Collaboration], [arXiv:hep-ex/0107065]; L. Lista [BaBar\nCollaboration], [arXiv:hep-ex/0110010]; C. Degrassi, P. Gambino and G. F. Giudice,\nJHEP 0012 (2000) 009; M. Carena, D. Garcia, U. Nierste and C. E. Wagner, Phys.\nLett. B 499 (2001) 141; D. A. Demir and K. A. Olive, Phys. Rev. D 65 (2002) 034007;\nT. Hurth, arXiv:hep-ph/0106050; F. Borzumati, C. Greub and Y. Yamada, arXiv:hepph/0311151.\n[72] C. L. Bennett et al., Astrophys. J. Suppl. 148 (2003) 1; D. N. Spergel et al., Astrophys.\nJ. Suppl. 148 (2003) 175.\n[73] J. R. Ellis, K. A. Olive, Y. Santoso and V. C. Spanos, Phys. Lett. B 565 (2003)\n176; M. Battaglia, A. De Roeck, J. R. Ellis, F. Gianotti, K. A. Olive and L. Pape,\narXiv:hep-ph/0306219. H. Baer and C. Balazs, JCAP 0305 (2003) 006; A. B. Lahanas\nand D. V. Nanopoulos, Phys. Lett. B 568 (2003) 55; U. Chattopadhyay, A. Corsetti\nand P. Nath, Phys. Rev. D 68 (2003) 035005.\n[74] J. R. Ellis, A. Ferstl, K. A. Olive and Y. Santoso, Phys. Rev. D 67 (2003) 123502.\n[75] J. Ellis, K. A. Olive, Y. Santoso and V. C. Spanos, arXiv:hep-ph/0310356.\n[76] I. I. Bigi and N. G. Uraltsev, Nucl. Phys. B 353, 321 (1991).\n[77] B. L. Ioffe, Z. Phys. C 18, 67 (1983).\n38\n\n\f"}