{"id": "http://arxiv.org/abs/hep-ph/0404217v2", "guidislink": true, "updated": "2004-08-31T19:53:40Z", "updated_parsed": [2004, 8, 31, 19, 53, 40, 1, 244, 0], "published": "2004-04-23T22:20:43Z", "published_parsed": [2004, 4, 23, 22, 20, 43, 4, 114, 0], "title": "Sudakov Resummation for Subleading SCET Currents and Heavy-to-Light Form\n  Factors", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0404197%2Chep-ph%2F0404052%2Chep-ph%2F0404259%2Chep-ph%2F0404258%2Chep-ph%2F0404193%2Chep-ph%2F0404038%2Chep-ph%2F0404094%2Chep-ph%2F0404168%2Chep-ph%2F0404256%2Chep-ph%2F0404018%2Chep-ph%2F0404056%2Chep-ph%2F0404140%2Chep-ph%2F0404090%2Chep-ph%2F0404124%2Chep-ph%2F0404115%2Chep-ph%2F0404055%2Chep-ph%2F0404109%2Chep-ph%2F0404239%2Chep-ph%2F0404024%2Chep-ph%2F0404177%2Chep-ph%2F0404118%2Chep-ph%2F0404181%2Chep-ph%2F0404204%2Chep-ph%2F0404194%2Chep-ph%2F0404064%2Chep-ph%2F0404034%2Chep-ph%2F0404156%2Chep-ph%2F0404288%2Chep-ph%2F0404063%2Chep-ph%2F0404173%2Chep-ph%2F0404135%2Chep-ph%2F0404273%2Chep-ph%2F0404077%2Chep-ph%2F0404167%2Chep-ph%2F0404088%2Chep-ph%2F0404274%2Chep-ph%2F0404083%2Chep-ph%2F0404244%2Chep-ph%2F0404123%2Chep-ph%2F0404079%2Chep-ph%2F0404025%2Chep-ph%2F0404020%2Chep-ph%2F0404145%2Chep-ph%2F0404291%2Chep-ph%2F0404246%2Chep-ph%2F0404276%2Chep-ph%2F0404092%2Chep-ph%2F0404269%2Chep-ph%2F0404158%2Chep-ph%2F0404041%2Chep-ph%2F0404217%2Chep-ph%2F0404248%2Chep-ph%2F0404281%2Chep-ph%2F0404238%2Chep-ph%2F0404153%2Chep-ph%2F0404270%2Chep-ph%2F0404054%2Chep-ph%2F0404089%2Chep-ph%2F0404027%2Chep-ph%2F0404236%2Chep-ph%2F0404223%2Chep-ph%2F0404069%2Chep-ph%2F0404242%2Chep-ph%2F0404230%2Chep-ph%2F0404271%2Chep-ph%2F0404062%2Chep-ph%2F0404048%2Chep-ph%2F0404160%2Chep-ph%2F0404216%2Chep-ph%2F0404250%2Chep-ph%2F0404105%2Chep-ph%2F0404091%2Chep-ph%2F0404017%2Chep-ph%2F0404237%2Chep-ph%2F0404049%2Chep-ph%2F0404068%2Chep-ph%2F0404045%2Chep-ph%2F0404241%2Chep-ph%2F0404178%2Chep-ph%2F0404132%2Chep-ph%2F0404117%2Chep-ph%2F0404001%2Chep-ph%2F0404195%2Chep-ph%2F0404130%2Chep-ph%2F0404116%2Chep-ph%2F0404084%2Chep-ph%2F0404232%2Chep-ph%2F0404163%2Chep-ph%2F0404225%2Chep-ph%2F0404234%2Chep-ph%2F0404050%2Chep-ph%2F0404040%2Chep-ph%2F0404162%2Chep-ph%2F0404107%2Chep-ph%2F0404103%2Chep-ph%2F0404283%2Chep-ph%2F0404175%2Chep-ph%2F0404227%2Chep-ph%2F0404208%2Chep-ph%2F0404061%2Chep-ph%2F0404026&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Sudakov Resummation for Subleading SCET Currents and Heavy-to-Light Form\n  Factors"}, "summary": "The hard-scattering contributions to heavy-to-light form factors at large\nrecoil are studied systematically in soft-collinear effective theory (SCET).\nLarge logarithms arising from multiple energy scales are resummed by matching\nQCD onto SCET in two stages via an intermediate effective theory. Anomalous\ndimensions in the intermediate theory are computed, and their form is shown to\nbe constrained by conformal symmetry. Renormalization-group evolution equations\nare solved to give a complete leading-order analysis of the hard-scattering\ncontributions, in which all single and double logarithms are resummed. In two\ncases, spin-symmetry relations for the soft-overlap contributions to form\nfactors are shown not to be broken at any order in perturbation theory by\nhard-scattering corrections. One-loop matching calculations in the two\neffective theories are performed in sample cases, for which the relative\nimportance of renormalization-group evolution and matching corrections is\ninvestigated. The asymptotic behavior of Sudakov logarithms appearing in the\ncoefficient functions of the soft-overlap and hard-scattering contributions to\nform factors is analyzed.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0404197%2Chep-ph%2F0404052%2Chep-ph%2F0404259%2Chep-ph%2F0404258%2Chep-ph%2F0404193%2Chep-ph%2F0404038%2Chep-ph%2F0404094%2Chep-ph%2F0404168%2Chep-ph%2F0404256%2Chep-ph%2F0404018%2Chep-ph%2F0404056%2Chep-ph%2F0404140%2Chep-ph%2F0404090%2Chep-ph%2F0404124%2Chep-ph%2F0404115%2Chep-ph%2F0404055%2Chep-ph%2F0404109%2Chep-ph%2F0404239%2Chep-ph%2F0404024%2Chep-ph%2F0404177%2Chep-ph%2F0404118%2Chep-ph%2F0404181%2Chep-ph%2F0404204%2Chep-ph%2F0404194%2Chep-ph%2F0404064%2Chep-ph%2F0404034%2Chep-ph%2F0404156%2Chep-ph%2F0404288%2Chep-ph%2F0404063%2Chep-ph%2F0404173%2Chep-ph%2F0404135%2Chep-ph%2F0404273%2Chep-ph%2F0404077%2Chep-ph%2F0404167%2Chep-ph%2F0404088%2Chep-ph%2F0404274%2Chep-ph%2F0404083%2Chep-ph%2F0404244%2Chep-ph%2F0404123%2Chep-ph%2F0404079%2Chep-ph%2F0404025%2Chep-ph%2F0404020%2Chep-ph%2F0404145%2Chep-ph%2F0404291%2Chep-ph%2F0404246%2Chep-ph%2F0404276%2Chep-ph%2F0404092%2Chep-ph%2F0404269%2Chep-ph%2F0404158%2Chep-ph%2F0404041%2Chep-ph%2F0404217%2Chep-ph%2F0404248%2Chep-ph%2F0404281%2Chep-ph%2F0404238%2Chep-ph%2F0404153%2Chep-ph%2F0404270%2Chep-ph%2F0404054%2Chep-ph%2F0404089%2Chep-ph%2F0404027%2Chep-ph%2F0404236%2Chep-ph%2F0404223%2Chep-ph%2F0404069%2Chep-ph%2F0404242%2Chep-ph%2F0404230%2Chep-ph%2F0404271%2Chep-ph%2F0404062%2Chep-ph%2F0404048%2Chep-ph%2F0404160%2Chep-ph%2F0404216%2Chep-ph%2F0404250%2Chep-ph%2F0404105%2Chep-ph%2F0404091%2Chep-ph%2F0404017%2Chep-ph%2F0404237%2Chep-ph%2F0404049%2Chep-ph%2F0404068%2Chep-ph%2F0404045%2Chep-ph%2F0404241%2Chep-ph%2F0404178%2Chep-ph%2F0404132%2Chep-ph%2F0404117%2Chep-ph%2F0404001%2Chep-ph%2F0404195%2Chep-ph%2F0404130%2Chep-ph%2F0404116%2Chep-ph%2F0404084%2Chep-ph%2F0404232%2Chep-ph%2F0404163%2Chep-ph%2F0404225%2Chep-ph%2F0404234%2Chep-ph%2F0404050%2Chep-ph%2F0404040%2Chep-ph%2F0404162%2Chep-ph%2F0404107%2Chep-ph%2F0404103%2Chep-ph%2F0404283%2Chep-ph%2F0404175%2Chep-ph%2F0404227%2Chep-ph%2F0404208%2Chep-ph%2F0404061%2Chep-ph%2F0404026&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The hard-scattering contributions to heavy-to-light form factors at large\nrecoil are studied systematically in soft-collinear effective theory (SCET).\nLarge logarithms arising from multiple energy scales are resummed by matching\nQCD onto SCET in two stages via an intermediate effective theory. Anomalous\ndimensions in the intermediate theory are computed, and their form is shown to\nbe constrained by conformal symmetry. Renormalization-group evolution equations\nare solved to give a complete leading-order analysis of the hard-scattering\ncontributions, in which all single and double logarithms are resummed. In two\ncases, spin-symmetry relations for the soft-overlap contributions to form\nfactors are shown not to be broken at any order in perturbation theory by\nhard-scattering corrections. One-loop matching calculations in the two\neffective theories are performed in sample cases, for which the relative\nimportance of renormalization-group evolution and matching corrections is\ninvestigated. The asymptotic behavior of Sudakov logarithms appearing in the\ncoefficient functions of the soft-overlap and hard-scattering contributions to\nform factors is analyzed."}, "authors": ["Richard J. Hill", "Thomas Becher", "Seung J. Lee", "Matthias Neubert"], "author_detail": {"name": "Matthias Neubert"}, "author": "Matthias Neubert", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/1126-6708/2004/07/081", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/hep-ph/0404217v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-ph/0404217v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "50 pages, 10 figures; minor corrections, version to appear in JHEP", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-ph/0404217v2", "affiliation": "Cornell", "arxiv_url": "http://arxiv.org/abs/hep-ph/0404217v2", "journal_reference": "JHEP0407:081,2004", "doi": "10.1088/1126-6708/2004/07/081", "fulltext": "CLNS 04/1865\nSLAC-PUB-10412\nhep-ph/0404217\n\narXiv:hep-ph/0404217v2 31 Aug 2004\n\nJune 25, 2004\n\nSudakov Resummation for Subleading SCET Currents\nand Heavy-to-Light Form Factors\n\nR.J. Hill(a) , T. Becher(a) , S.J. Lee(b) , and M. Neubert(b)\n(a)\n\nStanford Linear Accelerator Center, Stanford University\nStanford, CA 94309, U.S.A.\n(b)\n\nInstitute for High-Energy Phenomenology\nNewman Laboratory for Elementary-Particle Physics, Cornell University\nIthaca, NY 14853, U.S.A.\n\nAbstract\nThe hard-scattering contributions to heavy-to-light form factors at large recoil are studied systematically in soft-collinear effective theory (SCET). Large logarithms arising\nfrom multiple energy scales are resummed by matching QCD onto SCET in two stages\nvia an intermediate effective theory. Anomalous dimensions in the intermediate theory are computed, and their form is shown to be constrained by conformal symmetry.\nRenormalization-group evolution equations are solved to give a complete leading-order\nanalysis of the hard-scattering contributions, in which all single and double logarithms\nare resummed. In two cases, spin-symmetry relations for the soft-overlap contributions\nto form factors are shown not to be broken at any order in perturbation theory by hardscattering corrections. One-loop matching calculations in the two effective theories are\nperformed in sample cases, for which the relative importance of renormalization-group\nevolution and matching corrections is investigated. The asymptotic behavior of Sudakov\nlogarithms appearing in the coefficient functions of the soft-overlap and hard-scattering\ncontributions to form factors is analyzed.\n\n\f1\n\nIntroduction\n\nWeak-interaction form factors for exclusive heavy-to-light transitions at large recoil energy,\nsuch as B → π l ν with Eπ ∼ mB /2, are an important input to measurements of the parameters\nof the unitarity triangle. The QCD description in this energy regime is complicated by the\ncompetition between different scattering mechanisms and the resulting proliferation of relevant\nenergy scales. The tools of effective field theory provide an efficient means of separating the\ncontributions from different scales and setting up a controlled expansion in the small ratios\nΛQCD /E and ΛQCD /mb .\nThe appropriate theory in the present case is soft-collinear effective theory (SCET), which\nis constructed to describe processes with both soft and collinear partons [1, 2, 3, 4, 5]. Using\nSCET, it has been argued that there are two competing contributions to large-recoil heavyto-light form factors at leading power in ΛQCD /E (ignoring scaling violations from Sudakov\nlogarithms), referred to as the soft-overlap (or Feynman) mechanism and the hard-scattering\n(or hard spectator-scattering) mechanism [6, 7, 8]. In the first of these, the spectator quark\nin the B-meson is absorbed into the light final-state meson with no large momentum transfer.\nFor this to happen, both the initial- and final-state partons must be arranged in an endpoint\nconfiguration with atypically small values of certain momentum components. In the second\nmechanism, a large momentum is transferred to the spectator quark via hard gluon exchange.\nThe suppression due to the wave-function fall-off in the first case, and the suppression due to\nhard momentum transfer in the second case, are of the same order in power counting.\nIn this paper, we present a renormalization-group (RG) analysis of the hard-scattering\ncontributions. In SCET this mechanism is described by non-local four-quark operators, whose\nmatrix elements factorize into products of leading-twist light-cone distribution amplitudes\n(LCDAs) for the B-meson and the light final-state meson. The matrix elements are multiplied\nby calculable coefficient functions, and the resulting convolution integrals are convergent to\nall orders in perturbation theory [7, 8]. The coefficient functions at an appropriate low-energy\nhadronic scale may be computed to any order in αs by perturbative matching of QCD onto\nthe effective theory and subsequent RG evolution down to the low-energy scale. The analysis\napplies also to more complicated decay processes such as B → ππ and B → K ∗ γ, for which\nQCD factorization formulae relate the decay amplitudes to the B → π or B → K ∗ form\nfactors plus a residual hard-scattering term [9, 10, 11].\nThe soft-overlap contributions to heavy-to-light form factors can be defined in SCET in\nterms of matrix elements of effective-theory operators obeying spin-symmetry relations appropriate for a heavy-collinear transition current [8]. The relevant operators are rather complicated and lead to \"non-factorizable\" matrix elements sensitive to endpoint momentum\nconfigurations, transverse momentum components, and non-valence Fock states. However,\nthese soft overlap contributions can be described in terms of universal functions ζM (E) that\nonly depend on the light final-state meson but not on the Lorentz structure of the currents\nwhose matrix elements define the various form factors. For instance, there is one function\nζP (E) for decays into pseudoscalar mesons, and similarly only one function each, ζVk (E) and\nζV⊥ (E), for decays into longitudinally and transversely polarized vector mesons. This implies\nspin-symmetry relations between different soft form factors, which were first derived in [12]\nby considering the large-energy limit of QCD.\n1\n\n\fThe presence of both a soft-overlap and a hard-scattering contribution is summarized by\nthe factorization formula [13]\nZ 1\nZ ∞\ndω\nB→M\nφB (ω)\ndu fM φM (u) Ti (E, ω, u) ,\n(1)\nFi\n(E) = Ci (E) ζM (E) +\nω\n0\n0\nwhich is valid at leading power in ΛQCD /E. Here φB and φM are the LCDAs of the Bmeson and light final-state meson, and fM is the decay constant of the light meson. The\nWilson coefficients of the effective-theory operators, Ci (E) and Ti (E, ω, u), may be calculated\nin perturbation theory to any order in αs , and a RG analysis can be used to relate the\ncoefficients at different renormalization scales. However, the large-E behavior of the softoverlap contribution cannot be addressed satisfactorily in perturbation theory, since the longdistance matrix elements, ζM (E), depend on the energy E in a non-perturbative way [8]. Thus\nthe issue of whether one of the soft-overlap or the hard-scattering contributions is enhanced\nrelative to the other in the formal limit E → ∞ cannot be addressed using short-distance\nmethods. Phenomenologically, it appears that the soft-overlap terms are dominant for physical\nvalues of the coupling and mass parameters. Although not a complete answer to the question,\nthe relative suppression of the coefficients multiplying the long-distance matrix elements may\nbe computed using perturbative methods. Studying the resummation of Sudakov logarithms\nfor these coefficients, we find that the soft-overlap contribution is suppressed in the formal\nasymptotic limit E → ∞, but that this suppression is mild for realistic values of E.\nBecause the form factors involve three different physical scales, namely μ2 ∼ m2b (hard),\nμ2 ∼ mb ΛQCD (hard-collinear), and μ2 ∼ Λ2QCD (soft), integrating out modes of progressively\nsmaller virtuality results in a sequence of effective theories. At the high scale μ2 ∼ m2b , the\neffective theory is described by the usual QCD Lagrangian (with five quark flavors) plus an\neffective weak-interaction Lagrangian obtained by integrating out virtual W and Z bosons and\ntop quarks. Integrating out modes of virtuality m2b we arrive at an intermediate effective theory\ncontaining soft modes and hard-collinear modes of virtuality p2hc ∼ mb ΛQCD . In this paper we\nare mainly concerned with this intermediate theory, called SCETI [2, 3, 4]. Integrating out the\nhard-collinear modes of virtuality mb ΛQCD yields the final low-energy theory, denoted SCETII ,\nconsisting of soft and collinear modes of virtuality p2s , p2c ∼ Λ2QCD . In this case, soft-collinear\nmessenger modes are also required [14, 15].\nIn the following section we briefly review some relevant elements of SCET. Section 3 lists\nthe leading and subleading SCETI current operators, which are required for the discussion\nof heavy-to-light form factors, together with the matching coefficients for these operators\nobtained at tree level. For the example of the scalar current, we also calculate the oneloop matching coefficients of the leading and subleading operators. Section 4 contains the\nmain result of the paper, i.e., the anomalous dimensions of the subleading SCETI current\noperators. These quantities exhibit an interesting symmetry property, which can be traced\nback to a conformal symmetry (at the classical level) in the hard-collinear sector. We briefly\nreview the constraints imposed by conformal symmetry in Section 5, and use these results to\ndiagonalize the non-local part of the evolution operator. We also present a formal algebraic\nsolution of the evolution equations for the currents and their Wilson coefficient functions. In\nSection 6, we discuss the operator representation and renormalization for the hard-scattering\ncontributions in SCETII . In two cases, namely for the form-factor ratios A1 /V and T2 /T1 ,\n2\n\n\fwe find that the spin-symmetry relations holding for the soft-overlap contributions are not\nbroken by the hard-scattering terms, and therefore, at leading order in 1/E and to all orders\nin αs , only eight of the ten form factors describing B → P, V decays are independent. The\nrelevant matching coefficients (jet functions) can be related to two universal quantities Jk\nand J⊥ , which we compute including one-loop radiative corrections. As an application of our\nresults, we present in Section 7 a RG-improved analysis of the hard-scattering contributions\nto the large-recoil heavy-to-light form factors, in which all single and double logarithms are\nresummed. Section 8 treats the asymptotic limit of Sudakov suppression factors in the softoverlap and hard-scattering terms. In Section 9 we present our summary and conclusions.\n\n2\n\nSoft-collinear effective theory\n\nIn processes involving energetic light particles, such as the pion emitted at large recoil in\nsemileptonic B decay, it is convenient to introduce light-cone coordinates\npμ = n * p\n\nn̄μ\nnμ\n+ n̄ * p\n+ pμ⊥ ≡ pμ+ + pμ− + pμ⊥ ,\n2\n2\n\n(2)\n\nthe second equality serving to introduce the vectors p+ and p− . The light-like vectors nμ , n̄μ\nsatisfy n2 = n̄2 = 0 and n * n̄ = 2. As mentioned in the Introduction, depending on the value\nof the renormalization scale the effective theory is described by hard-collinear and soft modes\n(SCETI ), or by collinear, soft, and soft-collinear messenger modes (SCETII ). It is conventional\nto quote the scaling behavior of the components (p+ , p− , p⊥ ) with the energy in terms of a small\nparameter λ ∼ ΛQCD /E. The collinear and soft momenta of the partons inside the external\nmeson states in B → M transitions scale like pc ∼ E(λ2 , 1, λ) and ps ∼ E(λ, λ, λ). Hardcollinear momenta are defined to scale as phc ∼ E(λ, 1, λ1/2 ), whereas soft-collinear momenta\nscale as psc ∼ E(λ2 , λ, λ3/2 ). Throughout this paper we will identify\nE = v * p− =\n\n1\n(n * v)(n̄ * p) ≫ ΛQCD\n2\n\n(3)\n\nwith the energy of a collinear or hard-collinear particle in the B-meson rest frame. Strictly\nspeaking, the energy v * p differs from E by terms which can be neglected at leading and first\nsubleading power.\nFields in SCETI and their scalings with the expansion parameter λ1/2 are [2, 3, 4]\nξhc =\n\nn\n/n\n/̄\nψhc ∼ λ1/2 ,\n4\n\nAμhc ∼ (λ, 1, λ1/2 ) ,\n\nqs ∼ λ3/2 ,\n\nh ∼ λ3/2 ,\n\nAμs ∼ (λ, λ, λ) ,\n\n(4)\n\nwhere h is the heavy-quark field in Heavy-Quark Effective Theory (HQET) [16]. The leadingorder soft and hard-collinear quark Lagrangians are\nL(0)\n/ s qs + h̄ iv * Ds h ,\ns = q̄s iD\n\u0012\n\u0013\n1\nn\n/̄\n(0)\n ̄\nin * Dhc+s + iD\n/ hc⊥\niD\n/ hc⊥ ξhc .\nLhc = ξhc\n2\nin̄ * Dhc\n3\n\n(5)\n\n\fHere iDsμ = i∂ μ + gAμs denotes the covariant derivative built with soft gluon fields, etc. For\n(0)\n(0)\nthe pure gauge sector we may write Lg = Ls + Lhc , where Ls is the usual gluon Lagrangian\n(0)\nμ\nrestricted to soft fields, and Lhc is obtained by substituting iD μ → iDhc\n+ gAμs+ into the\nYang-Mills Lagrangian. In interactions involving both soft and hard-collinear fields, the soft\nfields are evaluated at x− . In particular, this rule applies to the first term in the hard-collinear\nLagrangian, in which in * Dhc+s = in * ∂ + gn * Ahc (x) + gn * As (x− ). Corrections from the\nmultipole expansion φs (x) = φs (x− ) + x⊥ * ∂⊥ φs (x− ) + . . . appear as higher-order terms in the\nexpansion in λ1/2 . We shall also need the subleading interaction Lagrangian [4]\n(1/2)\n\nLqξ\n\n= ξ ̄hc iD\n/ hc⊥ Whc qs + h.c. ,\n\n(6)\n\nwhich transforms a soft quark into a hard-collinear one (and vice versa). Here Whc is a hardcollinear Wilson line in the n̄ direction necessary to ensure gauge invariance. Additional terms\nin the Lagrangian are required to describe the soft-overlap contribution in SCETI [6]; however,\nthey will not be of relevance to our discussion here.\nThe Lagrangian interactions are a special case of general gauge-invariant operators. Imposing homogeneous gauge transformations in the soft and hard-collinear sectors [17], which\nstrictly respect the SCET power counting, the \"homogenized\" hard-collinear fields are restricted to appear in the combinations\n†\nXhc = Whc\nξhc ∼ λ1/2 ,\n\n†\nμ\nAμhc⊥ = Whc\n(iDhc⊥\nWhc ) ∼ λ1/2 ,\n\n†\nWhc\nin * Dhc+s Whc ∼ λ ,\n\n(7)\n\nμ\nand may be acted on by partial derivatives in̄ * ∂ ∼ 1 and i∂⊥\n∼ λ1/2 . This result follows\nfrom considering the most general operator in the gauge where n̄ * Ahc = 0, n * As = 0, and\nthen returning to an arbitrary gauge by using the transformation laws appropriate for the\nhomogenized fields. The O(1) components in̄ * ∂ may appear an arbitrary number of times\nin operators of a given order in the power counting. This is accounted for by smearing hardcollinear fields along the n̄ direction, i.e., φhc (rn̄) with arbitrary r. Soft fields may appear as\nqs , h ∼ λ3/2 and iDsμ ∼ λ, and position arguments x⊥ ∼ λ−1/2 and x+ ∼ λ0 arising from the\nmultipole expansion may also appear in interactions involving both soft and hard-collinear\nfields. Until Section 6 we deal exclusively with SCETI , and from now on will drop the label\n\"hc\" on the hard-collinear fields.\n\n3\n\nFlavor-changing currents in SCETI\n\nHeavy-to-light form factors describing current-induced B → M transitions (with M a light\nmeson) at large recoil are subleading quantities in the large-energy limit, in the sense that the\ntransitions they describe cannot be mediated by leading-order SCETI currents and Lagrangian\ninteractions. For a leading-order analysis of these form factors, it is sufficient to include heavycollinear current operators through the first subleading order in SCETI power counting [6, 7].\nThese operators contain a heavy-quark field, a hard-collinear quark field, and (in the case of\nsubleading operators) transverse derivatives and gluon fields. They provide a representation\nin SCETI of the QCD heavy-light current operators JQCD = q̄ Γ b, which we renormalize at\na scale μQCD . (The vector and axial-vector currents are not renormalized.) At a given order\n4\n\n\fin power counting, a minimal basis is determined by first writing the most general gaugeinvariant operators constructed from the available fields and external parameters, and then\nrequiring invariance under small variations of the external parameters [3, 18].\n\n3.1\n\nDetermination of the operator basis\n\nμ\nIt is convenient to restrict attention to the case v⊥\n= 0, where v denotes the B-meson velocity.\nIt follows that\n\u0012\n\u0013\n1\nnμ\nμ\nμ\nn̄ =\n2v −\n.\n(8)\nn*v\nn*v\n\nWith this choice there are two remaining reparameterization transformations, which we consider in their infinitesimal form. The first enforces invariance under the rescaling\nnμ → (1 + α) nμ ,\n\nn̄μ → (1 − α) n̄μ\n\n(with α ∼ 1) .\n\n(9)\n\nThe second allows small changes in the perpendicular components, such that\nnμ → nμ + ǫμ⊥ ,\n\nn̄μ → n̄μ −\n\nǫμ⊥\n(n * v)2\n\n(with ǫ⊥ ∼ λ1/2 ) .\n\n(10)\n\nThe power counting assigned to α and ǫ⊥ is the largest possible (i.e., providing the strongest\nconstraints) such that the scaling of hard-collinear momenta is unaltered. In both cases, the\nvariation of n̄μ is determined by (8) and the variation of nμ . An alternative approach would\nbe to introduce n̄ and v as arbitrary vectors, subject only to the conditions n̄2 = 0, n * n̄ = 2,\nand v 2 = 1. Then n̄μ would not transform under (10), and there would be an additional\nreparameterization transformation\nnμ → nμ ,\n\nn̄μ → n̄μ + eμ⊥\n\n(with e⊥ ∼ 1) .\n\n(11)\n\nIn this case a consistent power counting requires v⊥ ∼ O(1), and many more operators appear\nat a given order than when v⊥ = 0 [19]. At higher order it would also be necessary to impose\ninvariance under heavy-quark velocity transformations, v → v + δv with v * δv = 0. However,\nthese transformations enter only at O(λ) and so are irrelevant for our leading-order analysis\nof heavy-to-light form factors.\nRequiring invariance under these transformations, it is straightforward to write down the\nmost general operators with given quantum numbers. The leading-order currents are O(λ2 ),\nand for the scalar case we find\n(0)\n\nJS (s, x) = e−imb v*x X̄(x + sn̄) h(x− ) ,\n\n(12)\n\nwhere the phase factor arises from the definition of the HQET field h, and only the first term,\nh(x− ), has been retained in the multipole expansion. In the form-factor analysis we can use\ntranslational invariance to set x = 0 in the weak current operators, and so we restrict attention\n(0)\n(0)\nto JS (s) ≡ JS (s, x = 0). Similarly, for the vector and tensor currents we have\n(0) μ\n\n(0) μν\n\nJV i (s) = X̄(sn̄) Γμi h(0) ,\n\nJT i\n5\n\n(s) = X̄(sn̄) Γμν\ni h(0) ,\n\n(13)\n\n\fwith the Dirac structures\nΓμ1 = γ μ ,\n\nΓμ2 = v μ ,\n\n[μ ν]\nΓμν\n1 = γ γ ,\n\nΓμ3 =\n\nnμ\n,\nn*v\nΓμν\n3 =\n\n[μ ν]\nΓμν\n2 = v γ ,\n\nn[μ γ ν]\n,\nn*v\n\nΓμν\n4 =\n\nn[μ v ν]\n.\nn*v\n\n(14)\n\nSquare brackets around indices denote anti-symmetrization. Note that all structures invariant\nunder the rescaling (9) are allowed at leading order, since the reparameterization transformations (10) enter only at subleading order.\nBefore writing the most general set of subleading operators, we first consider the variation\nof the leading operators under (10). To first order in λ1/2 , the fermion fields transform as\n\u0012\n\u0013\nn\n/̄ ǫ/⊥\nn̄ * x\nδ X̄(x + sn̄) = X̄(x + sn̄)\n−i\nǫ⊥ * gAs⊥ (x− ) ,\n2 2\n2\nδh(x− ) =\n\nn̄ * x\nǫ⊥ * ∂⊥ h(x− ) .\n2\n\n(15)\n\nThe soft gluon appearing in the variation of X(x) arises from the field redefinition enforcing\nhomogeneous gauge transformations in the hard-collinear sector [17]. The combination X of\n′\n′\nhard-collinear fields may be expressed as X = R† (/\nnn/4)\n/̄\nψhc\n, where ψhc\nis the (unhomogenized)\nhard-collinear fermion field in the gauge n̄ * Ahc = 0, and R(x) is a soft Wilson line from x− to\n′\nx. Under the transformation (10), δψhc\n= O(λ), and the remaining variation of X arises from\nthe projection n\n/ n/4\n/̄ and the homogenizing factor R. Next, we consider the variations of the\nvarious Dirac structures under the transformation (10), finding\nδΓμ1 = 0 ,\n\nδΓμ2 = 0 ,\n\nδΓμ3 =\n\nǫμ⊥\n,\nn*v\n[μ\n\nδΓμν\n1\n\n= 0,\n\nδΓμν\n2\n\n= 0,\n\nδΓμν\n3\n\nǫ γ ν]\n= ⊥\n,\nn*v\n\n[μ\n\nδΓμν\n4\n\nǫ v ν]\n= ⊥\n.\nn*v\n\n(16)\n\nThe variations of the subleading operators must cancel these contributions.\n←\n−\nThe subleading O(λ1/2 ) operators must contain exactly one insertion of Aμ⊥ or (−i∂⊥ μ )\nacting on the hard-collinear field X̄, or x⊥ * Ds⊥ with the derivative acting on h. To determine\nthe most general form, we note the following transformation properties, working now to zeroth\norder in λ1/2 :\n\u0012\n←\n− \u0013\n\u0001\n−i ∂ ⊥μ\nn̄ * x\nǫμ⊥\nμ\nδA⊥ = 0 ,\nδ\n,\nδ x⊥ * Ds⊥ = −\nǫ⊥ * Ds⊥ .\n(17)\n=\n−\n←\n−\n2\n2\n−in̄ * ∂\n←\n−\nThus, (−i ∂ ⊥μ ) and x⊥ * Ds⊥ are restricted to appear in specific reparameterization-invariant\ncombinations with the leading-order currents, and there are no constraints on the appearance\nof Aμ⊥ . Inspection of (15), (16), and (17) allows us to deduce the form of the most general\noperators through O(λ1/2 ). For the scalar current\n←\n−\n\u0012\n\u0013\ni ∂/ ⊥ n\n/̄\nA\n−imb v*x\nJS (s, x) = e\nX̄(x + sn̄) 1 −\n←\n− + x⊥ * Ds⊥ h(x− ) ,\nin̄ * ∂ 2\n6\n\n\fJSB (s, r, x) = e−imb v*x X̄(x + sn̄) A\n/ ⊥ (x + rn̄) h(x− ) .\n\n(18)\n\nAgain, using translational invariance we can specialize to x = 0 and define JSA (s) ≡ JSA (s, 0)\nand JSB (s, r) ≡ JSB (s, r, 0). Similarly, for the vector and tensor currents at x = 0 we obtain\n←\n−\n\u0013\n\u0012\ni ∂/ ⊥ n\n/̄ μ\nAμ\nΓ1,2 h(0) ,\nJV 1,2 (s) = X̄(sn̄) 1 −\n←\n−\nin̄ * ∂ 2\n←\n−\n\u0012\n\u0013\n←\n−\ni ∂/ ⊥ n\n/̄ μ\n2\ni ∂ ⊥μ\nAμ\nJV 3 (s) = X̄(sn̄) 1 −\nΓ3 h(0) +\nX̄(sn̄)\n←\n−\n←\n− h(0) ,\nn*v\nin̄ * ∂ 2\nin̄ * ∂\nμ\nJVB1,2,3\n(s, r) = X̄(sn̄) A\n/ ⊥ (rn̄) Γμ1,2,3 h(0) ,\n\nJVB4μ (s, r) = X̄(sn̄) Aμ⊥ (rn̄) h(0) ,\n\n(19)\n\nand\n←\n−\n\u0012\n\u0013\ni ∂/ ⊥ n\n/̄ μν\n= X̄(sn̄) 1 −\nΓ1,2 h(0) ,\n←\n−\nin̄ * ∂ 2\n←\n−\n\u0012\n\u0013\n/̄ μν\ni ∂/ ⊥ n\nA μν\nJT 3 (s) = X̄(sn̄) 1 −\nΓ3 h(0) +\n←\n−\nin̄ * ∂ 2\n←\n−\n\u0012\n\u0013\n/̄ μν\ni ∂/ ⊥ n\nA μν\nJT 4 (s) = X̄(sn̄) 1 −\nΓ4 h(0) +\n←\n−\nin̄ * ∂ 2\n\nμν\nJTA1,2\n(s)\n\nμν\nJTB1,2,3,4\n(s, r) = X̄(sn̄) A\n/ ⊥ (rn̄) Γμν\n1,2,3,4 h(0) ,\n[μ\n\nν]\n\nμν\nJTB5,6,7\n(s, r) = X̄(sn̄) A⊥ (rn̄) Γ1,2,3 h(0) .\n\n←\n−[μ\n2\ni ∂ ⊥ γ ν]\nX̄(sn̄)\n←\n− h(0) ,\nn*v\nin̄ * ∂\n←\n−[μ\n2\ni ∂ ⊥ v ν]\nX̄(sn̄)\n←\n− h(0) ,\nn*v\nin̄ * ∂\n\n(20)\n\nIn the tensor case, one combination of the JTBi μν is redundant in four dimensions, being propor[μ ν ρ]\ntional to the anti-symmetric product γ⊥ γ⊥\nγ⊥ . This combination will be isolated in the next\nsection, when we define a new basis of current operators that are renormalized multiplicatively.\nWe will refer to the quark-antiquark operators as \"A-type currents\", and to the quarkantiquark-gluon operators as \"B-type currents\". The A-type currents contain both leading\nand subleading contributions, which are linked by reparameterization invariance. Pseudoscalar\nand axial-vector currents are obtained from the above expressions for scalar and vector currents\nby insertion of γ5 next to the light fermion field. (This simple prescription holds only in the\n\"naive dimensional regularization\" (NDR) scheme.) The results (18), (19), and (20) agree\nwith the basis of operators found in [19], specialized to the case where v⊥ = 0. However, the\nderivation presented here is much simpler. We also stress that our definition of the subleading\ncurrents, in which the A-type currents contain ∂⊥ rather than a covariant derivative, will\nensure that the A-type (two-particle) and B-type (three-particle) operators do not mix under\nrenormalization.\nThe subleading contributions to the A-type currents containing perpendicular derivatives\non the hard-collinear fields do not contribute at leading order in the form factor analysis.\n7\n\n\fQCD\n\nSCETI\n\n−→\n\nSCETII\n\n−→\n\nFigure 1: Two-step matching procedure for a hard-scattering contribution. The dashed lines\nin the SCETI diagram represent hard-collinear fields, those in the SCETII four-quark operator\ndenote collinear fields. In all cases, the heavy quark is depicted as a double line, and the wavy\nline represents the flavor-changing current.\n\nThe extra derivatives yield an O(λ) suppression on top of the suppression factors already\npresent when the leading currents mediate the decay process by either the soft-overlap or\nhard-scattering mechanisms. A formal demonstration of this point can be found in [7]. The\nremaining A-type currents (at x = 0) all take the form X̄(sn̄)Γ h(0), differing only by their\nDirac structure Γ. Spin symmetries arising from the constraints n\n/ X = 0, v/h = 0 may then be\nused to relate matrix elements involving the same initial- and final-state mesons. Although the\nSCETII representation of the A-type currents is rather complicated [8], owing to the symmetry\nrelations the results can be expressed in terms of a small number of non-perturbative functions.\nThe A-type currents thus give rise to the first, soft-overlap term in (1).\nIn general, the B-type currents break the spin symmetries. When applied to form-factor\nmatrix elements, the hard-collinear gluon emitted from the current is absorbed by the spectator\nquark, allowing the decay to proceed via the hard-scattering mechanism. Figure 1 illustrates\nthe two-step matching of a typical hard-scattering amplitude. In the first step, the QCD\ncurrent is matched onto a B-type SCETI current. In the second step, the hard-collinear\ngluon is integrated out, and the hard-scattering amplitude is described in the final low-energy\ntheory by non-local four-quark operators. Section 6 examines this SCETII representation,\nwhere matrix elements take the form of the second, symmetry-breaking term in (1).\n\n3.2\n\nMatching calculations\n\nWe proceed to find the SCETI representations of the QCD scalar, vector, and tensor currents\nS = q̄ b ,\n\nV μ = q̄ γ μ b ,\n\nT μν = (−i) q̄ σ μν b = q̄ γ [μ γ ν] b .\n\n(21)\n\nThe QCD operators S and T μν require renormalization and are defined in the modified minimal\nsubtraction (MS) scheme at a fixed scale μQCD = O(mb ). The SCETI representations of these\noperators, evaluated at position x = 0, are given by an expansion (summed over i, j)\nZ\nZ\n1\nA\nA\nq̄ Γ b → ds C̃i (s) Ji (s) +\ndr ds C̃jB (s, r) JjB (s, r) + . . .\n2E\nZ\n1\nA\nA\ndu CjB (E, u) JjB (u) + . . .\n(22)\n= Ci (E) Ji (0) +\n2E\n8\n\n\fwith operators JiA , JjB as determined in the previous section for the appropriate quantum\nnumbers. We denote coefficient functions in position space with a tilde. In the second line,\nwe have used translational invariance and defined the momentum-space coefficients (without\na tilde) as\nZ\nA\nCi (E) = ds eisn̄*P C̃iA (s) ,\nCjB (E, u)\n\n=\n\nZ\n\ndr ds ei(us+ūr)n̄*P C̃jB (s, r) .\n\n(23)\n\nHere P = Pout − Pin is the total hard-collinear momentum of external states (strictly speaking\nthis is a momentum operator), and E = v * P− = (n * v)(n̄ * P )/2. Reparameterization\ninvariance ensures that the momentum-space coefficient functions depend on the combination\n(n * v)(n̄ * P ) = 2E, not n̄ * P . The variable u ∈ [0, 1] is the fraction of the large momentum\ncomponent n̄ * P carried by the fields in X̄ (the dressed outgoing hard-collinear quark field),\nand ū ≡ 1 −u is the corresponding momentum fraction carried by the fields in A⊥ (the dressed\noutgoing hard-collinear gluon field). The object JjB (u) in (22) denotes the Fourier-transformed\ncurrent operator\nZ\nds −iun̄*P s B\nB\nJj (u) = n̄ * P\ne\nJj (s, 0) .\n(24)\n2π\nNote that both JiA (0) and JjB (u) also depend on the large energy scale E as well as on the\nrenormalization scale μ. These dependences will be suppressed for simplicity.\nThe matching conditions for the momentum-space Wilson coefficient functions CiA and CjB\nat tree level follow from an analysis of current matrix elements in QCD and SCETI . The\nonly subtlety is that a non-zero matching contribution is obtained from graphs where a hardcollinear gluon is emitted from the hard-collinear quark line. This might seem surprising at\nfirst sight, because the resulting propagator is close to the mass-shell. This contribution is\npresent because two of the four components of the hard-collinear quark spinor are removed\nwhen QCD is matched onto SCETI . To see how it arises, consider the following diagram:\n=\n\n+\n(25)\n\nγμ\n\n1\nΓ\np/\n\n=\n\nγμ\n\nn\n/ 1\nΓ\n2 n*p\n\n+\n\nγμ\n\nn\n/̄ 1\nΓ\n2 n̄ * p\n\nFor vanishing transverse momentum (p⊥ = 0), the intermediate quark propagator takes the\nform shown in the second line. In the effective theory, the first term on the right hand side is\nrepresented by a graph where the gluon is emitted from a hard-collinear quark line. The second\none, however, corresponds to a graph where the gluon is emitted from the B-type current, and\ncontributes to the matching coefficient. Our tree-level results are given as follows.\nScalar current:\nCSA = 1 ,\n\nCSB = −1 .\n9\n\n(26)\n\n\fFigure 2: One-loop QCD diagrams contributing to the matching calculation for the subleading\nscalar current. The external gluon can be attached at any of the places marked by a cross.\nVector current:\nCVA1 = 1 ,\n\nCVA2,3 = 0 ,\n\nCVB1 = 1 ,\n\nCVB2 = −2 ,\n\nCVB3 = −x ,\n\nCVB4 = 0 .\n\n(27)\n\nTensor current:\nCTA1 = 1 ,\n\nCTA2,3,4 = 0 ,\n\nCTB1 = −1 ,\n\nCTB2 = −4 ,\n\nCTB3 = −2x ,\n\nCTB4,5,6 = 0 ,\n\nCTB7 = −4x .\n\n(28)\n\nHere x = 2E/mb . Our tree-level matching coefficients agree with previous results, for CiA in\n[1], and for CjB in [4, 19]. 1\nFor the resummation of the leading logarithms, the tree-level Wilson coefficients are sufficient. However, for the physical value of the b-quark mass the one-loop matching corrections\nmay turn out to be comparable to the effect of leading-order running. To address this question, we evaluate as an example the one-loop matching corrections for the scalar current. We\ncalculate the decay of a b-quark to an energetic light quark and an energetic gluon at one-loop\norder. Throughout this paper we use dimensional regularization with d = 4 − 2ǫ dimensions\nand employ the MS scheme to remove ultra-violet (UV) singularities. We use the backgroundfield method and perform the calculation in an arbitrary covariant gauge. The eight one-loop\ndiagrams contributing to the matrix element are shown in Figure 2. Each diagram involves\nat least one heavy-quark propagator; diagrams involving only massless propagators vanish in\ndimensional regularization once the external lines are put on the mass shell. Note that there is\nagain a contribution in Figure 2 corresponding to gluon emission from a nearly on-shell hardcollinear quark line, which is decomposed as in (25). To correctly identify the two parts of the\nQCD loop diagram, one first considers it for p2 6= 0 and then expands around p2 = 0. This\nexpansion must be done before performing loop integrations. This ensures that all effectivetheory loop diagrams vanish and only the hard part of the QCD diagram is left, which is\nexactly the part that has to be absorbed into the Wilson coefficients. We set all perpendicular\ncomponents of the external momenta to zero and equate the effective-theory expression to the\nQCD result for the three-point function. Depending on the polarization of the background\ngluon field, we thus determine either the Wilson coefficient CSA of the leading-order current\n1\n\nNote that we use square brackets around two or more indices to denote antisymmetrization (γ [μ γ ν] =\n− γ ν γ μ ), etc.), whereas in [19] square brackets around two indices denote a commutator (γ [μ γ ν] =\nγ γ − γ ν γ μ , etc.).\n1\nμ ν\n2 (γ γ\nμ ν\n\n10\n\n\foperator (for an A− gluon), or the coefficient CSB of the subleading current (for an A⊥ gluon).\nAfter MS subtractions, we obtain in the first case (again with x = 2E/mb )\n\u0014\n\u0015\n2E\nμQCD 3 − x\nπ2\nC F αs\n2 2E\nA\n−2 ln\n,\n+ 5 ln\n+ 6 ln\n+\nln x − 2 Li2 (1 − x) −\nCS (E) = 1 +\n4π\nμ\nμ\n2E\n1−x\n12\n(29)\nwhere αs ≡ αs (μ). The fact that this expression, which was extracted from a three-point\nfunction, agrees with the result obtained from the heavy-to-light two-point function [1] follows\nfrom invariance under collinear gauge transformations. Performing the calculation for the case\nof perpendicular gluon polarization, we obtain for the coefficient of the operator JSB\n(\nC\nα\n2E\n2x\nF s\nCSB (E, u) = −CSA (E) +\n4 ln\n−4+\nln x\n4π\nμ\n1−x\n)\n\u0014\n\u0012\n\u0013\n\u0015\n1\n2(2 − x) ln ū\n3−x\nx\n1+\nln(xū) +\n+\n−\n1 − xū\n1 − xū 1 − x\n1−x u\n(\u0012\n\u0012\n\u0013\n\u0013\nC A αs\n2E\n2x\n2 ln ū\n2 ln u\n+ CF −\n2 ln\n− 1 + ln u\n+\nln(xū) −\n2 4π\nμ\nū\n1 − xū\nu\n\u0014\n\u0015)\nh\ni\nπ2\n2\n(1 − xu) Li2 (1 − x) − Li2 (1 − xu) − Li2 (1 − xū) +\n, (30)\n+\nxuū\n6\n\nwhere u corresponds to the fraction of the longitudinal hard-collinear momentum carried by the\nfinal-state quark. We note that at the endpoints, CSB diverges only logarithmically: CSB ∼ ln2 u\nat u = 0 and CSB ∼ ln ū at ū = 0. Also, despite appearances, there is no singularity at x = 1 or\nx = 1/ū. The scale dependence of CSB agrees with a direct analysis of operator renormalization\ngiven in the following section. We postpone a detailed discussion on the relative importance\nof matching and RG running until Section 5, when a solution to the RG equations is at hand.\nAs a final remark before ending this section, we note that the scalar current is not an\nindependent operator but can be related to the vector current using the equation of motion\nfor the quark fields, i∂ν V ν = mb (μQCD ) S(μQCD ), where S(μQCD ) denotes the scalar QCD\ncurrent in (21) renormalized at scale μQCD , and mb (μQCD ) is the running b-quark mass, both\ndefined in the MS scheme. Applying this identity to (22), it follows that to all orders in αs\nand at leading order in ΛQCD /mb\n\u0012\n\u0013\nE\nmb (μQCD ) A\nA\nCV 1 + 1 −\nCVA2 + CVA3 =\nCS ,\nmb\nmb\n\u0012\n\u0013\nE\nmb (μQCD ) B\nB\nCV 1 + 1 −\nCVB2 + CVB3 =\nCS ,\n(31)\nmb\nmb\n\nwhere at this order there is no difference between the meson mass mB and the b-quark pole\nmass mb . It is readily seen from (26) and (27) that these relations hold at tree level. At\none-loop order\n\u0012\n\u0013\nmb\nmb (μQCD )\nC F αs\n6 ln\n= 1+\n−4 .\n(32)\nmb\n4π\nμQCD\n11\n\n\fNote that the dependence on the scale μQCD cancels between the running mass mb (μQCD ) and\nthe scalar coefficients CSA and CSB on the right-hand side of the relations in (31). The first of\nthese relations can be verified to hold at one-loop order using the results of [1]. In Section 7,\nwe will use these results to deduce the one-loop matching coefficients relevant to the vector\nform factor F0 (q 2 ), using only scalar-current matching calculations.\n\n4\n\nAnomalous dimensions\n\nThe matching results derived in the previous section can be trusted at a high renormalization\npoint μ = μh ∼ 2E, at which the Wilson coefficients are free of large logarithms and so can\nbe reliably computed using fixed-order perturbation theory. In order to evolve the coefficients\ndown to lower values of μ, one needs to solve the RG equation for the SCETI current operators.\nThe currents JiA and JjB do not mix under renormalization. To see this, we first note that\nthe operators JjB cannot mix into JiA , as they are of higher order in power counting than\nthe leading terms of JiA . In principle, the operators JiA could mix into JjB via time-ordered\nproducts of either the leading terms of JiA with the subleading SCETI Lagrangian, or the\nμ\nsubleading terms of JiA with the leading SCETI Lagrangian. However, when v⊥\n= 0, in both\ncases the resulting time-ordered products have a structure different from the JjB operators,\ncontaining additional perpendicular partial derivatives acting on hard-collinear fields. Finally,\nthe various JiA operators do not mix among themselves, since time-ordered products with the\nSCETI Lagrangian cannot mix the different Dirac structures appearing in their definition. As\na result, the effective-theory currents obey the integro-differential RG equations (summation\nover k is understood in the second equation)\nd\nJ A (0) = −γ A JiA (0) ,\nd ln μ i\nZ 1\nd\nB\nB\nJj (u) = −\ndv γjk\n(u, v) JkB (v) ,\nd ln μ\n0\n\n(33)\n\nand the corresponding momentum-space Wilson coefficients satisfy the equations\nd\nCiA (E) = γ A CiA (E) ,\nd ln μ\nZ 1\nd\nB\nB\nC (E, v) =\ndu γkj\n(u, v) CkB (E, u) .\nd ln μ j\n0\n\n(34)\n\nB\nThe anomalous dimensions γ A and γjk\nare calculated by isolating the UV divergences in SCETI\nloop diagrams. The one-loop expression for γ A has been calculated previously [1], with the\nresult\n\u0012\n\u0013\nμ\nC F αs\n5\nμ\nA\n− ln\n+ O(αs2 ) .\n(35)\n+ γ̃(αs ) =\n−\nγ = −Γcusp (αs ) ln\n2E\nπ\n2E 4\n\nIn [20] it was argued that the first equality in (35) is valid to all orders in αs . The appearance\nof ln μ in the anomalous dimension is explained by the theory of light-like Wilson loops with\n12\n\n\fcusps. Only a single logarithm appears at any order in the strong coupling, with a coefficient\ngoverned by the universal cusp anomalous dimension Γcusp [21].\nUnlike the situation for the A-type operators, the anomalous dimensions of the B-type\ncurrents depend on the specific Dirac structure, and there is non-trivial operator mixing. The\nrenormalization properties of all B-type operators can be discussed by defining two operators\nJ1 (s) = X̄(sn̄) A⊥μ (0) Γμ⊥ h(0) ,\n\nμ\nJ2 (s) = X̄(sn̄) A⊥μ (0) γ⊥\nγ⊥ν Γν⊥ h(0) ,\n\n(36)\n\nand their Fourier transforms as defined in (24). The Dirac structure Γμ⊥ is determined by the\nspecific current under consideration. It follows from the Feynman rules of SCETI and the\nprojection properties of the two-component spinor X that the two operators Ji close under\nrenormalization. Defining renormalization constants via Jren\n= Zij Jbare\n, we obtain\ni\nj\n!\nZ11\nZ12\nZ=\n,\n(37)\n0 Z11 + 2(1 − ǫ)Z12\npoles\n\nwhere, in the MS scheme, it is understood that only pole terms in the dimensional regulator\nǫ = 2 − d/2 are kept in Z − 1. We define two anomalous-dimension functions\nγ1 = 2αs\n\n∂\n(1)\nZ11 ,\n∂αs\n\nγ2 = 2αs\n\n∂\n(1)\nZ12 ,\n∂αs\n\n(38)\n\nwhere Z (1) is the coefficient of the 1/ǫ pole in Z. Then, at one-loop order, the corresponding\nanomalous dimension matrix determining the running of the currents Ji reads\n!\nγ1\nγ2\n.\n(39)\nγ 1−loop =\n0 γ1 + 2γ2\nAt higher order, the O(ǫ) terms arising from the Dirac algebra have a non-trivial effect on the\nanomalous dimensions, as discussed in [22].\nIn terms of these functions, the anomalous dimension of the scalar current is (from now\non all results refer to the one-loop approximation)\nγSB = γ1 + 2γ2 .\nFor the vector current, we find the 4 × 4 anomalous-dimension matrix\n\n\nγ1 + 2γ2\n0\n0\n0\n\n\n\n0\nγ1 + 2γ2\n0\n0\nB\n.\n\nγV = \n\n0\n0\n0\nγ\n+\n2γ\n1\n2\n\n\nγ2\n0\n−γ2 γ1\n\n(40)\n\n(41)\n\nThe operators JVB1,2,3 are multiplicatively renormalized with anomalous dimension γ1 + 2γ2 ,\nwhereas the operator JVB4 mixes with JVB1 and JVB3 . For the form factor analysis, it will be\nconvenient to work with the linear combinations\n′\n\nμ\nJVB1μ = JVB1μ − JVB3μ = X̄(sn̄) A\n/ ⊥ (rn̄) γ⊥\nh(0) ,\n\n13\n\n\f′\n\nJVB2μ = JVB2μ = X̄(sn̄) A\n/ ⊥ (rn̄) v μ h(0) ,\n′\nJVB3μ\n\n=\n\nJVB3μ\n\n′\n\nnμ\n= X̄(sn̄) A\n/ ⊥ (rn̄)\nh(0) ,\nn*v\n\nμ\nJVB4μ = 2JVB4μ − JVB1μ + JVB3μ = X̄(sn̄) γ⊥\nA\n/ ⊥ (rn̄) h(0) ,\n\n(42)\n\n′\n\n′\n\nwhich are multiplicatively renormalized. JVB1,2,3 have anomalous dimension γ1 + 2γ2 , while JVB4\nhas anomalous dimension γ1 . The corresponding combinations of Wilson coefficients, which are\nmultiplicatively renormalized with the same anomalous dimensions as the respective currents\n′\nJjB , read\n1\n′\n′\n′\nCVB2 = CVB2 ,\nCVB3 = CVB3 + CVB1 ,\nCVB1 = CVB1 + CVB4 ,\n2\n1\n′\nCVB4 = CVB4 .\n(43)\n2\nSimilarly, for the tensor current we find that the operators JTB1,2,3,4 are multiplicatively renormalized with anomalous dimension γ1 + 2γ2 , whereas the operators JTB5,6,7 mix with JTB1,2,3,4 .\nAs in the vector case, it will be convenient to change the operator basis, defining\n′\n\n[μ ν]\n\nJTB1μν = JTB1μν + 2JTB3μν − 2JTB4μν = X̄(sn̄) A\n/ ⊥ (rn̄) γ⊥ γ⊥ h(0) ,\n′\n\nν]\n\nJTB2μν = JTB2μν + JTB4μν = X̄(sn̄) A\n/ ⊥ (rn̄) v [μ γ⊥ h(0) ,\nν]\n\n′\n\nJTB3μν = JTB3μν = X̄(sn̄) A\n/ ⊥ (rn̄)\n′\n\nJTB4μν = JTB4μν = X̄(sn̄) A\n/ ⊥ (rn̄)\n′\n\nn[μ γ⊥\nh(0) ,\nn*v\nn[μ v ν]\nh(0) ,\nn*v\n\n[α\n\nν]\n\nμ\nJTB5μν = −2JTB5μν + JTB1μν + 2JTB3μν − 2JTB4μν + 2JTB7μν = X̄(sn̄) A⊥α (rn̄) γ⊥ γ⊥\nγ⊥ h(0) ,\n′\n\nν]\n\nJTB6μν = −2JTB6μν − JTB2μν − JTB4μν = X̄(sn̄) v [μγ⊥ A\n/ ⊥ (rn̄) h(0) ,\n′\nJTB7μν\n\nν]\n\n=\n\n−2JTB7μν\n\n−\n\nJTB3μν\n\nn[μ γ⊥\nA\n/ ⊥ (rn̄) h(0) .\n= X̄(sn̄)\nn*v\n\n(44)\n\n′\n\nThese operators are multiplicatively renormalized, JTB1,2,3,4 with anomalous dimension γ1 +\n′\n2γ2 , and JTB5,6,7 with anomalous dimension γ1 . The corresponding combinations of Wilson\ncoefficients are\n1\n1\n1\n1\n′\n′\n′\nCTB1 = CTB1 + CTB5 ,\nCTB2 = CTB2 − CTB6 ,\nCTB3 = CTB3 − 2CTB1 − CTB5 − CTB7 ,\n2\n2\n2\n2\n′\n\n1\n′\nCTB5 = − CTB5 ,\n2\n\nCTB4 = CTB4 + 2CTB1 − CTB2 ,\n\n1\n′\nCTB6 = − CTB6 ,\n2\n\n1\n1\n′\nCTB7 = − CTB7 − CTB5 .\n2\n2\n\n(45)\n′\n\nNote that the tree-level matrix elements of the \"evanescent\" operator JTB5 vanish in d = 4\ndimensions, and after additional finite renormalizations the same is true once loop corrections\n14\n\n\fFigure 3: SCETI graphs contributing to the anomalous dimensions of the subleading heavycollinear currents JjB , represented by a crossed circle. Full lines denote soft fields, dashed lines\nhard-collinear fields.\nare included. This operator will not be relevant for our leading-order analysis, but it would\nenter a next-to-leading order calculation employing dimensional regularization. We will mention evanescent operators again in Section 6, when we discuss the basis of SCETII four-quark\noperators relevant to the hard-scattering contributions.\nTo calculate the one-loop anomalous dimensions, we evaluate the UV poles of the diagrams\nshown in Figure 3 in dimensional regularization, treating the external gluon as a background\nfield. The resulting expressions for the integral operators γ1 and γ2 can be written as\nγ1 (u, v) = u V1(u, v) + δ(u − v) W (E, u) ,\n2γ2 (u, v) = u V2(u, v) ,\n\n(46)\n\nwhere\n\u0012\n\n\u0013\n\u0012\n\u0013\nC A αs\nθ(1 − u − v)\nV1 (u, v) = CF −\n−\n2\nπ\nūv̄\n\u001a \u0014\n\u0015\n\u001b\nθ(v − u)\nθ(v − u) θ(u − v)\nθ(u − v)\nC A αs 1\nu\n−\n,\n+v\n−\n−\n2 π uv\n(v − u)\n(u − v) +\nvū\nuv̄\n\u0012\n\u0013\n\u0014\u0012\n\u0013\n\u0015\nC A αs\n1 1\nūv̄\n1+ +\nθ(1 − u − v) +\nV2 (u, v) = CF −\nθ(u + v − 1)\n2\nπ\nū v̄\nuv\n\u0014 \u0012\n\u0013\n\u0012\n\u0013\n\u0015\nCA αs ū\n1\nv̄\n1\n−\n1+\nθ(u − v) +\n1+\nθ(v − u) ,\n2 π u\nv̄\nv\nū\n\u0012\n\u0013\n\u0011\nμ\n5\nC A αs \u0010 u\nαs\n− ln\nln − 1 .\n− + ln u −\nW (E, u) = CF\nπ\n2E 4\n2 π\nū\n\n(47)\n\nFor symmetric functions g(u, v) the plus distribution is defined to act on test functions f (v)\nas\nZ\nZ\n\u0002\n\u0003\ndv [g(u, v)]+ f (v) = dv g(u, v) f (v) − f (u) .\n(48)\n15\n\n\fIt is remarkable that the functions Vi (u, v) are symmetric in their arguments. This fact is not\naccidental, but can be traced back to a residual conformal symmetry in the effective theory\nwhen interactions with the soft heavy quark are ignored. Also, since soft gluons are unable\nto change the large component of hard-collinear momenta, the one-loop conformal-symmetry\nbreaking term δ(u − v)W (E, u) is local with respect to u. Details of the conformal-symmetry\narguments will be presented in Section 5.3.\n′\nFrom (33), it follows that the evolution equation for the current eigenvectors JjB takes the\nform\nZ 1\nd\n′\n′\nB′\nJj (u) = −\ndv u VΓ (u, v) JjB (v) − W (E, u) JjB (u) ,\n(49)\nd ln μ\n0\n\nwhere VΓ is a linear combination of V1 and V2 determined by the anomalous dimension of the\n′\noperator JjB . For reasons that will become clear later, we use the notation Γ = k, ⊥ and denote\nVk = V1 + V2 for operators with anomalous dimension γ1 + 2γ2 , and V⊥ = V1 for operators\n′\nwith anomalous dimension γ1 . The corresponding equation for the eigenvectors CjB of Wilson\ncoefficients reads\nZ 1\nd\n′\n′\nB′\nCj (E, v) =\ndu u VΓ(u, v) CjB (E, u) + W (E, v) CjB (E, v) .\n(50)\nd ln μ\n0\nTo gain more insight into the structure of the conformal-symmetry breaking term W (E, u),\nwe may consider the field redefinitions [2, 15]\n(0)\n\n(0)μ\n\nAμhc (x) = Sn (x− ) Ahc (x) Sn† (x− ) ,\n\nh(x) = Sv (x) h(0) (x) ,\n(51)\nwhich decouple soft gluons from the leading-order hard-collinear and heavy-quark Lagrangians.\nHere Sn and Sv are soft Wilson lines in the n and v directions, respectively. From (7), it follows\nthat in terms of the new fields the B-type operators take the form\n\u0002\n\u0003\n(0)\nJjB (s, r) = X̄(0) (sn̄) A⊥μ (rn̄) Γμ⊥ Sn† Sv (0) h(0) (0) .\n(52)\nξhc (x) = Sn (x− ) ξhc (x) ,\n\nThe combination [Sn† Sv ](0) represents a closed loop with a cusp at x = 0 formed by two\nWilson lines in the v and n directions. The anomalous dimension of this object is given by\nthe universal cusp anomalous dimension times a logarithm of the soft scale [21]. After adding\na contribution from the hard-collinear sector necessary to eliminate the dependence on the\ninfra-red regulator (−p2hc ) (c.f. [15, 23],), the result is\n\u0014\n\u0015\n2v * phc μ\n(−p2hc )\n2v * phc\nΓcusp ln\n+ ln\n= Γcusp ln\n,\n(53)\n2\n2\n(−phc )\nμ\nμ\nwith phc a hard-collinear momentum. From these considerations, we conclude that to all orders\nin perturbation theory\nW (E, u) = −Γcusp (αs ) ln\n\nμ\n+ w(u, αs ),\n2E\n\nwith the one-loop expression for w determined from (47).\n16\n\n(54)\n\n\f5\n\nRenormalization-group evolution in SCETI\n\nThe anomalous dimensions obtained in the previous section allow us to solve the RG evolution\nequations (49) and (50) at leading order in RG-improved perturbation theory. At this order the\nleading double and single logarithmic contributions are resummed to all orders in perturbation\ntheory. Technically, this means that one must compute the matching coefficients at tree level,\nthe anomalous dimension kernels Vi (u, v) at one-loop order, and the cusp anomalous dimension\nentering the function W (E, u) at two-loop order. In practice, one wants to impose matching\n′\nconditions for the coefficient functions CjB at a high scale μh ∼ 2E and then evolve the\np\nresult down to an intermediate scale μi ∼ 2EΛQCD , at which SCETI is matched onto the\nlow-energy effective theory SCETII . While the integro-differential evolution equations can be\nsolved numerically, we find it instructive to also discuss a formal analytic solution to these\nequations.\n\n5.1\n\nEigenfunctions and eigenvalues of the evolution operator\n\nIt will be convenient to rewrite (49) and (50) in the somewhat obscure form\n′\n′\n′\nZ 1\nJ B (v)\nJjB (u)\nd JjB (u)\n2 VΓ (u, v) j\n=−\n− W (E, u)\n,\ndv vv̄\nd ln μ uū\nūv̄\nvv̄\nuū\n0\n′\n′\n′\nZ 1\nCjB (E, v)\nCjB (E, u)\nd CjB (E, u)\n2 VΓ (v, u)\n=\n+ W (E, u)\n.\ndv vv̄\nd ln μ\nū\nūv̄\nv̄\nū\n0\n\n(55)\n\nBecause of the symmetry property Vi (u, v) = Vi (v, u), it follows that the operator eigen′\n′\nfunctions [JnB (u)/uū] have the same form as the coefficient eigenfunctions [CnB (u)/ū], but\ncome with eigenvalues of the opposite sign. We consider first the hypothetical case where\nW (E, u) = 0 and focus on the non-diagonal terms in the evolution kernels, Vi (u, v) with\ni = 1, 2. We will show that the general solution to the eigenvalue equation\nZ 1\nVi (u, v)\ndu uū2\nψn (u) = λi,n ψn (v)\n(56)\nūv̄\n0\nis given by\nψn (u) =\n\nr\n\n2(n + 2)(n + 3) (2,1)\nPn (2u − 1) ,\nn+1\n\n(57)\n\n(2,1)\n\nwhere Pn are Jacobi (hyper-geometric) polynomials, and the eigenfunctions ψn are normalized according to\nZ\n1\n\nhψn |ψm i ≡\n\ndu uū2 ψn (u) ψm (u) = δnm .\n\n0\n\nThe eigenvalues for the kernels V1 and V2 may be expressed in the closed form\n\u0013\n\u0012\n\u0013\n\u0012\n1\nCA αs (−1)n+1 CA αs\n1 − 2Hn+1 −\n,\n−\nλ1,n = CF −\n2\nπ n+2\n2 π\nn+2\n17\n\n(58)\n\n\f\u0013\n\u0012\nC A αs\n2\nCA αs (−1)n (n2 + 4n + 5)\n−\n,\n(59)\nλ2,n = CF −\n2\nπ (n + 1)(n + 2)(n + 3)\n2 π (n + 1)(n + 3)\nPn\nwhere Hn =\nm=1 1/m are the harmonic numbers. Using the solution to the eigenvalue\nequation for Vi , we then present a formal algebraic solution to the evolution equation for the\nSCETI coefficient functions.\nLet us now prove the statements just made. We proceed along lines similar to the diagonalization of the evolution kernel for the pion LCDA, as analyzed in [24] (see in particular\nAppendix D). From the eigenvalue equation (56) and the symmetry of Vi (u, v) it follows that\neigenfunctions belonging to different eigenvalues must be orthogonal in the measure uū2 du on\nthe interval 0 ≤ u ≤ 1, as shown in (58). To show that the eigenfunctions take the form (57),\nwe consider the integrals\nZ 1\nVi (u, v)\nIi,n (v) =\n(2u − 1)n .\n(60)\ndu uū2\nūv̄\n0\nWe will show below that Ii,n (v) is a polynomial in (2v − 1) of degree n. Hence, in operator\nnotation, with hu|ni ≡ (2u − 1)n and hu|Vi |ni ≡ Ii,n (u), we have\nVi |ni =\n\nn\nX\n\n(Vi )mn |mi\n\n(61)\n\nm=0\n\nwith (Vi )mn = 0 for m > n. In particular, |0i is an eigenfunction with eigenvalue (Vi )00 . By\ninduction, for each n ≥ 1 there is a corresponding eigenvalue given by the diagonal matrix\nelement (Vi )nn with eigenfunction proportional to the linear combination of |0i, . . . , |ni that\nis orthogonal to each of |0i, . . . , |n − 1i. The result (57) follows since the Jacobi polynomials\n(2,1)\nPn (2u − 1) form the unique extension of the constant function to a basis of orthogonal\npolynomials with measure uū2 du on the unit interval. As a byproduct of this analysis, the\ncoefficient of (2v − 1)n in the expansion of Ii,n (v) is identified with the n-th eigenvalue λi,n .\nTo evaluate Ii,n , it is convenient to introduce new variables x = 2u − 1 and y = 2v − 1.\nThe resulting integrals yield\n\u0012\n\u0013\nn\nX\nC A αs\nm+1\nI1,n = CF −\n(−1)n+1\nym\n2\nπ\n(n\n+\n1)(n\n+\n2)\nm=0\n\"\n#\nn−1\nn\nn−m\nX\nX\nC A αs\n[1 + (−1)\n] (m + 1) m\nm+1\n−\n(1 − 2Hn+1 ) y n +\ny −\nym ,\n2 π\n(n − m)(n + 1)\n(n + 1)(n + 2)\nm=0\nm=0\nI2,n\n\n\u0013\n\u0012\nn\nX\n\u0002\n\u0003\n(−1)n\nC A αs\n(−1)n−m + 9 + 4(n + m) + 2nm y m\n= CF −\n2\nπ 2(n + 1)(n + 2)(n + 3) m=0\n−\n\nn\nX\n\u0002\n\u0003\nC A αs\n1\n(5 + 2n)(−1)n−m + 3 + 2m y m .\n2 π 2(n + 1)(n + 2)(n + 3) m=0\n\n(62)\n\nInspection of these results shows that the coefficient of y m in Ii,n indeed vanishes for m > n,\nwhile the coefficient of y n gives the eigenvalues (59).\n18\n\n\f5.2\n\nSolution to the evolution equation\n\nDue to the presence of the conformal-symmetry breaking term W (E, u), the eigenfunctions\nof the full anomalous-dimension operators γ1 + 2γ2 and γ1 cannot be written in closed form.\nWe will now show how a formal algebraic solution can be obtained. We begin by isolating\nthe strong μ dependence of the coefficient functions due to Γcusp , writing the solution to the\nevolution equation (55) as\n′\nCjB (E, u, μ)\n\n=\n\n\u0012\n\n2E\nμh\n\n\u0013a(μh ,μ)\n\nwhere\nS(μ1, μ2 ) = −\n\nZ\n\nS(μh ,μ)\n\ne\n\nZ\n\n0\n\nαs (μ2 )\n\n1\n\n′\n\ndv UΓ (u, v, μh, μ) CjB (E, v, μh ) ,\n\ndα\nΓcusp (α)\nβ(α)\n\nαs (μ1 )\n\nZ\n\nα\n\nαs (μ1 )\n\ndα′\n,\nβ(α′)\n\n(63)\n\n(64)\n\nwith β(αs ) ≡ dαs /d ln μ, is a universal Sudakov factor, and\na(μ1 , μ2 ) =\n\nZ\n\nαs (μ2 )\n\nαs (μ1 )\n\ndα\nΓcusp (α) .\nβ(α)\n\n(65)\n\nNote that S(μ1 , μ2 ) is negative, since Γcusp (αs ) ≥ 0 [25]. At leading order in RG-improved\nperturbation theory one finds [20]\n\u0014\n\u0012\n\u0013\n\u0015\n\u0013\n\u0012\n1\n4π\nβ1\nΓ1 β1\nΓ0\n2\n1 − − ln r1 +\n(r1 − 1 − ln r1 ) ,\nln r1 −\n−\nS(μh , μ) =\n4β02 αs (μh )\nr1\n2β0\nΓ0 β0\na(μh , μ) = −\n\nΓ0\nln r1 ,\n2β0\n\n(66)\n\nwhere r1 = αs (μ)/αs (μh ) ≥ 1. The relevant RG coefficients arising in the perturbative expansion of the cusp anomalous dimension and the β function,\nβ(αs ) = −2αs\n\n∞\nX\n\nβn\n\nn=0\n\n\u0010 α \u0011n+1\ns\n\n4π\n\n,\n\nΓcusp (αs ) =\n\n∞\nX\nn=0\n\nΓn\n\n\u0010 α \u0011n+1\ns\n\n4π\n\n,\n\n(67)\n\n2\n\nare Γ0 = 4CF , Γ1 = 4CF [( 67\n− π3 ) CA − 20\nTF nf ], and β0 = 11\nCA − 43 TF nf , β1 = 34\nCA2 −\n9\n9\n3\n3\n20\nCA TF nf − 4CF TF nf . We take nf = 4 as the number of light quark flavors, even at low\n3\nrenormalization scales.\nThe remaining evolution is governed by a function UΓ (u, v, μh, μ) with initial condition\nUΓ (u, v, μh, μh ) = δ(u − v) at the high-energy matching scale μ = μh . From (55) we find the\ncorresponding RG equation\nZ 1\nUΓ (u, v, μh, μ)\nVΓ (y, u) UΓ (y, v, μh, μ)\nd UΓ (u, v, μh , μ)\n=\n+ w(u)\n,\n(68)\ndy y ȳ 2\nd ln μ\nū\nȳū\nȳ\nū\n0\nwhere w(u) is defined via (54). As before, the subscript Γ = k, ⊥ serves as a reminder that we\nmust distinguish two cases of evolution functions corresponding to the different eigenvalues of\n19\n\n\fthe anomalous-dimension matrices. A formal solution of this equation may be constructed by\nexpanding UΓ (u, v, μh, μ) on the basis of eigenfunctions ψn (u),\nUΓ (u, v, μh, μ) X\n=\nψn (u) un (v, μh , μ) ,\nū\nn\nwhere\nun (v, μh, μ) =\n\nZ\n\n1\n\ndu uū2 ψn (u)\n\n0\n\n(69)\n\nUΓ (u, v, μh, μ)\nū\n\n(70)\n\nfollows from (58). Inserting this expansion into the evolution equation, and projecting out the\ncoefficients un , we obtain\nX\nd\num (v, μh , μ) = λΓ,m um (v, μh , μ) +\nwmn un (v, μh , μ) ,\nd ln μ\nn\n\n(71)\n\nwhere λΓ,n = λ1,n + λ2,n or λΓ,n = λ1,n depending on the anomalous-dimension eigenvalue, and\nthe quantities wmn are given by the overlap integrals\nZ 1\nwmn =\ndv vv̄ 2 ψm (v) w(v) ψn (v) .\n(72)\n0\n\nCollecting the elements wmn into an infinite-dimensional matrix w, and the eigenvalues λΓ,n\ninto the diagonal matrix λΓ , we can write the formal solution to (71) in the form\n!#\n\"\nZ αs (μ)\nX\n\u0003\ndα \u0002\n,\n(73)\nλΓ (α) + w(α)\num (v, μh, μ) =\nvv̄ ψn (v) P exp\nβ(α)\nα\n(μ\n)\ns\nh\nn\nmn\n\nwhere the initial condition at the matching scale μ = μh follows from (70).2 The symbol \"P\"\ndenotes coupling-constant ordering, with λΓ (α) + w(α) appearing to the left of λΓ (α′ ) + w(α′ )\nwhen α > α′ . Combining this result with (69) provides a complete solution for the evolution\nfunction.\nFor a leading-order solution, we may expand the anomalous dimensions and β function to\none-loop order, defining as usual\nλi,n (αs ) =\n\nαs (0)\nλ + ... ,\n4π i,n\n\nw(αs ) =\n\nαs (0)\nw + ... .\n4π\n\nThen the ordered exponential in (73) may be written as\n!\n\u0014\n\u0015\nZ αs (μ)\n(0)\n\u0003\ndα \u0002\n(λΓ + w (0) )diag\nP exp\nλΓ (α) + w(α) = U exp −\nln r1 U −1 ,\nβ(α)\n2β\n0\nαs (μh )\n2\n\n′\n\n(74)\n\n(75)\n\nThe expansion of CjB (u)/ū on the truncated basis of eigenfunctions {ψn (u), 0 ≤ n ≤ N } converges in the\nR1\n′\nlimit N → ∞, with the norm (58), provided that 0 du uū2 |C B (u)/ū|2 < ∞. Since it is only the convolution\n′\nover the product of CjB with the jet functions and meson LCDAs which appears in the final expression for the\nform factors, cf. (143) and (147), this condition is more restrictive than necessary on the endpoint behavior of\nthe coefficient functions, and this \"norm\" sense of convergence is stronger than we require.\n\n20\n\n\f1.1\n\n1\n\n1\n\nUΓ\n\nUΓ\n\n1.1\n\n0.9\n\n0.8\n\ng replacements\n\n0.9\n\n0.8\n\nPSfrag replacements\n\n0.7\n0\n\n0.2\n\n0.4\n\nu\n\n0.6\n\n0.8\n\n1\n\n0.7\n0\n\n0.2\n\n0.4\n\nu\n\n0.6\n\n0.8\n\n1\n\nFigure 4: Functions UΓ (u, μh , μ) in (77) for μh = 4.8 GeV and μ = 1.55 GeV. The curves\ncorrespond to RG evolution with γ1 + 2γ2 (dotted) and γ1 (dashed). The left and right plots\nshow results derived by using 20 and 40 basis functions ψn , respectively. The solid lines were\nobtained by numerical integration of the evolution equation.\n(0)\n\n(0)\n\n(0)\n\nwhere U is the unitary matrix that diagonalizes λΓ + w(0) , i.e. λΓ + w (0) = U (λΓ +\n(0)\nw (0) )diag U −1 . Since λΓ + w (0) is a real symmetric matrix it can be diagonalized with\n(0)\nreal eigenvalues, which we collect in the diagonal matrix (λΓ + w (0) )diag . Finally, we can\nsimplify the answer further by using that at tree level the initial conditions for the Wilson coefficients at the matching scale μ = μh collected in (26)–(28) are independent of u:\n′\n′\nCjB (E, u, μh ) ≡ CjB (E, μh ). We then obtain the final result (valid at leading order in RGimproved perturbation theory)\n′\nCjB (E, u, μ)\n\n=\n\n\u0012\n\n2E\nμh\n\n\u0013a(μh ,μ)\n\n′\n\neS(μh ,μ) UΓ (u, μh , μ) CjB (E, μh ) ,\n\n(76)\n\nwhere\nUΓ (u, μh, μ) ≡\n=\n\nX\nm,n\n\nZ\n\n1\n\ndv UΓ (u, v, μh, μ)\n\n(77)\n\n0\n\nū ψm (u)\n\ns\n\n2\n(n + 1)(n + 2)(n + 3)\n\n\"\n\n!\n#\n(0)\n(λΓ + w (0) )diag\nU exp −\nln r1 U −1\n2β0\n(0)\n\n.\nmn\n\nIn practice we will truncate the basis of eigenfunctions, so that λΓ + w (0) becomes a finitedimensional matrix, which can be diagonalized without much difficulty.\nFigure 4 illustrates the effects of RG evolution. We show numerical results for the two\nevolution functions UΓ (u, μh, μ) corresponding to the cases with anomalous dimensions γ1 +2γ2\n(dotted curves)√and γ1 (dashed curves). The plots are obtained with μh = 2E = mb = 4.8 GeV\nand μ = μi = 2EΛh = 1.55 GeV, where Λh ≈ 0.5 GeV serves as a typical hadronic scale. In\naddition to the solution obtained with 20 and 40 basis functions, the figure also shows results\nderived from a numerical integration of the evolution equation (solid lines). For the numerical\nsolution, the evolution to a lower scale is performed in discrete steps of ∆ ln μ = 0.02. To\n21\n\n\fcalculate the change in UΓ (u, μh , μn ) in the evolution step from μn to μn+1 , the convolution\nintegral with the evolution kernel is evaluated for one hundred different u values, and the\nfunction UΓ (u, μh , μn+1) is obtained from a fit to these values. The results from the two\ndifferent methods agree nicely: the curves obtained with a finite number of basis polynomials\noscillate about the numerical results, the number of turning points being equal to the order\nof the highest basis polynomial. The amplitude of the oscillations decreases once more basis\npolynomials are included. To obtain the Wilson coefficients at the low scale, these results\nmust still be multiplied with the universal Sudakov factor (2E/μh )a(μh ,μ) eS(μh ,μ) ≈ 0.89 (for\nour choice of parameters). We observe that the additional, u-dependent resummation effects\ndescribed by the functions UΓ (u, μh , μ) are very small for the coefficients with anomalous\ndimension γ1 + 2γ2 , whereas they are more sizeable for those with anomalous dimension γ1 ,\nreaching about −20% for the smallest values of u.\nTo summarize our results, we compile the Wilson coefficients for the B-type current operators obtained at leading order in RG-improved perturbation theory. We introduce the\nshort-hand notation CΓ (E, u, μ) = (2E/μh )a(μh ,μ) eS(μh ,μ) UΓ (u, μh , μ), where Γ = k or Γ = ⊥\ndepending on whether the anomalous dimension is γ1 +2γ2 or γ1 , respectively. We will see later\nthat these two cases are in one-to-one correspondence with the nature of the light final-state\nmeson in B → P, V transitions. The case Γ = k applies for transitions into a pseudoscalar or\nlongitudinally polarized vector meson (P or Vk ), while the case Γ = ⊥ applies for transitions\ninto a transversely polarized vector meson (V⊥ ). Our results are given as follows.\nScalar current:\nCSB (μ) = −Ck (E, u, μ) .\n\n(78)\n\nVector current:\nCVB2 (μ) = −2Ck (E, u, μ) ,\n\nCVB1 (μ) = Ck (E, u, μ) ,\nCVB3 (μ) = −\n\n2E\nCk (E, u, μ) ,\nmb\n\nCVB4 (μ) = 0 .\n\n(79)\n\nTensor current:\nCTB1 (μ) = −Ck (E, u, μ) ,\nCTB3 (μ) = −\n\n4E\nC⊥ (E, u, μ) ,\nmb\n\nCTB2 (μ) = −4Ck (E, u, μ) ,\nCTB7 (μ) = −\n\nCTB4,5,6 (μ) = 0 ,\n\n8E\nC⊥ (E, u, μ) .\nmb\n\n(80)\n\nThe corresponding Wilson coefficients in the primed basis follow from (43) and (45). At\n′\n′\nleading order, the results for the primed coefficients CVB1,2,4 and CTB1,2,5,6 are given by the same\n′\n′\nexpressions as in the original basis, i.e. CjB = CjB , while CVB3 (μ) = (1 − 2E/mb ) Ck (E, u, μ),\n′\n′\n′\nand CTB3 (μ) = CTB4 (μ) = 2Ck (E, u, μ), CTB7 (μ) = (4E/mb ) C⊥ (E, u, μ).\nFigure 5 illustrates our results for the scalar current. While one should use tree-level\nmatching combined with one-loop running for a consistent treatment at leading order in RGimproved perturbation theory, the figure also shows results obtained by including the oneloop matching corrections presented in (30). We solve the evolution equation (50) by direct\n22\n\n\f-0.8\n-0.9\n\nCSB\n\n-1\n-1.1\n-1.2\n\nPSfrag replacements\n\n-1.3\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n\nu\nFigure 5: Results for the Wilson coefficient CSB (E, u, μi ) at E = mb /2. The dashed lines\nrepresent the tree-level (gray) and one-loop (black) coefficients at the high scale μh = 4.8 GeV.\nThe solid lines are obtained after evolving both coefficients with the leading-order anomalous\ndimension down to the intermediate scale μi = 1.55 GeV.\nnumerical integration, expanding the cusp anomalous dimension entering W (E, u) to two-loop\norder, but using one-loop expressions √\nfor Vi (u, v) and the remaining terms in W (E, u). We\nagain take μh = 2E = mb and μi = 2EΛh (with Λh = 0.5 GeV). The dashed curves give\nthe one-loop matching results at the high scale μh , while the solid lines show the result of\nRG evolution to the intermediate scale μi . Comparing the black and gray curves, we observe\nthat the one-loop matching corrections are of the same order of magnitude as the effects of\nRG evolution. This fact provides motivation for an extension of our anomalous-dimension\ncalculation to the two-loop order, which would be necessary for a systematic treatment at\nnext-to-leading order in RG-improved perturbation theory.\nFor completeness, we briefly discuss also the solution to the RG equation for the coefficients\nof the A-type currents, given in the first line in (34). The solution is\nCiA (E, μ)\n\n=\n\n\u0012\n\n2E\nμh\n\n\u0013a(μh ,μ)\n\n\u0014\n\nexp S(μh , μ) +\n\nZ\n\nαs (μ)\n\nαs (μh )\n\n\u0015\ndα\nγ̃(α) CiA (E, μh ) ,\nβ(α)\n\n(81)\n\nwith S(μh , μ) and a(μh , μ) as defined in (64) and (65). At leading order in RG-improved\nperturbation theory we may use the expansions (66) together with\nZ\n\nαs (μ)\n\nαs (μh )\n\nγ̃0\ndα\nγ̃(α) = −\nln r1 ,\nβ(α)\n2β0\n\n(82)\n\nwhere γ̃(αs ) is expanded similarly to (67), and γ̃0 = −5CF . As an illustration of the size\nof one-loop matching corrections, we may consider again the scalar case, where at tree level\nCSA = 1. At leading order in RG-improved\nperturbation theory, with tree-level matching, we\n√\nA\nfind CS (E, μi ) ≈ 1.097 at μi = 2EΛh and E = mb /2. From (29), the coefficient at the high\nscale μh = 2E = mb including one-loop corrections is CSA (E, μh ) ≈ 0.934. Leading-order RG\nevolution to the intermediate scale then yields CSA (E, μi ) ≈ 1.025.\n23\n\n\f5.3\n\nConstraints from conformal symmetry\n\nThe conformal invariance of QCD at the classical level can be used to simplify the solutions\nto the evolution equations for the hard-scattering kernels and light-meson LCDAs. As a\nconsequence of this approximate symmetry, the evolution equations become diagonal at leading\norder once they are written in a basis of eigenfunctions of definite conformal spin. In the case of\n3/2\nthe pion LCDA, these basis functions are the Gegenbauer polynomials Cn [24]. For the heavylight current the situation is more complicated: the conformal symmetry is not only violated\nby quantum effects, but broken explicitly by the presence of the heavy quark. Interactions with\nthe soft sector of the effective theory destroy the conformal invariance of the hard-collinear\nsector. However, since the soft interactions do not change the large momentum fractions of\nthe hard-collinear particles, the breaking of the symmetry can only occur in the local part of\nthe anomalous dimensions, i.e., in the term δ(u − v) W (E, u) in (46). We focus here on the\nhard-collinear sector of the effective theory, showing in particular that the eigenfunctions of\nthe non-local terms Vi (u, v) in (46) must take the form (57). For the remainder of this section\nwe will refer to hard-collinear modes simply as \"collinear\".\nBefore discussing the properties of heavy-light currents in more detail, we briefly recall some\naspects of conformal symmetry [26]. The full conformal algebra consists of the generators P μ ,\nJ μν of translations and Lorentz transformations, augmented by the generators D of scale\ntransformations, xμ → λxμ , and K μ of special conformal transformations,\nxμ →\n\nxμ + aμ x2\n.\n1 + 2a * x + a2 x2\n\n(83)\n\nThe action of the generators on a field of scaling dimension l and arbitrary spin is\ni[P μ , Φ(x)] = ∂μ Φ(x) ,\n\ni[J μν , Φ(x)] = (xμ ∂ν − xν ∂μ − Σμν ) Φ(x) ,\n\ni[D, Φ(x)] = (x * ∂ + l) Φ(x) ,\n\n(84)\n\u0001\n\ni[K μ , Φ(x)] = 2xμ x * ∂ − x2 ∂μ + 2lxμ − 2xν Σμν Φ(x) .\n\nThe spin operator Σμν on scalar, fermion, and vector fields is given by\n\ni\nΣμν Aα = gνα Aμ − gμα Aν .\n(85)\nΣμν ψ = σμν ψ ,\n2\nThe collinear part of the SCET operators is given by products of fields smeared along the light\nray xμ = rn̄μ , i.e. Φ(x) = Φ(rn̄) ≡ Φ(r). The SL(2, R) subgroup that maps this light-ray onto\nitself is called the collinear conformal group. It is obtained from the four generators n̄ * P ,\nn * K, nμ n̄ν J μν , and D. To classify operators under this group, it is convenient to work with\nthe linear combinations\ni\nL+1 = −i n̄ * P ,\nL−1 = n * K ,\n4\ni\n1\ni\n1\nL0 = (D + nμ n̄ν J μν ) ,\nE = (D − nμ n̄ν J μν ) .\n(86)\n2\n2\n2\n2\nThe generator E counts the twist t and commutes with the remaining three generators, which\nfulfill the angular-momentum commutation relations\nΣμν φ = 0 ,\n\n[L+1 , L−1 ] = 2L0 ,\n\n[L0 , L±1 ] = ±L±1 .\n24\n\n(87)\n\n\fThe action of these operators on the fields Φ(r) is\n[L+1 , Φ(r)] = −∂r Φ(r) ,\n\n[L−1 , Φ(r)] = (r 2 ∂r + 2jr) Φ(r) ,\n[L0 , Φ(r)] = (r ∂r + j) Φ(r) ,\n\n(88)\n\nwhere the quantum number j is referred to as conformal spin. The twist t and the conformal\nspin j of a field Φ are related to the scaling dimension l and the spin projection s through the\nrelations t = l − s and j = 12 (l + s), where s is defined by\n1\nΣ̂ Φ ≡ n̄μ nν Σμν Φ = s Φ .\n2\n\n(89)\n\nTo express the SCET fields in terms of (primary) conformal fields of definite spin and twist,\nwe introduce the field-strength tensor\ngGμν = W † gGμν W = i[Dμ , Dν ] ,\n\n(90)\n\nwhere Dμ = ∂μ − iAμ . In particular,\nβμ\nμ\nn̄ * ∂ Aμ⊥ = n̄α g⊥\ngGαβ ≡ gGn̄⊥\n,\n\nn̄ * ∂ n * A = n̄α nβ gGαβ ≡ gGn̄n .\n\n(91)\n\nThen for the collinear SCET fields at the origin, we find for the twist and conformal spin\neigenvalues\n[E, X(0)] = X(0) ,\n\n[L0 , X(0)] = X(0) ,\n3 μ\nG (0) ,\n2 n̄⊥\n\nμ\nμ\n[E, Gn̄⊥\n(0)] = Gn̄⊥\n(0) ,\n\nμ\n[L0 , Gn̄⊥\n(0)] =\n\n[E, Gn̄n (0)] = 2 Gn̄n (0) ,\n\n[L0 , Gn̄n (0)] = Gn̄n (0) .\n\n(92)\n\nIn the following, we want to decompose a given operator into components with definite\nconformal spin. The construction of the corresponding basis is done in two steps. First,\none identifies the operator of minimal conformal spin O0 , i.e., the operator at the bottom of\nan irreducible conformal tower, defined by [L−1 , O0 ] = 0. The complete basis of conformal\noperators is then given by repeated application of the raising operator L+1 to the highestweight operator O0 : 3\nOk = [L+1 , [L+1 , [. . . , [L+1 , O0 ] . . . ]]] .\n{z\n}\n|\nk times\n\n(93)\n\nA trivial example of this procedure is the expansion of X(r) into operators with definite\nconformal spin. In this case the highest-weight operator is O0 = X(0), and the raising operator\nL+1 acts as a derivative with respect to r. The expansion of X(r) in conformal spin thus\n3\n\nIt is standard terminology to refer to the operator of minimal conformal spin as the highest-weight operator.\n\n25\n\n\fcoincides with the Taylor expansion about r = 0. In order to analyze the SCET currents\nJ B , we now consider the decomposition of the product of two fields, which we assume have\nindividual conformal spins j1 and j2 , into operators of definite conformal spin. We first rewrite\neach of the two component fields Φj1 (r1 ) and Φj2 (r2 ) in the conformal spin basis. In other\nwords, we expand the product in a Taylor series about r1 = r2 = 0. At the n-th order, this\nleaves us with operators of the form\n∂rn11 ∂rn22 Φj1 (r1 ) Φj2(r2 )\n\nr1 =r2 =0\n\n,\n\n(94)\n\nwhere n1 + n2 = n. In general, these operators do not have definite conformal spin. The\nminimal conformal spin of an operator built from two fields of conformal spin j1 and j2 with n\nderivatives on the fields is j = j1 + j2 + n, and the highest-weight operator for this case is [27]\n\u001a\n\u001b\n←\n−!\n∂\n−\n∂\nr\nr\n(n,j1 ,j2 )\nn\n(2j1 −1,2j2 −1)\nO0\n(r) = ∂r Φj1 (r) Pn\n(95)\n←\n− Φj2 (r) .\n∂r + ∂r\n(α,β)\n\nThe Jacobi polynomials Pn\nappear as the Clebsch-Gordan coefficients of the collinear conformal group.\nAs an illustration, the operators relevant for leading-twist light meson LCDAs have the\nform X̄(r1 ) Γ (/̄\nn/2) X(r2 ). From the general result (95), and the conformal spin eigenvalues\n(92), it follows that the highest-weight operators are\n\u001a\n\u001b\n←\n−!\nn\n/̄ (1,1) in̄ * ∂ − in̄ * ∂\n(n,1,1)\nn\nO0\n(r) = (in̄ * ∂) X̄(rn̄) Γ Pn\n(96)\n←\n− X(rn̄) .\n2\nin̄ * ∂ + in̄ * ∂\nFor example, with Γ = γ5 , the pion-to-vacuum matrix element yields a moment of the pion\nLCDA,\nZ 1\n(n,1,1)\nh0|O0\n(0)|πi ∝\ndu Pn(1,1)(u − ū) φπ (u, μ) ,\n(97)\n0\n\n(1,1)\n\n(1,1)\n\nwhich projects out the component of φπ (u, μ) proportional to uū Pn (2u − 1), where Pn ∝\n3/2\nCn . Similarly, we may expand the collinear fields Aμ⊥ (r1 ) X(r2 ) appearing in the current\noperators JjB into operators of definite conformal spin. For this case we find that the highestweight operators are\n\u001a\n\u001b\n←\n−!\nin̄\n*\n∂\n−\nin̄\n*\n∂\n(n,2,1)\n(2,1)\nn\nO0\n(r) = (in̄ * ∂) [in̄ * ∂ A⊥μ ](rn̄) Pn\n(98)\n←\n− X(rn̄) ,\nin̄ * ∂ + in̄ * ∂\n(2,1)\n\nand the corresponding eigenfunctions for JjB are proportional to uū Pn (2u−1), in agreement\nwith (57). From the discussion following (55), the eigenfunctions for the Wilson coefficients\n(2,1)\nCjB must then be proportional to ū Pn (2u − 1).\nIn the conformal-symmetry limit L2 , L0 , and E are conserved charges, and operators with\ndifferent conformal spin or twist therefore do not mix. For the collinear fields appearing in\nthe heavy-light currents the situation is especially simple, since there is only one operator for\n26\n\n\fμ\na given set of quantum numbers. Operators with different collinear field content or with ∂⊥\nor n * ∂ derivatives on one of the two fields have higher twist. Also, by construction, each one\n(n,2,1)\nof the operators Ok\nhas unique quantum numbers, namely\n\u0013\u0012\n\u0013\n\u0012\n3\n5\n(n,2,1)\n(n,2,1)\n2\nn+\nOk\n,\n[L , Ok\n] = n+\n2\n2\n\u0013\n\u0012\n5\n(n,2,1)\n(n,2,1)\nOk\n.\n(99)\n[L0 , Ok\n] = n+k+\n2\n(n,2,1)\n\nTo the extent that conformal symmetry is preserved, the operators Ok\nare thus multiplicatively renormalized. This explains why the eigenfunctions of the non-diagonal part of the\n(2,1)\nleading-order evolution kernel take the form of Jacobi polynomials Pn , as was shown by\nexplicit computation in Section 5.1.\n\n6\n\nRenormalization-group evolution in SCETII\n\np\nAfter RG evolution down to the scale μi ∼\n2EΛQCD , the intermediate effective theory\nSCETI is matched onto SCETII . In this section, we present a complete operator basis for the\nhard-scattering contributions in SCETII and compute the corresponding matching coefficients\n(called jet functions). To investigate the size of loop corrections, we present the complete\none-loop matching corrections to these coefficients and show that they can be expressed in\nterms of only two universal functions. We then consider resummation in SCETII and present\nthe general solution to the RG equation. In the following Section 7, we will apply these results\nto obtain RG-improved expressions for the hard-scattering contributions to B → P, V form\nfactors.\n\n6.1\n\nLow-energy representation of the B-type operators\n\np\nBelow the intermediate scale μi ∼ 2EΛQCD , the effective-theory description is in terms of\nsoft, collinear, and soft-collinear messenger modes of SCETII [5, 14]. The Lagrangian in the\nsoft sector is the same as in (5), while the collinear Lagrangian becomes\n\u0012\n\u0013\n1\nn\n/̄\nin * Dc + iD\n/ c⊥\niD\n/ c⊥ ξc .\n(100)\nLc = ξ ̄c\n2\nin̄ * Dc\nSoft-collinear messenger modes may be decoupled via field redefinitions in the leading-order\nsoft and collinear Lagrangians and in the four-quark operators representing the hard-scattering\nterms [15], and we do not display them here. In terms of the decoupled fields, it is convenient\nto introduce the gauge-invariant combinations [5, 28]\nXc = [Wc† ξc ] ∼ λ ,\n\nQs = [S † qs ] ∼ λ3/2 ,\n\nAμc = Wc† (iDcμ Wc ) ∼ (λ2 , 0, λ) ,\n\nH = [S † h] ∼ λ3/2 ,\n\nAμs = S † (iDsμ S) ∼ (0, λ, λ) ,\n27\n\n(101)\n\n\fwhere Wc and S are collinear and soft Wilson lines in the n̄ and n directions, respectively.\nTo account for non-localities generated by integrating out hard-collinear modes, collinear and\nsoft fields are smeared along light-like directions, i.e. φc (sn̄) and φs (tn) [5].\nForm factors arising in semileptonic and radiative B decays derive from current operators\nin the effective weak Hamiltonian mediating the decay of a heavy b quark into a left-handed\nlight quark. The relevant operators are\nVLμ = q̄ γ μ (1 − γ5 ) b ,\n\nTLμν = (−i) q̄ σ μν (1 + γ5 ) b = q̄ γ [μ γ ν] (1 + γ5 ) b .\n\n(102)\n\nWe find it instructive when discussing radiative corrections to consider also the scalar current,\nSL = q̄ (1 + γ5 ) b ,\n\n(103)\n\nwhich can be related to the vector current by QCD equations of motion. In the NDR scheme\nwith anti-commuting γ5 , the preceding analysis of operator mixing and renormalization is\nunchanged by the insertion of (1 + γ5 ) next to the light quark. From now on, the replacement\n′\nq̄ → q̄ (1 + γ5 ) in the SCETI currents JjB will be understood implicitly. The B-type current\noperators of SCETI then match onto four-quark operators in SCETII of the form [5, 6, 7, 8]\nOi (s, t) = X̄c (sn̄) (1 + γ5 ) Γc,i\n\nn\n/̄\nn\n/\nXc (0) Q̄s (tn) (1 ± γ5 ) Γs,i H(0) .\n2\n2\n\n(104)\n\nThe chirality of the field Q̄s (tn) is the same as that of Xc (0), which in turn is determined\nby the Dirac structure Γc,i . We restrict attention to the case where the matrix elements of\nthese operators are evaluated with an initial-state pseudoscalar B-meson. We then construct\na basis of four-quark operators in which the soft component fields arise in the combination\nμ\nQ̄s (1±γ5) (/\nn/2) H. (In a more general case, operators containing γ⊥\nnext to Q̄s , and structures\nwith more than one perpendicular Lorentz index, would also have to be considered.) For the\nscalar current SL there is only one possible structure,\nOS = X̄c (1 + γ5 )\n\nn\n/̄\nn\n/\nXc Q̄s (1 + γ5 ) H ,\n2\n2\n\n(105)\n\nwhile for the vector current we find the three operators\nOVμ 1 =\n\nnμ\nn\n/̄\nn\n/\nX̄c (1 + γ5 ) Xc Q̄s (1 + γ5 ) H ,\nn*v\n2\n2\n\nOVμ 2 =\n\nv μ X̄c (1 + γ5 )\n\nn\n/\nn\n/̄\nXc Q̄s (1 + γ5 ) H ,\n2\n2\n\nOVμ 3 =\n\nμ\nX̄c (1 + γ5 ) γ⊥\n\nn\n/\nn\n/̄\nXc Q̄s (1 − γ5 ) H .\n2\n2\n\n(106)\n\nFor the tensor current we only keep terms that are non-zero when contracted with qν , where\nq with q⊥ν = 0 is the momentum transfer. This yields\nOTμν1 =\n\nn[μ v ν]\nn\n/̄\nn\n/\nX̄c (1 + γ5 ) Xc Q̄s (1 + γ5 ) H ,\nn*v\n2\n2\n28\n\n\fn[μ\nn\n/\n/̄\nν] n\nX̄c (1 + γ5 ) γ⊥ Xc Q̄s (1 − γ5 ) H ,\nn*v\n2\n2\n/̄\nn\n/\nν] n\n= v [μ X̄c (1 + γ5 ) γ⊥ Xc Q̄s (1 − γ5 ) H .\n2\n2\n\nOTμν2 =\nOTμν3\n\n(107)\n\nColor octet-octet operators have vanishing matrix elements between physical meson states, and\nalso do not mix into the color singlet-singlet sector [15]. We may therefore restrict attention\nthroughout to color singlet-singlet operators.\nIn constructing the most general basis, we notice that adjacent γ⊥ matrices can always be\navoided. Using\nμ\nμν\nν\n{γ⊥\n, γ⊥\n} = 2g⊥\n,\n(108)\n\nμν\nany such structure can be reduced to combinations of g⊥\nand totally anti-symmetric combinations,\n[μ\nμ ]\nμ1 ...μn\n≡ γ⊥ 1 . . . γ⊥n .\n(109)\nγ⊥\nμ1 ...μn\nvanishes for n ≥ 3, while for n = 2 (we use ǫ0123 = −1)\nIn four dimensions γ⊥\n\u0012\n\u0013\n\u0013\n\u0012\nn/\n/̄ n n\n/n\n/̄\n/n\n/̄\ni μνρσ\nn/\n/̄ n n\n[μ ν]\nμν\nγ5 ≡ iǫ⊥\nγ5 .\nγ⊥ γ⊥ = ǫ\nn̄ρ nσ\n−\n−\n2\n4\n4\n4\n4\n\n(110)\n\nμ1 ...μn\nIn dimensional regularization, so-called \"evanescent\" operators containing structures γ⊥\nfor n ≥ 3 appear once radiative corrections are taken into account. A regularization scheme\nincluding the effects of these operators must be employed for next-to-leading order calculations.\nThis is the two-dimensional analogue, in the space of transverse directions, of the procedure\nemployed in four dimensions [29, 30, 31].\n\n6.2\n\nMatching calculations\n\nWe introduce the momentum-space coefficient functions\nZ\nDi (E, ω, u, μ) ≡ ds dt e−iωn*vt eiusn̄*P D̃i (s, t, μ) ,\n\n(111)\n\nwhere D̃i (s, t, μ) is the coefficient multiplying the operator Oi (s, t) in (104), and the dependence of Di on n̄ * P and n * v is only through the product (n̄ * P )(n * v) = 2E. The final\nstep of matching SCETI onto SCETII is described by so-called jet functions Jij defined via\nthe relation\n\u0013\n\u0012\nZ 1\n1\n2Eω\nDi (E, ω, u, μi) =\n(112)\ndy Jij u, y, ln 2 , μi CjB (E, y, μi) ,\n2Eω 0\nμi\np\nwhere CjB are the coefficient functions of the SCETI currents JjB , and μi ∼ 2EΛQCD denotes\nthe intermediate matching scale. Since all interactions between collinear fields and the b\nquark have been integrated out already in SCETI , the jet functions are independent of the\nheavy-quark velocity v. Dimensional analysis and rescaling invariance then imply that they\ndepend on ω only through the dimensionless ratio 2Eω/μ2i . Furthermore, since μi only appears\n29\n\n\flogarithmically, the same must be true for this ratio of scales, to any finite order in perturbation\ntheory [20]. This explains why above we have written the third argument of the jet functions\nas L = ln(2Eω/μ2i ).\nFor the calculation of the jet functions, it is convenient to work in the primed basis of\n′\ncurrent eigenvectors JjB defined in (42) and (44). From the structure of these currents, as well\nas the structure of the resulting four-quark operators in SCETII displayed in (105)–(107), we\nnotice that\nn[μ v ν]\nnμ\nμ\nμν\nμ\nμ\nOS ,\nOV 2 = v OS ,\nOS ,\nOT 1 =\nOV 1 =\nn*v\nn*v\n′\n\nJVB3μ =\n\nnμ B\nJ ,\nn*v S\n\n′\n\n′\n\nJVB2μ = v μ JSB ,\n\nJTB4μν =\n\nn[μ v ν] B\nJ ,\nn*v S\n′\n\n(113)\n′\n\nso that the SCETII operators OV 1,2 , OT 1 and their SCETI counterparts JVB3,2 , JTB4 are related\nto the scalar operators OS and JSB simply by overall factors involving nμ and v μ . It follows\n′\nthat, e.g., the jet function arising in the matching of JVB3 onto OV 1 is precisely the same as\nthat arising in the matching of JSB onto OS . Similarly, we find that\n1\nν]\nn[μ OV 3 ,\nn*v\n1\nB ′ ν]\nn[μ JV 4 ,\n=\nn*v\n\nν]\n\nOTμν3 = v [μ OV 3 ,\n\nOTμν2 =\n′\n\nJTB7μν\n′\n\nB ′ ν]\n\n′\n\nJTB6μν = v [μJV 4 ,\n\n′\n\n(114)\n′\n\nso that the matching of JTB7 (JTB6 ) onto OT 2 (OT 3 ) is precisely the same as that of JVB4 onto\n′\n′\nOV 3 . The operators JVB1 and JTB2,3 match onto SCETII four-quark operators with vanishing\n′\nprojection onto the B-meson, while JTB1,5 contain two perpendicular Lorentz indices. These\noperators are therefore not relevant to the B → P, V form factors, and we have thus not\nlisted the corresponding SCETII operators in (106) and (107). Collecting the elements Jij\ninto matrices J , these observations imply that the jet functions can be expressed in terms of\nonly two functions Jk and J⊥ . The result is\nJ S = Jk ,\n\nJ ′V\n\n\n0 0 Jk 0\n\n\n=  0 Jk 0 0  ,\n0 0 0 J⊥\n\n\nJ ′T\n\n\n\n\n0 0 0 Jk 0 0 0\n\n\n=  0 0 0 0 0 0 J⊥  ,\n0 0 0 0 0 J⊥ 0\n\n(115)\n\n4πCF αs (μi ) 1\nδ(u − v) .\nN\n2E ū\n\n(116)\n\n′\n\nwhere the primes remind us that these results refer to the basis of the SCETI currents JjB .\nAt tree level, we find\nJk (u, v, L, μi)tree = J⊥ (u, v, L, μi)tree = −\n\nIn order to study the effect of next-to-leading order matching corrections, we now calculate\nthe one-loop matching corrections to the jet functions Jk and J⊥ . The relevant diagrams are\ndepicted in Figure 6. Contributions involving soft gluons cancel in the matching once the\ncorresponding SCETII diagrams are evaluated, so that only hard-collinear SCETI diagrams\n30\n\n\f′\n\nFigure 6: SCETI graphs contributing to the matching of the currents JjB (crossed circle) onto\nthe SCETII four-quark operators Oi . Full lines denote soft fields, dashed lines hard-collinear\nfields. Diagrams with soft gluons or scaleless loops are not shown.\nneed be considered. The 1/ǫ poles are canceled by the renormalization constants of the SCETI\nand SCETII operators. Details of this calculation are presented in [32]. The results take the\nform\n\u0014\n\u0015\nαs (μi )\n4πCF αs (μi ) 1\n2\n−δ(u − v) +\njk (u, v, L) + O(αs ) ,\nJk (u, v, L, μi) =\nN\n2E ū\n4π\n\u0014\n\u0015\nαs (μi )\n4πCF αs (μi ) 1\n2\n−δ(u − v) +\nj⊥ (u, v, L) + O(αs ) , (117)\nJ⊥ (u, v, L, μi) =\nN\n2E ū\n4π\nwhere L = ln(2Eω/μ2i ), and the functions jk and j⊥ are given by\njk (u, v, L) = j1 (u, v, L) + j2 (u, v, L) + j3 (u, v) ,\nj⊥ (u, v, L) = j1 (u, v, L) − j3 (u, v) ,\n31\n\n(118)\n\n\fwith\n(\n\n\u0014\n\n\u0015\n20 4\nj1 (u, v, L) = δ(u − v) TF nf\n− (L + ln ū)\n9\n3\n\u0013\u0014\n\u0015\n\u0012\nπ2\nCA\n2\n−(L + ln u) − 3(L + ln ū) + 8 −\n+ CF −\n2\n2\n)\n\u0014\n\u0015\n13\n80 π 2\nCA\n2\n(L + ln ū) −\n(L + ln ū) +\n−\n−\n2\n3\n9\n6\n\u0013(\n\u0014\n\u0015\n\u0012\nθ(v − u)\nθ(u − v)\nCA\n−2\n(L + ln(v − u)) +\n(L + ln(u − v))\n+ CF −\n2\nv−u\nu−v\n+\n\u0014 \u0012\n\u0013\n\u0015\n2v\nv(1 − u − v)\n2(1 − u − v)\n+ θ(1 − u − v)\nL + ln\n+\nūv̄\nū\nuūv̄\n\u0015\n\u0014\n2 v̄\nū\n2\n2\n(L + ln(v − u)) +\nln −\n+ θ(v − u)\nū\nv − u ū\nv̄ uū\n\u0015)\n\u0014\n2 vū\nu\n2\n2\n(L + ln(u − v)) +\nln −\n+ θ(u − v)\nuv̄\nu − v uv̄\nv uv̄\n\u0013\n\u0015\u001b\n\u0014 \u0012\n\u001a\n(v − u)v̄\n(v − u)(1 + u)\n2\nv(1 + u)\nL + ln\n+\n,\n− θ(v − u)\n+ CF\nuv̄\nū\nū\nuūv̄\n\u0012\n\u0013(\n\u0012\n\u0013\nCA\n(u − v)v\n1\nū\nj2 (u, v, L) = 2 CF −\nL + ln\n− θ(u − v)\n2\nu\nuv̄\nu\n\u0012\n\u0013\n(v − u)v̄\nv̄\nL + ln\n− θ(v − u)\nuū\nū\n\u0012\n\u0013\n\u0015)\n\u0014\nv(1 − u − v)\n1\n(1 − u − v)2 − uv\nL + ln\n−\n+ θ(1 − u − v)\nuūv̄\nū\nu\n\u0014\n\u0012\n\u0013\u0015\nvū\n(v − u)v̄\n(v − u)\n+ 2CF\nL + ln\n,\n(L + ln vv̄) − v − θ(v − u)\nu\nuū\nū\ni\nh ūv\n(119)\nj3 (u, v) = CF − θ(u − v) − θ(v − u) .\nuv̄\n\nThe plus distribution is defined as in (48). At one-loop order there are also matching coefficients onto evanescent operators. We adopt a renormalization scheme in which the matrix\nelements of these operators between physical states vanish [29], and so do not list their matching coefficients here. However, the choice of evanescent operators is not unique, and the jet\nfunctions as well as the matrix elements of the physical SCETII four-quark operators depend\non this choice. We have chosen the evanescent operators such that the matrix elements of the\n32\n\n\fphysical operators are given by the MS LCDAs of the B meson and light meson [32].4\nWhile the numerical impact of the one-loop matching corrections to the jet functions will\nbe studied later, it is interesting at this point to use the explicit expressions in (118) to learn\nsomething about the \"natural scale\" to be used in the perturbative expansions for the jet\nfunctions. In the BLM scale-setting prescription, the scale in the coupling constant of the\nleading-order terms is chosen so as to absorb all terms proportional to β0 = 11\nCA − 34 TF nf\n3\nin the next-to-leading order corrections [33]. In the present case, this means that (for fixed u\nand ω values) we should replace αs (μi ) → αs (μBLM ), where\n5\n\nμ2BLM = e− 3 * 2ūEω\n\n(120)\n\nfor both jet functions, which agrees with previous results reported in [34]. When applied to a\nspecific process, such as the hard-scattering contributions to heavy-to-light form factors to be\nconsidered in Section 7, the BLM scale setting should be done after the convolution integrals\nover the LCDAs have been performed, which is equivalent to using mean values ū → ehln ūi\nand ω → ehln ωi , weighted by the corresponding tree-level amplitudes, to define an effective\nscale for each decay process. The resulting BLM scales, while parametrically of order μi ,\nare numerically rather low, typically μBLM ≈ 0.7 GeV or less. The smallness of these scales\nappears to suggest a poor convergence of the perturbative expansions of the jet functions.\nHowever, it turns out that the BLM prescription cannot be trusted in the present case. In the\n′\nlimit where we neglect the mild y-dependence of the coefficients CjB (E, y, μi ), it follows from\n(112) and (117) that the convolution integrals relevant to the hard-scattering contributions\ngoverned by the longitudinal jet function Jk yield\n\u0015\n\u0014\nZ ∞\nZ\nZ 1\ndω\nαs (μi ) 1\ndu\n2\ndy jk (u, y, ln(2Eω/μi ))\nφB (ω, μi )\nφM (u, μi ) αs (μi ) 1 −\nω\n4π\n0\n0\n0 ū\n\u001a\n\u0014 \u001c\n\u0013\u001c\n\u001d \u0012\n\u001d\n\u0015\u001b\nαs (μi ) 4\n2Eω\n19 π 2\n2 2Eω\n∝ αs (μi ) 1 +\nln\nln 2\n+ − +\n+ 3.99 ,\n(121)\n4π\n3\nμ2i\n3\n9\nμi\nwhere h. . . i denotes an average over the B-meson LCDA φB (ω, μi ) with measure dω/ω, and\nfor simplicity we have assumed the asymptotic form φM (u, μi ) = 6uū for the LCDA of the light\nmeson. The corresponding result for the jet function J⊥ is obtained by replacing jk → j⊥ , in\n2\nwhich case the coefficient of the single logarithm changes to (−6 + π9 ), and the constant term\nchanges to 0.73. If scale μi is chosen such that the logarithms appearing in this expression\nare not too large, then (at least through one-loop order) the perturbative corrections are of\nmoderate size. For comparison, keeping only the BLM terms of order β0 αs2 , we would obtain\n\u001a\n\u0014\n\u001c\n\u001d\n\u0015\u001b\nαs (μi )\n25\n2Eω\nαs (μi ) 1 +\n−\nln 2\n+ 26.39\n(122)\n4π\n3\nμi\ninstead of the expression in the second line of (121). We conclude that the BLM prescription\noverestimates the size of the O(αs2 ) corrections\nby large amounts. The perturbative expansions\n√\nof the jet functions at a scale μi = 2EΛh ≈ 1.5 GeV appear to be reasonably well behaved.\n4\n\nWe are indebted to M. Beneke and D. s. Yang for pointing out that this was not true with the choice of\nevanescent operators adopted in the preprint version of this paper.\n\n33\n\n\f6.3\n\nSudakov resummation in SCETII\n\nHaving performed the matching onto SCETII , we now wish to evolvep\nthe momentum-space\ncoefficient functions Di in (111) from the intermediate scale μi ∼\n2EΛQCD down to a\nhadronic scale μ, which is independent of the large energy E. This can be achieved by solving\nthe integro-differential RG equation [15]\nZ ∞ Z 1\nd\n′\n′\nDi (E, ω , u , μ) =\ndω\ndu γΓ(ω, ω ′, u, u′, μ) Di (E, ω, u, μ) .\n(123)\nd ln μ\n0\n0\nThe anomalous dimension γΓ depends on the spin-parity quantum numbers of the light finalstate meson M. As before, we must distinguish two cases: Γ = k for M = P, Vk, and Γ = ⊥\nfor M = V⊥ . The anomalous dimension may be decomposed as\nγΓ (ω, ω ′, u, u′, μ) = δ(ω − ω ′ ) KΓ (u, u′) + δ(u − u′ ) H(ω, ω ′, μ) ,\n\n(124)\n\nwhere\n(\n\n\u0015\nθ(v − u)\n1\nθ(u − v)\n− uv̄\n+ uū δ(u − v)\n+ vū\nv−u\nu−v + 2\n)\nh\ni\n− cΓ uv̄ θ(v − u) + vū θ(u − v) + O(αs2 ) ,\n\nC F αs\nvv̄ KΓ (u, v) =\nπ\n\n\u0014\n\n(125)\n\nwith ck = 1, c⊥ = 0 is the Brodsky-Lepage kernel [24], and\nh\ni\nμ\nH(ω, ω ′, μ) = Γcusp (αs ) ln + γ(αs ) δ(ω − ω ′ ) + ω Γ(ω, ω ′, αs )\n(126)\nω\n(\u0012\n\u0013\n\u0014\n\u0015 )\nμ 5\nθ(ω − ω ′ )\nθ(ω ′ − ω)\nC F αs\n′\nln −\nδ(ω − ω ) − ω\n+ O(αs2 )\n+ ′ ′\n=\n′\nπ\nω 4\nω(ω − ω ) ω (ω − ω) +\nis the corresponding kernel governing the evolution of the B-meson LCDA [20, 36].\nAs a consequence of the conformal symmetry of QCD at the classical level, the kernel\nvv̄ KΓ (u, v) is symmetric in u and v, and KΓ is diagonalized by Gegenbauer polynomials (cf.\n(96) in Section 5.3). We write\nZ 1\ndu KΓ(u, v) φn(u) = κΓ,n φn (v) ,\n(127)\n0\n\nwhere at one-loop order\nκΓ,n\n\n\u0014\n\u0015\nC F αs\n1\ncΓ\n=\n2(Hn+1 − 1) + −\n.\nπ\n2 (n + 1)(n + 2)\n\n(128)\n\nWe choose the normalization of φn such that they are orthonormal in the measure uū du on\nthe unit interval,\ns\nr\n2n + 3\n(2n + 3)(n + 2) (1,1)\nCn(3/2) (2u − 1) =\nPn (2u − 1) . (129)\nφn (u) = 2\n(n + 1)(n + 2)\nn+1\n34\n\n\fAfter expanding the coefficients Di (E, ω, u, μ) on the basis of eigenfunctions φn (u), the RG\nequation for each Gegenbauer moment is solved as in [20]. The result reads\n\u0012 \u0013−a(μi ,μ)\n∞\nX\nω\n1\nS(μ,μi )\nφn (u)\n(130)\ne\nDi (E, ω, u, μ) =\n2Eω μ\nn=0\n\u0012\n\u0013η\nZ 1\nZ 1\n2Eω\nB′\n′\n×\ndy Cj (E, y, μi)\ndx xx̄ φn (x) Jij (x, y, ∇η , μi )\n,\neVΓ,n (μi ,μ,η)\n2\nμi\n0\n0\nη=0\nwhere S(μ, μi ) and a(μi , μ) are given in (64) and (65), the jet functions Jij′ in the primed basis\nare obtained from (112) by replacing 2Eω/μ2i → ∇η , and\n\u0014\n\u0015\nZ αs (μ)\ndα\nF (η − a(μi , μ(α)), α) + κΓ,n (α) + γ(α) ,\n(131)\nVΓ,n (μi , μ, η) =\nαs (μi ) β(α)\nwith\nF (η, αs ) ≡\n\nZ\n\n∞\n\ndω ω ′ Γ(ω, ω ′, αs )\n0\n\n\u0010 ω \u0011η\nω′\n\nh\ni\n2\n= Γ1−loop\n(α\n)\nψ(1\n+\nη)\n+\nψ(1\n−\nη)\n+\n2γ\ns\nE + O(αs ) .\ncusp\n\n(132)\n\nFor a complete leading-order solution, we require the two-loop expression for Γcusp appearing in S(μ, μi ), one-loop expressions for the remaining anomalous dimensions in a(μi , μ) and\nVΓ,n (μi , μ, η), and tree-level matching conditions for the jet functions. At this order, the\nrelevant expansions are\n\u0014\n\u0013\u0012\n\u0012\n\u0013\u0015\n4π\n1\nβ1\nΓ1 β1\nΓ0\n2\n(1 − r2 + ln r2 ) +\nln r2 −\n−\n− 1 + ln r2 ,\nS(μ, μi ) =\n4β02 αs (μ)\n2β0\nΓ0 β0\nr2\nΓ0\nln r2 ,\n2β0\n\u0011\n\u0010\nΓ0\n\u0011\nln\nr\nΓ 1 − 2β\n2\n1 \u0010 (0)\nΓ\n0\n\u0011 − γE 0 ln r2 −\nκΓ,n + γ0 ln r2 ,\nVΓ,n (μi , μ, 0) = ln \u0010\nΓ0\nβ0\n2β0\nΓ 1 + 2β\nln r2\n0\na(μi , μ) = −\n\n(133)\n\nwhere r2 = αs (μ)/αs (μi ) ≥ 1, and as usual we have expanded\n(0)\n\nκΓ,m = κΓ,m\n\n7\n\nαs\n+ ... ,\n4π\n\nγ = γ0\n\nαs\n+ ... .\n4π\n\n(134)\n\nApplication to heavy-to-light form factors\n\nIn this section we apply our results to obtain resummed expressions for the hard-scattering\ncontributions to heavy-to-light form factors at large recoil energy. We begin by recalling the\ndefinitions of the ten form factors describing B decays into pseudoscalar and vector mesons.\n35\n\n\fEquating these definitions to the corresponding effective-theory expressions shows that at\nleading order in 1/E only eight of the form factors are independent. As shown in (1), in this\napproximation the form factors are given by the sum of a soft-overlap contribution, expressed in\nterms of universal non-perturbative matrix elements ζM (E) (where M = P , Vk , V⊥ depending\non the spin-parity quantum numbers of the light final-state meson), and a hard-scattering\ncontribution, given by a convolution integral over meson LCDAs. We focus on the second term\nand present general, resummed expressions for the corresponding hard-scattering kernels. The\nresults are particularly simple when hard matching corrections are ignored. In this case, for\na given final-state meson M, the hard-scattering contributions to all B → M form factors\ncan be parameterized in terms of a universal quantity HM . The Sudakov suppression factors\nare mild in all cases. In order to investigate the relative importance of running and matching\ncorrections, we apply our previous one-loop matching results for the scalar current to obtain\nthe one-loop corrected hard-scattering contribution to the vector-current form factor F0 , and\nto the form factor F+ at maximum recoil (q 2 = 0).\n\n7.1\n\nForm-factor definitions and factorization formulae\n\nWe begin by recalling the definitions of the form factors parameterizing B decays into pseudoscalar (P ) and vector (V ) mesons, following the conventions of [13] (we use the sign convention ǫ0123 = −1):\n\u0012\n\u0013\n2\n2\nm2B − m2P μ\n′\nμ\n2\nμ\n′μ\n2 mB − mP μ\nhP (p )|q̄ γ b|B̄(p)i = F+ (q ) p + p −\n+\nF\n(q\n)\nq\nq ,\n0\nq2\nq2\nhP (p′)|q̄ σ μν qν b|B̄(p)i =\nhV (p′ , η)|q̄ γ μ b|B̄(p)i =\n\n\u0003\niFT (q 2 ) \u0002 2 μ\nq (p + p′μ ) − (m2B − m2P ) q μ ,\nmB + mP\n2iV (q 2 ) μνρσ ∗ ′\nǫ\nην pρ pσ ,\nmB + mV\n\n\u0013\n\u0012\nη∗ * q μ\nη∗ * q μ\n2\n∗μ\nhV (p , η)|q̄ γ γ5 b|B̄(p)i = 2mV A0 (q ) 2 q + (mB + mV ) A1 (q ) η − 2 q\nq\nq\n\u0012\n\u0013\nη∗ * q\nm2 − m2\n− A2 (q 2 )\npμ + p′μ − B 2 V q μ ,\nmB + mV\nq\n′\n\nμ\n\n2\n\nhV (p′ , η)|q̄ σ μν qν b|B̄(p)i = −2T1 (q 2 ) ǫμνρσ ην∗ p′ρ pσ ,\n\u0002\n\u0003\nhV (p′ , η)|q̄ σ μν γ5 qν b|B̄(p)i = −i T2 (q 2 ) (m2B − m2V ) η ∗μ − η ∗ * q (pμ + p′μ )\n\u0014\n\u0015\nq2\n2\n∗\nμ\nμ\n′μ\n− i T3 (q ) η * q q − 2\n(p + p ) .\nmB − m2V\n\n(135)\n\nHere q = p − p′ is the momentum transfer, and η denotes the polarization vector of the vector\nmeson, which satisfies η * p′ = 0 and η * η ∗ = −1. The polarization vector for longitudinally\npolarized vector mesons is given by\nηkμ =\n\nmV μ\nE nμ\np′ μ\n−\nn̄\n≃\n.\nmV\nn̄ * p′\nmV n * v\n36\n\n(136)\n\n\fFor the evaluation of the hadronic matrix elements entering the hard-scattering contributions to the form factors, we need the definitions of the leading-twist LCDAs for the light\nmesons in terms of SCETII fields. They are [9]\n\u0013Z 1\n\u0012\nifP\nn/\n/̄ n\nn\n/̄\n′\n′\n′\nn̄ * p tr γ5 Γ\ndu eiusn̄*p φP (u, μ) ,\nhP (p )|X̄c (sn̄) Γ Xc (0)|0i =\n2\n4\n4\n0\n\u0013Z 1\n\u0012\nifVk\nn\n/̄\nn/\n/̄ n\n′\nhVk (p′ )|X̄c (sn̄) Γ Xc (0)|0i = −\ndu eiusn̄*p φVk (u, μ) ,\nn̄ * p′ tr Γ\n2\n4\n4\n0\n\u0013Z 1\n\u0012\nn\n/̄\nifV⊥ (μ)\nn/\n/̄ n\n′\n′\n′\n∗\nhV⊥ (p , η)|X̄c (sn̄) Γ Xc (0)|0i =\nn̄ * p tr η/⊥ Γ\ndu eiusn̄*p φV⊥ (u, μ) , (137)\n2\n4\n4\n0\nR1\nwhere the φM are normalized according to 0 du φM (u, μ) = 1. Note that the transverse\nvector-meson decay constants are scale dependent. Below, we will sometimes write fM (μ) as a\ngeneric notation for the light-meson decay constants, keeping in mind that a scale dependence\nis present only in the case of fV⊥ . The LCDA for the B-meson is defined as [35, 36]\n\u0012\n\u0013Z ∞\n√\ni mB F (μ)\nn\n/ 1 + v/\nn\n/\ntr\nΓ\nγ5\ndω e−iωtn*v φB (ω, μ) , (138)\nh0|Q̄s (tn) Γ H(0)|B̄v i = −\n2\n2\n2\n2\n0\nwhere B̄v denotes the B-meson state defined in HQET, and F is related to the asymptotic\nvalue of the B-meson decay constant in the heavy-quark limit (see below).\nFor completeness, we list also the soft-overlap contributions to form factors, parameterized\nin terms of universal matrix elements ζM [12, 13]. At leading order in 1/E, we define5\n\u0013\n\u0012\nn/\n/̄ n 1 + v/\n′\n,\nΓ\nhP (p )|X̄hc Γ h|B̄v i = 2E ζP (E) tr\n4\n2\n\u0012\n\u0013\nn/\n/̄ n 1 + v/\n′\nhVk (p )|X̄hc Γ h|B̄v i = −2E ζVk (E) tr\nΓ\nγ5 ,\n4\n2\n\u0013\n\u0012\n/̄ n 1 + v/\n′\n∗ n/\nΓ\nγ5 .\n(139)\nhV⊥ (p )|X̄hc Γ h|B̄v i = 2E ζV⊥ (E) tr η/⊥\n4\n2\nThe definitions are given in terms of SCETI currents. As shown in [8], the functions ζM (E)\ncan be decomposed further into matrix elements of SCETII operators. These operators all\nsatisfy the same symmetry relations, and the linear combinations contributing to the form\nfactor behave under renormalization in precisely the same way as the SCETI operators used\nin the definitions (139).\nTo simplify the factorization formulae, it proves convenient to write the coefficient functions\nin the form\n1 4KF (μ)\nDi (E, ω, u, μ) ≡\nTi (E, ω, u, μ) ,\n(140)\nω mB fB\n5\n\nOur convention for ζVk is the same as in [12], and is such that all ζM functions have the same power\ncounting. This differs from the corresponding function ξk in [13], given by ζVk = (E/mV ) ξk .\n\n37\n\n\fwhich serves as a definition of the hard-scattering kernels Ti . Here KF relates the HQET\n√\nparameter F in (138) to the physical B-meson decay constant, fB mB = KF (μ) F (μ), up to\ncorrections of order ΛQCD /mb . At next-to-leading order\n\u0012\n\u0013\nmb\nCF αs (μ)\n3 ln\n−2 .\n(141)\nKF (μ) = 1 +\n4π\nμ\nWith all of the definitions in place, it is now a straightforward matter to equate QCD\nmatrix elements to the corresponding SCET expressions. For the scalar and pseudoscalar\ncurrents, for example, we obtain\n1\n2E A\nhP (p′ )|q̄ b|B̄(p)i =\nC (E, μ) ζP (E, μ)\nmB\nmB S\nZ\nZ 1\n2E ∞ dω\n+\nφB (ω, μ)\ndu fP φP (u, μ) TS (E, ω, u, μ)\nmB 0 ω\n0\n\n\u0003\n2E \u0002 A\nCS ζP + φB ⊗ fP φP ⊗ TS ,\nmB\ni\n2E h A\n1\nhVk (p′ )|q̄ γ5 b|B̄(p)i = −\nCS ζVk + φB ⊗ fVk φVk ⊗ TS ,\nmB\nmB\n≡\n\n(142)\n\nwhere in the second line we have introduced a symbolic notation for the convolution integrals.\nIn general, the scale μ in the soft-overlap terms could be taken different from that in the\nhard-scattering terms. Similarly, from the matrix elements of vector and tensor currents we\nfind the relations\n\u0012\n\u0013\n\u0012\n\u0013\nE A\nE\nA\nA\nF+ = CV 1 +\nC + CV 3 ζP + φB ⊗ fP φP ⊗ TV 1 +\nTV 2 ,\nmB V 2\nmB\n\u0013\n\u0015\n\u0014\n\u0012\n\u0013\n\u0015\n\u0014\n\u0012\nmB\nE\nE\nA\nA\nA\nCV 2 + CV 3 ζP + φB ⊗ fP φP ⊗ TV 1 + 1 −\nTV 2 ,\nF0 = CV 1 + 1 −\n2E\nmB\nmB\n\u0012\n\u0013\nmB\n1 A\n1 A\n1\nA\nFT = CT 1 − CT 2 + CT 4 ζP + φB ⊗ fP φP ⊗ TT 1 ,\nmB + mP\n2\n2\n2\n\u0015\n\u0014\n\u0012\n\u0013\n\u0013\n\u0015\n\u0014\n\u0012\nE\nE\nA\nA\nA\nCV 2 + CV 3 ζVk + φB ⊗ fVk φVk ⊗ TV 1 + 1 −\nTV 2 ,\nA0 = CV 1 + 1 −\nmB\nmB\nmB + mV\nA1 = CVA1 ζV⊥ + φB ⊗ fV⊥ φV⊥ ⊗ TV 3 ,\n2E\nmB\nV = CVA1 ζV⊥ + φB ⊗ fV⊥ φV⊥ ⊗ TV 3 ,\nmB + mV\n\u0013\n\u0012\n\u0012\n\u0013\nEmB (V − A2 )\nE\nE A\nA\nA\n= CV 1 +\nC + CV 3 ζVk + φB ⊗ fVk φVk ⊗ TV 1 +\nTV 2 ,\nmV (mB +mV )\nmB V 2\nmB\n\u0012\n\u0013\n\u0015\n\u0014\nE\n1 A\n1\nA\nA\n1−\nCT 2 − CT 3 ζV⊥\nT1 = CT 1 −\n2\nmB\n2\n38\n\n\f\u0013\n\u0015\n\u0014\n\u0012\nE\n1\nTT 3 ,\n− φB ⊗ fV⊥ φV⊥ ⊗ TT 2 + 1 −\n2\nmB\n\u0012\n\u0013\n\u0014\n\u0015\nmB\nE\n1 A\n1\nA\nA\n1−\nCT 2 − CT 3 ζV⊥\nT2 = CT 1 −\n2E\n2\nmB\n2\n\u0013\n\u0015\n\u0014\n\u0012\nE\n1\nTT 3 ,\n− φB ⊗ fV⊥ φV⊥ ⊗ TT 2 + 1 −\n2\nmB\n\u0012\n\u0013\n1 A\n1 A\n1\nmB T2 − 2E T3\nA\n= CT 1 − CT 2 + CT 4 ζVk + φB ⊗ fVk φVk ⊗ TT 1 .\n2mV\n2\n2\n2\n\n(143)\n\nWe have dropped terms of relative order (mM /E)2 , where mM is the light meson mass. Recall\nthat we have defined E ≡ v * P− , which differs from the true energy by an amount of order\nm2M /E. Also, at leading order in ΛQCD /mb there is no difference between mB and mb . The\nresults for F+ , F0 and FT in (143) agree at tree level with the corresponding expressions in\n[19].6 Beyond tree level, and to any order in perturbation theory, we find that there is still only\na single jet function for decays into a given light final-state meson, e.g. Jk for a pseudoscalar\nmeson. This implies that the two functions Ja and Jb introduced in [19] are not independent.\nOur result has important implications for the universality of hard-scattering corrections, which\nwe discuss in more detail in the following subsection. The general results (143) establish that\nthe form-factor relations\n2EmB\n2E\nA1 (q 2 ) =\nT1 (q 2 ) ,\n(144)\nV (q 2 ) ,\nT2 (q 2 ) =\n2\n(mB + mV )\nmB\nare rigorous predictions of QCD at leading order in 1/E, and to all orders in αs . These\nrelations were conjectured in [39], and they were shown to hold at one-loop order in [13].\nThe scalar and pseudoscalar currents may be related to the vector and axial-vector currents\nusing the equation of motion for the quark fields, as in (31). When applied to the matrix\nelements appearing in (135) and (142), it follows that (setting as previously the light quark\nmasses to zero)\n\u0012\n\u0013\nmb (μQCD )\nm2P\n′\nhP (p )|[q̄ b](μQCD )|B̄(p)i = 1 − 2 F0 (q 2 ) = F0 (q 2 ) + . . . ,\n2\nmB\nmB\n2mV ηk∗ * q\n2E\nmb (μQCD )\n′\nhV\n(p\n)|[q̄\nγ\nb](μ\n)|\nB̄(p)i\n=\n−\nA0 (q 2 ) = −\nA0 (q 2 ) + . . . ,\nk\n5\nQCD\n2\n2\nmB\nmB\nmB\n\n(145)\n\nwhere the dots represent terms of order m2M /m2B . Comparison with (143) shows that to all\norders in perturbation theory\n\u0012\n\u0013\nE\nmb (μQCD ) A\nA\nCV 1 + 1 −\nCVA2 + CVA3 =\nCS ,\nmb\nmb\n\u0012\n\u0013\nE\nmb (μQCD )\nTV 1 + 1 −\nTV 2 =\nTS .\n(146)\nmb\nmb\nThese are the SCETII realizations of the SCETI coefficient relations found in (31).\n6\n\n(t)\n\n(t)\n\nSee also [37]. In equation (22) of this paper −B4 should be replaced by +B4 [38].\n\n39\n\n\f7.2\n\nSudakov resummation for the hard-scattering contributions\n\nWe now apply the results of Sections 5 and 6 to obtain completely general, resummed expressions for the hard-scattering kernels Ti appearing in the form-factors (143). Starting from the\ndefining relation (140) for Ti , and combining it with the result (130) for the coefficients Di ,\nwe obtain\n\u0012 \u0013a(μh ,μi ) \u0012 \u0013−a(μi ,μ)\nmB fB eVF (μh ,μ) 2E\nω\nTi (E, ω, u, μ) =\neS(μh ,μi )+S(μ,μi )\n8E KF (μh ) μh\nμ\nZ 1 Z 1\n∞\nX\n′\n×\nφn (u)\ndy\ndv UΓ (y, v, μh, μi ) CjB (E, v, μh )\nn=0\n\n×\n\nZ\n\n0\n\n0\n\n1\n\n0\n\ndx xx̄ φn (x) Jij′ (x, y, ∇η , μi )\n\n\u0012\n\n2Eω\nμ2i\n\n\u0013η\n\neVΓ,n (μi ,μ,η)\n\n.\n\n(147)\n\nη=0\n\n′\n\nWe have used (63) to express the coefficients CjB (E, y, μi ) at the intermediate scale, which\nenter in (130), in terms of their matching conditions at the high scale μh . Also, we have\nrewritten KF (μ) = e−VF (μh ,μ) KF (μh ), where\nZ αs (μ)\ndα\nγF,0\nVF (μh , μ) = −\nγF (α) =\nln r1 r2 + . . .\n(148)\n2β0\nαs (μh ) β(α)\nis the solution to the evolution equation\nd\nKF = γ F K F ,\nd ln μ\n\nγF =\n\n∞\nX\nn=0\n\nγF,n\n\n\u0010 α \u0011n+1\ns\n\n4π\n\n,\n\n(149)\n\nwith γF,0 = −3CF . As previously, r1 = αs (μi )/αs (μh ) and r2 = αs (μ)/αs (μi ). In (147) all\nlarge logarithms are resummed into the various evolution functions. The matching coefficients\n′\nKF (μh ), CjB (E, v, μh ), and Jij′ (x, y, ∇η , μi ) can be calculated reliably in fixed-order perturbation theory. The expressions for the kernels Ti are formally (to the order we are working)\nindependent of the two matching scales μh and μi . A dependence on the low scale μ remains,\nwhich will cancel against the scale dependence of the hadronic matrix elements of the SCETII\noperators.\nThe general result (147) simplifies considerably when hard matching corrections at the\nhigh scale μh ∼ mb are ignored. In this case KF (μh ) = 1, and using the fact that the tree-level\n′\nmatching conditions for CjB (E, v, μh ) are independent of v, it follows that\nZ 1\n′\n′\ndv UΓ (y, v, μh, μi ) CjB (E, v, μh) = UΓ (y, μh, μi ) CjB (E, μh ) ,\n(150)\n0\n\nwhere UΓ (y, μh , μi ) are the functions shown in Figure 4. Using the tree-level matching conditions compiled in (26)–(28) along with the relations (43) and (45), it is straightforward to\n′\nevaluate the products Jij′ CjB (E, μh ) for the various kernels Ti , with the matrices Jij′ as given\nin (115). We find\nTS : − Jk ,\n40\n\n\fTV 1\n\n\u0013\n\u0012\n2E\nJk ,\n:\n1−\nmb\n\nTT 1 : 2Jk ,\n\nTT 2 :\n\nTV 2 : − 2Jk ,\n4E\nJ⊥ ,\nmb\n\nTV 3 : 0 ,\n\nTT 3 : 0 .\n\n(151)\n\nIt follows that the convolution integrals for the hard-scattering contributions to the form\nfactors in (143) may be written in terms of three universal functions\nHM\n\n\u0012 \u0013a(μh ,μi )\n∞ Z 1\nX\nEfB 2E\nS(μh ,μi )+S(μ,μi )+VF (μh ,μ)\ne\ndu φn (u) fM (μ) φM (u, μ)\n≡−\n2mB μh\nn=0 0\n\u0012 \u0013−a(μi ,μ) Z 1\nZ ∞\ndω\nω\n×\ndy UΓ (y, μh, μi )\nφB (ω, μ)\nω\nμ\n0\n0\n\u0013η\n\u0012\nZ 1\n2Eω\n,\n(152)\neVΓ,n (μi ,μ,η)\n×\ndx xx̄ φn (x) JΓ(x, y, ∇η , μi )\n2\nμ\n0\ni\nη=0\n\nwhere Γ = k for M = P or Vk , and Γ = ⊥ for M = V⊥ . We have extracted a factor −(mB /2E)2\nfrom the expression in (147) so as to remove any non-logarithmic E dependence from the\nquantities HM and ensure that they are positive. (Recall that the tree-level jet functions are\nproportional to −1/E.) Note that in (152) the μ dependence of the kernels Ti cancels against\nthat of the hadronic quantities φB , φM , and fM . We repeat that this expression neglects hard\nmatching corrections at the scale μh ∼ mb , but it allows for arbitrary corrections to the jet\nfunctions. If only the tree-level matching conditions for the jet functions given in (116) are\nretained, the result simplifies further to\nHM\n\n\u0013a(μh ,μi )\n∞ Z 1\nX\n2E\nS(μh ,μi )+S(μ,μi )\ne\ndu φn (u) fM (μ) φM (u, μ)\nμh\nn=0 0\n\u0012 \u0013−a(μi ,μ) Z 1\nZ ∞\ndω\nω\nVF (μh ,μ)+VΓ,n (μi ,μ,0)\ndy y φn (y) UΓ(y, μh , μi ) . (153)\nφB (ω, μ)\n×e\nω\nμ\n0\n0\nπCF αs (μi ) fB\n=\nN\nmB\n\n\u0012\n\nFrom (143) and (151), it is easy to read off the hard-scattering contributions ∆Fi to the\nvarious form factors. For the three B → P form factors, we obtain\n\u0013\n\u0010 m \u00112 \u0012 4E\nmB\nB\n∆F+ =\n− 1 HP ,\n∆F0 =\nHP ,\n2E\nmB\n2E\n\u0013\n\u0010 m \u00112 \u0012\nmP\nB\n1+\nHP .\n(154)\n∆FT = −\n2E\nmB\nThe corresponding results for the seven B → V form factors read\n\u0010 m \u00112\nB\n∆A0 =\nHVk ,\n∆A1 = ∆V = 0 ,\n2E\n\u0013\n\u0010 m \u00113 \u0012 4E\n2mV\nB\n− 1 HVk ,\n∆A2 = −\nmB − mV 2E\nmB\n41\n\n(155)\n\n\fand\nmB\nHV⊥ ,\n∆T2 = HV⊥ ,\n2E\n\u0011\nmB \u0010\nmV mB\n∆T3 =\nHV⊥ +\nHVk .\n2E\n2E 2\n\n∆T1 =\n\n7.3\n\n(156)\n\nNumerical results\n\nWe are finally in a position to study the phenomenological implications of our results. For the\nleading-twist LCDAs of the light mesons, we take for simplicity the asymptotic forms\nφP (u) = φVk (u) = φV⊥ (u) = 6u(1 − u) .\n\n(157)\n\n√\nThen only the n = 0 term contributes to the sum (152), where φ0 (u) = 6. To proceed\nfurther we require the B-meson LCDA, which is poorly known at present. As an illustrative\nmodel, we adopt the form [35]\nφB (ω, μ0) =\n\nω −ω/λB\ne\n,\nλ2B\n\nλB =\n\n2\n(mB − mb ) ≈ 0.32 GeV ,\n3\n\n(158)\n\nwhere μ0 is a low hadronic scale, at which the model assumes the stated functional form. The\nrelevant convolution integral resulting from (153) at μ = μ0 is then\n\u0012 \u0013−a\n\u0012 \u0013−a\nZ ∞\n1\nω\nλB\ndω\n=\n.\n(159)\nφB (ω, μ0)\nΓ(1 − a)\nω\nμ0\nλB\nμ0\n0\nCombining all pieces, we find at leading order in RG-improved perturbation theory\nHM\n\n\u0012 \u0013a(μh ,μi ) \u0012 \u0013−a(μi ,μ0 )\n3πCF αs (μi ) fB fM (μi ) 2E\nλB\n=\neS(μh ,μi )+S(μ0 ,μi )\nN\nmB λB\nμh\nμ0\nZ 1\ndy 2y UΓ (y, μh, μi ) .\n× eVF (μh ,μ0 )+V0 (μi ,μ0 )\n\n(160)\n\n0\n\nThe quantity\n\n\u0013\n\u0011 \u0012 Γ\nΓ0\nγ0\n0\nV0 (μi , μ0 ) = ln Γ 1 −\nln r2 ,\nln r2 − γE\n+\n2β0\nβ0 2β0\n\u0010\n\n(161)\n\nwhere now r2 = αs (μ0 )/αs (μi ), results from the product of the Γ function in (159) times eVΓ,0\n(0)\nfrom (133), after the term involving κΓ,0 has been used to cancel the scale dependence of\nfM (μ), replacing it with fM (μi ). We expand the RG factors a(μh , μi ) and S(μh , μi ) according\nto (66), a(μi , μ0) and S(μ0, μi ) according to (133), and VF (μh , μ) as shown in (148).\nIt is convenient to present the\n√ results in terms of the tree-level expressions, which we define\nat a fixed reference scale μi = mb Λh with Λh = 0.5 GeV,\n√\n√\n3πCF αs ( mb Λh ) fB fM ( mb Λh )\ntree\n.\n(162)\nHM ≡\nN\nmB λB\n42\n\n\f1.2\n\n1\n\n1\n\nHV⊥ /HVtree\n⊥\n\ntree\nHP,Vk /HP,V\nk\n\n1.2\n\n0.8\n0.6\n0.4\n\n0.8\n0.6\n0.4\n\ng replacements\n\nPSfrag replacements\n0.2\n\n0.2\n0.6\n\n0.8\n\n1\n\n1.2\n\n1.4\n\n0.6\n\nμ0 [GeV]\n\n0.8\n\n1\n\n1.2\n\n1.4\n\nμ0 [GeV]\n\nFigure 7: Leading-order resummed results for the hard-scattering contributions to heavy-totree\nlight form factors evaluated at 2E = mB , in units of the tree-level expressions for HM\nin (162).\nThe bands reflect the sensitivity to the choice of the two matching scales μh (dark band) and\nμi (light band). They are the result of varying 0.5m2b < μ2h < 2m2b and 0.5mb Λh < μ2i < 2mb Λh ,\nrespectively.\nAs an example we may consider the pion (with fπ = 131 MeV) and the ρ meson (with fρk =\n√\n198 MeV and fρ⊥ ( mb Λh ) = 152 MeV [40]) as representative pseudoscalar and vector mesons,\nrespectively. Then with fB = 180 MeV and λB = 0.32 GeV, we obtain HPtree ≈ 0.021, HVtree\n≈\nk\ntree\n0.032, and HV⊥ ≈ 0.025. In Figure 7 we plot the dependence of the quantities HM on the\nmodel parameter μ0 and investigate their sensitivity to the matching scales μh and μi . We\nobserve that the results are rather stable for a wide range of μ0 values. If φB can be modeled\naccurately by (158) for some value of μ0 within this range, then the results are relatively\ninsensitive to the precise value of μ0 . At μ0 = 1 GeV, the sensitivity to the matching scales is\napproximately ±20% for the considered range of μi , and ±5% for the considered range of μh .\nIn order to investigate the size of one-loop matching corrections, we return to the example\nof the scalar current. Inserting the one-loop jet functions calculated in Section 6.2 into the\ngeneral relation (147), it is straightforward to project out the relevant moment of the lightmeson LCDA. The second relation in (146) then yields the hard-scattering contribution to the\nform factor F0 including leading-order resummation effects and next-to-leading order matching\ncorrections. Figure 8 shows the energy dependence of ∆F0 for two different values for the model\nparameter μ0 . In Figure 9 we restrict attention to maximum recoil energy, E = mB /2. In\nthis case F+ (0) = F0 (0), so that our analysis applies to both vector form factors. We again\nobserve a mild dependence on the model parameter μ0 , and a slightly reduced (with respect\nto the leading-order results in Figure 7) sensitivity to the matching scales μh and μi .\nAs a final note, we emphasize that the numerical results presented above depend on the\nmodel used for the B-meson LCDA, primarily through its first inverse moment, λB . However,\nthe statement that leading-order resummation effects are encoded by universal functions HM ,\nwhich are the same for all form factors with the same light meson in the final state, is independent of any model assumptions. The one-loop matching analysis for the sample case of\nthe form factor F0 provides some insight into the size of next-to-leading order corrections and\nthe convergence of the perturbative expansion of the jet functions. The one-loop matching\n\n43\n\n\f∆F0 /∆F0tree\n\n1.4\n1.2\n1\n0.8\n0.6\n\nPSfrag replacements\n\n0.4\n1.6\n\n1.8\n\n2\n\n2.2\n\n2.4\n\n2.6\n\nE [GeV]\nFigure 8: Hard-scattering contribution to the form factor F0 including one-loop matching\ncorrection, in units of the tree-level expression ∆F0tree = m2EB HPtree . The solid and dashed\ncurves correspond to a low-energy scale μ0 such that αs (μ0 ) = 0.5√and 1.0, respectively. The\nblack lines are obtained with matching√scales μh = 2E and μi = 2EΛh with Λh = 0.5 GeV,\nthe gray lines with μh = mb and μi = mb Λh .\n\n∆F+ /∆F+tree |E=Emax\n\n1.4\n1.2\n1\n\n0.8\n0.6\n\nPSfrag replacements\nαs\n\n0.4\n0.6\n\n0.8\n\n1\n\n1.2\n\n1.4\n\nμ0 [GeV]\nFigure 9: Hard-scattering contribution to the form factor F+ (0) = F0 (0), including one-loop\nmatching corrections, as a function of the model parameter μ0 . The bands reflect the sensitivity\nto the choice of the two matching scales μh (dark band) and μi (light band). They are the\nresult of varying 0.5m2b < μ2h < 2m2b and 0.5mb Λh < μ2i < 2mb Λh , respectively.\n\n44\n\n\fcorrections at the hard scale μh modify the tree-level expression for F0 (0) by ∼ 10%. With\nμ0 = 1 GeV, the corrections arising from matching at the intermediate scale μi amount to a\nchange of ∼ 30%. Our calculation also confirms the convergence of the hard-scattering convolution integral in a non-trivial case, as required by the factorization theorem (1), and as\nproved on general grounds in [7, 8].\n\n8\n\nAsymptotic behavior of Sudakov logarithms for\nheavy-to-light form factors\n\nAn interesting question to ask is whether one of the soft-overlap or hard-scattering contributions to the form factors is suppressed relative to the other in the formal limit E → ∞\nwith fixed ratio E/mb . As already noted in [8, 15], this issue cannot be entirely addressed\nin perturbation theory, since the matrix elements for the soft-overlap contribution depend on\nE in a non-perturbative way. Still, it is interesting to investigate the relative suppression of\nthe Wilson coefficients multiplying the hadronic matrix elements at some low renormalization\nscale μ0 , assuming that the matrix elements at a low scale have only a mild energy dependence.\nIn that way, one takes into account all short-distance logarithms arising from RG evolution\nbetween the scales μh ∼ 2E and μ0 .\nIn order to isolate the dominant Sudakov factor, we concentrate on only those terms in\nthe RG evolution equations involving Γcusp . They are sufficient to resum the leading Sudakov\ndouble logarithms to all orders in perturbation theory. In SCETI , the evolution of the A-type\nand B-type operators is then identical,\n\u0015\n\u0014\nd\n2E\nA\nCiA (E, μ) ,\nC (E, μ) ≃ Γcusp (αs ) ln\nd ln μ i\nμ\n\u0015\n\u0014\n2E\nd\nB\nCjB (E, u, μ) ,\n(163)\nCj (E, u, μ) ≃ Γcusp (αs ) ln\nd ln μ\nμ\nso that the leading Sudakov suppression factor from SCETI running is the same for the two\ntypes of currents. Our new result (54) for the cusp contribution to the anomalous dimensions\nof the B-type currents is a crucial ingredient to this conclusion. In SCETII , the leading-order\nheavy-light currents contributing to the soft-overlap terms obey the same evolution equation as\nin (163) [8]; however, the hard-scattering contributions now derive from four-quark operators,\nwhose coefficient functions obey\nh\nd\nμi\nDi (E, ω, u, μ)\nDi (E, ω, u, μ) ≃ Γcusp (αs ) ln\nd ln μ\nω\n\u0014\n\u0015\n2E\n2Eω\n= Γcusp (αs ) ln\n− Γcusp (αs ) ln 2 Di (E, ω, u, μ) .\n(164)\nμ\nμ\nIf not for the term involving the intermediate scale 2Eω ∼ EΛQCD ∼ μ2i , the running would\nagain be the same for both contributions. For a low value μ ∼ μ0 ∼ ΛQCD , the effect of this\nterm is to reduce the Sudakov suppression of the hard-scattering contributions relative to that\n45\n\n\fexp[2S(μi , μ0 )]\n\n1\n\nPSfrag replacements\n\n0.8\n0.6\n0.4\n0.2\n0\n10\n\n20\n\n30\n\n40\n\n50\n\n2E [GeV]\nFigure 10: Asymptotic Sudakov suppression of the Wilson coefficient of the soft-overlap contribution to a heavy-to-light form factors relative to the coefficient of the hard-scattering\ncontribution. The three curves correspond to different choices of the low scale μ0 , such that\nαs (μ0 ) = 0.5 (solid),\n√ 0.75 (dashed), and 1.0 (dotted). The intermediate matching scale is\ntaken to be μi = 2EΛh with Λh = 0.5 GeV.\nof the soft-overlap terms. It follows that, at a low scale μ0 ≪ μi , the soft-overlap contribution\nto a heavy-to-light form factor is suppressed relative to the hard-scattering contribution by a\nfactor\n#\n\" Z\nZ α\nαs (μ0 )\ndα′\ndα\n= e2S(μi ,μ0 ) ,\n(165)\nΓcusp (α)\nexp −2\n′\nαs (μi ) β(α )\nαs (μi ) β(α)\nwhere the leading-order expression for S(μi , μ0 ) is obtained from (66) by replacing μh → μi\nand μ → μ0 . For realistic values of parameters this suppression is very mild.\n√ This is illustrated\n2S(μi ,μ0 )\nin Figure 10, where we show the energy dependence of e\nfor μi = 2EΛh and different\nchoices of μ0 .\n\n9\n\nDiscussion and conclusions\n\nOur analysis completes the leading-order description of large-recoil heavy-to-light form factors in SCET, including Sudakov resummation effects. The main focus was on the structure of SCETI currents, which divide naturally into two classes (denoted A- and B-type),\ncontributing respectively to the soft-overlap (spin-symmetry preserving) and hard-scattering\n(spin-symmetry breaking) terms.\nTwo interesting complications arise in the RG analysis in SCETI . The first, common\nto both types of operators, is the explicit scale dependence of the anomalous dimensions.\nThe non-trivial result that the scale dependence appears to all orders in αs only as a single\nlogarithm times the universal cusp anomalous dimension follows from the cusp structure of the\nWilson loops appearing in the effective-theory operators. The resulting Sudakov suppression\nis the (formally) dominant effect of RG running. The second complication, specific to the Btype operators, is the mixing of operators having different hard-collinear momentum fractions.\n46\n\n\fThe structure of this mixing is constrained at leading order by a conformal symmetry in the\nhard-collinear sector of the effective theory. The corresponding (multiplicatively renormalized)\noperator eigenfunctions are expressed in terms of Jacobi polynomials. The heavy quark breaks\nthe conformal symmetry, introducing an additional local term in the evolution equation. An\napproximate, but arbitrarily precise solution to the RG equation may be obtained by matrix\nmethods with a truncated basis of conformal eigenfunctions.\nTo complete the form-factor analysis, we have matched the intermediate effective theory\nonto SCETII , where the B-type currents are represented in terms of non-local four-quark operators. The projection properties of effective-theory spinor fields severely restrict the possible\nDirac structures appearing in the four-quark operators. As an immediate consequence of expressing the original QCD currents in the SCETII representation, we found that for two cases\nthe spin-symmetry relations holding between the soft-overlap contributions to different form\nfactors are not broken at any order in perturbation theory by hard-scattering corrections. In\nthe remaining cases, when matching corrections at the high scale μh ∼ mb are neglected, the\nresulting hard-scattering contributions can be related to a single factor HM , the same for all\nB → M transitions involving the same light final-state meson M. This universality implies\nthat certain form-factor relations, e.g. those between the B → P form factors F+ , F0 , and FT ,\nare exact up to corrections of order αs (mb ) and ΛQCD /mb . We have presented results for the\nperturbative expansion of the quantities HM through one-loop order.\nBecause of the factorized form, the RG analysis of the hard-scattering terms in SCETII\nreduces to the renormalization of the B-meson and light-meson LCDAs. Using previous results\nfor the relevant evolution equations, we have presented a complete leading-order resummation\nof Sudakov logarithms. At this order, after resumming all single and double logarithms,\nthe result is described by a universal RG factor, identical for all form factors describing\nthe same light final-state meson. In order to investigate the size of matching corrections,\nwe have performed the one-loop matching necessary to analyze the vector form factors F+\nand F0 at maximum recoil. Contributions from matching at the high scale μh ∼ 2E ∼ mb\ngive ∼ 10% correctionspto the tree-level expressions, while matching contributions at the\nintermediate scale μi ∼ 2EΛQCD yield modifications of ∼ 30%. A complete next-to-leading\norder solution, which controls scale dependence through O(αs ), will have to await the extension\nof our anomalous-dimension calculations to the two-loop order. Such an analysis would also\nrequire the three-loop coefficient of the cusp anomalous dimension Γcusp (αs ), which has been\ncalculated very recently [41].\nOne of the dominant uncertainties in the phenomenological analysis of heavy-to-light form\nfactors results from our ignorance about the functional form of the B-meson LCDA φB (ω).\nThe scale of the hard-scattering contribution to form factors is set by the quantities HM ≈\n(4π/3) αs fB fM /mB λB ≈ 0.02–0.03 (for αs ≈ 0.3 and λB ≈ 0.3 GeV). Since φB (ω) and, in\nparticular, its first inverse moment λB are ubiquitous in the effective-theory description of\nexclusive B decays, there is hope that experiment can provide significant constraints, to be\nchecked against the present knowledge based on QCD sum rules [35, 42, 43].\nThe effective theory does not predict the relative size of the soft-overlap and hard-scattering\ncontributions to the form factors, other than saying that they are of the same order in ΛQCD /E\n(neglecting Sudakov logarithms), namely of order (ΛQCD /E)3/2 . To explore this question\nfurther, we have investigated the asymptotic forms of the Wilson coefficient functions in the\n47\n\n\fformal limit E → ∞ with fixed E/mb . We have found that the soft-overlap coefficients are\nsuppressed relative to the hard-scattering coefficients in the asymptotic large-energy limit,\nbut that this suppression is ineffective for realistic energies attainable in B decays. This\nconclusion is, however, tempered by the fact that the non-perturbative soft-overlap matrix\nelements have a long-distance sensitivity to the scale E, which cannot be controlled using\nshort-distance methods. Therefore, the behavior of the Wilson coefficients alone does not\nnecessarily give a reliable prediction for the asymptotic behavior of the form factors themselves.\nPhenomenologically, it appears that the soft-overlap contributions to B → M form factors are\nsignificantly larger than the hard-scattering terms.\nThe results presented in this paper will be relevant to more complicated decay processes.\nQCD factorization formulae relate the decay amplitudes for rare exclusive processes such\nas B → ππ or B → K ∗ γ to the sum of a B → M form-factor term plus a hard-scattering\ncontribution [9, 10, 11], both of which are described in the effective theory by operators already\npresent in the form-factor analysis. For example, in [44] it is argued that the jet functions\nappearing in B → ππ are the same as those appearing in the B → π form factor. The\nuniversality of the jet functions discussed in the present work may have interesting implications\nwhen applied to these cases. Finally, using the SCET formalism it should also be possible to\nanalyze heavy-to-light form factors beyond the leading order in the large-energy expansion.\nNote added: While this paper was in writing the work [45] appeared, in which the one-loop\nhard matching corrections to the subleading SCETI currents are computed. Our operator\nbasis is more convenient for studying RG evolution than the one adopted in that paper, since\nwith our choice the two-particle (A-type) and three-particle (B-type) currents do not mix\nunder renormalization. Our matching coefficient CSB in (30) agrees with the corresponding\nresult in [45].\nAcknowledgments: We thank M. Beneke and D. s. Yang for alerting us to the scheme\ndependence of the one-loop jet-functions. The work of T.B. and R.J.H. is supported by the\nDepartment of Energy under Grant DE-AC02-76SF00515. The research of S.J.L. and M.N. is\nsupported by the National Science Foundation under Grant PHY-0098631.\n\nReferences\n[1] C. W. Bauer, S. Fleming, D. Pirjol and I. W. Stewart, Phys. Rev. D 63, 114020 (2001)\n[hep-ph/0011336].\n[2] C. W. Bauer, D. Pirjol and I. W. Stewart, Phys. Rev. D 65, 054022 (2002) [hepph/0109045].\n[3] J. Chay and C. Kim, Phys. Rev. D 65, 114016 (2002) [hep-ph/0201197].\n[4] M. Beneke, A. P. Chapovsky, M. Diehl and T. Feldmann, Nucl. Phys. B 643, 431 (2002)\n[hep-ph/0206152].\n\n48\n\n\f[5] R. J. Hill and M. Neubert, Nucl. Phys. B 657, 229 (2003) [hep-ph/0211018].\n[6] C. W. Bauer, D. Pirjol and I. W. Stewart, Phys. Rev. D 67, 071502 (2003) [hepph/0211069].\n[7] M. Beneke and T. Feldmann, Nucl. Phys. B 685, 249 (2004) [hep-ph/0311335].\n[8] B. O. Lange and M. Neubert, Nucl. Phys. B 690, 249 (2004) [hep-ph/0311345].\n[9] M. Beneke, G. Buchalla, M. Neubert and C. T. Sachrajda, Phys. Rev. Lett. 83, 1914\n(1999) [hep-ph/9905312]; Nucl. Phys. B 591, 313 (2000) [hep-ph/0006124]; Nucl. Phys.\nB 606, 245 (2001) [hep-ph/0104110].\n[10] M. Beneke, T. Feldmann and D. Seidel, Nucl. Phys. B 612, 25 (2001) [hep-ph/0106067].\n[11] S. W. Bosch and G. Buchalla, Nucl. Phys. B 621, 459 (2002) [hep-ph/0106081].\n[12] J. Charles, A. Le Yaouanc, L. Oliver, O. Pene and J. C. Raynal, Phys. Rev. D 60, 014001\n(1999) [hep-ph/9812358].\n[13] M. Beneke and T. Feldmann, Nucl. Phys. B 592, 3 (2001) [hep-ph/0008255].\n[14] T. Becher, R. J. Hill and M. Neubert, Phys. Rev. D 69, 054017 (2004) [hep-ph/0308122].\n[15] T. Becher, R. J. Hill, B. O. Lange and M. Neubert, Phys. Rev. D 69, 034013 (2004)\n[hep-ph/0309227].\n[16] For a review, see: M. Neubert, Phys. Rept. 245, 259 (1994) [hep-ph/9306320].\n[17] M. Beneke and T. Feldmann, Phys. Lett. B 553, 267 (2003) [hep-ph/0211358].\n[18] A. V. Manohar, T. Mehen, D. Pirjol and I. W. Stewart, Phys. Lett. B 539, 59 (2002)\n[hep-ph/0204229].\n[19] D. Pirjol and I. W. Stewart, Phys. Rev. D 67, 094005 (2003) [hep-ph/0211251].\n[20] S. W. Bosch, R. J. Hill, B. O. Lange and M. Neubert, Phys. Rev. D 67, 094014 (2003)\n[hep-ph/0301123].\n[21] G. P. Korchemsky and A. V. Radyushkin, Nucl. Phys. B 283, 342 (1987); I. A. Korchemskaya and G. P. Korchemsky, Phys. Lett. B 287, 169 (1992).\n[22] T. Becher, M. Neubert and A. A. Petrov, Nucl. Phys. B 611, 367 (2001) [hep-ph/0012183].\n[23] C. W. Bauer, S. Fleming and M. E. Luke, Phys. Rev. D 63, 014006 (2001) [hepph/0005275].\n[24] G. P. Lepage and S. J. Brodsky, Phys. Rev. D 22, 2157 (1980).\n[25] A. V. Belitsky, A. S. Gorsky and G. P. Korchemsky, Nucl. Phys. B 667, 3 (2003) [hepth/0304028].\n49\n\n\f[26] For a review, see: V. M. Braun, G. P. Korchemsky and D. Muller, Prog. Part. Nucl. Phys.\n51, 311 (2003) [hep-ph/0306057].\n[27] Y. M. Makeenko, Sov. J. Nucl. Phys. 33, 440 (1981) [Yad. Fiz. 33, 842 (1981)].\n[28] C. W. Bauer and I. W. Stewart, Phys. Lett. B 516, 134 (2001) [hep-ph/0107001].\n[29] M. J. Dugan and B. Grinstein, Phys. Lett. B 256, 239 (1991).\n[30] A. J. Buras and P. H. Weisz, Nucl. Phys. B 333, 66 (1990).\n[31] S. Herrlich and U. Nierste, Nucl. Phys. B 455, 39 (1995) [hep-ph/9412375].\n[32] T. Becher and R. J. Hill, hep-ph/0408344.\n[33] S. J. Brodsky, G. P. Lepage and P. B. Mackenzie, Phys. Rev. D 28, 228 (1983).\n[34] M. Neubert and B. D. Pecjak, JHEP 0202, 028 (2002) [hep-ph/0202128].\n[35] A. G. Grozin and M. Neubert, Phys. Rev. D 55, 272 (1997) [hep-ph/9607366].\n[36] B. O. Lange and M. Neubert, Phys. Rev. Lett. 91, 102001 (2003) [hep-ph/0303082].\n[37] D. Pirjol and I. W. Stewart, hep-ph/0309053.\n[38] D. Pirjol, private communication.\n[39] G. Burdman and G. Hiller, Phys. Rev. D 63, 113008 (2001) [hep-ph/0011266].\n[40] P. Ball and V. M. Braun, Phys. Rev. D 58, 094016 (1998) [hep-ph/9805422].\n[41] S. Moch, J. A. M. Vermaseren and A. Vogt, Nucl. Phys. B 688, 101 (2004) [arXiv:hepph/0403192].\n[42] P. Ball and E. Kou, JHEP 0304, 029 (2003) [hep-ph/0301135].\n[43] V. M. Braun, D. Y. Ivanov and G. P. Korchemsky, Phys. Rev. D 69, 034014 (2004)\n[hep-ph/0309330].\n[44] C. W. Bauer, D. Pirjol, I. Z. Rothstein and I. W. Stewart, hep-ph/0401188.\n[45] M. Beneke, Y. Kiyo and D. s. Yang, Nucl. Phys. B 692, 232 (2004) [hep-ph/0402241].\n\n50\n\n\f"}