{"id": "http://arxiv.org/abs/hep-ph/0511082v2", "guidislink": true, "updated": "2006-05-03T01:16:20Z", "updated_parsed": [2006, 5, 3, 1, 16, 20, 2, 123, 0], "published": "2005-11-07T21:49:51Z", "published_parsed": [2005, 11, 7, 21, 49, 51, 0, 311, 0], "title": "Probing Composite Gravity in Colliders", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0511253%2Chep-ph%2F0511152%2Chep-ph%2F0511121%2Chep-ph%2F0511214%2Chep-ph%2F0511279%2Chep-ph%2F0511156%2Chep-ph%2F0511240%2Chep-ph%2F0511280%2Chep-ph%2F0511192%2Chep-ph%2F0511313%2Chep-ph%2F0511136%2Chep-ph%2F0511138%2Chep-ph%2F0511271%2Chep-ph%2F0511274%2Chep-ph%2F0511166%2Chep-ph%2F0511196%2Chep-ph%2F0511056%2Chep-ph%2F0511222%2Chep-ph%2F0511106%2Chep-ph%2F0511299%2Chep-ph%2F0511212%2Chep-ph%2F0511060%2Chep-ph%2F0511189%2Chep-ph%2F0511090%2Chep-ph%2F0511234%2Chep-ph%2F0511031%2Chep-ph%2F0511185%2Chep-ph%2F0511137%2Chep-ph%2F0511003%2Chep-ph%2F0511336%2Chep-ph%2F0511051%2Chep-ph%2F0511340%2Chep-ph%2F0511036%2Chep-ph%2F0511020%2Chep-ph%2F0511052%2Chep-ph%2F0511191%2Chep-ph%2F0511307%2Chep-ph%2F0511311%2Chep-ph%2F0511197%2Chep-ph%2F0511076%2Chep-ph%2F0511290%2Chep-ph%2F0511252%2Chep-ph%2F0511190%2Chep-ph%2F0511118%2Chep-ph%2F0511328%2Chep-ph%2F0511235%2Chep-ph%2F0511112%2Chep-ph%2F0511038%2Chep-ph%2F0511151%2Chep-ph%2F0511200%2Chep-ph%2F0511014%2Chep-ph%2F0511108%2Chep-ph%2F0511338%2Chep-ph%2F0511281%2Chep-ph%2F0511329%2Chep-ph%2F0511173%2Chep-ph%2F0511127%2Chep-ph%2F0511066%2Chep-ph%2F0511092%2Chep-ph%2F0511294%2Chep-ph%2F0511225%2Chep-ph%2F0511301%2Chep-ph%2F0511254%2Chep-ph%2F0511347%2Chep-ph%2F0511278%2Chep-ph%2F0511351%2Chep-ph%2F0511027%2Chep-ph%2F0511295%2Chep-ph%2F0511179%2Chep-ph%2F0511321%2Chep-ph%2F0511195%2Chep-ph%2F0511175%2Chep-ph%2F0511071%2Chep-ph%2F0511022%2Chep-ph%2F0511074%2Chep-ph%2F0511255%2Chep-ph%2F0511188%2Chep-ph%2F0511062%2Chep-ph%2F0511354%2Chep-ph%2F0511242%2Chep-ph%2F0511131%2Chep-ph%2F0511109%2Chep-ph%2F0511250%2Chep-ph%2F0511057%2Chep-ph%2F0511144%2Chep-ph%2F0511067%2Chep-ph%2F0511323%2Chep-ph%2F0511068%2Chep-ph%2F0511227%2Chep-ph%2F0511082%2Chep-ph%2F0511150%2Chep-ph%2F0511350%2Chep-ph%2F0511319%2Chep-ph%2F0511008%2Chep-ph%2F0511205%2Chep-ph%2F0511041%2Chep-ph%2F0511080%2Chep-ph%2F0511238%2Chep-ph%2F0511273%2Chep-ph%2F0511007%2Chep-ph%2F0511110&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Probing Composite Gravity in Colliders"}, "summary": "We explore scenarios in which the graviton is not a fundamental degree of\nfreedom at short distances but merely emerges as an effective degree of freedom\nat long distances. In general, the scale of such graviton `compositeness',\nLambda_g, can only be probed by measuring gravitational forces at short\ndistances, which becomes increasingly difficult and eventually impossible as\nthe distance is reduced. Here, however, we point out that if supersymmetry is\nan underlying symmetry, the gravitino can be used as an alternative probe to\nplace a limit on Lambda_g in a collider environment, by demonstrating that\nthere is a model-independent relation, Lambda_g > m_{3/2}. In other words, the\ngravitino knows that gravity is standard at least down to its Compton\nwavelength, so this can also be viewed as a test of general relativity possible\nat very short distances. If composite gravity is found first at some Lambda_g,\nthis would imply a model-independent upper bound on m_{3/2}.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0511253%2Chep-ph%2F0511152%2Chep-ph%2F0511121%2Chep-ph%2F0511214%2Chep-ph%2F0511279%2Chep-ph%2F0511156%2Chep-ph%2F0511240%2Chep-ph%2F0511280%2Chep-ph%2F0511192%2Chep-ph%2F0511313%2Chep-ph%2F0511136%2Chep-ph%2F0511138%2Chep-ph%2F0511271%2Chep-ph%2F0511274%2Chep-ph%2F0511166%2Chep-ph%2F0511196%2Chep-ph%2F0511056%2Chep-ph%2F0511222%2Chep-ph%2F0511106%2Chep-ph%2F0511299%2Chep-ph%2F0511212%2Chep-ph%2F0511060%2Chep-ph%2F0511189%2Chep-ph%2F0511090%2Chep-ph%2F0511234%2Chep-ph%2F0511031%2Chep-ph%2F0511185%2Chep-ph%2F0511137%2Chep-ph%2F0511003%2Chep-ph%2F0511336%2Chep-ph%2F0511051%2Chep-ph%2F0511340%2Chep-ph%2F0511036%2Chep-ph%2F0511020%2Chep-ph%2F0511052%2Chep-ph%2F0511191%2Chep-ph%2F0511307%2Chep-ph%2F0511311%2Chep-ph%2F0511197%2Chep-ph%2F0511076%2Chep-ph%2F0511290%2Chep-ph%2F0511252%2Chep-ph%2F0511190%2Chep-ph%2F0511118%2Chep-ph%2F0511328%2Chep-ph%2F0511235%2Chep-ph%2F0511112%2Chep-ph%2F0511038%2Chep-ph%2F0511151%2Chep-ph%2F0511200%2Chep-ph%2F0511014%2Chep-ph%2F0511108%2Chep-ph%2F0511338%2Chep-ph%2F0511281%2Chep-ph%2F0511329%2Chep-ph%2F0511173%2Chep-ph%2F0511127%2Chep-ph%2F0511066%2Chep-ph%2F0511092%2Chep-ph%2F0511294%2Chep-ph%2F0511225%2Chep-ph%2F0511301%2Chep-ph%2F0511254%2Chep-ph%2F0511347%2Chep-ph%2F0511278%2Chep-ph%2F0511351%2Chep-ph%2F0511027%2Chep-ph%2F0511295%2Chep-ph%2F0511179%2Chep-ph%2F0511321%2Chep-ph%2F0511195%2Chep-ph%2F0511175%2Chep-ph%2F0511071%2Chep-ph%2F0511022%2Chep-ph%2F0511074%2Chep-ph%2F0511255%2Chep-ph%2F0511188%2Chep-ph%2F0511062%2Chep-ph%2F0511354%2Chep-ph%2F0511242%2Chep-ph%2F0511131%2Chep-ph%2F0511109%2Chep-ph%2F0511250%2Chep-ph%2F0511057%2Chep-ph%2F0511144%2Chep-ph%2F0511067%2Chep-ph%2F0511323%2Chep-ph%2F0511068%2Chep-ph%2F0511227%2Chep-ph%2F0511082%2Chep-ph%2F0511150%2Chep-ph%2F0511350%2Chep-ph%2F0511319%2Chep-ph%2F0511008%2Chep-ph%2F0511205%2Chep-ph%2F0511041%2Chep-ph%2F0511080%2Chep-ph%2F0511238%2Chep-ph%2F0511273%2Chep-ph%2F0511007%2Chep-ph%2F0511110&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We explore scenarios in which the graviton is not a fundamental degree of\nfreedom at short distances but merely emerges as an effective degree of freedom\nat long distances. In general, the scale of such graviton `compositeness',\nLambda_g, can only be probed by measuring gravitational forces at short\ndistances, which becomes increasingly difficult and eventually impossible as\nthe distance is reduced. Here, however, we point out that if supersymmetry is\nan underlying symmetry, the gravitino can be used as an alternative probe to\nplace a limit on Lambda_g in a collider environment, by demonstrating that\nthere is a model-independent relation, Lambda_g > m_{3/2}. In other words, the\ngravitino knows that gravity is standard at least down to its Compton\nwavelength, so this can also be viewed as a test of general relativity possible\nat very short distances. If composite gravity is found first at some Lambda_g,\nthis would imply a model-independent upper bound on m_{3/2}."}, "authors": ["Takemichi Okui"], "author_detail": {"name": "Takemichi Okui"}, "author": "Takemichi Okui", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.73.075012", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/hep-ph/0511082v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-ph/0511082v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Some clarifications added. Version published in PRD", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-ph/0511082v2", "affiliation": "Boston U.", "arxiv_url": "http://arxiv.org/abs/hep-ph/0511082v2", "journal_reference": "Phys.Rev. D73 (2006) 075012", "doi": "10.1103/PhysRevD.73.075012", "fulltext": "BUHEP-05-15\nhep-ph/0511082\n\nProbing Composite Gravity in Colliders\nTakemichi Okui\n\narXiv:hep-ph/0511082v2 3 May 2006\n\nPhysics Department, Boston University,\n590 Commonwealth Ave., Boston, MA 02215, U.S.A.\nWe explore scenarios in which the graviton is not a fundamental degree of freedom at short\ndistances but merely emerges as an effective degree of freedom at long distances. In general, the\nscale of such graviton 'compositeness', Λg , can only be probed by measuring gravitational forces\nat short distances, which becomes increasingly difficult and eventually impossible as the distance\nis reduced. Here, however, we point out that if supersymmetry is an underlying symmetry, the\ngravitino can be used as an alternative probe to place a limit on Λg in a collider environment, by\ndemonstrating that there is a model-independent relation, Λg >\n∼ m3/2 . In other words, the gravitino\nknows that gravity is standard at least down to its Compton wavelength, so this can also be viewed\nas a test of general relativity possible at very short distances. If composite gravity is found first at\nsome Λg , this would imply a model-independent upper bound on m3/2 .\nPACS numbers: 12.60.Rc, 04.90.+e\n\nI.\n\nINTRODUCTION\n\nGravity at short distances is a vastly unexplored experimental frontier. It is possible that a deviation or even\na drastic departure from the standard gravitational law\nmay be found in future experiments. On the theoretical\nside, we have string theory which replaces general relativity (GR) at distances shorter than the string scale Ms−1 .\nHowever, since string theory not only modifies gravity\nbut also governs the matter sector, the fact that we have\nnot observed any stringy phenomena in particle physics\nexperiments requires Ms to be higher than at least a few\nTeV.\nIn contrast, for a theory which modifies only gravity, the bound on the scale of such new shortdistance gravitational physics\n\u0001 is significantly lowered to\n(O(100) μm)−1 ≈ O 10−3 eV [1] [2, 3] (also see the review [4]), which is 15 orders of magnitude larger than\nTeV−1 ≈ 10−17 cm! Therefore, there is huge room for\na theory of this kind. This situation is quite intriguing,\nand this is the window that we will explore in this paper.\nThe striking fact about this range between 100 μm\nand 10−17 cm is that we know that matter is described\nby the standard local relativistic quantum field theory\nthere. The standard model (SM) has been tested including nontrivial loop corrections with great precision [5].\nThis point cannot be emphasized too much. It means\nthat a modification of gravity in this range cannot be\nas radical as, for example, abandoning the notion of a\ncontinuum spacetime; when we say the Bohr radius is\n0.509 Å, we know perfectly what we are talking about!\nSo, while we will boldly speak of modifying gravity in this\npaper, we will not mess around with matter; we take it\nfor granted that the matter sector is completely normal,\ni.e., perfectly described by a local relativistic quantum\nfield theory.\nIt should be also mentioned that, in general, changing\nthe laws of gravity does not necessarily mean modifying\nor abandoning GR. For example, if we add n extra spatial\ndimensions with the size L in which only gravitons may\n\npropagate, then the Newton's law changes from 1/r2 to\n1/r2+n for r ≪ L [6]. But gravity in this example is perfectly governed by the conventional GR; it is just living\nin more dimensions than four.\nIn this paper, however, we will explore the possibility that GR is abandoned at short distances in the sense\nthat the graviton is not a fundamental propagating degree of freedom (d.o.f.) in whatever underlying theory,\nbut is merely an effective d.o.f. appropriate at long distances. The scale, which we call Λ−1\ng , corresponding\nto the boundary between 'short-distances' and 'longdistances' could be anywhere shorter than O(100) μm,\nbut as we stated above, we will focus on the range\n−1\n−3\n10−17 cm <\n∼ Λg <\n∼ 100 μm (or 10 eV <\n∼ Λg <\n∼ TeV),\nso that we can exploit the fact that the matter sector is\n'normal'.\nThis includes various possibilities-the graviton may\nbe a bound or solitonic state of the fundamental d.o.f. [7],\nor an extended state in some intrinsically nonlocal theory\n[8, 9], or a sort of hydrodynamic state as in the scenarios\noften dubbed 'emergent relativity' [10]. We will not distinguish these varieties but just focus on their common\nfeature that the graviton is not an elementary propagating d.o.f. in the fundamental theory but just appears\nas an effective d.o.f. in the long-distance description for\nd > Λg−1 . Admittedly not an optimal name, we call it a\ncomposite graviton, where by 'composite' we simply mean\n'not elementary'.\nOne may think such a composite graviton is excluded\nby the theorem by Weinberg and Witten [11]. Actually,\nwhat the Weinberg-Witten (WW) theorem excludes is\nnot just a composite graviton but any massless spin-1 or\n-2 particle, composite or not! Therefore, we must be careful about the assumptions of the theorem; we all know\nQED and QCD which have a massless spin-1 particle,\nand GR which has a massless spin-2 particle. Note that\nthe WW theorem states that if a theory allows the existence of a Lorentz-covariant conserved vector (or symmetric 2nd-rank tensor) current, then the theory cannot\ncontain any massless spin-1 (or spin-2) particle charged\n\n\f2\n\n(a)\n\n(b)\n\n(c)\n\nFIG. 1: Diagrams representing (a) corrections to the cosmological constant, (b) corrections to the gravitational mass, and (c)\ncorrections to the inertial mass. A solid line represents a heavy matter particle, and a double wavy line represents a graviton.\n\nunder this current. QED evades the spin-1 part of the\ntheorem because the photon is not charged under the\ncurrent. QCD evades the spin-1 part of the theorem\nbecause the current is not Lorentz covariant due to its\ndependence on the gluon field which is a 4-vector only\nup to a gauge transformation. Similarly, GR evades the\nspin-2 part of the theorem because the gravitational part\nof the energy-momentum 'tensor' is not really a tensor in\nGR.\nIndeed, there is an explicit example of composite gauge\nbosons. Consider an SU (N ) supersymmetric QCD with\nF flavors where N + 1 < F < 3N/2, with no superpotentials. In the far infrared (IR), this theory is described by\nan IR-free, weakly coupled SU (F − N ) gauge theory [12].\nHowever, these IR gauge bosons are not a subset of the\noriginal ultraviolet (UV) d.o.f.; rather, they are new effective d.o.f. appearing only in the IR description, which\nmicroscopically can be interpreted as solitonic states of\nthe fundamental UV d.o.f. [12]. So this is indeed a concrete example of composite massless gauge bosons, where\nthe SU (F − N ) gauge symmetry emerges at low energies,\nmaking it consistent with the WW theorem.\nClearly, it is desirable to have a similar example for\ngravity. To this goal, Gherghetta, Peloso and Poppitz\nrecently presented a theory in a 5-dimensional Anti-deSitter (AdS) space which is dual to a 4-dimensional conformal field theory in which the conformal symmetry is\ndynamically broken in the IR yielding a spectrum containing a massless spin-2 resonance [13]. To complete\ntheir picture, analyses beyond the quadratic order in action must be performed, especially concerning effects of\nthe stabilization of the AdS space, and if the delicate\nexistence of the massless spin-2 state persists, this will\nbe a solid, concrete example of a theory of a composite graviton. (Note that the graviton in string theory is\ncompletely elementary.)\nIs there any reason or motivation to consider such\ndrastic modification of gravity in this range? Just near\nthe edge of the range, there is a cosmologically interesting scale ≈ (20 μm)−1 ≈ 10−2 eV ≈ (16π 2 ρvac )1/4 ,\nwhere ρvac is the vacuum energy density corresponding\nto the observed acceleration of the expansion of the universe [14, 15, 16]. Kaplan and Sundrum also recently\npointed out that the interesting scale in the context of\n\nthe cosmological constant problem (CCP) may instead\nbe O(10) MeV [17]. Therefore, it is quite interesting to\nask if composite gravity can solve the CCP by identifying\nΛg with, say, 10−2 eV. However, it is not so hard to see\nthe answer entirely depends on the nature of whatever\nunderlying theory of composite gravity.\nIn particular, it appears that the underlying theory\nshould not be a local field theory if one wishes to suppress\nloop corrections to the cosmological constant by abandoning elementary gravitons [18]. The argument goes as\nfollows. Consider three diagrams in FIG. 1. The diagram (1-a) is a correction to the vacuum energy, (1-b)\nis a correction to the gravitational mass, and (1-c) is a\ncorrection to the inertial mass. In a field theory, the loop\nintegral in (1-a) can be suppressed only if the vertex has\na form factor that depends on the loop momentum. Now,\nthe problem is, once (1-a) is suppressed by such a form\nfactor, the correction (1-b) also gets suppressed because\nit has the same form factor, while the correction (1-c)\ndoes not get suppressed because there is no such form\nfactor. This violates the equivalence principle, and we\nneed fine-tuning to restore it. However, for a composite\ngraviton which is not from a local field theory, there does\nnot have to be tension like this, and suppressing loop corrections to the cosmological constant may be consistent\nwith the equivalence principle. But even supposing we\ndid find such a nonlocal underlying theory, it would still\nbe halfway to solving the cosmological constant problem,\nsince there are also tree-level or classical contributions to\nthe vacuum energy from phase transitions which must\nbe somehow suppressed. The door is not shut yet, and\nRef. [9] discusses a toy model for such a nonlocal theory without problems with the equivalence principle or\nthe classical contributions. In the rest of the paper, we\nwill not concern ourselves with the cosmological constant\nproblem any further, and just focus on the physics of\ncomposite gravity.\nSo, supposing that the graviton is not an elementary\nd.o.f. in whatever fundamental theory, how do we see it?\nWithout having a concrete microscopic model of composite gravity, the scale Λg is the only quantity we can\ndiscuss. So far, the lower bound on Λg has been placed\nby measuring gravitational forces between test masses,\nwhich has reached the scale of O(100) μm. But it is\n\n\f3\nclear that such direct measurement will be increasingly\ndifficult and eventually impossible as the distance gets\nreduced. Soon, some other methods must replace it to\nprobe the scale of composite gravity.\nSuch an alternative can arise if there is something that\nis related to the graviton but is more accessible than the\ngraviton at short distances. In general, there is nothing that is related to gravity except the graviton itself.\nHowever, if nature possesses (spontaneously broken) supersymmetry (SUSY), the gravitino precisely satisfies the\ncriteria-it is related to the graviton and may be accessible even in colliders! The introduction of SUSY allows\nus to extract some informations relating the graviton and\nthe gravitino without knowing what the underlying theory is. In fact, we will show that if a gravitino exists,\nit can indeed be used to probe gravity at very short distances where direct measurement of gravitational forces\nis impossible.\nTo keep our discussions as model independent as possible, we would like to have an effective field theory and\nask questions that can be answered by it. This effective\ntheory must have the following features:\n• It must contain a physical scale Λg above which\nthe graviton is no longer an elementary degree of\nfreedom. The scale Λg is not a scale chosen for\nconvenience but corresponds to a physical boundary between two completely different phases of the\ntheory, just like ΛQCD separates two different descriptions with totally different degrees of freedom\n(i.e. partons versus hadrons).\n(Recall \u0001that Λg is a parameter anywhere from\nO 10−3 eV to O(TeV) or whatever cutoff for the\nmatter sector.)\n• Nevertheless, to reproduce all the known gravitational physics, it must include all the matter particles, even the ones heavier than Λg ! And, as emphasized already, we know that the matter sector is\nperfectly described by a local relativistic quantum\nfield theory with a cutoff higher than TeV > Λg .\nBecause of the second feature, we cannot use the usual\neffective field theory formalism in which all the particles\nheavier than Λg are simply integrated out; that would\nfail to capture all the known long-distance gravitational\nphysics such as the 1/r2 law, the perihelion precession,\nthe bending of light, etc.\nTherefore, the first important question is whether or\nnot there exists a sensible effective theory that can deal\nwith this highly asymmetric situation in which gravity\nhas a low cutoff and matter has a high cutoff. This question was answered by R. Sundrum, who developed a formalism, soft graviton effective theory (SGET) [18], which\nassures that we can consistently analyze this asymmetric\nsituation without referring to the underlying theory of\ncomposite gravity. We will review the essential ideas of\nSGET in Sec. II to keep our discussions self-contained.\n\nGiven that there is a consistent effective field theory\nto describe the low-cutoff gravity with the high-cutoff\nheavy matter, there seems nothing wrong to have a gravitino heavier than Λg , since we should be able to treat\nit just as one of heavy matter particles. After all, Λg\nis the scale of graviton's compositeness which does not\nhave to be equal to that of gravitino's once supersymmetry is broken. Also, there is nothing wrong a priori for\na composite particle to be heavier than the scale of its\ncompositeness, like the B-mesons, the hydrogen atom,\netc.\nNevertheless, as we will show in Sec. III, there is a nontrivial remnant of the underlying supersymmetry which\ngives rise to the relation\nm3/2 <\n∼ Λg .\n\n(1)\n\nTherefore, in fact a gravitino-if it exists-knows that\ngravity should be just GR (i.e. the graviton is an elementary d.o.f.) at least down to its Compton wavelength! In\nother words, the discovery of a gravitino and the measurement of its mass offers a short-distance test of GR\nand places a model-independent lower-bound on Λg ! In\nparticular, depending on the value of m3/2 , we may be\nable to completely exclude the possibility of composite\ngravity as a solution to the CCP.\nOn the other hand, if we first discover composite gravity somehow and measure Λg before discovering a gravitino, then this inequality predicts that, once we see a\ngravitino, we will find its mass be lighter than Λg .\nIn Sec. IV A and IV B, we will continue the discussions\nto gain a further understanding of the inequality, followed\nby a brief comment in Sec. IV C on the possibility of\nindependent theoretical tests of the inequality.\nIn order for our prediction to be useful, it is clearly\ncrucial to experimentally convince ourselves that what\nwe are observing is really a gravitino, not a random spin3/2 resonance which may just happen to be there. This\nissue will be discussed in Sec. V. We will then conclude\nin Sec. VI.\nII.\n\nSOFT GRAVITON EFFECTIVE THEORY\n\nAs we have already mentioned, we need to describe\nall experimentally known gravitational physics occurring\namong heavy (≫ Λg ) matter particles, without extrapolating our knowledge of gravity beyond Λg . Soft graviton effective theory (SGET) [18] is designed precisely for\nthis purpose.1 Here, we will review its central concepts\nto keep the discussions self-contained.\n\n1\n\nStrictly speaking, to describe the typical observed gravitational\nphenomena involving gravitational bound states, we should\nswitch to yet another effective field theory to have a transparent\npower-counting scheme appropriate for that purpose. The interested reader should read Ref. [19] which develops such an effective\ntheory, dubbed 'nonrelativistic general relativity' (NRGR).\n\n\f4\nTo start, let us consider gravity only. In this case, the\ntheory takes the form of a familiar effective field theory\nwith the cutoff Λg imposed on the graviton field hμν defined via\ngμν = ημν +\n\nhμν\n.\nMPl\n\n(2)\n\nNamely, the lagrangian is just the usual Ricci scalar term\nplus a whole series of higher-dimensional operators suppressed by powers of Λg :\n\u0012\n\u0013\nR2\nRμν Rμν\n2\nLgrav ∼ MPl\nR+ 2 +\n+\n*\n*\n*\n,\n(3)\nΛg\nΛ2g\nwhere dimensionless O(1) coefficients are suppressed.2\nAs we mentioned earlier, Λg is a physical scale above\nwhich hμν is no longer an elementary degree of freedom.\nNote the scales and kinematic configurations to which\nthis Lgrav is applicable. It is appropriate only for processes where all momentum transfers among the gravitons are less than O(Λg ). For example, it can not be\nused to calculate the cross-section for two highly energetic (E ≫ Λg ) gravitons scattering with a large angle.\nIn fact, we do not even know if such a scattering occurs at all-maybe they would end up with 'jets', like in\nhadron-hadron collisions-who knows? No experiments\nso far have told us what would happen to such processes,\nand performing theoretical calculations requires specifying the full theory valid at distances shorter than Λ−1\ng .\nThe moral here is that a large momentum transfer should\nnot be delivered to a graviton within our effective theory.\nTo also understand that a graviton should not be exchanged to mediate a large momentum transfer, imagine\na theory with a fermion ψ and a scalar φ, and suppose\nwe have verified that a Yukawa coupling φψ̄ψ perfectly\ndescribes the ψψ → ψψ scattering when both ψ's get\nonly very low recoils, i.e. the momentum transfer mediated by φ is very small. But it may be completely wrong\nto use this Yukawa theory to describe the scattering of\ntwo very energetic ψ's by a large angle, corresponding\nto a large momentum transfer mediated by φ. For instance, suppose that the φ is actually a strongly bound\nstate of two new fermions Ψ interacting with ψ via a 4fermion coupling ψ̄ψ ΨΨ. Then, when the ψ's get recoils\nmuch larger than 'ΛQCD ' of this new strong interaction,\nwe must use the 4-fermion theory with Ψ rather than the\nYukawa theory with φ. Here, φ is meant to be the analog\nof the graviton, and therefore, within our effective theory,\na graviton should not be exchanged to mediate a large\nmomentum transfer (≫ Λg ).\n\n2\n\nThe operator Rμνρσ Rμνρσ can be omitted in perturbation theory since it can be expressed as a linear combination of the two\noperators explicitly written in (3) plus a total derivative. Furthermore, in the absence of matter, even those two operators\ncould be removed by field redefinition, but we have kept them in\n(3) because we are interested in including matter. See Refs. [20]\nfor more discussions on these operators.\n\nNow, let us move on and include matter fields. First,\nnote that for a given value of Λg , some elementary particles in the standard model (SM) are too short-lived\n(τ ≪ Λ−1\ng ) to be included in SGET. On the other hand,\nsome composite particles in the SM live long enough\n−1\n(τ ≫ Λ−1\ng ) and also are too small in size (≪ Λg ) for\na soft graviton to recognize that they are composite. For\nexample, if Λg is, say, 10−2 eV, then the proton, the\nhydrogen atoms in 1S and 2P states would be all elementary fields (fermion, scalar, and vector, respectively)\nin SGET.\nSecondly, there are many 'hard processes' among those\nmatter particles involving momentum transfers much\nlarger than Λg . For example, if Λg is, say, 1 eV, then\nthe pair annihilation, e+ e− → γγ, would be a hard process. Since a soft graviton in this case cannot resolve the\nt-channel electron propagator there, we should shrink it\nto a point and express the entire process by a single local\noperator. Also, since soft gravitons in this case cannot\npair-produce an electron and a positron, they are completely unrelated particles from soft gravitons' viewpoint.\nWhereas if Λg is, say, 1 GeV, then there are soft gravitons who can see the t-channel propagator in e+ e− → γγ,\nand electrons and positrons must be described by a single\nfield operator.\nThe general matching procedure for a SGET may be\nbest explained by comparing it with the construction of\na usual effective field theory in which heavy particles are\nsimply integrated out. In the derivation of a usual effective theory, we consider one-light-particle-irreducible\n(1LPI) diagrams; in a 1LPI diagram, all external lines\nrepresent light particles to be kept in the effective theory, and the diagram would not split in two if any one of\ninternal light-particle propagators were cut. We then obtain effective vertices in the effective theory by shrinking\nevery heavy propagator to a point.\nSimilarly, for a SGET, we consider one-nearly-on-shellparticle-irreducible (1NOSPI) diagrams; in a 1NOSPI diagram, all external lines are nearly on-shell, i.e., its deviation from the mass shell is less than O(Λg ), and the\ndiagram would not split in two if any one of internal\nnearly-on-shell propagators were cut. We then obtain effective vertices by shrinking every far-off-shell (i.e. not\nnearly on-shell) propagator to a point. For the technical\ndetail of 'shrinking' or matching procedure, see Ref. [18].\nHaving matched all hard SM processes onto effective\noperators, we are now ready to couple to it the soft graviton described by (3). This step is straightforward-we\njust use general covariance as a guide, just as we do for\nthe conventional general relativity.\nBy construction, SGET respects all fundamental requirements such as the equivalence principle, Lorentz invariance, and unitarity, as long as we stay within its applicability we have discussed above [18]. In particular,\nunitarity holds because all propagators that can be onshell are included in SGET, so it correctly reproduces the\nimaginary part of any amplitude.\n\n\f5\nIII.\n\nTHE COMPOSITE GRAVITINO\n\nNow, let us consider putting a gravitino in the story,\nwith the hope that a gravitino may be more experimentally accessible than gravitons at short distances so we\ncan learn something about gravity. The new ingredient\nin this section is supersymmetry (SUSY) as a spontaneously broken exact underlying symmetry, not only in\nthe matter sector but also in the gravity sector. As mentioned in Sec. I, the introduction of SUSY is a necessary\nand minimal additional ingredient if we wish to have an\nalternative probe for Λg which is as model-independent\nas possible, because without SUSY there is nothing that\nis necessarily related to gravity except the graviton itself.\nSince the graviton is not a fundamental degree of freeeg\ndom at short distances, neither is the gravitino.3 Let Λ\nbe the scale above which the gravitino ceases to be an elementary degree of freedom. Because supersymmetry is\ne g does not have to be equal to Λg . There is also\nbroken, Λ\nanother scale in the theory, the gravitino mass m3/2 . A\npriori, these three scales may come in any order. SGET\nassures that there is a consistent framework to describe\nparticles which are much heavier than Λg , so m3/2 may\ne g is roughly the 'size'\nbe higher or lower than Λg . While Λ\nof the gravitino, there is nothing wrong for a composite\nparticle to be heavier than the inverse of its size, or the\ncompositeness scale. In fact, heavy quark effective theory\n(HQET) [21], which describes a single B-meson system,\ntakes advantage of the fact that the B-meson's compositeness scale ΛQCD is much less than its mass mB ≈ mb .\nIn the case of HQET, the effective theory breaks down\nif a gluon delivers a momentum transfer larger than mb to\nthe b quark. But in general effective theories, the breakdown may happen at an energy much lower than any obvious mass scale in the theory. For example, consider the\neffective field theory of a hydrogen atom in the ground\nstate interacting with soft photons (Eγ ≪ O(eV)). This\neffective theory contains an elementary scalar field (the\nhydrogen atom in the 1S state) and the electromagnetic\nfield, and it correctly accounts for the Rayleigh scattering, explaining why the sky is blue.4 But this effective\ntheory clearly goes wrong if a photon delivers an energy\nof O(eV) or higher, where we should take into account\nthe fact that the scalar is actually not elementary. But\nthis breakdown scale is much less than the scalar mass,\nO(GeV).5,6\n\n3\n\n4\n5\n\n6\n\nOf course, there is also a possibility that a gravitino just does\nnot exist. Here, we assume that a gravitino exists and its lifetime\nis long enough (≫ Λ−1\ng ) to be in the effective theory. We will\ncome back to this caveat in Sec. IV A.\nThe reader not familiar with this cute application of effective\nfield theory may like to read Ref. [22].\nWe get a different breakdown scale if we are interested in capturing a different physics, such as the pair-annihilation of a hydrogen\nand an anti-hydrogen.\nInterestingly, even if we take into account the internal structure,\n\nTherefore, a priori there seems no restriction on possible values for m3/2 . (For further discussions shedding\ndifferent light on this matter, see Sec. IV A.) Nevertheless, we will show below that m3/2 should be bounded\nfrom above by Λg , which is a nontrivial constraint arising from the underlying supersymmetry.\nFirst, we must be clear about what we mean by 'gravitino'. For instance, say, we have found a new spin-3/2\nfermion which has no SU (3) × SU (2) × U (1) interactions\nwith the rest of the standard model. Does it mean we\nhave seen a gravitino? Not necessarily. In order for some\nspin-3/2 fermion to be a candidate for a gravitino, at\nleast it must have-possibly among other things-a coupling to the supersymmetry current of the matter sector;\nin other words, it should be able to convert a matter particle to its superpartner. Without this feature, it would\nbe no different from a random spin-3/2 resonance.\nSo, we begin by supposing that we have seen a spin-3/2\nfermion X emitted in a process of the type Ye → Y + X,\nwhere Ye is the superpartner of a particle Y .\nFor m3/2 ≪ Λg , it is clearly consistent to add the gravitino in the pure gravity effective lagrangian (3), treating it just like the graviton. In other words, we can\nfirst forget about the graviton and gravitino, construct\nthe nearly-on-shell effective lagrangian for matter, then\ncouple the graviton and the gravitino using general covariance and local supersymmetry as a guide, where the\neffects of m3/2 can be systematically included as perturbation.\nFor m3/2 ≫ Λg , we clearly cannot include the gravitino\nin (3) together with the soft graviton, because whenever\nsuch a heavy gravitino is produced or exchanged, it is a\nhard process (≫ Λg ) by definition. But this simply suggests that we should treat it just as one of heavy matter\nfields instead. The only difference seems that unlike all\nthe other matter particles, we do not have a fundamental\ntheory for the composite gravitino, so we cannot calculate the coefficients in SGET lagrangian-that is fine, we\njust leave them as parameters.\nHowever, we have to be careful, because this splitting of the graviton and gravitino into the soft and hard\nsectors may be incompatible with the underlying SUSY,\nwhich pairs them.\nLet us build a gauge-theory analog of our problem.\nFirst, recall our global symmetry structure: the underlying symmetry is the super-Poincaré group, which is spontaneously broken to its subgroup, the Poincaré group. So,\nconsider a global SU (2) symmetry which spontaneously\nbreaks down to a U (1) by a triplet scalar φ = φa σ a getting a VEV φ1,2 = 0 and φ3 = v. (Here, φ is treated\njust as a spurion.) The SU (2) is the analog of the underlying supersymmetry, while the unbroken U (1) is the\n\nthe breakdown scale O(eV) is still much smaller than the lightest\nmass in the theory me ≈ .5 MeV. See Ref. [23] for an illuminating formalism making this breakdown scale manifest.\n\n\f6\nanalog of the unbroken Poincaré symmetry.\nNow, at long distances, the Poincaré group is gauged\nby the existence of the soft graviton which, however, is\nnot a fundamental degree of freedom at short distances.\nSo, correspondingly, we gauge the U (1) at long distances\nby introducing a soft massless vector field Wμ3 , which we\ncall 'toy soft graviton'. And just like the graviton, Wμ3 is\nnot a propagating degree of freedom at short distances.\nFinally, we also need a 'toy\n√ gravitino', i.e., a massive\nvector Wμ+ ≡ (Wμ1 − iWμ2 )/ 2.\nLet us assume mW ≫ Λg which is the case of our interest. We want to write down 'toy SGET' for the toy gravitino. The only property of Wμ+ which possibly makes\nit different from other heavy particles is that it is the\nSU (2)-partner of the toy graviton Wμ3 . So, the question\nis whether there is any constraint on the structure of the\ntoy SGET from the underlying SU (2), or the toy SUSY.\nLet us forget Λg for a moment, and recall how a\nspontaneously broken symmetry leaves its trace in lowenergy physics. To be concrete, consider couplings of\nWμ+ and Wμ3 to a heavy Dirac fermion doublet ψ. (ψ is\nof course the analog of the pair of a SM particle and\nits superpartner.) If we limit to only renormalizable\noperators, all three Wμa must couple to the three currents J aμ = ψ̄σ a γ μ ψ with a single common coupling constant g. This equality is a consequence of the underlying\nSU (2), even though it is broken.\nHowever, once we take into account higher-dimensional\noperators, the coupling of Wμ1,2 to Jμ1,2 does not have to\nbe equal to that of Wμ3 to Jμ3 , because there are higher\ndimensional operators that reduce to these couplings after picking up the VEV. Among such, the one with the\n/ We\nlowest dimension is the dimension-5 operator ψ̄φ Dψ.\ncould go on and analyze this operator, but it turns out\nthat we can learn the same lesson with much less arithmetic from the following dimension-6 operator:\nL6 = −\n\n16π 2 c\n/\nψ̄φ iDφψ\n,\nM2\n\n(4)\n\nwhere we take c ∼ 1 so that M corresponds to the scale\nobtained via 'naive dimensional analysis' (NDA), i.e., the\nscale at which this operator would lead to strong coupling\nif the theory is not replaced with a more fundamental\ntheory by then [24]. After substituting the VEV for φ\nand canonically normalizing the fields, we find that the\ncoupling of Wμ3 stays equal to g as expected from the\nunbroken U (1) gauge invariance, but the coupling of Wμ+\ndoes get modified as\ng −→ g+\nwhere\na≡\n\n1+a\n=\ng,\n1−a\n\n16π 2 v 2 c\n∼\nM2\n\n\u0012\n\n4πv\nM\n\n\u00132\n\n(5)\n\nχe\n\np\n\n0\n\nχe\n\nWμ3\np\n\n0\n\nχe\n\nχe\n\nFIG. 2: The χ\nep χ\ne0 → χ\ne0 χ\nep scattering via the t-channel Wμ3\nexchange.\n\ncould be anywhere between zero and infinity, and there\nwould be no remnants of the underlying SU (2) symmetry.\nThis lesson can be generalized. In general g+ differs\nfrom g as\ng+ = αg ,\n\n(7)\n\nwhere the factor α includes contributions from all the\noperators that can mix with Wμa J aμ . The relation α ≃ 1\nholds as long as v ≪ M/4π, but for v ∼ M/4π, all those\noperators would contribute to α equally in magnitude,\nand consequently α could be anywhere between zero and\ninfinity.\nNow, let us go back to the case of our interest and take\nΛg into account. Let us write the doublet ψ as\n\u0012 \u0013\nχ\ne\n,\n(8)\nψ=\nχ\nand, for definiteness, take χ\ne to be heavier than χ with\nthe mass difference larger than mW so that χ\ne can decay\ninto χ and W + . Clearly, this is the analog of a sparticle\ndecaying into its SM partner and a gravitino.\nOnce we have seen a toy gravitino produced via this\ndecay, g+ must be nonzero. In the rest frame of the\ndecaying χ\ne, this decay is caused by the operator\n+\nHint ⊃ g+ W−p\nχp χ\ne0 ,\n\n(9)\n\nwhere the irrelevant indices, bars and daggers are suppressed,\nwhile the important quantity here is |p| =\nq\n\nEχ2 − m2χ where Eχ is the energy of the outgoing χ\ngiven by\nEχ =\n\nm2χe + m2χ − m2W\n2mχe\n\n.\n\n(10)\n\nNow, if g is also nonzero, there would also be a term\n.\n\n(6)\n\nTherefore, the equality of the Wμ3 and Wμ+ couplings no\nlonger holds. Especially, if v is O(M/4π), then g+ /g\n\n3\nHint ⊃ g W−p\nχ\nep χ\ne0 ,\n\n(11)\n\nwith the same p. The problem is that, at the second order in perturbation theory, this operator could cause the\nprocess χ\nep χ\ne0 → χ\ne0 χ\nep via the t-channel Wμ3 exchange\n\n\f7\n(FIG. 2). Note that the momentum transfer Q2 mediated\nby the Wμ3 is given by\n\u00112\n\u0010q\np2 + m2χe − mχe + p2\n!\ns\np2\n2\n= 2mχe\n1+ 2 −1 .\nmχe\n\nQ2 = −\n\nFrom |p| =\n\n(12)\n\nq\nEχ2 − m2χ and (10), we see that for generic\n\nmχ and mW , we have |Q| ∼ mχe > mW ≫ Λg , which is\na hard momentum transfer.7 However, as discussed in\nSec. II, a graviton cannot be exchanged to mediate such\na large momentum transfer within SGET. Therefore, the\noperator (11) should not be present in the effective theory.\nTherefore, to decouple the operator (11), we must take\nthe limit g → 0 while keeping g+ fixed to a finite value.\nThen the relation (7) requires α → ∞, which, however, is\npossible only if v ∼ M/4π, as noted before. In this limit,\nall the higher-dimensional operators that can contribute\nto g+ do contribute equally in magnitude, while all the\nother interactions have the full NDA strength. Furthermore, having taken this limit, we have decoupled the soft\nWμ3 as well, so we have to couple it back to the theory.\nThis can be easily done by using the U (1) invariance,\nbut now the coupling of this U (1)-let us call it gsoft -is\ncompletely arbitrary, with no relation to g+ !\nTherefore, although we cannot perform any quantitatively reliable analysis beyond estimates8 due to v ∼\nM/4π, this is good enough to give us the following qualitative understanding of what Wμ+ is like. First, its coupling to the SU (2) current, g+ , is not related at all to the\ncoupling of the soft Wμ3 to the U (1) current, gsoft . Second, it has all kinds of additional interactions, all with\nthe full NDA strength. Because of these two features,\nWμ+ should be viewed just as a random spin-1 resonance,\nrather than the 'SU (2)-partner' of Wμ3 .\nRecalling the dictionary of our analogy, translating this\ngauge-theory lesson back to gravity is straightforward.\n(The only slight mismatch in the dictionary, which is not\nat all essential for us, appears in the 4π counting for\nbroken SUSY, where the relation v ∼ M/4π should be\ntranslated as F ∼ M 2 /4π where F is the decay constant\nof the goldstino, or the square of the SUSY breaking scale\n[25].) Therefore, we have found\n• If m3/2 ≪ Λg , it is consistent for the gravitino to be\njust 'canonical', with all the properties we expect\n\n7\n\n8\n\nThe exception occurs in 'highly degenerate' cases: (a) either one\nof χ and W + is much heavier than the other and almost degenerate with χ\ne so that |p| ≪ Λg or (b) mχ and mW are of the same\norder but they add up to nearly mχe so that |p| ≪ Λg . Although\nthese case are logically possible, it looks too coincidental, so we\nwill not pursue this caveat any further.\nWe have also neglected the effects of running.\n\nfrom the standard supergravity, except for the fact\nthat the gravitino-like the graviton-is not an elementary degree of freedom at short distances. In\nother words, as long as we avoid processes where\na gravitino receives or mediates a large momentum\ntransfer, the gravitino can behave normally.\n• If m3/2 ≫ Λg , this 'gravitino' is not really a gravitino, because the coupling of this 'gravitino' to\na SM particle and its superpartner can have any\nvalue, with no relation to the 'canonical' strength,\nand we also expect this 'gravitino' to have a whole\nseries of other couplings, all equally important with\nthe full NDA strength. In short, it behaves just like\na random spin-3/2 resonance with no relation to the\ngravity sector.\nHereafter, to distinguish these cases, we will use the term\ngravitino only to refer to the first case, while we will call\nthe second case pseudo-gravitino.\nWe postpone the issue of experimentally distinguishing a gravitino from a pseudo-gravitino until Sec. V. At\nthis point, let us just assume that the distinction can\nbe made. Then, we have found the model-independent\nrelation between the gravitino mass and the composite\ngravity scale:\nm3/2 <\n∼ Λg .\n\n(13)\n\nBy definition, gravity is described by GR at distances\nlonger than Λ−1\ng , because GR is the only consistent theory once we have a graviton coupled to matter described\nby a local relativistic quantum field theory [26]. (Note\nthat we could not have said this if we had not restricted\nΛg below TeV which assures the matter sector is 'normal'.) Therefore, the relation (13) means that the existence of a gravitino guarantees that GR is correct at least\ndown to its Compton wavelength! Hence, this is a shortdistance test of GR, which in turn places a lower bound\non Λg . On the other hand, the relation (13) implies that\nif we find composite gravity first at some Λg , then we will\nnot discover a gravitino above the scale Λg -at best we\nmay just see a pseudo-gravitino which is nothing but a\nrandom spin-3/2 state.\nIV.\nA.\n\nDISCUSSIONS\n\nShould a Gravitino Exist?\n\nThe quick answer is, we don't know. There is no strong\nargument indicating whether it should or shouldn't. We\nwill present below several arguments, not to answer this\nquestion but to shed different light and gain more insights\non the result of Sec. III.\nImagine√a huge hierarchy\n√ between the SUSY breaking scale F and Λg , as F ≫ Λg . Above Λg , the\ngravity sector is described by some exotic degrees of\nfreedom-which may not even be field-theoretic-with\n\n\f8\nno gravitons. Here, there is no point of asking what\nthe superpartner of the graviton is, because the graviton is not even in the theory. When we go below Λg ,\nthe graviton emerges, but we do not expect that a gravitino appears there, because from the usual effective-fieldtheoretic viewpoint, the dynamics at Λg that generates\nthe graviton should not 'know' about SUSY which is broken way above Λg .\nThis argument is too naive, however. As we will argue\nbelow, not only is it possible that a pseudo-gravitino may\nexist, but also even an honest gravitino with all the (approximately) canonical properties may exist! Consider\na supersymmetric SU (3) gauge theory with two flavors\nwith no superpotentials, and suppose that SUSY is broken with the soft masses much larger than ΛQCD . For\nsimplicity and definiteness, also assume that the squark\nmasses are all degenerate, respecting the flavor symmetry, and that the gluino is much heavier than the squarks.\nThis theory possesses an R parity under which all the\nquarks and gluon are even while all the squarks and\ngluino are odd. Hence, the squarks are stable, and there\nare stable fermionic meson-like bound states ('mesinos')\nwith one quark and one anti-squark.9\nSo, apparently, the mesons have superpartners, the\nmesinos. But look at other particles; for example, there\nis no 'sproton' or 'sneutron', because they would decay\ntoo quickly to form a bound state. In fact, most particles lack their superpartner, so the interactions between\nthe meson-mesino sector and the rest are completely nonsupersymmetric. Therefore, if these non-supersymmetric\ncouplings are significant, there is no sense in which the\nmesinos are the superpartners of the mesons, except for\nthe quantum numbers. In other words, the mesinos in\nthis case are just analogous to our pseudo-gravitino.\nHowever, there is also a logical possibility that the couplings between the meson-mesino sector and the rest are\nsufficiently small for some reason. Then, it is at least consistent for the mesinos to retain the properties expected\nfrom supersymmetry.10 A similar situation could happen\nto a gravitino. For example, if Λg is, say, 10−2 eV, then\nit could be perfectly consistent for a gravitino with, say,\nm3/2 = 10−3 eV to carry all the (approximately) canonical couplings we expect from supergravity-as long as\nthe gravitino does not receive or mediate\n√ a momentum\ntransfer larger than Λg -even though F here would be\n∼ TeV which is way above Λg . To sum up, from the standard effective-field-theoretic view, there seems no prefer-\n\n9\n10\n\nWe are assuming that these mesinos are the lightest among the\nhadrons containing superparticles.\nNote that this is exactly what is happening in typical weakscale SUSY models in which the visible-sector interactions at\nthe weak scale are taken to be (approximately) supersymmetric,\neven though the actual SUSY breaking scale is often as high as\n1011 GeV. This is consistent because the interaction that transmits SUSY breaking to the visible sector is assumed to be sufficiently feeble.\n\nence among 'nothing', 'a pseudo-gravitino', and 'a (real)\ngravitino'.\nTo gain more insight, let us consider the limit in the\nopposite order. This time we start with a finite Λg but\nno SUSY breaking (F = 0).11 So we start with a degenerate pair of massless graviton and gravitino. This\ngravitino is of course exactly what we expect from supergravity, as long as we avoid momentum transfers larger\nthan Λg . As we raise F , the gravitino mass goes up according to the usual relation m3/2 ∼ F/MPl , as long\nas m3/2 ≪ Λg . If we keep raising F , m3/2 eventually\nhits Λg , beyond which the gravitino may start looking\nstrange. (The result of Sec. III says it will start looking\nstrange, but here let us pretend that we did not know\nSec. III.) Then, in particular we no longer know how\nm3/2 should vary as a function of F . (We will come back\nto this issue in detail in Sec. IV B.) Here, let us suppose that it still keeps going up, although not necessarily\nobeying the usual linear relation. Will this 'gravitino'\neventually disappear? Note that it will disappear from\nSGET if its lifetime becomes shorter than Λ−1\ng . Naively,\nwe expect that the lifetime should be quite long because\nthe coupling 1/MPl is extremely weak, so it would stay\nin the effective theory even if m3/2 is as high as the weak\nscale. But this 'gravitino' may have unusual interactions,\nand there are probably many new states around E ∼ Λg\ninto which the 'gravitino' could decay. So the lifetime\nmay or may not be quick enough for the 'gravitino' to\ndisappear from SGET. We need the underlying theory to\nsee which way it goes.\nFinally, it is also conceivable that m3/2 'saturates' at\nΛg as we raise F . We would expect this if there is an\nexotic state at E ∼ Λg which can mix with the gravitino.\nThen, by the 'no-level-crossing' theorem, m3/2 cannot go\nup any further, and the 'gravitino' becomes a mixture of\nthe original gravitino and this exotic state. Therefore, in\nthis case, we expect a pseudo-gravitino with m3/2 ∼ Λg .\nTo summarize, qualitative arguments seems completely inconclusive about the nature and fate of a gravitino. The result of Sec. III is therefore quite nontrivial.\nB.\n\nRelation of m3/2 to SUSY Breaking Scale\n\nHere, we comment on the validity of the famous relation between the gravitino mass and the SUSY breaking\nscale:\nF\n.\n(14)\nm3/2 = √\n3MPl\nIn the pseudo-gravitino case (m3/2 ≫ Λg ), this usual relation has no reason to be true. Clearly, we cannot use\n\n11\n\nAn extreme but trivial limit of this case is to take Λg >\n∼√MPl ,\ni.e., the limit of an elementary graviton. Note that for any F <\n∼\nMPl , the gravitino is a normal gravitino, and the inequality (13)\nis trivially satisfied since m3/2 ∼ F/MPl <\n∼ MPl <\n∼ Λg .\n\n\f9\nthe supergravity formalism to derive it, because supergravity contains general relativity which is not applicable for E ≫ Λg in our scenario. But more fundamentally,\nrecall that this relation is just a consequence of the equivalence between the goldstino and the longitudinal component of the gravitino at high energies (E3/2 ≫ m3/2 ).\nUsually, we derive the relation by demanding that the\namplitude of exchanging a gravitino between two supersymmetry currents be equal to that of exchanging\na goldstino, in the global SUSY limit (MPl → ∞) for\nE3/2 ≫ m3/2 . However, in the pseudo-gravitino case, it\nhas a different coupling to the supersymmetry current as\nwell as a host of additional interactions. Hence, the formula (14) does not hold for a pseudo-gravitino. In other\nwords, since the pseudo-gravitino does not eat the goldstino by exactly the right amount, the SUSY currents\nmust exchange something else to match the goldstinoexchange amplitude. But this 'something else' must be\namong the new exotic states in the full theory of gravity,\nwhich we have no idea about. (If we had the underlying theory, we could subtract the exotic contribution\nfrom the amplitude and figure out how the formula (14)\nshould get modified.)\nOn the other hand, for m3/2 ≪ Λg , we can apply the\nderivation for m3/2 ≪ E3/2 ≪ Λg , and obtain the usual\nrelation (14), assuming that the gravitino has the standard 1/MPl coupling to the SUSY current, which is at\nleast a consistent thing to do as we discussed in Sec. III.\n\nC.\n\nTheoretical Tests\n\nIt is certainly desirable to confirm the result of Sec. III\nby a theoretical argument that has a firmer foundation.\nRecall the concrete example of composite gauge bosons\nmentioned in Sec. I: the SU (N ) supersymmetric QCD\nwith F flavors, where N + 1 < F < 3N/2. Below the\nΛQCD of the SU (N ), this theory is described in terms of\nan IR-free SU (F − N ) gauge theory whose gauge bosons\nare composites of the original degrees of freedom [12].\nNow let us deform the theory such that the low-energy\ngauge group SU (F −N ) gets spontaneously broken down\nto SU (M ) where M < F − N . If we apply the argument\nof Sec. III to this theory, we predict that the massive\nW bosons, with all the 'normal' couplings retained, cannot be heavier than ΛQCD . W bosons heavier than ΛQCD\nmay exist but they should behave like random spin-1 resonances, rather than as the 'SU (F − N )-partners' of the\nSU (M ) gauge bosons. While it sounds plausible, the\ncurrently available theoretical wisdoms are not powerful\nenough to definitively confirm the statement.\nThis SUSY QCD example also illustrates how extremely nontrivial it is to have a composite graviton coupled to elementary matter particles. In the case of the\nSUSY QCD model, this corresponds to the composite\nSU (F − N ) gauge bosons coupled to elementary quarks\nthat are point-like even far above ΛQCD ! This is clearly\na very difficult, if possible, thing to do. In the AdS com-\n\nposite graviton model of Ref. [13], the graviton wavefunction is highly peaked toward the IR brane, but there is an\nexponentially suppressed tail overlapping the UV brane\nwhere the SM fields live, which can be thought of as an\nexplanation for the weakness of gravity. Adding supersymmetry to their setup to study the gravitino properties\nis saved for future work.\n\nV.\n\nPRECISION GRAVITINO STUDY AND\nPROBING Λg IN COLLIDERS\n\nClearly, the most important quantity in any composite graviton scenario is the scale Λg . As we mentioned\nalready in Sec. III, in order to probe the scale Λg , it is\ncrucial to experimentally distinguish a gravitino from a\npseudo-gravitino.\nUnfortunately, if the results of such 'precision gravitino\nstudy' turn out that what we have seen is actually a\npseudo-gravitino, this will not be a sufficient evidence\nthat gravity is modified at short distances. For example,\na pseudo-gravitino is also present in a scenario where\nsupersymmetry is not a fundamental symmetry at high\nenergies but merely an (approximate) accidental global\nsymmetry of the matter sector at low energies [27]. In\nthis scenario, the gravity sector is just the conventional\nGR (with no supersymmetry). Therefore, for a pseudogravitino, we need the underlying theory to derive more\nspecific predictions to be tested.\nOn the other hand, if we can convince ourselves that\nit is not a pseudo-gravitino, then we can put a modelindependent lower bound on Λg , as Λg >\n∼ m3/2 ! Interestingly, as we will see shortly, in precisely the regime that\nthe direct gravity measurement between test masses is\nimpossible, the measurement of m3/2 becomes possible,\nso the precision gravitino study can potentially exclude\ncomposite graviton scenarios dramatically at very short\ndistances.\nSince it is impossible to see a gravitino ψ3/2 directly,\nthe only hope to learn something about it lies in the case\ne and X can be precisely studied in the decay\nwhere both X\ne\nX → X + ψ3/2 . This means that the decay must be suffie and X both must be visible. This\nciently slow and that X\ne is the next-to-lightest suwill indeed be realized if the X\npersymmetric particle (NLSP) (the lightest (LSP) being\nthe gravitino) and is electrically charged and/or stronglyinteracting. In such a case, due to the very weak coupling\ne to the gravitino, there will be a long, highly visible\nof X\ntrack of the NLSP inside a collider detector before it decays [28], unless ψ3/2 is too light. It is even possible that\nthe NLSP stops in the detector if it is strongly interacting\nor produced sufficiently slow. In such circumstances, the\nmomenta and energies of the NLSP and its SM partner\nas well as the NLSP lifetime should be measurable, which\nin turn allows us to deduce the mass and the coupling of\nthe gravitino to see whether it is a pseudo-gravitino or\nnot.\n\n\f10\nThis 'gravitino LSP with charged NLSP' scenario has\nalready been a great interest in SUSY phenomenology,\nespecially in the context of gauge-mediated SUSY models\ne is often a scalar tau\nwhere the gravitino is the LSP and X\ne have been\nlepton [29, 30, 31]. Note that once X and X\nobserved, the gravitino mass can be simply determined\nfrom rewriting (10) :\n\u0010\n\u00111/2\nm3/2 = m2X + m2Xe − 2mXe EX\n,\n\n(15)\n\nwhere EX is the energy of the X measured in the rest\ne If X\ne stops inside a detector, EX can be\nframe of the X.\ndirectly measured. Even if it does not, since both the X\ne are highly visible in the detector, the measurement\nand X\nof their energies and the relative angle (the 'kink' in the\ntrack) can determine EX .\ne lifetime\nOn the other hand, the measurement of the X\ngives us the gravitino's coupling. If what we are seeing\nis not a pseudo-gravitino but is a real one, then the coupling should go as 1/MPl times the polarization factor\nE3/2 /m3/2 for the helicity-±1/2 components, so the rate\nis given by\nΓXe =\n\nm5Xe\n\n2 m2\n48πMPl\n3/2\n\u00132 \u0010\n\u0012\nmXe \u00115\neV\n≈ (20 μm)−1\nm3/2\n100 GeV\n\u00132 \u0010\n\u0012\nmXe \u00115\nGeV\n≈ (20 hours)−1\nm3/2\n100 GeV\n\n(16)\n\nwhere we have dropped mX and m3/2 for simplicity. (The\nhelicity-±3/2 components have no E3/2 /m3/2 enhancement and thus have been neglected.) The consistency\nof m3/2 determined from this formula with the value\nextracted from pure kinematics (15) will be an almost\nconvincing evidence that the gravitino is not a pseudo,\nbecause it would be such a coincidence if the pseudogravitino coupling, which could be any size, just happened to be 1/MPl.12 Ref. [30] proposes to go even further, to test the gravitino's spin by using the angular\ndistribution in the 3-body decay τ̃ → τ + γ + ψ3/2 .\nNow, it is probably extremely hard to directly measure\nthe gravitational force between test masses for distances\nsmaller than the micron scale which would correspond to\n−1\nΛg <\n∼ 10 eV. Let us see whether the precision gravitino study can be used to place a bound on Λg beyond\nthis limitation. Taking mXe = 100 GeV, the rate (16)\ntells us that for m3/2 = 10−1 eV, the NLSP will decay\nwithin O(1) μm, since the relativistic γ factor for the\n\n12\n\nNote that this agreement between the two measurements of m3/2\nis equivalent to checking if the gravitino has really eaten the\ngoldstino as it should if it is not a pseudo.\n\nNLSP cannot be larger than O(10) in a TeV-scale collider. This is unfortunately too short to be seen. Demanding that the NLSP must fly at least a few 100 μm\nto be clearly observed by a micro vertex detector, we\nneed m3/2 to be at least a few eV. However, for such low\nvalues for m3/2 , the formula (15) requires mX , mXe and\nEX to be measured with unrealistically high precision.\nThe problem is, to determine a small m3/2 from (15),\nwe have to nearly cancel two large terms and take the\nsquare-root. Therefore, the lowest possible value for Λg\nthat can be probed is actually limited by the accuracy\nin measuring these parameters rather than the minimal\nNLSP flight length that a detector can resolve. For example, if we are anticipating m3/2 of order 1 GeV and if\nwe are content with determining m3/2 only up to a factor of a few, then for mXe ≈ 100 GeV (neglecting mX for\nsimplicity), we would need to measure mXe and EX with\nthe accuracy of ±10 MeV. Therefore, measuring m3/2\nof O(1) GeV event-by-event is unrealistic, so it must be\ndone statistically. Taking the uncertainty in the individual EX measurement\nto be O(1) GeV, we need to ob\u0001\nserve O 104 NLSP decays to have enough statistics for\nmXe ≈ 100 GeV and m3/2 ∼ GeV.\ne lifetime is\nAlso, note that for m3/2 ∼ GeV, the X\nabout a few hours to a week, so the NLSPs must be collected and stored to do the measurement. Such a possibile = τ̃ has been extensively studied in Refs. [31],\nity for X\n\u0001\n4\nand the\nbottom\nline\nis\nthat\ncollecting\nO\n10\nor even\n\u0001\n5\nO 10 NLSPs and observing their decays should be possible in the LHC and/or the ILC, although the prospect\ndepends on other SUSY parameters.\nThose analyses also conclude that we may be able to\ngo up to m3/2 of O(100) GeV. Therefore, it is not too\noptimistic to expect that precision gravitino study may\nbe able to probe the scale Λg between GeV and 100 GeV.\nWhile this is still quite challenging (and we also have to\nbe lucky with the SUSY spectrum), note that this is a\nregime where direct measurement of gravitational forces\nis absolutely impossible, so precision gravitino study is\nthe only available probe for composite gravity.\nVI.\n\nCONCLUSIONS\n\nIn this paper, we have considered 'composite gravity',\nnamely, the possibility that the graviton is not an elementary propagating degree of freedom at distances shorter\nthan Λ−1\ng . We pointed out that such a scenario is not\nnecessarily forbidden by the Weinberg-Witten theorem.\nAnother important assumption we made is that the matter sector is completely described by a local quantum field\ntheory, which is true for Λg between the current experimental limit ∼ 10−3 eV, and ∼ TeV or whatever cutoff\nfor the matter sector. To perform a model-independent,\neffective-field-theoretic analysis, it is necessary to reconcile 'elementary matter with a high cutoff' and 'composite gravity with a low cutoff', and for this purpose we\nhave utilized soft graviton effective theory (SGET) by\n\n\f11\nSundrum.\nIn general, the only way to place a lower limit on the\nscale Λg is by a null result in experiments seeking a deviation from the standard 1/r2 law between macroscopic\ntest masses. This method becomes increasingly difficult\nas the distance gets reduced. Therefore, it is desirable\nto have an alternative probe. The problem is, however,\nthat in general there is nothing related to gravity except\nthe graviton itself, so there is no other way to probe Λg\nwithout using gravity.\nHowever, we noted that if there is an underlying supersymmetry, it may lead to the existence of a gravitino,\nwhich is related to gravity but easier to observe than the\ngraviton. Applying the SGET framework to the gravitino, we have shown the relation, Λg >\n∼ m3/2 , i.e., the\ngraviton remains an elementary degree of freedom at least\ndown to the gravitino's Compton wavelength. In other\nwords, we can use a gravitino to test general relativity at\nshort distances-once we see a gravitino, we know that\nGR is correct at least up to m3/2 , which in turn places\na lower bound on Λg ! This can have a significant impact\non the possibility of composite graviton as a solution to\nthe cosmological constant problem. For example, if we\nfind m3/2 to be, say, 1 GeV, the door will be completely\nshut.\nOn the other hand, if we first find gravity compositeness and measure Λg , then our inequality says that we\nwill not discover a gravitino above the scale Λg -at best\n\nwe may just see some random spin-3/2 fermion with completely random couplings, nothing to do with gravity.\nTo utilize this inequality to place a limit on Λg , it is\ncrucial to experimentally convince ourselves that what\nwe are looking at is really a gravitino, rather than a random spin-3/2 fermion. In the future colliders such as the\nLHC and ILC, the prospect of being able to do so seems\nquite bright for the range GeV <\n∼ m3/2 <\n∼ 100 GeV, corresponding to probing Λg in the range between 10−14 cm\nand 10−16 cm. Therefore, precision gravitino study can\nindeed be an alternative model-independent probe for Λg\nor a test of general relativity, in a regime where direct\nmeasurement of gravitational force is absolutely impossible.\n\n[1] C. D. Hoyle, D. J. Kapner, B. R. Heckel, E. G. Adelberger, J. H. Gundlach, U. Schmidt and H. E. Swanson,\nPhys. Rev. D 70, 042004 (2004) [arXiv:hep-ph/0405262].\n[2] J. C. Long, H. W. Chan, A. B. Churnside, E. A. Gulbis,\nM. C. M. Varney and J. C. Price, Nature 421, 922 (2003).\n[3] S. J. Smullin, A. A. Geraci, D. M. Weld, J. Chiaverini,\nS. Holmes and A. Kapitulnik, arXiv:hep-ph/0508204.\n[4] E. G. Adelberger, B. R. Heckel and A. E. Nelson, Ann. Rev. Nucl. Part. Sci. 53, 77 (2003)\n[arXiv:hep-ph/0307284].\n[5] The ALEPH, DELPHI, L3, OPAL, SLD Collaborations, the LEP Electroweak Working Group, and\nthe SLD Electroweak and Heavy Flavour Groups\narXiv:hep-ex/0509008;\nS. Eidelman et al. [Particle Data Group], Phys. Lett. B\n592 (2004) 1;\n[6] N. Arkani-Hamed, S. Dimopoulos and G. R. Dvali, Phys.\nLett. B 429, 263 (1998) [arXiv:hep-ph/9803315].\n[7] R.\nSundrum,\nJHEP\n9907,\n001\n(1999)\n[arXiv:hep-ph/9708329].\n[8] J. W. Moffat, arXiv:hep-ph/0102088.\n[9] R. Sundrum, Nucl. Phys. B 690, 302 (2004)\n[arXiv:hep-th/0310251].\n[10] W. G. Unruh, Phys. Rev. Lett. 46, 1351 (1981);\nM. Visser, arXiv:gr-qc/9311028;\nL. J. Garay, J. R. Anglin, J. I. Cirac and P. Zoller, Phys.\nRev. Lett. 85, 4643 (2000) [arXiv:gr-qc/0002015];\nG. Chapline, E. Hohlfeld, R. B. Laughlin and\nD. I. Santiago, Int. J. Mod. Phys. A 18, 3587 (2003)\n\n[arXiv:gr-qc/0012094].\n[11] S. Weinberg and E. Witten, Phys. Lett. B 96, 59 (1980).\n[12] N. Seiberg, Nucl. Phys. B 435, 129 (1995)\n[arXiv:hep-th/9411149].\n[13] T. Gherghetta,\nM. Peloso and E. Poppitz,\narXiv:hep-th/0507245.\n[14] S. Perlmutter et al. [Supernova Cosmology Project\nCollaboration], Astrophys. J. 517, 565 (1999)\n[arXiv:astro-ph/9812133];\nA. G. Riess et al. [Supernova Search Team\nCollaboration], Astrophys. J. 607, 665 (2004)\n[arXiv:astro-ph/0402512].\n[15] D. N. Spergel et al. [WMAP Collaboration], Astrophys.\nJ. Suppl. 148, 175 (2003) [arXiv:astro-ph/0302209];\nP. de Bernardis et al. [Boomerang Collaboration], Nature\n404, 955 (2000) [arXiv:astro-ph/0004404];\nA. Balbi et al., Astrophys. J. 545, L1 (2000) [Erratumibid. 558, L145 (2001)] [arXiv:astro-ph/0005124].\n[16] M. Tegmark et al. [SDSS Collaboration], Phys. Rev. D\n69, 103501 (2004) [arXiv:astro-ph/0310723];\nJ. A. Peacock et al., Nature 410 (2001) 169\n[arXiv:astro-ph/0103143].\n[17] D. E. Kaplan and R. Sundrum, arXiv:hep-th/0505265.\n[18] R. Sundrum, Phys. Rev. D 69, 044014 (2004)\n[arXiv:hep-th/0306106].\n[19] W.\nD.\nGoldberger\nand\nI.\nZ.\nRothstein,\narXiv:hep-th/0409156.\n[20] J. F. Donoghue, arXiv:gr-qc/9512024;\nC. P. Burgess, Living Rev. Rel. 7, 5 (2004)\n\nAcknowledgments\n\nI thank Zackaria Chacko, Markus Luty, Yasunori Nomura, Matt Schwartz, Raman Sundrum, and Mithat\nÜnsal for discussions and comments on the manuscript.\nI also thank Spencer Chang, Hitoshi Murayama, and\nMichael Peskin for conversations. In addition, I thank\nthe Aspen Center for Physics where a portion of this\nwork was conducted. This work was supported by DOE\ngrant DE-FG02-91ER40676.\n\n\f12\n[arXiv:gr-qc/0311082].\n[21] H. Georgi, Phys. Lett. B 240, 447 (1990).\n[22] D. B. Kaplan, arXiv:nucl-th/9506035.\n[23] M. Luke and A. V. Manohar, Phys. Rev. D 55, 4129\n(1997) [arXiv:hep-ph/9610534].\n[24] A. Manohar and H. Georgi, Nucl. Phys. B 234, 189\n(1984);\nH. Georgi, \"Weak Interactions And Modern Particle Theory,\";\nH. Georgi and L. Randall, Nucl. Phys. B 276, 241 (1986).\n[25] M. A. Luty, Phys. Rev. D 57, 1531 (1998)\n[arXiv:hep-ph/9706235];\nA. G. Cohen, D. B. Kaplan and A. E. Nelson, Phys. Lett.\nB 412, 301 (1997) [arXiv:hep-ph/9706275].\n[26] S. Weinberg, Phys. Rev. 138, B988 (1965).\n\n[27] H. S. Goh, M. A. Luty and S. P. Ng, JHEP 0501, 040\n(2005) [arXiv:hep-th/0309103].\n[28] M. Drees and X. Tata, Phys. Lett. B 252, 695 (1990).\n[29] S. Dimopoulos, M. Dine, S. Raby and S. Thomas, Phys.\nRev. Lett. 76, 3494 (1996) [arXiv:hep-ph/9601367].\n[30] W. Buchmuller, K. Hamaguchi, M. Ratz and\nT. Yanagida, Phys. Lett. B 588, 90 (2004)\n[arXiv:hep-ph/0402179].\n[31] K. Hamaguchi, Y. Kuno, T. Nakaya and M. M. Nojiri,\nPhys. Rev. D 70, 115007 (2004) [arXiv:hep-ph/0409248];\nJ. L. Feng and B. T. Smith, Phys. Rev. D 71,\n015004 (2005) [Erratum-ibid. D 71, 0109904 (2005)]\n[arXiv:hep-ph/0409278].\n\n\f"}