{"id": "http://arxiv.org/abs/hep-ph/0409209v1", "guidislink": true, "updated": "2004-09-17T08:13:05Z", "updated_parsed": [2004, 9, 17, 8, 13, 5, 4, 261, 0], "published": "2004-09-17T08:13:05Z", "published_parsed": [2004, 9, 17, 8, 13, 5, 4, 261, 0], "title": "Sudakov logs and power corrections for selected event shapes", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0409344%2Chep-ph%2F0409103%2Chep-ph%2F0409011%2Chep-ph%2F0409026%2Chep-ph%2F0409263%2Chep-ph%2F0409289%2Chep-ph%2F0409218%2Chep-ph%2F0409163%2Chep-ph%2F0409341%2Chep-ph%2F0409202%2Chep-ph%2F0409012%2Chep-ph%2F0409154%2Chep-ph%2F0409230%2Chep-ph%2F0409253%2Chep-ph%2F0409109%2Chep-ph%2F0409245%2Chep-ph%2F0409055%2Chep-ph%2F0409194%2Chep-ph%2F0409161%2Chep-ph%2F0409209%2Chep-ph%2F0409360%2Chep-ph%2F0409231%2Chep-ph%2F0409296%2Chep-ph%2F0409013%2Chep-ph%2F0409068%2Chep-ph%2F0409061%2Chep-ph%2F0409079%2Chep-ph%2F0409126%2Chep-ph%2F0409349%2Chep-ph%2F0409351%2Chep-ph%2F0409091%2Chep-ph%2F0409259%2Chep-ph%2F0409277%2Chep-ph%2F0409332%2Chep-ph%2F0409241%2Chep-ph%2F0409211%2Chep-ph%2F0409212%2Chep-ph%2F0409265%2Chep-ph%2F0409193%2Chep-ph%2F0409256%2Chep-ph%2F0409180%2Chep-ph%2F0409114%2Chep-ph%2F0409035%2Chep-ph%2F0409054%2Chep-ph%2F0409108%2Chep-ph%2F0409007%2Chep-ph%2F0409124%2Chep-ph%2F0409038%2Chep-ph%2F0409192%2Chep-ph%2F0409116%2Chep-ph%2F0409315%2Chep-ph%2F0409261%2Chep-ph%2F0409009%2Chep-ph%2F0409195%2Chep-ph%2F0409042%2Chep-ph%2F0409087%2Chep-ph%2F0409186%2Chep-ph%2F0409191%2Chep-ph%2F0409238%2Chep-ph%2F0409291%2Chep-ph%2F0409081%2Chep-ph%2F0409279%2Chep-ph%2F0409106%2Chep-ph%2F0409070%2Chep-ph%2F0409346%2Chep-ph%2F0409283%2Chep-ph%2F0409189%2Chep-ph%2F0409115%2Chep-ph%2F0409040%2Chep-ph%2F0409333%2Chep-ph%2F0409176%2Chep-ph%2F0409147%2Chep-ph%2F0409023%2Chep-ph%2F0409037%2Chep-ph%2F0409208%2Chep-ph%2F0409327%2Chep-ph%2F0409137%2Chep-ph%2F0409310%2Chep-ph%2F0409019%2Chep-ph%2F0409287%2Chep-ph%2F0409074%2Chep-ph%2F0409181%2Chep-ph%2F0409157%2Chep-ph%2F0409131%2Chep-ph%2F0409233%2Chep-ph%2F0409210%2Chep-ph%2F0409251%2Chep-ph%2F0409250%2Chep-ph%2F0409198%2Chep-ph%2F0409056%2Chep-ph%2F0409057%2Chep-ph%2F0409099%2Chep-ph%2F0409294%2Chep-ph%2F0409260%2Chep-ph%2F0409080%2Chep-ph%2F0409187%2Chep-ph%2F0409185%2Chep-ph%2F0409280%2Chep-ph%2F0409145%2Chep-ph%2F0409095%2Chep-ph%2F0409001&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Sudakov logs and power corrections for selected event shapes"}, "summary": "I summarize the results of recent studies analyzing perturbative and\nnonperturbative effects of soft gluon radiation on the distributions of the\nC-parameter and of the class of angularities, by means of dressed gluon\nexponentiation.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0409344%2Chep-ph%2F0409103%2Chep-ph%2F0409011%2Chep-ph%2F0409026%2Chep-ph%2F0409263%2Chep-ph%2F0409289%2Chep-ph%2F0409218%2Chep-ph%2F0409163%2Chep-ph%2F0409341%2Chep-ph%2F0409202%2Chep-ph%2F0409012%2Chep-ph%2F0409154%2Chep-ph%2F0409230%2Chep-ph%2F0409253%2Chep-ph%2F0409109%2Chep-ph%2F0409245%2Chep-ph%2F0409055%2Chep-ph%2F0409194%2Chep-ph%2F0409161%2Chep-ph%2F0409209%2Chep-ph%2F0409360%2Chep-ph%2F0409231%2Chep-ph%2F0409296%2Chep-ph%2F0409013%2Chep-ph%2F0409068%2Chep-ph%2F0409061%2Chep-ph%2F0409079%2Chep-ph%2F0409126%2Chep-ph%2F0409349%2Chep-ph%2F0409351%2Chep-ph%2F0409091%2Chep-ph%2F0409259%2Chep-ph%2F0409277%2Chep-ph%2F0409332%2Chep-ph%2F0409241%2Chep-ph%2F0409211%2Chep-ph%2F0409212%2Chep-ph%2F0409265%2Chep-ph%2F0409193%2Chep-ph%2F0409256%2Chep-ph%2F0409180%2Chep-ph%2F0409114%2Chep-ph%2F0409035%2Chep-ph%2F0409054%2Chep-ph%2F0409108%2Chep-ph%2F0409007%2Chep-ph%2F0409124%2Chep-ph%2F0409038%2Chep-ph%2F0409192%2Chep-ph%2F0409116%2Chep-ph%2F0409315%2Chep-ph%2F0409261%2Chep-ph%2F0409009%2Chep-ph%2F0409195%2Chep-ph%2F0409042%2Chep-ph%2F0409087%2Chep-ph%2F0409186%2Chep-ph%2F0409191%2Chep-ph%2F0409238%2Chep-ph%2F0409291%2Chep-ph%2F0409081%2Chep-ph%2F0409279%2Chep-ph%2F0409106%2Chep-ph%2F0409070%2Chep-ph%2F0409346%2Chep-ph%2F0409283%2Chep-ph%2F0409189%2Chep-ph%2F0409115%2Chep-ph%2F0409040%2Chep-ph%2F0409333%2Chep-ph%2F0409176%2Chep-ph%2F0409147%2Chep-ph%2F0409023%2Chep-ph%2F0409037%2Chep-ph%2F0409208%2Chep-ph%2F0409327%2Chep-ph%2F0409137%2Chep-ph%2F0409310%2Chep-ph%2F0409019%2Chep-ph%2F0409287%2Chep-ph%2F0409074%2Chep-ph%2F0409181%2Chep-ph%2F0409157%2Chep-ph%2F0409131%2Chep-ph%2F0409233%2Chep-ph%2F0409210%2Chep-ph%2F0409251%2Chep-ph%2F0409250%2Chep-ph%2F0409198%2Chep-ph%2F0409056%2Chep-ph%2F0409057%2Chep-ph%2F0409099%2Chep-ph%2F0409294%2Chep-ph%2F0409260%2Chep-ph%2F0409080%2Chep-ph%2F0409187%2Chep-ph%2F0409185%2Chep-ph%2F0409280%2Chep-ph%2F0409145%2Chep-ph%2F0409095%2Chep-ph%2F0409001&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "I summarize the results of recent studies analyzing perturbative and\nnonperturbative effects of soft gluon radiation on the distributions of the\nC-parameter and of the class of angularities, by means of dressed gluon\nexponentiation."}, "authors": ["Lorenzo Magnea"], "author_detail": {"name": "Lorenzo Magnea"}, "author": "Lorenzo Magnea", "arxiv_comment": "Talk given at DIS 2004, Strbske Pleso, Slovakia, 14-18 April 2004", "links": [{"href": "http://arxiv.org/abs/hep-ph/0409209v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-ph/0409209v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-ph/0409209v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-ph/0409209v1", "journal_reference": null, "doi": null, "fulltext": "Proceedings of the DIS'2004, Štrbské Pleso, Slovakia\n\narXiv:hep-ph/0409209v1 17 Sep 2004\n\nSUDAKOV LOGS AND POWER CORRECTIONS\nFOR SELECTED EVENT SHAPES\nLORENZO MAGNEA\nDipartimento di Fisica Teorica, Università di Torino,\nINFN, Sezione di Torino\nVia P. Giuria, 1, I–10125 Torino, Italy\nand\nCERN, Department of Physics, Theory Division\nCH–1211 Genève 23, Switzerland\nE-mail: magnea@to.infn.it\nI summarize the results of two recent studies analyzing perturbative and nonperturbative effects of soft gluon radiation on the distributions of the C-parameter\nand of the class of angularities, by means of dressed gluon exponentiation.\n\n1\n\nIntroduction\n\nEvent shape distributions in high energy scattering processes such as e+ e− annihilation and DIS have been the focus of many theoretical studies in recent years (for\nreviews, see for example [1] and [2]). From the viewpoint of a QCD theorist, event\nshape distributions are of considerable interest because they probe the dynamics\nof strong interactions at a wide range of scales, from a purely perturbative regime\nto configurations dominated by soft gluon emission. As a consequence, the theoretical description of these distributions requires a wide range of tools, from the\ncomputation of finite order perturbative corrections to resummation and finally to\nthe analysis of power corrections.\nTo establish the tools required for the analysis, consider the case of the thrust\nT . Away from the two-jet limit, T → 1, the thrust distribution is dominated by\nhard gluon emission and can be computed perturbatively. Such a computation,\nhowever, is unreliable as τ = 1 − T → 0, where the results diverge order by order\nin perturbation theory, while the physical distribution vanishes. The reason is well\nunderstood: as τ → 0 gluon radiation is forced to be soft or collinear to the primary\npartons, and thus the distribution is dominated by Sudakov logarithms, which need\nto be resummed in order to recover even the qualitative features of data.\nResummation of Sudakov logarithms leads to exponentiation of the Laplace\ntransform of the distribution [3]. For the thrust,\n\"Z\nZ ∞\n1\n\u0001\u0001\n\u0001\ndu −uν\n−ντ 1 dσ\ne\n− 1 B αs uQ2 +\nd τe\n= exp\nσ dτ\n0\n0 u\n!#\nZ uQ2 2\n\u0001\ndq\n+\n.\n(1)\nA αs (q 2 )\n2\nu2 Q2 q\nCorrections to this formula are suppressed by powers of νΛ/Q, corresponding to\nc Institute of Experimental Physics SAS, Košice, Slovakia\n\n1\n\n\f2\n\nL. Magnea\n\npowers of Λ/(Qτ ) upon inversion of the transform. The functions A and B are\nknown respectively to three and two loops, corresponding to a resummation up to\nNNLL accuracy.\nAlthough Eq. (1) is sufficient, upon matching with finite order results, to provide a fit of the data for values of τ larger than those corresponding to the peak of\nthe distribution, a complete description requires the inclusion of power-suppressed\ncorrections. In fact, as τ becomes of the order of Λ/Q, all corrections proportional\nto powers of Λ/(Qτ ) must be taken into account. Fortunately, Eq. (1) can be used\nto construct a perturbatively motivated parametrization of these corrections [4].\nIntroducing an IR cutoff μ, one can isolate the ambiguous contributions to Eq. (1),\narising from the fact that the Landau pole of the strong coupling is on the integration contour. Power corrections thus exponentiate in the Sudakov region, and they\ncan be expressed in terms of the anomalous dimension A, as\nZ\nZ μ2 2\n\u0001\n\u0001 q/Q du −uν\ndq\n2\ne\n−1\nA\nα\n(q\n)\nSNP (ν/Q, μ) =\ns\n2\nq\nq2 /Q2 u\n0\n\u0012\n\u0013\n\u0012 \u00132 !\n∞\nn\nX 1 ν\nΛ\n2\n,\n(2)\nλn (μ ) + O ν\n=\nn! Q\nQ\nn=1\nThe moments λn (μ2 ) can be organized into a \"shape function\", which can be modeled and folded with the perturbative distribution [5,6].\nAn especially compelling model for shape functions can be constructed by combining renormalon methods with Sudakov resummations. The basic idea is to start\nby computing the single gluon contribution to the relevant cross section , with an\narbitrary number of quark bubble insertions in the gluon propagator. Integrating\ninclusively over the quark pairs emitted into the final state, and summing over\nthe number of bubbles, this leads to the \"characteristic function\" of the dispersive\nmethod [7,8], i.e. the mass distribution of the single virtual gluon contribution\nto the desired cross section. Under the assumption of ultraviolet dominance [9] of\npower corrections, this function encodes information about their size, and can be\nused to parametrize them. Dressed gluon exponentiation [10] combines this renormalon calculation with Sudakov resummation by using the single dressed gluon\ncross section as kernel for the exponentiation, writing\n\u0014\u0012 \u0013\n\u0015 Z ∞ \u0012 \u0013\n\u0001\ndσ̃\ndσ\nln\ndτ\n=\n(3)\n1 − e−ντ .\ndν DGE\ndτ SDG\n0\n\nDressed gluon exponentiation (DGE) has several nice features. First of all, it incorporates most of the current knowledge of the cross section in Sudakov limit,\nincluding in particular NL logarithms to all orders, provided the coupling is chosen\nappropriately. Furthermore, since the renormalon calculation is formally exact in\nthe large-nf limit, all subleading logs are also included in the same limit. One can\nthen observe that the coefficients of formally subleading logs grow factorially, and\nuse this information to gauge the range of applicability of the resummed formalism.\nFinally, by imposing the constraint of energy conservation on multi-gluon emission\nby means of the Laplace transform in Eq. (3), DGE generates a nontrivial pattern\nof exponentiated power corrections, and can be used to construct a model for the\n\n\f3\n\nSudakov Logs and Power Corrections\n\nshape function. DGE has been applied to several high energy QCD cross sections,\nranging from event shapes [11] to inclusive DIS [12] and to radiative and semileptonic B decays [13]. In the following we will describe the results obtained with this\nmethod in applications to the C-parameter [14], and to the class of angularities [15].\n2\n\nThe C-parameter\n\nThe C-parameter in e+ e− annihilation has the nice feature of being a function of\nthe final state momenta pi defined without reference to any minimization procedure, such as the one required to determine the thrust axis. It is well studied,\nboth perturbatively [16] and at the level of power corrections [17,18]. A covariant\ndefinition is\n3X\n(pi * pj )2\n.\n(4)\nC =3−\n2 i,j (pi * Q) (pj * Q)\nAt one loop, we will need an expression for C in the case of emission of a single\ngluon with virtuality ξ = k 2 /Q2 . In terms of xi = 2pi * Q/Q2 one finds\nc(x1 , x2 , ξ) ≡\n\nC\n(1 − x1 )(1 − x2 )(1 − x3 + 2ξ) − ξ 2\n.\n=\n6\nx1 x2 x3\n\n(5)\n\nThe characteristic function, corresponding to the cross section for the emission of\na gluon with virtuality ξ, is then given by\nZ\nF (ξ, c) = dx1 dx2 M(x1 , x2 , ξ) δ (c(x1 , x2 , ξ) − c) ,\n(6)\n\nwhere the one-loop matrix element for virtual gluon emission is\nM(x1 , x2 , ξ) =\n\nξ\n(x1 + ξ)2 + (x2 + ξ)2\nξ\n−\n.\n−\n(1 − x1 )(1 − x2 )\n(1 − x1 )2\n(1 − x2 )2\n\n(7)\n\nThe characteristic function F (ξ, c) in Eq. (6) can be computed exactly in terms\nof elliptic integrals [14]. In order to perform DGE it is useful to turn to a Borel\nrepresentation of the single dressed gluon cross section,\nZ ∞\n\u0001−u\nCF\n1 dσ\n=\ndu Q2 /Λ2\nB(c, u) ,\n(8)\nσ dc SDG\n2β0 0\n\nwhere B(c, u) is obtained by integrating dF (ξ, c)/dξ over phase space with a weight\nξ −u . This integral cannot be performed exactly, but one can get an analytic answer\nfor the terms responsible for Sudakov logarithms, which are singular as c → 0.\nHaving determined the relevant contributions to B(c, u), one can exponentiate and\nobtain the physical distribution by mean of an inverse Laplace transform, as\nZ k+i∞\n\u0002\n\u0001\u0003\ndν νc\n1 dσ\n=\ne exp S ν, Q2 ,\n(9)\nσ dc DGE\nk−i∞ 2πi\nwhere\n\nS ν, Q\n\n2\n\n\u0001\n\n=\n\nZ\n\n0\n\n∞\n\ndc\n\n1 dσ\nσ dc\n\nSDG\n\n\u0001\ne−νc − 1 .\n\n(10)\n\n\f4\n\nL. Magnea\n\nThe exponent admits a Borel representation\nZ ∞\n\u0001\n\u0001−u\nCF\n2\nS ν, Q =\nBc (ν, u) ,\ndu Q2 /Λ2\n2β0 0\nwhere, in the large-nf limit, one finds\n\u0014\n√\n\u0001\nπΓ(u)\n5u/3 sin πu\nΓ(−2u) ν 2u − 1 21−2u 1\nBc (ν, u) = 2 e\nπu\nΓ( + u)\n\u0012\n\u0013\u0015 2\n2\n1\n1\n− Γ(−u) (ν u − 1)\n.\n+\n+\nu 1−u 2−u\n\n(11)\n\n(12)\n\nStarting from Eq. (12) one can recover perturbative Sudakov logarithms (by expanding in powers of u), and one can quantify the strength of power corrections, by\nlooking at the location of poles in u. Specifically, the second factor in Eq. (12) corresponds to collinear radiation, and it is identical to the one found for thrust [11].\nThe poles at u = 1, 2 correspond to power corrections of the form ν(Λ2 /Q2 )p , with\np = 1, 2. The first factor, on the other hand, arises form soft radiation, and has\npoles at u = m/2, with m odd, corresponding to power corrections of the form\nν(Λ/Q)m . The cancellation of the pole at u = 0 expresses the IR-collinear safety\nof the C-parameter.\nComparing, for example, with the results for the thrust [11], one verifies that\nSudakov logarithms are identical for the two observables up to NLL level, as observed in [16]. The pattern of power corrections is also similar, however one finds\nthat both the coefficients of subleading logs and the residues of the poles corresponding to soft power corrections are smaller for the C-parameter than they are\nfor the thrust. This can be traced back to the fact that the typical scale for soft\nemissions is 2Qc for the C-parameter, as opposed to Qτ for the thrust. If one takes\nthis large-nf result seriously, one is lead to conclude that the impact of subleading\nlogarithms and of subleading power corrections should be smaller for C than it is\nfor the thrust. The resummed perturbative prediction should thus be more reliable, and the approximation of the shape function by a shift of the perturbative\ndistribution should work better in this case.\n3\n\nThe class of angularities\n\nAngularities are a one-parameter class of event shapes introduced in [19]. They are\ndefined by\n1 X\n(p⊥ )i e−|ηi |(1−a) ,\n(13)\nτa =\nQ i\nwhere transverse momenta and rapidities are defined with respect to the thrust\naxis. For a = 0 one recovers the thrust (τ0 = 1 − T ), while a = 1 corresponds to jet\nbroadening. Resummation of Sudakov logarithms was worked out in [19] for a < 1.\nThe result has a nontrivial a dependence: for example at the LL level one finds\n2\n\" uQ\n#\nZ\nZ1\n\u0010\n\u0011\na\np\ndp2T\ndu\n−u1−a ν ( QT )\nA (αs (pT )) e\n.\n(14)\n−1\nln [σ ̃LL (ν, a)] = 2\nu\np2T\n0\n\nu2 Q2\n\n\fSudakov Logs and Power Corrections\n\n5\n\nNotwithstanding this complicated a dependence, a study of power corrections of\nthe form ν(Λ/Q)m , using Eq. (14) as a starting point, showed a remarkable scaling\nbehavior: the shape function suggested by the resummation for dσ/dτa depends on\na only through an overall factor of 1/(1 − a) [20,21]. This simple scaling arises, in\nthe context of resummation, from boost invariance of the eikonal cross section responsible for logarithmic enhancements. Since DGE complements the resummation\nby including the effect of subleading logarithms in the large-nf limit, and provides\nan explicit model of power corrections consistent both with the resummation and\nwith renormalon calculus, it was interesting to check whether the scaling suggested\nin [20,21] would remain valid. The test is nontrivial also because boost invariance\nis broken in DGE by gluon virtuality, and it is interesting to see how it is eventually\nrecovered in the Sudakov limit. This study was performed in [15].\nThe first step, as for the C-parameter, is to provide a definition of the observable\nat one loop for an emitted gluon with virtuality ξ. The definition adopted in [15] is\nτa =\n\ni\n(1 − xi )1−a/2 h\n(1 − xj − ξ)1−a/2 (1 − xk + ξ)a/2 + (j ↔ k) ,\nxi\n\n(15)\n\nwhich has the correct limit as ξ → 0 and is simple enough to allow for analytic\ncomputations. It can be shown that leading power corrections are not affected by\nchanges of Eq. (15) which are analytic in ξ.\nIn this case, it is not possible to compute the characteristic function in closed\nform. A detailed study of the limit of soft radiation leads anyhow to a simple\nexpression for the soft contribution to the Borel function of DGE, corresponding to\nthe first erm of Eq. (12). One finds\n\u0014\n\u0015\n\u00012\n1\nsoft\n5u/3 sin πu\n2u\nBa (ν, u) =\n2e\n,\n(16)\nΓ(−2u) ν − 1\n1−a\nπu\nu\nexactly the scaling behavior predicted by the resummation. DGE also provides a\nmodel for power corrections of collinear origin. Although these in principle may be\naffected by the choice of the massive definition of the observable, it is interesting\nto notice that they are suppressed by a power of Q which grows as a becomes large\nand negative. One finds that collinear power corrections are suppressed at least by\nν(Λ/Q)2−a . Comparing the thrust distribution to the angularity distribution for a\nnegative value of a should thus provide a simple and clean test of the scaling rule,\nlargely unaffected by errors due to subleading power corrections.\n4\n\nPerspective\n\nStudies of event shape distributions in and beyond perturbative QCD have reached a\nconsiderable degree of refinement, and provide robust theoretical predictions which\nin some cases should be fairly easy to test experimentally. Such tests are indeed\ndesirable, because they would strongly constrain our current understanding of the\ntransition between perturbative and nonperturbative QCD, and they might have\npractical consequences, for example on current determinations αs [22]. The fact\nthat some of the recent theoretical progress has taken place as the work of the LEP\ncollaborations was winding down is a warning for the future: \"old\" data may well\n\n\f6\n\nL. Magnea\n\ncontain a wealth of unexplored information, so it should continue to be possible to\nperform new analyses, as theory progresses or new viewpoints emerge.\nAcknowledgements\nI thank my collaborators, Carola Berger and Einan Gardi, for their essential contribution to the results described in this paper.\nReferences\n1. M. Dasgupta and G.P. Salam, J. Phys. G 30 (2004) R143, hep-ph/0312283.\n2. L. Magnea, in Proceedings of IFAE 2002, SIF, ed. M Cacciari et. al, p. 143,\nhep-ph/0211013.\n3. S. Catani, L. Trentadue, G. Turnock and B.R. Webber, Nucl. Phys. B 407\n(1993) 3.\n4. G.P. Korchemsky and G. Sterman, Nucl. Phys. B 555 (1999) 335,\nhep-ph/9902341.\n5. G.P. Korchemsky and S. Tafat, JHEP 0010 (2000) 010, hep-ph/0007005.\n6. A.V. Belitsky, G.P. Korchemsky and G. Sterman, Phys. Lett. B 515 (2001)\n297, hep-ph/0106308.\n7. P. Ball, M. Beneke and V.M. Braun, Nucl. Phys. B 452 (1995) 563,\nhep-ph/9502300.\n8. Y.L. Dokshitzer, G. Marchesini and B.R. Webber, Nucl. Phys. B 469 (1996)\n93, hep-ph/9512336.\n9. M. Beneke, V.M. Braun and L. Magnea, Nucl. Phys. B 497 (1997) 297,\nhep-ph/9701309.\n10. E. Gardi, Nucl. Phys. B 622 (2002) 365, hep-ph/0108222.\n11. E. Gardi and J. Rathsman, Nucl. Phys. B 609 (2001) 123, hep-ph/0103217;\nNucl. Phys. B 638 (2002) 243, hep-ph/0201019.\n12. E. Gardi, G.P. Korchemsky, D.A. Ross and S. Tafat, Nucl. Phys. B 636\n(2002) 385, hep-ph/0203161.\n13. E. Gardi, JHEP 0404, 049 (2004), hep-ph/0403249.\n14. E. Gardi and L. Magnea, JHEP 0308 (2003) 030, hep-ph/0306094.\n15. C.F. Berger and L. Magnea, hep-ph/0407024.\n16. S. Catani and B.R. Webber, Phys. Lett. B 427 (1998) 377, hep-ph/9801350.\n17. M. Dasgupta, L. Magnea and G. Smye, JHEP 9911 (1999) 025,\nhep-ph/9911316.\n18. G.E. Smye, JHEP 0105 (2001) 005, hep-ph/0101323.\n19. C.F. Berger, T. Kucs and G. Sterman, Phys. Rev. D 68 (2003) 014012,\nhep-ph/0303051.\n20. C.F. Berger and G. Sterman, JHEP 0309 (2003) 058, hep-ph/0307394.\n21. C.F. Berger and G. Sterman, hep-ph/0310058.\n22. R.W.L. Jones, M. Ford, G.P. Salam, H. Stenzel and D. Wicke, JHEP 0312\n(2003) 007, hep-ph/0312016.\n\n\f"}