{"id": "http://arxiv.org/abs/hep-th/0307157v3", "guidislink": true, "updated": "2003-12-11T08:44:05Z", "updated_parsed": [2003, 12, 11, 8, 44, 5, 3, 345, 0], "published": "2003-07-17T14:11:42Z", "published_parsed": [2003, 7, 17, 14, 11, 42, 3, 198, 0], "title": "Superconformal anomaly free models in D=4", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-th%2F0307157%2Chep-th%2F0307225%2Chep-th%2F0307058%2Chep-th%2F0307276%2Chep-th%2F0307163%2Chep-th%2F0307101%2Chep-th%2F0307106%2Chep-th%2F0307066%2Chep-th%2F0307024%2Chep-th%2F0307266%2Chep-th%2F0307125%2Chep-th%2F0307161%2Chep-th%2F0307037%2Chep-th%2F0307011%2Chep-th%2F0307218%2Chep-th%2F0307010%2Chep-th%2F0307105%2Chep-th%2F0307068%2Chep-th%2F0307006%2Chep-th%2F0307062%2Chep-th%2F0307270%2Chep-th%2F0307151%2Chep-th%2F0307124%2Chep-th%2F0307079%2Chep-th%2F0307132%2Chep-th%2F0307023%2Chep-th%2F0307215%2Chep-th%2F0307261%2Chep-th%2F0307299%2Chep-th%2F0307144%2Chep-th%2F0307203%2Chep-th%2F0307042%2Chep-th%2F0307290%2Chep-th%2F0307056%2Chep-th%2F0307127%2Chep-th%2F0307048%2Chep-th%2F0307122%2Chep-th%2F0307219%2Chep-th%2F0307155%2Chep-th%2F0307108%2Chep-th%2F0307189%2Chep-th%2F0307181%2Chep-th%2F0307172%2Chep-th%2F0307201%2Chep-th%2F0307250%2Chep-th%2F0307111%2Chep-th%2F0307033%2Chep-th%2F0307158%2Chep-th%2F0307034%2Chep-th%2F0307067%2Chep-th%2F0307242%2Chep-th%2F0307300%2Chep-th%2F0307136%2Chep-th%2F0307053%2Chep-th%2F0307251%2Chep-th%2F0307145%2Chep-th%2F0307173%2Chep-th%2F0307204%2Chep-th%2F0307059%2Chep-th%2F0307202%2Chep-th%2F0307089%2Chep-th%2F0307001%2Chep-th%2F0307195%2Chep-th%2F0307069%2Chep-th%2F0307040%2Chep-th%2F0307230%2Chep-th%2F0307183%2Chep-th%2F0307123%2Chep-th%2F0307232%2Chep-th%2F0307241%2Chep-th%2F0307190%2Chep-th%2F0307135%2Chep-th%2F0307220%2Chep-th%2F0307199%2Chep-th%2F0307174%2Chep-th%2F0307095%2Chep-th%2F0307279%2Chep-th%2F0307121%2Chep-th%2F0307211%2Chep-th%2F0307273%2Chep-th%2F0307012%2Chep-th%2F0307263%2Chep-th%2F0307166%2Chep-th%2F0307258%2Chep-th%2F0307281%2Chep-th%2F0307047%2Chep-th%2F0307046%2Chep-th%2F0307205%2Chep-th%2F0307049%2Chep-th%2F0307092%2Chep-th%2F0307100%2Chep-th%2F0307082%2Chep-th%2F0307007%2Chep-th%2F0307117%2Chep-th%2F0307134%2Chep-th%2F0307257%2Chep-th%2F0307283%2Chep-th%2F0307286%2Chep-th%2F0307238%2Chep-th%2F0307168%2Chep-th%2F0307194&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Superconformal anomaly free models in D=4"}, "summary": "A family of modified $(0,1)$ heterotic string models in D=4 is constructed in\nwhich the strings incorporate $R$ flux tubes which may in special cases support\na local spacetime superconformal symmetry consistent with quantum mechanics.\nThere is an intrinsic Goldstino multiplet, so that supersymmetry breaking can\nbe driven by any process that generates a non-zero value for the\nsuperpotential. The superconformal anomaly freedom of these models may be\nrelated to a naturally vanishing $\\Lambda$. The $R$ charge of such models may\nalso play a role in producing a generation-ordered fermion spectrum. \\", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-th%2F0307157%2Chep-th%2F0307225%2Chep-th%2F0307058%2Chep-th%2F0307276%2Chep-th%2F0307163%2Chep-th%2F0307101%2Chep-th%2F0307106%2Chep-th%2F0307066%2Chep-th%2F0307024%2Chep-th%2F0307266%2Chep-th%2F0307125%2Chep-th%2F0307161%2Chep-th%2F0307037%2Chep-th%2F0307011%2Chep-th%2F0307218%2Chep-th%2F0307010%2Chep-th%2F0307105%2Chep-th%2F0307068%2Chep-th%2F0307006%2Chep-th%2F0307062%2Chep-th%2F0307270%2Chep-th%2F0307151%2Chep-th%2F0307124%2Chep-th%2F0307079%2Chep-th%2F0307132%2Chep-th%2F0307023%2Chep-th%2F0307215%2Chep-th%2F0307261%2Chep-th%2F0307299%2Chep-th%2F0307144%2Chep-th%2F0307203%2Chep-th%2F0307042%2Chep-th%2F0307290%2Chep-th%2F0307056%2Chep-th%2F0307127%2Chep-th%2F0307048%2Chep-th%2F0307122%2Chep-th%2F0307219%2Chep-th%2F0307155%2Chep-th%2F0307108%2Chep-th%2F0307189%2Chep-th%2F0307181%2Chep-th%2F0307172%2Chep-th%2F0307201%2Chep-th%2F0307250%2Chep-th%2F0307111%2Chep-th%2F0307033%2Chep-th%2F0307158%2Chep-th%2F0307034%2Chep-th%2F0307067%2Chep-th%2F0307242%2Chep-th%2F0307300%2Chep-th%2F0307136%2Chep-th%2F0307053%2Chep-th%2F0307251%2Chep-th%2F0307145%2Chep-th%2F0307173%2Chep-th%2F0307204%2Chep-th%2F0307059%2Chep-th%2F0307202%2Chep-th%2F0307089%2Chep-th%2F0307001%2Chep-th%2F0307195%2Chep-th%2F0307069%2Chep-th%2F0307040%2Chep-th%2F0307230%2Chep-th%2F0307183%2Chep-th%2F0307123%2Chep-th%2F0307232%2Chep-th%2F0307241%2Chep-th%2F0307190%2Chep-th%2F0307135%2Chep-th%2F0307220%2Chep-th%2F0307199%2Chep-th%2F0307174%2Chep-th%2F0307095%2Chep-th%2F0307279%2Chep-th%2F0307121%2Chep-th%2F0307211%2Chep-th%2F0307273%2Chep-th%2F0307012%2Chep-th%2F0307263%2Chep-th%2F0307166%2Chep-th%2F0307258%2Chep-th%2F0307281%2Chep-th%2F0307047%2Chep-th%2F0307046%2Chep-th%2F0307205%2Chep-th%2F0307049%2Chep-th%2F0307092%2Chep-th%2F0307100%2Chep-th%2F0307082%2Chep-th%2F0307007%2Chep-th%2F0307117%2Chep-th%2F0307134%2Chep-th%2F0307257%2Chep-th%2F0307283%2Chep-th%2F0307286%2Chep-th%2F0307238%2Chep-th%2F0307168%2Chep-th%2F0307194&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A family of modified $(0,1)$ heterotic string models in D=4 is constructed in\nwhich the strings incorporate $R$ flux tubes which may in special cases support\na local spacetime superconformal symmetry consistent with quantum mechanics.\nThere is an intrinsic Goldstino multiplet, so that supersymmetry breaking can\nbe driven by any process that generates a non-zero value for the\nsuperpotential. The superconformal anomaly freedom of these models may be\nrelated to a naturally vanishing $\\Lambda$. The $R$ charge of such models may\nalso play a role in producing a generation-ordered fermion spectrum. \\"}, "authors": ["Michael Hewitt"], "author_detail": {"name": "Michael Hewitt"}, "author": "Michael Hewitt", "arxiv_comment": "8 pages, Latex. v3. First section rewritten to use $R$ anomaly\n  cancellation between level zero states without Chern-Simons branes", "links": [{"href": "http://arxiv.org/abs/hep-th/0307157v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-th/0307157v3", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-th/0307157v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-th/0307157v3", "journal_reference": null, "doi": null, "fulltext": "arXiv:hep-th/0307157v3 11 Dec 2003\n\nSuperconformal anomaly free models in\nD=4\nMichael Hewitt\nScience Research Unit, Canterbury Christ Church University College,\nNorth Holmes Road, Canterbury, CT1 1QU, U.K.\nemail: mike@cant.ac.uk, tel:+44(0)1227-767700.\n10 December 2003\nAbstract\nA family of modified (0, 1) heterotic string models in D = 4 is\nconstructed in which the strings incorporate R flux tubes which may\nin special cases support a local spacetime superconformal symmetry\nconsistent with quantum mechanics. There is an intrinsic Goldstino\nmultiplet, so that supersymmetry breaking can be driven by any process that generates a non-zero value for the superpotential. The superconformal anomaly freedom of these models may be related to a\nnaturally vanishing Λ. The R charge of such models may also play a\nrole in producing a generation-ordered fermion spectrum.\nPACS numbers:11.25.Mj, 04.65.+e, 11.25.Tq\n\n1\n\nIntroduction\n\nOur aim in this paper is to argue that strictly 4 dimensional (0,1) heterotic\nstring models have special features that may enable them to provide the propagating states for models with a local space-time superconformal invariance.\nBy strictly 4 dimensional models we mean the sub-family of those studied in\n[1,2,3] which have a field independent value of g, the bare dimensionless 4\ndimensional coupling constant. When the effective level zero field theory is\n1\n\n\fexpressed in string tension units, the dilaton is replaced by a residual scalar\nfield ψ, with g independent of ψ. With suitable twisted boundary conditions,\nall breathing modes which have an effect on g may be eliminated from the\nlevel zero spectrum allowing such models to be constructed. We may now\nintroduce a zero norm chiral scalar superfield χ (i.e. χ has no kinetic term)\nto compensate the string tension in an attempt to make a model with local\nsuperconformal invariance. This will be a symmetry of the lifted metric\nĝμν = eRe(χ) gμν\n\n(1)\n\nwhere conformal rescalings of ĝμν can be absorbed into the compensator χ\nwith gμν the metric relative to the string tension. The phase of χ compensates\nthe phase of mass terms for the massive Ramond sector states, respecting\nR invariance, contributing a trivial volume factor to the path integral. The\nspinor components of χ may be gauged away using S type supersymmetry\ntransformations, as usual for a conformal compensator [4]. The motivation\nhere is to study supersymmetry breaking in the context of superconformal\nsymmetry, as proves useful for conventional supergravity [4]. There is, in\ngeneral, an obstruction to the validity of superconformal symmetry in conventional field theory in the form of ABJ anomalies [5,6] for R transformations. By identifying R with a suitable 'handle' charge in the 2 fermion Lie\nsubalgebra of the Ramond Clifford algebra, it may be possible to arrange for\nall ABJ anomalies involving R to cancel. This extra requirement would give\na powerful constraint on the string models that could consistently be used\nin this way. A consideration of the non-perturbative defect around a string\nleads to a proposal that the strings should incorporate intrinsic R flux tubes.\nThis suggests that the strings may be topological features associated with a\ndiscrete fibre bundle. A consequence of these intrinsic R flux tubes is that\nthe supermultiplet containing ψ becomes the Goldstone multiplet for local\nsupersymmetry breaking, which will now occur automatically, provided that\nthe superpotential G takes a non-zero value. If the v.e.v of G is generated\nby processes well below the string tension scale, this would lead to a stable\nrealistic supersymmetry breaking mechanism. It may be possible to establish a theorem giving zero cosmological constant in the form of the somewhat\nstronger statement that the global superconformal invariance of the global\n(vacuum) state is anomaly free even though it is spontaneously broken. A\ncharacteristic feature of this realisation of superconformal invariance is that\nthe antisymmetric tensor counterpart of the graviton is eliminated by local R invariance. The R spectrum of the chiral fermions could provide an\n2\n\n\forganising principle for the phenomenological generation structure, with extra insertions needed to produce couplings of the Higgs boson to the lower\ngenerations.\n\n2\n\nModified String Model\n\nConsider a string presented in cosmic configuration [7]. A feature of strictly 4\ndimensional strings is that they produce a non-perturbative geometric defect,\nand also a defect in the pseudoscalar φ dual to Bμν around a loop linking the\nstring worldsheet.\nThe string tension T and the Regge slope α′ for the (0,1) heterotic string\nare related by [8]\n(2)\nT −1 = 4πα′ ,\nwhile α′ is related to Newton's constant G by [8]\nα′ =\n\n16πG\n.\ng2\n\n(3)\n\nThe angular deficit around a string in cosmic configuration is given by [9],\nδ = 8πGT\n\n(4)\n\nusing the Einstein field equations. This gives a non-perturbative defect\naround the string site, analogous to the defect around a massive particle\nin 2+1 dimensions [10]. We now define a modification to the properties of a\nstring by applying the condition for an unbroken N = 1/2 supersymmetry\naround the string site, using the R gauge connection of local superconformal\nsymmetry to compensate for the Lorentz connection defect. This is defined\nso that the spacetime supersymmetry components right-moving at the string,\ni.e. those that couple locally to the string, are taken to be unbroken by the\nnet effect of the non-perturbative defects around the string. (This condition is reminiscent of the partial survival of supersymmetry associated with\nBPS saturation, and may indicate a self-duality property.) This modification\nwould enable supersymmetry breaking to be driven by mechanisms operating\nat well below the string tension scale, as in the following section. For the\nLorentz connection around the string to cancel the R connection on these\ngenerators we need\n\n3\n\n\fZ\n\nAR = δ\n\nC\n\n(5)\n\nwhere δ is the deficit angle around the string. The physical interpretation\nof eq.(5) is that the strings incorporate a flux tube of strength δ for the\nmagnetic field of AR . The field strength H around a cosmic configuration\nstring may be interpreted as follows. Introducing cylindrical coordinates\n(t, r, θ, z) centred on the string, H is parallel to the surfaces of constant\nθ. The coupled equations for gravity and H are equivalent to an EinsteinCartan system with H representing a totally antisymmetric torsion which\nRicci flattens the connection on surfaces of constant θ. The transverse metric\non surfaces with r, t constant remains flat with azimuthal defect angle δ.\n(Although a classical static solution is singular at the string, the quantum\nstring theory is, as usual, finite.)\nAs regards φ, a straightforward calculation gives [7]\n∆≡\n\n1\ng\n\nZ\n\nC\n\n∗H =\n\n−g\n.\n8\n\n(6)\n\nSuppose now that the dual field ∗H can be described in terms of the\npseudoscalar field φ as\n(1)\n\n∗ H = dφ + CωR = dφ + CAR .\n\n(7)\n\nHere we have extended the global gauge invariance of φ, which arises since the\nabsolute value of φ is irrelevant, to a local symmetry by using the axial vector\nU(1) gauge field AR , which appears as the axial auxiliary field in conventional\nN = 1 supergravity [4]. By introducing this gauge compensation of φ by AR\nit is now possible for φ to be single valued around a string, repairing the\ndefect noted in [7], giving C = g∆/δ = −g 2 /8δ, and we may make a natural\ngauge choice φ = 0. This means that local R gauge symmetry now removes\nφ (and thus Bμν ) from the physical spectrum.\nWe now face a problem with the consistency of R symmetry at the quantum level due to ABJ anomalies [5,6]. Diagrams with one R plus two YangMills or two Lorentz currents, or three R currents are potentially anomalous.\nTo address this problem we need a suitable realisation of R symmetry within\nour model. The R transformation produces a γ5 'rotation' on the supersymmetry generator Qα which must be realised on the right-moving current\nalgebra. One way would be to realise γ5 directly, using the Clifford algebra\n4\n\n\fgenerated by DX μ . However, all the fermions would then contribute with\nthe same sign to the potentially anomalous diagrams. In any event, all the\ngauge fermions will contribute with the same sign. This suggests the possibility that the R anomalies are cancelled by the contribution of the generation\nand Higgs fermions. Another possibility would be to invoke a Green-Schwarz\ncancellation mechanism [11], but this may not work as Bμν is removed from\nthe spectrum. As well as the 4 spacetime coordinate superfields on the string\nworldsheet, there will be 6 internal superfields Y m . The fermion components\nDY m generate a Clifford algebra, which includes a Lie subalgebra T generated by [DY m , DY n ]. The R charge may be realised as a 'handle' charge\nwithin this algebra. This requires that R acts appropriately on the gravitino\nψμ . The right-moving factor of ψmu is a spinor ψR in the Ramond ground\nstate, which carries T charges, so we can take R ∈ T . Let R0 be the weight\nof ψR in T . The most obvious choice would be to set R = R0 . However, it\nseems unlikely that this gives enough freedom to arrange for all the anomalies\nto cancel. However, there will be a SU(3) subalgebra S of T which stabilises\nψR , and we may take R = R0 + R1 with R1 ∈ S. It is now possible for the\nspectrum of R on the non-gauge fermions to be both biased and dispersed,\nso that a complete cancellation of R anomalies may be possible for some\nspecial choices of twisted boundary condition sets for the strings. The group\nU generating the twisted boundary conditions would commute with R. Because R lies within the right-moving current algebra, R will be defined on all\nstates, with chiral representations (and thus contributions to the anomalies\nof R) restricted to level zero. Note also that the scalar component of the\nconformal compensator χ has R = 0 and so leaves the breaking of R to φ. A\nby-product of this construction is that a realistic generation structure may\nbe organised by the need for R breaking string-scale insertions of exp(iφ) for\nHiggs couplings, leading to generation indexed coupling matrices of the form\nMjk = O(I R(j)+R(k) )g\n\n(8)\n\nwhere I represents an insertion factor. The strings in such a superconformal\nmodel may have a topological significance. Express the fractional deficit\nangle as\nδ\n1\n= .\n(9)\n2π\nν\nIf ν = N, an integer, this suggests an interpretation of the string worldsheet\nas a branching site for a ZN bundle, just as a set of branch points defines\n5\n\n\fa Riemann surface. This interpretation would be relevant to amplitudes\nfor processes involving linked strings, possibly selecting the ΓN subgroup\nas the relevant modular invariance group in situations where only the Nth\npower of a Dehn twist would be ZN trivial - otherwise, modular invariance\nin the presence of a background string could impose further restrictions on\nthe choice of twisted boundary conditions. Note that N would determine\nthe value of the dimensionless bare coupling constant g, which can otherwise\ntake an arbitrary value up to 4π, corresponding to δ = 2π.\n\n3\n\nSupersymmetry Breaking\n\nSince we have selected models with g field independent, the gaugino condensation mechanism for supersymmetry breaking [12,13] will not work. Consider, however, the supersymmetry variation of the gravitino field ψ which is\ngiven by\nδψ = Dǫ = dǫ + AR γ5 ǫ.\n(10)\nWith the natural gauge choice φ = 0 , we have AR = π −1 Dφ and eq.(10)\nbecomes\n1\nδψ = dǫ + γ5 ǫDφ\n(11)\nπ\nso that the global (dǫ = 0) variation of the Goldstino fermion χ is given by\nδχ = γ * δψ =\n\n1\n1\nγ * (Dφ)γ5 ǫ = δζ\nπ\nπ\n\n(12)\n\nwhere ζ is the superpartner of φ, so that we may identify χ = π −1 ζ, giving a natural candidate for the Goldstino multiplet in the vacuum state.\nThe Goldstone supermultiplet and the graviton multiplet together are thus\ngiven by the spin (1)L ⊗ (1 ⊕ 1/2)R heterotic level zero fields [14]. The\nscalar/pseudoscalar part is described by the complex field z = ψ + iφ. Supersymmetry breaking is characterised by the superpotential G. Note that\nthe gaugino condensation mechanism is ruled out in strictly D = 4 models\nby the field independence of g. The normalization of the kinetic term of φ\nthrough eq.(??), together with the fact that G should be independent of φ,\nwhich can be gauged away, gives\nG=\n\n1 2\nψ + G1\n2g 2\n6\n\n(13)\n\n\fwith G1 independent of z. This gives the z space a flat, cylindrical Kahler\ngeometry. G has a maximum at ψ = 0, with mψ = m3/2 . We may make a\ncomparison with the situation in conventional N = 1 supergravity where the\npotential depends on scalar fields through\nV = e−G (Tr[(∂∂ ∗ G)−1 ∂G∂ ∗ G] − 3)\n\n(14)\n\nwhere the (anti-)holomorphic differentials (∂ ∗ , ∂) are defined on chiral field\nspace. For a given gravitino mass m3/2 a pure supergravity theory is obtained\nin anti-deSitter space with curvature −3m23/2 and a flat spacetime is only\nobtained with the bracing effect of a nonzero ∂G, with the direction of ∂G\nin field space identifying the Goldstino multiplet. Our model uses the zero\nnorm tension compensator χ and the usual negative norm scalar compensator\nfor conformal symmetry in conventional N = 1 supergravity is not present.\nThe Goldstino can be identified in our model even at a stationary value\nof G, where it becomes ζ. Since now ∂G = 0 at the potential minimum,\nno cancelling negative term is required for Λ = 0, and indeed without the\nnegative norm compensator, eq.(14) takes the form\nV = e−G Tr[(∂∂ ∗ G)−1 ∂G∂ ∗ G]\n\n(15)\n\nand the balance between large terms of opposite sign is no longer needed.\nThe gravitino mass in the vacuum state will be given by\nm23/2 = e−G0\n\n(16)\n\nwhere G0 is the maximum value of G. This gives stable supersymmetry\nbreaking, which would be at a realistic scale for a suitable value of G0 . Such a\nvalue might be generated by renormalization group effects. The cosmological\nconstant may vanish naturally in this model, due to global superconformal\nsymmetry. The global superconformal invariance of the action under finite\nrescalings of gμν rather than of ĝμν would be used to demonstrate this. The\nsame brane/flux tube mechanism that cancels the anomalies of R invariance\nmay also make this symmetry viable at the quantum level. For this strategy\nto work, it would be necessary to apply the principle of global superconformal\ninvariance to show that the maximum of G lies on the surfaces D α = 0 for\nall Yang-Mills generators α, as without D terms the potential eq.(15) would\nalready give Λ = 0.\n\n7\n\n\fReferences\n[1] H.Kawai, D.C.Lewellen and S.H.H.Tye, Nucl. Phys. B 288 (1987) 1.\n[2] I.Antoniadis and C.Bachas, Nucl. Phys. B 298 (1988) 586.\n[3] I.Antoniadis, J.Ellis, J.S.Hagelin and D.V.Nanopoulos, Phys. Lett.\nB 205 (1988) 459.\n[4] P.van Nieuwenhuizen, Phys. Rep.86 (1981) 189.\n[5] S.L.Adler, Phys. Rev.177 (1969) 2426.\n[6] J.S.Bell and R.Jackiw, Nuovo Cimento 60A, (1967) 47.\n[7] E.Witten, Phys. Lett. B 153 (1985) 243.\n[8] D.Gross, J.Harvey, E.Martinec and R.Rohm, Nucl. Phys. B 256\n(1985) 253; 267 (1986) 75.\n[9] A.Vilenkin, Phys. Rev. D23 (1981) 852.\n[10] G. t'Hooft, Comm. Math. Phys117 (1988) 685.\n[11] M.Green and J.H.Schwarz Phys. Lett. B 149 (1984) 117.\n[12] S.Ferrara, L.Girardello and H.P.Nilles, Phys. Lett B 125 (1983) 457.\n[13] M.Dine, R.Rohm, N.Seiberg and E.Witten, Phys. Lett B 156 (1985)\n55.\n[14] M.Hewitt, hep-th 0302209.\n\n8\n\n\f"}