{"id": "http://arxiv.org/abs/hep-th/0111225v1", "guidislink": true, "updated": "2001-11-24T19:31:11Z", "updated_parsed": [2001, 11, 24, 19, 31, 11, 5, 328, 0], "published": "2001-11-24T19:31:11Z", "published_parsed": [2001, 11, 24, 19, 31, 11, 5, 328, 0], "title": "M-Theory on a Supermanifold", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-th%2F0111286%2Chep-th%2F0111291%2Chep-th%2F0111037%2Chep-th%2F0111228%2Chep-th%2F0111178%2Chep-th%2F0111055%2Chep-th%2F0111018%2Chep-th%2F0111281%2Chep-th%2F0111121%2Chep-th%2F0111016%2Chep-th%2F0111169%2Chep-th%2F0111006%2Chep-th%2F0111145%2Chep-th%2F0111005%2Chep-th%2F0111053%2Chep-th%2F0111119%2Chep-th%2F0111225%2Chep-th%2F0111237%2Chep-th%2F0111027%2Chep-th%2F0111235%2Chep-th%2F0111039%2Chep-th%2F0111072%2Chep-th%2F0111164%2Chep-th%2F0111032%2Chep-th%2F0111050%2Chep-th%2F0111002%2Chep-th%2F0111183%2Chep-th%2F0111041%2Chep-th%2F0111076%2Chep-th%2F0111262%2Chep-th%2F0111264%2Chep-th%2F0111115%2Chep-th%2F0111259%2Chep-th%2F0111285%2Chep-th%2F0111279%2Chep-th%2F0111213%2Chep-th%2F0111240%2Chep-th%2F0111091%2Chep-th%2F0111123%2Chep-th%2F0111230%2Chep-th%2F0111248%2Chep-th%2F0111105%2Chep-th%2F0111045%2Chep-th%2F0111092%2Chep-th%2F0111087%2Chep-th%2F0111150%2Chep-th%2F0111064%2Chep-th%2F0111108%2Chep-th%2F0111181%2Chep-th%2F0111029%2Chep-th%2F0111022%2Chep-th%2F0111215%2Chep-th%2F0111254%2Chep-th%2F0111112%2Chep-th%2F0111260%2Chep-th%2F0111127%2Chep-th%2F0111227%2Chep-th%2F0111042%2Chep-th%2F0111202%2Chep-th%2F0111219%2Chep-th%2F0111141%2Chep-th%2F0111128%2Chep-th%2F0111083%2Chep-th%2F0111243%2Chep-th%2F0111103%2Chep-th%2F0111218%2Chep-th%2F0111186%2Chep-th%2F0111017%2Chep-th%2F0111171%2Chep-th%2F0111265%2Chep-th%2F0111201%2Chep-th%2F0111163%2Chep-th%2F0111139%2Chep-th%2F0111199%2Chep-th%2F0111101%2Chep-th%2F0111138%2Chep-th%2F0111247%2Chep-th%2F0111188%2Chep-th%2F0111154%2Chep-th%2F0111094%2Chep-th%2F0111074%2Chep-th%2F0111098%2Chep-th%2F0111096%2Chep-th%2F0111106%2Chep-th%2F0111242%2Chep-th%2F0111085%2Chep-th%2F0111097%2Chep-th%2F0111174%2Chep-th%2F0111209%2Chep-th%2F0111111%2Chep-th%2F0111135%2Chep-th%2F0111190%2Chep-th%2F0111060%2Chep-th%2F0111124%2Chep-th%2F0111125%2Chep-th%2F0111058%2Chep-th%2F0111204%2Chep-th%2F0111046%2Chep-th%2F0111151%2Chep-th%2F0111077%2Chep-th%2F0111187&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "M-Theory on a Supermanifold"}, "summary": "A conjectured finite M-theory based on eleven-dimensional supergravity\nformulated in a superspace with a non-anticommutative <>-product of field\noperators is proposed. Supermembranes are incorporated in the superspace\n<>-product formalism. When the deformed supersymmetry invariant action of\neleven-dimensional supergravity theory is expanded about the standard\nsupersymmetry invariant action, the spontaneously compactified M-theory can\nyield a four-dimensional de Sitter spacetime inflationary solution with dark\nenergy described by the four-form F-fields. A fit to the present cosmological\ndata for an accelerating universe is obtained from matter fields describing the\ndominant dark matter and the four-form F-field dark energy. Chiral fermions are\nobtained from the M-theory by allowing singularities in the compact internal\nseven-dimensional space. The possibility of obtaining a realistic M-theory\ncontaining the standard model is discussed.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-th%2F0111286%2Chep-th%2F0111291%2Chep-th%2F0111037%2Chep-th%2F0111228%2Chep-th%2F0111178%2Chep-th%2F0111055%2Chep-th%2F0111018%2Chep-th%2F0111281%2Chep-th%2F0111121%2Chep-th%2F0111016%2Chep-th%2F0111169%2Chep-th%2F0111006%2Chep-th%2F0111145%2Chep-th%2F0111005%2Chep-th%2F0111053%2Chep-th%2F0111119%2Chep-th%2F0111225%2Chep-th%2F0111237%2Chep-th%2F0111027%2Chep-th%2F0111235%2Chep-th%2F0111039%2Chep-th%2F0111072%2Chep-th%2F0111164%2Chep-th%2F0111032%2Chep-th%2F0111050%2Chep-th%2F0111002%2Chep-th%2F0111183%2Chep-th%2F0111041%2Chep-th%2F0111076%2Chep-th%2F0111262%2Chep-th%2F0111264%2Chep-th%2F0111115%2Chep-th%2F0111259%2Chep-th%2F0111285%2Chep-th%2F0111279%2Chep-th%2F0111213%2Chep-th%2F0111240%2Chep-th%2F0111091%2Chep-th%2F0111123%2Chep-th%2F0111230%2Chep-th%2F0111248%2Chep-th%2F0111105%2Chep-th%2F0111045%2Chep-th%2F0111092%2Chep-th%2F0111087%2Chep-th%2F0111150%2Chep-th%2F0111064%2Chep-th%2F0111108%2Chep-th%2F0111181%2Chep-th%2F0111029%2Chep-th%2F0111022%2Chep-th%2F0111215%2Chep-th%2F0111254%2Chep-th%2F0111112%2Chep-th%2F0111260%2Chep-th%2F0111127%2Chep-th%2F0111227%2Chep-th%2F0111042%2Chep-th%2F0111202%2Chep-th%2F0111219%2Chep-th%2F0111141%2Chep-th%2F0111128%2Chep-th%2F0111083%2Chep-th%2F0111243%2Chep-th%2F0111103%2Chep-th%2F0111218%2Chep-th%2F0111186%2Chep-th%2F0111017%2Chep-th%2F0111171%2Chep-th%2F0111265%2Chep-th%2F0111201%2Chep-th%2F0111163%2Chep-th%2F0111139%2Chep-th%2F0111199%2Chep-th%2F0111101%2Chep-th%2F0111138%2Chep-th%2F0111247%2Chep-th%2F0111188%2Chep-th%2F0111154%2Chep-th%2F0111094%2Chep-th%2F0111074%2Chep-th%2F0111098%2Chep-th%2F0111096%2Chep-th%2F0111106%2Chep-th%2F0111242%2Chep-th%2F0111085%2Chep-th%2F0111097%2Chep-th%2F0111174%2Chep-th%2F0111209%2Chep-th%2F0111111%2Chep-th%2F0111135%2Chep-th%2F0111190%2Chep-th%2F0111060%2Chep-th%2F0111124%2Chep-th%2F0111125%2Chep-th%2F0111058%2Chep-th%2F0111204%2Chep-th%2F0111046%2Chep-th%2F0111151%2Chep-th%2F0111077%2Chep-th%2F0111187&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A conjectured finite M-theory based on eleven-dimensional supergravity\nformulated in a superspace with a non-anticommutative <>-product of field\noperators is proposed. Supermembranes are incorporated in the superspace\n<>-product formalism. When the deformed supersymmetry invariant action of\neleven-dimensional supergravity theory is expanded about the standard\nsupersymmetry invariant action, the spontaneously compactified M-theory can\nyield a four-dimensional de Sitter spacetime inflationary solution with dark\nenergy described by the four-form F-fields. A fit to the present cosmological\ndata for an accelerating universe is obtained from matter fields describing the\ndominant dark matter and the four-form F-field dark energy. Chiral fermions are\nobtained from the M-theory by allowing singularities in the compact internal\nseven-dimensional space. The possibility of obtaining a realistic M-theory\ncontaining the standard model is discussed."}, "authors": ["J. W. Moffat"], "author_detail": {"name": "J. W. Moffat"}, "author": "J. W. Moffat", "arxiv_comment": "25 pages, LaTeX file, no figures", "links": [{"href": "http://arxiv.org/abs/hep-th/0111225v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-th/0111225v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-th/0111225v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-th/0111225v1", "journal_reference": null, "doi": null, "fulltext": "M-Theory on a Supermanifold\nJ. W. Moffat\nDepartment of Physics, University of Toronto, Toronto, Ontario M5S 1A7, Canada\n\narXiv:hep-th/0111225v1 24 Nov 2001\n\nAbstract\nA conjectured finite M-theory based on eleven-dimensional supergravity\nformulated in a superspace with a non-anticommutative ♦-product of field\noperators is proposed. Supermembranes are incorporated in the superspace\n♦-product formalism. When the deformed supersymmetry invariant action of\neleven-dimensional supergravity theory is expanded about the standard supersymmetry invariant action, the spontaneously compactified M-theory can\nyield a four-dimensional de Sitter spacetime inflationary solution with dark\nenergy described by the four-form F-fields. A fit to the present cosmological\ndata for an accelerating universe is obtained from matter fields describing the\ndominant dark matter and the four-form F-field dark energy. Chiral fermions\nare obtained from the M-theory by allowing singularities in the compact internal seven-dimensional space. The possibility of obtaining a realistic M-theory\ncontaining the standard model is discussed.\n\nThe great tragedy of Science – the slaying of a beautiful hypothesis by an ugly fact.\nThomas Huxley\ne-mail: john.moffat@utoronto.ca\n\n1\n\nIntroduction\n\nFor almost thirty years the idea that there exists a supersymmetry between fermion\nand boson particles has been one of the basic motivations for constructing a unified\ntheory of gravitation and particle interactions. This culminated in the formulation\nof string theories and their dual relationships and M-theory, from which the five\nbasic string theories emanate by compactification [1, 2].\nThe description of the fermions of the standard model with the group structure SU(3) × SU(2) × U(1) in Kaluza-Klein and supergravity theories became\nproblematic due to Witten's application of the Atiyah-Hirzbruch chiral index theorem [3, 4, 5, 6, 7]. The possibility of using a smooth internal space with continuous\nisometries was prevented by a no-go theorem, and spelt the end of interest in a\nconventional interpretation of Kaluza-Klein theories and eleven-dimensional supergravity theory. Superstring theory in ten dimensions now came to the forefront and\n1\n\n\fbegan to dominate the particle physics and unification scene, since the compactifications of string theory did not suffer the fate of the chiral index no-go theorem, and\npromised to resolve the problem of the consistency of quantum gravity by producing\nfinite calculations of graviton scattering amplitudes.\nThe advent of duality theorems and the discovery that an eleven-dimensional\nM-theory with N=1 supersymmetry should constitute the fundamental unified theory with string theory evolving from a compactification of the eleventh dimension,\nraised again the question as to why nature would stop at ten dimensions in its use\nof supersymmetry. The maximum supersymmetry was obtained in eleven dimensions – not ten – as in string theory. Beyond eleven dimensions, there ceased to\nbe a supersymmetry and if one entertained two time dimensions severe causality\nproblems would ensue. M-theory has eleven-dimensional supergravity theory as a\nlow energy limit with its associated type IIA string theory and mass spectrum, so\neleven-dimensional supergravity rose like the 'phoenix from the ashes' and became\nagain a subject of intensive research.\nNow the questions arise: What constitutes an M-theory? How many degrees of\nfreedom does M-theory possess? One important fact must be considered, namely,\nthat there are no strings in eleven-dimensional M-theory, because the only boson\ncomponents of the action are the three-form potential AM N P where M, N, P =\n0, 1...10 and the four-form FM N P Q obtained from the curl of AM N P . So we cannot\nrely on the finiteness of string theory to guarantee a finite eleven-dimensional Mtheory. However, supermembranes can couple to AM N P and FM N P Q , so these higherdimensional objects can play a fundamental role in eleven dimensions. But such\nbranes cannot be quantized in perturbation theory, because the standard method\nof string perturbation theory quantization does not work. Each term in string\nperturbation theory corresponds to a two-dimensional worldsheet with an increasing\nnumber of holes. A sum over all topologies of the world sheet is performed. But for\nsurfaces with more than two dimensions– as encountered with branes– we do not\nknow how to do this. Powerful theorems in mathematics preclude the possibility\nof doing this, since we are unable to classify surfaces with p > 3. Attempts have\nbeen made to quantize the supermembrane in a non-covariant light front gauge [8].\nThe results indicate that the supermembrane has a continuous spectrum leading to\ninstability.\nTreating branes as fundamental objects raises the unpleasant question of how to\nperform non-perturbative quantization. So the issue of how to implement finiteness\nof calculations of amplitudes in M-theory and quantum gravity has returned in a new\nguise. The question arises whether the resolution of the finiteness problem in eleven\ndimensions would lead to new physics beyond string theory on compactification of\nthe correct M-theory.\nHor̆ava and Witten [9] performed an orbifold compactification of M-theory along\na finite length of the eleventh dimension and obtained a ten-dimensional bulk with\ntwo (9+1) branes, each with an E8 heterotic string gauge structure. It was shown\nthat this picture could be compacitfied to a five-dimensional bulk-brane scheme and\n2\n\n\fthis led to the phenomenological Randall-Sundrum scenario [10]. Due to the existence of boundaries in the bulk world and associated discontinuities at the junction\nof bulk-brane, the chiral no-go theorem was avoided. However, we are still left with\nthe unanswered question of the meaning of the original eleven-dimensional M-theory.\nOne suggestion for an M-theory was to introduce noncommuting eleven-dimensional\ncoordinates in the form of N ×N matrices and construct a Lagrangian with noncommuting coordinates in a light-front gauge and then take the N → ∞ limit to obtain\na super Yang-Mills gauge structure [11]. However, this theory is tied to the specific\nlight-front gauge and it is not clear how it produces a finite eleven-dimensional theory. A rigorous proof that it produces a gauge-free eleven-dimensional supergravity\ntheory at low energies is lacking.\nWe shall propose that M-theory is structured on an eleven-dimensional supermanifold of superspace coordinates with both commuting 'boson' and anticommuting 'fermion' Grassmann coordinates [12, 13, 14, 15]. An associated operator Hilbert\nspace has noncommuting and non-anticommuting coordinates and we map this operator space to the space of ordinary superspace coordinates and fields by a ◦-product\nof field operators or a ♦-product of field operators. The eleven-dimensional supergravity action is now invariant under a generalized 'deformed' group of supersymmetry transformations. This formalism leads to a finite and unitary perturbation\ntheory in eleven dimensions. The noncommutative quantum field theory, based on\nthe familiar 'bosonic' commuting coordinates xM , cannot by itself lead to a renormalizable or finite M-theory.\nRecent observations of supernovae and the cosmic microwave background have\nled to the mounting evidence that the universe is presently undergoing an accelerating expansion [18, 19]. This means that either there is a positive, small cosmological\nconstant or a slowly varying quintessence field energy (dark energy) [20] that dominates the present universe. This has led to a crisis in string theory and M-theory,\nsince it is difficult to invoke a positive cosmological constant and the associated de\nSitter (dS) spacetime in supersymmetric theories that produce stable and consistent\nsolutions. This is particularly true for eleven-dimensional M-theory and supergravity and ten-dimensional string theory. Moreover, eternal quintessence acceleration\nand dS spacetimes lead to future cosmological event horizons which prevent the\nconstruction of an S-matrix theory – a serious problem for string theory. In early\nconstructions of eleven-dimensional supergravity, it was realized that supersymmetric vacua preferred a spontaneous compactification resulting in a four-dimensional\nanti-de Sitter (AdS) spacetime and a compact internal seven-dimensional compact\nspace [21, 22, 23, 40]. This compacitification naturally selected the dimensions of\nspacetime to be four.\nA spontaneous compactification of our M-theory to a product space M4 × M7 ,\nwhere M4 is a maximally symmetric Friedmann-Robertson-Walker spacetime and\nM7 is a compact Einstein space, can produce solutions of the cosmological field\nequations which possess AdS and dS solutions in four dimensions as well as a solution corresponding to a zero four-dimensional and seven-dimensional cosmological\n3\n\n\fconstant. We postulate that the four-form field strengths of supergravity describe\nthe 'dark energy' associated with quintessence and the vacuum energy.\nWhen we take the limit of standard eleven-dimensional supergravity and its associated supersymmetry transformations, we obtain on compactification the familiar\nresult of the product of an AdS spacetime and a positively curved seven-dimensional\nEinstein space. By including matter fields obtained from a compactification of our\nM-theory to four dimensions and the vacuum dark energy solution with a small\npositive cosmological constant λ4 , we can obtain a fit to the present cosmological\ndata describing an accelerating universe.\nAn old problem in eleven-dimensional supergravity is obtaining a satisfactory\nisometry group on compactification that can include the standard model SU(3) ×\nSU(2) × U(1). In the next section, we shall review the problem of obtaining chiral fermion representations and non-Abelian gauge fields from compactifications of\neleven-dimensional M-theory.\n\n2\n\nThe Chiral Fermion Problem\n\nLet us review the origin of the chiral fermion no-go theorem. Compact internal\nspaces are characterized by an index [3] which determines the number of chiral\nfermions. The nature and application of this index in the context of dimensional\nreduction has been discussed by Witten and Wetterich [4, 5] and in the context\nof non-Riemannian geometry in ref. [7]. Consider an operator D acting on spinors\ncontaining first derivatives of the spinor and non-derivative terms and that this\noperator commutes with existing gauge transformations and anticommutes with Γd ,\nthe d-dimensional internal space gamma matrix. The chiral index is defined by\n+\n−\n−\nNC (D) = n+\nC − nC − nC̄ + nC̄ ,\n\n(1)\n\nwhere n+\nC denotes the number of zero modes in the d-dimensional internal space of\nthe Weyl spinor ψ + belonging to the complex representation C and with the same\n+\nkind of meaning for n−\nC , nC̄ etc. We suppose that we perform a dimensional reduction\non the (d + 4) space to a Dirac operator D, so that D is the mass operator and NC\ncounts the number of chiral four-dimensional left-handed fermion generations in the\nC representation.\nWe denote by eA\nM the D-dimensional vielbein where M, N denote the world space\ncoordinates and A, B the tangent space coordinates. If the viebein has an inverse\nB\nB\neM\nA eM = δA ,\n\nN\nN\neA\nM eA = δM ,\n\n(2)\n\nthen we have\nΓM DM ψ = g M N eN A ΓA DM ψ,\n\n(3)\n\nwhere the metric gM N may also have an inverse\nP\ngM N g N P = δM\n.\n\n4\n\n(4)\n\n\fThe internal d-dimensional Dirac operator is\nΓm Dm ψ = g Σ∆ e∆m Γm DΣ ψ.\n\n(5)\n\nIf the vielbein em\n∆ , where m, n and ∆, Σ denote the internal tangent space and\nspace indices, respectively, is invertible everywhere, then the operator Γ∆ D∆ is an\nelliptic operator. The index NC remains invariant under continuous changes of\nthe metric, the vielbein and the connections for elliptic operators that preserve the\nisometries of the space. On compact spaces we have [4]\nNC (D) = NC (D + aO).\n\n(6)\n\nHere, a is arbitrary and O is an operator satisfying\n[G, O] = 0,\n\n{Γd , O} = 0,\n\n(7)\n\nwhere G denotes the generators of the isometry group. For everywhere invertible\nvielbeins the chiral index NC (D) = 0 and spinors have a vector-like behaviour in\nthe compact internal space.\nWe must allow for singularities in our internal compact space in order to obtain\nchiral fermions on dimensional reduction. This has led recently to a study of G2\nholonomy spaces which contain conical singularites [24, 25, 26].\nThere are no complex spinor representations in an odd-dimensional space, and\nin particular in the eleven-dimensional space of M-theory. The chiral fermions must\narise from a compactification of the eleven-dimensional M-theory space M11 = M4 ×\nM7 . For the choice M7 = S 7 , we cannot permit a singularity within the smooth\nseven sphere S 7 .\nIf we gauge the supergravity internal space by allowing for non-compact groups\nsuch as SO(p, r), then we find that there can exist singular points in the group space\nmanifold and the vielbeins are not invertible at these singular points, leading to a\nnon-vanishing chiral index and chiral fermions. These possibilities were recognized\nsoon after the discovery of the no-go theorems [5, 6, 7] but they were not pursued in\nearnest, because superstrings again became the subject of dominant interest. The\nnon-compact versions of internal spaces suffer from instabilities and the lack of a\nphysical mass spectrum.\nSuperstrings have extra gauge fields within their higher-dimensional spaces and\nthese automatically guarantee a non-vanishing chiral index NC . Indeed, conventional Kaluza-Klein theories can be extended to include extra gauge fields [27] but\nsuch models were considered unattractive, because they ruined the pure higherdimensional gravity approach of Kaluza-Klein theories and supergravity theories.\nThe proposed solution of the chiral fermion problem in M-theory by Acharya\nand Witten [24] compactifies M-theory on a seven manifold X of G2 holonomy that\npreserves the supersymmetric ground state. It leads naturally to a four-dimensional\ntheory with N = 1 supersymmetry. When the manifold X is smooth, then one\nobtains Abelian gauge groups only without chiral fermions. However, the singular\n5\n\n\fmanifolds of G2 holonomy offer the possibility of generating non-Abelian gauge\ngroups and chiral fermions. In codimension six, M-theory singularities can occur\nin Calabi-Yau threefolds, which can be embedded in a manifold of G2 holonomy.\nThere are no known complete classifications of G2 holonomy spaces. Nevertheless,\nthe known isolated singularities of G2 -manifolds are conical singularities, and some of\nthem generate chiral fermions and certain special models of this kind lead to anomaly\ncancellation. Acharya and Witten [24] have investigated examples constructed by\ntaking the quotient of a conical hyper-Kahler eight-manifold by a U(1) symmetry\ngroup. The compactification to four-dimensional spacetime leads to a flat Minkowski\nspacetime with vanishing cosmological constant. At present, it is not known how to\ncompactify a seven manifold to a four-dimensional de Sitter spacetime with chiral\nfermions and non-Abelian gauge fields.\n\n3\n\nThe Accelerating Universe and de Sitter Spaces\n\nMuch of the research in particle physics over the past thirty years has focussed on\nfundamental interactions and their unification in relation to supersymmetry. This is\ncertainly true for string theory and M-theory. We know that supersymmetry must\nbe badly broken for energies less than about 1−10 TeV, so we are already confronted\nwith the need to break supersymmetry at low energies. There is no well-defined theory for doing this and this has been a thorn in the side of string theory research for\na long time. The issue of supersymmetry breaking has been exacerbated recently\nwith the cosmological observations based on supernovae and of the anisotropy of\nthe cosmic microwave background, which suggest that the universe entered a stage\nof accelerated expansion a few billion years after the big bang [18, 19]. Standard\ninflationary models are based on the idea that the energy-momentum tensor is dominated by the potential energy of a scalar field, V (φ), with V > 0 [28]. The scalar\nfield is assumed to be slowly rolling with a flat potential with φ̇2 ≪ V (φ) and the\nlimiting case φ̇ = 0 corresponds to a cosmological constant with V > 0. When\nM/string theory is compactified on an internal compact space, then a supersymmetric vacuum will produce a stable AdS (3+1) space (with negative cosmological\nconstant) and an Einstein seven-dimensional space with positive curvature. When\nwe attempt to extend these solutions to (3+1) dS spacetimes and Einstein spaces\nwith negative curvature, then the solutions are unstable for supersymmetric vacua\nand even for broken supersymmetric vacua [29, 30].\nRecently, investigations have centered on obtaining stable dS spacetimes in extended four-dimensional supergravity theories. Whereas such solutions may be\nobtainable, they do not help us in making progress in string theory or higherdimensional unification theories such as M-theory. This has led to a renewed interest\nin studying gauged higher-dimensional supergravity theories with non-compact internal spaces and finite volume [31]. However, such theories immediately run into\nserious difficulties. To be physically realistic and correspond to a stable universe,\n6\n\n\fthey must possess a discrete mass spectrum with a mass gap. Such internal noncompact spaces have been studied by Nicolai and Wetterich [32], who found that\nit is possible to obtain normalizable wave functions associated with a discrete spectrum when appropriate boundary conditions are imposed. However, a more serious\nproblem arises due to the kinetic energies of scalar and antisymmetric gauge fields\npossessing the wrong sign, as is to be expected for non-compact spaces. These\nanomalous kinetic terms violate unitarity and cause the theories to be unstable and\nunphysical. One might argue that at the scale of the Hubble distance H0−1 , such\nviolations of unitarity can be ignored but this is courting trouble! What is inherently unphysical will stay to haunt the innocent researcher and invariably lead to\nunpleasant unphysical behaviour.\n\n4\n\nComplementary Chiral Symmetry and de Sitter\nSpace Problems\n\nIn our search for a consistent unified description of fundamental forces including\ngravity based on an M-theory in eleven dimensions, we are currently caught in a\ndilemma. To guarantee a physical chiral fermion mass spectrum, we would prefer\nto compactify the M-theory spontaneously within a compact space with orbifold\nsingularities or isolated singularities such as conical singularities. However, when\nwe attempt to obtain stable dS solutions within a supersymmetric scheme or within\na broken supersymmetric framework (dS solutions in M-theory would break most\nor all of the supersymmetry), then we fail to do so within a conventional compact\ninternal space compactification. We could avoid the chiral index no-go theorem by\nattempting gauged supergravity models with non-compact internal group structures,\nthereby, finding dS and inflationary solutions but these may still not be stable for\nbroken supersymmetry ground states and they suffer from serious unitarity violations with their related instabilities.\nThere is still the third problem that if we succeed in deriving a stable dS solution\nin M-theory with chiral fermions associated with the compactification, then we are\nfaced with potential generic future cosmological horizons which make any attempt\nto formulate a physical S-matrix doomed to failure [33, 34]. Since string theory is\na first quantized S-matrix theory and any conceivable M-theory formulated within\nscenarios based on modern physics is only sensibly formulated within standard Smatrix theory, then we are confronted with an uncontrollable foundation for the\ntheory of everything!\nThe prospect of having to formulate a theory of quantum gravity in de Sitter\nspace is unpleasant to say the least. It is hard to define meaningful physical operators in de Sitter space, there is no unique vacuum in de Sitter space and there\nis the problem of constructing a field theory with only a finite number of degrees\nof freedom. A glance at a possible quantum gravity theory based on perturbation\ntheory, shows that spin 2 propagators are unwieldy in x-space and it is hard to make\n7\n\n\fsense of Green's functions in momentum space, for Fourier transforms have to be\nperformed on operator spaces that do not possess a time-like or null-like infinity and\nthe operators do not form a complete set of observables in the usual sense. Much\nof the progress in physics since Newton, has been made using some form of perturbation theory. Little or no progress has been made in studies of non-perturbative\nquantum field theory. However, it might seem that ultimately a non-perturbative\nroute towards a workable M-theory is needed.\n\n5\n\nSupermanifolds\n\nIn general, we can parameterize the superspace coordinates as ρM̄ = (xy , β α ) where\nthe xy are the commuting spacetime coordinates that belong to a smooth topological\nmanifold and the β α is an anticommuting spinor field, {β α , β σ } = 0.\nAssociated with our supervector space S is the S-parity mapping P : S → S\n~ =X\n~c + X\n~ a by the rule [35, 36]:\nacting on an arbitrary supervector X\n~ =X\n~c − X\n~ a.\nP(X)\n\n(8)\n\n~ we have\nFor a pure supervector X,\n~\n\n~ = (−1)ǫ(X) X,\n~\nP(X)\n\n(9)\n\n~ = 0 for a c-number commuting supervector and ǫ(X)\n~ = 1 for an antiwhere ǫ(X)\ncommuting supervector.\nFor real superspaces Rp,q where p and q denote the dimensions of the x and\nβ coordinates, we can introduce general coordinate transformations. Consider the\none-to-one mapping of Rp,q on itself. This is\n′\n\nρM → ρ M = f M (ρ).\n\n(10)\n\nWe shall restrict ourselves to supersmooth transformations and the condition for an\ninvertible transformation is that the supermatrix\nN\nHM\n= ∂M f N (ρ)\n\n(11)\n\nis non-singular at each point ρM ∈ Rp,q . The set of all invertible supersmooth\ntransformations (11) forms a group called the supergroup of diffeomorphism transformations. We can also have superalgebras A which are Z2 -graded linear spaces\nS = Sc ⊕ Sa with the multiplication law\n[A, B} = A * B − (−1)ǫ(A)ǫ(B) B * A,\n\n(12)\n\nwhere A and B are arbitrary pure elements and [..., ...} is the graded Lie superbracket. The super-Jacobi identities are\n(−1)ǫ(A)ǫ(C) [A, [B, C}} + (−1)ǫ(B)ǫ(A) [B, [C, A}} + (−1)ǫ(C)ǫ(B) [C, [A, B}} = 0. (13)\n8\n\n\fFor arbitrary elements A, B and C we have\n[A, B} = [Ac , Bc ] + [Ac , Ba ] + [Aa , Bc ] + {Aa , Ba }.\n\n(14)\n\nFor super Lie algebras A one can connect a super Lie group G by the exponential\nrule: g(ξ i ) = exp(a) where a = ξ i ei , ei is the basis for G, a are the super Lie\nalgebra elements and the ξ i (i = 1, 2, ..., dim G) are the components of the Lie\nalgebra elements which play the role of local coordinates in the neighborhood of the\nidentity of the group manifold [36]. We have a generalized Poincaré supergroup and\nsuperalgebra which are extensions of the corresponding standard Poincaré group\nand algebra.\n\n6\n\nM-Theory Based on Noncommutative and NonAnticommutative Geometry\n\nIf we believe that there exists a physical, unified description of fundamental interactions described by an eleven-dimensional M-theory, then we must seek an elevendimensional structure that produces a finite M-theory, compactifies to a (3+1) spacetime and a seven-dimensional space with chiral fermions and contains solutions to\nthe field equations which describe a stable de Sitter space. Such a scenario should\nlead to a finite quantum gravity in four dimensions and give a realistic description of cosmology and contain the standard model of quarks and leptons. The\nsuperspace contemplated can allow a generalization of the standard supersymmetry\ntransformations associated with eleven-dimensional supergravity and a generalized\nsupersymmetric ground state. These new supersymmetry transformation laws can\nbe considered as deformations of the standard classical supersymmetry transformations. We shall show that such a generalization of the supersymmetric invariance\ngroup of supergravity can allow four-dimensional de Sitter solutions.\nInstead of pursuing a non-perturbative quantization of supermembranes in eleven\ndimensions, we shall introduce a superspace with supercoordinates [12, 13, 14, 15]\nρM = xM + β M ,\n\n(15)\n\nwhere the xM are eleven-dimensional commuting coordinates and β M are Grassmann\nanticommuting coordinates, so they are even and odd elements of a Grassmann\nalgebra, respectively.\nBoth noncommutative and non-anticommutative geometries can be unified within\nthe superspace formalism using the ◦-product of two operators fˆ and ĝ [12, 13, 14,\n15]:\n\u0014\n\u0012\n\u0013\n\u0015\n1 MN ∂\n∂\nˆ\n(f ◦ ĝ)(ρ) = exp ω\nf (ρ)g(η)\n2\n∂ρM ∂η N\nρ=η\n1\n= f (ρ)g(ρ) + ω M N ∂M f (ρ)∂N g(ρ) + O(|ω|2),\n2\n9\n\n(16)\n\n\fwhere ∂M = ∂/∂ρM and ω M N is a nonsymmetric tensor\nω M N = τ M N + iθM N ,\n\n(17)\n\nwith τ M N = τ N M and θM N = −θN M . Moreover, ω M N is Hermitian symmetric\nω M N = ω †M N , where † denotes Hermitian conjugation. The familiar commutative\ncoordinates of spacetime are replaced by the superspace operator relations\n[ρ̂M , ρ̂N ] = 2β M β N + iθM N ,\n\n(18)\n\n{ρ̂M , ρ̂N } = 2xM xN + 2(xM β N + xN β M ) + τ M N .\n\n(19)\n\n[x̂M , x̂N ] = iθM N .\n\n(20)\n\nIn the limits that β M → 0 and |τ M N | → 0, we get the familiar expression for\nnoncommutative coordinate operators\n\nIn the limits xM → 0 and |θM N | → 0, we obtain the Clifford algebra anticommutation relation\n{β̂ M , β̂ N } = τ M N .\n(21)\n\nWe shall use the simpler non-anticommutative geometry obtained when θM N =\n0 to construct the M-theory, because it alone can lead to a finite and unitary\nquantum field theory and quantum gravity theory [12, 13, 14, 15]. In the nonanticommutative field theory formalism, the product of two operators fˆ and ĝ has\na corresponding ♦-product\n∂\n∂\n1\n(fˆ♦ĝ)(ρ) = exp τ M N M N f (ρ)g(η)\n2\n∂ρ ∂η\n\u0014\n\n\u0013\n\n\u0012\n\n\u0015\n\nρ=η\n\n1\n= f (ρ)g(ρ) + τ M N ∂M f (ρ)∂N g(ρ) + O(τ 2 ).\n(22)\n2\nWe choose as the basic action of the M-theory, the CJS [38] action for elevendimensional supergravity, replacing all products of field operators with the ♦-product.\nThe action is invariant under the generalized ♦-product supersymmetry gauge transformations of the vielbein eA\nM , the spin 3/2 field ψM and the three-form field AM N Q .\nOur M-theory has as a low energy limit the CJS supergravity theory when |τ M N | → 0\nand β M → 0.\nAlthough we derive many of our basic results for our field theory formalism in\nthe superspace configuration space, in practice all calculations of amplitudes using\nour generalized Feynman rules will be performed in momentum space. To this end,\nwe must make a simplifying ansatz that defines the Fourier transform of an operator\nfˆ(ρ):\nZ\n1\nˆ\ndD p exp(ipρ)f ̃(p).\n(23)\nf (ρ) =\n(2π)D\n10\n\n\fWhen this Fourier transform of the operator fˆ(ρ) is invertible, then we can calculate matrix elements in momentum space without having to concern ourselves\nwith additional volume factors that can occur due to integrations over the Grassmann coordinates β. These additional volume factors occur in standard superspace\nintegrations [35].\nWe have for the ♦-product the exponential function rule\n1\nexp(ikρ)♦ exp(iqρ) = exp[i(k + q)] exp (kτ q) ,\n2\n\u0015\n\n\u0014\n\n(24)\n\nwhere kτ q = kM τ M N qN . Then for the ♦-product of two operators fˆ and ĝ we get\n(fˆ♦ĝ)(ρ) =\n\n1\n(2π)2D\n\nZ\n\n1\nd kd q f ̃(k)g̃(q) exp (kτ q) exp[i(k + q)ρ],\n2\n\u0015\n\n(25)\n\n1\n(2π)D\n\ndD ρ exp(−ikρ)fˆ(ρ).\n\n(26)\n\nD\n\nwhere\nf ̃(k) =\n\n\u0014\n\nD\n\nZ\n\nIt was demonstrated in previous work [13, 14, 15], that scalar quantum field\ntheory and weak field quantum gravity are finite to all orders of perturbation theory,\nand the S-matrix for these theories is expected to obey unitarity. The regularization\nof the ultraviolet divergence of the standard local point-like quantum field theory\nis caused by an exponential damping of the Feynman propagator. The modified\n ̄ F is defined by the vacuum expectation value of the timeFeynman propagator ∆\nordered ♦-product\n ̄ F (ρ − η) ≡ h0|T (φ(ρ)♦(η))|0i\ni∆\ni Z dD k exp[−ik(ρ − η)] exp[− 12 (kτ k)]\n=\n.\n(2π)D\nk 2 + m2 − iǫ\n\n(27)\n\nSince we shall be performing all the calculations of Feynman graphs in momentum\nspace, the limit ρ → η in (27) is not rigorously applied.\nIn momentum space we choose the canonical value for the symmetric tensor\nτ μν = δ μν /Λ2 where Λ denotes an energy scale. We shall set Λ equal to the eleven(11)\ndimensional Planck mass MPL and since the eleven-dimensional gravitational constant, G(11) , is proportional to Newton's constant i.e. the inverse of the Planck mass\nsquared, then our M-theory is free of arbitrary parameters. We obtain in momentum\nspace\n\u0013\n\u0012\n2\n\n ̄ F (p) =\ni∆\n\np\ni exp − 2Λ\n2\n\np2 + m2 − iǫ\n\n,\n\n(28)\n\nwhere p denotes the Euclidean D-momentum vector. This reduces to the standard\ncommutative field theory form for the Feynman propagator\ni∆F (p) =\n\np2\n11\n\ni\n+ m2 − iǫ\n\n(29)\n\n\fin the limit |τ μν | → 0 and Λ → ∞.\nAn analysis of scattering amplitudes shows that due to the numerator of the\nmodified Feynman propagator being an entire function of p2 , there are no unphysical singularities in the finite complex p2 plane and the Cutkosky rules for the absorptive part of the scattering amplitude are satisfied, leading to unitarity of the\nS-matrix [14].\nAn analysis of the higher-dimensional field theories, including supersymmetric\ngauge theories generalized to the non-anticommutative formalism, shows that they\nwill also be finite to all orders of perturbation theory. This result is mainly due to\nthe fundamental length scale l in the theory that owes its existence to a quantization\nof spacetime. When l → 0 (Λ → ∞) the non-anticommutative field theories reduce\nto the standard local point particle field theories which suffer the usual difficulties\nof infinities and non-renormalizable quantum gravity.\nOur finite field theory formalism is based on a nonlocal field theory, due to\nthe infinite number of derivatives in the exponential function that occurs in our\n◦-product or ♦-product of field operators. The nonlocal modification of standard\nlocal point field theory occurs at short distances or high energies where accelerator\nphysics has not been probed.\nIt should be emphasized that the promise of significant progress in noncommutative quantum field theory has not been fulfilled [37, 16, 17]. The planar Feynman\ngraphs of perturbative noncommutative scalar and Yang-Mills field theories, in which\nthe actions are described by Groenwald-Moyal ⋆-products of field operators, are as\ndivergent as in local point field theory, so that the ultraviolet behaviour of scattering\namplitudes is no better than in the standard renormalizable theories, albeit that the\nnon-planar graphs do exhibit an oscillatory damping of ultraviolet divergences. This\nis also true of noncommutative weak field quantum gravity [16, 17] which continues\nto be nonrenormalizable. On the other hand, the non-anticommutative quantum\nfield theories in superspace are perturbatively finite and unitary. However, all these\nquantum field theories are nonlocal at short distances and further study of such\nnonlocal field theories is required.\nWe can now contemplate an M-theory which is finite to all orders of perturbation\ntheory and contains an invariance of the eleven-dimensional supergravity under a\ngeneralized supersymmetry transformation with a ground state that reduces to the\nstandard supersymmetric ground state of CJS in the limit that the energy scale\nΛ → ∞.\n\n7\n\nSuperspace M-Theory Action\n\n3\nThe field content consists of the vielbein eA\nM , a Majorana spin 2 ψM , and of a\ncompletely antisymmetric gauge tensor field AM N P . The metric is (− + + + ...+)\nand the eleven-dimensional Dirac matrices satisfy\n\n{ΓA , ΓB } = −2ηAB ,\n12\n\n(30)\n\n\fwhere ηAB denotes the flat Minkowski tangent space metric. Moreover, ΓA1 ...AN\ndenotes the product of NΓ matrices completely antisymmetrized.\nOur superspace M-theory Lagrangian, using the ♦-product has the form [38, 39,\n40]:\nLSG = −\n\n1\ni\nω + ω̂\n1\n♦ψP − e♦FM N P Q ♦F M N P Q\ne♦R(ω)♦ − e♦ψ̄M ♦ΓM N P DN\n2\n4κ\n2\n2\n48\n\u0012\n\n+\n\n\u0013\n\nκ\ne♦(ψ̄M ♦ΓM N OP QR ψN + 12ψ̄ P ♦ΓOR ψ Q )♦(FP QOR + F̂P QOR )\n192\n2κ O1 O2 O3 O4 P1 P2 P3 P4 M N R\n+\nǫ\nFO1 O2 O3 O4 ♦FP1 P2 P3 P4 ♦AM N R ,\n(144)2\n\n(31)\n\nwhere R(ω)♦ is the scalar contraction of the curvature tensor\nRM N AB = ∂M ωN AB − ∂N ωM AB + ωM A C ♦ωN CB − ωN A C ♦ωM CB ,\n\n(32)\n\nand FM N OP is the field strength defined by\nFM N OP = 4∂[M AN OP ] ,\n\n(33)\n\nwith [...] denoting the antisymmetrized sum over all permutations, divided by their\nnumber.\nThe covariant derivative is\n1\nDN (ω)ψM = ∂N ψM + ωN AB ♦ΓAB ψM .\n4\n\n(34)\n\nThe spin connection ωM AB is defined by\n0\nωM AB = ωM\nAB (e) + TM AB ,\n\n(35)\n\nwhere TM AB is the spin torsion tensor.\nThe transformation laws are\nA\nδeA\nM = −iκǭ♦Γ ψM ,\n\nδψM =\n\n1\ni\n1\nO\nDM (ω̂)♦ǫ +\n(ΓOP QR M − 8ΓP QR δM\n)ǫ♦F̂OP QR ≡ D̂M ǫ,\nκ\n144\nκ\n3\nδAM N P = ǭ♦Γ[M N ψP ] ,\n2\n\n(36)\n(37)\n(38)\n\nwhere\nF̂M N P Q = FM N P Q − 3κψ̄[M ♦ΓN P ψQ] .\n\n(39)\n\niκ2\nψ̄O ♦ΓM AB OP ψP .\n4\n\n(40)\n\nWe also have\nω̂M AB = ωM AB +\n\n13\n\n\fIn the limit |τ M N | → 0 and β M → 0, (31) reduces to the CJS eleven-dimensional\nsupergravity Lagrangian [38], which should be the correct low energy limit of an\nM-theory. The finiteness and gauge invariance of the M-theory is guaranteed by the\nnon-anticommutative field theory [13, 14, 15]. The symmetric tensor τ M N can be\nwritten as\n1\n(41)\nτ M N = l 2 sM N = 2 sM N ,\nΛ\n(11)\n\nwhere Λ is a fundamental energy scale chosen to be Λ = MP L . Thus, there are no\nfree parameters in our M-theory.\n\n8\n\nSupermembranes\n\nThe coordinates of a curved superfield superspace are given by\nZ M̄ = (ρM , θα )\n\n(42)\n\nwhere θα denote superfield superspace spinors. We also introduce the superelfbeins\nĀ\n(Z) where Ā = (A, α) are tangent space indices and the pull-back on the world\nEM̄\nvolume coordinates ξ i = (τ, σ1 , σ2 ) (i=0,1,2) is\nĀ\n.\nEiĀ = ∂i Z M̄ EM̄\n\n(43)\n\nThe supermembrane action using the ♦-product rule is given by [1, 8]:\nSSM =\n\nZ\n\n3\n\n\u0014\n\nd ξE♦ −\n\n1√\n−γγ ij EiM̄ ♦EjN̄ ♦gM̄ N̄\n2\n\n1\n1√\n−γ + ǫijk EiM̄ ♦EjN̄ ♦EkP̄ ♦AM̄ N̄ P̄ .\n2\n3!\nThe transformation rules are\n\u0015\n\n+\n\nA\n= 0,\nδZ M̄ ♦EM̄\n\nα\n= κβ (1 + Γ)α β ,\nδZ M̄ EM̄\n\n(44)\n\n(45)\n\nwhere κβ (ξ) is an anticommuting spacetime spinor and\nΓα β =\n\n1 √\n[ −γǫijk EiĀ ♦EjB̄ ♦EkC̄ ΓĀB̄C̄ ]α β .\n3!\n\n(46)\n\nThe Γa are Dirac matrices and Γabc = Γ[abc] .\nThe required κ symmetry [1, 8] is achieved by certain constraints satisfied by the\nfour-form field strength FM̄ N̄ P̄ Q̄ and the supertorsion. These constraints amount\nto saying that the field variables in the CJS action satisfy the eleven-dimensional\nsupergravity equations of motion.\n\n14\n\n\f9\n\nM-theory Bosonic Field Equations\n\nThe bosonic action of the M-theory takes the form\nSSGB =\n\nZ\n\nd\n\n(11)\n\n\u0013\n\u0014 √\n\u0015\u0012\n2\n1\n1\n1\nM\nN\nP\nQ\nq\n+\nρ g (11) ♦ − R♦ − FM N P Q ♦F\n2\n48\n6 * (4!)2\ng (11)\nq\n\n\u0014\n\nM1 M2 ...M11\n\n×♦ǫ\n\n\u0015\n\nFM1 M2 M3 M4 ♦FM5 M6 M7 M8 ♦AM9 M10 M11 .\n\n(47)\n\nThe metric is (− + + + ...+), ǫ0123... = +1 and FM N P Q = 4!∂[M AN P Q] and we have\nset 8πG(11) = c = 1, where G(11) is the eleven-dimensional gravitational coupling\nconstant.\nThe field equations are\n1\nRM N − gM N ♦R♦ = −TF M N ,\n2\n\u0013\n\u0015\u0012\n\u0014 √\nq\n2\n1\n1\nM\nN\nP\nQ\n(11)\nq\nq\n♦ǫM1 ...M8N P Q\n♦∂M ( g ♦F\n)=−\n2\n2 * (4!)\ng (11)\ng (11)\n×FM1 M2 M3 M4 ♦FM5 M6 M7 M8 ,\n\n(48)\n\n(49)\n\nwhere\n\n1\n(8FM P QR ♦FN P QR − gM N ♦FSP QR ♦F SP QR).\n48\nThe bosonic sector of the supermembrane action has the form\nTF M N =\n\nSSMB =\n\nZ\n\n3\n\n\u0014\n\ndξ −\n\n1√\n−γγ ij ∂i ρM ∂j ρN gM N (ρ)\n2\n\n1√\n1\n+\n−γ + ǫijk ∂i ρM ∂j ρN ∂k ρP AM N P (ρ) .\n2\n3!\n\u0015\n\n10\n\n(50)\n\n(51)\n\nCosmological Solutions\n\nFor cosmological purposes, we shall restrict our attention to an eleven-dimensional\nmetric of the form\n\n\n−1\n0\n0\n\n\n0\n(52)\ngM N =  0 a24 (t)g̃rs\n.\n2\n0\n0\na7 (t)g̃∆Σ\nHere, g̃rs (r,s=1,2,3) and g̃∆Σ (∆, Σ = 5, ..., 11) are the maximally symmetric three\nand seven spacelike spaces, respectively, and a4 and a7 are the corresponding time\ndependent cosmological scale factors. We have assumed for simplicity that the seven\nextra spacelike dimensions form a maximally symmetric space, although there is no\na priori reason that this be the case. We shall assume that we are working at energy\n15\n\n\f(11)\n\nscales well below the eleven-dimensional Planck mass, MPL , so that the Grassmann\ncoordinates β M are small compared to xM , ρM ≈ xM .\nThe non-vanishing components of the Christoffel symbols are\nΓ0rs =\n\nȧ4\ngrs ,\na4\n\nΓΓ∆0 =\n\nΓ0∆Σ =\n\nȧ7 Γ\nδ ∆,\na7\n\nȧ7\ng∆Σ ,\na7\n\nΓrst = Γ̃rst ,\n\nΓrs0 =\n\nȧ4 r\nδ s,\na4\n\nΓΓ∆Σ = Γ̃Γ∆Σ ,\n\n(53)\n\nwhere grs = a24 g̃rs , g∆Σ = a27 g̃∆Σ and Γ̃rst and Γ̃Γ∆Σ are the Christoffel symbols formed\nfrom the g̃rs , g̃∆Σ and their derivatives.\nThe non-vanishing components of the Ricci tensor are\nR00 = 3\n\nä4\nä7\n+7 ,\na4\na7\n\n2k4\nȧ4\nd ȧ4\nȧ7 ȧ4\n+\n3\ngrs ,\n+\n+\n7\na24\ndt a4\na4\na7 a4\n\u0012 \u0013 \u0012\n\u0013 \u0015\n\u0014\nȧ4\nȧ7 ȧ7\nd ȧ7\n2k7\n+ 3 +7\ng∆Σ ,\n(54)\nR∆Σ = − 2 +\na7\ndt a7\na4\na7 a7\nwhere k4 and k7 are the curvature constants of four-dimensional and seven-dimensional\nspace. Positive and negative values of k4 and k7 correspond to the sphere and the\npseudosphere, respectively, while vanishing values of k4 and k7 correspond to flat\nspaces. The energy-momentum tensor can be expressed in a perfect fluid form\n\u0014\n\nRrs = −\n\n\u0012\n\n\u0013\n\n\u0012\n\n\u0013\n\nTM N = diag(−ρ, pgrs , p′ g∆Σ ),\n\n\u0015\n\n(55)\n\nwhere ρ = ρm + ρF , p = pm + pF and p′ = p′m + p′F .\nWe now adopt the Freund-Rubin ansatz for which all components of the fourform field FM N P Q vanish except [21, 22]:\n1\nǫμνρσ ,\nFμνρσ = mf (t) q\n−g (4)\n\n(56)\n\nwhere μ, ν = 0, 1, 2, 3 and m is a constant. With this ansatz, the trilinear contributions in AM N P and its derivatives in the action vanish. The three form potential\nfield AM N P is required to live on a three manifold M3 (i.e. to be a maximally\nform-invariant tensor on M3 ) :\nq\n\nAM N P ≡ Arst = mA(t) g (3) ǫrst ,\n\n(57)\n\nwhere A(t) is a function of time and g (3) and ǫrst are the metric determinant and\nthe Levi-Civita symbol on M3 , respectively, and we have f (t) = −Ȧ(t).\nLet us assume that the four-form tensor FM N P Q dominates, so that we neglect\nthe effects of the matter fields with density ρm . We shall use (22) to expand the\n16\n\n\fproducts of the F-tensors in small values of |τ M N |. We neglect the contributions\nfrom the ♦-products of the metric gM N and its derivatives compared to the ♦products of the F-tensors. Using the results that ǫμαρσ ǫν αρσ = 6m2 f 2 (t)gμν (−g (4) )\nand ǫμνρσ ǫμνρσ = 24m2 f 2 (t)(−g (4) ), we find to first order in |τ |:\nTF M N\n\n\u0012\n\u0013\nf ̇2\n1 2 2\ngM N ,\n= ǫm f −\n2\n2Λ2\n\n(58)\n\nwhere we have chosen\n\n1\n.\n(59)\nΛ2\nMoreover, ǫ = +1 for M, N = μ, ν and −1 for M, N = ∆, Σ. Eq.(49) becomes\nτ 00 = −\n\nd\n(a7 (t))7 f (t) = 0.\ndt\n\u0014\n\n\u0015\n\n(60)\n\nOur spontaneous compactification leads to\n\nand\n\n1\nRμν − gμν R = λ4 gμν ,\n2\n\n(61)\n\n1\nR∆Σ − g∆Σ R = λ7 g∆Σ ,\n2\n\n(62)\n\nwhere\n\n\u0012\n\u0013\nf ̇2\n1\nλ4 = − m2 f 2 − 2 ,\n2\n2Λ\nLet us assume that\n\n\u0012\n\u0013\nf ̇2\n1\nλ7 = m2 f 2 −\n.\n2\n2Λ2\n\n(63)\n\nf ̇2\n,\n(64)\n2Λ2\nwhere C is a constant. In the limit, Λ → ∞, we obtain the standard supersymmetric\nvacuum result\n1\n1\n(65)\nλ4 = − m2 f 2 , λ7 = m2 f 2 .\n2\n2\nThe eleven-dimensional space becomes a product of a four-dimensional Einstein\nAdS space with negative cosmological constant and a seven-dimensional Einstein\nspace with positive cosmological constant [40]. If we require the vacuum to be\nsupersymmetric by demanding covariantly constant spinors θ for which\nC ≈ f2 −\n\nδψ = D̄M θ = 0,\nwhere\n\n(66)\n\n√\ni 2 N P QR\nD̄M = DM +\n(Γ\n− 8ΓP QRδM N )FN P QR ,\n(67)\n288 M\nthen for m 6= 0, N = 8 supersymmetry uniquely chooses AdS × S 7 with an SO(8)invariant metric on S 7 [23, 40].\n17\n\n\fIf we choose f 2 = f ̇2 /2Λ2 , we get λ4 = λ7 = 0 and flat (3 + 1) and sevendimensional spaces. On the other hand, if we choose f 2 < f ̇2 /2Λ2 , then λ4 > 0 and\nλ7 < 0 and we obtain a positive cosmological constant in (3 + 1) spacetime, corresponding to a dS universe, and a seven-dimensional space with negative curvature.\nFrom (61) and (62), we obtain\n3ä4 + 7\n\nä7 a24\n= λ4 a24 ,\na7\n\nȧ7 ȧ4 a4\n= λ4 a24 ,\na7\nȧ4 ȧ7 a7\n= λ7 a27 .\n2k7 + ä7 a7 + 6ȧ27 + 3\na4\n2k4 + ä4 a4 + 2ȧ24 + 7\n\n(68)\n(69)\n(70)\n\nCombining (68) and (69) gives\n\u0012\n\nȧ4\na4\n\n\u00132\n\n+\n\n1\nk4 7 ä7 7 ȧ7 ȧ4\n+\n= λ4 .\n−\n2\na4 6 a7 2 a4 a7\n3\n\n(71)\n\nFor solutions in which the scale factor a4 expands faster than a7 , we get the standard\nfour-dimensional Friedmann equation:\n\u0012\n\nȧ4\na4\n\n\u00132\n\n+\n\n1\nk4\n= λ4 .\n2\na4\n3\n\n(72)\n\nThis has the dS inflationary solution for k4 = 0 and λ4 > 0:\na4 = B exp\n\ns\n\u0012\n\nλ4\nt ,\n3\n\u0013\n\n(73)\n\nwhere B is a constant.\nLet us now consider a time-dependent solution including matter density ρm ,\nobtained from additional matter fields generated by our compactification to a fourdimensional spacetime. We write\n1\nRμν − gμν R = −Tμν ,\n2\n\n(74)\n\nTμν = TF μν + TM μν ,\n\n(75)\n\nwhere\nand\n\n1\n(76)\nTF μν = m2 S(t)gμν .\n2\nTM μν denotes the energy-momentum contribution in four dimensions from the matter fields. We also have\nf ̇2\n.\n(77)\nS = f2 −\n2Λ2\n18\n\n\fThe TM μν can be written for a comoving cosmological fluid in the form\nTM μν = diag(−ρm , pm , pm , pm ),\n\n(78)\n\nwhere the ρm and pm denote the density and pressure of matter fields, respectively.\nWe rewrite (74) as\nRμν = −T̃μν ,\n(79)\n1\nT̃μν = Tμν − gμν Tλ λ .\n2\n\n(80)\n\nWe express the energy-momentum tensor T̃μν as an effective perfect fluid\n1\nT̃μν = (ρ + p)uμ uν + (ρ − p)gμν ,\n2\n\n(81)\n\nwhere the four-velocity has the components u0 = 1, um = 0 and ρ = ρm + ρF . We\nhave\n3\n3\n(82)\nρF = − m2 S, pF = m2 S,\n2\n2\nso that ρF = −pF which is the equation of state for the vacuum density ρvac .\nFrom (54) we obtain\n\u0012\n\nȧ4\na4\n\n\u00132\n\n+\n\n1\n1\n7 ȧ7 ȧ4 7 ä7\nk4\n= ρ + λ4 −\n+\n,\n2\na4\n3\n3\n2 a7 a4 6 a7\n\nä4\n1\n1\n7 ä7\n= − (ρ + 3p) + λ4 −\n,\na4\n6\n3\n3 a7\n\n(83)\n(84)\n\nȧ4 ȧ7\nȧ27\nä7 2k7\n.\n(85)\n+ 2 =− 6 2 +3\na7\na7\na7\na4 a7\nLet us again assume that f and f ̇ are slowly varying and choose the solution\nλ4 > 0, f 2 < f ̇2 and ρF = −pF . We also assume the equation of state pm = wρm and\nthat for the present universe w ≈ 0. Then, we have for a four-dimensional universe\nexpanding faster than the seven-dimensional compact space:\n\u0014 \u0012\n\n\u0012\n\nȧ4\na4\n\n\u00132\n\n+\n\n\u0015\n\n\u0013\n\n1\n1\nk4\nρ\n+\nλ4\n=\nm\na24\n3\n3\n\n(86)\n\n1\n1\nä4\n= − (ρm + 3pm ) + λ4 .\na4\n6\n3\nWe can write (86) in the form\n\n(87)\n\nΩM + Ωk4 + Ωλ4 = 1,\nwhere\nΩM =\n\nρm\n,\n3H 2\n\nΩk4 = −\n19\n\nk4\n,\n2 2\na4 H\n\nΩλ4 =\n\n(88)\nλ4\n.\n3H 2\n\n(89)\n\n\fBy choosing\nΩM = 0.32,\n\nΩk4 = 0,\n\nΩλ4 = 0.68,\n\n(90)\n\nwe can obtain a fit to all the current observational data [18, 19].\nGenerally, phenomenological matter contributions are not permitted in the elevendimensional M-theory supergravity, because of the restrictions incurred by the generalized supersymmetric invariance of the action. However, when we perform our\nspontaneous compactification the fermionic gravitino contributions and the elvbeins\nwill generate matter fields in the M4 × M7 product space, which can describe the\n'dark matter' and the baryons and neutrinos. The F-field contributions, on the other\nhand, describe the 'dark energy' associated with the vacuum and the cosmological\nconstant.\n\n11\n\nA Realistic M-Theory of Particles?\n\nWe now turn to the important question as to whether we can derive a realistic\ndescription of particle unification in our M-theory. Early attempts to obtain an\nisometry group from the M pqr spaces introduced by Witten [41] failed to give a\nrealistic descriptions of quarks and leptons [40]. Witten starts from the elevendimensional model and assumes that the seven-dimensional internal space is a coset\nspace G/H. Choosing the minimal H with G = SU(3) × SU(2) × U(1) allows a\nnontrivial action of each of the factors SU(3), SU(2) and U(1) of G on G/H and\nthis space is exactly seven-dimensional. Decomposing gM N into the product space\nM4 × M7 , one finds that the action can gauge SU(3) × SU(2) × U(1) in D = 4.\nHowever, the lepton-quark part of the fermion decomposition does not fit into the\nrequired SU(3) × SU(2) × U(1) group representations.\nAnother attempt to obtain a description of particles consists of a spontaneous\ncompactification of the type using the Freund-Rubin ansatz for the four-form field\nFM N P Q and a round seven sphere S 7 or squashed seven sphere [23]. Such a compactification does not permit singularities in the smooth internal space S 7 and therefore\ncannot yield a chiral fermion spectrum and non-Abelian gauge fields within SO(8),\nwhich does not contain the standard model group SU(3) × SU(2) × U(1).\nSome time ago it was speculated that some of the gauge bosons and fermions are\ncomposite as in the model of Ellis, et al. [42]. The expectation that there are two\nkinds of gauge bosons, the \"elementary\" and the \"composite\" is a consequence of\nKaluza-Klein theories and not due to an ad hoc assumption. Kaluza-Klein theories\nunify gravity and Yang-Mills theories in two ways. First D-dimensional general\n′\ncovariance of our superspace ρM → ρ M (ρ) and then secondly D-dimensional local\nA\nB\nAB\nAB\nsuper Lorentz invariance δeA\n(ρ) give in eleven\nM (ρ) = LB (ρ)eM (ρ), δωM = −DM L\ndimensions a superspace orthogonal group. Thus, the elfbeins eA\nM are the gauge\nbosons of superspace general covariance and the superspace spin connections are the\ngauge bosons of super Lorentz invariance. Whereas the eA\nM are the \"elementary\"\nAB\nAB\nfields, the ωM are the \"composite\" fields. Since the ωM have no kinetic terms of\n20\n\n\ftheir own, we have to express them in terms of the elfbein and its derivatives. The\nKaluza-Klein compactification gives rise to both elementary and composite gauge\nbosons in D = 4.\nAt energies well below the Planck mass, our superspace can be approximated by\nthe ordinary four-dimensional spacetime coordinates ρμ ∼ xμ , and the elementary\ngauge bosons Aμ (x) come from the the eaμ (x, y) and correspond to a gauge group\ngiven by the isometry group of the extra dimensions, SO(8) for the round S 7 , while\nthe composite gauge fields Cμ (x) come from the ωμab (x, y) and correspond to the\ntangent space group of the extra internal dimensions, SO(7), for the case of d = 7.\nCremmer and Julia [43] showed that when the three form field AM N P is accounted\nfor, the hidden symmetry could be larger than SO(7) and may be as large as SO(8)\nor SU(8). Now there are many ways to embed SU(3)×SU(2)×U(1) in 'elementary'\nSO(8)× 'composite' SU(8). However, there still remain unresolved questions about\nthe physical properties of these bound state representations of gauge bosons and\nfermions, and whether they permit chiral representations in four dimensions.\nPerhaps the most promising way to obtain a realistic description of particles in\nfour dimensions from a compactification of M-theory, with complex chiral fermion\nrepresentations and non-abelian gauge fields, is to seek a compactification on a seven\nmanifold that contains singularities. As shown by Acharya and Witten [24], we\nshould seek a hyper-Kahler manifold compactification with conical singularies that\ngenerate the desired chiral fermions and non-Abelian gauge fields within a fourdimensional supersymmetric unified model, which contains the standard SU(3) ×\nSU(2) × U(1) group. Such a compactification scheme could be generalized to our\nsupermanifold noncommutative and non-anticommutative geometry.\n\n12\n\nConclusions\n\nOur M-theory describes a finite quantum field theory in an eleven-dimensional super\nmanifold in which the action is constructed from a ♦-product of field operators based\non eleven-dimensional CJS supergravity theory. The quantum gravity and quantum\ngauge field parts of the action will be finite for Λ < ∞ due to the finiteness of the nonanticommutative quantum field theory. In the limits Λ → ∞, β M → 0 and |τ M N | →\n0, we obtain the low energy limit of eleven-dimensional CJS supergravity. The\ncompactified version of this theory has the same massless ten-dimensional particle\nspectrum as type-IIA superstring theory and is connected to the latter theory by a\nduality transformation.\nThe M-theory eleven-dimensional field equations are invariant under generalized\n♦-product supersymmetric gauge transformations, which can be thought of as classical deformations of the standard supersymmetric gauge transformations of CJS\nsupergravity. The generalized ♦-product supersymmetric vacuum leads to de Sitter\nspace solutions and thus provides an empirical basis for a realistic cosmology. The\nno-go theorems in [29, 30] do not apply in this case, because they are derived from\n21\n\n\fstandard supersymmetric theories. Our M-theory with generalized supersymmetric equations predicts an inflationary period in the early universe. As the universe\nexpands, f 2 can tend towards f ̇2 /2Λ2 and produce a small four-dimensional cosmological constant with λ4 > 0 and an accelerating universe at present. We have\ndescribed the dominant dark matter and dark energy by the energy-momentum\nmatter field tensor and the four-form F-field energy-momentum tensor, respectively.\nThe problem of chiral fermions can be resolved by permitting isolated singularities in our seven-dimensional compact space M7 . To obtain a realistic mass spectrum, which contains the standard model SU(3) × SU(2) × U(1), we should seek a\ncompactification on a seven-dimensional hyper-Kahler type manifold and generate\nfour-dimensional dS solutions through our generalized supersymmetric cosmological\nsolutions.\nAcknowledgments\nI thank Michael Duff, Bobby Acharya, Lee Smolin, Michael Clayton and Pierre\nSavaria for helpful and stimulating conversations. This work was supported by the\nNatural Sciences and Engineering Research Council of Canada.\n\nReferences\n[1] P. K. Townsend, Proceedings of the 1996 ICTP Summer School in High Energy\nPhysics and Cosmology, hep-th/9612121; M. J. Duff, Abdus Salam Memorial\nMeeting, ICTP, Trieste, November 1997, hep-th/9805177 v3.\n[2] J. Polchinski, String Theory, Cambridge University Press, Vols. I and II, Cambridge University Press, 1998.\n[3] M. F. Atiyah and F. Hirzebruch, Essays on Topology and Related Topics, eds.\nA. Haeflinger and R. Narasimhan, Springer, Berlin, 1970 p. 18.\n[4] E. Witten, Princeton preprint, Proceedings of the Shelter Island Conference,\nMIT press, 1983.\n[5] C. Wetterich, Nucl. Phys. B242, 473 (1984).\n[6] M. Gell-Mann and B. Zwiebach, Phys. Lett. B147, 111 (1984).\n[7] J. W. Moffat, J. Math. Phys. 26, 528 (1985).\n[8] M. J. Duff, TASI Lectures, University of Colorado, Boulder, 1996, hepth/9611203 v2.\n\n22\n\n\f[9] P. Hor̆ava and E. Witten, Nucl. Phys. B460, 506, hep-th/9510209; P. Hor̆ava\nand E. Witten, Nucl. Phys. B475, 94 (1996), hep-th/9603142.\n[10] L. Randall and R. Sundrum, Phys. Rev. Lett. 83, 3370 (1999), hepth/9905221; Phys. Rev. Lett. 83, 4690 (1999), hep-th/9906064.\n[11] T. Banks, W. Fischler, S. H. Shenker and L. Susskind, Phys. Rev. D55, 5112\n(1997), hep-th/9610043; T. Banks, TASI Lecture Notes on Matrix Theory,\nhep-th/9911068. For another approach to solving M-theory, see: H. Nishino\nand S. Rajpoot, hep-th/0108123 v2.\n[12] J. W. Moffat, hep-th/0106031; hep-th/0107183.\n[13] J. W. Moffat, Phys. Lett. B506, 193 (2001), hep-th/0011035 v2.\n[14] J. W. Moffat, hep-th/0011229.\n[15] J. W. Moffat, hep-th/0011259.\n[16] J. W. Moffat, Phys. Lett. B493, 142 (2000), hep-th/0008089.\n[17] J. W. Moffat, Phys. Lett. B491, 345 (2000), hep-th/0007181.\n[18] S. Perlmutter et al. Ap. J. 483, 565 (1997), astro-ph/9608192; A. G. Riess,\net al. Astron. J. 116, 1009 (1998), astro-ph/9805201; P. M. Garnavich, et al.\nAp. J. 509, 74 (1998), astro-ph/9806396; S. Perlmutter et al. Ap. J. 517,\n565 (1999), astro-ph/9812133; A. G. Riess, et al. to be published in Ap. J.,\nastro-ph/0104455.\n[19] A. Miller et al., astro-ph/0108030; P. de Bernardis et al., astro-ph/0105296.\n[20] R. R. Caldwell, R. Dave, and P. J. Steinhardt, Phys. Rev. Lett. 80, 1582\n(1998), astro-ph/9708069.\n[21] P. G. O. Freund and M. A. Rubin, Phys. Lett. B97, 233 (1980).\n[22] P. G. O. Freund, Nucl. Phys. B209, 146 (1982).\n[23] M. A. Awada, M. J. Duff, C. N. Pope, Phys. Rev. Lett. 50, 294 (1983); F.\nEnglert, Phys. Lett. B119, 339 (1982).\n[24] B. Achharya and E. Witten, hep-th/0109152.\n[25] E. Witten, hep-th/0108165.\n[26] M. Atiyah and E. Witten, hep-th/0107177.\n[27] S. Randjbar-Daemi, A. Salam and J. Strathdee, Nucl. Phys. B214, 491 (1983).\n\n23\n\n\f[28] A. H. Guth, Phys. Rev. D23, 347 (1981); A. D. Linde, Particle Physics and\nInflationary Cosmology, Contemporary Concepts in Physics, Harwood Academic Publishing, Chur, Switzerland, 1990.\n[29] G. W. Gibbons, Aspects of Supergravity Theories, GIFT Seminar on Supersymmetry, Supergravity and Related Topics, eds. F. del Aguila, J. A. de Azcarraga, and L. E. Ibanez, World Scientific, Singapore, 1984.\n[30] J. Maldacena, C. Nunez, Int. J. Mod. Phys. A16, 822 (2001), hep-th/0007018\nv2; K. Bautier, S. Deser, M. Henneaux, and D. Seminara, Phys. Lett. B406,\n49 (1997), hep-th/9704131.\n[31] C. M. Hull and N. P. Warner, Class. Quant. Grav. 5, 1517 (1988); C. M. Hull,\nhep-th/0109213; G. W. Gibbons and C. M. Hull, hep-th/0111072; R. Kallosh,\nA. Linde, S. Prokushkin, and M. Shmakova, hep-th/0110089 v2.\n[32] H. Nicolai and C. Wetterich, Phys. Lett. B150, 347 (1985).\n[33] E. Witten, \"Quantum Gravity in de Sitter Space,\" Talk at the\nStrings 2001 Conference, Tata Institute, Mumbai, India, January 2001,\nhttp://theory.tifr.res.in/strings/; R. Bousso, JHEP 0011, 038 (2000), hepth/0010252; V. Balasubramanian, P. Hor̆ava, and D. Minic, JHEP 0105 (2001)\n043, hep-th/0103171; T. Banks and W. Fischler, hep-th/0102007.\n[34] S. Hellerman, N. Kaloper, and L. Susskind, JHEP 0106 003 (2001), hepth/0104180; W. Fischler, A. Kashani-Poor, R. McNees, and S. Paban, JHEP\n0107 003 (2001), hep-th/0104181.\n[35] I. L. Buchbinder and S. M. Kuzenko, Ideas and Methods of Supersymmetry and\nSupergravity or A Walk Through Superspace, Institute of Physics Publishing,\nrevised edition, Bristol and Philadelphia, 1998.\n[36] F. A. Berezin, Introduction to Superanalysis, Reidel, Dordrecht, 1987; B. S.\ndeWitt, Supermanifolds, Cambridge University Press, Cambridge, 1986.\n[37] R. J. Szabo, hep-th/0109162 v2.\n[38] E. Cremmer, B. Julia, and J. Scherk, Phys. Lett. B76, 409 (1978).\n[39] P. van Nieuwenhuizen, Physics Reports, 69, 189 (1981).\n[40] M. J. Duff, B. E. W. Nilsson and C. N. Pope, Physics Reports, 130, 1 (1986).\n[41] E. Witten, Nucl. Phys. B186, 412 (1981).\n[42] J. Ellis, M. K. Gaillard, L. Maiani, and B. Zumino, Unification of the Fundamental Interactions, eds. J. Ellis, S. Ferrara and P. van Nieuwenhuizen,\nPlenum, New York, 1980.\n24\n\n\f[43] E. Cremmer and B. Julia, Nucl. Phys. B159, 141 (1979).\n\n25\n\n\f"}