{"id": "http://arxiv.org/abs/hep-ph/0606113v1", "guidislink": true, "updated": "2006-06-09T17:02:57Z", "updated_parsed": [2006, 6, 9, 17, 2, 57, 4, 160, 0], "published": "2006-06-09T17:02:57Z", "published_parsed": [2006, 6, 9, 17, 2, 57, 4, 160, 0], "title": "Analysis of pion elliptic flows and HBT interferometry in a granular\n  quark-gluon plasma droplet model", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0606258%2Chep-ph%2F0606103%2Chep-ph%2F0606018%2Chep-ph%2F0606278%2Chep-ph%2F0606286%2Chep-ph%2F0606095%2Chep-ph%2F0606024%2Chep-ph%2F0606306%2Chep-ph%2F0606064%2Chep-ph%2F0606177%2Chep-ph%2F0606086%2Chep-ph%2F0606124%2Chep-ph%2F0606247%2Chep-ph%2F0606057%2Chep-ph%2F0606025%2Chep-ph%2F0606022%2Chep-ph%2F0606011%2Chep-ph%2F0606017%2Chep-ph%2F0606145%2Chep-ph%2F0606215%2Chep-ph%2F0606319%2Chep-ph%2F0606165%2Chep-ph%2F0606262%2Chep-ph%2F0606230%2Chep-ph%2F0606200%2Chep-ph%2F0606080%2Chep-ph%2F0606023%2Chep-ph%2F0606112%2Chep-ph%2F0606256%2Chep-ph%2F0606178%2Chep-ph%2F0606052%2Chep-ph%2F0606132%2Chep-ph%2F0606056%2Chep-ph%2F0606318%2Chep-ph%2F0606179%2Chep-ph%2F0606113%2Chep-ph%2F0606295%2Chep-ph%2F0606021%2Chep-ph%2F0606125%2Chep-ph%2F0606055%2Chep-ph%2F0606274%2Chep-ph%2F0606173%2Chep-ph%2F0606245%2Chep-ph%2F0606038%2Chep-ph%2F0606158%2Chep-ph%2F0606293%2Chep-ph%2F0606098%2Chep-ph%2F0606317%2Chep-ph%2F0606205%2Chep-ph%2F0606029%2Chep-ph%2F0606034%2Chep-ph%2F0606164%2Chep-ph%2F0606040%2Chep-ph%2F0606248%2Chep-ph%2F0606154%2Chep-ph%2F0606242%2Chep-ph%2F0205183%2Chep-ph%2F0205019%2Chep-ph%2F0205333%2Chep-ph%2F0205165%2Chep-ph%2F0205337%2Chep-ph%2F0205295%2Chep-ph%2F0205161%2Chep-ph%2F0205117%2Chep-ph%2F0205131%2Chep-ph%2F0205343%2Chep-ph%2F0205173%2Chep-ph%2F0205041%2Chep-ph%2F0205317%2Chep-ph%2F0205262%2Chep-ph%2F0205223%2Chep-ph%2F0205243%2Chep-ph%2F0205082%2Chep-ph%2F0205042%2Chep-ph%2F0205016%2Chep-ph%2F0205112%2Chep-ph%2F0205281%2Chep-ph%2F0205153%2Chep-ph%2F0205096%2Chep-ph%2F0205191%2Chep-ph%2F0205217%2Chep-ph%2F0205331%2Chep-ph%2F0205247%2Chep-ph%2F0205300%2Chep-ph%2F0205120%2Chep-ph%2F0205232%2Chep-ph%2F0205188%2Chep-ph%2F0205218%2Chep-ph%2F0205144%2Chep-ph%2F0205272%2Chep-ph%2F0205233%2Chep-ph%2F0205127%2Chep-ph%2F0205118%2Chep-ph%2F0205045%2Chep-ph%2F0205184%2Chep-ph%2F0205138%2Chep-ph%2F0205051%2Chep-ph%2F0205318%2Chep-ph%2F0205055%2Chep-ph%2F0205110%2Chep-ph%2F0205171&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Analysis of pion elliptic flows and HBT interferometry in a granular\n  quark-gluon plasma droplet model"}, "summary": "In many simulations of high-energy heavy-ion collisions on an event-by-event\nanalysis, it is known that the initial energy density distribution in the\ntransverse plane is highly fluctuating. Subsequent longitudinal expansion will\nlead to many longitudinal tubes of quark-gluon plasma which have tendencies to\nbreak up into many spherical droplets because of sausage instabilities. We are\ntherefore motivated to use a model of quark-gluon plasma granular droplets that\nevolve hydrodynamically to investigate pion elliptic flows and\nHanbury-Brown-Twiss interferometry. We find that the data of pion transverse\nmomentum spectra, elliptic flows, and HBT radii in \\sqrt{s_{NN}}=200 GeV Au +\nAu collisions at RHIC can be described well by an expanding source of granular\ndroplets with an anisotropic velocity distribution.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0606258%2Chep-ph%2F0606103%2Chep-ph%2F0606018%2Chep-ph%2F0606278%2Chep-ph%2F0606286%2Chep-ph%2F0606095%2Chep-ph%2F0606024%2Chep-ph%2F0606306%2Chep-ph%2F0606064%2Chep-ph%2F0606177%2Chep-ph%2F0606086%2Chep-ph%2F0606124%2Chep-ph%2F0606247%2Chep-ph%2F0606057%2Chep-ph%2F0606025%2Chep-ph%2F0606022%2Chep-ph%2F0606011%2Chep-ph%2F0606017%2Chep-ph%2F0606145%2Chep-ph%2F0606215%2Chep-ph%2F0606319%2Chep-ph%2F0606165%2Chep-ph%2F0606262%2Chep-ph%2F0606230%2Chep-ph%2F0606200%2Chep-ph%2F0606080%2Chep-ph%2F0606023%2Chep-ph%2F0606112%2Chep-ph%2F0606256%2Chep-ph%2F0606178%2Chep-ph%2F0606052%2Chep-ph%2F0606132%2Chep-ph%2F0606056%2Chep-ph%2F0606318%2Chep-ph%2F0606179%2Chep-ph%2F0606113%2Chep-ph%2F0606295%2Chep-ph%2F0606021%2Chep-ph%2F0606125%2Chep-ph%2F0606055%2Chep-ph%2F0606274%2Chep-ph%2F0606173%2Chep-ph%2F0606245%2Chep-ph%2F0606038%2Chep-ph%2F0606158%2Chep-ph%2F0606293%2Chep-ph%2F0606098%2Chep-ph%2F0606317%2Chep-ph%2F0606205%2Chep-ph%2F0606029%2Chep-ph%2F0606034%2Chep-ph%2F0606164%2Chep-ph%2F0606040%2Chep-ph%2F0606248%2Chep-ph%2F0606154%2Chep-ph%2F0606242%2Chep-ph%2F0205183%2Chep-ph%2F0205019%2Chep-ph%2F0205333%2Chep-ph%2F0205165%2Chep-ph%2F0205337%2Chep-ph%2F0205295%2Chep-ph%2F0205161%2Chep-ph%2F0205117%2Chep-ph%2F0205131%2Chep-ph%2F0205343%2Chep-ph%2F0205173%2Chep-ph%2F0205041%2Chep-ph%2F0205317%2Chep-ph%2F0205262%2Chep-ph%2F0205223%2Chep-ph%2F0205243%2Chep-ph%2F0205082%2Chep-ph%2F0205042%2Chep-ph%2F0205016%2Chep-ph%2F0205112%2Chep-ph%2F0205281%2Chep-ph%2F0205153%2Chep-ph%2F0205096%2Chep-ph%2F0205191%2Chep-ph%2F0205217%2Chep-ph%2F0205331%2Chep-ph%2F0205247%2Chep-ph%2F0205300%2Chep-ph%2F0205120%2Chep-ph%2F0205232%2Chep-ph%2F0205188%2Chep-ph%2F0205218%2Chep-ph%2F0205144%2Chep-ph%2F0205272%2Chep-ph%2F0205233%2Chep-ph%2F0205127%2Chep-ph%2F0205118%2Chep-ph%2F0205045%2Chep-ph%2F0205184%2Chep-ph%2F0205138%2Chep-ph%2F0205051%2Chep-ph%2F0205318%2Chep-ph%2F0205055%2Chep-ph%2F0205110%2Chep-ph%2F0205171&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In many simulations of high-energy heavy-ion collisions on an event-by-event\nanalysis, it is known that the initial energy density distribution in the\ntransverse plane is highly fluctuating. Subsequent longitudinal expansion will\nlead to many longitudinal tubes of quark-gluon plasma which have tendencies to\nbreak up into many spherical droplets because of sausage instabilities. We are\ntherefore motivated to use a model of quark-gluon plasma granular droplets that\nevolve hydrodynamically to investigate pion elliptic flows and\nHanbury-Brown-Twiss interferometry. We find that the data of pion transverse\nmomentum spectra, elliptic flows, and HBT radii in \\sqrt{s_{NN}}=200 GeV Au +\nAu collisions at RHIC can be described well by an expanding source of granular\ndroplets with an anisotropic velocity distribution."}, "authors": ["Wei-Ning Zhang", "Yan-Yu Ren", "Cheuk-Yin Wong"], "author_detail": {"name": "Cheuk-Yin Wong"}, "author": "Cheuk-Yin Wong", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevC.74.024908", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/hep-ph/0606113v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-ph/0606113v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "9 pages, 6 figures, in Latex", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-ph/0606113v1", "affiliation": "University of Tennessee", "arxiv_url": "http://arxiv.org/abs/hep-ph/0606113v1", "journal_reference": "Phys.Rev. C74 (2006) 024908", "doi": "10.1103/PhysRevC.74.024908", "fulltext": "Analysis of pion elliptic flows and HBT interferometry in a granular quark-gluon\nplasma droplet model\nWei-Ning Zhang1,2,3 , Yan-Yu Ren2 , and Cheuk-Yin Wong3,4\n1\n\narXiv:hep-ph/0606113v1 9 Jun 2006\n\nDepartment of Physics, Dalian University of Technology, Dalian, Liaoning 116024, P. R. China\n2\nDepartment of Physics, Harbin Institute of Technology, Harbin, Heilongjiang 150006, P. R. China\n3\nPhysics Division, Oak Ridge National Laboratory, Oak Ridge, TN 37831, U.S.A.\n4\nDepartment of Physics, University of Tennessee, Knoxville, TN 37996, U.S.A.\n(Dated: April 30, 2018)\nIn many simulations of high-energy heavy-ion collisions on an event-by-event analysis, it is known\nthat the initial energy density distribution in the transverse plane is highly fluctuating. Subsequent\nlongitudinal expansion will lead to many longitudinal tubes of quark-gluon plasma which have\ntendencies to break up into many spherical droplets because of sausage instabilities. We are therefore\nmotivated to use a model of quark-gluon plasma granular droplets that evolve hydrodynamically\nto investigate pion elliptic flows and Hanbury-Brown-Twiss interferometry. We find that the data\n√\nof pion transverse momentum spectra, elliptic flows, and HBT radii in sNN = 200 GeV Au +\nAu collisions at RHIC can be described well by an expanding source of granular droplets with an\nanisotropic velocity distribution.\nPACS numbers: 25.75.-q, 25.75.Nq, 25.75.Gz\n\nI.\n\nINTRODUCTION\n\nRecently, there has been much progress in our understanding of the process of nucleus-nucleus collisions\nat RHIC [1, 2, 3, 4, 5, 6]. Hydrodynamical calculations agree well with the RHIC v2 data of the elliptic flow at low transverse momentum pT < 2 GeV\n[7, 8, 9, 10, 11]. However, they cannot predict the\nsaturation of v2 at higher pT [8, 9, 10, 11] and the\nRHIC HBT puzzle of Rout /Rside ≈ 1 [12, 13, 14, 15].\nThe HBT puzzle is contrary to many earlier theoretical expectations [16, 17, 18, 19, 20, 21]. Various models have been put forth to explain the HBT puzzle\n[22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34]. There\nhave also been many attempts to provide a consistent\nexplanation for both the elliptic flow and HBT measurements at RHIC [35, 36, 37, 38, 39, 40, 41].\nIn Ref. [28], a granular particle-emitting source of\nquark-gluon plasma (QGP) droplets evolving hydrodynamically was put forth to explain the RHIC HBT puzzle. The suggestion was based on the observation that in\nthe hydrodynamical model [16, 42], the particle emission\ntime scales with the initial radius of the droplet. Particles will be emitted earlier if the radius of the droplet\nis smaller, as in a source of many droplets. An earlier\nemission time will lead to a smaller extracted HBT radius\nRout , while the extracted HBT radius Rside is determined\nby the scale of the distribution of the droplets. As a result, the value of Rout can be close to Rside for a granular\nquark-gluon plasma source [28]. Further suggestions of\nusing the single-event intensity interferometry to search\nfor the signature for granular structures have also been\npresented [43, 44].\nMotivated by the successes of our previous analysis of\nthe HBT puzzle using a granular droplet model, we examine in this paper the theoretical basis for the possible occurrence of granular structure in the evolution of a quark-\n\ngluon plasma. In addition, we wish to refine the granular\nsource model of Ref. [28] by considering more reasonable\nanisotropic velocity distributions of the droplets instead\nof a constant radial velocity assumed in [28]. We would\nlike to investigate the pion elliptic flows as well as HBT\nradii as functions of the pion transverse momentum. The\nagreement both of the v2 and HBT radii with experimental data concurrently will gives strong constrains for\nthe granular model and its parameters and will provide\na useful insight into the initial state and the evolution\nof the particle-emitting source produced in high-energy\nnucleus-nucleus collisions.\n\nII. GRANULAR INSTABILITY IN THE\nEVOLUTION OF THE QUARK-GLUON PLASMA\n\nBased on the recent results of high-energy heavy-ion\ncollisions at RHIC, the matter (presumably QGP) produced in the collisions may be a strongly-coupled medium\nwith a very high energy density [1, 2, 3, 4, 5, 6]. They\nare thermalized within about 1 fm/c [1, 2, 3, 4, 5, 6].\nIt is of interest to study its subsequent evolution and see\nwhether granular structures may play a role in the spacetime development of the presumed quark-gluon plasma\nmatter.\nAlthough a granular structure was suggested earlier as\nthe signature of a first-order phase transition [45], the\noccurrence of granular structure may not be limited to\nthe occurrence of a first-order phase transition. There\nare additional effects which may lead to the dynamical\nformation of granular droplets.\nBecause the QGP is a strongly interacting dense\nmedium, a surface tension arises at a boundary due to\nthe presence of a strong interaction in the dense phase on\none side of the boundary and the absence (or weakening)\nof the strong interaction with no density (or diminishing\n\n\f2\ndensity) on the other side [46, 47, 48, 49, 50, 51, 52, 53].\nThis imbalance of the forces acting on different parts at\nthe boundary leads to the surface tension, while the detail profile of the boundary may depend on the nature\nand the order of phase transition. Due to the presence\nof this surface tension, there may be instability against\nsurface shape changes and bulk density oscillations.\n\nA.\n\nρ\n\n(a) Initial configuration\nz\n\n(b) Shortly afterwards\n\nTransverse Density Fluctuations and Surface\nGranular Instability\n\nThe quark gluon plasma that may be produced in the\nlaboratory is spatially bounded by various boundaries.\nFurthermore, in many simulations of the heavy-ion collisions on an event-by-event basis, the initial transverse\nenergy density is far from being uniform. It exhibits\nlarge transverse density fluctuations with a large peakto-valley ratio [29, 41, 54]. A large number of transverse\ndensity domains are clearly visible in the initial transverse density distribution of the produced matter in Fig.\n21 of [54] or Fig. 4 of [41]. Because of these highly\nfluctuating initial transverse density distribution forming \"lumps\" in different regions, the probability for the\noccurrence of granular structure may be enhanced.\nWe can present an approximate scenario to discuss the\nevolution of matter with a large transverse density fluctuations, in a central collision of two heavy and equal\nnuclei of radius R. Because of Lorentz contraction, the\nlongitudinal length R/γ of the produced matter is much\nsmaller than the transverse length, which is of the order\nR. Initially as depicted in Fig. 1(a), density fluctuations\nin the transverse plane manifest as a number of transverse lumps characterized by a radius rd0 , which one can\nalso see from the results of [54] and [41]. From such an\ninitial data, we can consider the evolution according to\nLandau hydrodynamics [55], which gives a good description of the longitudinal distribution of the produced particles [56, 57]. In such a description, because the initial\nlongitudinal length is much smaller than the transverse\nlength, the hydrodynamical force per unit volume in the\nlongitudinal direction, −∂P/∂z, is much greater than the\nhydrodynamical force per unit volume in the transverse\ndirection, −∂P/∂ρ. The subsequent expansion in the\nlongitudinal direction proceeds much faster than in the\ntransverse direction, as pointed out by Landau and Belenkii [55]. The expanding matter develops into tubes\nof radius rd0 [Fig. 1(b)] and the density of matter in the\ntube decreases as a function of the proper time.\nAs is well known, a long tube of matter is unstable\nagainst \"sausage\" perturbations that tend to make the\ntube narrow in some regions and thicker in other regions.\nThe sausage instability leads to the break-up of the long\ntube of matter into many approximately equal spherical\ndroplets, as in the break-up of toroidal liquid droplets\n[58].\nWe can examine the sausage instability for a cylinder\nwith a length L and a radius rd0 , with L >> rd0 . We\n\n(c) Later afterwards\n\nFIG. 1: Schematic description of the matter distribution under a rapid longitudinal expansion in the z-direction, for a\nhighly fluctuating initial transverse density distribution [Fig.\n1a]. The system evolves into many longitudinal tubes at Fig.\n1b and later at Fig. 1c. Sausage instabilities lead to the production of droplets along the longitudinal tubes as depicted\nin Fig. 1c.\n\nconsider \"sausage\" perturbations an about the cylinder\nof matter,\n(\n)\nX\nan sin(nπz/L) .\n(1)\nrd (z) = r̃d0 1 +\nn=odd\n\nIn order to have a positive slope drd (z)/dz at z = 0 and\na negative slope at z = L, we need to limit ourselves to\nperturbations with odd values of n and an > 0. By the\ncondition of volume conservation, the quantity r̃d0 is\n(\n\u0012\n\u00132 )\nX 2an\n1 X 2 3 X 2an\nr̃d0 = rd0 1 −\n.(2)\n−\nan +\nnπ\n4\n2\nnπ\nn=odd\n\nn=odd\n\nn=odd\n\nThe surface energy of the cylinder\n(\n1 X\nEs = σ2πrd0 L 1 −\nan 2 +\n4\nn=odd\n\nis then\n1\n2\n\n\u0012 X\n\u00132 )\n2an\n. (3)\nnπ\nn=odd\n\nThe cylinder is unstable against perturbations of order n\nif d2 Es /da2n is negative. We can evaluate d2 Es /da2n and\nobtain\nd2 Es /da2n = σ2πrd0 L{−1/2 + (2/nπ)2 }.\n\n(4)\n\nThus, d2 Es /da2n is negative for all odd integer values\nof n. As an unrestrained growth of the perturbation\nof order n leads the formation of (n + 1)/2 droplets,\nwe find that the cylinder is unstable against perturbations leading to the formation of 1, 2, 3, ... approximately\n\n\f3\nequal droplets. Thus, when the length L of the tubes are\nstretched, sausage (granular) instability will develop and\nthe long tube will fragment into approximately equalsize droplets, as depicted in Fig. 2c. Large density fluctuations in the transverse direction, together with the\nsurface tension effects, favor the formation of granular\ndroplets.\nIn our simplified description, we have ignored the effects of the perturbation on the variation of the transverse surfaces at the two ends of the cylinder. A refinement on the description of the end surfaces will not modify significantly the question of the instability of the cylindrical matter, for cylinders with L substantially greater\nthan rd0 .\nIn conclusion, we find from the above analysis that the\noccurrence of granular droplets may be more common\nthan previously thought. It is of great interest to explore\nthe subsequent dynamics in a granular model for the description of various observables measured in high-energy\nheavy-ion collisions. This is particularly relevant because\na granular droplet model can explain the occurrence of\nearly emission of particles and a small value of Rout [28].\nB.\n\nBulk density oscillations due to surface tension\ninteractions\n\nwhere αr > 0 and 1/μ are the strength and the range of\nthe residual interaction that leads to the surface tension.\nAs a residual interaction, v(r) has been chosen such that\nthe contribution of the interaction to the total energy of\na system with a uniform density is zero and is positive\nand proportional to the surface area in the surface region.\nTo carry out the stability analysis, we can envisage\nthat by solving the hydrodynamical equation (5) without\nthe surface interaction, one obtains a comparatively slowvarying density distribution ǫ0 (r, t) with a local average\nǭ0 = hǫ0 (r, t)i. Then following the derivations of the\nequation of sound waves [59], the perturbation δǫ(r, t) =\nǫ(r, t) − ǫ0 (r, t) obeys the wave equation\nZ\n∂ 2 δǫ(r, t)\n2 2\n≈\nc\n∇\nδǫ(r,\nt)\n+\n∇\n*\ndr′ [(δǫ(r, t)ǫ(r′ , t)\nr\ns\n∂t2\n+ ǫ(r, t)(δǫ(r′ , t))]∇r v(r − r′ )/W 2 , (8)\nwhere cs is the speed of sound. We consider density perturbations of the type\nδǫ(r, t) = eik*r−iωt .\n\nRepresenting the spatial variation of ǫ0 (r, t) by its average ǭ0 , we obtain from Eq. (8)\nω 2 = c2s f (k)k2 ,\n\nTo carry out the analysis of the effects of surface tension on the stability of density oscillations, we consider\nthe following simple model of the surface tension, as represented by a finite-range interaction. The equation of\nhydrodynamics without a finite-range interaction is [59]\n[ǫ + p]uk\n\n∂ui\n∂p\n∂p\n= − i − ui uk k ,\n∂xk\n∂x\n∂x\n\n(5)\n\nwhere ǫ and p are the energy density and pressure. In\nthis hydrodynamical equation, interactions between constituents leading to bulk properties of the plasma have\nalready been included into the characterization of the\npressure p and the energy density ǫ. What remains is the\neffective residual finite-range interaction v(r − r′ ) that\ncan lead to the surface tension. In the presence of this\nfinite-range residual interaction, the above can be generalized to be [60]\n∂ui (r)\n∂p(r)\n∂p(r)\n[ǫ(r) + p(r)]uk (r)\n=−\n− ui (r)uk (r)\nk\ni\n∂x\n∂x\n∂xk\nZ\n′\nǫ(r\n)\nǫ(r)\n∇i v(r − r′ ) ,\n(6)\n−\ndr′\nW W\nwhere W is the average energy per particle which may\nbe temperature-dependent, and ǫ(r)/W gives the number\ndensity n(r) of the constituents at r.\nWe choose to represent the effect of the surface tension in terms of an effective residual interaction of the\nfollowing form as used in [47],\nv(r) = αr (1 −\n\nμr e−μr\n)\n,\n2\nr\n\n(7)\n\n(9)\n\n(10)\n\nfor points in the interior of the medium. Here, f (k) is\nf (k) = 1 −\n\n4aμ2 k2\n,\n(k2 + μ2 )2\n\n(11)\n\nwhere the second term of f (k) arises from the surface\ntension interaction v(r), and a is the granular stability\nnumber defined as\na=\n\nǭ0 παr\n.\nW 2 μ2 c2s\n\n(12)\n\nEquations (10) and (11) indicates that when f (k) becomes negative, the system is unstable against a density\nperturbation of wave number k. We plot in Fig. 2 the\nfunction f (k) as a function of k/μ. As one observes, the\nminimum of f (k) is located at k/μ = 1 for which the\ncharacteristic wave length of the oscillation 1/k is equal\nto the range of the interaction 1/μ. The function f (k)\nbecomes negative when a ≥ 1 and it is therefore appropriate to call a the granular stability number. When the\ngranular stability number a is greater than unity, the system is unstable against perturbations with wave numbers\nk in the interval k− ≤ k ≤ k+ , with k± given by\nn\no\np\nk2± = 2a − 1 ± (2a − 1)2 − 1 μ2 .\n(13)\nWe note from Eq. (12) that the condition a ≥ 1 for\nthe occurrence of granular instability happens when the\nsurface tension interaction strength αr is large. It will\nbe useful to relate αr to the surface tension coefficient\n\n\f4\n\n1\n0.8\n\n1/2\n\nσ=\n\n3/4\n\n0.6\n\nf(k)\n\nrelationship\n\na = 1/4\n\n5/4\n\n0.2\nUnstable\nRegion\n\n-0.2\n\na=\n\n0 0.5 1 1.5 2 2.5 3 3.5 4\n\nk/μ\n\nFIG. 2: f (k) curves for different values of a. The expansion\nis unstable in the shadowy region.\n\nσ. For such a purpose, we study the energy of a system\nwith a numbers density profile given by\nn(r) = nout +\n\nn0 − nout\n,\n1 + ez/a\n\n(14)\n\nwhere n0 (> nout ) is the number density in the interior\ndense region of a surface and nout is the number density\nin the outer dilute region. The energy of the system due\nto the residual interaction of Eq. (7) is\nZ\nZ\n1\ndρ dz n(r) dρ′ dz ′ n(r′ )v(r − r′ ).\n(15)\nE=\n2\nWe can introduce V (z) as\nZ\nV (z) = dρ′ dz ′ n(r′ )v(r − r′ ).\nAfter integration the ρ′ coordinates, we find\nZ\nπαr ∞ ′\nV (z) =\ndz n(z ′ )\nμ −∞\no\nn\n′\n′\n× e−μ|z−z | − μ|z − z ′ |e−μ|z−z | .\n\n(16)\n\n(17)\n\nFrom Eqs. (15)-(17), the surface tension coefficient is\ntherefore given by\nσ ≡ dE/dρ\nZ\nZ ∞\nαr π ∞\n=\ndz n(z)\ndz ′ n(z ′ )\n2μ −∞\n−∞\no\nn\n′\n′\n× e−μ|z−z | − μ|z − z ′ |e−μ|z−z | ,\n\n(19)\n\nThe surface tension coefficient increases with αr /μ3 and\nthe square of the number density. As n0 varies with\ntemperature as T 3 while αr and μ are relatively slowly\nvarying functions of T , the surface tension varies with\ntemperature approximately as T 6 . When the surface is\ndescribed by a sharp surface profile, the granular stability number a is related to the surface tension coefficient\nσ by\n\n1\n\n0.4\n\n0\n\nn20 παr\n.\n2μ3\n\n(18)\n\nwhich gives a relation between σ and αr for a general\ndensity profile. For the simple case of a sharp boundary with n(z) = n0 θ(−z), the above equation gives the\n\n2μσ\n.\nǫ0 c2s\n\n(20)\n\nIn quenched QCD lattice gauge calculations, the surface tension coefficient σ(Tc ) has been calculated for\nT = Tc , and σ(Tc )/Tc3 was found to range from 0.016\nto 0.092 [50, 51, 52, 53]. If we use such a value of the\nsurface tension coefficient to evaluate the granular stability number a using Eq. (12), the quantity a will have the\nvalue from 0.024 to 0.140 and the system is stable against\ndensity oscillations of the type discussed here. However,\nthe medium considered by the quenched QCD approximation consists of gluons without dynamical quarks. As\nis well known, the presence of dynamical quarks has important influences on many thermodynamical properties\nof the plasma. The phase transition temperature is altered from 269 MeV for quenched QCD without dynamical quarks to 154 MeV for full QCD with 3 flavors of\nquarks [61], whereas the surface tension coefficient σ depends on the temperature approximately as T 6 . The\nnumber density of a quark-gluon plasma with three flavors of quarks is about two times the number density\nof the plasma without dynamical quarks, while the surface tension coefficient varies as the square of the number\ndensity. The surface tension coefficient σ calculated in\nquenched QCD at T = Tc may be quite different from\nthat calculated in full QCD at higher temperatures. It\nwill be of interest to evaluate the surface tension coefficient in full QCD and study its temperature dependence\nin order to find out whether the quark-gluon plasma is\nstable against bulk density oscillations with wave lengths\nclose the the range of the interaction discussed here.\nThe above discussions was carried out in the linearized\nperturbative theory of slow hydrodynamical motion. We\nenvisage that the initial QGP matter is highly compressed in the longitudinal direction and the subsequent\nlongitudinal expansion will be rather rapid and nonlinear in the density changes. In this respect, it is of\ninterest to note that in previous calculations in full hydrodynamics for the rapid expansion of a nuclear system\nwith a finite range interaction, the one-dimensional fragmentation of the density into one-dimensional \"lumps'\noccur, as shown in the left panel of Fig. 2 of Ref. [62]. If\nthese hydrodynamical calculations can be a useful analogue, the analogous occurrence of granular droplets in\n\n\fthe bulk expansion of the quark-gluon plasma may be\npossible.\nIII.\n\nMODEL OF GRANULAR QGP DROPLETS\n\nBased on the above discussions, we would like to use a\nmodel of granular quark-gluon plasma droplets to examine the dynamical evolution of the system. We assume\nthat the system consists of Nd droplets of radius rd initially distributed in a short cylinder of length 2Rz along\nthe beam direction (z direction) as in Fig. 2c, with an\ninitial transverse spatial distribution up to a radius Rt ,\ndPd\n∝ [1 − exp(−ρ2 /∆R2t )]\n2πρ dρ dz\n× θ(Rt − ρ) θ(Rz − |z|) ,\n(21)\np\nwhere ρ = x2 + y 2 and z are the coordinates of the\ncenter of a droplet. The parameter ∆Rt describes a shelltype radial distribution which may arise from the dynamics of the transverse expansion. A naive blast-wave-type\nexpansion with a constant radial velocity would leave a\nvoid along the central transverse axis at ρ = 0. Instead\nof a constant transverse velocity, we shall find later that\nthe best parameters that describe the experimental data\nsuggests a transverse velocity profile (βd )T ∼ ρ0.42 . From\nthe equation of continuity, the density would change approximately by\n1 d\nn\ndn\n∼ −n\nρ(βd )T ∝ −1.42 0.58 .\ndt\nρ dρ\nρ\n\n(22)\n\nThus the density decreases more rapidly near ρ ∼ 0 and\nthere is a tendency to form a shell-type radial distribution. The shell-type distribution of the droplets may also\narise from the shadowing of detected particles originating from the central region of ρ ∼ 0. The HBT radii\nas a function of the average pion transverse momentum\nof a pion pair turns out to be slightly sensitive to this\nparameter of ∆Rt .\nBecause of the early thermalization and the anisotropic\npressure gradient, the droplets will acquire anisotropic\ninitial velocities. We assume that the velocity of a droplet\ndepends on the initial coordinates of the droplet center,\n(r1 , r2 , r3 ) = (x, y, z), in the form\n\u0012\n\u0013b\n|ri | i\n(βd )i = ai sign(ri )\n,\nRi\n\ni = 1, 2, and 3, (23)\n\nwhere ai is describes the magnitude of the anisotropic\nexpansion, sign(ri ) denotes the sign of ri , and bi (bT , bz )\nare the exponential power parameter that describes the\nvariation of the velocity with ri .\nFor each single droplet, we use relativistic hydrodynamics and the equation of state of the entropy density [16, 42, 63, 64] to describe its subsequently evolution [28, 44]. The evolution of the granular source of\nmany droplets can then be obtained by superposing all\n\nd 2N/2πpTdpT dy [(c/Gev) 2 ]\n\n5\n\n_\na_T=0.365, az=0.750\naT=0.365, az=0.850\n_\naT=0.200, az=0.850\n\n102\n10\n1\n10-1\n10-2\n\nPHENIX DATA\n\n10-3\n0\n\n0.5\n\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\npT (GeV/c)\nFIG. 3: Negative pion transverse momentum spectrum for\n|y| < 0.5. The open circles give the PHENIX data for\n√\nsNN = 200 GeV Au + Au collisions with minimum bias\n[65]. Various curves give theoretical predictions with different parameters.\n\nof the evolutions of individual droplets [28, 44]. In our\ncalculations, the transition temperature and the transition temperature width are taken to be Tc = 165 MeV\nand ∆T = 0.05Tc [16, 28, 42, 44]. The initial energy density of the droplets is taken to be ǫ0 = 3.75Tcsc , which\nis about two times of the density of quark matter at Tc\n[16, 42]. The pions are emitted out of the surfaces of\ndroplets at the freeze-out temperature Tf = 0.95Tc, with\nmomenta obeying the Bose-Einstein distribution in the\nlocal frame at the temperature Tf .\nIn our model calculations there are five velocity parameters, {ax , ay , az , bT = bx = by , and bz }, and four\nsize parameters of the granular source, {Rt , Rz , ∆Rt ,\nand rd }. We find that the pion transverse momentum\nspectra and the elliptic flow v2 are sensitive to the velocity parameters and insensitive to the size parameters.\nWhile our HBT results are sensitive both to the velocity\nparameters and the size parameters. We first determine\nthe velocity parameters by comparing the pion transverse\nmomentum spectra and the elliptic flow v2 of our model\ncalculations with experimental data. Then, we determine\nthe source size parameters by comparing our results of\nHBT radii with experimental data.\nFigure 3 shows the PHENIX π − transverse momentum\n√\nspectrum in sN N = 200 GeV Au + Au collisions with\nminimum bias [65] and the transverse momentum spectrum obtained in our model calculations. The theoretical\nresults have been normalized by matching the distribution to the first pT bin. In our calculations, we use a cut\nof particle rapidity |y| < 0.5 in order to compare with\n\n\fexperimental data, which have been normalized to unit\nrapidity [65]. Instead of the velocity magnitude parameters of ax and ay , we can equivalently use their average\nāT = (ax + ay )/2 and their difference ∆aT = ax − ay .\nThe transverse momentum spectra depend on āT and is\nindependent of ∆aT . They also depend on az , bT , and bz .\nWe shall show that the elliptic flow v2 is very sensitive\nto ∆aT , bT and bz . Good agreement with experimental data of transverse momentum spectra and the elliptic\nflow can be obtained concurrently by taking bT = 0.42,\nbz = 0.03 and ∆aT = 0.10. After bT and bz are fixed,\nthe parameters āT and az can be obtained by comparing the transverse momentum spectrum of the granular\nsources with experimental data [65]. We finally determine āT = 0.365 and az = 0.850 for our granular source.\n\nv2\n\n6\n\n0.3\n\nbz=0.03,\nbT=0.42, ∆aT=0.10\nbT=0.03, ∆aT=0.06\n\n0.25\n\nbT=1.00, ∆aT=0.13\n\n0.2\n\nbz=0.42, bT=0.42,\n∆aT=0.13\n\n0.15\n0.1\n_\n(aT=0.365, az=0.850)\n\n0.05\n\nPHENIX DATA\n\n0\n0\n\nIV.\n\nRESULTS OF THE ELLIPTIC FLOW\n\nThe transverse momentum distribution of particles can\nbe represented in the form [66, 67, 68]\n\u0014\n\u0015\nX\nd2 N\ndN\n=\n1\n+\n2\nv\ncos(nφ)\n,\n(24)\nn\ndpT2 dφ\n2πdpT2\nn\nq\nwhere pT = p2x + p2y is the transverse momentum of\nthe particle, φ is its azimuthal angle with respect to\nthe reaction plane, and the harmonic coefficients, vn are\nanisotropy parameters. The elliptic flow is defined as the\nsecond harmonic coefficient v2 , which describes the eccentricity of the particle distribution in the momentum\nspace. We choose the direction of x-axis in the reaction\nplane and the direction of y-axis out of the reaction plane.\nWe can express v2 as\n\u001c 2\n\u001d\npx − p2y\nv2 ≡ hcos 2φi =\n.\n(25)\npT2\nFigure 4 shows the PHENIX v2 data as a function of pT\n√\nfor charged pions in Au + Au collisions at sN N = 200\nGeV [10]. Also shown are the theoretical v2 results in\nour granular droplet model. We use the same cut for\nparticle pseudo-rapidity, |η| < 0.35, in theoretical calculations, as in the experiment set-up [10]. In the region\npT < 2 GeV, the v2 coefficient for a granular source increases with pT as in previous hydrodynamical calculations [35, 36, 69, 70, 71, 72, 73]. However, in the high\npT region with pT > 2.5 GeV, we find that the v2 coefficient for a granular source with small bz decreases\nwith pT , which is different from previous hydrodynamical calculations [8, 9, 10, 11, 36, 69, 70, 73]. In the\ndroplet-rest frame, the average transverse momentum of\nparticles in the x and y directions, hp′x i and hp′y i, are the\nsame. In the laboratory frame, a elliptic flow arises from\nthe anisotropic collective transverse boost of the droplet.\nFor a very small bz , the longitudinal velocity of droplets\nis almost constant in the source while the magnitude of\nthe longitudinal boost velocity az is very large (0.85) in\n\n1\n\n2\n\n3\n\n4\n\npT (GeV/c)\nFIG. 4: Pion elliptic flow v2 as a function of particle transverse momentum for the granular sources and the experimental data of charged pions of PHENIX [10].\n\nour model. In this case, the longitudinal component of\ndroplet velocity is important and it does not boost the\ntransverse momenta of the particles. The transverse velocity of the droplet is much smaller than the longitudinal\nvelocity of the droplet. Its boost effect becomes weaker\nfor the particles with higher transverse momentum p′T\n(higher pT ). On the other extreme for larger bz , the\nlongitudinal velocity of droplet is small for the droplets\nwith small longitudinal coordinates. The transverse components of droplet velocity are dominant in the small z\nregion, which lead to a production of the elliptic flow and\nthe v2 coefficient increasing with transverse momentum\n[71], even at higher pT as shown in the dashed-dot curve\nin Fig. 4.\nAfter āT and az have been fixed at the values 0.365\nand 0.850 as determined by the pion transverse momentum spectra, we examine the pattern of v2 as a function of transverse momentum pT as we vary bT , bz , and\n∆aT . In the region of pT < 2 GeV, the curvature of\nv2 is sensitive to bT . For bz = 0.03, the curvature for\nbT = 0.03 is too large (see the dashed line in Fig. 4)\nand the curvature for bT = 1.00 is too small (see the\ndot line in Fig. 4). For bz = bT = 0.42, the curve\nof v2 rises continuously and deviates from experimental\ndata for pT > 1.5 GeV. We find that the set of parameters {bz , bT , aT } = {0.03, 0.42, 0.10} give results consistent with experimental v2 data, as indicated by the solid\ntheoretical curves in Fig. 4. The fact that bT is much\ngreater than bz while az is substantially greater than aT\nindicates that the dynamical behavior in the transverse\nexpansion and longitudinal expansion are very different.\nRecent experimental data of the elliptic flow of pion\nshow that v2 remains to have the value of 0.1 at very\nhigh pT [74]. The processes of particle production in the\n\n\f7\n\nV.\n\nRESULTS OF HBT INTERFEROMETRY\n\nThe two-particle Bose-Einstein correlation function is\ndefined as the ratio of the two-particle momentum distribution P (p1 , p2 ) relative to the the product of the\nsingle-particle momentum distribution P (p1 )P (p2 ). For\na chaotic pion-emitting source, P (pi ) (i = 1, 2), and\nP (p1 , p2 ) can be expressed as [75]\nX\nP (pi ) =\nA2 (pi , Xi ) ,\n(26)\n\n1.8\nKT < 400 MeV/c\n\n1.6\n\nC(qi ;qj , qk < 20 MeV/c)\n\nhigh pT region are dominated by parton and hard-probe\nprocesses and is beyond the thermal emission model we\nconsider here.\n\nKT < 400 MeV/c\n\nKT < 400 MeV/c\n\n1.4\n1.2\n1\n1.6\n\nKT > 400 MeV/c\n\nKT > 400 MeV/c\n\nKT > 400 MeV/c\n\n1.4\n1.2\n1\n0\n\n50\n\n100\n\nqout (MeV/c)\n\n0\n\n50\n\n100\n\nqside (MeV/c)\n\n0\n\n50\n\n100 150\n\nqlong (MeV/c)\n\nFIG. 5: Two-pion correlation functions for granular source.\n\n(27)\n\nwhere A(pi , Xi ) is the magnitude of the amplitude for\nemitting a pion with 4-momentum pi = (pi , Ei ) in the\nlaboratory frame at Xi and is given by the Bose-Einstein\ndistribution with freeze-out temperature Tf in the local rest frame of the source point. Φ(p1 , p2 ; X1 , X2 ) is\nthe two-pion wave function. Neglecting the absorption\nof the emitted pions by other droplets, Φ(p1 , p2 ; X1 , X2 )\nis simply\nΦ(p1 , p2 ; X1 , X2 )\n1 h\n= √ A(p1 , X1 )A(p2 , X2 )eip1 *X1 +ip2 *X2\n2\ni\n+ A(p1 , X2 )A(p2 , X1 )eip1 *X2 +ip2 *X1 .\n\n(28)\n\nUsing the components of \"out\", \"side\", and \"long\"\n[76, 77] of the relative momentum of the two pions,\nq = |p1 − p2 |, as variables, we can construct the\ncorrelation function C(qout , qside , qlong ) from P (p1 , p2 )\nand P (p1 )P (p2 ) by summing over p1 and p2 for each\n(qout , qside , qlong ) bin [28]. The HBT radii Rout , Rside ,\nand Rlong can then be extracted by fitting the calculated\ncorrelation function C(qout , qside , qlong ) with the following\nparametrized correlation function\n2\n\n2\n\n2\n\n2\n\n2\n\n2\n\nC(qout , qside , qlong ) = 1 + λ e−qout Rout −qside Rside −qlong Rlong .\n(29)\nFigure 5 shows the theoretical two-pion correlation\nfunctions for the granular source. The top figures give the\nresults for a average pion transverse momentum of a pion\npair, KT , less than 400 MeV/c, and the bottom figures\nfor KT > 400 MeV/c. The velocity parameters of the\ngranular source are āT = 0.365, ∆aT = 0.10, az = 0.850,\nbT = 0.42, and bz = 0.03, which are determined by the\ntransverse momentum spectra and the elliptic flow v2 as\ndiscussed above. The size parameters of the granular\nsources are taken to be Rt = 8.8 fm, ∆Rt = 3.5 fm,\nRz = 7.0 fm, and rd = 1.3 fm. The number of droplet\n\nRside (fm)\n\nΦ(p1 , p2 ; X1 , X2 ) ,\n\nX1 ,X2\n\nRout / Rside\n\n2\n\nRlong (fm)\n\nP (p1 , p2 ) =\n\nX\n\nRout (fm)\n\nXi\n\n∆Rt =0.0 fm\n∆Rt =3.5 fm\n\n6\n5\n4\n3\n2\n6\n5\n4\n3\n2\n\nPHENIX\nSTAR\n∆Rt =3.5 fm\n\n1.1\n1\n0.9\n0.8\n0.7\n0.6\n7\n6\n5\n4\n3\n2\n0\n\n0.4\n\n0.8 0\n\nKT (GeV/c)\n\n0.4\n\n0.8\n\n1.2\n\nKT (GeV/c)\n\nFIG. 6: Two-pion HBT radii obtained by the PHENIX Collaboration [14] and the STAR Collaboration [5] compared\nwith the theoretical results calculated in the granular droplet\nmodel with ∆Rt = 0 and 3.5 fm.\n\nNd is taken to be 40 in our calculations. One observes\nnoticeable differences in the lower KT region as compared\nto the higher KT region.\nThe left panels of figure 6 give the fitted two-pion HBT\nradii for the granular source as a function of KT . The\nsymbols of circle and down-triangle are for ∆Rt = 0.35\nfm and ∆Rt = 0, respectively. The parameter ∆Rt of\nEq. (21) describes the radial distribution of the centers\nof the droplets, with ∆Rt = 0 for a uniform distribution\nand ∆Rt = 0.35 fm for a shell-type radial distribution.\nThe experimental PHENIX results [14], and STAR re-\n\n\f8\nsults [5] are shown on the right panels. The curve gives\nthe theoretical results for ∆Rt = 0.35 fm. For our theoretical HBT calculations, we use a cut for particle pseudorapidity region |η| < 0.35, the same as in the PHENIX\nexperiments [14]. We find that if we increase the parameter rd , the HBT radii Rout and Rlong will increase. And\nif we increase the parameter ∆Rt , the variation of HBT\nradii Rout and Rside with KT will become steep. The\nHBT results of granular source for ∆Rt = 3.5 fm agree\nquite well with experimental data, although the case with\n∆RT = 0 also give almost as good an agreement.\nVI.\n\nSUMMARY AND CONCLUSION\n\nThe expansion of the dense matter produced in highenergy heavy-ion collisions may favor the production of\ngranular droplets. The strong interaction associated with\nthe dense matter will lead naturally to the presence of a\nsurface tension on a boundary.\nIn an event-by-event basis, the initial transverse density distribution of matter in central nucleus-nucleus\ncollisions have been known to be highly fluctuating\n[29, 41, 54]. This large spatial fluctuations may facilitate the formation of granular droplets. We envisage\nthat as the expansion in the longitudinal direction proceeds much more rapidly than in the transverse direction,\nthese initial transverse density fluctuations will lead to\nthe formation of many longitudinal tubes of matter with\na length much greater than its radius. Due to the surface\ntension effects, these tubes are unstable against granular\nsausage instability and will tend to break up into approximately equal-size spherical droplets.\nMotivated by the possibility for the occurrence of granular droplets and our previous successful HBT analysis in\nterms of granular QGP droplets, we refine our previous\ngranular QGP droplet model to include initial anisotropic\nvelocities due to the anisotropic pressure gradients at an\nearlier stage of the collisions. We investigate concurrently\n\n[1] M. Gyulassy and L. McLerran, nucl-th/0405013.\n[2] See also New Discoveries at RHIC: the current case for\nthe strongly interactive QGP, RIKEN Scientific Articles,\nVolume 9, BNL, May 14-15, 2004.\n[3] BRAHMS Collaboration, I. Arsene et al., Nucl. Phys. A\n757, 1, 2005.\n[4] PHOBOS Collaboration, B. B. Back et al., Nucl. Phys.\nA 757, 28, 2005.\n[5] STAR Collaboration, J. Adams et al., Nucl. Phys. A 757,\n102, 2005.\n[6] PHENIX Collaboration, K. Adcox et al., Nucl. Phys. A\n757, 184, 2005.\n[7] STAR Collaboration, C. Adler et al., Phys. Rev. Lett.\n87, 182301, 2001.\n[8] STAR Collaboration, C. Adler et al., Phys. Rev. Lett.\n89, 132301, 2002.\n[9] STAR Collaboration, C. Adler et al., Phys. Rev. Lett.\n\nthe data of (1) the pion transverse momentum spectra,\n(2) the elliptic flow v2 as a function of pT , and (3) various\nHBT radii as a function of KT , for Au + Au collisions at\n√\nsN N = 200 GeV at RHIC. We find that the collection\nof different pieces of experimental data can be described\nwell by a granular source model. Direct confirmation\nof the granular droplet configuration may need to await\nmore experimental work on single-event HBT correlations and the fluctuation between correlation functions\nof the single- and mixed-events, as suggested previously\n[43, 44].\nThe extracted parameters from our analysis provide\nuseful information on the nature of the transverse and\nlongitudinal expansion. The elliptic flow v2 is due to\nthe anisotropic initial dynamical conditions in different\ntransverse directions. Its decrease at high pT is sensitive to the exponential power parameter of the droplet\nvelocity bz in the longitudinal direction. The value of\nbz is much smaller than that of bT , indicating different\ndynamical behaviors in longitudinal and transverse directions. Our HBT results further indicate that the granular source has a small lifetime and a possible shell-type\nspatial distribution. Further studies on the origin of the\ndifference in the transverse and longitudinal dynamics as\nwell as the spatial distribution in the transverse direction\nwill be of great interest.\nAcknowledgments\n\nW.N.Z. would like to thank Dr. V. Cianciolo and Dr.\nG. Young for their kind hospitality at Oak Ridge National Laboratory. We acknowledge discussions with Dr.\nT. Chujo, Dr. V. Cianciolo, Dr. B.-A. Li, and Dr. B.\nZhang. This research was supported by the National\nNatural Science Foundation of China under Contracts\nNo. 10275015 and No. 10575024, and by the Division\nof Nuclear Physics, US DOE, under Contract No. DEAC05-00OR22725 managed by UT-Battle, LC.\n\n90, 032301, 2003.\n[10] PHENIX Collaboration, S. S. Adler et al., Phys. Rev.\nLett. 91, 182301, 2003.\n[11] STAR Collaboration, J. Adams et al., Phys. Rev. Lett.\n92, 052302, 2004.\n[12] STAR Collaboration, C. Adler et al., Phys. Rev. Lett.\n87, 082301, 2001.\n[13] PHENIX Collaboration, K. Adcox et al., Phys. Rev. Lett.\n88, 192302, 2002.\n[14] PHENIX Collaboration, S. S. Adler et al., Phys. Rev.\nLett. 93, 152302, 2004.\n[15] STAR Collaboration, J. Adams et al., Phys. Rev. C 71,\n044906, 2005.\n[16] D. H. Rischke and M. Gyulassy, Nucl. Phys A 608, 479\n(1996).\n[17] D. Teaney and E. Shuryak, Phys. Rev. Lett. 83, 4951\n(1999).\n\n\f9\n[18] U. A. Wiedemann and U. Heinz, Phys. Rept. 319, 145\n(1999).\n[19] S. Soff, S. A. Bass and A. Dumitru, Phys. Rev. Lett. 86,\n3981 (2001).\n[20] R. M. Weiner, Phys. Rept. 327, 249 (2002).\n[21] S. Pratt, Nucl. Phys. A 715, 389c (2003).\n[22] S. Soff, S. A. Bass, D. H. Hardtke, and S. Y. Panitkin, J.\nPhys. G 28, 1885 (2002).\n[23] U. Heinz and P. Kolb, Nucl. Phys. A 702, 269 (2002).\n[24] Zi-Wei Lin, C. M. Ko, and Subrata Pal, Phys. Rev. Lett.\n89, 152301 (2002).\n[25] D. Teaney, Nucl. Phys. A 715, 817 (2003).\n[26] T. Csörgö and J. Zimányi, Acta Phys. Hung. New Series,\nHeavy-Ion Physics, 17, 281 (2003), nucl-th/0206051.\n[27] D. Molnár and M. Gyulassy, Phys. Rev. Lett. 92, 052301\n(2004).\n[28] W. N. Zhang, M. J. Efaaf, C. Y. Wong, Phys. Rev. C 70,\n024903 (2004).\n[29] O. Socolowski Jr., F. Grassi, Y. Hama, and T. Kodama,\nPhys. Rev. Lett. 93, 182301 (2004);\n[30] C. Y. Wong, J. Phys. G 29, 2151 (2003); C. Y. Wong, J.\nPhys. G 30, S1053 (2004); C. Y. Wong, AIP Conference\nProceedings, 828, 617 (2006), hep-ph/0510258.\n[31] J. G. Cramer, G. A. Miller, J. M. S. Wu, and J. H. Yoon,\nPhys. Rev. Lett. 94, 102302 (2005).\n[32] M. A. Lisa, S. Pratt, R. Soltz, U. Wiedemann, Ann. Rev.\nNucl. Part. Sci. 55, 357 (2005); nucl-ex/0505014.\n[33] S. Pratt and D. Schindel, nucl-th/0511010.\n[34] E. Frodermann, U. Heinz, M. A. Lisa, Phys. Rev. C 73,\n044908 (2006).\n[35] T. Hirano and K. Tsuda, Phys. Rev. C 66, 054905 (2002).\n[36] P. Huovinen, Nucl. Phys. A 715, 299 (2003).\n[37] T. Humanic, Nucl. Phys. A 715, 641 (2003); T. Humanic,\nInt. J. Mod Phys. E 15, 197 (2006).\n[38] M. Csanád, T. Csörgó, B. Lr̈stad. and A. Ster, J. Phys.\nG 30, S1079 (2004); M. Csanád, T. Csörgó, B. Lr̈stad,\nand A. Ster, nucl-th/0510027.\n[39] Z. W. Lin, C. M. Ko, B. A. Li, B. Zhang, S. Pal, Phys.\nRev. C 72, 064901 (2005).\n[40] B. Tomás̆ik, nucl-th/0509100.\n[41] Y. Hama, Rone P.G. Andrade, F. Grassi, O. Socolowski Jr, T. Kodama, B. Tavares, S. S. Padula,\nhep-ph/0510096.\n[42] D. H. Rischke, Proceedings of the 11th Chris Engelbrecht Summer School in Theoretical Physics, Cape\nTown, February 4-13, 1998, nucl-th/9809044.\n[43] C. Y. Wong and W. N. Zhang, Phys. Rev. C 70, 064904\n(2005).\n[44] W. N. Zhang, S. X. Li, C. Y. Wong, and M. J. Efaaf,\nPhys. Rev. C 71, 064908 (2005).\n[45] E. Witten, Phys. Rev. D 30, 272 (1984).\n[46] W. D. Myers and W. J. Swiatecki, Ann. Phys. 84, 186\n(1974).\n[47] P. Möller, J. R. Nix, W. D. Myers, and W. J. Swiatecki,\nAtom. Data Nucl. Data Tabl. 59, 185 (1995).\n[48] K. Kajantie and H. Kurki-Suonio, Phys. Rev. D 34, 1719\n\n(1986).\n[49] L. P. Csernai and J. I. Kapusta, Phys. Rev. Lett. 69, 737\n(1992).\n[50] Y. Iwasaki et al., Phys. Rev. D 49, 3540 (1994).\n[51] B. Grossmann and M. L. Lauren, Nucl. Phys. B 408, 637\n(1993).\n[52] B. Beinlich, F. Karscha and A. Peikerta Phy. Lett. B\n390, 268 (1997).\n[53] L. S. Kisslinger, S. Walawalkar, and M.B. Johnson, Phys.\nRev. D 71, 065017 (2005).\n[54] H. J. Drescher, F. M. Liu, S. Ostapchenko, T. Pierog,\nand K. Werner, Phys. Rev. C 65, 054902 (2002).\n[55] L. D. Landau, Izv. Akad. Nauk. SSSR. ser. fiz. 17, 51\n(1953); L. D. Landau and S. Z. Belenkii, Usp. Fiz. Nauk\n56, 309 (1955).\n[56] P. Steinberg, Nucl. Phys. A 752, 423 (2005).\n[57] M. Murray, the BRAHMS Collaboration, J. Phys. G 30,\nS667 (2004).\n[58] C. Y. Wong, Ann. Phys. (N.Y.) 77, 279 (1973).\n[59] L. D. Landau and E. M. Lifshitz, Fluid Mechanics, (Pergamon, New York, 1959).\n[60] C. Y. Wong, J. Math. Phys. 17, 1008 (1976); C. Y. Wong,\nJ. A. Maruhn, and T. A. Welton, Nucl. Phys. A 253, 469\n(1975); C. Y. Wong, T. A. Welton, and J. A. Maruhn,\nPhys. Rev. C 15, 1558 (1977).\n[61] F. Karsch, E. Laermann, and A. Peikert, Nucl. Phys. B\n605, 579 (2001).\n[62] C. Y. Wong, J. A. Maruhn, and T. A. Welton, Phys.\nLett. B 66, 19 (1977).\n[63] J. P. Blaizot and J. Y. Ollitrault, Phys. Rev. D 36, 916\n(1987).\n[64] E. Laermann, Nucl. Phys. A 610, 1 (1996).\n[65] PHENIX Collaboration, S. S. Adler et al., Phys. Rev. C\n69, 034909, 2004.\n[66] C. Y. Wong, Phys. Lett. B 88, 39 (1979).\n[67] J. Y. Ollitrault, Phys. Rev. D 46, 229 (1992).\n[68] S. Voloshin, Y. Zhang, Z. Phys. Rev. C 70, 665 (1996);\nhep-ph/9407282.\n[69] P. F. Kolb, J. Sollfrank, U. Heinz, Phys. Rev. C 62,\n054909 (2000).\n[70] P. F. Kolb, P. Huovinen, U. Heinz, H. Heiselberg, Phys.\nLett. B 500, 232, (2001).\n[71] P. Huovinen, P. F. Kolb, U. Heinz, P. V. Ruuskanen, S.\nA. Voloshin, Phys. Lett. B 503, 58, (2001).\n[72] P. F. Kolb, R. Rapp, Phys. Rev. C 67, 044903, (2003).\n[73] P. Huovinen, nucl-th/0305064.\n[74] P. R. Sorensen, nucl-ex/0510052.\n[75] C. Y. Wong, Introduction to High-Energy Heavy-Ion Collisions (World Scientific, Singapore, 1994), Chap. 17.\n[76] S. Pratt, Phys. Rev. Lett. 53, 1219 (1984); S. Pratt,\nPhys. Rev. D 33, 72 (1986); S. Pratt, T. Csörgo, and\nJ. Zimányi, Phys. Rev. C 42, 2646 (1990).\n[77] G. Bertsch, M. Gong, and M. Tohyama, Phys. Rev. C\n37, 1896 (1988); G. Bertsch, Nucl. Phys. A 498, 173c\n(1989).\n\n\f"}