{"id": "http://arxiv.org/abs/hep-ph/0605005v1", "guidislink": true, "updated": "2006-05-01T16:14:31Z", "updated_parsed": [2006, 5, 1, 16, 14, 31, 0, 121, 0], "published": "2006-05-01T16:14:31Z", "published_parsed": [2006, 5, 1, 16, 14, 31, 0, 121, 0], "title": "The Neutrino Future -- Comments Honoring Gustavo Branco", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0605100%2Chep-ph%2F0605063%2Chep-ph%2F0605215%2Chep-ph%2F0605284%2Chep-ph%2F0605232%2Chep-ph%2F0605307%2Chep-ph%2F0605295%2Chep-ph%2F0605102%2Chep-ph%2F0605025%2Chep-ph%2F0605341%2Chep-ph%2F0605296%2Chep-ph%2F0605243%2Chep-ph%2F0605237%2Chep-ph%2F0605269%2Chep-ph%2F0605131%2Chep-ph%2F0605242%2Chep-ph%2F0605153%2Chep-ph%2F0605305%2Chep-ph%2F0605031%2Chep-ph%2F0605089%2Chep-ph%2F0605059%2Chep-ph%2F0605278%2Chep-ph%2F0605250%2Chep-ph%2F0605019%2Chep-ph%2F0605328%2Chep-ph%2F0605234%2Chep-ph%2F0605244%2Chep-ph%2F0605003%2Chep-ph%2F0605200%2Chep-ph%2F0605078%2Chep-ph%2F0605248%2Chep-ph%2F0605228%2Chep-ph%2F0605058%2Chep-ph%2F0605118%2Chep-ph%2F0605035%2Chep-ph%2F0605079%2Chep-ph%2F0605331%2Chep-ph%2F0605303%2Chep-ph%2F0605335%2Chep-ph%2F0605162%2Chep-ph%2F0605301%2Chep-ph%2F0605263%2Chep-ph%2F0605321%2Chep-ph%2F0605311%2Chep-ph%2F0605275%2Chep-ph%2F0605223%2Chep-ph%2F0605257%2Chep-ph%2F0605046%2Chep-ph%2F0605005%2Chep-ph%2F0605166%2Chep-ph%2F0605224%2Chep-ph%2F0605262%2Chep-ph%2F0605253%2Chep-ph%2F0605293%2Chep-ph%2F0605085%2Chep-ph%2F0605028%2Chep-ph%2F0605132%2Chep-ph%2F0605192%2Chep-ph%2F0605128%2Chep-ph%2F0605254%2Chep-ph%2F0605340%2Chep-ph%2F0605271%2Chep-ph%2F0605148%2Chep-ph%2F0605325%2Chep-ph%2F0605333%2Chep-ph%2F0605163%2Chep-ph%2F0605053%2Chep-ph%2F0605155%2Chep-ph%2F0605008%2Chep-ph%2F0605299%2Chep-ph%2F0605323%2Chep-ph%2F0605211%2Chep-ph%2F0605004%2Chep-ph%2F0605002%2Chep-ph%2F0605033%2Chep-ph%2F0605173%2Chep-ph%2F0605270%2Chep-ph%2F0605069%2Chep-ph%2F0605011%2Chep-ph%2F0605326%2Chep-ph%2F0605178%2Chep-ph%2F0605260%2Chep-ph%2F0605180%2Chep-ph%2F0605220%2Chep-ph%2F0605034%2Chep-ph%2F0605130%2Chep-ph%2F0605315%2Chep-ph%2F0605268%2Chep-ph%2F0605216%2Chep-ph%2F0605190%2Chep-ph%2F0605209%2Chep-ph%2F0605309%2Chep-ph%2F0605108%2Chep-ph%2F0605054%2Chep-ph%2F0605310%2Chep-ph%2F0605314%2Chep-ph%2F0605143%2Chep-ph%2F0605282%2Chep-ph%2F0605037%2Chep-ph%2F0605042%2Chep-ph%2F0605182&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Neutrino Future -- Comments Honoring Gustavo Branco"}, "summary": "We briefly report on a study intended to help shape the future of neutrino\nphysics -- an area to which Professor Gustavo Branco has made distinguished\ncontributions.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0605100%2Chep-ph%2F0605063%2Chep-ph%2F0605215%2Chep-ph%2F0605284%2Chep-ph%2F0605232%2Chep-ph%2F0605307%2Chep-ph%2F0605295%2Chep-ph%2F0605102%2Chep-ph%2F0605025%2Chep-ph%2F0605341%2Chep-ph%2F0605296%2Chep-ph%2F0605243%2Chep-ph%2F0605237%2Chep-ph%2F0605269%2Chep-ph%2F0605131%2Chep-ph%2F0605242%2Chep-ph%2F0605153%2Chep-ph%2F0605305%2Chep-ph%2F0605031%2Chep-ph%2F0605089%2Chep-ph%2F0605059%2Chep-ph%2F0605278%2Chep-ph%2F0605250%2Chep-ph%2F0605019%2Chep-ph%2F0605328%2Chep-ph%2F0605234%2Chep-ph%2F0605244%2Chep-ph%2F0605003%2Chep-ph%2F0605200%2Chep-ph%2F0605078%2Chep-ph%2F0605248%2Chep-ph%2F0605228%2Chep-ph%2F0605058%2Chep-ph%2F0605118%2Chep-ph%2F0605035%2Chep-ph%2F0605079%2Chep-ph%2F0605331%2Chep-ph%2F0605303%2Chep-ph%2F0605335%2Chep-ph%2F0605162%2Chep-ph%2F0605301%2Chep-ph%2F0605263%2Chep-ph%2F0605321%2Chep-ph%2F0605311%2Chep-ph%2F0605275%2Chep-ph%2F0605223%2Chep-ph%2F0605257%2Chep-ph%2F0605046%2Chep-ph%2F0605005%2Chep-ph%2F0605166%2Chep-ph%2F0605224%2Chep-ph%2F0605262%2Chep-ph%2F0605253%2Chep-ph%2F0605293%2Chep-ph%2F0605085%2Chep-ph%2F0605028%2Chep-ph%2F0605132%2Chep-ph%2F0605192%2Chep-ph%2F0605128%2Chep-ph%2F0605254%2Chep-ph%2F0605340%2Chep-ph%2F0605271%2Chep-ph%2F0605148%2Chep-ph%2F0605325%2Chep-ph%2F0605333%2Chep-ph%2F0605163%2Chep-ph%2F0605053%2Chep-ph%2F0605155%2Chep-ph%2F0605008%2Chep-ph%2F0605299%2Chep-ph%2F0605323%2Chep-ph%2F0605211%2Chep-ph%2F0605004%2Chep-ph%2F0605002%2Chep-ph%2F0605033%2Chep-ph%2F0605173%2Chep-ph%2F0605270%2Chep-ph%2F0605069%2Chep-ph%2F0605011%2Chep-ph%2F0605326%2Chep-ph%2F0605178%2Chep-ph%2F0605260%2Chep-ph%2F0605180%2Chep-ph%2F0605220%2Chep-ph%2F0605034%2Chep-ph%2F0605130%2Chep-ph%2F0605315%2Chep-ph%2F0605268%2Chep-ph%2F0605216%2Chep-ph%2F0605190%2Chep-ph%2F0605209%2Chep-ph%2F0605309%2Chep-ph%2F0605108%2Chep-ph%2F0605054%2Chep-ph%2F0605310%2Chep-ph%2F0605314%2Chep-ph%2F0605143%2Chep-ph%2F0605282%2Chep-ph%2F0605037%2Chep-ph%2F0605042%2Chep-ph%2F0605182&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We briefly report on a study intended to help shape the future of neutrino\nphysics -- an area to which Professor Gustavo Branco has made distinguished\ncontributions."}, "authors": ["Boris Kayser"], "author_detail": {"name": "Boris Kayser"}, "author": "Boris Kayser", "arxiv_comment": "7 pages. Presented at Symposium in Honor of Gustavo Branco, Lisbon,\n  Portugal, July 2005", "links": [{"href": "http://arxiv.org/abs/hep-ph/0605005v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-ph/0605005v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-ph/0605005v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-ph/0605005v1", "journal_reference": null, "doi": null, "fulltext": "arXiv:hep-ph/0605005v1 1 May 2006\n\nTHE NEUTRINO FUTURE\n- COMMENTS HONORING GUSTAVO BRANCO - ∗\nBoris KAYSER\nFermilab, MS 106, P.O. Box 500, Batavia IL 60510 USA\n\nWe briefly report on a study intended to help shape the future of neutrino physics - an area to which Professor Gustavo Branco has made\ndistinguished contributions.\n\nGustavo Branco's distinguished contributions include leading ones to\nneutrino physics, CP violation, and leptogenesis. To plan the future experimental exploration of some of the physics to which Prof. Branco has\ncontributed, and which is near and dear to his heart, several studies focusing on neutrinos have been carried out. I would like to report on one\nof these, sponsored by four Divisions of the American Physical Society [1].\nThis study's aim was to develop a coherent and effective strategy for the\nU.S. role in a global neutrino program. It was intended that the U.S. role\ncomplement and cooperate with the efforts in Europe and Asia [2].\nWe now have beautiful and compelling evidence that neutrinos have\nnonzero masses. This discovery has raised a number of interesting questions. The APS Multi-Divisional study has grouped these according to\nthree themes. The first theme is -\nNEUTRINOS AND THE NEW PARADIGM\nEven in the unlikely event that the neutrinos do not surprise us any more\nthan they already have, we would like to answer the following questions:\n• What are the masses of the neutrinos? Does the neutrino mass spectrum resemble the spectra of the quarks and the charged leptons, or\nis it an inverted version of those other spectra? How high above the\nzero of mass does the entire spectrum lie?\n∗\n\nTo appear in the Proceedings of \"CP Violation and the Flavor Puzzle\", a Symposium\nheld in Honor of Gustavo Branco in Lisbon, July 19-20, 2005.\n\n(1)\n\n\f2\n\n• What is the pattern of mixing among the different types of neutrinos?\nHow large is θ13 , the small mixing angle on whose size the magnitude\nof CP violation in neutrino oscillation depends? Is the very large\natmospheric mixing angle θ23 maximal (in which case an underlying\nsymmetry may well be involved)?\n• Are neutrinos their own antiparticles? If they are, that would make\nthem different from all the other fermionic constituents of matter.\n• Do neutrinos violate the symmetry CP? In particular, do corresponding neutrino and antineutrino oscillation probabilities differ?\nThe second theme is -\nNEUTRINOS AND THE UNEXPECTED\nThe study of neutrinos has been marked by surprises. The masses of\nthe neutrinos have proved to be very much smaller than those of any other\nknown particles. Two of the neutrino mixing angles have turned out to be\nvery large, while all of the quark mixing angles are small. The low value\nof the solar νe flux arriving at earth, compared to the predicted rate of\nneutrino production by the sun, was a surprise. So was the low value of\nthe νμ /νe ratio in the atmospheric neutrino flux arriving at underground\ndetectors. It would be surprising if further surprises were not in store. The\nopen questions include -\n• Are there \"sterile\" neutrinos - neutrinos that do not participate in\nthe Standard Model weak interactions, or any other known interactions except gravity? Correspondingly, are there more than three\nneutrino mass eigenstates?\n• Do neutrinos have unexpected or exotic properties, such as magnetic\ndipole moments that are many orders of magnitude larger than those\npredicted by the Standard Model and large enough to be observed?\n• What do neutrinos have to tell us about the intriguing proposals for\nnew models of fundamental physics? The See-Saw Mechanism relates\nneutrino masses to physics at the high-mass scale where the weak,\nelectromagnetic, and strong interactions appear to become unified.\nWhat can we learn about Grand Unified Theories by studying the\nneutrinos?\nThe third theme is -\n\n\f3\n\nNEUTRINOS AND THE COSMOS\nNeutrinos and photons are by far the most abundant particles in the\nuniverse. Neutrinos have played an important role in shaping the largescale structure of the universe, and in determining its character. We would\nlike to know -\n• What, precisely, has been the role of neutrinos in shaping the universe?\nWhat can we learn about the absolute scale of neutrino mass from\ncosmological observations?\n• Is CP violation by neutrinos the key to understanding the matter\nantimatter asymmetry of the universe?\n• What can neutrinos, acting as messengers, reveal about the deep\ninterior of the earth and sun, about supernovae, and about ultrahigh-energy astrophysical phenomena whose produced photons cannot\nreach us?\nThe APS study urged that two future experimental programs be given\nhigh priority. To wit:\nWe recommend, as a high priority, that a phased program of (increasingly) sensitive searches for neutrinoless nuclear double beta decay be initiated as soon as possible.\nNeutrinoless nuclear double beta decay (0νββ decay) is the process in\nwhich one nucleus decays into another plus two electrons, and nothing else.\nObservation of this process at any level would establish that -\n• The lepton number L that distinguishes between leptons and antileptons is not conserved.\n• Neutrinos are Majorana particles. That is, each neutrino of definite\nmass is its own antiparticle.\n• Nature (although not the Standard Model) contains Majorana neutrino masses.\n• The origin of neutrino mass involves physics different from that which\ngives masses to the charged leptons, quarks, nucleons, humans, the\nearth, and galaxies.\nThus, observation of 0νββ decay would establish that neutrinos and\ntheir masses are very distinctive indeed. There is interest in several areas of\n\n\f4\n\nthe world in searching for this decay. It is hoped that U.S. scientists, some\nof whom have very high relevant expertise, can make a major contribution\nto the global effort.\nWe recommend, as a high priority, a comprehensive U.S. program to\ncomplete our understanding of neutrino mixing, to determine the character of the neutrino mass spectrum, and to search for CP violation among\nneutrinos.\nThis program should have three components:\nA. An expeditiously-deployed reactor experiment with sensitivity to the\nsmall mixing angle θ13 down to sin2 2θ13 = 0.01.\nB. A timely accelerator experiment with θ13 sensitivity comparable to\nthat of the reactor experiment, and with sensitivity, through matter effects,\nto whether the neutrino mass spectrum is normal (i.e., quark-like) or inverted.\nC. A megawatt-class proton driver and neutrino superbeam with an\nappropriate very large detector capable of observing CP violation.\nCompletion of our understanding of mixing will focus on θ13 , with attention to θ23 as well. Determining the approximate size of θ13 will discriminate between many models [3]. In some models, sin θ13 is naturally of order\n∆m2sol /∆m2atm ∼\n= 1/30, where ∆m2sol and ∆m2atm are the solar and atmospheric squared-mass splittings, respectively. In these models, sin2 2θ13 ∼\n0.004. In other models, sin θ13 is of order (∆m2sol /∆m2atm )1/2 ∼\n= 1/6, so\nthat sin2 2θ13 ∼ 0.1, very close to the present upper bound. Thus, learning whether sin2 2θ13 is larger or smaller than, say, 0.01 will discriminate\nbetween these two classes of models. In addition, if sin2 2θ13 proves to be\nless than 0.01, then we will have learned that a neutrino factory, producing\nneutrinos through the decays of muons in a storage ring, or a beta beam,\nproducing them in the decays of radioactive ions, will be necessary to observe CP violation and to determine whether the neutrino mass spectrum is\nnormal or inverted. But if sin2 2θ13 > (0.01−0.02), then both of these issues\ncan be addressed via conventional, albeit high intensity, neutrino beams.\nAn experiment seeking to learn about θ13 by studying the disappearance\nof some of the νe flux from a reactor has the advantage that this disappearance will not depend on any of the other unknown neutrino properties or\nparameters. Consequently, such an experiment can determine θ13 cleanly. In\ncontrast, experiments with accelerator neutrinos can access all the neutrino\nproperties we wish to study: θ13 and θ23 , the normal or inverted character\nof the mass spectrum, and CP violation. However, in the accelerator experiments, various neutrino parameters are intertwined in the quantities that\n\n\f5\n\none actually measures, so a clean determination of θ13 will be very useful to\nthe overall program.\nThe atmospheric mixing angle θ23 mixes νμ and ντ . If it turns out\nthat θ23 is not maximal (45◦ ), then we will want to know whether it lies\nbelow or above 45◦ . In combination with other information, this will tell\nus whether the heaviest neutrino mass eigenstate is more ντ than νμ , as\nnaively expected, or the other way around.\nTurning to the character of the mass spectrum, we note that, generically,\nGrand Unified Theories (GUTS) favor a normal neutrino mass spectrum -\none resembling the charged-lepton and quark spectra. The reason is simply\nthat in GUTS, the neutrinos, charged leptons and quarks are all related,\nso we expect their spectra to be similar. However, some classes of string\ntheories lead one to anticipate an inverted neutrino mass spectrum. Thus,\nthe actual nature of this spectrum is an interesting question.\nOf course, if, as suggested by the LSND experiment, there are more than\nthree neutrino mass eigenstates, then the neutrino mass spectrum is very\ndifferent from the charged lepton and quark spectra: the neutrino spectrum\nhas more states than its charged lepton and quark counterparts. Such a\nfinding would require careful rethinking of the future neutrino program.\nAssuming that there are just three mass eigenstates, the (mass)2 spectrum consists of a closely-spaced pair of states, ν1 and ν2 , separated from\neach other by the solar (mass)2 splitting, ∆m2sol ∼\n= 8.0 × 10−5 eV2 [4], and\na third state, ν3 , separated from the ν1 − ν2 pair by the thirty-fold larger\natmospheric (mass)2 splitting, ∆m2atm ∼\n= 2.4 × 10−3 eV2 [5] . If ν3 lies above\n2\nthe ν1 − ν2 pair, then the (mass) spectrum is normal, while if it lies below\nthe ν1 − ν2 pair, then the spectrum is inverted. Provided that θ13 is not too\ntiny [6], we can determine whether the spectrum is normal or inverted by\nexploiting the matter effect. This leads to an asymmetry between ∆m2atm driven νμ → νe and νμ → νe oscillations, and the sign of this asymmetry\ndepends on whether the spectrum is normal or inverted. To be sensitive to\nthe ∆m2atm -driven oscillations, an experiment needs to place its far detector near the first maximum of these oscillations. This maximum occurs at\nL/E ∼\n= 500 km/GeV, where L is the baseline of the experiment, and E is the\nneutrino energy. Since the matter effect grows with energy, it is preferable\nto work with higher E, which requires one to have a correspondingly larger\nL. A combination such as E ∼ 2 GeV and L ∼ 800 km, which is possible\nin the U.S., could make a key contribution to the global study of neutrinos\nby enabling us to determine the character - normal or inverted - of the\nspectrum.\nLike the matter effect, CP violation also will lead to an asymmetry\nbetween neutrino and antineutrino oscillations. One will have to disentangle the spectrum-dependent matter effect from genuine CP violation in the\n\n\f6\n\nasymmetry that is actually observed. To this end, the proposed Japanese\nand U.S. accelerator neutrino programs, which will operate at energies differing from each other by a factor of three and consequently will involve\nmatter effects of quite different size, can play strongly complementary roles.\nA megawatt-class proton driver, or equivalent high-intensity neutrino\nsource, and a suitable large detector will be needed if we are to be able to\nestablish the presence of CP violation for any value of sin2 2θ13 above (0.01\n– 0.02).\nThe observation of CP violation in neutrino oscillation would be very\ninteresting not only because it would establish that CP violation is not a\npeculiarity of quarks, but also because of the possible connection to the\nmatter-antimatter asymmetry of the universe. In the See-Saw Mechanism,\nthe most popular explanation of the incredible lightness of neutrinos, the\nlight neutrinos ν are accompanied by very heavy \"see-saw partner\" neutrinos N. These heavy neutrinos are much too heavy to be made in laboratory\nexperiments of today, but would have been made in the hot Big Bang. Subsequently, each of them would have decayed into a final state that includes\nan ordinary lepton or antilepton.\nIf oscillation of today's light neutrinos violates CP, then, quite likely,\nso does the decay of the heavy see-saw partners of these neutrinos. Thus,\nthe decays of these heavy neutrinos in the early universe would have produced a world with unequal numbers of leptons and antileptons. Nonperturbative Standard Model sphaleron processes would then have reprocessed this lepton-antilepton asymmetry into one that involves both baryons\nand leptons, producing the baryonic and leptonic matter-antimatter asymmetry that we see today. This possibility makes it very interesting indeed\nto see whether light neutrino oscillation does indeed violate CP.\nThe production of the matter-antimatter asymmetry through the decays\nof heavy neutrinos is known as leptogenesis [7]. Gustavo Branco and his\ncollaborators have made very important contributions to our understanding\nof this hypothesis. In particular, they have illuminated the connections\nbetween leptogenesis and the quantities that we can study in laboratory\nexperiments of today.\nCongratulations, Gustavo, for all you have done so far, and thank you\nin advance for all you will do in the future!\n\nAcknowledgments\nThe results of the APS Multi-Divisional study grew out of the dedicated\nefforts of many people. It is a pleasure to thank my colleagues in this study\nfor their insights, creativity, wisdom, cooperative spirit, and energy.\n\n\f7\n\nIt is also a pleasure to thank Gustavo Branco, João Silva, and Gui Rebelo\nfor truly exceptional hospitality during a three-week visit to Lisbon.\nREFERENCES\n[1] The Divisions of Nuclear Physics and Particles and Fields, together with the\nDivisions of Astrophysics and Physics of Beams.\n[2] The main report of the APS Multi-Divisional study, The Neutrino Matrix, is\navailable as eprint physics/0411216.\n[3] R. Mohapatra et al., eprint hep-ph/0510213.\n[4] The SNO Collaboration (B. Aharmim et al.), Phys, Rev. C72, 055502 (2005).\n[5] The Super-Kamiokande Collaboration (Y. Ashie et al.), Phys. Rev. Lett. 93,\n101801 (2004).\n[6] A. de Gouvêa, J. Jenkins, and B. Kayser, Phys, Rev. D71, 113009 (2005).\n[7] M. Fukugita and T. Yanagida, Phys. Lett. B174, 45 (1986).\n\n\f"}