{"id": "http://arxiv.org/abs/hep-th/0604161v2", "guidislink": true, "updated": "2006-06-07T07:15:05Z", "updated_parsed": [2006, 6, 7, 7, 15, 5, 2, 158, 0], "published": "2006-04-24T15:16:08Z", "published_parsed": [2006, 4, 24, 15, 16, 8, 0, 114, 0], "title": "A holographic model of deconfinement and chiral symmetry restoration", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-th%2F0604121%2Chep-th%2F0604161%2Chep-th%2F0604002%2Chep-th%2F0604205%2Chep-th%2F0604197%2Chep-th%2F0604125%2Chep-th%2F0604079%2Chep-th%2F0604016%2Chep-th%2F0604166%2Chep-th%2F0604003%2Chep-th%2F0604173%2Chep-th%2F0604111%2Chep-th%2F0604128%2Chep-th%2F0604033%2Chep-th%2F0604134%2Chep-th%2F0604154%2Chep-th%2F0604017%2Chep-th%2F0604007%2Chep-th%2F0604054%2Chep-th%2F0604189%2Chep-th%2F0604008%2Chep-th%2F0604172%2Chep-th%2F0604210%2Chep-th%2F0604078%2Chep-th%2F0604130%2Chep-th%2F0604216%2Chep-th%2F0604086%2Chep-th%2F0604131%2Chep-th%2F0604184%2Chep-th%2F0604204%2Chep-th%2F0604117%2Chep-th%2F0604188%2Chep-th%2F0604136%2Chep-th%2F0604052%2Chep-th%2F0604060%2Chep-th%2F0604059%2Chep-th%2F0604127%2Chep-th%2F0604218%2Chep-th%2F0604050%2Chep-th%2F0604011%2Chep-th%2F0604159%2Chep-th%2F0604013%2Chep-th%2F0604018%2Chep-th%2F0604093%2Chep-th%2F0604069%2Chep-th%2F0604219%2Chep-th%2F0604175%2Chep-th%2F0604168%2Chep-th%2F0604193%2Chep-th%2F0604212%2Chep-th%2F0604171%2Chep-th%2F0604096%2Chep-th%2F0604076%2Chep-th%2F0604208%2Chep-th%2F0604030%2Chep-th%2F0604146%2Chep-th%2F0604114%2Chep-th%2F0604167%2Chep-th%2F0512256%2Chep-th%2F0512317%2Chep-th%2F0512145%2Chep-th%2F0512037%2Chep-th%2F0512186%2Chep-th%2F0512161%2Chep-th%2F0512253%2Chep-th%2F0512094%2Chep-th%2F0512294%2Chep-th%2F0512153%2Chep-th%2F0512178%2Chep-th%2F0512041%2Chep-th%2F0512091%2Chep-th%2F0512105%2Chep-th%2F0512328%2Chep-th%2F0512036%2Chep-th%2F0512323%2Chep-th%2F0512018%2Chep-th%2F0512308%2Chep-th%2F0512081%2Chep-th%2F0512337%2Chep-th%2F0512238%2Chep-th%2F0512131%2Chep-th%2F0512196%2Chep-th%2F0512082%2Chep-th%2F0512061%2Chep-th%2F0512327%2Chep-th%2F0512249%2Chep-th%2F0512246%2Chep-th%2F0512300%2Chep-th%2F0512270%2Chep-th%2F0512255%2Chep-th%2F0512017%2Chep-th%2F0512048%2Chep-th%2F0512333%2Chep-th%2F0512056%2Chep-th%2F0512226%2Chep-th%2F0512272%2Chep-th%2F0512176%2Chep-th%2F0512204%2Chep-th%2F0512021%2Chep-th%2F0512314%2Chep-th%2F0512263&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A holographic model of deconfinement and chiral symmetry restoration"}, "summary": "We analyze the finite temperature behavior of the Sakai-Sugimoto model, which\nis a holographic dual of a theory which spontaneously breaks a U(N_f)_L x\nU(N_f)_R chiral flavor symmetry at zero temperature. The theory involved is a\n4+1 dimensional supersymmetric SU(N_c) gauge theory compactified on a circle of\nradius R with anti-periodic boundary conditions for fermions, coupled to N_f\nleft-handed quarks and N_f right-handed quarks which are localized at different\npoints on the compact circle (separated by a distance L). In the supergravity\nlimit which we analyze (corresponding in particular to the large N_c limit of\nthe gauge theory), the theory undergoes a deconfinement phase transition at a\ntemperature T_d = 1 / 2 \\pi R. For quark separations obeying L > L_c = 0.97 * R\nthe chiral symmetry is restored at this temperature, but for L < L_c = 0.97 * R\nthere is an intermediate phase which is deconfined with broken chiral symmetry,\nand the chiral symmetry is restored at T = 0.154 / L. All of these phase\ntransitions are of first order.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-th%2F0604121%2Chep-th%2F0604161%2Chep-th%2F0604002%2Chep-th%2F0604205%2Chep-th%2F0604197%2Chep-th%2F0604125%2Chep-th%2F0604079%2Chep-th%2F0604016%2Chep-th%2F0604166%2Chep-th%2F0604003%2Chep-th%2F0604173%2Chep-th%2F0604111%2Chep-th%2F0604128%2Chep-th%2F0604033%2Chep-th%2F0604134%2Chep-th%2F0604154%2Chep-th%2F0604017%2Chep-th%2F0604007%2Chep-th%2F0604054%2Chep-th%2F0604189%2Chep-th%2F0604008%2Chep-th%2F0604172%2Chep-th%2F0604210%2Chep-th%2F0604078%2Chep-th%2F0604130%2Chep-th%2F0604216%2Chep-th%2F0604086%2Chep-th%2F0604131%2Chep-th%2F0604184%2Chep-th%2F0604204%2Chep-th%2F0604117%2Chep-th%2F0604188%2Chep-th%2F0604136%2Chep-th%2F0604052%2Chep-th%2F0604060%2Chep-th%2F0604059%2Chep-th%2F0604127%2Chep-th%2F0604218%2Chep-th%2F0604050%2Chep-th%2F0604011%2Chep-th%2F0604159%2Chep-th%2F0604013%2Chep-th%2F0604018%2Chep-th%2F0604093%2Chep-th%2F0604069%2Chep-th%2F0604219%2Chep-th%2F0604175%2Chep-th%2F0604168%2Chep-th%2F0604193%2Chep-th%2F0604212%2Chep-th%2F0604171%2Chep-th%2F0604096%2Chep-th%2F0604076%2Chep-th%2F0604208%2Chep-th%2F0604030%2Chep-th%2F0604146%2Chep-th%2F0604114%2Chep-th%2F0604167%2Chep-th%2F0512256%2Chep-th%2F0512317%2Chep-th%2F0512145%2Chep-th%2F0512037%2Chep-th%2F0512186%2Chep-th%2F0512161%2Chep-th%2F0512253%2Chep-th%2F0512094%2Chep-th%2F0512294%2Chep-th%2F0512153%2Chep-th%2F0512178%2Chep-th%2F0512041%2Chep-th%2F0512091%2Chep-th%2F0512105%2Chep-th%2F0512328%2Chep-th%2F0512036%2Chep-th%2F0512323%2Chep-th%2F0512018%2Chep-th%2F0512308%2Chep-th%2F0512081%2Chep-th%2F0512337%2Chep-th%2F0512238%2Chep-th%2F0512131%2Chep-th%2F0512196%2Chep-th%2F0512082%2Chep-th%2F0512061%2Chep-th%2F0512327%2Chep-th%2F0512249%2Chep-th%2F0512246%2Chep-th%2F0512300%2Chep-th%2F0512270%2Chep-th%2F0512255%2Chep-th%2F0512017%2Chep-th%2F0512048%2Chep-th%2F0512333%2Chep-th%2F0512056%2Chep-th%2F0512226%2Chep-th%2F0512272%2Chep-th%2F0512176%2Chep-th%2F0512204%2Chep-th%2F0512021%2Chep-th%2F0512314%2Chep-th%2F0512263&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We analyze the finite temperature behavior of the Sakai-Sugimoto model, which\nis a holographic dual of a theory which spontaneously breaks a U(N_f)_L x\nU(N_f)_R chiral flavor symmetry at zero temperature. The theory involved is a\n4+1 dimensional supersymmetric SU(N_c) gauge theory compactified on a circle of\nradius R with anti-periodic boundary conditions for fermions, coupled to N_f\nleft-handed quarks and N_f right-handed quarks which are localized at different\npoints on the compact circle (separated by a distance L). In the supergravity\nlimit which we analyze (corresponding in particular to the large N_c limit of\nthe gauge theory), the theory undergoes a deconfinement phase transition at a\ntemperature T_d = 1 / 2 \\pi R. For quark separations obeying L > L_c = 0.97 * R\nthe chiral symmetry is restored at this temperature, but for L < L_c = 0.97 * R\nthere is an intermediate phase which is deconfined with broken chiral symmetry,\nand the chiral symmetry is restored at T = 0.154 / L. All of these phase\ntransitions are of first order."}, "authors": ["Ofer Aharony", "Jacob Sonnenschein", "Shimon Yankielowicz"], "author_detail": {"name": "Shimon Yankielowicz"}, "author": "Shimon Yankielowicz", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/j.aop.2006.11.002", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/hep-th/0604161v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-th/0604161v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "30 pages, 7 figures, latex. v2: minor corrections and added reference\n  to parallel work", "arxiv_primary_category": {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-th/0604161v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-th/0604161v2", "journal_reference": "Annals Phys.322:1420-1443,2007", "doi": "10.1016/j.aop.2006.11.002", "fulltext": "arXiv:hep-th/0604161v2 7 Jun 2006\n\nWIS/05/06-APR-DPP\nTAUP-2824/06\nhep-th/0604161\n\nA Holographic Model of Deconfinement and\nChiral Symmetry Restoration\n\nOfer Aharony a , Jacob Sonnenschein b,c , and Shimon Yankielowicz b,c\na\n\nDepartment of Particle Physics\nThe Weizmann Institute of Science, Rehovot 76100, Israel\nb\n\nSchool of Physics and Astronomy\nThe Raymond and Beverly Sackler Faculty of Exact Sciences\nTel Aviv University, Ramat Aviv 69978, Israel\nc\n\nAlbert Einstein Minerva Center\nThe Weizmann Institute of Science, Rehovot 76100, Israel\nAbstract\nWe analyze the finite temperature behavior of the Sakai-Sugimoto model, which is a\nholographic dual of a theory which spontaneously breaks a U(Nf )L ×U(Nf )R chiral flavor\nsymmetry at zero temperature. The theory involved is a 4+1 dimensional supersymmetric\nSU(Nc ) gauge theory compactified on a circle of radius R with anti-periodic boundary\nconditions for fermions, coupled to Nf left-handed quarks and Nf right-handed quarks\nwhich are localized at different points on the compact circle (separated by a distance\nL). In the supergravity limit which we analyze (corresponding in particular to the large\nNc limit of the gauge theory), the theory undergoes a deconfinement phase transition\nat a temperature Td = 1/2πR. For quark separations obeying L > Lc ≃ 0.97 ∗ R the\nchiral symmetry is restored at this temperature, but for L < Lc ≃ 0.97 ∗ R there is\nan intermediate phase which is deconfined with broken chiral symmetry, and the chiral\nsymmetry is restored at TχSB ≃ 0.154/L. All of these phase transitions are of first order.\nE-mails : Ofer.Aharony@weizmann.ac.il, cobi@post.tau.ac.il, shimonya@post.tau.ac.il.\n\n\f1\n\nIntroduction\n\nQCD, the theory of the strong nuclear interactions, exhibits two interesting phenomena\nat low energies – confinement and (approximate) spontaneous chiral symmetry breaking.\nBoth of these phenomena are strong coupling effects which are not visible in perturbation\ntheory, and there are no known quantitative methods to study them (except by lattice\nsimulations). Apriori there is no relation between these two phenomena, and there are\nknown examples of chiral symmetry breaking in non-confining theories and of confinement\nwithout chiral symmetry breaking. However, in QCD both phenomena occur together.\nNew methods for studying strongly coupled gauge theories have been developed in the\nlast decade, following the AdS/CFT correspondence [1]. These methods are particularly\npowerful in large Nc gauge theories which are dual to weakly coupled string theories in\nweakly curved spaces, since then many computations can be explicitly performed. This\nclass of theories does not include (large Nc ) QCD, but there are several known cases of\ntheories which are labeled by a dimensionless parameter, such that in one limit of the\nparameter the string background is weakly curved, while the other limit gives (large Nc )\nQCD [2, 3, 4, 5]. It is believed that these theories are (for any value of the dimensionless\nparameter) in the same universality class as QCD, so it is interesting to try to use\nthese theories to understand better the phenomena of confinement and chiral symmetry\nbreaking.\nUnderstanding confinement in the weakly curved limit is amazingly easy; the confining\nstrings are explicitly seen as strings in the weakly curved background (either fundamental\nstrings or strings arising from D-branes), and their tensions are easily computable. It\nwould be nice to be able to similarly study the phenomenon of chiral symmetry breaking (χSB), and to see if (in the weakly curved limit) there is any link between χSB\nand confinement. Unfortunately, it seems much more difficult to find dual models for\ntheories with non-Abelian U(Nf )L × U(Nf )R chiral symmetry than to find dual models\nfor confining theories. In the context of holographic dual models, quarks in the fundamental representation of SU(Nc ) were first incorporated in terms of probe D branes\nin [6]1 . Since then several holographic models dual to theories with quarks have been\nconstructed and investigated, with the quarks coming from additional \"flavor D-branes\",\nin both conformal and confining gauge theories [8, 9, 10, 11, 12, 13, 14, 15]. However,\nthere are relatively few brane constructions with non-Abelian chiral symmetry (see, e.g.,\n[16]), and it has proven difficult to use these brane constructions to construct (by taking\na near-horizon limit) string theory duals of theories with non-Abelian chiral symmetry\n(with or without χSB)2 .\n1\n2\n\nThe first appearance of quarks in the fundamental representation of Sp(Nc ) was in [7].\nOn the other hand, there are several models realizing a U (1) axial flavor symmetry, such as [9, 10].\n\n1\n\n\fThis situation was recently changed by the work of Sakai and Sugimoto [17, 18], who\nfound a simple brane construction realizing chiral symmetry, and took its near-horizon\nlimit to find a string theory dual to a field theory with chiral symmetry breaking. The\nbrane construction is in type IIA string theory compactified on a circle of radius R\nin the x4 direction, and involves Nc D4-branes wrapped on the circle (filling the 01234\ndirections), Nf D8-branes sitting at the point x4 = 0 and Nf anti-D8-branes sitting at the\npoint x4 = L 3 . The circle could have either periodic or anti-periodic boundary conditions\nfor the fermions; the more interesting case for relating to QCD is the case in which all\nfermions have anti-periodic boundary conditions around the circle. The gauge theory on\nthe D4-branes at low energies is a U(Nc ) 4 + 1 dimensional maximally supersymmetric\nYang-Mills theory, which is coupled to Nf left-handed 3 + 1-dimensional chiral fermions\n(in the fundamental representation of U(Nc )) at the intersection with the D8-branes and\nto Nf right-handed chiral fermions at the intersection with the anti-D8-branes. With\nanti-periodic boundary conditions, the fermions in the 4 + 1 dimensional gauge multiplet\nobtain a mass of order 1/R, and the scalars obtain masses from quantum corrections,\nso the (classical) massless spectrum is that of a 3 + 1 dimensional U(Nc ) gauge theory\ncoupled to Nf massless Dirac fermions. The U(Nf )L × U(Nf )R global chiral symmetry\nof this theory4 is explicitly visible as the gauge symmetry on the D8 and anti-D8-branes.\nThe string theory described above is non-supersymmetric and unstable, but this instability does not affect the low-energy behavior, and disappears when we take a decoupling\nlimit for the theory on the D4-branes; the unstable modes, which are the scalar fields corresponding to the radius of the circle and to the asymptotic brane-anti-brane separation,\nbecome non-normalizable in this near-horizon limit so we do not need to worry about\nthem. This decoupling limit, before the compactification on a circle, was described in\n[19], and it involves taking the string scale α′ to zero and the asymptotic string coupling\n√\ngs to infinity while keeping fixed the 4 + 1 dimensional gauge coupling g52 ∼ gs α′ . The\nfact that the (asymptotic) string coupling goes to infinity in this limit is related to the\nfact that the 4 + 1 dimensional gauge theory is not well-defined at high energies, and\nshould be defined with some UV completion; in type IIA string theory the completion\ndefines this theory as the 5 + 1-dimensional N = (2, 0) superconformal theory of M5branes compactified on a circle, but this will not be relevant for our purposes (since we\nwill always be interested in energy scales well below 1/g52). The near-horizon limit of\nthe D4-branes, which is dual to their (UV-completed) 4 + 1-dimensional supersymmetric gauge theory, was described in [19]. It is highly curved at small radial coordinates\n(corresponding to the fact that the gauge theory is IR-free), and at very large radial\n3\n\nIn [17] the specific choice L = πR was made, for which the D8's and anti-D8's are antipodal on the\ncircle, but this is not really necessary.\n4\nThe axial U (1) is anomalous, but this is a subleading effect in the large Nc limit which will not be\nrelevant for our leading order computations.\n\n2\n\n\fcoordinates the string coupling becomes large and the background needs to be lifted to\nM theory, but for large Nc there is a large range of values of the radial coordinate for\nwhich type IIA string theory gives a good description.\nThe near-horizon limit of D4-branes compactified on a circle with anti-periodic boundary conditions was first discussed in [2], where it was noted that it was the same as the\n(Wick rotation of the) near-horizon limit of near-extremal D4-branes, and that when the\nradius of the circle is small compared to the scale of the 't Hooft coupling of the YangMills theory, the background becomes weakly curved everywhere. This was, in fact, the\nfirst model of a confining theory constructed following the AdS/CFT correspondence.\nIn the limit of large Nc with fixed Nf , the back-reaction of the D8-branes is small, and\nthey can be treated as probes in this background. Sakai and Sugimoto noted that in this\nsetup there is a very nice interpretation of chiral symmetry breaking5 . At large radial\npositions (corresponding to the high-energy limit of the field theory) the D8-branes and\nanti-D8-branes are separated and one sees the full U(Nf )L × U(Nf )R chiral symmetry.\nApriori, as we go into the interior of space, the D8-branes and the anti-D8-branes could\nremain separated, or they could join together into Nf continuous 8-branes, so that only\na single (diagonal) U(Nf ) symmetry is visible, corresponding to spontaneous chiral symmetry breaking. In the background of [2], the radial position has a minimal value (where\nthe x4 -circle shrinks to zero size) and the 8-branes have nowhere to end, and therefore the\nD8-branes have to smoothly join the anti-D8-branes and exhibit χSB. In [17] an explicit\nsolution for the position of the 8-branes was constructed (in the probe approximation)\nwhich realizes this.\nRecently, it was realized in [20] that the scale of chiral symmetry breaking in this\nmodel is actually independent of the scale of confinement (the first depends mostly on\nL while the second depends mostly on R), and that chiral symmetry breaking persists\neven in the R → ∞ limit in which confinement disappears6 . We will see this separation\nof scales also in our finite temperature analysis.\nIn this paper we will study the model of Sakai and Sugimoto at finite temperature. In\nasymptotically free gauge theories with confinement and chiral symmetry breaking, both\nof these properties disappear at high temperatures as the effective coupling becomes\nsmall. In QCD there is no sharp phase transition distinguishing the low-temperature\nand high-temperature phases, since there are no sharp order parameters for confinement\n(due to the presence of dynamical quarks) and for the (approximate) chiral symmetry\nbreaking. However, in a theory with exactly massless quarks one expects to have a sharp\nphase transition associated with the chiral symmetry restoration (characterized by the\n5\n\nA similar structure of probe branes in a confining background was previously introduced in [8] in\nthe context of the model of [4].\n6\nThe independence of the two phenomena in the gravity approximation was first noted for an Abelian\nchiral symmetry in [13].\n\n3\n\n\fchiral condensate as an order parameter), and in the large Nc limit the deconfinement\ntransition also becomes a sharp phase transition (since the quarks can be ignored in\nthis limit, and the pure gauge theory at finite temperature has a ZNc global symmetry\nwhich is unbroken in the confined phase and broken in the deconfined phase). It is\ninteresting to ask whether these two phase transitions occur at the same temperature\nor not. In the large Nc limit of QCD this is a difficult question to answer analytically.\nHowever, in the Sakai-Sugimoto model (which is continuously related to large Nc QCD\nby varying parameters) we will see that the question is easy to answer7 . We will find that\nsimple geometrical arguments imply that chiral symmetry is always broken in the confined\nphase, so that chiral symmetry restoration can happen either at the same temperature as\ndeconfinement or above it. A more detailed analysis will be necessary to decide between\nthese two possibilities, and we will find that in the weakly-curved limit the answer to this\nquestion depends on the ratio L/R (which can go between zero and π; in the limit of small\nL/R this ratio is inversely related to the ratio between the low-spin meson masses and the\nlow-spin glueball masses). We will show that for L/R > 0.97 the two phase transitions\noccur together, while for L/R < 0.97 the chiral symmetry restoration transition happens\nat a higher temperature than the deconfinement transition. In the supergravity limit all\nof these phase transitions are of first order.\nWe begin in section 2 with a description of the system at zero temperature. In particular we present a short review of the Sakai-Sugimoto model and its meson spectrum,\ngeneralizing the construction of [17] to arbitrary values of L/R. In section 3 we discuss\nthe finite temperature behavior of this theory. We start by discussing the deconfinement transition, which is associated with the bulk physics, and its implications on chiral\nsymmetry breaking. We continue by studying the realization of chiral symmetry in the\ndeconfined phase and computing the chiral symmetry restoration temperature. We also\ndiscuss the spectrum of quark-anti-quark excitations of the theory at finite temperature.\nWe end in section 4 with our conclusions. An appendix contains the computation of the\ndifference of free energies which is relevant for the deconfinement transition.\n\n2\n\nThe zero temperature string theory model\n\nThe string theory dual of the gauge theory we described above at zero temperature is\nthe Sakai-Sugimoto model [17]. We start by reviewing the basic structure of this model.\nWe then describe the spectrum of mesons of low and high spins.\n7\n\nNote that this theory is not asymptotically free, so apriori it is not clear whether at high temperatures\nit should deconfine and restore chiral symmetry or not.\n\n4\n\n\f2.1\n\nReview of the Sakai-Sugimoto model\n\nThe model of Sakai and Sugimoto [17] describes the near-horizon limit of a configuration of Nc D4-branes, wrapping a circle in the x4 direction with anti-periodic boundary\nconditions for the fermions, and intersected by Nf D8-branes (located at x4 = 0) and\nNf anti-D8-branes (located at x4 = L). This is dual to a 4 + 1 dimensional maximally\nsupersymmetric SU(Nc ) Yang-Mills theory (with coupling constant g5 and with a specific\nUV completion that will not be important for us), compactified on a circle of radius R\nwith anti-periodic boundary conditions for the fermions, with Nf left-handed quarks located at x4 = 0 and Nf right-handed quarks located at x4 = L (obviously we can assume\nL ≤ πR).\nIn the limit Nf ≪ Nc , this background can be described by Nf probe D8-branes\ninserted into the near-horizon limit of a set of Nc D4-branes compactified on a circle with\nanti-periodic boundary conditions for the fermions [2]. This background is simply related\nto the (near-horizon limit of the) background of near-extremal D4-branes by exchanging\nthe roles (and signatures) of the time direction and of one of the spatial directions. Let us\nnow briefly review this model, emphasizing the manifestations of confinement and chiral\nsymmetry breaking. The background of type IIA string theory is characterized by the\nmetric, the RR four-form and a dilaton given by\nds\n\n2\n\nF(4)\n\n=\n\n\u0012\n\nu\nRD4\n\n\u00133/2 h\n\n2πNc\nǫ4 ,\n=\nV4\n\n2\n\ni\n\nj\n\n−dt + δij dx dx +\n\neφ = gs\n\n\u0012\n\nu\nRD4\n\n\u00133/4\n\nf (u)dx24\n\ni\n\nRD4\n+\nu\n\u0012\n\n3\nRD4\n≡ πgs Nc ls3 ,\n\n,\n\n\u00133/2 \"\n\ndu2\n+ u2 dΩ24 ,\nf (u)\n\nf (u) ≡ 1 −\n\n#\n\n\u0012\n\nuΛ\nu\n\n\u00133\n\n, (1)\n\nwhere t is the time direction and xi (i = 1, 2, 3) are the uncompactified world-volume\ncoordinates of the D4 branes, x4 is a compactified direction of the D4-brane worldvolume which is transverse to the probe D8 branes, the volume of the unit four-sphere\nΩ4 is denoted by V4 and the corresponding volume form by ǫ4 , ls is the string length\nand finally gs is a parameter related to the string coupling. The submanifold of the\nbackground spanned by x4 and u has the topology of a cigar (as on the left-hand side of\nfigure 3 below) where the minimum value of u at the tip of the cigar is uΛ . The tip of\nthe cigar is non-singular if and only if the periodicity of x4 is\n4π\nδx4 =\n3\n\n3\nRD4\nuΛ\n\n!1/2\n\n= 2πR\n\n(2)\n\nand we identify this with the periodicity of the circle that the 4 + 1-dimensional gauge\ntheory lives on.\nThe parameters of this gauge theory, the five-dimensional gauge coupling g5 , the lowenergy four-dimensional gauge coupling g4 , the glueball mass scale Mgb , and the string\n5\n\n\ftension Tst are determined from the background (1) in the following form [10] :\ng52\nTst\n\n2\n\n= (2π) gs ls ,\n\ng42\n\n√ gs u Λ\ng2\n= 5 =3 π\n2πR\nNc ls\n\n1\n1 √\ngtt gxx |u=uΛ =\n=\n2\n2πls\n2πls2\n\n\u0012\n\n\u0012\n\nuΛ\nRD4\n\n\u00133/2\n\n\u00131/2\n\n,\n\nMgb =\n\n1\n,\nR\n\nλ5\n2 g42Nc\n=\n,\n=\n2\n27π R\n27π 2 R3\n\n(3)\n\nwhere λ5 ≡ g52 Nc , Mgb is the typical scale of the glueball masses computed from the\nspectrum of excitations around (1), and Tst is the confining string tension in this model\n(given by the tension of a fundamental string stretched at u = uΛ where its energy\nis minimized). The gravity approximation is valid whenever λ5 ≫ R, otherwise the\ncurvature at u ∼ uΛ becomes large. Note that as usual in gravity approximations of\nconfining gauge theories, the string tension is much larger than the glueball mass scale in\nthis limit. At very large values of u the dilaton becomes large, but this happens at values\nwhich are of order Nc4/3 (in the large Nc limit with fixed λ5 ), so this will play no role\nin the large Nc limit that we will be interested in. The Wilson line of this gauge theory\n(before putting in the D8-branes) admits an area law behavior [21], as can be easily seen\nusing the conditions for confinement of [22].\nNaively, at energies lower than the Kaluza-Klein scale 1/R the dual gauge theory is\neffectively four dimensional; however, it turns out that the theory confines and develops\na mass gap of order Mgb = 1/R, so (in the regime where the gravity approximation is\nvalid) there is no real separation between the confined four-dimensional fields and the\nhigher Kaluza-Klein modes on the circle. As discussed in [2], in the opposite limit of\nλ5 ≪ R, the theory approaches the 3 + 1 dimensional pure Yang-Mills theory at energies\nsmall compared to 1/R, since in this limit the scale of the mass gap is exponentially small\ncompared to 1/R. It is believed that there is no phase transition when varying λ5 /R\nbetween the gravity regime and the pure Yang-Mills regime, but it is not clear how to\ncheck this.\nNext, we introduce the probe 8-branes which span the coordinates t, xi , Ω4 , and follow\nsome curve u(x4 ) in the (x4 , u)-plane. Near the boundary at u → ∞ we want to have\nNf D8-branes localized at x4 = 0 and Nf anti-D8-branes (or D8-branes with an opposite\norientation) localized at x4 = L. Naively one might think that the D8-branes and antiD8-branes would go into the interior of the space and stay disconnected; however, these\n8-branes do not have anywhere to end in the background (1), so the form of u(x4 ) must\nbe such that the D8-branes smoothly connect to the anti-D8-branes (namely, u must\ngo to infinity at x4 = 0 and at x4 = L, and du/dx4 must vanish at some minimal u\ncoordinate u = u0). Such a configuration spontaneously breaks the chiral symmetry\nfrom the symmetry group which is visible at large u, U(Nf )L × U(Nf )R , to the diagonal\nU(Nf ) symmetry. Thus, in this configuration the topology forces a breaking of the chiral\n6\n\n\fsymmetry; this is not too surprising since chiral symmetry breaking at large Nc follows\nfrom rather simple considerations [23].\nIn order to find the 8-brane configuration, we need the induced metric on the D8branes, which is\nds2D8 =\n\n\u0012\n\nu\nRD4\n\n\u00133/2 h\n\nu\n−dt + δij dx dx +\nRD4\n2\n\ni\n\nj\n\n\u0012\n\ni\n\n\u00133/2 \"\n\nRD4\nf (u) +\nu\n\u0012\n\n\u00133\n\nu′ 2\ndx24\nf (u)\n#\n\nRD4 3/2 2 2\nu dΩ4\n(4)\nu\nwhere u′ = du/dx4. It is easy to check that the CS term in the D8-brane action does not\naffect the solution of the equations of motion. More precisely, the equation of motion\nof the gauge field has a classical solution of a vanishing gauge field, since the CS term\nincludes terms of the form C5 ∧ F ∧ F and C3 ∧ F ∧ F ∧ F . So, we are left only with\nthe DBI action. Substituting the determinant of the induced metric and the dilaton into\nthe DBI action, we obtain (ignoring the factor of Nf which multiplies all the D8-brane\nactions that we will write) :\n+\n\nSDBI = T8\n\n\u0012\n\nZ\n\n\u0013\n\nq\n\ndtd3 xdx4 d4 Ωe−φ − det(ĝ) =\n\nT̂8\ngs\n\nZ\n\ndx4\n\nv\nu\n\u0012\n\u0013\nu\nRD4 3\n4t\nu f (u) +\n\nu\n\nu′ 2\n,\nf (u)\n\n(5)\n\nwhere ĝ is the induced metric (4) and T̂8 includes the outcome of the integration over all\nthe coordinates apart from dx4 .\nThe simplest way to solve the equation of motion is by using the Hamiltonian of the\naction (5), which is conserved (independent of x4 ) :\nu4 f (u)\nr\n\nf (u) +\n\n\u0010\n\n\u0011\nRD4 3 u′ 2\nu\nf (u)\n\nq\n\n= constant = u40 f (u0 ),\n\n(6)\n\nwhere on the right-hand side of the equation we assumed that there is a point u0 where\nthe profile u(x4 ) of the brane has a minimum, u′(u = u0 ) = 08 . We need to find the\nsolution in which as u goes to infinity, x4 goes to the values x4 = 0, L; this implies\nZ\nZ\ndu\ndx4 = 2\n=L\n(7)\nu′\nwith u′ given (as a function of u) by (6) (note that u is a double-valued function of x4 in\nthese configurations, leading to the factor of two in (7)). The form of this profile of the\nD8 brane is drawn in figure 1(a). Plugging in the value of u′ from (6) we find\nL =\n\n8\n\nZ\n\ndx4 = 2\n\nZ\n\n∞\n\nu0\n\ndu\n3/2\n= 2RD4\n′\nu\n\nZ\n\n∞\n\nu0\n\n1\n\ndu\nf (u)u3/2\n\nr\n\nf (u)u8\nf (u0 )u80\n\n−1\n\nThis type of analysis was done previously for Wilson line configurations. See, for instance, [21].\n\n7\n\n\fFigure 1: The dominant configurations of the D8 and anti-D8 probe branes in the SakaiSugimoto model at zero temperature, which break the chiral symmetry. The same configurations will turn out to be relevant also at low temperatures. On the left a generic\nconfiguration with an asymptotic separation of L, that stretches down to a minimum at\nu = u0 , is drawn. The figure on the right describes the limiting antipodal case L = πR,\nwhere the branes connect at u0 = uΛ .\n2\n=\n3\n\n3\nRD4\nu0\n\n!1/2 q\n\n1 − yΛ3\n\nZ\n\n0\n\n1\n\ndz\n\nz 1/2\nq\n\n(1 − yΛ3 z) 1 − yΛ3 z − (1 − yΛ3 )z 8/3\n\n,\n\n(8)\n\nwhere yΛ ≡ uΛ /u0 . Small values\nq of L correspond to large values of u0 . In this limit we\n3\nhave yΛ ≪ 1 leading to L ∝ RD4\n/u0 . For general values of L the dependence of u0 on\nL is more complicated.\nThere is a simple special case of the above solutions, which occurs when L = πR,\nnamely the D8-branes and anti-D8-branes lie at antipodal points of the circle. In this\ncase the solution for the branes is simply x4 (u) = 0 and x4 (u) = L = πR, with the two\nbranches meeting smoothly at the minimal value u = u0 = uΛ to join the D8-branes\nand the anti-D8-branes together. This type of antipodal solution is drawn in figure\n1(b). It was shown in [17] that this classical configuration is stable, by analyzing small\nfluctuations around this configuration and checking that the energy density associated\nwith them is non-negative.\nFor general L, one might apriori think that there could be two ways for the D8branes to connect to the anti-D8-branes – one in which they connect by curving towards\n8\n\n\fpositive x4 (in the direction where the D8-anti-D8 distance is L) and the other by curving\ntowards negative x4 (in the direction where the distance is 2πR − L). However, smooth\nconfigurations only occur when the integral (7) is less than or equal to πR, so there is\nonly one smooth configuration for every value of L.\nNote that the Sakai-Sugimoto model has 3 dimensionful parameters : λ5 , L and R,\nand gravity is reliable whenever λ5 ≫ R. The physics depends on the two dimensionless\nratios of these two parameters; we will see that in the gravity limit the mass of the (lowspin) mesons is related to 1/L while the mass of the (low-spin) glueballs is related to\n1/R. As discussed above, in the limit λ5 ≪ R this theory approaches (large Nc ) QCD at\nlow energies. This remains true also after adding the flavors, at least when L is of order\nR (note that the parameter L is not visible in the four-dimensional low-energy effective\naction). However, this QCD limit is opposite from the supergravity limit, and there are\nno known reliable methods to analyze it.\n\n2.2\n\nThe spectrum of mesons\n\nThe mesons of the Sakai-Sugimoto model are described by strings ending on the D8branes. It is convenient to separate the discussion to low-spin mesons and high-spin\nmesons. The former are described via modes of the massless fields living on the D8branes, whereas the latter are associated with string configurations that \"fall\" from the\nD8-branes down to the wall at u = uΛ , stretch along the wall and then go back up again\n[12].\nLet us start with the low-spin mesons. These mesons correspond on the string theory\nside to the fluctuations of the massless fields on the probe branes. The fluctuations of\nthe gauge fields on the branes give pseudo-vector and scalar mesons as well as massless\n\"pions\", and the fluctuations of the scalar field describing the embedding of the branes\ngive massive scalar mesons. In [17] these two sectors of the mesonic spectrum were\ncomputed for the special case of u0 = uΛ , namely L = πR. It is not difficult to generalize\nthis analysis to general values of L which we are interested in here, using the analysis of\nthe fluctuations performed in [14] which we summarize below (the discussion in [14] is\nfor a non-critical AdS6 model, but one can easily apply the same analysis for our model).\nAs an example we describe in detail the modes coming from the components of the\ngauge field living on the D8-branes which are not in the S 4 directions. If we write the\naction using the coordinate u (instead of using x4 as in (5)), the equations of motion for\n\n9\n\n\fthese fields that follow from the DBI action are given by9\nu5/2 γ(u)1/2 ∂μ F μν − ∂u (u5/2 γ(u)1/2 F νu ) = 0,\n∂μ F\n\nμu\n\n(9)\n\n= 0,\n\n(10)\n\nwhere μ, ν = 0, 1, 2, 3 and where we have defined\nγ(u) ≡\n\nu8\n.\nf (u)u8 − f (u0)u80\n\n(11)\n\nWe now separate variables and expand the five dimensional gauge fields in modes in the\nradial direction as follows :\nAμ (xν , u) =\n\nX\nn\n\nBμ(n) (xν )ψn (u),\n\nAu (xν , u) =\n\nX\n\nπ (n) (xν )φn (u).\n\n(12)\n\nn\n\nUsing this decomposition, equation (10) reads:\nX\u0010\nn\n\n\u0011\n\nμ\nm̃2n π (n) (xν )φn (u) − (∂μ B(n)\n(xν ))∂u ψn (u) = 0,\n\n(13)\n\nwhere m̃n is the four-dimensional mass of the field π (n) , namely η μν ∂μ ∂ν π (n) = m̃2n π (n) .\nμ\n= 0, and in this gauge it is easy\nWe can now choose a Lorentz gauge ∂μ Aμ = 0 → ∂μ B(n)\n(n)\nto see that all the π fields are set to zero by (13) except for the Goldstone bosons π (0)\nwith m̃0 = 0, which survive as a massless field for any value of u0 . The other equation\nof motion (9) fixes the form of φ0 to be\nφ0 ∝\n\nγ 1/2\n.\nu5/2\n\n(14)\n\nFinally, the eigenvalue equation for the modes ψn (u) reads\n3\n− u1/2 γ −1/2 ∂u (u5/2 γ −1/2 ∂u ψn ) = RD4\nm2n ψn ,\n\n(15)\n\nwhere mn are the masses of the four-dimensional vector fields Bμ(n) , such that their equation of motion is η νρ ∂ν ∂ρ Bμ(n) = m2n Bμ(n) . Imposing appropriate orthonormality conditions\n[14], one finds that the effective four-dimensional action for these fluctuations of the gauge\nfield living on the probe D8-branes can be written as:\nS=−\n9\n\nZ\n\n\n\n\n\u0013\n\nX 1\n1\n1\n(n) μν (n)\nd4 xtr  ∂μ π (0) ∂ μ π (0) +\nFμν\nF\n+ m2n Bμ(n) B μ (n)  .\n2\n2\nn≥1 4\n\u0012\n\n(16)\n\nWe perform the analysis for a single D8-brane, but the generalization to Nf D8-branes is simply\nperformed by turning all the fields into Nf × Nf matrices, turning the derivatives into U (Nf )-covariant\nderivatives, and taking a trace in the action.\n\n10\n\n\fThe fields π (0) are the Goldstone bosons associated with the spontaneous breaking of the\nU(Nf )L ×U(Nf )R global symmetry to the diagonal U(Nf ) (which is the global symmetry\nof the remaining action (16)). As in [17], one can also go to the Au = 0 gauge, where\nthere are no π (n) fields and the Goldstone bosons are encoded in the boundary value (as\nu → ∞) of Aμ . Note that the pions (the π (0) fields) are massless for any value of u0 (or\nfor any value of L), as expected since the quarks are massless (in the sense of having a\nvanishing current algebra mass) for any value of L.\nThe explicit mass spectrum of the vector mesons is found by looking for normalizable\neigenfunctions of (15). In the special case of u0 = uΛ this spectrum was derived in [17].\nFor generic probe profiles, for which u0 6= uΛ , the spectrum was computed in [14] for a\nsimilar non-critical string model. In general this spectrum is quite complicated. In the\nlimit of u0 ≫ uΛ or L ≪ R the spectrum simplifies. In this limit we can approximate\nf (u) ≃ 1, and there is a scaling symmetry of (15) which implies that all m2n are pro3\nportional to u0 /RD4\n. Equation (8) then implies that this is proportional to 1/L2 , so in\nthis limit all the low-spin meson masses are simply proportional to 1/L. This illustrates\nthe separation of scales between the low-spin mesons and the low-spin glueballs (whose\nmasses are proportional to 1/R in the supergravity approximation) in the Sakai-Sugimoto\nmodel (as emphasized in [20]).\nThe DBI action of the D8-branes only includes mesons of spin one or less. To describe\nhigher-spin mesons we need to look at more general string configurations that start and\nend on the probe branes. For large spin these strings are long and can be described semiclassically. The relevant string configurations can be schematically decomposed into three\nparts : a segment from the probe brane (at u = u0 ) to the wall (u = uΛ ), then a segment\nthat stretches along the wall in the spatial directions, and then another \"vertical\" part\nstretching from the wall back to the probe brane, as depicted in figure 2.\nBy computing the energy of the string it was shown in [12] that this string is equivalent\nto a string in flat space-time with two massive endpoints. The mass of the end-points,\nwhich can be identified with the constituent quark mass mC\nq , is given by [14]\nmC\nq\n\n1 Z u0 √\n1 Z u0 − 1\n−gtt guu du =\n=\nf 2 (u)du,\n2πα′ uΛ\n2πα′ uΛ\n\n(17)\n\nwhich is simply the mass of a string stretched from the D8-branes to the minimal value of\nu. Note that for small L this constituent mass scales as u0 /α′ ∝ λ5 /L2 . Let us emphasize\nagain that the bare mass and current algebra masses are always zero in our configurations,\nand there is no simple description of the deformation associated with turning on a bare\nmass for the quarks (which corresponds to turning on a non-normalizable mode of the\nstring connecting the D8-branes to the anti-D8-branes). Using the map to the string\nwith massive endpoints it is straightforward to calculate the classical mass and angular\nmomentum of these stringy mesons [12, 24]. Somewhat surprisingly, it was found in [14]\n11\n\n\fFigure 2: The high-spin \"stringy\" meson is a string starting at the lowest point of the\nprobe branes u = u0 , going down to the wall, stretching horizontally in space along the\nwall, and then going back up vertically to the probe branes at u = u0 .\n(in a similar model to the one we describe) that for u0 of order uΛ there is a range of\nvalues of u0 /uΛ for which the masses of the light vector and pseudo scalar mesons scale\nroughly linearly with mC\nq , reinforcing its identification as a constituent quark mass. The\ndecay processes of the stringy mesons were discussed in [15].\n\n3\n3.1\n\nThermodynamics of the Sakai-Sugimoto model\nReview of the bulk thermodynamics\n\nIn the large Nc limit (with finite Nf ), the effect of the D8-branes on the background is\nsubleading; the difference in free energies between different bulk backgrounds is of order\nNc2 , while the contribution of the D8-branes is of order Nc ∗ Nf . Thus, we can analyze\nthe bulk thermodynamics independently of the presence of the D8-branes, and then add\nthem in as probes to the dominant bulk background at each temperature.\nThe thermodynamical behavior of the bulk is analogous to the thermodynamical be12\n\n\fFigure 3: The topology of the solutions which dominate in the low temperature (confined)\nand high temperature (deconfined) phases of the Sakai-Sugimoto model, as reflected in\nthe (t, u) and (x4 , u) submanifolds.\nhavior of other theories compactified on circles with anti-periodic boundary conditions for\nfermions in the gravity approximation (see, e.g., [2, 25]). In the gravity approximation,\nin order to study the theory at a finite temperature T , we need to look at Euclidean gravitational backgrounds which are asymptotically equal to (1), but with the time direction\nEuclidean and identified with a periodicity β = 1/T , and with anti-periodic boundary\nconditions for the fermions along this direction (as well as along the x4 direction). One\nsuch background is obviously given by the Euclidean continuation of (1) itself, with t\nperiodically identified; it is easy to verify that this is a smooth background which is\nweakly curved (at least until the temperature reaches a number of order the square root\nof the confining string tension Tst ≃ λ5 /R3 , at which stage the size of the time circle at\nthe minimal radial position u = uΛ becomes of order the fundamental string scale and a\ntachyon develops). In this background the periodicity of t is arbitrary and equal to β,\nand the periodicity of x4 is 2πR with R related to uΛ by (2).\nIn the background described above the x4 circle shrinks when u reaches its minimal\nvalue, but the t circle never shrinks to zero size. Another background with the same\nasymptotics is given by exchanging the behavior of the t and x4 circles, or equivalently\nby moving the factor of f (u) in (1) from the dx24 term to the dt2 term. Now, the t\ncircle shrinks to zero size at the minimal value of u (which is now related to β rather\n3\nthan to 2πR, and given by uT = 16π 2 RD4\n/9β 2 ), while the x4 circle never shrinks. This\nbackground also exists as a classical solution for any value of the periodicities of x4 and\nt (and develops a tachyon for very small values of R).\nThese two backgrounds are the only known smooth Euclidean solutions which asymp-\n\n13\n\n\ftotically approach (1) 10 . Thus, in order to decide which background dominates at a given\ntemperature T we need to compute the free energies of these backgrounds, given (in the\ngravitational approximation) by the classical supergravity action times the temperature,\nand see which one has a lower free energy. As usual, the classical action actually diverges and needs to be regulated. One way to regulate it is by looking at the difference\nbetween the actions of the two solutions, which turns out to be finite (this method is\nnot always reliable, but it gives the correct answer in this case). Another way is to add\ncounter-terms at a large u cutoff that make the action finite as the cutoff goes to infinity. In the first method it is clear that the free energies of the two solutions agree when\nthe (asymptotic) circumferences of the two circles are equal, β = 2πR, since the two\nsolutions are identical then except for a relabeling of the coordinates. Thus, at this temperature Td = 1/2πR there is a first order phase transition between the two backgrounds\n(the transition is of first order since the solutions do not smoothly connect there, but\ncontinue to exist as separate solutions both below and above the transition). It is easy\nto see that the background in which the x4 circle shrinks to zero size dominates at low\ntemperatures T < 1/2πR, while the background in which the t circle shrinks dominates\nat high temperatures, T > 1/2πR; intuitively, the circle which is smaller prefers to shrink\nto zero size. The relevant computation is described in the appendix, and leads (39) to a\ndifference of free energy densities proportional to Nc2 R(gs Nc )[(2πT )6 − 1/R6 ].\nThe physical interpretation of this phase transition (which is a close relative of the\nHawking-Page transition in asymptotically AdS backgrounds [2]) is straightforward. If\nwe compute the quark-anti-quark potential in the two backgrounds (before adding the\nD8-branes) using the methods of [26, 27, 22], we find that in the low-temperature back√\nground in which gtt gxx is finite at the minimal value of u the potential is linear in\nthe distance, corresponding to confinement, while in the high-temperature background\n√\nin which gtt gxx goes to zero at the minimal value of u the potential decays with the\ndistance, corresponding to a deconfined phase. Similarly, a computation of the value\nof the free energy in the two phases (which requires adding appropriate counter-terms)\nyields a result of order Nc0 in the low-temperature phase, and a result of order Nc2 in the\nhigh-temperature phase.\nAs mentioned above, as we increase R compared to the scale set by the five dimensional gauge coupling λ5 , the supergravity background becomes highly curved, and the\ntheory at low energies approaches the four dimensional pure Yang-Mills theory. It is believed (though it is difficult to prove) that the deconfinement transition described above\n10\n\nNote that asymptotically these backgrounds become strongly coupled so we should really lift them\nto M theory, and discuss the asymptotics in the M theory regime, but in the large Nc limit the strong\ncoupling region can be arbitrarily far away from the regions of finite u which we are interested in so this\ndoes not play any role.\n\n14\n\n\fFigure 4: A minimal conjecture for the schematic form of the phase diagram of the 4 + 1\ndimensional maximally supersymmetric SU(Nc ) gauge theory compactified on a circle\nwith anti-periodic boundary conditions for the fermions, as a function of the dimensionless\ncoupling constant λ5 /R and the dimensionless temperature T R, based on the known\nresults in the various limits and on the T ↔ 1/2πR symmetry. All solid lines in the\ndiagram denote phase transitions; the dashed line may or may not be a phase transition\nline.\nis connected to the deconfinement transition of the large Nc pure Yang-Mills theory in\nthis limit. However, this connection is somewhat subtle [28], since even for small λ5 /R it\nis clear by the symmetry arguments described above that there is always either a phase\ntransition line at T = 1/2πR, or else the dominant phase at this temperature must be\ninvariant under the exchange T ↔ 1/2πR (which is not the case for the confined and\ndeconfined phases discussed above). On the other hand, the deconfinement phase transition in the pure Yang-Mills theory occurs at a temperature of order ΛQCD ≪ 1/R. Due\nto the T ↔ 1/2πR symmetry there must then be at least one more phase transition line\nat a temperature much larger than 1/R. Thus, we see that new phases must appear as\nwe approach the four dimensional Yang-Mills limit. The phase structure of this theory\nin that limit includes several phase transition lines, which, presumably, all join into the\nline T = 1/2πR in the gravity limit. A minimal conjecture for the phase structure is\ndepicted in figure 4; note that with this conjecture the deconfinement transition line\nin the supergravity limit is connected to the deconfinement transition line in the four\n\n15\n\n\fdimensional Yang-Mills limit, but this connection does not seem to be smooth11 .\n\n3.2\n\nThe low temperature phase\n\nAs described above, the background corresponding to the low-temperature phase of the\ntheory is identical to that of the Sakai-Sugimoto model at zero temperature (1), apart\nfrom the fact that the time direction is Euclidean and compactified with a circumference\nβ = 1/T , where T is the temperature of the dual gauge theory. Hence, just as for the zero\ntemperature case, the dual gauge theory is in the confining phase and the string tension\nis given by (3). Furthermore, the solution for the profile of the D8 brane is still given\nby (6). Note that this agrees with general arguments that the chiral condensate (in the\nlarge Nc limit) should be independent of the temperature in the confined phase [30, 31].\nDefining y ≡ u/u0, yΛ ≡ uΛ /u0 , and f (y) ≡ 1 − (yΛ /y)3 (such that f (1) = 1 − yΛ3 ), we\nfind from (6) that\nv\nu\nu =\nRD4\n′\n\n\u0012\n\n\u00133/2\n\nu\nu f (y)\nf (y)ty 8\n\nf (1)\n\n− 1.\n\n(18)\n\nSubstituting this outcome of the equation of motion, the action is now\n3/2 7/2\n\nSDBI = 2\n\nT̂8 RD4 u0\ngs\n\n2T̂8 RD4 u0\n3gs\n\n∞\n\nZ\n\n1\n\n1\n\n3/2 7/2\n\n=\n\nZ\n\ny 5/2\n1\nr\ndy q\nf (y) 1 − f (1)\n\n1\nf (y) y 8\n\n0\n\ndz\n\n1\nq\n\nz 13/6 1 − (1 − yΛ3 )z 8/3 − yΛ3 z\n\n.\n\n(19)\n\nThe form of the profile (18) of the D8-branes is drawn in figure 1(a). Again, the\ntopology of the background forces a profile that smoothly connects the D8-branes to the\nanti-D8 branes, signaling chiral symmetry breaking in the dual gauge theory.\nThe relation between L and u0 is precisely the same as for zero temperature (8). For\nsmall values of L we find that the dependence of the action (19), which is proportional\nto the vacuum energy of the system, on the separation distance is given by\n3/2\n\nSDBI\n\nT̂8 RD4\n∝\n.\ngs L7\n\n(20)\n\nFor general values of L the dependence is more complicated.\n11\n\nThis conjectured phase diagram is the same as the phase diagram of the same theory reduced on the\nthree spatial directions which was discussed in [29], suggesting that perhaps the phase structure does\nnot change when the three infinite spatial dimensions are compactified on a torus. We thank M. Van\nRaamsdonk for discussions of this point.\n\n16\n\n\f3.3\n\nThe high temperature phase\n\nThe gravity background associated with the high temperature phase of the dual gauge\ntheory takes the form\nds\n\n2\n\nF(4)\n\n\u0012\n\n=\n\nu\nRD4\n\n\u00133/2 h\n\n2\n\ni\n\nj\n\nf (u)dt + δij dx dx +\n\n2πNc\n=\nǫ4 ,\nV4\n\nφ\n\ne = gs\n\n\u0012\n\nu\nRD4\n\n\u00133/4\n\ndx24\n\ni\n\n3\nRD4\n\n,\n\nRD4\n+\nu\n\n≡\n\n\u0012\n\n\u00133/2 \"\n\nπgs Nc ls3 ,\n\nu\n\n2\n\ndΩ24\n\ndu2\n+\n,\nf (u)\n#\n\nuT\nf (u) ≡ 1 −\nu\n\u0012\n\n\u00133\n\n, (21)\n\nin the same notations as in (1). The time direction t now shrinks to zero size at the\nminimal value of u, u = uT , and in order to avoid a singularity there the time direction\nmust have a period of\n!1/2\n3\n4π RD4\nδt =\n=β\n(22)\n3\nuT\nwhich we identify with the inverse temperature of the system β = 1/T . On the other\nhand, in this solution the x4 direction can have an arbitrary periodicity 2πR.\nWe expect that again the D8 probe branes span the coordinates t, xi , Ω4 , and are\ndescribed by some curve u(x4 ). The induced metric on the D8 branes now reads\nds2D8\n\n=\n\n\u0012\n\nu\nRD4\n\n\u00133/2 h\n\n+\n\n\u0012\n\nRD4\nu\n\n\u00133/2\n\nu\nf (u)dt + δij dx dx +\nRD4\n2\n\ni\n\nj\n\n\u0012\n\ni\n\n\u00133/2 \"\n\nRD4\n1+\nu\n\u0012\n\n\u00133\n\nu′ 2\ndx24\nf (u)\n\nu2 dΩ24\n\n#\n\n(23)\n\nwhere u′ = du/dx4. Just as for the low temperature phase, here too the CS term does\nnot affect the solution of the equations of motion. Upon substituting the determinant of\nthe induced metric and the dilaton, the DBI action is given by\nSDBI = T8\n\nZ\n\nq\n\ndtd3 xdx4 d4 Ωe−φ − det(ĝ) =\n\nT̂8\ngs\n\nZ\n\ndx4 u4\n\nv\nu\n\u0013\n\u0012\nu\nRD4 3\nt\nf (u) 1 +\n\nq\n\nu\n\nu′ 2\n, (24)\nf (u)\n\nwhere T̂8 includes the outcome of the integration over all the coordinates apart from dx4 .\nAgain, conservation of the Hamiltonian of (24) implies that\nq\n\nf (u)u4\n\nr\n\n1+\n\n\u0010\n\n\u0011\nRD4 3 u′ 2\nu\nf (u)\n\nq\n\n= constant = u40 f (u0),\n\n(25)\n\nwhere on the right-hand side of the equation we assumed that there is a point u0 where\nthe profile of the brane has a minimum, u′(u = u0 ) = 0. Defining again y ≡ u/u0, we\n17\n\n\fFigure 5: The possible configurations of the D8 and anti-D8 probe branes in the high\ntemperature (deconfined) phase. A generic connected configuration with an asymptotic\nseparation of L, that stretches down to a minimum at u = u0 , is drawn in (a). This\ncorresponds to the chiral symmetry broken phase. Figure (b) depicts a chiral-invariant\nsolution, with separate D8 and anti-D8-branes.\nfind that\nu\nu′ =\nRD4\n\u0012\n\nv\nu\nu f (y)\nf (y)t\ny8\n\n\u00133/2 q\n\nf (1)\n\n− 1.\n\n(26)\n\nSubstituting the outcome of the equation of motion, the action is now\n3/2 7/2\n\nSDBI =\n\n2T̂8 RD4 u0\ngs\n\nZ\n\n1\n\n∞\n\ny 5/2\ndy r\n.\nf (1)\n1 − f (y)y8\n\n(27)\n\nSince we assumed u′ (u = u0 ) = 0, this action corresponds to a configuration where the\nD8-branes merge smoothly into the anti-D8-branes, as in figure 5(a).\nAs discussed above, this configuration exhibits in the string theory dual the phenomenon of χSB in the gauge theory. However, there is yet another classical configuration that solves the equations of motion. This is a configuration of a constant x4 ,\nx4 (u) = 0 and x4 (u) = L (or u′ → ∞), see figure 5(b). This configuration is possible\nin the high-temperature phase since in this phase the t circle shrinks to zero at u = uT ,\nso the D8-brane can just smoothly end there (and wrap around the \"cigar\" in the t − u\n18\n\n\f3/2 7/2\n\nFigure 6: ∆S as a function of yT , in units of 2T̂8 RD4 u0 /gs .\nplane); in the Minkowski space continuation of this solution, the D8-brane would go into\nthe horizon of the black D4-branes. For such a configuration that naturally describes the\nsituation of an unbroken chiral symmetry, the action reads (summing over the D8 and\nanti-D8 contributions)\n0\nSDBI\n\n2T̂8\n=\ngs\n\nZ\n\n∞\n\nuT\n\nduu\n\n4\n\n\u0012\n\nRD4\nu\n\n\u00133/2\n\n3/2 7/2\n\n2T̂8 RD4 u0\n=\ngs\n\n\u0014Z\n\n1\n\n∞\n\ndyy\n\n5/2\n\n+\n\nZ\n\n1\n\nyT\n\ndyy\n\n5/2\n\n\u0015\n\n,\n\n(28)\n\nwhere yT ≡ uT /u0 .\nWe are now facing the question of which of the two possible configurations is preferred.\nThis is determined by the free energy, or the action, of the configurations. The relevant\nquantity is the following difference between the two actions\n0\n\n∆S ≡\n\ngs (S − S )\n\n3/2 7/2\n2T̂8 RD4 u0\n\n\nZ\n\n1\n=\n3\n\n0\n\n1\n\n=\n\n\n\n\nZ\n\n\n\n\n\n\n1\n\n∞\n\n\n\ndyy 5/2 \nr\n1−\n\n\nq\n\n1\nf (1) −8\ny\nf (y)\n\n\n\n\n− 1\n−\n\n\nZ\n\n1\n\nyT\n\ndyy 5/2\n\n\n\n\n\n\n\n\n\n\n1 − yT3 z\n1\n2\n7/2\ndz 13/6  q\n− 1 − (1 − yT ).\n\nz\n7\n1 − yT3 z − (1 − yT3 )z 8/3\n\n(29)\n\nWe are unable to evaluate ∆S analytically so we do it numerically. The result is\ndrawn in figure 6, which shows ∆S as a function of yT . It is easy to see from this figure\nthat for yT > yTc ∼ 0.73572, ∆S is positive and hence the preferred configuration is that\nof disconnected D8 and anti-D8-branes, whereas in the region where yT < yTc ∼ 0.73572\nthe system will be dominated by a smooth configuration that connects the D8 and anti\nD8 branes, namely the chiral symmetry broken phase.\n19\n\n\fNext, we would like to express the critical point in terms of physical quantities. Recall\nthat yT ≡ uT /u0 . uT is related to the temperature in the gauge theory by (22). u0 is the\nminimal point of the connected probe brane configuration, which can be related to the\nasymptotic distance L between the positions of the D8 and anti-D8-branes (see figure 5)\nin the following manner12\nL =\n\nZ\n\n2\n=\n3\n\ndx4 = 2\n3\nRD4\nu0\n\nZ\n\n3\ndu\nRD4\n=\n2\nu′\nu0\n\n∞\n\nu0\n\n!1/2 q\n\n1−\n\nyT3\n\nZ\n\n1\n0\n\n!1/2 Z\n\n∞\n\n1\n\ny −3/2\nr\ndy q\ny8 − 1\nf (y) ff (y)\n(1)\n\nz 1/2\nq\ndz q\n.\n1 − yT3 z 1 − yT3 z − (1 − yT3 )z 8/3\n\n(30)\n\n3\nNote that for small L, namely for yT << 1, we find u0 ∝ RD4\n/L2 and again S ∝ 1/L7 .\nWe would like to relate the asymptotic distance L at the transition to the temperature of\nthe transition. Evaluating the integral in (30) at the transition temperature yTc ≃ 0.73572\n3\ngives Lc ≃ 0.751(RD4\n/u0)1/2 , and using equation (22) we find\n\nTχSB ≃ 0.154/L.\n\n(31)\n\nRecall that the deconfinement phase transition is at Td = 1/2πR, and that this\nanalysis applies only in the deconfined phase. For L > 0.97R the temperature in the\ndeconfined phase is always higher than (31), so the deconfinement and chiral symmetry\nrestoration transitions happen together. On the other hand, for L < 0.97R, the two phase\ntransitions are separate, and there is a finite range between Td and TχSB for which the\ntheory is deconfined but with a broken chiral symmetry. The full phase diagram of the\ntheory (in the supergravity approximation) is drawn in figure 7. Note that even though\nfor the gravity approximation to be good everywhere in space we required λ5 ≫ R, for\ngravity to be good near the 8-branes it is actually enough to require λ5 ≫ L, and at high\ntemperatures gravity gives a good approximation everywhere whenever λ5 ≫ 1/T . Thus,\nwe can trust our analysis of the phase transition whenever λ5 ≫ L. In particular, in the\nR → ∞ limit discussed in [20], the theory is always deconfined, and passes through a\nchiral symmetry restoration transition at T = TχSB given by (31). 13\n\n3.4\n\nThe spectrum in the various phases\n\nIn this subsection we discuss the spectrum of quark configurations in the different phases\ndescribed above; such a discussion is more appropriate in Minkowski space, in the\n12\n\nIn fact, as we discussed above, this integral could equal either L or 2πR − L, but it is easy to see\nthat the second option is always sub-dominant wherever it exists.\n13\nNote added : in parallel with this paper, the paper [32] appeared which discusses the same system\nin the R → ∞ limit, with identical results to ours.\n\n20\n\n\fFigure 7: The phase diagram of the Sakai-Sugimoto model at finite temperature, in the\ngravity approximation λ5 ≫ R. In this approximation the phase structure depends only\non the two dimensionless parameters T R and L/R. For small L/R the deconfinement\nand chiral symmetry restoration transitions are separate, while for L/R > 0.97 there is\na single transition.\nfinite-energy-density configurations (in the microcanonical ensemble) obtained by Wickrotating the Euclidean configurations discussed above. In general there are two types of\npossible configurations. We can have strings with both ends on D8-branes, corresponding\nto mesons (for light strings these are described by the DBI action, and for large spin they\ncan be described by semi-classical strings, see figure 2). And, if the background contains\na horizon (as in the deconfined phase) we can have a string starting on an 8-brane and\ngoing into the horizon, corresponding to a deconfined quark (or anti-quark).\nAs discussed above, the behavior in the low-temperature phase is very similar to the\nbehavior at zero temperature, as expected in a theory with a small number of weakly\ninteracting massless particles (the \"pions\"). There is a discrete spectrum of mesons, and\nthere are no free quark states. Computing the spectrum of mesons (including the pseudo\nvector and scalar mesons described in §2.2) and glueballs in this phase gives exactly the\nsame results as for zero temperature. The high spin mesons are described as classical\nstring configurations stretched from the D8 probe brane down to the \"wall\" at u = uΛ\nand back to the probe branes [15] (see figure 2), and again there is no difference between\nthe zero temperature and low temperature results.\nAs we raise the temperature, at T = 1/2πR we go over to the deconfined bulk\n21\n\n\fphase; as we saw, depending on L/R, we can either get a phase with broken chiral\nsymmetry or with unbroken chiral symmetry. In the case of small L/R with broken\nchiral symmetry the D8-branes are still connected. In this phase the spectrum of bulk\nmodes has no mass gap, due to the presence of the horizon in (21). On the other hand,\na computation of the meson spectrum using the D8-brane action still gives a discrete\nspectrum as in [17]. However, unlike the low-temperature case, here the spectrum of\nquark-anti-quark configurations is continuous at high enough energies. This is because\nthis spectrum includes strings starting on the D8-brane and going down to the horizon\nu = uT (in Minkowski space such configurations are just deconfined quarks, while in\nEuclidean space these strings must go back to the D8-brane, but they can stretch any\ndistance in the three dimensional space before doing so with no cost in energy). These\nexcitations give rise to a continuous spectrum of quark-anti-quark configurations, which\nstarts above aqmass gap which equals twice the mass of a string stretching from u0 to uT ,\nR\nMgap = 2 uuT0 1 − (uT /u)3 du/ls2 . This is obviously the analog of 2mC\nq defined in (17),\n2\nand this also scales as λ5 /L for small L/R. Note that after we put in the D8-branes we\ncan no longer use the spatial Wilson loop as a diagnostic for confinement, since this can\nbe screened by the dynamical quarks, but the scaling of the free energy at large Nc can\nstill be used to distinguish the confining phase at T < 1/2πR from the deconfined phase\nat T > 1/2πR.\nEven when L/R is small and such an intermediate phase exists, at high enough\ntemperature we always end up in a deconfined phase with a restored chiral symmetry, in\nwhich the 8-branes end at the horizon u = uT . In this phase there is no longer a mass gap\nfor quark-anti-quark configurations, since strings stretched between the 8-branes and the\nhorizon can be as light as we want, and the spectrum of quark-anti-quark configurations\nis continuous (just like the bulk spectrum).\n\n4\n\nSummary\n\nIn this paper we computed the phase structure of the Sakai-Sugimoto model, which is\nan example of a confining gauge theory with chiral symmetry breaking, related by a\ncontinuous change of parameters to large Nc QCD. Our results are summarized in figure\n7. We found that the topology of the solutions (in the supergravity approximation)\nimplies that the confined phase must always break the chiral symmetry. On the other\nhand, in the deconfined phase a computation is required to see whether chiral symmetry\nis restored at the deconfinement temperature or above it, and we found that in some\nrange of parameters the first possibility is realized, while in another range the second\npossibility occurs. When L is much smaller than R we found that the chiral symmetry\nrestoration scale is much higher than the deconfinement scale, as expected because of\n22\n\n\fthe separation between the confinement and chiral symmetry breaking scales in this case\n(as emphasized in [20]). In this case the chiral symmetry restoration happens at a scale\nrelated to the mass scale of the mesons 1/L, while the deconfinement transition happens\nat a scale related to the glueball mass scale 1/R.\nThe fact that confinement implies chiral symmetry breaking is true also in a larger\nclass of holographic duals of confining theories. When the confinement is realized geometrically (this is not always true [3]) there is a minimal value of the radial coordinate\nu = uΛ , and some spatial cycle shrinks there. A chiral symmetry should be realized by\nhaving two sets of branes (each carrying one U(Nf ) factor), and chiral symmetry breaking should be realized by the branes becoming connected. If the branes can end without\nreconnecting, confinement does not imply χSB; clearly this can only happen if the branes\nare wrapped on the cycle which vanishes at the minimal value u = uΛ . Conversely, if the\nbranes are not wrapped around this cycle (as is the case in the Sakai-Sugimoto model\nwhich we discussed here), they do not have anywhere to end, so the chiral symmetry\nmust be broken in the confined phase. It would be interesting to relate this discussion\nto the gauge theory discussions of chiral symmetry breaking in large Nc gauge theories\n[30, 31] which show that chiral symmetry must be broken in the confined phase in the\nlarge Nc limit.\nIn this paper we discussed the phase structure of the theory only in the gravity regime\nλ5 ≫ L. It was recently realized in [20] that there is another regime in which the theory\nis under control, which is the weak-coupling regime λ5 ≪ L with R going to infinity.\nIt would be interesting to study the phase structure also in this regime. There are also\nmany other possible generalizations of the Sakai-Sugimoto model which can be analyzed\nby similar methods to the ones we used here, such as having several different stacks of\nD8-branes (and of anti-D8-branes) separated in the x4 direction.\nIt is interesting to compare our results with the situation in large Nc QCD, which is\nrelated to our theory by taking the limit of small λ5 /R. The technology to study large Nc\nQCD with chiral fermions on the lattice has only recently been developed, and preliminary\nresults presented in [33] suggest that in this theory chiral symmetry restoration occurs\nat the same temperature as the deconfinement transition, but that if one supercools\nthe deconfined phase below the deconfinement temperature one encounters a critical\ntemperature where the chiral symmetry is broken. This is similar to what we find in\nthe case of L/R > 0.97 (where we also find a transition in the supercooled deconfined\nphase at the temperature Tc = 0.154/L), so it is plausible that the phase diagram in this\nregime connects continuously to that of large Nc QCD (up to the caveats discussed at\nthe end of §3.1).\n\n23\n\n\fAcknowledgements\nWe would like to thank S. Minwalla, H. Neuberger, B. Svetitsky, M. Van Raamsdonk and\nespecially D. Kutasov for useful discussions. J.S. would like to thank O. Sonnenschein\nfor helping with the drawings. This work was supported in part by a grant of DIP (H.52)\nand by the Albert Einstein Minerva Center for Theoretical Physics at the Weizmann\nInstitute. The work of O.A. was supported in part by the Israel-U.S. Binational Science\nFoundation, by the Israel Science Foundation (grant number 1399/04), by the BraunRoger-Siegl foundation, by the European network HPRN-CT-2000-00122, by a grant from\nthe G.I.F., the German-Israeli Foundation for Scientific Research and Development, and\nby Minerva. The work of J.S. and S.Y. was supported in part by the Israel Science\nFoundation (grant number 03200306).\n\nA\n\nAppendix: The bulk free energies of the low and\nhigh temperature phases\n\nIn this appendix we present the calculation of the difference between the free energies of\nthe two possible solutions for the finite temperature description of the bulk, described in\nsection 3.1. A similar calculation in the context of the AdS5 × S 5 model was done in [2].\nRather than computing the action directly, we translate our results into the notations\nof [34] and use the results for the action computed there. Thus, we parameterize the\nEuclidean metrics (1) and (21) that we are interested in as\nls−2 ds2 = dτ 2 + e2λ(τ ) dx2k + e2λ̃(τ ) dx2c + e2ν(τ ) dΩ24 ,\n\n(32)\n\nwhere xc is either x4 or the Euclidean time (the one whose circle shrinks to zero size\nat the minimal value of u), xk are the other four coordinates of R4,1 (one of which is\nalso compactified), τ is the radial direction and dΩ24 is the metric on the transverse S 4 .\nThe background includes in addition the dilaton φ and a four-form RR field. For such\nbackgrounds that depend only on a radial direction, the full type IIA supergravity action\nreduces to the following 0 + 1-dimensional action [35] :\nS=V\n\nZ\n\n\u0011\n\n\u0010\n\ndρ −4(λ′ )2 − (λ̃′ )2 − 4(ν ′ )2 + (φ′ )2 + 12e−2ν−2φ − Q2c e4λ+λ̃−4ν−φ ,\n\n(33)\n\nwhere the new radial coordinate ρ is defined by dτ = −e−φ dρ, primes denote derivatives\nwith respect to ρ, and φ ≡ 2φ − 4λ − λ̃ − 4ν. V is the volume of all other directions\n(except ρ) in string units; this includes the volume V3 in the three spatial directions,\nthe volume of the two circles which is 2πRβ/ls2 and the volume of a unit S 4 which is\n24\n\n\f2π 2 . The last term in the action corresponds to the contribution of the RR flux, with\n√\nQc ≡ 3πNc / 2 (see, for instance, [19]) where Nc is the quantized RR flux.\nThe equations of motion associated with the action (33) are\n1\nλ′′ − Q2c e2(4λ+λ̃−φ) = 0,\n2\n1\nλ̃′′ − Q2c e2(4λ+λ̃−φ) = 0,\n2\n1\nφ′′ − Q2c e2(4λ+λ̃−φ) = 0,\n2\n1\nν ′′ − 3e2(4λ+λ̃+3ν−2φ) + Q2c e2(4λ+λ̃−φ) = 0.\n2\n\n(34)\n\nIt is straightforward to check that the following are the solutions of these equations\n[34, 36] corresponding to the background (1) :\n1\n1\nu3\nλ = − ln (sinh(−4bρ)) + ln( Λ3 ) − bρ,\n4\n4\n2RD4\nφ = λ + ln(gs ),\n\nλ̃ = λ + 4bρ,\nν=\n\nλ\n+ ln(RD4 /ls ),\n3\n\n(35)\n\n√ 3\nwhere b ≡ −Qc u3Λ /4 2RD4\ngs . Here we wrote the solution of the low temperature phase,\nfor the high temperature phase we have to replace uΛ with uT .\nSince the backgrounds (1) and (21) are expressed in terms of the radial coordinate\nu, it is useful to rewrite the action (33) in terms of integrals over u, which run from uΛ\nto ∞ for the low temperature phase and from uT to ∞ for the high temperature phase.\nThe action (33) then reads (with dots denoting derivatives with respect to u)\n(\u0014\n\n)\n\ni dρ\ndu h 8λ+2λ̃+6ν−4φ\n ̇2\n,\n+ 12e\n− Q2c e8λ+2λ̃−2φ\nS = −V\ndu −4λ̇2 − λ̃ − 4ν̇ 2 + φ̇2\ndρ\ndu\nuΛ\n(36)\nwhere the minus sign arises because dρ/du is negative. Substituting the solution (1), the\naction takes the form\n\nS = −V\n\nZ\n\n∞\n\nZ\n\n∞\n\nuΛ\n\n\n\n 15\ndu  2 1 +\n 2u\n\n\u0015\n\n\n\ndu\n1\n\n+\nu 3\n[( uΛ ) − 1]\ndρ\n\n\"\n\n\n\nQ2c\ndρ \n12\n6\nu\nf\n(u)\n−\n. (37)\n6\ngs4 ls6 gs2 RD4\ndu \n!\n\n#\n\ndρ\nAt this point we need to compute the derivative du\nand its inverse. Using the relation\ndρ\nuΛ 3\n2λ̃ 2λ\ne /e = [1 − ( u ) ] and (35) we find that du is given by\n\n3\n1\ndρ\n=\n.\nu 3\ndu\n8bu [( uΛ ) − 1]\n25\n\n(38)\n\n\fSubstituting this expression into the action we find that the divergence at large u is\nindependent of uΛ , so it makes sense to subtract the expressions with uΛ and with uT\nand to obtain a finite answer. The result for the difference between the action densities\nin the low temperature phase and in the high temperature phase is given by (defining\nb̂ = bls3 /u3Λ which is a constant independent of uΛ )\nSlow − Shigh\n4π 3 Rβ 20b̂\n1\n∆S\n≡\n=\n+\nV3\nV3\nls8\n3\n4b̂\n\"\n\n=\n\n6\nQ2c\n−\n6\ngs4 2gs2 RD4\n\n!#\n\n(u3Λ − u3T )\n\n4π 3 Rβ 5 3\n(u − u3Λ )\nls8 gs2 T\n\"\n\n#\n\n4\n1\n1\n= 20βRls ( )3 π 6 (gs Nc )Nc2 − 6 + β 6\n9\nR\n( 2π )\n4\n6\n= 20βRls ( )3 π 6 (gs Nc )Nc2 [(2πT )6 − Mgb\n].\n9\n\n(39)\n\nIn the third and fourth lines the difference of the actions was expressed in terms of\nthe radii of the circles and in terms of the glueball mass scale and the temperature,\nrespectively. The difference of actions scales as Nc2 in the 't Hooft large Nc limit, as\nexpected.\nThe difference (39) between the action densities is the same, up to a factor of β,\nas the difference between the free energy densities. It is now easy to see that for low\ntemperatures, 2πR < β, the background (1) has a lower free energy so it dominates,\nwhile the opposite is the case for high temperatures, as we claimed in section 3.1.\n\nReferences\n[1] J. M. Maldacena, The large N limit of superconformal field theories and supergravity, Adv. Theor. Math. Phys. 2, 231 (1998) [Int. J. Theor. Phys. 38, 1113 (1999)]\n[arXiv:hep-th/9711200].\n[2] E. Witten, Anti-de Sitter space, thermal phase transition, and confinement in gauge\ntheories, Adv. Theor. Math. Phys. 2, 505 (1998); hep-th/9803131.\n[3] J. Polchinski and M. J. Strassler, The string dual of a confining four-dimensional\ngauge theory, arXiv:hep-th/0003136.\n[4] I. R. Klebanov and M. J. Strassler, Supergravity and a confining gauge theory: Duality cascades and chiSB-resolution of naked singularities, JHEP 0008, 052 (2000);\nhep-th/0007191.\n26\n\n\f[5] J. M. Maldacena and C. Nunez, Towards the large N limit of pure N = 1 super Yang\nMills, Phys. Rev. Lett. 86, 588 (2001); hep-th/0008001.\n[6] A. Karch and A. Katz, Adding flavor to AdS/CFT, JHEP 0206, 043 (2002);\nhep-th/0205236.\n[7] O. Aharony, A. Fayyazuddin and J. M. Maldacena, The large N limit of N\n= 2,1 field theories from three-branes in F-theory, JHEP 9807, 013 (1998)\n[arXiv:hep-th/9806159].\n[8] T. Sakai and J. Sonnenschein, Probing flavored mesons of confining gauge theories\nby supergravity, JHEP 0309, 047 (2003); hep-th/0305049.\n[9] J. Babington, J. Erdmenger, N. J. Evans, Z. Guralnik and I. Kirsch, Chiral symmetry\nbreaking and pions in non-supersymmetric gauge / gravity duals, Phys. Rev. D 69,\n066007 (2004); hep-th/0306018.\n[10] M. Kruczenski, D. Mateos, R. C. Myers and D. J. Winters, Towards a holographic\ndual of large-N(c) QCD, JHEP 0405, 041 (2004); hep-th/0311270.\n[11] S. A. Cherkis and A. Hashimoto, Supergravity solution of intersecting branes and\nAdS/CFT with flavor, JHEP 0211 (2002) 036 [arXiv:hep-th/0210105]; A. Karch,\nE. Katz and N. Weiner, Hadron masses and screening from AdS Wilson loops,\nPhys. Rev. Lett. 90 (2003) 091601 [arXiv:hep-th/0211107]. M. Kruczenski, D. Mateos, R. C. Myers and D. J. Winters, Meson spectroscopy in AdS/CFT with\nflavour, JHEP 0307, 049 (2003) [hep-th/0304032]; H. Nastase, On Dp-Dp+4 systems, QCD dual and phenomenology, hep-th/0305069; X. J. Wang and S. Hu, Intersecting branes and adding flavors to the Maldacena-Nunez background, JHEP\n0309 (2003) 017; hep-th/0307218; P. Ouyang, Holomorphic D7-branes and flavored N = 1 gauge theories, Nucl. Phys. B 699 (2004) 207 [arXiv:hep-th/0311084];\nC. Nunez, A. Paredes and A. V. Ramallo, Flavoring the gravity dual of N = 1\nYang-Mills with probes, JHEP 0312, 024 (2003); hep-th/0311201; S. Hong, S. Yoon\nand M. J. Strassler, Quarkonium from the fifth dimension, JHEP 0404 (2004)\n046 [arXiv:hep-th/0312071]; N. J. Evans and J. P. Shock, Chiral dynamics from\nAdS space, Phys. Rev. D 70 (2004) 046002 [arXiv:hep-th/0403279]; J. L. F. Barbon, C. Hoyos, D. Mateos and R. C. Myers, The holographic life of the eta',\nJHEP 0410 (2004) 029 [arXiv:hep-th/0404260]; M. Bando, T. Kugo, A. Sugamoto\nand S. Terunuma, Pentaquark baryons in string theory, Prog. Theor. Phys. 112\n(2004) 325 [arXiv:hep-ph/0405259]; B. A. Burrington, J. T. Liu, L. A. Pando Zayas and D. Vaman, Holographic duals of flavored N = 1 super Yang-Mills: Beyond the probe approximation, JHEP 0502, 022 (2005) [arXiv:hep-th/0406207];\n27\n\n\fK. Ghoroku and M. Yahiro, Chiral symmetry breaking driven by dilaton, Phys. Lett.\nB 604 (2004) 235 [arXiv:hep-th/0408040]; J. Erdmenger and I. Kirsch, Mesons in\ngauge / gravity dual with large number of fundamental fields, JHEP 0412 (2004)\n025 [arXiv:hep-th/0408113]; D. Arean, D. Crooks and A. V. Ramallo, Supersymmetric probes on the conifold, JHEP 0411 (2004) 035 [arXiv:hep-th/0408210];\nS. Hong, S. Yoon and M. J. Strassler, On the couplings of vector mesons in\nAdS/QCD, arXiv:hep-th/0409118; S. Hong, S. Yoon and M. J. Strassler, Adjoint\ntrapping: A new phenomenon at strong 't Hooft coupling, JHEP 0603 (2006) 012\n[arXiv:hep-th/0410080]; S. Kuperstein, Meson spectroscopy from holomorphic probes\non the warped deformed conifold, JHEP 0503 (2005) 014 [arXiv:hep-th/0411097];\nA. Paredes and P. Talavera, Multiflavour excited mesons from the fifth dimension,\nNucl. Phys. B 713, 438 (2005) [arXiv:hep-th/0412260]; G. F. de Teramond and\nS. J. Brodsky, The hadronic spectrum of a holographic dual of QCD, Phys. Rev.\nLett. 94, 201601 (2005), hep-th/0501022; S. Hong, S. Yoon and M. J. Strassler,\nOn the couplings of the rho meson in AdS/QCD, arXiv:hep-ph/0501197; L. Da\nRold and A. Pomarol, Chiral symmetry breaking from five dimensional spaces,\nNucl. Phys. B 721, 79 (2005), hep-ph/0501218; K. Ghoroku, T. Sakaguchi,\nN. Uekusa and M. Yahiro, Flavor quark at high temperature from a holographic\nmodel, Phys. Rev. D 71 (2005) 106002 [arXiv:hep-th/0502088]; N. Evans, J. Shock\nand T. Waterson, D7 brane embeddings and chiral symmetry breaking, JHEP\n0503 (2005) 005 [arXiv:hep-th/0502091]; I. Brevik, K. Ghoroku and A. Nakamura, Meson mass and confinement force driven by dilaton, Int. J. Mod. Phys.\nD 15 (2006) 57 [arXiv:hep-th/0505057]; I. Kirsch and D. Vaman, The D3/D7 background and flavor dependence of Regge trajectories, Phys. Rev. D 72, 026007 (2005)\n[arXiv:hep-th/0505164]; T. S. Levi and P. Ouyang, Mesons and flavor on the conifold, arXiv:hep-th/0506021; N. Mahajan, Revisiting 5D chiral symmetry breaking\nand holographic QCD models, Phys. Lett. B 623, 119 (2005), hep-ph/0506098;\nK. Ghoroku, Flavor meson localization in 5d braneworld, Phys. Lett. B 632 (2006)\n405 [arXiv:hep-th/0506168]; R. Apreda, J. Erdmenger and N. Evans, Scalar effective potential for D7 brane probes which break chiral symmetry, hep-th/0509219;\nF. Canoura, J. D. Edelstein, L. A. P. Zayas, A. V. Ramallo and D. Vaman, Supersymmetric branes on AdS5 × Y p,q and their field theory duals, JHEP 0603\n(2006) 101 [arXiv:hep-th/0512087]; J. P. Shock, Canonical coordinates and meson spectra for scalar deformed N = 4 SYM from the AdS/CFT correspondence,\narXiv:hep-th/0601025; R. Casero, C. Nunez and A. Paredes, Towards the string dual\nof N = 1 SQCD-like theories, arXiv:hep-th/0602027; T. Hirayama, A holographic\ndual of CFT with flavor on de Sitter space, arXiv:hep-th/0602258.\n[12] M. Kruczenski, L. A. Pando Zayas, J. Sonnenschein and D. Vaman, Regge trajectories\n28\n\n\ffor mesons in the holographic dual of large-N(c) QCD, JHEP 0506, 046 (2005);\nhep-th/0410035.\n[13] D. Bak and H. U. Yee, Separation of spontaneous chiral symmetry breaking\nand confinement via AdS/CFT correspondence, Phys. Rev. D 71 (2005) 046003\n[arXiv:hep-th/0412170].\n[14] R. Casero, A. Paredes and J. Sonnenschein, Fundamental matter, meson spectroscopy and non-critical string / gauge duality, JHEP 0601, 127 (2006)\n[arXiv:hep-th/0510110].\n[15] K. Peeters, J. Sonnenschein and M. Zamaklar, Holographic decays of largespin mesons, JHEP 0602, 009 (2006) [arXiv:hep-th/0511044]; A. L. Cotrone,\nL. Martucci and W. Troost, String splitting and strong coupling meson decay,\narXiv:hep-th/0511045.\n[16] J. H. Brodie and A. Hanany, Type IIA superstrings, chiral symmetry, and N = 1 4D\ngauge theory dualities, Nucl. Phys. B 506, 157 (1997) [arXiv:hep-th/9704043].\n[17] T. Sakai and S. Sugimoto, Low energy hadron physics in holographic QCD, Prog.\nTheor. Phys. 113, 843 (2005); hep-th/0412141.\n[18] T. Sakai and S. Sugimoto, More on a holographic dual of QCD; hep-th/0507073.\n[19] N. Itzhaki, J. M. Maldacena, J. Sonnenschein and S. Yankielowicz, Supergravity and\nthe large N limit of theories with sixteen supercharges, Phys. Rev. D 58, 046004\n(1998) [arXiv:hep-th/9802042].\n[20] E. Antonyan, J. A. Harvey, S. Jensen and D. Kutasov, NJL and QCD from string\ntheory, arXiv:hep-th/0604017.\n[21] A. Brandhuber, N. Itzhaki, J. Sonnenschein and S. Yankielowicz, Wilson loops, confinement, and phase transitions in large N gauge theories from supergravity, JHEP\n9806, 001 (1998); hep-th/9803263.\n[22] Y. Kinar, E. Schreiber and J. Sonnenschein, Q anti-Q potential from strings in\ncurved spacetime: Classical results, Nucl. Phys. B 566, 103 (2000); hep-th/9811192.\n[23] S. R. Coleman and E. Witten, Chiral symmetry breakdown in large N chromodynamics, Phys. Rev. Lett. 45, 100 (1980).\n[24] F. Wilczek, Diquarks as inspiration and as objects, arXiv:hep-ph/0409168.\n\n29\n\n\f[25] J. M. Maldacena and A. Strominger, AdS(3) black holes and a stringy exclusion\nprinciple, JHEP 9812 (1998) 005 [arXiv:hep-th/9804085].\n[26] J. M. Maldacena, Wilson loops in large N field theories, Phys. Rev. Lett. 80, 4859\n(1998) [arXiv:hep-th/9803002].\n[27] S. J. Rey and J. T. Yee, Macroscopic strings as heavy quarks in large N\ngauge theory and anti-de Sitter supergravity, Eur. Phys. J. C 22, 379 (2001)\n[arXiv:hep-th/9803001].\n[28] O. Aharony, S. Minwalla and T. Wiseman, unpublished.\n[29] O. Aharony, J. Marsano, S. Minwalla, K. Papadodimas, M. Van Raamsdonk and\nT. Wiseman, The phase structure of low dimensional large N gauge theories on tori,\nJHEP 0601, 140 (2006) [arXiv:hep-th/0508077].\n[30] F. Neri and A. Gocksch, Chiral symmetry restoration in large N QCD at finite\ntemperature, Phys. Rev. D 28, 3147 (1983).\n[31] R. D. Pisarski, Finite temperature QCD at large N, Phys. Rev. D 29, 1222 (1984).\n[32] A. Parnachev and D. A. Sahakyan, Chiral phase transition from string theory,\narXiv:hep-th/0604173.\n[33] R. Narayanan and H. Neuberger, Phases of planar QCD on the torus, PoS LAT2005\n(2005) 005 [arXiv:hep-lat/0509014].\n[34] S. Kuperstein and J. Sonnenschein, Non-critical supergravity (d > 1) and holography,\nJHEP 0407, 049 (2004) [arXiv:hep-th/0403254].\n[35] I. R. Klebanov and A. A. Tseytlin, D-branes and dual gauge theories in type 0\nstrings, Nucl. Phys. B 546 (1999) 155 [arXiv:hep-th/9811035].\n[36] S. Kuperstein and J. Sonnenschein, Non-critical, near extremal AdS6 background as\na holographic laboratory of four dimensional YM theory, JHEP 0411, 026 (2004);\nhep-th/0411009.\n\n30\n\n\f"}