{"id": "http://arxiv.org/abs/hep-th/0611098v2", "guidislink": true, "updated": "2007-11-15T02:19:54Z", "updated_parsed": [2007, 11, 15, 2, 19, 54, 3, 319, 0], "published": "2006-11-09T19:31:38Z", "published_parsed": [2006, 11, 9, 19, 31, 38, 3, 313, 0], "title": "The arrow of time, black holes, and quantum mixing of large N Yang-Mills\n  theories", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-th%2F0611330%2Chep-th%2F0611279%2Chep-th%2F0611010%2Chep-th%2F0611289%2Chep-th%2F0611341%2Chep-th%2F0611323%2Chep-th%2F0611015%2Chep-th%2F0611248%2Chep-th%2F0611351%2Chep-th%2F0611294%2Chep-th%2F0611020%2Chep-th%2F0611018%2Chep-th%2F0611161%2Chep-th%2F0611036%2Chep-th%2F0611326%2Chep-th%2F0611213%2Chep-th%2F0611268%2Chep-th%2F0611287%2Chep-th%2F0611142%2Chep-th%2F0611309%2Chep-th%2F0611004%2Chep-th%2F0611263%2Chep-th%2F0611200%2Chep-th%2F0611148%2Chep-th%2F0611139%2Chep-th%2F0611276%2Chep-th%2F0611014%2Chep-th%2F0611122%2Chep-th%2F0611245%2Chep-th%2F0611278%2Chep-th%2F0611147%2Chep-th%2F0611295%2Chep-th%2F0611324%2Chep-th%2F0611144%2Chep-th%2F0611120%2Chep-th%2F0611143%2Chep-th%2F0611345%2Chep-th%2F0611237%2Chep-th%2F0611098%2Chep-th%2F0611069%2Chep-th%2F0611066%2Chep-th%2F0611297%2Chep-th%2F0611056%2Chep-th%2F0611265%2Chep-th%2F0611241%2Chep-th%2F0611032%2Chep-th%2F0611292%2Chep-th%2F0611094%2Chep-th%2F0611104%2Chep-th%2F0611136%2Chep-th%2F0611195%2Chep-th%2F0611246%2Chep-th%2F0611166%2Chep-th%2F0611167%2Chep-th%2F0611232%2Chep-th%2F0611215%2Chep-th%2F0611288%2Chep-th%2F0611214%2Chep-th%2F0611009%2Chep-th%2F0611328%2Chep-th%2F0611048%2Chep-th%2F0611099%2Chep-th%2F0611029%2Chep-th%2F0611163%2Chep-th%2F0611034%2Chep-th%2F0611339%2Chep-th%2F0611003%2Chep-th%2F0611131%2Chep-th%2F0611171%2Chep-th%2F0611011%2Chep-th%2F0611347%2Chep-th%2F0611108%2Chep-th%2F0611216%2Chep-th%2F0611075%2Chep-th%2F0611005%2Chep-th%2F0611254%2Chep-th%2F0611225%2Chep-th%2F0611283%2Chep-th%2F0611194%2Chep-th%2F0611310%2Chep-th%2F0611230%2Chep-th%2F0611123%2Chep-th%2F0611228%2Chep-th%2F0611059%2Chep-th%2F0611343%2Chep-th%2F0611135%2Chep-th%2F0611252%2Chep-th%2F0611041%2Chep-th%2F0611284%2Chep-th%2F0611316%2Chep-th%2F0611141%2Chep-th%2F0611336%2Chep-th%2F0611006%2Chep-th%2F0611269%2Chep-th%2F0611275%2Chep-th%2F0611076%2Chep-th%2F0611308%2Chep-th%2F0611180%2Chep-th%2F0611062%2Chep-th%2F0611028%2Chep-th%2F0611174&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The arrow of time, black holes, and quantum mixing of large N Yang-Mills\n  theories"}, "summary": "Quantum gravity in an AdS spacetime is described by an SU(N) Yang-Mills\ntheory on a sphere, a bounded many-body system. We argue that in the high\ntemperature phase the theory is intrinsically non-perturbative in the large N\nlimit. At any nonzero value of the 't Hooft coupling $\\lambda$, an\nexponentially large (in N^2) number of free theory states of wide energy range\n(of order N) mix under the interaction. As a result the planar perturbation\ntheory breaks down. We argue that an arrow of time emerges and the dual string\nconfiguration should be interpreted as a stringy black hole.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-th%2F0611330%2Chep-th%2F0611279%2Chep-th%2F0611010%2Chep-th%2F0611289%2Chep-th%2F0611341%2Chep-th%2F0611323%2Chep-th%2F0611015%2Chep-th%2F0611248%2Chep-th%2F0611351%2Chep-th%2F0611294%2Chep-th%2F0611020%2Chep-th%2F0611018%2Chep-th%2F0611161%2Chep-th%2F0611036%2Chep-th%2F0611326%2Chep-th%2F0611213%2Chep-th%2F0611268%2Chep-th%2F0611287%2Chep-th%2F0611142%2Chep-th%2F0611309%2Chep-th%2F0611004%2Chep-th%2F0611263%2Chep-th%2F0611200%2Chep-th%2F0611148%2Chep-th%2F0611139%2Chep-th%2F0611276%2Chep-th%2F0611014%2Chep-th%2F0611122%2Chep-th%2F0611245%2Chep-th%2F0611278%2Chep-th%2F0611147%2Chep-th%2F0611295%2Chep-th%2F0611324%2Chep-th%2F0611144%2Chep-th%2F0611120%2Chep-th%2F0611143%2Chep-th%2F0611345%2Chep-th%2F0611237%2Chep-th%2F0611098%2Chep-th%2F0611069%2Chep-th%2F0611066%2Chep-th%2F0611297%2Chep-th%2F0611056%2Chep-th%2F0611265%2Chep-th%2F0611241%2Chep-th%2F0611032%2Chep-th%2F0611292%2Chep-th%2F0611094%2Chep-th%2F0611104%2Chep-th%2F0611136%2Chep-th%2F0611195%2Chep-th%2F0611246%2Chep-th%2F0611166%2Chep-th%2F0611167%2Chep-th%2F0611232%2Chep-th%2F0611215%2Chep-th%2F0611288%2Chep-th%2F0611214%2Chep-th%2F0611009%2Chep-th%2F0611328%2Chep-th%2F0611048%2Chep-th%2F0611099%2Chep-th%2F0611029%2Chep-th%2F0611163%2Chep-th%2F0611034%2Chep-th%2F0611339%2Chep-th%2F0611003%2Chep-th%2F0611131%2Chep-th%2F0611171%2Chep-th%2F0611011%2Chep-th%2F0611347%2Chep-th%2F0611108%2Chep-th%2F0611216%2Chep-th%2F0611075%2Chep-th%2F0611005%2Chep-th%2F0611254%2Chep-th%2F0611225%2Chep-th%2F0611283%2Chep-th%2F0611194%2Chep-th%2F0611310%2Chep-th%2F0611230%2Chep-th%2F0611123%2Chep-th%2F0611228%2Chep-th%2F0611059%2Chep-th%2F0611343%2Chep-th%2F0611135%2Chep-th%2F0611252%2Chep-th%2F0611041%2Chep-th%2F0611284%2Chep-th%2F0611316%2Chep-th%2F0611141%2Chep-th%2F0611336%2Chep-th%2F0611006%2Chep-th%2F0611269%2Chep-th%2F0611275%2Chep-th%2F0611076%2Chep-th%2F0611308%2Chep-th%2F0611180%2Chep-th%2F0611062%2Chep-th%2F0611028%2Chep-th%2F0611174&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Quantum gravity in an AdS spacetime is described by an SU(N) Yang-Mills\ntheory on a sphere, a bounded many-body system. We argue that in the high\ntemperature phase the theory is intrinsically non-perturbative in the large N\nlimit. At any nonzero value of the 't Hooft coupling $\\lambda$, an\nexponentially large (in N^2) number of free theory states of wide energy range\n(of order N) mix under the interaction. As a result the planar perturbation\ntheory breaks down. We argue that an arrow of time emerges and the dual string\nconfiguration should be interpreted as a stringy black hole."}, "authors": ["Guido Festuccia", "Hong Liu"], "author_detail": {"name": "Hong Liu"}, "author": "Hong Liu", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/1126-6708/2007/12/027", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/hep-th/0611098v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-th/0611098v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "50 pages 3 figures uses harvmac", "arxiv_primary_category": {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-th/0611098v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-th/0611098v2", "journal_reference": "JHEP0712:027,2007", "doi": "10.1088/1126-6708/2007/12/027", "fulltext": "arXiv:hep-th/0611098v2 15 Nov 2007\n\nhep-th/0611098\nMIT-CTP-3783\n\nThe arrow of time, black holes,\nand quantum mixing of large N Yang-Mills theories\n\nGuido Festuccia and Hong Liu\nCenter for Theoretical Physics\nMassachusetts Institute of Technology\nCambridge, Massachusetts, 02139\n\nQuantum gravity in an AdS spacetime is described by an SU (N ) Yang-Mills theory\non a sphere, a bounded many-body system. We argue that in the high temperature phase\nthe theory is intrinsically non-perturbative in the large N limit. At any nonzero value\nof the 't Hooft coupling λ, an exponentially large (in N 2 ) number of free theory states\nof wide energy range (or order N ) mix under the interaction. As a result the planar\nperturbation theory breaks down. We argue that an arrow of time emerges and the dual\nstring configuration should be interpreted as a stringy black hole.\n\nOct. 27, 2006\n\n\f1. Introduction\nWhile the equations of general relativity are time symmetric themselves, one often\nfinds solutions with an intrinsic arrow of time, due to the presence of spacelike singularities. Familiar examples include FRW cosmologies and the formation of a black hole in\na gravitational collapse. In the case of a gravitational collapse to form a black hole, the\ndirection of time appears to be thermodynamic, since a black hole behaves like a thermodynamical system [1,2,3]. It has also long been speculated that the thermodynamic arrow\nof time observed in nature may be related to the big bang singularity [4].\nIn an anti-de Sitter (AdS) spacetime, a microscopic understanding of the emergence of\nthermodynamic behavior in a gravitational collapse can be achieved using the AdS/CFT\ncorrespondence [5,6,7], which states that quantum gravity in an asymptotic AdS5 × S 5\nspacetime is described by an N = 4 SU (N ) super-Yang-Mills (SYM) theory on an S 3 .\n\nThe classical gravity limit of the AdS string theory corresponds to the large N and\n\nlarge 't Hooft coupling limit of the Yang-Mills theory. A matter distribution of classical\nmass M in AdS, can be identified1 with an excited state of energy E = μN 2 in the SYM\ntheory with μ a constant independent of N . The gravitational collapse of the matter\ndistribution can be identified with the thermalization of the corresponding state in SYM\ntheory, with the resulting black hole2 identified with thermal equilibrium [8,9]. In this\ncontext, it is natural to suspect that the appearance of a spacelike singularity at the end\npoint of a collapse should be related to certain aspect of thermalization in the SYM theory3\nA crucial element in the above description is the large N limit. N = 4 SYM theory on\n\nS 3 is a closed, bounded quantum mechanical system with a discrete energy spectrum. At\n\nany finite N , no matter how large, such a theory is quasi-periodic (i.e. has recurrences), time\nreversible, and never really thermalizes. However, to match the picture of a gravitational\ncollapse in classical gravity, an arrow of time should emerge in the large N limit for the\nSYM theory in a generic state of energy E = μN 2 with a sufficiently large μ. This\nconsistency requirement immediately raises several questions:\n1. What is the underlying physical mechanism for the emergence of an arrow of time in\nYang-Mills theory?\n1\n\nSee Appendix A for a brief review of parameter translations in AdS/CFT.\n\n2\n\nAssume M is sufficiently big that a big black holes in AdS is formed, which also implies that\n\nμ should be sufficiently big.\n3\n\nSome interesting ideas regarding spacelike singularities and thermalization have also been\n\ndiscussed recently in [10].\n\n1\n\n\f2. Is large 't Hooft coupling needed?\n3. Suppose an arrow of time also emerges at small 't Hooft coupling, what would be\nthe bulk string theory interpretation of the SYM theory in such an excited state? A\nstringy black hole? Does such a stringy black hole have a singularity?\n4. Is there a large N phase transition as one decreases the 't Hooft coupling from infinity\nto zero?\nIt would be very desirable to have a clear physical understanding of the above questions,\nwhich could shed light on how spacelike singularities appear in the classical limit of a\nquantum gravity and thus lead to an understanding of their resolution in a quantum\ntheory.\nThe emergence of an arrow of time is also closely related to the information loss\nparadox4 . At finite N , the theory is unitary and there is no information loss. But in\nthe large N limit, an arrow of time emerges and the information is lost, since one cannot\nrecover the initial state from the final thermal equilibrium. Thus the information loss\nin a gravitational collapse is clearly a consequence of the classical approximation (large\nN limit), but not a property of the full quantum theory. While AdS/CFT in principle\nresolves the information loss paradox, it remains a puzzle whether one can recover the\nlost information using a semi-classical reasoning5 . From this perspective it would also be\nvaluable to understand the various questions listed in the last paragraph.\nThe purpose of the paper is to suggest a simple mechanism for the emergence of an\narrow of time in the large N limit and to initiate a statistical approach to understanding\nthe quantum dynamics of a YM theory in highly excited states. In particular, we argue\nthat the perturbative planar expansions break down for real-time correlation functions and\nthat there is a large N \"phase transition\" at zero 't Hooft coupling6 . We also argue that\ntime irreversibility occurs for any nonzero value of the 't Hooft coupling.\nThe plan of the paper is as follows. In section 2 we introduce the subject of our study:\na family of matrix quantum mechanical systems including N = 4 SYM on S 3 . We highlight\nsome relevant features of the energy spectrum of these theories. Motivated by the classical\nmixing properties, we introduce observables which could signal time irreversibility. The\nsimplest of them are real-time correlation functions at finite temperature, which describe\n4\n\nTo our knowledge this connection was first pointed out in the context of AdS/CFT in [9].\n\n5\n\nSee e.g. [9,11,12,13,14,15,16,17] for recent discussions.\n\n6\n\nSee [18,19] for some earlier discussion of a possible large N phase transition in λ.\n\n2\n\n\fnon-equilibrium linear responses of the systems. The rest of the paper is devoted to\nstudying these observables, first in perturbation theory, and then using a non-perturbative\nstatistical method. In sec 3 we compute real-time correlation functions in perturbation\ntheory. We find that at any finite order in perturbation theory, the arrow of time does\nnot emerge. In sec 4 we argue that the planar perturbative expansion has a zero radius of\nconvergence and cannot be used to understand the long time behavior of the system. In\nsection 5 we give a simple physical explanation for the breakdown of perturbation theory.\nWe argue that for any nonzero 't Hooft coupling, an exponentially large (in N 2 ) number\nof free theory states of wide energy range (or order N ) mix under the interaction. As a\nconsequence small λ and long time limits do not commute at infinite N . In section 6 we\ndevelop a statistical approach to studying the dynamics of the theories in highly excited\nstates, which indicates that time irreversibility occur for any nonzero 't Hooft coupling λ.\nWe conclude in section 7 with a discussion of implications of our results.\n\n2. Prelude: theories and observables of interest\nIn this section we introduce the systems and observables we want to study.\n2.1. Matrix mechanical systems\nWe consider generic matrix quantum mechanical systems of the form\nS = N tr\n\nZ\n\ndt\n\n\u0014X \u0012\nα\n\n1\n1\n(Dt Mα )2 − ωα2 Mα2\n2\n2\n\n\u0013\u0015\n\n−\n\nZ\n\ndt V (Mα ; λ)\n\n(2.1)\n\nwhich satisfy the following requirements:\n1. Mα are N × N matrices and Dt Mα = ∂t − i[A, Mα ] is a covariant derivative. One can\nalso include fermionic matrices, but they will not play an important role in this paper\nand for simplicity of notations we suppress them.\n2. The frequencies ωα in (2.1) are nonzero for any α, i.e. the theory has a mass gap and\na unique vacuum.\n3. The number of matrices is greater than one and can be infinite. When there is an infinite number of matrices, we require the theory to be obtainable from a renormalizable\nfield theory on a compact space.\n4. V (Mα ; λ) can be written as a sum of single-trace operators and is controlled by a\ncoupling constant λ, which remains fixed in the large N limit.\n3\n\n\fN = 4 SYM on S 3 is an example of such systems with an infinite number of matrices\n\n(including fermions) when the Yang-Mills and matter fields are expanded in terms of\nspherical harmonics on S 3 (see e.g. [20,21]). In this case, ωα are integer or half-integer\nmultiples of a fundamental frequency ω0 = 1/R with R the radius of the S 3 . The number of\nmodes with frequencies ωα =\n\nk\nR\n\nincreases with k as a power. V (Mα ; λ) can be schematically\n\n7\n\nwritten as\n\nV =N\n\n\u0010√\n\nλV3 (Mα ) + λV4 (Mα )\n\n\u0011\n\n(2.2)\n\nwhere V3 and V4 contain infinite sums of single-trace operators which are cubic and quartic\nin Mα and ∂t Mα . λ = gY2 M N is the 't Hooft coupling.\nIn this paper we work in the large N limit throughout. Our discussion will only depend\non the large N scaling of various physical quantities and not on the specific structure of\nthe theories in (2.1) like the precise field contents and exact forms of interactions. For\npurpose of illustration, we will often use as a specific example the following simple system\nZ\n\u0002\n\u0003\nN\n(2.3)\nS = tr dt (Dt M1 )2 + (Dt M2 )2 − ω02 (M12 + M22 ) − λM1 M2 M1 M2 .\n2\n2.2. Energy spectrum\n(2.1) has a U (N ) gauge symmetry and physical states are singlets of U (N ). One can\nclassify energy eigenstates of a theory by how their energies scale with N in the large N\nlimit. We will call the sector of states whose energies (as measured from the vacuum)\nare of order O(1) the low energy sector. As motivated in the introduction, we are mainly\ninterested in the sector of states whose energies are of order μN 2 with μ independent of\nN , which will be called the high energy sector. The density of states in the low energy\nsector is of order O(1), i.e. independent of N , while that of the high energy sector can be\nwritten in a form\n2\n\nΩ(E) ∼ es(μ)N ,\n\nE = μN 2\n\n(2.4)\n\nwith s(μ) some function independent of N . (2.4) follows from the fact that the number of\nways to construct a state of energy of order O(N 2 ) from O(N 2 ) oscillators of frequency of\nO(1) is an exponential in N 2 . The presence of interaction should not change this behavior\n7\n\nThe precise form of the interactions depends on the choice of gauge. It is convenient to\n~ = 0, in which the longitudinal component of the gauge field is set\nchoose Coulomb gauge ∇ * A\nto zero. In this gauge, Mα include also non-propagating modes coming from harmonic modes of\nghosts and the zero component of the gauge field.\n\n4\n\n\fat least for μ sufficiently large. (2.4) is the reason why we restrict to more than one matrix\nin (2.1). For a gauged matrix quantum mechanics with a single matrix one can reduce\nthe matrix to its eigenvalues and (2.4) does not apply. When μ is sufficiently large, s(μ)\nshould be a monotonically increasing function8 of μ and we will restrict our definition of\nhigh energy sector to such energies.\nFor N = 4 SYM, states in the low energy sector correspond to fundamental string\n\nstates in the AdS spacetime, while the states in the high energy sectors may be considered\nas black hole microstates9 .\n\nA convenient way to study a system in excited states is to put it in a canonical\nensemble with a temperature T =\n\n1\nβ.\n\nThe partition function and free energy are defined\n\nby (Tr denotes sum over all physical states and H is the Hamiltonian)\nZ = Tre−βH = e−βF .\n\n(2.5)\n\nWe will always keep T fixed in the large N limit. Below low and high temperature refers to\nhow the temperature is compared with the mass gap of a theory10 . As one varies T , different parts of the energy spectrum are probed. For the family of matrix quantum mechanical\nsystems (2.1), there are two distinct temperature regimes. At low temperature, one probes\nthe low energy sector and the free energy F is of order O(1). At high temperature F is of\norder O(N 2 ) and the high energy sector is probed. It may seem surprising at first sight\nthat one can probe the sector of energies of O(N 2 ) using a temperature of O(1). This is\ndue to the large entropy factor (2.4) which compensates the Boltzmann suppression. For\nN = 4 SYM theory at strong coupling, there is a first order phase transition separating\n\nthe two regimes at a temperature of order 1/R, where R is the AdS radius [22,6,8]. A first\norder phase transition has also been found for various theories in the family of (2.1) at\nweak coupling [23,24,21].\n\nAn important feature of the high energy sector is that the large N limit is like a\nthermodynamic limit with N 2 playing the analogous role of the volume factor. In this\nlimit the number of degrees of freedom goes to infinity while the average excitations per\ndegree of freedom remain finite. The thermal partition function\nZ\n−βH\nZ(β) = Tre\n= dE Ω(E)e−βE\n\n(2.6)\n\n8\n\nThat is, the theory should have a positive specific heat for μ sufficiently large.\n\n9\n\nNote that at a sufficiently high energy, the most entropic object in AdS is a big black hole.\n\n10\n\nFor example for N = 4 SYM on S 3 , low (high) temperature means T ≪\n\n5\n\n1\nR\n\n(T ≫\n\n1\n)\nR\n\n\fis sharply peaked at an energy Eβ ∼ O(N 2 ) (with a width of order O(N )) determined by\n∂S(E)\n∂E\n\n= β,\n\nS(E) = log Ω(E)\n\n(2.7)\n\nEβ\n\nNote that the leading N dependence of S(E) has the form S(E) = N 2 s(μ) (see (2.4)) with\nμ = E/N 2 characterizing the average excitations per oscillator degree of freedom. Equation\n(2.7) can also be interpreted as the equivalence between canonical and microcanonical\nensemble11 . Note that since F ∼ O(N 2 ), the high temperature phase can be considered a\n\n\"deconfined\" phase [25,8].\n2.3. Observables\n\nIn a classical Hamiltonian system, time irreversibility is closely related with the mixing\nproperty of the system, which can be stated as follows. Consider time correlation functions\nCAB (t) = A(Φt X)B(X) − hAi hBi\n\n(2.8)\n\nwhere A, B are functions on the classical phase space parameterized by X. Φt X describes\nthe Hamiltonian flow, where Φt is a one-parameter group of volume-preserving transformations of the phase space onto itself. h...i in (2.8) denotes phase space average over a\n\nconstant energy surface. The system is mixing12 iff [26]\nCAB (t) → 0,\n\nt→∞\n\n(2.9)\n\nfor any smooth L2 functions A and B.\nThe closest analogue of (2.8) for the matrix quantum mechanical systems we are\nconsidering would be\n2\n\nGi (t) = hi|O(t)O(0)|ii − hi|O(0)|ii\n11\n\n(2.10)\n\nIn contrast in the low energy sector, since both the free energy and the density of states are\n\nindependent of N , in generic models there is no large parameter that one can use to perform the\nsaddle point approximation to equate two ensembles.\n12\n\nNote that mixing is a stronger property than ergodic which involves long time average. The\n\nergodic and mixing properties can also be characterized in terms of the spectrum of the Koopman\noperator. For example, a system is mixing iff the eigenvalue 1 is simply degenerate and is the\nonly proper eigenvalue of the Koopman operator [26].\n\n6\n\n\fwhere |ii is a generic energy eigenstate in the high energy sector, and O is an arbitrary\ngauge invariant operator which when acting on the vacuum creates a state of finite energy\n\nof order O(1). More explicitly, denoting |ψO i = O(0) |Ωi with |Ωi the vacuum, we require\nhψO |H|ψO i ∼ O(1). Note that for N = 4 SYM on S 3 , a local operator O(t, ~x) of dimension\n\nO(1) on S 3 is not allowed by this criterion since O(t, ~x) creates a state of infinite energy. To\nconstruct a state of finite energy one can smear the local operator over a spatial volume,\ne.g. by considering operators with definite angular momentum on S 3 . Without loss of\ngenerality, we can take O to be of the form\nO = tr(Mα1 * * * Mαn1 )tr(Mβ1 * * * Mβn2 ) * * * tr(Mγ1 * * * Mγnk )\nwith the total number of matrices K =\n\nPk\n\ni=1\n\n(2.11)\n\nnk independent of N . We will call such\n\noperators small operators. The reason for restricting to small operators is that they have\na well defined large N limit in the sense defined in [27]. More explicitly, if one treats\nthe large N limit of a matrix quantum mechanics as a classical system, then (2.11) with\nK ∼ O(1) are smooth functions on the corresponding classical pase space. From AdS point\n\nof view, such operators correspond to fundamental string probes which do not deform the\nbackground geometry. If for all small operators O and generic states |ii in the high energy\nsector\n\nGi (t) → 0,\n\nt→∞\n\n(2.12)\n\none can say the system develops an arrow of time. In particular, (2.12) implies that one\ncannot distinguish different initial states from their long time behavior (i.e. information is\nlost).\nEnergy eigenstates are hard to work with. It is convenient to consider microcanonical or canonical averages of (2.10), for example, the thermal connected Wightman functions (see Appendix B.1 for a precise definition of \"connected\" and the constant C below)\nG+ (t) = hO(t)O(0)iβ =\n\n\u0001\n1\nTr e−βH O(t)O(0) − C\nZ\n\n(2.13)\n\nor retarded functions\n\n\u0001\n1\nTr e−βH [O(t), O(0)] .\n(2.14)\nZ\nWe shall take the temperature T to be sufficiently high so that Eβ determined from (2.7)\nGR (t) =\n\nlies the high energy sector. Equation (2.12) implies that13\nGR (t) → 0,\n13\n\nG+ (t) → 0,\n\nt → +∞ .\n\n(2.12) in fact implies the following to be true for any ensemble of states.\n\n7\n\n(2.15)\n\n\fNote that GR (t) measures the linear response of the system to external perturbations\ncaused by O. That GR (t) → 0 for t → ∞ implies that any small perturbation of the\n\nsystem away from the thermal equilibrium eventually dies away. In a weaker sense than\n(2.12), (2.15) can also be considered as an indication of the emergence of an arrow of time.\nIn frequency space, the Fourier transform14 of (2.13) and (2.14) can be written in\nterms of a spectral density function ρ(ω) (see Appendix B.1 for a review)\n1\nρ(ω)\n1 − e−βω\nZ ∞\nρ(ω ′ )\ndω ′\nGR (ω) = −\n′\n−∞ 2π ω − ω + iǫ\n\nG+ (ω) =\n\n(2.16)\n\n(2.15) may be characterized by properties of the spectral density ρ(ω). For example from\nthe Riemann-Lebesgue theorem, (2.15) should hold if ρ(ω) is an integrable function on the\nreal axis. Since other real-time correlation functions can be obtained from G+ (or spectral\ndensity function ρ(ω)) from standard relations, for the rest of the paper, we will focus on\nG+ only.\nFor N = 4 SYM at strong coupling, it is convenient to take O to have a definite\n\nangular momentum l on S 3 . (2.13) and (2.14) can be studied by considering a bulk field\npropagating in an eternal AdS black hole geometry and one does find the behavior (2.15)\nas first emphasized in [9]. In the bulk language, (2.15) can be heuristically interpreted\nas the fact that any small perturbation of the black hole geometry eventually dies away\nby falling into the horizon. Furthermore, by going to frequency space, one finds that the\nFourier transform G+ (ω, l) has a rich analytic structure in the complex ω-plane15 , which\nencodes that the bulk black hole geometry contains a horizon and singularities. The main\nfeatures can be summarized as follows [28]:\n1. G+ (ω, l) has a continuous spectrum with ω ∈ (−∞, +∞). This is due to the presence\nof the horizon in the bulk.\n\n2. In the complex ω-plane, the only singularities of G+ (ω, l) are poles. The decay rate\nfor G+ (t) at large t is controlled by the imaginary part of the poles closest to the real\naxis, which is of order β.\n14\n\nWe use the same letter to denote the Fourier transform of a function, distinguishing them\n\nby the argument of the function.\n15\n\nSimilar things can also said about GR (ω, l) which can be obtained from G+ (ω, l) using stan-\n\ndard relations.\n\n8\n\n\f3. The presence of black hole singularities in the bulk geometry is encoded in the behavior\nof G+ (ω, l) at the imaginary infinity of the ω-plane16 . In particular,\n3a. G+ (ω, l) decays exponentially as ω → ±i∞.\n\n3b. Derivatives of G+ (ω, l) over l evaluated at l = 0 are divergent as ω → ±i∞.\n\nAs emphasized in [28], none of the above features survives at finite N , in which case17\nG+ (ω) = 2π\n\nX\n\nm,n\n\ne−βEm ρmn δ(ω − En + Em )\n\nhas a discrete spectrum and is a sum of delta functions supported on the real axis. This\nindicates that concepts like horizon and singularities only have an approximate meaning\nin a semi-classical limit (large N limit).\nTo understand the information loss paradox and the resolution of black hole singularities, we need to understand how and why they arise in the classical limit of a quantum\ngravity. In Yang-Mills theory, this boils down to understanding what physics is missed in\nthe large N limit and why missing it is responsible for the appearance of singularities and\nthe loss of information. With these motivations in mind, in this paper we are interested\nin understanding the following questions\n1. Can one find a qualitative argument for the emergence of an arrow of time in the large\nN limit?\n2. Does the analytic behavior observed at strong coupling persist to weak coupling?\nwhich we turn to in the following sections.\n\n3. Non-thermalization in perturbation theory\nIn this section we consider (2.13) in perturbation theory in the planar limit. We will\nfind that real-time correlation functions have a discrete spectrum and oscillatory behavior.\nThus the theory does not thermalize in the large N limit.\nIn perturbation theory, G+ (t) can be computed using two methods. In the first\nmethod, one computes GE (τ ) with 0 < τ < β in Euclidean space using standard Feynman\n16\n\nSee also [29] for signature of the black hole singularities in coordinate space.\n\n17\n\nNote that even though N = 4 SYM on S 3 is a field theory, at finite N the theory can be\n\neffectively considered as a theory with a finite number of degrees of freedom, since for any given\nenergy E, there are only a finite number of modes below that energy. Furthermore, given that the\nnumber of modes with frequency\n\nk\nR\n\ngrows with k only as a power, it is more entropically favorable\n\nto excite modes with low k for E ∼ O(N 2 ) and modes with ωα ∼ O(N ) are almost never excited.\n\n9\n\n\fdiagram techniques. G+ (t) can then be obtained by taking τ = it + ǫ. An alternative way\nis to double the fields and use the analogue of the Schwinger-Keldysh contour to compute\nthe Feynman function GF (ω) in frequency space [30], from which G+ (ω) can be obtained.\nIn the Euclidean-time method it is more convenient to do the computation in coordinate\nspace since one does not have to sum over discrete frequencies, while in the real-time\nmethod frequency space is more convenient to use.\nWe look at the free theory first.\n3.1. Free theory\nTo evaluate (2.13) in free theory, it is convenient to use the Euclidean method. The\nEuclidean correlator\n(0)\n\nGE (τ ) = hO(τ )O(0)i0,β ,\n\n0≤τ <β\n\n(3.1)\n\nwith O of the form (2.11) can be computed using the Wick contraction18\nδα α\n= 1 2\nN\n}\n\nα2\nα1\n(0)\n(τ ) Mkl\nMij\n\n(0)\n\n|\n\n{z\n\n∞\nX\n\n(0)\n\nm=−∞\n\nm\ngE (τ − mβ; ωα1 )Uil−m Ukj\n\n(3.2)\n\nwhere gE is the propagator at zero temperature\n(0)\n\ngE (τ ; ω) =\n\n1 −ω|τ |\ne\n.\n2ω\n\n(3.3)\n\nIn (3.2) U is a unitary matrix which arises due to covariant derivatives in (2.1) and can be\nunderstood as the Wilson line of A wound around the τ direction. In the evaluation of free\ntheory correlation functions h* * *i0,β in (3.1), one first preforms the Wick contractions (3.2)\nand then performs the unitary matrix integral over U , which plays the role of projecting\n\nthe intermediate states to the singlet sector. In the large N limit, the U integral can be\nevaluated by a saddle point approximation. Note in particular that [24]\nU → 1,\n\nT →∞\n\n(3.4)\n\nEquation (3.4) indicates that the singlet condition should not play an important role for\nstates of sufficiently high energy.\n18\n\nsee e.g. [31] for a derivation of the following equation and some examples of correlation\n\nfunctions in free theory.\n\n10\n\n\fFor definiteness, we now restrict to theories with a single fundamental frequency ω0\nlike N = 4 SYM or (2.3). Relaxing this restriction does not affect our main conclusions,\n\nas will be commented on in various places below. Wick contractions in (3.1) give rise to\nterms of the form enω0 τ for some integer n, while the U -integral computes the coefficients\nof these terms. Thus (3.1) always has the form\n(0)\nGE (τ )\n\n=\n\n∆\nX\n\ncn (β)enω0 τ\n\n(3.5)\n\nn=−∆\n\nwhere ∆ is the dimension of the operator19 . Analytically continuing (3.5) to real time, we\nfind that\n(0)\nG+ (t)\n\n=\n\n∆\nX\n\ncn (β)e−inω0 t\n\n(3.6)\n\ncn (β)δ(ω − nω0 ) .\n\n(3.7)\n\nn=−∆\n\nand\n(0)\nG+ (ω)\n\n= 2π\n\n∆\nX\n\nn=−∆\n\nThus in the large N limit, the correlation function always shows a discrete spectrum\nis quasi-periodic. The results are generic. If the theory under consideration has several\nincommensurate fundamental frequencies, one simply includes a sum like those (3.5) and\n(3.7) for each such frequency. The maximal number of independent exponentials is 2K ,\nwhere K is the total number of matrices in O. This is due to that each matrix in O can\nonly connect states with a definite energy difference.\n\nIt is also instructive to obtain (3.6) using a different method. By inserting a complete\nset of free theory energy eigenstates in (2.13) we find that\n(0)\n\nG+ (t) =\n\n1 X −βǫa\ne\nρab ei(ǫa −ǫb )t\nZ0\n\n(3.8)\n\na,b\n\nwhere |ai is a free theory state with energy ǫa and ρab = | ha|O(0)|bi |2 . To understand\n\nthe structure of (3.8) we expand O(0) in terms of creation and annihilation operators\n\nassociated with each (Mα )ij , from which we find that\n\nA. Due to energy conservation, O can connect levels whose energy differences lie between\n−∆ω0 and ∆ω0 , i.e. ρab can only be non-vanishing for |ǫa − ǫb | < ∆ω0 .\n\n19\n\nNote that for N = 4 SYM the dimension of Mα is given by\n\nωα\n.\nω0\n\nFor other matrix quantum\n\nmechanical systems without conformal symmetry one can use a similar definition in free theory.\nFor bosonic operators, ∆ are integers.\n\n11\n\n\fB. O can only connect states whose energy differences are integer multiples of ω0 i.e. ρab\n\ncan only be non-vanishing for ǫa − ǫb = nω0 with |n| < ∆ integers (or half integers\n\nif O is fermionic). Similarly, in the cases where O contains K types of matrices of\nPK\ndifferent frequency ωi it can only connect states whose energy differs by i=1 ni ωi ,\n\nwhere ni are integers whose absolute values are bounded by the number of matrices\nof each type appearing in O.\n\nAs a result, (3.8) must have the form (3.6). Note that the argument based on (3.8) applies\nnot only to the thermal ensemble, but in fact to correlation functions in any density matrix\n(or pure state).\nTo summarize, one finds that in free theory a real-time thermal two-point function\nalways has a discrete spectrum and is quasi-periodic in the large N limit. This implies\nthat once one perturbs the theory away from thermal equilibrium, the system never falls\nback and keeps oscillating. This is not surprising since the system is free and there is no\ninteraction to thermalize any disturbance. Note that this is distinctly different from the\nbehavior (2.15) found at strong coupling. In particular, this implies that the bulk description of the high temperature phase in free theory looks nothing like a black hole. Also\nnote that the story here is very different from that of the orbifold CFT in the AdS3 /CFT2\ncorrespondence. There the mass gap in free theory goes to zero in the large N limit in the\nlong string sector [32]. As a result, one finds that free theory correlation functions in the\nlong string sector do resemble those from a BTZ black hole [9,33].\n3.2. Perturbation theory\nIn this subsection we use a simple example (2.3) for illustration. The general features\ndiscussed below apply to generic theories in (2.1) including N = 4 SYM.\nIn perturbation theory GE (τ ) can be expanded in terms of λ as\nGE (τ ) =\n\n∞\nX\n\n(n)\n\nλn GE (τ )\n\n(3.9)\n\nn=0\n(0)\n\nwhere GE is the free theory result. We will be only interestedRin the connected part of\nGE (τ ). Higher order corrections are obtained by expanding e−λ dτ V in the path integral\n(n)\n\nwith V given by the quartic term in (2.3). More explicitly, a typical contribution to GE (τ )\nin (3.9) has the form\n(−1)n\nn!\n\nZ\n\n0\n\nβ\n\ndτ1 * * *\n\nZ\n\n0\n\nβ\n\ndτn hO(τ )O(0) V (τ1 ) * * * V (τn )iβ,0\n12\n\n(3.10)\n\n\fThe free theory correlation function inside the integrals in (3.10) can be computed by first\nusing Wick contraction (3.2) and then doing the U integral. The general structure of (3.10)\ncan be summarized as follows:\n(n)\n\n1. The planar diagram contribution to GE (τ ) scales like N 0 , while diagrams of other\ntopologies give higher order 1/N 2 corrections. The number Rn of planar diagrams\ngrows like a power in n, i.e. is bounded by C n with C some finite constant [34].\n2. The τ -integrations are over a compact segment and are all well defined. A typical\nterm in (3.10) after the integration has the structure\n(n)\n\ngkj (β)τ l ekω0 τ\n\n(3.11)\n\nwhere l and k are integers. l can take values from 0 to n, while k from −2n − ∆ to\n\n2n + ∆ where ∆ is the dimension of O in free theory.\n\nAnalytically continuing (3.9) to Lorentzian time by taking τ = it + ǫ, we find\n∞\nX\n(n)\nG+ (t, λ) =\nλn G+ (t)\n(3.12)\nn=0\n\nwhere typical terms in\n\n(n)\nG+ (t)\n\nhave the t-dependence of the form\n(n)\n\ngkl (β)tl eikω0 t\n\n(3.13)\n\nwith the range of l and k given after equation (3.11). After Fourier transforming to\n(n)\n\nfrequency space we find that at each order in the perturbative expansion G+ (ω) (and\nthus the spectral density function ρ(ω)) consists of sums of terms of the form\n(n)\n\ngkl δ (l) (ω − kω0 )\n\n(3.14)\n\nwhere the superscript l denotes the number of derivatives.\nIf the theory has more than one fundamental frequencies, since the interaction vertices\nare traces of a finite number of matrices they only connect states with definite energy\ndifferences. More and more frequencies will appear in the spectrum of a correlation function\nas we go to higher and higher orders in the perturbative expansion. The increase in the\nnumber of frequencies is exponential in the order of the expansion but at any fixed finite\norder no matter how large the spectrum of the correlation functions is discrete.\nOne origin of tl terms in (3.13) is the shifting of frequency from the free theory value.\nFor example, suppose the free theory frequency is shifted to ω = ω0 + λω1 + * * *, one would\nget terms of the form (3.13) when expanding the exponential eiωt in λ. One can in principle\n\nimprove the perturbation theory by resumming such contributions using Dyson's equations.\nHowever, there appears no systematic way of doing this for a composite operator (3.4).\nIn Appendix B.2, we prove that real-time correlation functions of fundamental modes Mα\nagain have a discrete spectrum in the improved perturbative expansion.\n13\n\n\f4. Break down of Planar perturbation theory\nIt is well known that at zero temperature the planar expansion of a matrix quantum\nmechanics has a finite radius of convergence in the λ-plane (see e.g. [34] for a recent\ndiscussion and earlier references). If this persists at finite temperature, properties of the\ntheory at zero coupling or in perturbation theory should hold at least for the coupling\nconstant being sufficiently small. In particular, from our discussion of last section, one\nwould conclude that real-time correlation functions for generic gauge invariant operators\nshould be quasi-periodic and an arrow of time does not emerge at small 't Hooft coupling.\nIn this section, we argue that the planar perturbative expansion in fact breaks down for\nreal-time correlation functions and thus perturbation theory cannot be used to understand\nthe long-time behavior of the system at any nonzero coupling.\nFrom our discussion in section 3.2, we expect the Euclidean correlation function (3.9)\nshould have a finite radius of convergence for any given τ ∈ (0, β). After analytic continu-\n\nation to real time, the convergence of the expansion in Euclidean time implies that (3.12)\nshould have a finite radius λc (t) of convergence for any given t. However, it does not tell\nhow λc (t) changes with t in the limit t → ∞. In this section we argue that the radius of\nconvergence goes to zero in the large t limit. Note that the convergence of the perturbative\n(n)\n\nexpansion depends crucially on how gkl in (3.14) fall off with n. We will argue below that\nthe falloff is slow enough that perturbation theory breaks down in the long time limit. In\nfrequency space, one finds that n-th order term in the expansion grows like n!20 .\nWe will again use (2.3) as an illustration. The argument generalizes immediately to\ngeneric systems in (2.1). For simplicity, we will consider the high temperature limit (3.4)\nin which we can replace U in (3.2) by the identity matrix, e.g.\n\nwhere\n\n1\nM1ij (τ ) M1kl (0) =\n{z\n} N\n|\ngE (τ ; ω) =\n\nwith\n\n∞\nX\n\nm=−∞\n\n(0)\n\ngE (τ − mβ; ω0 )δil δkj =\n\n\u0001\n1\ne−ωτ (1 + f (ω)) + eωτ f (ω) ,\n2ω\nf (ω) =\n\n20\n\n1\n.\n−1\n\neβω\n\n1\nδil δkj gE (τ ; ω)\nN\n\n(4.1)\n\nτ ∈ (0, β)\n\n(4.2)\n\n(4.3)\n\nNote that in frequency space the relation between real-time and Euclidean correlation func-\n\ntions is not simple, since Euclidean correlation functions are only defined at discrete imaginary\nfrequencies.\n\n14\n\n\fNote that outside the range in (4.2), gE (τ ) is periodic.\nFor our purpose it is enough to examine the Wightman function for M1 ,\nD+ (t) =\n\n\u0001\n1\nTr e−βH M1 (t)M1 (0) .\nZ(β)\n\n(4.4)\n\nAn exactly parallel argument to that of the last section leads to the expansion\nD+ (t, λ) =\n\n∞\nX\n\n(n)\n\nλn D+ (t)\n\n(4.5)\n\nn=0\n(n)\n\nwhere typical terms in D+ (t) have the t-dependence of the form\n(n)\n\ndkl (β)tl eikω0 t\n\n(4.6)\n\n(n)\n\nThe convergence of series depends on how dkl fall off with n. For our purpose it is enough\nto concentrate on the term with the highest power t in each order, i.e. the coefficients of\ntn with given k. More explicitly, we will look at a term of the form\nD+ (t, λ) =\n\n(0)\nD+ (t)\n\n∞\nX\n\nn=0\n\ncn λn tn + * * *\n\n(4.7)\n\n(0)\n\nwhere D+ is the free theory expression.\nAs before we will first compute (4.7) in Euclidean time and then perform an analytic\ncontinuation. Calculating\ncn explicitly at each loop order for all n is of course impractical. Our strategy is as\nfollows. We will identify a family (in fact infinite families as we will see below) of planar\nFeynman diagrams of increasing loop order and show that their contribution to cn falls\noff like a power in n. Barring any unforseen magical cancellation21 , this would imply that\nthe perturbation series (3.12) has a zero radius of convergence in the t → ∞ limit. The\nsimplest set of diagrams which meet our purpose are given by:\n21\n\nNote that since we are in the high temperature phase, in which supersymmetry is badly\n\nbroken, there is no obvious reason for suspecting such magical cancelations.\n\n15\n\n\fΓ2 =\n\nΓ1 =\n\nΓn−1\n\nΓn =\n\nΓn−1\nΓn−1\n\nFig. 1: A family of diagrams which indicates that the perturbation theory break\ndown in the long time limit. Black and red lines denote propagators of M1 and M2\nrespectively.\n\nThese graphs appear at orders d1 = 2, d2 = 8, d3 = 26, * * * of perturbation theory\n\nwhere\n\ndi = 3di−1 + 2 = 3i − 1,\n\ni = 1, 2 * * * .\n\n(4.8)\n\nWe denote the contribution of each diagram by Γi (τ ). For our purpose, it is not necessary\nto compute the full graph. We will only need to calculate the term in each graph with the\nhighest power of τ , i.e. the term proportional to τ di . Also note that in each diagram, the\nsymmetry factor is exactly 1. Let us start with Γ1 , which is given by\nZ β\n3\n′\n2\ndτ1 dτ2 gE (τ − τ1 ; ω0 )gE\n(τ1 − τ2 ; ω0 )gE (τ2 − τ ′ ; ω0 )\nΓ1 (τ − τ ) = λ\n\n(4.9)\n\n0\n\nNote the identity\n3\ngE\n(τ ; ω0 )\n\n\u0012\n\u0013\nf (ω0 )\n3\n2\nβω0\nf (ω0 ) e gE (τ ; ω0 ) +\ngE (τ ; 3ω0 )\n=\n(2ω0 )2\nf (3ω0 )\n\n(4.10)\n\nNow plug (4.10) into (4.9). It is easy to convince oneself that the term proportional to\ngE (τ ; 3ω0 ) in (4.10) will not generate a term proportional to τ 2 and we will ignore it. The\ncontribution of the term proportional to gE (τ ; ω0 ) can be found by noting the identity22\nZ\n\n0\n\n22\n\nβ\n\ndτ1 dτ2 gE (τ − τ1 ; ω0 )gE (τ1 − τ2 ; ω0 )gE (τ2 − τ ′ ; ω0 ) =\n\n1 ∂2\ngE (τ − τ ′ ; ω0 ) (4.11)\n2 (∂ω02 )2\n\n2\n(τ ; ω1 ) there is also a\nIf two matrices have different frequencies in the product gE (τ ; ω0 )gE\n\nterm proportional to gE (τ ; ω0 ) with coefficient\n\n1\nf (ω1 )(1 + f (ω1 ))\n(2ω1 )2\n\nfollows with minor changes.\n\n16\n\nand the rest of the analysis\n\n\f′ 2\n1 (τ −τ )\ng (τ\n2 (2ω0 )2 E\n\nThe right hand side of (4.11) contains a piece\n\n− τ ′ ) plus parts with smaller\n\npowers of τ − τ ′ . Thus the term in (4.9) proportional to (τ − τ ′ )2 is given by\nΓ1 (τ − τ ′ ) =\nwhere\nα=\n\nαλ2\n(τ − τ ′ )2 gE (τ − τ ′ ) + * * *\n2\n\n3f (1 + f )\n,\n(2ω0 )4\n\nf = f (ω0 )\n\n(4.12)\n\n(4.13)\n\nThe term proportional to τ di for higher order diagrams Γi (τ ) can now be obtained by\niterating the above procedure. A useful identity is\nZ β\ndτ1 dτ2 gE (τ − τ1 ; ω0 )gE (τ1 − τ2 ; ω0 ) (τ1 − τ2 )n gE (τ2 − τ ′ ; ω0 )\n0\n\n(τ − τ ′ )n+2\n1\n=\ngE (τ − τ ′ ; ω0 ) + * * *\n2\n(2ω0 )\n(n + 2)(n + 1)\n\n(4.14)\n\nwhere we kept only the term with the highest power of τ − τ ′ , as lower power terms will\n\nnot contribute to the terms in which we are interested. We find that the term proportional\nto τ di in Γi (τ ) is given by\nΓi (τ ) = Fi λdi τ di gE (τ ; ω0 ) + * * *\n\n(4.15)\n\nwhere Fi satisfy the recursive relation\nFi+1 = Fi3\nThus Fi can be written as\n\nα\ndi+1 (di+1 − 1)\n\n.\n\n(4.16)\n\ndi\n\nFi = α 2 Λi\nwith\nΛi =\n\ni−1\nY\n\nk=0\n\n\u0012\n\n(4.17)\n\n1\ndi−k (di−k − 1)\n\n\u00133k\n\n(4.18)\n\nΛi in the large i limit can be easily estimated and we find\n3\n\nΛi ≈ e− 2 di ,\n\ni≫1.\n\nSumming all our diagrams together and analytically continuing to Lorentzian time\nwith τ = it + ǫ, we find that23\nX\ni\n\nΓi (t) ≈\n\n(0)\nD+ (t)\n\n∞\nX\ni=1\n\n23\n\n(−1)\n\ni\n\n\u0012\n\nλt\nhc\n\n\u0013di\n\n+***\n\n(4.19)\n\nSince we are only interested in the asymptotic behavior of the sum for large i we have replaced\nFi by its asymptotic value.\n\n17\n\n\fwith hc given by\n\n3\n\n3\n\ne2\ne 2 (2ω0 )2\nhc = √ = p\nα\n3f (1 + f )\n\n(4.20)\n\nEquation (4.19) implies that the radius of convergence in λ is given by\nλc (t) ∼\n\n1\nt\n\n(4.21)\n\nwhich goes to zero as t → ∞.\n\nIt is also instructive to repeat the computation of fig. 1 in frequency space using\n\nthe real-time method. The calculation is straightforward and we will only summarize the\nresult. One finds that the contribution of Γi to the Feynman function DF (ω) grows like di !.\nThus one expects that the perturbative expansion in frequency space is not well defined\nfor any frequency. Note that the non-analyticity in frequency space can be expected since\nin going to frequency space one has to integrate the full real time-axis and the Fourier\ntransform is sensitive to the long time behavior. Also note that the n! factorial behavior\nin perturbation theory often implies an essential singularity at λ = 0 (see also below).\nWe conclude this section with some remarks:\n1. In the zero-temperature limit hc → ∞ and the set of terms in (4.19) all go to zero.\n\n2. To simplify our discussion, we have only considered diagrams in fig. 1. There are\nin fact many other diagrams of similar type contributing at other orders in λ. For\nexample, by including those in fig.2, one can get contributions for all even orders in\nλ rather than only (4.8). The qualitative conclusion we reached above is not affected\nby including them24 .\nΓ\n\nk\n\nΓ\n\nΓj\n\nΓj\n\nΓi\n\nΓi\n\nk\n\nFig. 2: By including the diagrams on the left with all possible i, j, k ≥ 0 we can\nget contribution at every even order of λ instead of (4.8). Γ0 denotes a single\npropagator. Diagrams on the right can also contribute to the odd orders if (2.3)\ncontains additional interactions of the form trA2 B 2 .\n24\n\nThere are also potentially an infinite number of other sets of diagrams which can lead to the\n\nbehavior (4.21), e.g. one can replace Γ1 by any diagram whose highest power in t is the same as\nthe order of perturbation and then iterates.\n\n18\n\n\f3. By taking in consideration the diagrams on the left of fig. 2 the sum in (4.19) is extended\n\n25\n\nto all even powers of λt and is oscillating therefore the singularities in λt\n\nshould lie on the imaginary axis. Let us suppose that for a given λ, D+ (t) has a singularity in t at qc /λ with qc lying in the upper half plane26 . Now Fourier transforming\nD+ (t) we find that\nD+ (ω) =\n\nZ\n\n∞\n\ndt eiωt D+ (t)\n\n(4.22)\n\n−∞\n\nThe presence of qc /λ and qc∗ /λ implies D+ (ω) contains a term of the form for ω > 0\nqc\n\nD+ (ω) ∼ eiω λ\n\n(4.23)\n\nThus D+ (ω) contains an essential singularity at λ = 0.\n4. The n! behavior in perturbative expansion in frequency space (say in the computation\nof DF (ω)) arises from a single class of Feynman diagrams. This is reminiscent of\nrenormalons in field theories [35,36,37]. In particular, when Borel resumming the\ndivergent series, depending on whether ω is greater or smaller than ω0 , the singularities\non the Borel plane can appear on the positive or negative real axis27 , also reminiscent\nof the IR and UV renormalons.\n5. Note that in the limit T → ∞, hc in (4.20) scales with T as hc ∼\nλc (t) ∼\n\nω03\nT ,\n\ni.e.\n\nω03\ntT\n\n(4.24)\n\nFor fixed λ, we expect a singularity for D+ (t) at\nt∼\n\nω03\nλT\n\n(4.25)\n\nNote that the right hand side of (4.25) is reminiscent of the magnetic mass scale for a\nYang-Mills theory (see e.g. [38]). However, in our matrix quantum mechanics, there\nis no infrared divergence and it is not clear whether there is a connection.\n6. The discussion can be straightforwardly applied to a generic theory in (2.1) with\ncubic and quartic couplings. In fact the argument also applies to a single anharmonic\n25\n\nthe value of hc also changes\n\n26\n\nNote that qc∗ /λ must also be a singularity of D+ (t).\n\n27\n\nSince we only have contributions to even order in λ, we cannot make a conclusion from our\n\ndiscussion so far.\n\n19\n\n\foscillator at finite temperature, even though in that case one does not expect the\nperturbative expansion to converge anyway28 . Similarly, the argument also applies\nto a single-matrix quantum mechanics if one does not impose the singlet condition.\nWhen imposing the singlet condition, the matrix U in equation (3.2) cannot be set\nto 1 and our argument does not apply. Similarly our argument does not apply to\n(2.1) in the low energy sector, in which U is always important. Indeed using the\nresults of [31,39], one can show that to leading order in the large N limit, correlation\nfunctions at finite temperature can be written in terms of those at zero temperature\nand we do expect that the perturbation theory has a finite radius of convergence.\n7. Our argument indicates that perturbation theory breaks down in the long time limit\nfor a generic theory in (2.1). However, for any specific theory (say N = 4 SYM theory)\n\nwe cannot rule out magical cancelations which could in principle make the coefficients\n\nof n-th order term much smaller than indicated by the diagrams we find. If magical\ncancelations do occur in some theory, that would also be extremely interesting since\nit indicates some hitherto unknown hidden structure29 .\n\n5. Physical explanation for the breakdown of planar expansion\nIn this section we give an alternative argument for the breakdown of perturbation\ntheory in the long time limit, which complements that of last section. The discussion\nbelow should apply to a generic theory in (2.1). For definiteness we use N = 4 SYM as an\nillustration example.\n\nWe first set up some notations. We write the full Hamiltonian as\nH = H0 + V (λ)\n\n(5.1)\n\nwith H0 the Hamiltonian of the free theory and V the interaction. We denote a free\ntheory energy eigenstate by |ai with energy ǫa . |0i is the (unique) free theory vacuum.\n28\n\nSee Appendix D for further elaborations on the example of a single anharmonic oscillator and\n\na discussion on the differences between the single anharmonic oscillator and the matrix systems\nunder consideration.\n29\n\nSince we are working at a finite temperature, supersymmetry alone should not be sufficient\n\nfor the cancelations.\n\n20\n\n\fThe energy eigenstates of the interacting theory H are denoted by |ii with energy Ei . |Ωi\n\nis the interacting theory vacuum. We can expand\n|ii =\nwith cia satisfying\n\nX\na\n\nX\n\n|cia |2 =\n\na\n\ncia |ai\n\nX\ni\n\n(5.2)\n\n|cia |2 = 1 .\n\n(5.3)\n\nε ∼O(Ν2)\n\nε ∼Ο(1)\nFig. 3: The energy spectrum of free N = 4 SYM on S 3 is quantized. Typical\ndegeneracy for an energy level ǫ ∼ O(1) is of order O(1). Typical degeneracy for a\n2\nlevel of energy ǫ ∼ O(N 2 ) is of order eO(N ).\n\nWe first recall some relevant features of the free theory energy spectrum of N = 4\n\nSYM on S 3 . Since ωα in (2.1) are all integer or half-integer multiples of ω0 =\ntheory energy spectrum is quantized in units\n\n1\n2 ω0 .\n\n1\nR,\n\nthe free\n\nTypical energy levels are degenerate.\n\nThe degeneracy is of O(1) in the low energy sector and of order eO(N\n\n2\n\n)\n\nin the high energy\n\nsector. The exponentially large degeneracy in the high energy sector can be seen as follows.\n2\n\nFrom (2.7) the density of states Ω0 (ǫ) in the high energy sector is of order eO(N ) . Since the\nenergy levels are equally spaced with spacings order O(1), it must be that typical energy\n2\n\nlevels have a degeneracy of order eO(N ) . Alternatively, the number of ways to construct\na state of energy of order O(N 2 ) from O(N 2 ) oscillators of frequency of O(1) is clearly\nexponentially large in N 2 .\nWhen a theory contains n > 1 incommensurate fundamental frequencies, the free\ntheory spectrum at energies of order O(N 2 ) will have level spacings of order O(N −2(n−1) ).\n2\n\nSince the density of states are of order eO(N ) , the degeneracy of a typical state is again\nof order eO(N\n\n2\n\n)\n\nas in the case of one fundamental frequency. That the level spacings go\n\nto zero as a negative power in N does not change our conclusion of previous sections\n21\n\n\fregarding the thermalization in free theory or at any finite order in perturbation theory,\nsince as emphasized there a small operator can only connect states whose energy differences\nare of order O(N 0 ). Therefore such small level spacings cannot be accessed dynamically.\nThe restriction above to a finite number of incommensurate fundamental frequencies is\nnot essential. The conclusion applies to any theories in which the number of fundamental\nfrequencies increases only as a power of the frequency. For these theories, the thermal\nensemble is dominated by states built from oscillators whose frequencies are smaller than\nor of order of β −1 . Thus the effective number of fundamental frequencies is finite.\nNow let us turn on the interaction V (λ) (2.2) with a tiny but nonzero λ. We will focus\non the high energy sector. Given that free theory energy levels are highly degenerate, one\nwould like to apply degenerate perturbation, say to diagonalize V in a degenerate subspace\n2\n\nof energy E ≈ μN 2 and of dimension eO(N ) . For this purpose we need to choose a basis\n\nin the degenerate subspace. This is a rather complicated question, due to difficulties in\nimposing singlet conditions30 . However, when μ is sufficiently large we expect the singlet\ncondition not to play an important role31 . So to simplify our discussion we will ignore the\nsinglet condition below. A convenient orthonormal basis of energy eigenstates for H0 are\nthen monomials of various oscillators (appropriately normalized), i.e.\nN \u0010\nY Y\n\n†\nMαij\n\nα i,j=1\n\n\u0011nαij\n\n|0i .\n\n(5.4)\n\nIn the basis (5.4), if the full theory is not integrable, V can be effectively treated as\nan (extremely) sparse random matrix32 . The sparseness is due to that each term in V can\nconnect a given monomial state to at most N k other states, where k is an O(1) number33 .\nRandomness has to do with the large dimension of the subspace and to the fact that there\nis no preferred ordering for the states within the same subspace. Diagonalizing V , we thus\nexpect, from general features of a sparse random matrix (see Appendix C for a summary),\n30\n\nThe trace relations are important for states of such energies.\n\n31\n\nAs remarked earlier, in the high temperature limit the saddle point for U (in (3.2)) approaches\n\nthe identity matrix.\n32\n\nHere we restrict V to a single energy level. When including all energy levels V is banded\n\nand sparse. The banded structure is due to energy conservation.\n33\n\nThis is because each term in V is a monomial of a few matrices.\n\n22\n\n\f1. The degeneracy of the free theory will generically be broken34 .\n2. A number of states of order eO(N\n\n2\n\n)\n\nwill mix under the perturbation.\n\n3. The typical level spacing between energy levels should be proportional to the inverse of\n2\n\nthe density of states and is thus exponentially small, of order e−O(N ) . Note that this\nis exponentially smaller than the level spacings in a free theory with a finite number\nof incommensurate fundamental frequencies.\nThe story is in fact a little more intricate. We expect the degenerate perturbation to\nbe a good guide if the spread of energy eigenvalues after diagonalizing V in a subspace is\nsmaller than the spacings between nearby energy levels. The spread Γ of eigenvalues of V\ncan be estimated by (see Appendix C)\nΓ2 ∼ Γ2a =\n\nX\na6=b\n\n| ha|V |bi |2 ∼ O(N 2 )\n\n(5.5)\n\nfor any nonzero λ, where the sum restricts to a degenerate subspace. Note that (5.5) only\ndepends on that V is a single trace operator and does not depend on the specific structure\nof it. That Γ ∼ O(N ) implies that it is not sufficient to diagonalize V within a degenerate\n\nsubspace. It appears more appropriate to diagonalize35 it in a subspace with energy spread\nof order O(N ). Thus in addition, we expect that:\n4. an interacting theory eigenstate |ii is strongly coupled to free theory states |ai within\nan energy shell of order O(N ).\n\nThis statement will be justified in the next section from a somewhat different perspective.\nThat Γ ∼ O(N ) for any nonzero λ in the 't Hooft limit indicates a tiny λ may not really\nbe considered as a small perturbation after all.\n\nVarious features discussed above when turning on a small λ are clearly nonperturbative in nature. However, it may be hard to probe them directly using Euclidean\nspace observables like partition functions and Euclidean correlation functions. These observables probe only average behaviors within an energy difference range of order O(T ) or\n34\n\nFor Yang-Mills theories on S 3 , there are remaining degeneracies associated with the isometry\n\ngroup SO(4) of S 3 . Except when one considers the sectors with very large angular momenta on\nS 3 , typical representations of SO(4) are rather small and should not affect our general argument.\n35\n\nThis statement is of course only heuristic since there is no sharp criterion to decide what\n\nshould be the precise size of the subspace. However, we expect the N scaling should be robust.\n\n23\n\n\flarger and thus may not be sensitive to the changes in level spacings at smaller scales36 . In\ncontrast, real-time correlation functions are much more sensitive. For example, consider\nthe Lehmann spectral decomposition of G+ (t), i.e.\n\u0001\n1\nTr e−βH O(t)O(0)\nZ\n1 X −βEi +i(Ei −Ej )t\ne\n| hi|O(0)|ji |2\n=\nZ i,j\n\nG+ (t) =\n\n(5.6)\n\nwhere we have inserted complete sets of energy eigenstates |ii of the interacting theory.\nFrom (5.6), it is clear that G+ (t) can in principle probe any small energy differences,\n\nprovided one takes t to be large enough. This explains the breakdown of perturbation\ntheory in the long time limit observed in G+ (t). At large N , the λ → 0 and t → ∞ limits\n\ndo not commute.\n\nIn this and the last sections we have presented two lines of largely independent arguments that suggest that planar perturbation theory breaks down in the long time limit.\nThe first argument (last section) is based on an honest Feynman diagram calculation, which\nestablishes the breakdown of perturbation theory, but does not tell us directly whether the\nspectral functions are continuous or not. The second argument (this section), based on\nthe energy spectrum, is more heuristic, but implies that the spectral functions are continuous in the large N limit. There are reasons to believe that the two arguments should\nbe closely related. As stressed earlier, the breakdown of perturbation theory from the\nclass of Feynman diagrams considered in the last section only happens at a sufficiently\nhigh temperatures, at which the thermal ensemble is dominated by states of energy of order O(N 2 ) and the energy spectrum becomes quasi-continuous37 . Nevertheless, a precise\nrelation between the two arguments is not clear at this point, as they use very different\nlanguages (one Feynman diagrams and the other energy levels). It would be very desirable\nto find a direct connection and to have an understanding of the time scale (4.25) from the\npoint of view of the energy levels.\n36\n\nOf course if one is able to compute Euclidean observables exactly, one should be able to\n\nextract all the interesting physics. After all, real-time observables can be obtained from Euclidean\nones by analytic continuation. It is just often the case that real-time physics is encoded in a very\nsubtle way in Euclidean observables.\n37\n\nApplied to the theory at zero temperature or at a temperature below the deconfinement\n\ntemperature, the class of diagrams gives a convergent contribution. At such a temperature, the\nthermal ensemble is dominated by states of energy of order O(N 0 ), which are not quasi-continuous\nwhen turning on interactions.\n\n24\n\n\f6. A statistical approach\nThe argument of section 4 shows that the planar perturbation theory breaks down in\nthe large time limit, but it does not tell us what the long time behavior is. Non-perturbative\ntools are needed to understand the long time behavior of real time correlation functions in\nthe large N limit. Here we develop a statistical approach, taking advantage of the extremely\nlarge density of states in the high energy sector. In this section we outline the main idea and\nthe results, leaving detailed calculations to various appendices. The statistical approach\nenables us to derive some qualitative features satisfied by the Wightman function for a\ngeneric operator at finite temperature, including that it has a continuous spectral density\nfunction and should decay to zero in the long time limit. The features we find here are also\nshared by the Wightman function at strong coupling found from supergravity analysis.\nOur starting point is the Lehmann spectral decomposition of G+ (t) (5.6),\nG+ (t) =\n\n1 X −βEi +i(Ei −Ej )t\ne\nρij\nZ i,j\n\n(6.1)\n\nwhere\nρij = | hi|O(0)|ji |2 = |Oij |2\n\n(6.2)\n\nIn momentum space\nG+ (ω) =\n\n1 X −βEi\ne\nδ(ω + Ei − Ej )ρij .\nZ\n\n(6.3)\n\ni,j\n\nMatrix elements Oij can in turn be expressed in terms of those of free theory using (cia\nwas introduced in (5.2))\n\nOij = hi|O(0)|ji =\n\nX\na,b\n\nc∗ia cjb ha|O|bi =\n\nX\na,b\n\nc∗ia cjb Oab\n\n(6.4)\n\nwhere we have inserted complete sets of free theory states and Oab = ha|O(0)|bi.\n\nSince for sufficiently high temperature, the sums in (6.3) and (6.4) are peaked at\n\nan energy with an extremely large density of states, one should be able to obtain the\nqualitative behavior of ρij and G+ (ω) from statistical properties of Oab and cia . As\ndiscussed in the last section, in the interacting theory, we expect typical level spacings scale\n2\n\nwith N like e−O(N ) . In the large N limit, Ei can be considered as taking continuous values.\nNote that this by itself does not imply that G+ (ω) has a continuous spectral decomposition,\nsince it is possible that ρij only has support for states with finite energy differences. We\n25\n\n\fargue below that ρij has nonzero support between states with any Ei − Ej ∈ (−∞, ∞),\nwhich is independent of N , and thus G+ (ω) does have a continuous spectrum.\n\nLet us first look at the statistical behavior of cia . For this purpose, consider the\nfollowing density functions\nρa (E) =\n\nX\n\n|cia |2 δ(E − Ei )\n\n(6.5)\n\nX\n\n|cia |2 δ(ǫ − ǫa )\n\n(6.6)\n\ni\n\nχi (ǫ) =\n\na\n\nρa (E), first introduced by Wigner [40], is also called the local spectral density function or\nstrength function in the literature38 . Using normalization properties of cia , one finds that\nZ\nZ\ndE ρa (E) = 1,\ndǫ χi (ǫ) = 1\n(6.7)\nρa (E) can be considered as the distribution of interacting theory eigenstates of energy E\ncoupling to a free theory state |ai. Similarly, χi (ǫ) gives the distribution of free theory\n\nstates of energy ǫ coupling to an exact eigenstate |ii. The mean and the variances of the\ntwo distributions are given by\n\nEa =\nσa =\n\nΓ2a\n\n=\n\nZ\n\nΣi =\n\n=\n\nZ\n\ndE E ρa (E) = ha|H|ai\n\n(6.8)\n\nX\n\n(6.9)\n\ndE (E − E a )2 ρa (E) =\n\nǫi =\n∆2i\n\nZ\n\nZ\n\nb6=a\n\n| ha|V |bi |2\n\ndǫ ǫ χi (ǫ) = Ei − hi|V |ii\n\ndǫ (ǫ − ǫi )2 χ(Ei , ǫ) =\n\nX\nj6=i\n\n| hi|V |ji |2\n\n(6.10)\n(6.11)\n\nE a and Γa give the center and the spread of interacting theory energy eigenstates coupling\nto a free state |ai. Similarly, ǫi and ∆i give the center and the spread of free theory\n\nstates coupling to an interacting theory energy eigenstate |ii. Γa can be considered as a\n\nmeasure of correlation among energy levels of the interacting theory (since states whose\n\nenergies differ by Γa could couple to the same free theory state and are thus correlated).\n∆i characterizes the range of free theory states which are mixed by perturbation. Note\n38\n\nThese density functions have been frequently used in quantum chaos literature, see e.g. [41]\n\n26\n\n\fthat the heuristic discussion after equation (5.5) implies that ∆i ∼ O(N ), which we will\nconfirm below using a different method.\n\nIndividual energy eigenstates are rather hard to work with. We will consider microcanonical averages of (6.5) and (6.6). After all, for (6.1) and (6.3) we only need the\nbehavior of ρij averaged over states of similar energies. We will denote the average39 of\nχi (ǫ) over interacting theory states of energy E by χE (ǫ) and similarly the average of ρa (E)\nover free theory states |ai of similar energy ǫ by ρǫ (E). Since the averages involve a huge\n\nnumber of states and the large N limit is like a thermodynamic limit in the high energy\nsector, we will assume that χE (ǫ) is a smooth slow function40 of E, i.e. it depends on E\nonly through E/N 2 . Similarly ρǫ (E) is assumed to depend on ǫ only through ǫ/N 2 . The\ncenter and variance of χE (ǫ) and ρǫ (E) will be denoted by ǫ(E), Σ(E) = ∆2 (E), E(ǫ),\n\nand σ(ǫ) = Γ2 (ǫ) respectively41 . These quantities should also be slow functions of E or ǫ\nas they inherit the property from χE (ǫ) and ρǫ (E). In the Appendix E we estimate these\nquantities and find that\nǫ(E) = N 2 g(λ, E/N 2 )\nΣ(E) = N 2 h(λ, E/N 2 )\nE(ǫ) = N 2 ge(λ, ǫ/N 2 )\n\n(6.13)\n\nσ(ǫ) = N 2 e\nh(λ, ǫ/N 2 )\n\nWe emphasize that the large N scalings above only depend that V is given by N times\nsingle trace operators. Given that the underlying theory is not integrable and the extremely\nlarge number of states, we will thus approximate cia for fixed i as a random unit vector\nwhich centers at ǫi with a spread of order ∆i ∼ O(N ).\n\nNow we turn to the statistical properties of Oab . Our earlier discussion for V in the\n\nfree state basis (5.4) can be carried over to any operator O of dimension O(1). Thus Oab\n39\n\nMore explicitly, the average can be written as\nχE (ǫ) =\n\n1\nΩ(E)\n\nX\n\nχi (ǫ)\n\n(6.12)\n\nEi ∈(E−δ,E+δ)\n\nwhere δ is small enough that Ω(E) does not vary significantly in the range (E − δ, E + δ).\n40\n\nNote that a function f (E) is considered a slow function if it can be written in a form\n\nf (E) = N a g(E/N 2 ), where g(x) is a function independent of N .\n41\n\nwhich can also be obtained by the average of various quantities (6.8)-(6.11) to leading order\n\nin large N .\n\n27\n\n\fcan be considered as an sparse banded random matrix. The matrix is banded since from\nenergy conservation O can only connect states whose energy difference is smaller than\n\nthe dimension of O. Note that even though Oab is sparse, for each row (or column), the\nnumber of nonzero entries grows with N as a power.\n\nTo summarize, we will assume the following statistical properties for cia and Oab :\n\n1. For a given i, cia is a random unit vector with support inside an energy shell of width\nO(N ). In particular, the cia satisfy the same distribution for |ai of the same energy.\n\n2. Oab is banded sparse random matrix, with the number of nonzero entries growing\nwith N as a power.\n\nNow consider any two states |ii and |ji, with energies Ei and Ej respectively, for which\n\nω = Ei − Ej ∼ O(1). One finds that ǫi − ǫj ∼ O(1) and the energy shells of the two states\n\noverlap significantly. Given that the number of nonzero entries in a row or column of\nOab grows with N as a power and that each element of cia satisfies the same distribution,\none concludes from (6.4) that Oij should have support for any ω = Ei − Ej ∼ O(1) and\n\nG+ (ω) has a continuous spectrum for ω ∈ (−∞, +∞). Note that the fact that ∆ ∼ O(N )\nis crucial for having a continuous spectrum ω ∈ (−∞, +∞). Suppose ∆ ∼ O(1), the\nspectrum cannot extend to ±∞ due to energy conservation.\n\nOne can further work out more detailed properties of ρij . Leaving the detailed cal-\n\nculation in various appendices, we find that (after averaging ρij over states of similar\nenergies)\nρE1 E2 =\n\n1\nA(ω; E) = e−S(E) A(ω; E)\nΩ(E)\n\n(6.14)\n\nwhere Ω(E) and S(E) = log Ω(E) are the density of states and entropy of the interacting\ntheory respectively and\n\nE1 + E2\n,\nω = E1 − E2 .\n2\nEquation (6.14) is derived in Appendix G along with properties of A(ω; E) stated below.\nE=\n\nSome useful formulas used in the derivation are collected in Appendix F. A(ω; E) can be\nexpressed in terms of an integral of χE (ǫ) and ǫ(E) (see equations (G.3) and (G.8)) and\nsatisfies the following properties:\n1. A(ω; E) is an even function of ω, i.e.\nA(−ω; E) = A(ω; E)\n2. As ω → ∞\n\n1\n\nA(ω; E) ∝ e− 2 β(E)|ω| ,\n28\n\nβ(E) =\n\n(6.15)\n∂S(E)\n∂E\n\n(6.16)\n\n\f3. A(ω, E) is integrable along the real axis and can at most have integrable singularities\nof the form\nA(ω; E) ∝\n\n1\n,\n|ω − ωs |αs\n\nαs < 1 .\n\n(6.17)\n\n4. AE (ω) depends on E only through E/N 2 , i.e. it can be written as\nA(ω; E) = A(ω; μ),\n\nμ=\n\nE\nN2\n\n(6.18)\n\nand A is a function independent of N .\nNote that property 2 implies that in the large N limit, ρE1 E2 ∼ 0 for E1 − E2 ∼ N a with\na > 0.\n\nThe expression for G+ (ω) in momentum space can now be obtained by plugging (6.14)\ninto (6.3) and using a saddle point approximation. We find that\nZ\n1\ndE e−βE eS(E)+S(E+ω) e−S(E+ω/2) A(ω, E/N 2)\nG+ (ω) =\nZ\nZ\nh\ni\n1\n=\ndE e−βE+S(E) eS(E+ω)−S(E+ω/2) A(ω, E/N 2)\nZ\n=e\n\nβω\n2\n\n(6.19)\n\nA(ω, μβ )\n\nwhere\nμβ =\n\nEβ\n,\nN2\n\n∂S(E)\n∂E\n\n=β .\n\n(6.20)\n\nEβ\n\nNote that since in the large N limit, E can be treated as continuous and ρij has support\nfor any energy difference, it is appropriate to approximate the sum in (6.3) by an integral.\nAlso from the second line to the third line we have used that the quantity inside the\nbracket depends on E slowly and performed a saddle point approximation. We conclude\nthis section with some remarks:\n1. G+ (ω) has a continuous spectrum with ω ∈ (−∞, +∞) in the large N limit (note that\nω does not scale with N ).\n\n2. Since A(ω, μ) can at most have integrable singularities of the form (6.17) on the real\naxis, after a Fourier transform to coordinate space, G+ (t) must go to zero in the limit\nt → ∞. If A(ω; μ) is a smooth function on the real axis, then G+ (t) must decay\n\nexponentially with time.\n\n3. Considering the last line of (6.19) as a definition for A(ω; μ), for N = 4 SYM on S 3\n\nat strong coupling, the corresponding A(ω; μ) can be found by solving the Laplace\n\nequation for a scalar field in an AdS black hole geometry and be expressed in terms\n29\n\n\fof boundary values of renormalizable wave functions for the scalar field [28]. In particular, A(ω; μ) found at strong coupling satisfy all the properties (6.15)–(6.18) (it is\na smooth function on the real axis).\n4. It should be possible to obtain an explicit expression for A(ω; μ) (and thus G+ (ω))\nusing the expressions found in the appendices (e.g. equation (G.3)) if one can find\nthe density functions (6.5) and (6.6) for a sparse banded random matrix with varying\ndensity of states. While those for constant density of states have been discussed in the\nliterature (see e.g. [41]), not much appears to be known for the non-constant density\nof states [42].\n\n7. Discussions\nIn this paper we first showed that in perturbation theory, real-time correlation functions in the high temperature phase of (2.1) have a discrete spectrum and the system does\nnot thermalize when perturbed away from thermal equilibrium. We then argued that the\nperturbative expansions for real-time correlation functions break down in the long time\nlimit. The breakdown of perturbation theory indicates that at large N the λ → 0 and\n\nt → ∞ limits do not commute. The reason for the breakdown is that a wide energy range\n(of order O(N )) of degenerate free theory energy eigenstates mix under the interaction.\n2\n\nThe level spacings in the energy spectrum of O(1) in the free theory become e−O(N ) . As\na result, real-time correlation functions develop a continuous spectrum for any nonzero λ.\nThe continuous spectrum was argued from a statistical approach developed in section 6,\nwhere we also show that real-time correlation functions should decay to zero as t → ∞\nand the system becomes time irreversible.\n\nWe should emphasize that our arguments in this paper are qualitative in nature and\nfar from foolproof. For example, instead of being a random vector, cia could have some\nstructure (e.g. being very sparse) within the range of its spread, in which case our statistical\nargument will not be valid.\nIt is also important to emphasize our results only apply to the high energy sector and\nin the low energy sector (or in the low temperature), there is no indication of breakdown of\nthe planar expansion. In particular the results we describe here are not inconsistent with\nthat the sector near the vacuum might be integrable in the large N limit [43]. In fact the\nresults of [31,39] are consistent with that the interpolation between the free theory and\nstrong coupling may be smooth in the low temperature phase.\n30\n\n\fOur results indicate that there is a large N \"phase transition\" at λ = 0, i.e. physical\nobservables undergo qualitative changes in the limit λ → 0. The \"phase transition\" we\n\nfind here is somewhat unusual, since it is not manifest in the Euclidean quantities like\nthe partition function. The partition function appears to be smooth in the λ → 0 limit.\n\nThe \"phase transition\" is in real-time correlation functions and their Fourier transforms.\n\nReal-time correlation functions decay to zero at large time at any finite λ, while oscillatory\nfor λ = 0. In frequency space there is an essential singularity at λ = 0.\nIt would be interesting to understand whether one can continue the physics at small λ\nto large λ. If there is no further large N \"phase transition\" in λ, we expect that the analytic\nstructure of various correlation functions observed at strong coupling should also be present\nat small λ. Such structure include the signatures of black hole singularities [29,28] and the\nbulk-cone singularities [44].\nGiven that an arrow of time emerges for small λ in the large N limit, it is natural\nto ask what should be the string theory interpretation of the high temperature phase for\nN = 4 SYM on S 3 at weak coupling, or from the microcanonical point of view, what is\n\nthe bulk interpretation for a generic state in the high energy sector.\nFrom the parameter relations in AdS/CFT,\nls2\n1\n=√ ,\n2\nR\nλ\n\nGN\n1\n= 2,\n8\nR\nN\n\nGN = lp8 ∼ gs2 ls8 ,\n\n.\n\n(7.1)\n\none might conclude that at weak coupling λ ≪ 1, ls ≫ R , i.e. the string length ls is\n\nmuch bigger than the AdS curvature radius R. However, it seems unlikely one can give an\n\ninvariant meaning to the statement. For example, even starting with a metric with R ≪ ls ,\none could perform a field redefinition of the form gμν → gμν + α′ Rμν + * * *. In terms of new\n\nmetric one then has R ∼ ls . Thus it seems to us that even for λ ≪ 1, the corresponding\n\nbulk string theory should describe a spacetime of stringy scale, rather than sub-stringy\n\nscale. This is also expected from the gauge theory point of view. At weak coupling the\nonly mass scale is the inverse radius of the sphere and there are no other lighter degrees of\nfreedom. Thus the string scale has to be of the same order as that of the AdS curvature\nscale.\nCan one interpret the bulk configuration corresponding to the high temperature phase\nat weak coupling as a stringy black hole? It seems to us the answer is likely to be yes. Let\nus list the properties that the corresponding bulk configuration should satisfy as expected\nfrom gauge theory, assuming there is no further large N \"phase transition\" between weak\nand strong couplings:\n31\n\n\f1. The bulk configuration should have an entropy and free energy of order O(1/gs2 ).\n2. The object absorbs all fundamental probes (since boundary correlation functions decay\nwith time).\n3. The bulk geometry should have a horizon (since the boundary theory has a continuous\nspectrum).\n4. The bulk configuration is likely to have singularities (since the signatures of the black\nhole singularities in gauge theory at strong coupling cannot disappear as the coupling\nis changed if there is no phase transition).\n5. A generic matter distribution will collapse into such a configuration (since in the\nboundary theory, a generic initial state will approach the thermal equilibrium).\n6. Results in [24,23] indicate that the Euclidean time circle in the dual geometry for the\ntheory in the high temperature phase should become contractible42 .\nFrom the properties above, it seems appropriate to call it a stringy black hole.\nFinally let us mention that it is possible that a stronger version of equation (6.14)\nholds, i.e. for two generic states |ii, |ji in the high energy sector,\nρij =\nwith\nE=\n\n1\nA(ω; E)Rij ,\nΩ(E)\n\nEi + Ej\n,\n2\n\n(7.2)\n\nω = Ei − Ej\n\nand Rij a random matrix. Equation (7.2) is considered to be the hallmark of quantum\nchaos [45,46]43 . Thus it is possible that N = 4 SYM is chaotic in the high energy sector44 .\n\nSuch a chaotic behavior, if it exists, might be related to the BKL behavior near a spacelike\nsingularity [50].\nAcknowledgments\nWe would like to thank O. Aharony, T. Banks, W. Fischler, S. Hartnoll, V. Hubeny,\nA. Lawrence, J. McGreevy, M. Rangamani, A. Scardicchio, S. Shenker, M. Srednicki,\n42\n\nNote that this alone cannot imply that the bulk geometry is a black hole since even at\n\nzero coupling the time circle becomes contractible. As we argued earlier in this paper real-time\ncorrelation functions in free theory do not behave like those of a black hole.\n43\n\nIt has also been argued in [46] that if (7.2) holds, then thermalization always occurs.\n\n44\n\nChaos in a classical Yang-Mills theory was discussed before in [47]. Possible pole of quantum\n\nchaos in AdS/CFT and in black hole physics has also been discussed before in [48,49].\n\n32\n\n\fL. Susskind for useful conversations. This work is supported in part by Alfred P. Sloan\nFoundation and U.S. Department of Energy (D.O.E) OJI grant, and funds provided by\nthe U.S. Department of Energy (D.O.E) under cooperative research agreement #DF-FC0294ER40818.\n\nAppendix A. Parameter relations in AdS/CFT\nN = 4 super Yang-Mills theory is a conformally invariant theory with two parameters:\n\n2\nthe rank of gauge group N and the 't Hooft coupling λ = gYM\nN . From the operator-state\n\ncorrespondence, physical states of the theory on S 3 can be obtained by acting with gauge\ninvariant operators on the vacuum and their energies are given by the conformal dimensions\nof the corresponding operators.\nIt was conjectured in [5] that N = 4 SYM gives a nonperturbative description of type\n\nIIB superstring theory in AdS5 × S5 . The AdS string theory also has two parameters: the\nratio between string length ls and the curvature radius R of AdS, and the ratio between\n\nthe (10d) planck length lp and R. These ratios respectively characterize classical stringy\ncorrections and quantum gravitational corrections beyond the classical supergravity. For\nsmall ls /R and lp /R, parameters of SYM theory and bulk string theory are related by45 [9]\n1\nα′\n= √ ,\n2\nR\nλ\n\nGN\n1\n= 2,\n8\nR\nN\n\nGN = lp8 ∼ gs2 α′4 .\n\n(A.1)\n\nThe above relations indicate that the classical supergravity limit is given by the large N\nand large λ limit of the SYM theory. In particular, a departure from the large N limit of\nthe Yang-Mills theory corresponds to turning on quantum gravitational corrections in the\nAdS spacetime, while a departure from the large λ limit (with N = ∞) corresponds to\nturning on classical stringy corrections.\n\nAdS/CFT implies an isomorphism between the Hilbert space of the two theories.\nIn particular, any bulk configuration with asymptotic AdS5 boundary conditions can be\nassociated with a state (pure or density matrix) of the Yang-Mills theory. The mass M of\nthe bulk configuration is related to the energy E in YM theory as [7,6]\nE ∼ MR .\n45\n\nWe omit order one numerical constants.\n\n33\n\n(A.2)\n\n\fDepending on how E scales with N in the large N limit, states of Yang-Mills theory are\nrelated to different objects in string theory in AdS. For example those whose E do not scale\nwith N (i.e. of order O(1)) should correspond to fundamental string states. An object in\nAdS with a classical mass M satisfies\nGN /R8 → 0\n\nGN M = fixed,\n\n(A.3)\n\nFrom (A.1) and (A.2) the corresponding state in YM theory should have E ∼ O(N 2 ).\n\nAppendix B. Self-energy in the real time formalism\nIn this appendix we first review some basic properties of real-time correlation functions. We then prove that the spectral density functions of fundamental fields in (2.1) have\na discrete spectrum after the resummation of the self-energy diagrams à la Dyson.\nB.1. Analytic properties of various real-time functions\nVarious real-time thermal Wightman function for an operator O are defined by\n\u0001\n1\nTr e−βH O(t)O(0) − C\nZ\n\u0001\n1\nG− (t) = Tr e−βH O(0)O(t) − C\nZ\nGF (t) = θ(t)G+ (t) + θ(−t)G− (t),\n\u0001\n1\nGR (t) = iθ(t) Tr e−βH [O(t), O(0)] ,\nZ\n\u0001\n1\nGA (t) = −iθ(−t) Tr e−βH [O(t), O(0)]\nZ\nG+ (t) =\n\n(B.1)\n\nwhere Z is the partition function and C is a constant to be specified below. It is also\nconvenient to introduce\nG12 (t) = G+ (t − iβ/2)\n\n(B.2)\n\nwhich can be obtained from G+ (t) by an analytic continuation.\nBy inserting complete sets of states in (B.1), G+ (t) can be written as\nG+ (t) =\n\n1 X −iEj t iEi (t+iβ)\ne\ne\nρij\nZ\ni6=j\n\n34\n\n(B.3)\n\n\fwhere i, j sum over the physical states of the theory and ρij = | hi|O(0)|ji |2 . Comparing\n(B.3) and (B.1), C is chosen to be\n\n1 X −Ei β\ne\nρii\nZ i\n\nC=\n\n(B.4)\n\nNote that C is chosen so that the Fourier transform of G+ (t) does not have a \"contact\"\nterm proportional to δ(ω). Assuming the convergence of the sums is controlled by the\nexponentials, it follows from (B.3) that G+ (t) is analytic in t within the range −β <\n\nIm t < 0. Similarly G− (t) is analytic for 0 < Im t < β and G12 (t) for − β2 < Imt <\nIntroducing the spectral density function\nX\nρ(ω) = (1 − e−βω )\n(2π)δ(ω − Ei + Ej )e−βEj ρij\ni,j\n\nβ\n.\n2\n\n(B.5)\n\nthen the Fourier transforms of (B.1) can be written as\nG+ (ω) =\n\n1\nρ(ω)\n1 − e−βω\n1\n\n1\n\nG12 (ω) = e− 2 βω G+ (ω) = e 2 βω G− (ω) =\nGR (ω) = −\nGA (ω) = −\n\nZ\n\n∞\n\n−∞\n∞\n\nZ\n\n−∞\n\n1\nρ(ω)\n2sinh βω\n2\n\ndω ′\nρ(ω ′ )\n2π ω − ω ′ + iǫ\ndω ′\nρ(ω ′ )\n2π ω − ω ′ − iǫ\n\n(B.6)\n\nGF (ω) = GR (ω) + iG− (ω)\nFrom (B.6) we also have\n\nρ(ω) = −i(GR (ω) − GA (ω))\n\n(B.7)\n\nWe also note that the Euclidean correlation function in momentum space can be obtained\nfrom\nGE (ωl ) =\nSome further remarks:\n\n\n GR (iωl )\n\n\nGA (iωl )\n\nl≥0\n\n,\n\nl<0\n\nωl =\n\n2πl\n,\nβ\n\nl∈Z\n\n(B.8)\n\n1. From (B.5)–(B.6),\nρ(−ω) = −ρ(ω),\n\nG12 (−ω) = G12 (ω),\n\nGR (−ω) = GA (ω) .\n\n(B.9)\n\n2. For a theory with a discrete spectrum, from (B.5), the spectral function ρ(ω) and\nG+ (ω) are given by a sum of discrete delta functions supported on the real axis, while\nGR (ω) is given by a discrete sum of poles along the real axis.\n35\n\n\fB.2. Self-energy in real-time formalism\nIn this section we consider real-time correlation functions of fundamental fields Mα\nin perturbation theory using the real-time formalism. We denote various quantities in\n(α)\n\n(α)\n\n(B.1) with O = Mα by D+ , DF\n\netc and will suppress superscript α from now on. We\n\nprove that the corresponding spectral density functions have a discrete spectrum after the\nresummation of the self-energy diagrams à la Dyson. For simplicity, we will consider the\nhigh temperature limit so that we can ignore the singlet projection (see (3.4)).\nIn the real time formalism [30] the degrees of freedom of the theory get doubled (see\n\nalso [51]). For each original field (type 1) in (2.1) one introduces an equivalent field (type\n2)46 whose interaction vertices differ by a sign from the ones for fields of type 1. Vertices\ntherefore do not mix the two different kind of fields but propagators do and are written as\na 2 × 2 matrix. For example, in frequency space the propagator for Mα (in the interacting\n\ntheory) can be written as Dab (ω), a, b = 1, 2 with each component given by\n∗\nD22 (ω) = D11\n(−ω)\n\nD11 (ω) = DF (ω),\n\n(B.10)\n\nβ\n\ne2ω\nρ(ω),\nD12 (ω) = βω\ne −1\n\nD21 (ω) = D12 (ω)\n\nDab can be diagonalized as\nDab = U\n\n\u0012\n\nDg (ω)\n0\n0\nDg∗ (ω)\n\n\u0013\n\nU\n\n(B.11)\n\nwith\nU=\n\n\u0012\n\ncoshγ\nsinhγ\n\nsinhγ\ncoshγ\n\n\u0013\n\nβ\n\n,\n\nand\nDg (ω) = i\n\nZ\n\ncoshγ = √\n′\n\ne 2 |ω|\neβ|ω| − 1\n\n,\n\nsinhγ = √\n\n1\neβ|ω| − 1\n\n\n −iDR (ω) ω > 0\n\n′\n\nρ(ω )\ndω\n=\n2π ω − ω ′ + iǫω \n\n−iDA (ω)\n\n(B.12)\n\n(B.13)\n\nω<0\n\nThe last expression in (B.13) implies that when analytically continued from the positive\nreal axis, Dg (ω) cannot have singularities in the upper half ω-plane. Similarly when\nanalytically continued from the negative real axis, Dg (ω) cannot have singularities in the\nlower half ω-plane. Note that Dg (ω) can have a discontinuity at Im(ω) = 0. If Dg (ω) does\n46\n\nIn a path integral derivation these correspond to the fields whose time argument is t − iσ\n\nand we will take σ =\n\nβ\n.\n2\n\n36\n\n\fturn out to be analytic on the real axis, then it can have singularities only on the real axis\nin the limit ǫ → 0, which in turn implies that DR , DA and DF can have singularities only\n\non the real axis in the limit ǫ → 0.\n\nWe will now show that Dg (ω) obtained using the Dyson equation from any finite\n\norder computation of the self-energy is a rational function with singularities only on the\nreal axis. This implies that the spectral function ρ consists of a sum of finite number of\ndelta functions supported on the real axis.\nNote that the Dyson equation can be written as\n1\n1\ne\n− iΠ(ω)\n= (0)\nDg (ω)\nDg (ω)\n\nwhere\n\nDg(0) =\n\ni\nω 2 − m2 + iǫ\n\n(B.14)\n\n(B.15)\n\ne\nis the free theory expression and Π(ω)\ncan be computed from perturbation theory as\nfollows: (i) Compute 2 × 2 matrix Πab (ω) from the sum of amputated 1PI diagrams for\nthe propagator in real time formalism; (ii) Diagonalizing Πab (ω) using (B.12), i.e.\n\u0013\n\u0012\ne\n0\nΠ(ω)\n(B.16)\nΠab = U\ne ∗ (ω) U .\n0\nΠ\n\nThat Πab can be diagonalized using U is a consequence (B.11).\ne in power series of λ\nNow expanding Dg and Π\nDg = Dg(0) + λDg(1) + λ2 Dg(2) + * * *\ne = λΠ\ne (1) + λ2 Π\ne (2) + * * *\nΠ\n\n(B.17)\n\nfrom equation (B.14) we have\ne (1) )Dg(0) ,\nDg(1) = Dg(0) (iΠ\n\ne (2) )Dg(0) + Dg(0) (iΠ\ne (1) )Dg(0) (iΠ\ne (1) )Dg(0) ,\nDg(2) = Dg(0) (iΠ\n\n***\n\n(B.18)\n\n¿From our discussion in section 3 (applied to fundamental fields), at any finite order in\nperturbation theory ρ(ω) consists of sums of terms of the form (3.7). Plugging such a ρ(ω)\n(n)\n\ninto (B.13) one finds that Dg (ω) is a rational function and is analytic on the real axis\nat each order in the perturbative expansion (i.e. there is no discontinuity at Im(ω) = 0).\ne (n) (ω) must also be a rational function and analytic on real axis.\nUsing (B.18) we find that Π\nThis in turn implies that the resummed Dg (ω) found from (B.14) is a rational function\n\nand analytic on real axis. We conclude that the singularities of Dg must lie on the real\naxis and there are only a finite number of them at any finite order in the computation of\nthe self-energy Π. From (B.13) the spectral density function must be a finite sum of delta\nfunctions supported on the real axis.\n37\n\n\fAppendix C. Energy spectrum and eigenvectors of sparse random matrices\nIn this appendix we summarize features of eigenvalues and eigenvectors of a random\nsparse matrix found in [52,53,54]. Consider an M × M real symmetric matrix A whose\n\nelements Aij for i ≥ j are independent identically distributed random variables with even\n\nprobability distribution f (Aij ). Let f (x) be of the following form:\nf (x) = (1 − α)δ(x) + αh(x)\n\n(C.1)\n\nwhere 0 < α < 1 and h(x) is even and not delta-function like at x = 0. Let the variance of\nh(x) be v 2 . The parameter α measures the sparsity of the matrix: for each row or column\nof the matrix there will be on average αM = K elements which are different from zero. K\nis called the connectivity of the matrix. When K < 1 it is possible for eigenvectors to be\nlocalized in a subspace with dimension smaller than M . For K > 1 in the large M limit no\nsuch localization occurs and the matrix has to be diagonalized in the full M dimensional\nspace.\nWhen K ≫ 1, the density of states reduces to Wigner's semicircular law in an expan-\n\nsion in K −1 :\n\nρ(E) =\n\n\u0001\n1 p 2\n4Γ − E 2 1 + O(K −1 )\n2\n2πΓ\n\n(C.2)\n\nWhere E is the eigenvalue value and Γ is given by:\n\nΓ2 = Kv 2 1 + O(K −1 )\n\n\u0001\n\n(C.3)\n\nNotice that Kv 2 is the average value of\nΓ2i =\n\nX\nj6=i\n\n|Aij |2\n\n(C.4)\n\nover the rows or columns of the sparse matrix. The first correction to ρ(E) gives a change\nin the edge location, however there also are nonperturbative tails to the distribution which\nfor E ≫ Γ assume the form:\nρ(E) ∼\n\n\u0012\n\nE2\neK\n\n\u0013−E 2\n\n(C.5)\n\nTheir effect is to make the spectrum unbounded.\nDenote by T the orthogonal change of basis matrix which brings A to diagonal form\nfor K ≫ 1. T has a random uniform distribution over the group of orthogonal M × M\n\nmatrices. Therefore the eigenvectors of A are a random orthonormal basis of the total\n38\n\n\fspace which means that apart from correlations47 which are negligible in the large M limit\ntheir elements are independently distributed gaussian random variables with mean 0 and\nvariance\n\n1\nM.\n\nIn particular the eigenvectors are completely delocalized. Therefore for large\n\nK the situation is similar to that for the Gaussian Orthogonal Ensemble (GOE).\n\nAppendix D. Single anharmonic oscillator48\nIt is clear that the argument presented in section 4 applies to the real time correlation functions of a single anharmonic oscillator at finite temperature (with changes of\ncombinatorial factors)\nS=\n\nZ\n\ndt\n\n\u0012\n\n1 2 1 2\n1\nẋ − x − λx4\n2\n2\n4!\n\n\u0013\n\n.\n\n(D.1)\n\nFor example one can conclude that the perturbation theory for\nD+ (t) = hx(t)x(0)iβ\n\n(D.2)\n\nshould diverge at a time scale (4.25) for T ≫ ω0 (we set ω0 = 1 in (D.1)). Here we give\nan alternative derivation of this. Inserting complete sets of states in (D.2) we find that\nD+ (t) = Z −1\n\nX\nn,m\n\nwhere Z =\n\nP\n\n−βEn\nne\n\n| hn|x|mi |2 e−βEn −it(Em −En )\n\n(D.3)\n\nand |ni are interacting theory eigenstates. If we are interested only\n\nin contributions of the form (λt)n we get:\nD+ (t) = Z0−1\n\nX\nn,m\n\n(0)\n\n(0)\n(0)\n(1)\n(1)\n−it(Em\n−En\n)−itλ(Em\n−En\n)\n\n| hn|x|mi0 |2 e−βEn\n\n+***\n\n(D.4)\n\nwhere quantities with index 0 are computed in the free theory and λE (1) are the energy\nshifts at first order in perturbation theory. Equation (D.4) can be evaluated as\nD+ (t) =\n\n∞\nλ\n3\nλ\n1\n1 −1 X\nZ0\n(n + 1)[e−β(n+ 2 )−it(1+ 8 (n+1)) + e−β(n+ 2 )+it(1+ 8 (n+1)) ] + * * *\n2\nn=0\n\n(D.5)\n\nwhich can be summed to give\nλ\n\nD+ (t) =\n\n(eβ − 1)eβ−it(1− 8 )\n2(eβ+\n\nitλ\n8\n\n− 1)2\n\nλ\n\n+\n\n(eβ − 1)eit(1− 8 )\n2(eβ−\n\nitλ\n8\n\n− 1)2\n\n47\n\nwhich are due to normalization conditions.\n\n48\n\nThis section is motivated from a discussion with Steve Shenker.\n\n39\n\n+***\n\n(D.6)\n\n\fIn (D.6) there are double poles at\nt = ±i\n\n8β\n16π\n+k\n,\nλ\nλ\n\nk∈Z .\n\n(D.7)\n\nIf one resums the diagrams discussed in section 4, one would then get simple poles and the\npositions of the poles are further away from the real axis than those of (D.6) indicating\nthat there are some positive contributions not captured by the class of Feynman diagrams.\nThe reason for the behavior (D.5)–(D.7) can be attributed to the fact that the first\norder energy shift behaves as\n(1)\n\nλ(En+1 − En(1) ) ∝ λn .\n\n(D.8)\n\nThus when n is sufficiently large i.e. n ∼ λ1 , perturbation theory breaks down due to level\ncrossing. Also note that the divergence of perturbation theory at t ∼\n\n1\nλT\n\nhas nothing to do\n\nwith the standard argument of the breakdown of perturbation theory by taking λ → −λ.\n\nIndeed the behavior here is due to a single class of diagrams not to the n! growth of the\n\nnumber of diagrams.\nWe emphasize that while from the Feynman diagram point of view the discussion for\nanharmonic oscillators is almost identical to that for a matrix quantum mechanics (except that for matrix quantum mechanics one restricts to planar diagrams), the underlying\nphysics for the breakdown of perturbation theory appears to be very different:\n1. In the example of a single anharmonic oscillator, perturbation theory is asymptotic,\ni.e. the n-th order expansion contains n! independent diagrams. In contrast, in the\nplanar expansion of a matrix quantum mechanics, the number of Feynmann diagrams\ngrows only like a power in n. The class of planar diagrams we identified gives rise to\nO(n!) contribution (in frequency space) at the n-th order. In the anharmonic oscillator\nexample, given that the perturbative expansion is already divergent, one cannot really\ndraw any clear conclusion from this class of diagrams. For instance, its contribution\ncould be overwhelmed by those from n! other diagrams. In contrast, in the case of matrix quantum mechanics, the contribution from the particular class of diagrams makes\nan otherwise convergent perturbative expansion divergent. Given that the nature of\nperturbation theory is very different between the single anharmonic oscillator and the\nplanar matrix quantum mechanics, one should be very careful in drawing any conclusion when comparing them. In particular, the fact that the anharmonic oscillator\nhas a discrete spectrum does not imply that in the matrix quantum mechanics case,\n40\n\n\fthe divergence of the subclass of diagrams and hence the breakdown of perturbation\ntheory are not related to a possible underlying quasi-continuous spectrum.\n2. As indicated earlier in this appendix for a single anharmonic oscillator, the divergent\nbehavior of the class of Feynman diagrams considered in section 4 should have to do\nwith with level mixing for states of energy O(1/λ). Applying the same technique to a\nmatrix quantum mechanics, one again expects to relate the divergent behavior of the\nclass of Feynman diagrams to the mixing of energy levels which dominate the thermal\nensemble (i.e. with energy O(N 2 )). More explicitly, let us write (D.4) for the matrix\ncase as\nD+ (t) = Z0−1\n\nX\nn\n\n(0)\n\ne−βEn\n\nX\nm\n\n(0)\n\n| hn|M |mi0 |2 e−it(Em\n\n(0)\n(1)\n(1)\n−En\n)−itλ(Em\n−En\n)\n\n+***\n\n(D.9)\n\nAs we discussed in the main text, the sum over m in the above equation will involve\nan exponentially large number of states with free theory energies ranging over of order\n(1)\n\n(1)\n\nO(N ). A naive estimate of Em − En also gives order O(N ). Here unfortunately the\n\nstory appears to be rather complicated and it appears it is not possible to extract a\ndivergent time scale 1/λT from (D.9).\nIn summary, the Feynman diagram argument demonstrates the breakdown of perturbation theory, but does not tell us why or how it breaks down. It is certainly possible that\ncompletely different mixing behaviors in the energy levels may be reflected similarly by\n\nFeynman diagrams. In the anharmonic oscillator example discrete levels mix, while in the\nmatrix quantum mechanics a quasi-continuous spectrum mixes. One must be very careful\nin extrapolating the results for an anharmonic oscillator to a matrix quantum mechanics.\n\nAppendix E. Estimate of various quantities\nWe now estimate (6.8)–(6.11) after averaging them over states of similar energies.\nWe will be interested in how these quantities scale with N in the large N limit. An\nimportant property that we will assume below for these averaged quantities is that they\nare slow-varying functions of ǫ or E. In the large N limit, we can then estimate them using\nthe corresponding thermal averages, which can in turn be expressed in terms of various\ncorrelation functions at finite temperature. For example, the thermal average of Σi is\nZ\n1\n1 X −βEi\nb\ne\nΣi =\ndE e−βE Ω(E) Σ(E)\n(E.1)\nΣ(β) =\nZ i\nZ\n41\n\n\fwhere Σ(E) is the microcanonical average and Ω(E) = eS(E) the density of states. Since\nΣ(E) is a slow-varying function of E, we can perform a saddle point approximation of the\nlast expression, yielding\nwith βE determined by\nas\n\n∂S(E)\n∂E\n\nb E ) 1 + O(1/N 2 )\nΣ(E) ≈ Σ(β\n\n\u0001\n\n(E.2)\n\nb\n= βE . Using the last equality of (6.11) we can write Σ(β)\n\n1 X −βEi\nb\nΣ(β)\n=\ne\n| hi|V |ji |2\nZ\ni,j,i6=j\n\n(E.3)\n\n= hV (0)V (0)iβ\n\nwhere hV (0)V (0)iβ denotes the connected Wightman function as defined by (B.3). From\nthe standard large N scaling argument (E.3) is of order O(N 2 ) (recall that we include a\n\nfactor of N in the definition of V ). Thus unless (E.3) is zero at leading order we conclude\nthat Σ(E) can be written in a form\nΣ(E) = N 2 h(λ, E/N 2 )\n\n(E.4)\n\nwhere h(λ, μ) is a function independent of N . An exactly parallel argument can be applied\nto σ(ǫ) in which case (E.3) is replaced by expectation values in free theory and thus we\nfind that\nfor some function e\nh.\n\nσ(ǫ) = N 2 e\nh(λ, ǫ/N 2 )\n\nAs another example, let us look at the thermal average of (6.10),\nZ\n1\n1 X −βEi\nǫi =\ne\ndE e−βE Ω(E) ǫ(E) ≈ ǫ(Eβ )\nZ i\nZ\n\n(E.5)\n\n(E.6)\n\nUsing the last equality of (6.10), the left hand side of (E.6) can in turn be written as\nEβ − hV iβ\n\n(E.7)\n\nwhere hV iβ is the thermal one-point function of V in the interacting theory and scales\n\nwith N as O(N 2 ). Thus we can write\n\nǫ(E) = N 2 g(λ, E/N 2)\n\n(E.8)\n\nfor some function h. An exactly parallel argument yields\nE(ǫ) = N 2 e\ng (λ, ǫ/N 2 ) .\n\n(E.9)\n\nTo summarize, we find that the averaged values of Γ(ǫ) and ∆(E) are both of order\nO(N ) in the 't Hooft limit for any nonzero λ. Thus in the large N limit, both the correlation\nlength between interacting theory energy levels and the energy range that the free theory\nstates are mixed under perturbation go to infinity.\n42\n\n\fAppendix F. Some useful relations\nIn this appendix we derive some important relations which will be used in Appendix G\nto derive the matrix elements of an operator O between generic states in the high energy\n\nsector.\n\nF.1. Density of states\nThe conservation of states implies that the density of states Ω(E) of the full theory\nand Ω0 (ǫ) of the free theory should be related by\nΩ(E) = Ω0 (ǫ(E))\n\ndǫ(E)\ndE\n\n(F.1)\n\nwhich implies\ndǫ(E)\n1\ndΩ0\n1 dΩ(E)\n=\nΩ(E) dE\ndE Ω0 (ǫ(E)) dǫ\n\n+\nǫ(E)\n\nd2 ǫ(E)\ndE 2\ndǫ(E)\ndE\n\nIn the large N limit the second term in the above equation should be of order O(1/N 2 ).\nThus we find that\nβ(E) = β0 (ǫ(E))\n\ndǫ(E)\ndE\n\n(F.2)\n\nwith\nβ(E) =\n\n1 dΩ(E)\n,\nΩ(E) dE\n\nβ0 (ǫ) =\n\n1 dΩ0\n.\nΩ0 (ǫ) dǫ\n\n(F.3)\n\nWe also expect that\nǫ(E(ǫ)) ≈ ǫ\n\n(F.4)\n\nNote that all the above relations are valid only to leading order in N .\nF.2. Properties of χE (ǫ) and ρǫ (E)\nConsider the microcanonical average of (6.5) and (6.6), which we denote as ρǫ (E) and\nχE (ǫ) respectively. From (6.5) and (6.6) one should have\nρǫ (E) =\nFrom (6.7) we should also have\n\nZ\n\nΩ(E)\nχE (ǫ) .\nΩ0 (ǫ)\n\ndǫ χE (ǫ) = 1\n43\n\n(F.5)\n\n(F.6)\n\n\fand\n\nZ\n\n1\ndE ρǫ (E) =\nΩ0 (ǫ)\n\nZ\n\ndE Ω(E) χE (ǫ) = 1 .\n\n(F.7)\n\nZ\n\n(F.8)\n\nGiven that\nZ\n\nǫ(E) =\n\n2\n\ndǫ ǫ χE (ǫ),\n\nΣ(E) = ∆ (E) =\n\ndǫ (ǫ − ǫ(E))2 χE (ǫ)\n\nwe can write χE (ǫ) as\nχE (ǫ) = fE (ǫ − ǫ(E))\n\n(F.9)\n\nwith fE a function which has a spread of ∆(E) ∼ O(N ). Since we expect fE (ω) to fall off\n\nquickly to zero in the large N limit outside the range (− 12 ∆(E), 12 ∆(E)), equations (F.6)\nand (F.7) lead to\n\nZ\n\n∞\n\ndω fE (ω) = 1\n\n(F.10)\n\n−∞\n\nand\n\nZ\n\n∞\n\ndE\n\n−∞\n\nΩ(E)\nfE (ǫ − ǫ(E)) = 1\nΩ0 (ǫ)\n\n(F.11)\n\nChanging the integration variable of (F.11) to ǫ′ = ǫ(E) and using (F.4), we find that\nZ\n\nΩ0 (ǫ′ )\ndǫ\nf ′ (ǫ − ǫ′ ) =\nΩ0 (ǫ) E(ǫ )\n′\n\nZ\n\n∞\n\n−∞\n\ndω fE(ǫ) (ω)\n\nΩ0 (ǫ − ω)\n=1\nΩ0 (ǫ)\n\n(F.12)\n\nwhere in the second expression we have replaced fE(ǫ′ ) by fE(ǫ) . This is because, as a\n′\n\nfunction of ǫ − ǫ′ , the spread of f is of order O(N ), while E(ǫ′ ) ≈ E(ǫ) + O( ǫN−ǫ\n2 ) ≈ E(ǫ).\n\nThe second expression of (F.12) can now be written as\nZ\n\n∞\n\ndωfE (ω)e−β0 (ǫ(E))ω = 1\n\n(F.13)\n\n−∞\n\nEquations (F.10) and (F.13) can be written in a more symmetric manner as\nZ\n\n∞\n\ndω e\n\n1\n2 β(E)ω\n\ngE (ω) =\n\n−∞\n\nZ\n\n∞\n\n1\n\ndω e− 2 β(E)ω gE (ω) = 1\n\n(F.14)\n\n−∞\n\nwhere we have introduced a function\n− 21 β(E)ω dǫ(E)\n\ngE (ω) = e\n\ndE\n\nfE\n\n\u0012\n\ndǫ(E)\nω\ndE\n\n\u0013\n\n.\n1\n\n(F.15)\n\nEquations (F.14) imply that gE (ω) should fall off faster than e− 2 β(E)|ω| as ω → ±∞.\n44\n\n\fF.3. A relation between matrix elements and correlation functions in free theory\nIn this subsection we derive in free theory a relation between the matrix elements of\nan operator O between states in the high energy sector and correlation functions. For\n\nsimplicity we consider theories with a single fundamental frequency ω0 , like N = 4 SYM\n\nor (2.3).\n\n(0)\n\nThe Lehmann spectral decomposition for frequency space Wightman function G+ (ω)\nof some operator O in free theory can be written as\n(0)\n\nG+ (ω) =\n\n1 X −βǫa\ne\nρab δ(ω − ǫb + ǫa )\nZ0\n\n(F.16)\n\na,b\n\nwhere ρab = | ha|O(0)|bi |2 . Due to energy conservation, O can only connect levels whose\n\nenergy differences lie between −∆ω0 and ∆ω0 , where ∆ is the dimension of O, i.e. ρab can\n\nonly be non-vanishing for |ǫa − ǫb | ≤ ∆ω0 . We can thus rewrite (F.16) as\n(0)\nG+ (ω)\n\n∆\n1 X\nGk δ(ω − kω0 )\n=\nZ0\n\n(F.17)\n\nk=−∆\n\nwith\n\nX\n1 X −βǫa\ne\nρab\nZ0 a\nǫb =ǫa +kω0\nX\n1\ne−βǫa ρk (a)\n=\nZ0 a\n\nGk =\n\nwhere\n\nP\n\nǫb =ǫ\n\n(F.18)\n\ndenotes that one sums over |bi whose energy is given by ǫb = ǫ. Note here\n\nwe have assumed that the free theory energy levels are equally spaced as in N = 4 SYM\ntheory on S 3 . We also introduced\n\nρk (a) =\n\nX\n\nρab\n\n(F.19)\n\nǫb =ǫa +kω0\n\nWe now separate the sum a in (F.18) in terms of energies and degeneracies, i.e.\nX\na\n\nWe thus find that\nGk =\n\n=\n\nXX\nǫ\n\nǫa =ǫ\n\n1 X\nN (ǫ)e−βǫ ρk (ǫ)\nZ0 ǫ\n45\n\n(F.20)\n\n\fwhere we have introduced the micro-canonical average of ρk (b)for energy ǫ\nρk (ǫ) =\n\n1 X\n1 X\nρk (a) =\nN (ǫ) a∈ǫ\nN (ǫ) ǫ =ǫ\na\n\nX\n\nρab .\n\n(F.21)\n\nǫb =ǫ+kω0\n\nWe expect that the microcanonical average ρk (ǫ) should be a slow varying function of\nǫ, i.e. it can be written in a form N α f (ǫ/N 2 ) for some constant α. In the large N\nlimit since N (ǫ)e−βǫ is sharply peaked at ǫβ specified by, one can perform a saddle point\n\napproximation in (F.20) to get\n\nGk = ρk (ǫβ ) + * * *\n\n(F.22)\n\n¿From (F.16) we thus find that\nG+ (ω) =\n\nX\nk\n\nρk (ǫβ )δ(ω − kω0 )\n\n(F.23)\n\nIn the large N limit since the connected part of G+ (ω) scales with N as O(N 0 ), thus we\nfind from (F.23) that\nρk (ǫβ ) ∼ O(N 0 ) .\n\n(F.24)\n\nAppendix G. Derivation of matrix elements\nIn this appendix we give a derivation of (6.14). The main object of interests to us is\nρij =\n\nX\na,b\n\n=\n\nX\na\n\n|cia |2 |cjb |2 ρab\n|cia |2\n\nX\n\nX\n\nk ǫb =ǫa +kω0\n\n|cjb |2 ρab\n\nDue to the sparse and random nature of ρab , one cannot naively approximate the sums\nover a and b in by integrals. Instead one must be careful with the discreteness nature of\nthe sum. Note that\nX\n\nǫb =ǫa +kω0\n\n|cjb |2 ρab ≈ cj (ǫa + k)\n\nX\n\nρab = cj (ǫa + k)ρk (a)\n\nǫb =ǫa +kω0\n\nwhich can be justified as follows. Inside a given energy shell, ρab can be treated as a\nrandom sparse matrix. Thus one can treat the summand as a random sampling of |cjb |2 .\n46\n\n\fSince the number of sampling points goes to infinity (as a power in N ) in the large N\nlimit, we can approximate |cjb |2 by its average value of the energy shell. We now have\nρij =\n\nXX\nk\n\n=\n\nk\n\n=\n\na\n\nXX\n\ncj (ǫ + k)\n\nǫ\n\nXX\nk\n\n|cia |2 cj (ǫa + k)ρk (a)\nX\n\nǫa =ǫ\n\n|cia |2 ρk (a)\n\n(G.1)\n\ncj (ǫ + k)N (ǫ)ci (ǫ)ρk (ǫ)\n\nǫ\n\nIn the second line above we separated the sum over all states a into the sum over the\nenergy and the sum over states in each energy shell. In the third line we replaced the sum\nin an energy shell by its average values. The replacement is all right since |cia |2 and ρk (a)\nare completely independent variables, so the average of their product should factorize.\n\nNow given that all quantities in the last line of (G.1) are averaged quantities, we\napproximate the sum over ǫ by an integral. Averaging i, j over states of the same energy\nand using (6.6), we find\nρE1 E2 =\n\nXZ\n\ndǫ\nχE (ǫ + k)χE1 (ǫ) ρk (ǫ)\nΩ0 (ǫ + k) 2\n\nk\n\n=\n\nXZ\n\ndǫ\nfE (ǫ + k − ǫ2 )fE1 (ǫ − ǫ1 ) ρk (ǫ)\nΩ0 (ǫ + k) 2\n\nk\n\n=\n\nXZ\n\n(G.2)\n\ndp\n1\n1\nfE2 (p + k + ∆12 )fE1 (p − ∆12 ) ρk (p + ǫ12 )\nΩ0 (ǫ12 + p + k)\n2\n2\n\nk\n\nwith\nǫ1,2 = ǫ(E1,2 ),\n\nǫ12 =\n\n1\n(ǫ(E1 ) + ǫ(E2 )) = ǫ(E),\n2\n\n∆12 = ǫ(E1 ) − ǫ(E2 ) =\n\ndǫ(E)\ndE\n\nω\nE\n\nwhere\nE=\n\nE1 + E2\n,\n2\n\nω = E1 − E2\n\nEquation (G.2) can be further simplified as\nρE1 E2\n\n1 X\nG12 (k)\n=\nΩ(E)\nk\n\nZ\n\n∞\n\n1\n1\ndp gE (p + k ′ + ω) gE (p − ω)\n2\n2\n−∞\n\n1\n=\nA(ω; E)\nΩ(E)\n47\n\n(G.3)\n\n\fwith\n1\n\nG12 (k) = e− 2 β0 (ǫ12 )k ρk (ǫ12 ),\n\nk′ =\n\n1\ndǫ(E)\ndE\n\nk\n\n(G.4)\n\nand gE (ω) was defined in (F.15). Note that from equation (F.23), G12 are essentially\nthe Fourier components of free theory correlation functions. A(ω; E) should be a smooth\nfunction of ω since the integral in (G.3) appears to be well defined for all ω. It is easy to\ncheck that\nA(−ω; E) = A(ω; E)\n\n(G.5)\n\nsince G12 (k) = G12 (−k). Further as ω → ∞, we find that\n1\n\nA(ω; E) ∝ e− 2 β(E)|ω| .\n\n(G.6)\n\nNow let us examine possible singularities of A(ω, E) on the real axis. We start with\nthe definition (F.9) of fE . Since χE (ǫ) is the average of (6.6) over states of similar energies,\nfE (ω) must be a real positive function of ω ∈ R. Then the function gE (ω) introduced in\n\n(F.15) should also be real and positive as ǫ(E) is a monotonous function of E. The posi-\n\ntivity and normalization conditions (F.14) imply that gE (ω) can at most have integrable\nsingularities of the form49\ngE (ω) ≈\n\nKi\n,\n|ω − ωi |αi\n\nω → ωi ,\n\nαi < 1\n\n(G.7)\n\nNote that the closer αi is to one the smaller is Ki from the normalization requirement.\nNow let us look at the definition (G.3) of A(ω; E),\nA(ω; E) =\n\nX\n\nG12 (k)s(ω + k)\n\n(G.8)\n\nk\n\nwhere\ns(ω) =\n\nZ\n\n∞\n\n1\n1\ndx gE (x + ω) gE (x − ω) .\n2\n2\n−∞\n\n(G.9)\n\nNote that the finite sum over k in (G.8) cannot introduce singularities in ω therefore we\n1\n\nfocus on s(ω). As gE (ω) falls off faster than e− 2 β(E)|ω| as ω → ±∞, the integral in (G.9)\n49\n\nSuch integrable singularities can only arise if cia have accumulation points in the large N\n\nlimit. While it appears unlikely that this can happen, we do not have a rigorous proof at the\nmoment.\n\n48\n\n\fis convergent for x → ±∞. Thus we only need to worry about possible divergences arising\n\nfrom the middle of the integration range. Integrating (G.9) we find that\nZ\n\n∞\n\ndωs(ω) =\n−∞\n\nZ\n\n∞\n\ndxgE (x)\n\nZ\n\n∞\n\ndygE (y)\n\n(G.10)\n\n−∞\n\n−∞\n\nwhich is finite by (F.14) . Therefore the only singularities allowed for s(ω) are of integrable kind\n\nK\n|ω−ωs |α\n\nwith α < 1. We can find the locations of ωs in terms of (integrable)\n\nsingularities of gE (ω) as follows. Since gE (x − 21 ω) and gE (x + 12 ω) are both integrable the\n\nonly possible divergences of (G.9) are at values of ω for which the integrable singularities\nof two function sit on top of each other. This happens for ω = ωi − ωj where the ωi are\n\nthe locations of the singularities for gE (ω). For ω = ωi − ωj + ǫ with ǫ small the integral\nRδ\n(G.9) near x ≈ 12 (ωi + ωj ) can be written as Ki Kj −δ dy |y− 1 ǫ|αj1|y+ 1 ǫ|αi where δ is some\n2\n\n2\n\nmultiple of ǫ. By rescaling we see that it behaves as ǫ1−αi −αj . Therefore the integral s(ω)\n\ncan at most have a singularity of the form\n\nKi Kj\n|ω−ωi +ωj |α\n\nwith α = αi + αj − 1 < 1.\n\nThus we conclude that on the real axis A(ω; E) can have at most integrable singularities of the form\nA(ω; E) ∝\n\n1\n,\n|ω − ωs |αs\n\n49\n\nαs < 1 .\n\n(G.11)\n\n\fReferences\n[1] J. M. Bardeen, B. Carter and S. W. Hawking, \"The Four laws of black hole mechanics,\"\nCommun. Math. Phys. 31, 161 (1973).\n[2] J. D. Bekenstein, \"Black holes and entropy,\" Phys. Rev. D 7, 2333 (1973); J. D. Bekenstein, \"Generalized second law of thermodynamics in black hole physics,\" Phys. Rev.\nD 9, 3292 (1974).\n[3] S. W. Hawking, \"Particle Creation By Black Holes,\" Commun. Math. Phys. 43, 199\n(1975) [Erratum-ibid. 46, 206 (1976)].\n[4] R. Penrose, \"Singularities And Time Asymmetry,\" in General Relativity: An Einstein\nCentenary Survey, edited by S. W. Hawking and W. Israel (Cambridge Univ. Press,\nCambridge, England, 1979).\n[5] J. M. Maldacena, \"The large N limit of superconformal field theories and supergravity,\" Adv. Theor. Math. Phys. 2, 231 (1998) [Int. J. Theor. Phys. 38, 1113 (1999)]\n[arXiv:hep-th/9711200].\n[6] E. Witten, \"Anti-de Sitter space and holography,\" Adv. Theor. Math. Phys. 2, 253\n(1998) [arXiv:hep-th/9802150].\n[7] S. S. Gubser, I. R. Klebanov and A. M. Polyakov, \"Gauge theory correlators from\nnon-critical string theory,\" Phys. Lett. B 428, 105 (1998) [arXiv:hep-th/9802109].\n[8] E. Witten, \"Anti-de Sitter space, thermal phase transition, and confinement in gauge\ntheories,\" Adv. Theor. Math. Phys. 2, 505 (1998) [arXiv:hep-th/9803131].\n[9] J. M. Maldacena, \"Eternal black holes in Anti-de-Sitter,\" arXiv:hep-th/0106112.\n[10] T. Banks and W. Fischler, \"Space-like singularities and thermalization,\" arXiv:hepth/0606260.\n[11] J. L. F. Barbon and E. Rabinovici, \"Topology change and unitarity in quantum black\nhole dynamics,\" hep-th/0503144; J. L. F. Barbon and E. Rabinovici, \"Long time scales\nand eternal black holes,\" Fortsch. Phys. 52, 642 (2004) hep-th/0403268; J. L. F. Barbon and E. Rabinovici, \"Very long time scales and black hole thermal equilibrium,\"\nJHEP 0311, 047 (2003) hep-th/0308063.\n[12] M. Kleban, M. Porrati and R. Rabadan, JHEP 0410, 030 (2004) [arXiv:hepth/0407192].\n[13] G. T. Horowitz and J. M. Maldacena, JHEP 0402, 008 (2004) [arXiv:hep-th/0310281].\n[14] S. D. Mathur, Fortsch. Phys. 53, 793 (2005) [arXiv:hep-th/0502050].\n[15] D. A. Lowe and L. Thorlacius, Phys. Rev. D 73, 104027 (2006) [arXiv:hep-th/0601059].\n[16] V. Balasubramanian, D. Marolf and M. Rozali, arXiv:hep-th/0604045.\n[17] D. Birmingham, I. Sachs and S. N. Solodukhin, \"Relaxation in conformal field theory,\nHawking-Page transition, and quasinormal/normal modes,\" Phys. Rev. D 67, 104026\n(2003) [arXiv:hep-th/0212308]. S. N. Solodukhin, \"Can black hole relax unitarily?,\"\n50\n\n\f[18]\n\n[19]\n[20]\n[21]\n\n[22]\n[23]\n[24]\n\n[25]\n[26]\n[27]\n[28]\n[29]\n[30]\n[31]\n[32]\n[33]\n\n[34]\n[35]\n[36]\n[37]\n\narXiv:hep-th/0406130. S. N. Solodukhin, \"Restoring unitarity in BTZ black hole,\"\nPhys. Rev. D 71, 064006 (2005) [arXiv:hep-th/0501053].\nM. Li, \"Evidence for large N phase transition in N = 4 super Yang-Mills theory at finite\ntemperature,\" JHEP 9903, 004 (1999) [arXiv:hep-th/9807196]; Y. h. Gao and M. Li,\n\"Large N strong/weak coupling phase transition and the correspondence principle,\"\nNucl. Phys. B 551, 229 (1999) [arXiv:hep-th/9810053].\nS. A. Hartnoll and S. Prem Kumar, JHEP 0512, 036 (2005) [arXiv:hep-th/0508092].\nN. w. Kim, T. Klose and J. Plefka, \"Plane-wave matrix theory from N = 4 super\nYang-Mills on R x S**3,\" Nucl. Phys. B 671, 359 (2003) [arXiv:hep-th/0306054].\nO. Aharony, J. Marsano, S. Minwalla, K. Papadodimas and M. Van Raamsdonk, \"A\nfirst order deconfinement transition in large N Yang-Mills theory on a small S 3 ,\" Phys.\nRev. D 71, 125018 (2005) [arXiv:hep-th/0502149].\nS. W. Hawking and D. N. Page, Commun. Math. Phys. 87, 577 (1983).\nB. Sundborg, Nucl. Phys. B 573, 349 (2000) [arXiv:hep-th/9908001].\nO. Aharony, J. Marsano, S. Minwalla, K. Papadodimas and M. Van Raamsdonk, \"The\nHagedorn / deconfinement phase transition in weakly coupled large N gauge theories,\"\nAdv. Theor. Math. Phys. 8, 603 (2004) [arXiv:hep-th/0310285].\nC. B. Thorn, \"Infinite N(C) QCD At Finite Temperature: Is There An Ultimate\nTemperature?,\" Phys. Lett. B 99, 458 (1981).\nV.I. Arnold, A. Avez, \"Ergodic problems of classical mechanics,\" Redwood City, Calif.\n: Addison-Wesley, the Advanced Book Program, c1989.\nL. G. Yaffe, Rev. Mod. Phys. 54, 407 (1982).\nG. Festuccia and H. Liu, \"Excursions beyond the horizon: Black hole singularities in\nYang-Mills JHEP 0604, 044 (2006) [arXiv:hep-th/0506202].\nL. Fidkowski, V. Hubeny, M. Kleban and S. Shenker, \"The black hole singularity in\nAdS/CFT,\" JHEP 0402, 014 (2004) [arXiv:hep-th/0306170].\nA. J. Niemi and G. W. Semenoff, Annals Phys. 152, 105 (1984).\nM. Brigante, G. Festuccia and H. Liu, \"Inheritance principle and non-renormalization\ntheorems at finite Phys. Lett. B 638, 538 (2006) [arXiv:hep-th/0509117].\nJ. M. Maldacena and L. Susskind, Nucl. Phys. B 475, 679 (1996) [arXiv:hepth/9604042].\nV. Balasubramanian, P. Kraus and M. Shigemori, \"Massless black holes and black\nrings as effective geometries of the D1-D5 system,\" Class. Quant. Grav. 22, 4803\n(2005) [arXiv:hep-th/0508110].\nG. 't Hooft, Nucl. Phys. B 538, 389 (1999) [arXiv:hep-th/9808113].\nD. J. Gross and A. Neveu, Phys. Rev. D 10, 3235 (1974).\nB. Lautrup, Phys. Lett. B 69, 109 (1977).\nG. 't Hooft, in The Whys of subnuclear physics, Proc. Int. School, Erice, Italy, 1977,\ned. A. Zichichi (Plenum, New York, 1978.\n51\n\n\f[38] D. J. Gross, R. D. Pisarski and L. G. Yaffe, Rev. Mod. Phys. 53, 43 (1981).\n[39] K. Furuuchi, Phys. Rev. D 72, 066009 (2005) [arXiv:hep-th/0505148].\n[40] E. Wigner, \"Characteristics Vectors of Bordered Matrices with Infinite Dimensions,\"\nAnn.Math. 62 548 (1955), 65 203 (1957),\n[41] Fyodorov, Y. V. and Chubykalo, O A. and Izrailev, F. M and Casati, G., \"Wigner\nRandom Banded Matrices with Sparse Structure: Local Spectral Density of States,\"\nPhys. Rev. Lett. 76, 1603 (1996)\n[42] A. Donovan, G. Festuccia and H. Liu, in progress.\n[43] See e.g. J. A. Minahan and K. Zarembo, JHEP 0303, 013 (2003) [arXiv:hepth/0212208]; N. Beisert, C. Kristjansen and M. Staudacher, Nucl. Phys. B 664, 131\n(2003) [arXiv:hep-th/0303060]. I. Bena, J. Polchinski and R. Roiban, Phys. Rev. D\n69, 046002 (2004) [arXiv:hep-th/0305116]. V. A. Kazakov, A. Marshakov, J. A. Minahan and K. Zarembo, JHEP 0405, 024 (2004) [arXiv:hep-th/0402207]. M. Staudacher,\nJHEP 0505, 054 (2005) [arXiv:hep-th/0412188]. N. Beisert and M. Staudacher, Nucl.\nPhys. B 727, 1 (2005) [arXiv:hep-th/0504190].\n[44] V. E. Hubeny, H. Liu and M. Rangamani, arXiv:hep-th/0610041.\n[45] A. Peres, Phys. Rev. A 30 (1984) 504.\n[46] M. Sredicki, J. Phys. A 32 (1999) 1163; cond-mat/9809360.\n[47] T. S. Biro, C. Gong and B. Muller, Phys. Rev. D 52, 1260 (1995) [arXiv:hepph/9409392]; B. Muller and A. Trayanov, Phys. Rev. Lett. 68, 3387 (1992). T. S. Biro,\nM. Feurstein and H. Markum, Heavy Ion Phys. 7, 235 (1998) [arXiv:hep-lat/9711002].\n[48] S. Kalyana Rama and B. Sathiapalan, Mod. Phys. Lett. A 14, 2635 (1999) [arXiv:hepth/9905219].\n[49] M. Srednicki, arXiv:hep-th/0207090.\n[50] V. A. Belinskii, I. M. Khalatnikov, and E. M. Lifshitz, Adv. Phys. 19, 525 (1970).\n[51] M. Le Bellac, \"Thermal field theory,\" Cambridge, New York: Cambridge University\nPress, 1996.\n[52] G.J. Rodgers, A.J. Bray, \"Density of states of a sparse random matrices\" PRB 37, 7\n(1988) 3557\n[53] A.D. Mirlin, Yan Fyodorov, \"Universality of level correlation functions of sparse random matrices\" J.Phys. A: Math. Gen. 24 (1991) 2273-2286\n[54] G. Semerjian et al, \"Sparse random matrices: the eigenvalue spectrum revisited\" J.\nPhys. A: Math. Gen. 35 (2002) ( 4837-4851\n\n52\n\n\f"}