{"id": "http://arxiv.org/abs/hep-th/0612133v1", "guidislink": true, "updated": "2006-12-13T17:48:52Z", "updated_parsed": [2006, 12, 13, 17, 48, 52, 2, 347, 0], "published": "2006-12-13T17:48:52Z", "published_parsed": [2006, 12, 13, 17, 48, 52, 2, 347, 0], "title": "Geometry for the accelerating universe", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-th%2F0612304%2Chep-th%2F0612279%2Chep-th%2F0612128%2Chep-th%2F0612305%2Chep-th%2F0612202%2Chep-th%2F0612088%2Chep-th%2F0612049%2Chep-th%2F0612237%2Chep-th%2F0612139%2Chep-th%2F0612100%2Chep-th%2F0612293%2Chep-th%2F0612048%2Chep-th%2F0612271%2Chep-th%2F0612127%2Chep-th%2F0612005%2Chep-th%2F0612308%2Chep-th%2F0612195%2Chep-th%2F0612175%2Chep-th%2F0612182%2Chep-th%2F0612251%2Chep-th%2F0612265%2Chep-th%2F0612167%2Chep-th%2F0612020%2Chep-th%2F0612104%2Chep-th%2F0612193%2Chep-th%2F0612168%2Chep-th%2F0612112%2Chep-th%2F0612164%2Chep-th%2F0612113%2Chep-th%2F0612030%2Chep-th%2F0612072%2Chep-th%2F0612115%2Chep-th%2F0612204%2Chep-th%2F0612187%2Chep-th%2F0612017%2Chep-th%2F0612107%2Chep-th%2F0612300%2Chep-th%2F0612058%2Chep-th%2F0612280%2Chep-th%2F0612051%2Chep-th%2F0612082%2Chep-th%2F0612160%2Chep-th%2F0612152%2Chep-th%2F0612295%2Chep-th%2F0612299%2Chep-th%2F0612022%2Chep-th%2F0612309%2Chep-th%2F0612306%2Chep-th%2F0612042%2Chep-th%2F0612033%2Chep-th%2F0612258%2Chep-th%2F0612267%2Chep-th%2F0612052%2Chep-th%2F0612083%2Chep-th%2F0612053%2Chep-th%2F0612211%2Chep-th%2F0612203%2Chep-th%2F0612144%2Chep-th%2F0612273%2Chep-th%2F0612068%2Chep-th%2F0612235%2Chep-th%2F0612207%2Chep-th%2F0612134%2Chep-th%2F0612220%2Chep-th%2F0612123%2Chep-th%2F0612077%2Chep-th%2F0612102%2Chep-th%2F0612021%2Chep-th%2F0612289%2Chep-th%2F0612143%2Chep-th%2F0612044%2Chep-th%2F0612210%2Chep-th%2F0612180%2Chep-th%2F0612249%2Chep-th%2F0612242%2Chep-th%2F0612225%2Chep-th%2F0612016%2Chep-th%2F0612133%2Chep-th%2F0612264%2Chep-th%2F0612125%2Chep-th%2F0612222%2Chep-th%2F0612206%2Chep-th%2F0612025%2Chep-th%2F0612186%2Chep-th%2F0612131%2Chep-th%2F0612028%2Chep-th%2F0612234%2Chep-th%2F0612282%2Chep-th%2F0612157%2Chep-th%2F0612062%2Chep-th%2F0612056%2Chep-th%2F0612129%2Chep-th%2F0612239%2Chep-th%2F0612050%2Chep-th%2F0612096%2Chep-th%2F0612035%2Chep-th%2F0612163%2Chep-th%2F0612191%2Chep-th%2F0612291%2Chep-th%2F0612146%2Chep-th%2F0612290&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Geometry for the accelerating universe"}, "summary": "The Lorentzian spacetime metric is replaced by an area metric which naturally\nemerges as a generalized geometry in quantum string and gauge theory. Employing\nthe area metric curvature scalar, the gravitational Einstein-Hilbert action is\nre-interpreted as dynamics for an area metric. Without the need for dark energy\nor fine-tuning, area metric cosmology explains the observed small acceleration\nof the late Universe.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-th%2F0612304%2Chep-th%2F0612279%2Chep-th%2F0612128%2Chep-th%2F0612305%2Chep-th%2F0612202%2Chep-th%2F0612088%2Chep-th%2F0612049%2Chep-th%2F0612237%2Chep-th%2F0612139%2Chep-th%2F0612100%2Chep-th%2F0612293%2Chep-th%2F0612048%2Chep-th%2F0612271%2Chep-th%2F0612127%2Chep-th%2F0612005%2Chep-th%2F0612308%2Chep-th%2F0612195%2Chep-th%2F0612175%2Chep-th%2F0612182%2Chep-th%2F0612251%2Chep-th%2F0612265%2Chep-th%2F0612167%2Chep-th%2F0612020%2Chep-th%2F0612104%2Chep-th%2F0612193%2Chep-th%2F0612168%2Chep-th%2F0612112%2Chep-th%2F0612164%2Chep-th%2F0612113%2Chep-th%2F0612030%2Chep-th%2F0612072%2Chep-th%2F0612115%2Chep-th%2F0612204%2Chep-th%2F0612187%2Chep-th%2F0612017%2Chep-th%2F0612107%2Chep-th%2F0612300%2Chep-th%2F0612058%2Chep-th%2F0612280%2Chep-th%2F0612051%2Chep-th%2F0612082%2Chep-th%2F0612160%2Chep-th%2F0612152%2Chep-th%2F0612295%2Chep-th%2F0612299%2Chep-th%2F0612022%2Chep-th%2F0612309%2Chep-th%2F0612306%2Chep-th%2F0612042%2Chep-th%2F0612033%2Chep-th%2F0612258%2Chep-th%2F0612267%2Chep-th%2F0612052%2Chep-th%2F0612083%2Chep-th%2F0612053%2Chep-th%2F0612211%2Chep-th%2F0612203%2Chep-th%2F0612144%2Chep-th%2F0612273%2Chep-th%2F0612068%2Chep-th%2F0612235%2Chep-th%2F0612207%2Chep-th%2F0612134%2Chep-th%2F0612220%2Chep-th%2F0612123%2Chep-th%2F0612077%2Chep-th%2F0612102%2Chep-th%2F0612021%2Chep-th%2F0612289%2Chep-th%2F0612143%2Chep-th%2F0612044%2Chep-th%2F0612210%2Chep-th%2F0612180%2Chep-th%2F0612249%2Chep-th%2F0612242%2Chep-th%2F0612225%2Chep-th%2F0612016%2Chep-th%2F0612133%2Chep-th%2F0612264%2Chep-th%2F0612125%2Chep-th%2F0612222%2Chep-th%2F0612206%2Chep-th%2F0612025%2Chep-th%2F0612186%2Chep-th%2F0612131%2Chep-th%2F0612028%2Chep-th%2F0612234%2Chep-th%2F0612282%2Chep-th%2F0612157%2Chep-th%2F0612062%2Chep-th%2F0612056%2Chep-th%2F0612129%2Chep-th%2F0612239%2Chep-th%2F0612050%2Chep-th%2F0612096%2Chep-th%2F0612035%2Chep-th%2F0612163%2Chep-th%2F0612191%2Chep-th%2F0612291%2Chep-th%2F0612146%2Chep-th%2F0612290&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Lorentzian spacetime metric is replaced by an area metric which naturally\nemerges as a generalized geometry in quantum string and gauge theory. Employing\nthe area metric curvature scalar, the gravitational Einstein-Hilbert action is\nre-interpreted as dynamics for an area metric. Without the need for dark energy\nor fine-tuning, area metric cosmology explains the observed small acceleration\nof the late Universe."}, "authors": ["Raffaele Punzi", "Frederic P. Schuller", "Mattias N. R. Wohlfarth"], "author_detail": {"name": "Mattias N. R. Wohlfarth"}, "author": "Mattias N. R. Wohlfarth", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.76.101501", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/hep-th/0612133v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-th/0612133v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "4 pages, 1 figure", "arxiv_primary_category": {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-th/0612133v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-th/0612133v1", "journal_reference": "Phys.Rev.D76:101501,2007", "doi": "10.1103/PhysRevD.76.101501", "fulltext": "Geometry for the accelerating universe\nRaffaele Punzi,1 Frederic P. Schuller,2 and Mattias N. R. Wohlfarth3\n1\nDipartimento di Fisica \"E. R. Caianiello\" Università di Salerno,\n84081 Baronissi (SA) Italy, and INFN - Gruppo Collegato di Salerno, Italy\n2\nInstituto de Ciencias Nucleares, Universidad Nacional Autónoma de México, A. Postal 70-543, México D.F. 04510, México\n3\nCenter for Mathematical Physics and II. Institut für Theoretische Physik,\nLuruper Chaussee 149, 22761 Hamburg, Germany\n\narXiv:hep-th/0612133v1 13 Dec 2006\n\nThe Lorentzian spacetime metric is replaced by an area metric which naturally emerges as a\ngeneralized geometry in quantum string and gauge theory. Employing the area metric curvature\nscalar, the gravitational Einstein-Hilbert action is re-interpreted as dynamics for an area metric.\nWithout the need for dark energy or fine-tuning, area metric cosmology explains the observed small\nacceleration of the late Universe.\n\nAssuming Einstein's equations for the gravitational\nfield, explanations for the observed accelerating expansion of our Universe [1, 2] require some form of dark energy [3]. In its simplest incarnation, dark energy amounts\nto a positive cosmological constant, but its conceivable\nphysical origins predict a value not even close to the required one [4]. This has prompted attempts to deform\nthe Einstein-Hilbert action for the spacetime metric [5],\nin order to avoid the introduction of dark energy. While\npartly successful, this typically just shifts the problem\nto the introduction of an unusually small deformation\nscale, and a largely ad hoc choice of the deformed action. The most serious stroke, however, is delivered by\nLovelock's theorem [6] which asserts that, in four dimensions, any action for a spacetime metric different from\nthe Einstein-Hilbert action results in field equations of\nhigher than second derivative order, with all the associated problems [7].\nIn this Letter, we circumvent both Lovelock's theorem\nand the introduction of a deformation scale by reading\nthe Einstein-Hilbert action not as an action for a spacetime metric, but as an action for an area metric. An area\nmetric is a fourth rank tensor field, which measures twodimensional tangent areas in close analogy to the way a\nmetric measures tangent vectors [8]. We show that this\nyields a consistent classical gravity theory with second\norder field equations, which is a structural, and hence\nrigid, extension of general relativity. A stunning prediction of area metric gravity is that the small accelerating\nexpansion of our Universe at late times appears as a new\nexact solution of the field equations, without any additional assumptions such as dark energy or any form of\nfine-tuning, see figure 1.\nFar from being an exotic structure, area metrics naturally emerge in the quantization of fundamental theories\nwhose classical formulation is based on a metric spacetime structure. This applies to gauge theories, gravity,\nand string theory: back-reacting photons in quantum\nelectrodynamics effectively propagate in an area metric\nbackground [9]; canonical quantization of gravity à la\nAshtekar [10] naturally leads to an area operator [11];\nthe massless states of quantum string theory give rise\n\nto the Neveu-Schwarz two-form and dilaton besides the\ngraviton, producing a generalized geometry which may\nbe neatly absorbed into an area metric; the low energy\naction for D-branes [12, 13] is a true area metric volume integral [8]. But even for classical electrodynamics,\nthe historical birthplace of metric spacetime, it has been\nobserved early on that not a spacetime metric, but an\narea metric, presents the natural and most general background structure [14]; then the deflection of light in gravitational fields becomes as rich as that in known optical\nmedia. In the mathematical literature, the idea to base\ngeometry on an area measure goes back to Cartan [15],\nwho demonstrated that metric and area metric geometry\nare equivalent in three dimensions. This reconciles the\npostulate of an area metric spacetime with the fact that\nwe can measure lengths and angles in three-dimensional\nspatial sections.\nIn four dimensions, area metric geometry is a generalization of metric geometry: while every metric induces an\narea metric, not every area metric comes from an underlying metric. As mentioned above, the additional degrees\nof freedom may be viewed as arising from string theory,\nwhere generalized geometries play an increasingly important role: different ideas by Hitchin [16] and Hull [17]\nhave been applied to understand flux compactifications\nacted on with T-dualities [18] or mirror symmetry [19],\nand compactifications with duality twists [20]. The intimate relation of an area metric spacetime structure to\nstring theory is further revealed by the fact that the minimal classical mechanical object one may discuss in an\narea metric background is a string. In the present note\nthis plays a role in our discussion of fluids in area metric\ncosmology; these cannot consist of particles, but must be\nbased on an integrable distribution of string worldsheets,\nwhich leads us to develop the notion of a string fluid.\nWe now turn to a precise geometric formulation of the\nabove ideas in four dimensions. Where detailed proofs\nare omitted, we refer the reader to our companion paper [21] for full detail. Our guiding principle in the construction of area metric gravity is downward compatibility to metric spacetime, paying tribute to the phenomenal\nsuccess of standard general relativity as a theory of grav-\n\n\f2\nity. So first consider a familiar metric manifold (M, g)\nwhich naturally induces the area metric\nCg abcd = gac gbd − gad gbd ,\n\n(1)\n\nsince Cg abcd X a Y b X c Y d measures the squared area of a\nparallelogram spanned by vectors X and Y . The basic\nidea of area metric geometry is to promote area metrics to\na structure in their own right, by keeping salient algebraic\nproperties of the metric-induced case: we define an area\nmetric spacetime (M, G) as a smooth four-dimensional\nmanifold M equipped with a fourth-rank covariant tensor\nfield G with the symmetries\nGabcd = Gcdab ,\n\nGabcd = −Gbacd ,\n\n(2)\n\nand the property that G is invertible. Here invertibility is\nunderstood as follows: due to its symmetries the indices\nof G may be combined to antisymmetric Petrov pairs\n[ab] so that G can be represented by a symmetric 6 × 6\nmatrix which is required to be non-degenerate. The determinant Det G over this 6 × 6 matrix gives rise to a volume form ωG with components ωG abcd = |Det G|1/6 ǫabcd ,\nwhere ǫ is the Levi-Civita tensor density normalized such\nthat ǫ0123 = 1. The inverse area metric G decomposes\nuniquely into a cyclic part C a[bcd] = 0 and a totally antisymmetric four-tensor that is dual to a scalar,\nabcd\nGabcd = C abcd + φωC\n.\n\n(3)\n\nWe now construct area metric curvature tensors, which\nare downward compatible to their metric counterparts,\nin two steps. First, note that (M, G) gives rise to an\neffective metric gG entirely determined by area metric\ndata. Using the above decomposition, we define\nab\ngG\n=\n\n1 ∂2\n2 ∂pa ∂pb\n\nfor the Fresnel tensor\nG ijkl = −\n\np=dφ\n\nG ijkl pi pj pk pl\n\n\u00011/2\n\n1\nωC abcd ωC pqrs C abp(i C j|cq|k C l)drs .\n24\n\n(4)\n\n(5)\n\nThis construction can be motivated in detail by considering wave propagation on area metric manifolds in the\ngeometric optics limit [21], where wavevectors k obey the\nquartic Fresnel equation G abcd ka kb kc kd = 0, see [22, 23].\nThe effective metric generally does not contain all information of the area metric, which follows from a simple\ncounting of the independent components. In particular,\nthe re-induced area measure CgG generally does not agree\nwith G in dimensions greater than three. But if we consider almost metric area metrics for which C = Cg for\nsome metric g in the decomposition (3), so that\nGabcd = g ac g bd − g ad g bc + φωgabcd ,\n\n(6)\n\nthen the effective metric gG recovers g up to a sign, showing downward compatibility at the level of the effective\n\nmetric. An important example for almost metric spacetimes is area metric cosmology: imposing isotropy and\nhomogeneity on a four-dimensional area metric, by requiring that LK G = 0 for the symmetry-generating vector fields K, leaves us with an area metric of the form (6),\nwhere g takes the standard Robertson-Walker form with\nscale factor a(t) and normalized spatial curvature k, and\nthe additional scalar φ depends only on time.\nThe effective metric gG gives rise to the torsion-free\nLevi-Civita connection ∇LC , but this is not of direct relevance for the area metric manifold (M, G). The area\nmetric is not covariantly constant under ∇LC , so that,\nfor instance, areas are not preserved under parallel transport [8]. We have to amend the connection so that\n∇G = 0, which is unique up to a symmetry condition,\nand leads to the following covariant derivative [21] on\nantisymmetric tensors Ω:\n1\nab\n(∇f Ω)ab = (∇LC\n+ X ab cdf Ωcd ,\nf Ω)\n2\n\n(7)\n\nwith the tensor X ab cdf = 41 Gabij ∇LC\nf Gijcd . This construction provides a true area metric connection, without using data additional to G. This completes the second step in our construction of the area metric curvature\ntensor, whose definition is now standard: RG (X, Y )Ω =\n[∇X , ∇Y ]Ω − ∇[X,Y ] Ω, so that\n\u0010\n[a b]\nab\nR\n+\n∇LC\nRab\n=\n4δ\nd]ij\ni X cdj\nG cdij\n[c\n\u0011\n1\n(8)\n+ X ab sti X st cdj − (i ↔ j) .\n2\n\nNatural contraction yields the area metric Ricci tensor,\nand the unique area metric curvature scalar of linear order in RaG1 a2 b1 b2 ij , the area metric Ricci scalar:\nRG mn = Rpq\nG pmqn ,\n\nmn\nRG = gG\nRGmn .\n\n(9)\n\nAll of the above curvature tensors reduce to their metric counterparts if the area metric is almost metric (6).\nThus area metric geometry allows us to devise a gravity\ntheory different from Einstein's without modifying the\nform of the Einstein-Hilbert action; replacing all metric\nquantities by their area metric counterparts, the latter is\nre-interpreted as an action for an area metric manifold:\nZ\nZ\n1\nωG RG +\nLm .\n(10)\nSgrav + Sm =\n2κ M\nM\nA gravitational constant κ appears, and Lm represents\nthe matter Lagrangian density. Importantly, the equations of motion are now derived by variation with respect\nto the inverse area metric G, which leads to a fourth rank\ntensor equation\nKabcd = κTabcd ,\n\n(11)\n\nwhere we have, schematically, the gravitational variation K = |Det G|−1/6 δ(κSgrav )/δG−1 and the energy\n\n\f3\nmomentum tensor T = −|Det G|−1/6 δSm /δG−1 . Diffeomorphism invariance of the action implies an area metric Bianchi identity for the gravitational part of the action, and a conservation law for the area metric energymomentum tensor. See [21] for the full computation.\nFor applications to cosmology, where the area metric\ntakes the almost metric form (6), the full equations of\nmotion simplify considerably. Lengthy algebra reveals\nthat in the almost metric case the gravitational variation\nK is induced from a symmetric two-tensor and a scalar.\nIf the energy-momentum tensor happens to be likewise\ninduced from a symmetric second rank tensor Tab and\na scalar T φ then the full field equations (11), for φ̃ =\n(1 + φ2 )−1/2 , reduce to\n\u0011\n\u0010\n1\nκTab = Rab − Rgab − φ̃−1 ∇a ∂b φ̃ − gab \u0003φ̃ ,\n2\n\u0010\n\u00111/2\nκT φ = −φ̃ 1 − φ̃2\nR.\n(12)\nIn particular, these equations are valid in vacuo; suitable field redefinitions reveal conformal equivalence to\nEinstein gravity minimally coupled to a massless scalar\nfield. So the original vacuum theory is causal. We also\nconclude that any vacuum solution (M, g) of Einstein\ngravity is a vacuum solution of area metric gravity (setting φ̃ = 1 or φ̃ → 0 with appropriate conditions on the\nderivatives). Including matter, however, it is no longer\ntrue that all solutions of Einstein gravity lift to solutions\nof area metric gravity. The energy-momentum tensor for\nMaxwell electrodynamics on area metric spacetime, for\ninstance, is not induced from a symmetric two-tensor and\na scalar. In other words, not only is an area metric spacetime a possible background for electrodynamics, but the\nbackreaction via the area metric Einstein-Hilbert action\nrequires a truly area metric background.\nThe most prominent example of matter which is compatible with almost metric backgrounds arises in area\nmetric cosmology. Recall that in general relativity perfect fluids are the most general matter consistently coupling to cosmology, due to the way symmetries restrict\nthe energy momentum tensor. This is also the case in\narea metric geometry, which however does not admit fluids based on point particles in the first place; we have to\nresort to string fluids based on continuous distributions\nof worldsheets. A three-component string fluid with local\ntangent surfaces ΩI = ∂t ∧ vI for three g-spacelike vectors vI is required to isotropically fill the spatial sections.\nThen the general source tensor Tabcd equals\nρ̃ + p̃ X\nkl\nGabij Ωij\nI Gcdkl ΩI +p̃ Gabcd +(ρ̃+q̃)G[abcd] (13)\n4\nI\n\nin terms of three time-dependent functions ρ̃, p̃ and q̃.\nThis string fluid tensor is induced by a two-tensor and\nby a scalar, as is needed for the equations to take the\n\nsimple form (12). Using a time/space split,\nρ̃ − q̃φ2\n24φq̃\n,\nTφ =\n,\n2\n1+φ\n1 + φ2\n−ρ̃ + 2p̃ + (2ρ̃ + 2p̃ + 3q̃) φ2\n= 4\ngαβ .\n1 + φ2\n\nT00 = 12\nTαβ\n\n(14)\n\nCareful evaluation of the equations (12) now reveals a\nremarkable correspondence between, on the one hand,\narea metric cosmology (determined by g and φ) plus\nstring fluid matter (ρ̃, p̃ and q̃), and, on the other hand,\nEinstein cosmology (g) plus perfect fluid matter (ρ and\np). The effective energy density and pressure of the perfect fluid emerge as ρ = x − y and p = x + y for\nx = −H φ̃ ̇ φ̃−1 + 4κ (ρ̃ + q̃) φ̃2 ,\n\ny = 4κq̃\n\n(15)\n\nwhere H is the Hubble function. Recall φ̃ = (1 + φ2 )−1/2\nwhich obeys \u0003φ̃ = ∂V (φ̃)/∂ φ̃ with potential\nV (φ̃) = 4κ (ρ̃ + p̃ + q̃) φ̃2 − 4κ (ρ̃ + q̃) φ̃4 .\n\n(16)\n\nFor the effective equation of state parameter w = p/ρ\none obtains the following results, generic for any string\nfluid and thus for general matter in area metric cosmology. The limit y/x → 0 gives w = 1/3, i.e., an effective\nradiation fluid. This is exactly realized by area metric\nvacuum cosmology (y = 0). The limit x/y → 0 gives\nw = −1/3, i.e., a universe with zero acceleration ä = 0.\nThe condition w < −1/3 for an accelerating universe is\nsatisfied if either y < x < 0 or y > x > 0. For values\ny close to the pole in w at y = x, one may obtain any\nvalue of w, both positive or negative. So string fluids in\nprinciple are able to describe any physical universe.\nFor the late universe, matter has spread out so much\nthat interactions are no longer important, so that we may\nspecialize to non-interacting string dust, whose parameters p̃, ρ̃ and q̃ can be identified from the condition that\nenergy conservation should be implied by the minimal\nsurface equation and by a generalized continuity equation [21], which yields\np̃ = 0 ,\n\nq̃ = −ρ̃ .\n\n(17)\n\nWe now provide exact solutions for the string dust case\nwith ρ̃ 6= 0. Using R00 = −3Ḣ − 3H 2 and Rαβ =\n(2ka−2 + Ḣ + 3H 2 )gαβ one collects the full set of equations from (12) and (16). The equations of area metric\ncosmology filled with string dust then become\nφ̃ = λȧ ,\n\nρ̃ = ζa−2 ,\n\n0 = ä +\n\nȧ2 k − 4κζ\n+\n(18)\na\na\n\nfor integration constants λ and ζ, while the effective\nequation of state parameter for the perfect fluid created\nby area metric cosmology can be rewritten as\nw=\n\n1 8κ ζ\n−\n.\n3\n3 ȧ2 + k\n\n(19)\n\n\f4\n\na(t)\n2\n\n2\n\nd a/dt >0\n\nt\n\nFIG. 1: The solid curves sketch the string dust-filled area metric cosmologies: from bottom to top ξ = 0, ξ < 0 with c > 0,\nand ξ < 0 with c < 0. The dashed curve depicts the inconsistent case ξ > 0. The top curve is an important new result\nfrom area geometry (and cannot be obtained as a dust-filled\nEinstein cosmology): late-time acceleration tending to zero.\n\nThe equation for a is exactly solved by the scale factor\np\n(\nc (t − t0 )\nfor ξ = 0 ,\nq\na(t) =\n(20)\n2\ncξ −1 − ξ (t − t0 ) for ξ 6= 0 ,\n\nfor integration constants c and t0 , and ξ = k − 4κζ. We\nnow discuss the possible cases for ζ > 0 (ζ < 0 is similar,\nbut does not allow consistent k = 0 cosmologies).\nIt turns out that the case ξ > 0 does not provide a\nconsistent late-time solution, and the case ξ = 0 only\ndoes so for one particular value of ζ, which is physically\nexcluded by fine-tuning arguments. For details see [21].\nThis leaves us with the truly interesting case ξ < 0. Here\nk < 4κζ, and so this can be realized by k = −1 and\nk = 0 cosmologies without further restrictions, but also\nby k = +1 cosmologies with matter density 4ζ > 1/κ.\nThe effective equation of state parameter takes the form\n\u0011\n\u0010\n2\n2\n8κζ\nc\n−\nξ\n(t\n−\nt\n)\n0\n1\n.\n(21)\nw= −\n3 3kc − 12κζξ 2 (t − t0 )2\nWe have to discuss two subcases.\np If c > 0 then the solution is defined for t − t0 > c/ξ 2 . If c < 0 then the\nsolution is defined for all t. For both signs of c we obtain\nthe late time limit of w → −1/3. We can also\n√ check consistency for late times t− t0 → ∞: if 0 < λ −ξ this limit\nensures 0 ≤ φ̃ < 1. The solution with c > 0 corresponds\nto an open, eternally decelerating, universe with initial\nsingularity, for which the acceleration tends to zero for\nlate times. The solution for c < 0 describes an open,\neternally accelerating, universe without\nsingularities that\n√\npasses a minimal radius a(t0 ) = cξ and has a late-time\nacceleration tending to zero, see figure 1.\nSo we have shown that non-interacting string dust matter in area metric cosmology provides a more interesting phenomenology than Einstein cosmology filled with\n\npoint particle dust. Most strikingly, area metric cosmology naturally explains, for all k = 0 and k = ±1 cosmologies, the late-time acceleration of the universe! This\nexplanation neither invokes concepts such as a cosmological constant or dark energy, nor does it invoke fine-tuning\nsince the acceleration automatically tends to small values\nat late time; these results become consequences of area\nmetric geometry applied to the very simplest scenario,\ncosmology. It is remarkable that area metric geometry\nat the same time emerges from standard physical theories in a number of different places, and also, without\nfurther assumptions, addresses one of the most intriguing\ncosmological observations of recent times.\nWe have the pleasure to acknowledge useful comments\nby Gary Gibbons, Julius Wess, Alexander Turbiner, Albert Schwarz, Friedrich Hehl and Marcus Werner. This\nwork has been supported by the European Union (RP),\nDGAPA-UNAM grant IN121306 (FPS) and the DFG\nEmmy Noether grant WO 1447/1-1 (MNRW).\n\n[1] D. N. Spergel et al. [WMAP Collaboration], Astrophys.\nJ. Suppl. 148 (2003) 175.\n[2] R. A. Knop et al. [Supernova Cosmology Project Collaboration], Astrophys. J. 598 (2003) 102.\n[3] E. J. Copeland, M. Sami and S. Tsujikawa,\n[arXiv:hep-th/0603057].\n[4] S. Weinberg, Rev. Mod. Phys. 61, 1 (1989).\n[5] S. M. Carroll et al. Phys. Rev. D 71 (2005) 063513.\n[6] D. Lovelock, J. Math. Phys. 13 (1972) 874.\n[7] A. Hindawi, B. A. Ovrut and D. Waldram, Phys. Rev.\nD 53 (1996) 5583.\n[8] F. P. Schuller and M. N. R. Wohlfarth, JHEP 0602\n(2006) 059.\n[9] I. T. Drummond and S. J. Hathrell, Phys. Rev. D 22\n(1980) 343.\n[10] A. Ashtekar, Phys. Rev. Lett. 57 (1986) 2244.\n[11] C. Rovelli and L. Smolin, Nucl. Phys. B 442 (1995) 593\n[Erratum-ibid. B 456 (1995) 753].\n[12] E. S. Fradkin and A. A. Tseytlin, Phys. Lett. B 163\n(1985) 123.\n[13] R. G. Leigh, Mod. Phys. Lett. A 4 (1989) 2767.\n[14] A. Peres, Ann. Phys. 19 (1962) 279.\n[15] E. Cartan, Les espaces métriques fondés sur la notion\nd'aire, Hermann, Paris 1933.\n[16] N. Hitchin, Quart. J. Math. Oxford Ser. 54 (2003) 281.\n[17] C. M. Hull, JHEP 0510 (2005) 065.\n[18] S. Kachru, M. B. Schulz, P. K. Tripathy and S. P. Trivedi,\nJHEP 0303 (2003) 061.\n[19] S. Fidanza, R. Minasian and A. Tomasiello, Commun.\nMath. Phys. 254 (2005) 401.\n[20] A. Dabholkar and C. Hull, JHEP 0309 (2003) 054.\n[21] R. Punzi, F. P. Schuller and M. N. R. Wohlfarth, \"Area\nmetric gravity and accelerating cosmology,\" to appear.\n[22] F. W. Hehl and Y. N. Obukhov, Found. Phys. 35 (2005)\n2007.\n[23] F. W. Hehl, Yu. N. Obukhov, G. F. Rubilar and\nM. Blagojevic, Phys. Lett. A 347 (2005) 14.\n\n\f"}