{"id": "http://arxiv.org/abs/hep-th/0101118v2", "guidislink": true, "updated": "2001-07-13T18:22:49Z", "updated_parsed": [2001, 7, 13, 18, 22, 49, 4, 194, 0], "published": "2001-01-17T23:12:46Z", "published_parsed": [2001, 1, 17, 23, 12, 46, 2, 17, 0], "title": "Gravity on $AdS_3$ and flat connections in the boundary CFT", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-th%2F0611346%2Chep-th%2F0611242%2Chep-th%2F0611105%2Chep-th%2F0611272%2Chep-th%2F0611331%2Chep-th%2F0611227%2Chep-th%2F0611089%2Chep-th%2F0611327%2Chep-th%2F0611178%2Chep-th%2F0611238%2Chep-th%2F0611168%2Chep-th%2F0611302%2Chep-th%2F0611222%2Chep-th%2F0611165%2Chep-th%2F0611085%2Chep-th%2F0611013%2Chep-th%2F0611153%2Chep-th%2F0611191%2Chep-th%2F0611280%2Chep-th%2F0611155%2Chep-th%2F0611129%2Chep-th%2F0611068%2Chep-th%2F0611277%2Chep-th%2F0611058%2Chep-th%2F0611064%2Chep-th%2F0611164%2Chep-th%2F0611192%2Chep-th%2F0611158%2Chep-th%2F0611325%2Chep-th%2F0611266%2Chep-th%2F0611320%2Chep-th%2F0611044%2Chep-th%2F0611055%2Chep-th%2F0611274%2Chep-th%2F0611026%2Chep-th%2F0611306%2Chep-th%2F0611079%2Chep-th%2F0611093%2Chep-th%2F0611344%2Chep-th%2F0611340%2Chep-th%2F0611257%2Chep-th%2F0611261%2Chep-th%2F0611349%2Chep-th%2F0611177%2Chep-th%2F0101194%2Chep-th%2F0101014%2Chep-th%2F0101202%2Chep-th%2F0101126%2Chep-th%2F0101132%2Chep-th%2F0101036%2Chep-th%2F0101019%2Chep-th%2F0101118%2Chep-th%2F0101031%2Chep-th%2F0101215%2Chep-th%2F0101069%2Chep-th%2F0101027%2Chep-th%2F0101144%2Chep-th%2F0101211%2Chep-th%2F0101090%2Chep-th%2F0101163%2Chep-th%2F0101022%2Chep-th%2F0101007%2Chep-th%2F0101234%2Chep-th%2F0101165%2Chep-th%2F0101125%2Chep-th%2F0101201%2Chep-th%2F0101180%2Chep-th%2F0101140%2Chep-th%2F0101161%2Chep-th%2F0101159%2Chep-th%2F0101025%2Chep-th%2F0101123%2Chep-th%2F0101214%2Chep-th%2F0101052%2Chep-th%2F0101107%2Chep-th%2F0101182%2Chep-th%2F0101008%2Chep-th%2F0101188%2Chep-th%2F0101193%2Chep-th%2F0101018%2Chep-th%2F0101149%2Chep-th%2F0101037%2Chep-th%2F0101155%2Chep-th%2F0101045%2Chep-th%2F0101114%2Chep-th%2F0101124%2Chep-th%2F0101026%2Chep-th%2F0101005%2Chep-th%2F0101177%2Chep-th%2F0101003%2Chep-th%2F0101038%2Chep-th%2F0101166%2Chep-th%2F0101210%2Chep-th%2F0101080%2Chep-th%2F0101078%2Chep-th%2F0101015%2Chep-th%2F0101173%2Chep-th%2F0101186%2Chep-th%2F0101169%2Chep-th%2F0101098%2Chep-th%2F0101108&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Gravity on $AdS_3$ and flat connections in the boundary CFT"}, "summary": "We consider the CFT that arises from the D1-D5 system in the presence of a\nconstant background gauge potential which couples to the R-charge of the\ntheory: this potential effectively changes the periodicities of the fermions.\nBy the AdS/CFT correspondence, the effect of this connnection should be\nobtained by finding a smooth solution to the vector field in AdS space which\ncouples to the constant mode of the R-current in the CFT. We investigate such\nsolutions for small values of the connection, and contrast these with\nspacetimes which have `Wilson lines for the bulk ' -- spacetimes that are\nlocally AdS times a sphere but have a global deformation. The latter class are\nin general singular spacetimes. We comment on some aspects of the recently\nfound geometries corresponding to the D1-D5 state with angular momentum,\nobserving relations between scales in the microscopic theory and scales in the\ngeometry.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-th%2F0611346%2Chep-th%2F0611242%2Chep-th%2F0611105%2Chep-th%2F0611272%2Chep-th%2F0611331%2Chep-th%2F0611227%2Chep-th%2F0611089%2Chep-th%2F0611327%2Chep-th%2F0611178%2Chep-th%2F0611238%2Chep-th%2F0611168%2Chep-th%2F0611302%2Chep-th%2F0611222%2Chep-th%2F0611165%2Chep-th%2F0611085%2Chep-th%2F0611013%2Chep-th%2F0611153%2Chep-th%2F0611191%2Chep-th%2F0611280%2Chep-th%2F0611155%2Chep-th%2F0611129%2Chep-th%2F0611068%2Chep-th%2F0611277%2Chep-th%2F0611058%2Chep-th%2F0611064%2Chep-th%2F0611164%2Chep-th%2F0611192%2Chep-th%2F0611158%2Chep-th%2F0611325%2Chep-th%2F0611266%2Chep-th%2F0611320%2Chep-th%2F0611044%2Chep-th%2F0611055%2Chep-th%2F0611274%2Chep-th%2F0611026%2Chep-th%2F0611306%2Chep-th%2F0611079%2Chep-th%2F0611093%2Chep-th%2F0611344%2Chep-th%2F0611340%2Chep-th%2F0611257%2Chep-th%2F0611261%2Chep-th%2F0611349%2Chep-th%2F0611177%2Chep-th%2F0101194%2Chep-th%2F0101014%2Chep-th%2F0101202%2Chep-th%2F0101126%2Chep-th%2F0101132%2Chep-th%2F0101036%2Chep-th%2F0101019%2Chep-th%2F0101118%2Chep-th%2F0101031%2Chep-th%2F0101215%2Chep-th%2F0101069%2Chep-th%2F0101027%2Chep-th%2F0101144%2Chep-th%2F0101211%2Chep-th%2F0101090%2Chep-th%2F0101163%2Chep-th%2F0101022%2Chep-th%2F0101007%2Chep-th%2F0101234%2Chep-th%2F0101165%2Chep-th%2F0101125%2Chep-th%2F0101201%2Chep-th%2F0101180%2Chep-th%2F0101140%2Chep-th%2F0101161%2Chep-th%2F0101159%2Chep-th%2F0101025%2Chep-th%2F0101123%2Chep-th%2F0101214%2Chep-th%2F0101052%2Chep-th%2F0101107%2Chep-th%2F0101182%2Chep-th%2F0101008%2Chep-th%2F0101188%2Chep-th%2F0101193%2Chep-th%2F0101018%2Chep-th%2F0101149%2Chep-th%2F0101037%2Chep-th%2F0101155%2Chep-th%2F0101045%2Chep-th%2F0101114%2Chep-th%2F0101124%2Chep-th%2F0101026%2Chep-th%2F0101005%2Chep-th%2F0101177%2Chep-th%2F0101003%2Chep-th%2F0101038%2Chep-th%2F0101166%2Chep-th%2F0101210%2Chep-th%2F0101080%2Chep-th%2F0101078%2Chep-th%2F0101015%2Chep-th%2F0101173%2Chep-th%2F0101186%2Chep-th%2F0101169%2Chep-th%2F0101098%2Chep-th%2F0101108&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We consider the CFT that arises from the D1-D5 system in the presence of a\nconstant background gauge potential which couples to the R-charge of the\ntheory: this potential effectively changes the periodicities of the fermions.\nBy the AdS/CFT correspondence, the effect of this connnection should be\nobtained by finding a smooth solution to the vector field in AdS space which\ncouples to the constant mode of the R-current in the CFT. We investigate such\nsolutions for small values of the connection, and contrast these with\nspacetimes which have `Wilson lines for the bulk ' -- spacetimes that are\nlocally AdS times a sphere but have a global deformation. The latter class are\nin general singular spacetimes. We comment on some aspects of the recently\nfound geometries corresponding to the D1-D5 state with angular momentum,\nobserving relations between scales in the microscopic theory and scales in the\ngeometry."}, "authors": ["Samir D. Mathur"], "author_detail": {"name": "Samir D. Mathur"}, "author": "Samir D. Mathur", "arxiv_comment": "35 pages, harvmac, references added", "links": [{"href": "http://arxiv.org/abs/hep-th/0101118v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-th/0101118v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-th/0101118v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-th/0101118v2", "journal_reference": null, "doi": null, "fulltext": "arXiv:hep-th/0101118v2 13 Jul 2001\n\nhep-th/0101118\nOHSTPY-HEP-T-00-033\n\nGravity on AdS3 and flat connections\nin the boundary CFT\n\nSamir D. Mathur\nDepartment of Physics, The Ohio State University\nColumbus, OH. 43210, U.S.A.\n\nWe consider the CFT that arises from the D1-D5 system in the presence of a constant\nbackground gauge potential which couples to the R-charge of the theory: this potential\neffectively changes the periodicities of the fermions. By the AdS/CFT correspondence,\nthe effect of this connnection should be obtained by finding a smooth solution to the\nvector field in AdS space which couples to the constant mode of the R-current in the CFT.\nWe investigate such solutions for small values of the connection, and contrast these with\nspacetimes which have 'Wilson lines for the bulk ' – spacetimes that are locally AdS times\na sphere but have a global deformation. The latter class are in general singular spacetimes.\nWe comment on some aspects of the recently found geometries corresponding to the D1D5 state with angular momentum, observing relations between scales in the microscopic\ntheory and scales in the geometry.\n\nJanuary, 2001\n\n\f1. Introduction\nThe D1-D5 system has been crucial in the study of black holes in string theory,\nsince it provides a microscopic description of black hole entropy and Hawking radiation[1].\nAccording to the conjecture by Maldacena [2], The D1-D5 CFT is dual to IIB string theory\ncompactified on AdS3 × S 3 × M4 where the 4-manifold M4 can be T 4 or K3. When this\nduality is examined in more detail, one encounters the question of how the boundary CFT\n\nis related to the bulk spacetime [3][4]. For the Euclidean theory the CFT is placed at the\nboundary of a large ball shaped region of AdS space. For Lorentzian signature, the 'global\nAdS' space is dual to a CFT on a cylindrical boundary with the state on the cylinder being\nthe Neveu-Schwarz (NS) vaccum. The near horizon geometry of branes, on the other hand,\ngives the Poincare patch of AdS space.\nThe question that naturally arises is whether one can find a representation of the\nRamond (R) vaccum of the CFT. The zero mass BTZ black hole solution of the gravity\ntheory is expected to be a Ramond sector ground state [5][6][7]. The Ramond sector has\nperiodic fermions, while the NS sector has anti-periodic fermions. One would therefore like\nto ask if there are supergravity backgrounds with all other possible intermediate boundary\nconditions on the fermions. In particular, we can consider the CFT in the presence of a\nconstant background gauge potential coupling to the R-charge of the CFT. This R charge\nis carried by the fermions of the theory, and such a gauge potential effectively modifies the\nboundary conditions on the fermions. The family of theories with different values of the\ngauge potential can be related by a 'spectral flow'. Thus we can start with the NS vaccum\n(at zero gauge potential) and look at the states that are obtained as we continuounsly\nincrease the potential.\nThe R-symmetry of the CFT is su(2) ⊕ su(2), with the first su(2) being carried by the\n\nleft movers and the second su(2) being carried by the right movers. Let the background\n\next,a\n(a = 1, 2, 3) for the\ngauge field be called Aext\nand Aext,a\nCF T ; it will have the parts AL\nR\n\nleft and right movers. Let the currents of the CFT be J; these will have the left and right\na\nparts JLa and JR\n. At least to leading order in the potential the CFT will have an action\n\nS = S0 + Aext\nCF T J\n\n(1.1)\n\nwhere S0 is the action in the absence of any background potential. This minimal coupling\nis what we would get for example by looking at the orbifold CFT that we get at the orbifold\n1\n\n\fpoint of the D1-D5 system, and we expect that it will be valid more generally when the\ncurrent J has been appropriately defined in the presence of the gauge field.\nThe external gauge fields Aext\nCF T get related to the fields ASUGRA of the supergravity\ntheory which are dual to the CFT currents J, as follows. If φi are fields of the supergravity\ntheory dual to operators Oi in the CFT, then we compute correlators of the Oi from the\nrelation\n\nZ\n\nb\n\nb\n\nDXe−SCF T −Oi φi = e−SSU GRA (φi )\n\n(1.2)\n\nwhere the supergravity action is computed on the field configuration obtained by extremising with the φi fixed to have the values φbi at the boundary of AdS. If we want to turn\non an external gauge field in the CFT, then we would get\nZ\nZ\n−SCF T −Oi φi −Aext\nJ\nCF\nT\nDXe\n= DXe−SCF T −Oi φi [1 − Aext\nCF T J + . . .]\nb\n\n= e−SSU GRA [φi ] + Aext\nCF T [\n\nδ\n\nb\n\nδAbSUGRA\n−SSU GRA [φbi ,AbSU GRA =Aext\nCF T ]\n\nb\n\ne−SSU GRA [φi +ASU GRA ] ]Ab\n\nSU GRA\n\n=0\n\n+ . . . (1.3)\n\n=e\n\nat least to leading order in the gauge field where the issue of contact interactions between\nmultiple J insertions does not arise; we expect that with a suitable definition of the field\nb\nASUGRA any magnitide of Aext\nCF T will be identified with a value of ASUGRA .\n\nThus it would appear that to take into account a constant external gauge potential\nin the boundary CFT we must look for smooth solutions to the supergravity equations\nthat take a specified value at the boundary for the gauge field ASUGRA that is dual to\nthe current operator J in the CFT; we then evaluate all other correlation functions in the\npresence of this supergravity field.\nIn an interesting paper [8] it was argued (extending earlier results of [9]) that a family\nof AdS3 geometries with varying conical defect angles would be the gravity descriptions of\nthe family of CFT states connected by spectral flow between the NS and R sectors. These\nspacetimes had in addition to the conical defect a Wilson line of a gauge field from the\nsupergravity multiplet: this flat connection would change the boundary condition for the\nfields charged under the internal su(2) ⊕ su(2) symmetry group of the CFT.\n\nIn [8] the supergravity theory was extended supergravity in three dimensions, and the\n\ngauge fields thus arose as superpartners of the gravity fields. But if the AdS3 spacetime is\nobtained by compactification of 10-d IIB string theory, then it must be possible to identify\nthis gauge field among the fields of the 10-d supergravity multiplet, and look at the 10-d\n2\n\n\fspacetime corresponding to the spacetimes of interest. We carry out such an identification,\nand find that the IIB spacetimes that represent the AdS construction of [8] appear to be\nspacetimes that are locally AdS3 ×S 3 (we will suppress the compact manifold M4 in most of\nwhat follows) but which have identifications that make them not globally a simple product\n\nof AdS3 and S 3 . But these spacetimes are generally singular at r = 0, and thus would not\narise as smooth solutions of the supergravity fields with given values at the boundary. We\ncomment on this issue again at the end of this paper.\nIn this paper we do the following:\n(a)\n\nWe look at the fields in supergravity that carry the quantum numbers of the\n\noperators J in the CFT. We solve their coupled equations, and observe the 'chiral' nature\nof their solutions: The behavior of the field on S 3 must correlate with the behavior in\nAdS 3 . This is the case because the former derermines which su(2) out of the su(2) ⊕ su(2)\n\nR symmetry the field carries, while the behavior of the field near the AdS3 boundary\ndetermines whether it couples to left or right movers in the CFT.\n(b)\n\nWe examine the spacetimes that are locally of the form AdS3 × S 3 but are not\n\nglobally a direct product. We look at three different kinds of deformations of AdS3 × S 3\n\nin this category. We may term these deformations 'Wilson lines' of the bulk supergravity\ntheory. (By what was said above these may not represent Wilson lines in the boundary\nCFT.) These deformed spacetimes are in general singular spacetimes (except when the\n'twist' equals a multiple of 2π; then it can be removed by a coordinate transformation).\n\nWe look at the wavefunctions and energy levels for localized states of a scalar field in the\nbackgrounds that have 'twists' and conical defects (which are two of the above mentioned\nthree kinds of deformations). A subclass of these wavefunctions generalise the wavefunctions that were constructed in [6] as duals to primary fields of the CFT when the spacetime\nwas globally AdS3 × S 3 . However, the significance of these geometries (and these localised\nwavefunctions) in the context of the AdS/CFT correspondence is not quite clear.\n(c)\n\nIn some recent papers [10][11] a set of geometries was given that corresponded\n\nto the D1-D5 system with no momentum charge but with nonzero angular momentum.\nWe comment on several interesting aspects of these geometries. In particular we note that\nfrom the microscopic viewpoint these systems are in a different 'phase' from the D1-D5momentum black holes. We observe several interesting correspondences between scales of\nthe gravity theory and scales of the microscopic dual.\n3\n\n\fThe plan of this paper is the following. In section 2 we look at the linearized equations\nof the fields that carry the quantum numbers of the current operators in the CFT, and\nanalyze some of their solutions. In section 3 we look at 'pure gauge' solutions that are\nspacetimes that are locally but not globally AdS3 × S 3 ; these are finite deformations\n\nof the spacetime that appear at the linearised level as pure gauge deformations of the\nfields. In section 4 we look at solutions to the scalar wave equation around some of the\ndeformed backgrounds studied in section 3. In section 5 we examine some interesting\nrelations between the solutions presented in [10][11] and the microscopic theory of the\nD1-D5 system. Section 6 is a summary and discussion.\nNote added: Several of the computations described in this paper were performed\n\nat various points over the past year, as part of a general study of the AdS/CFT correspondence for the D1-D5 system. These notes have been brought to the form of the present\npaper partly due to the interest in this issue generated by recent studies of the spacetimes\ncorresponding to states in the Ramond sector of the CFT [10][11]. We discuss the relation\nof our computations to these latter studies towards the end of this paper, and comment\non some interesting aspects of the ideas emerging from the above references.\n\n2. The linearised theory\n2.1. Field equations\nLet us consider the compactification of type IIB string theory on a K3 or T 4 . We will\nget a set of low energy supergravity fields. We will focus on the graviton and the 2-forms\narising in the 6 noncompact directions. The lagrangian and linearised equations of these\nfields can be read off from [12] where a general D = 6, N = 4b supergravity theory was\nstudied. (If the compact space is a K3 then there will be no 1-forms from in 6-d; for T 4\nthere will be 1-forms but they are not the ones of interest to us below.) In subsection 2.3\nbelow we will obtain thes equations directly from IIB supergravity in 10-D, reduced to 6-D\non T 4 .\nThe 2-form fields can be split into self-dual and anti-self-dual sets, and one of the selfdual fields acquires a vacuum expectation value to give a compactification the 6-d space\nto a geometry AdS3 × S 3 . We will use indices A, B, . . . to represent 6-d indices, μ, ν, . . . to\n\nrepresent AdS3 indices, and a, b, . . . to represent S 3 indices. We call the AdS coordinates\nx and the S 3 coordinates y. We will also ignore the scalars in the discussion below, and\n4\n\n\fso will not distinguish between the elementary field strengths G = dB and the modified\nfield strengths H. Letting the radii of the two factors be unity each, we get the curvature\ntensor and self dual field stengths\nRμνρσ = −(gμρ gνσ − gνρ gμσ ), Rabcd = gac gbd − gad gbc\nHμνρ = ∂μ Bνρ + ∂ν Bρμ + ∂ρ Bμν ,\nHμνρ = ǫμνρ ,\n\n(2.1)\n\nHabc = ∂a Bbc + ∂b Bca + ∂c Bab\n\n(2.2)\n\nHabc = ǫabc\n\n(2.3)\n\nThe sphere S 3 has the symmetry group SO(4) = (SU (2) × SU (2))/Z2 , and thus the\n\nalgebra of diffeomorphisms is su(2) ⊕ su(2). We identify these su(2) factors with the left\nand right current algebras of the boundary CFT. To find the fields dual to the currents\n\ni\nJLi , JR\nof the boundary theory we must look at supergravity fields that are vectors in the\n\nAdS3 and vectors on the sphere S 3 . The components of the graviton haμ are such an object;\nwe also have B a μ from the 2-form field which acquires an expectation value. The other\n2-form fields in the theory are related by symmetry: the self dual fields had an SO(5)\nsymmetry which is broken to SO(4) when we single out one field to give it an expectation\nvalue, and the anti-self-dual fields have a SO(n) symmetry, where n is the number of tensor\nmultiplets in the D = 6, N = 4b theory. Thus we do not expect fields from these categories\nto be dual to the currents of the boundary theory (the currents do not carry these SO(4)\nor SO(n) symmetries.)\nIn appendix A we describe explicitly the vector fields that correspond to the symmetries of the sphere, and indicate their separation into the two su(2) factors. But in the\nboundary CFT we must find the left movers to have one such su(2) and the right movers\nto have the other one. Thus haμ or B a μ must yield a correlation between the behavior of\nthe index of the sphere and the index in the AdS. Such a correlation arises because of\nChern-Simmons like couplings between the haμ and the B a μ fields, and in this section we\nwould like to analyse the dynamics of these coupled fields at the linearized level.\nBefore we write the explicit equations, let us recall why the two fields haμ , which is\nthe perturbation of the graviton, and baμ , which is a perturbation of the 2-form field B,\nare coupled at the linearized level. The action has a term HABC H ABC . Suppose we have\nan excitation baμ . If we have derivatives in the directions μ, ν then this gives a component\nδHνaμ = ∂ν baμ − ∂μ baν . This field strength couples to the background field strength Hμνλ\n\nif there is a nonzero value fo hμa , thus giving a quadratic order contribution to H 2 involving\n5\n\n\fone Baμ and one hμa perturbation. This mechanism is similar to that which mixes the\ntwo 2-form fields in the presence of a background 5-form field strength in AdS5 × S 5 [13]\nFollowing [12] we write\n\nhμa = Kμa ,\nKμa = Kμ1,±1 (x)Ya1,±1 (y),\n\nbμa = Zμa\n\n(2.4)\n\nZμa = Zμ1,±1 (x)Ya1,±1 (y)\n\n(2.5)\n\nThe equations relating K and Z are [12]\n1,±1 ;ν\nKμ;ν\n− Kν1,±1 ;ν ;μ − 2Kμ1,±1 + 4ǫμ νλ ∂ν Zλ1,±1 ∓ 8Zμ1,±1 = 0\n\n(2.6)\n\nǫμ νλ ∂ν Zλ1,±1 ± 2Zμ1,±1 + Kμ1,±1 = 0\n\n(2.7)\n\nLet us work with the upper sign. Writing\nAμ ≡ Kμ1,1 ,\nFμν = ∂μ Aν − ∂ν Aμ ,\n\nBμ = 2Zμ1,1\n\n(2.8)\n\nGμν = ∂μ Aν − ∂ν Aμ\n\n(2.9)\n\nwe get the equations\nF νμ ;ν + 2ǫμνρ Gνρ = 0\n\n(2.10)\n\nǫμνρ Gνρ + 4(Aμ + B μ ) = 0\n\n(2.11)\n\nLet us write\nFμν = (dA)μν = Aν,μ − Aμ,ν , (∗F )μ =\n(d ∗ F )μν = ∂μ (∗F )ν − ∂ν (∗F )μ ,\n\n1\nǫμνρ F νρ ,\n2\n1\n(∗d ∗ F )μ = ǫμνρ (d ∗ F )νρ\n2\n\n(2.12)\n\nThen the equation (2.10) becomes\n(∗d ∗ F ) + 4(∗dB)μ = 0\n\n(2.13)\n\nThis gives\n1\nB = − F + dΛ\n4\n\nd ∗ F + 4B = 0,\n\n(2.14)\n\nThe equation (2.11) becomes\n2 ∗ G + 4(A + B) = 0\n6\n\n(2.15)\n\n\fThus once we find a solution to (2.14) with Λ = 0, adding in the term dΛ to B does not\nchange G = dB, and from (2.15) requires A → A − dΛ. This freedom\nB → B + dΛ, A → A − dΛ\n\n(2.16)\n\ngives the pure gauge freedom of the equations; we will set Λ = 0 in the calculation below\nand return to the issue of flat connections later. Then ∗G = −2A +\nbecomes\n\n1\n2\n\n∗ F , and (2.13)\n\n∗d ∗ dA − 8A + 2 ∗ dA = 0\n\n(2.17)\n\n(∗d + 4)(∗d − 2)A = 0\n\n(2.18)\n\nWe can write this as\n\nwhich can be solved in two ways\n(∗d + 4)A = 0\n\nor (∗d − 2)A = 0\n\n(2.19)\n\nIf on the other hand we had chosen the lower sign in passing from (2.6), (2.7) to (2.10),\n(2.11) then we would have a replacement ∗ → −∗, and the equations would be differ-\n\nent. Thus the different 1-forms on the sphere S 3 lead to different solutions in the AdS3\nspacetime.\n2.2. A special solution\n\nWe write in explicit form the equation (2.19) in Appendix D, and reduce it to an\nequation of hyoergeometric form. Here we extract only the solutions relevant to the constant connection in the boundary CFT. Let us solve for the condition (∗d − 2)A = 0. In\n\nAppendix D we have considered solutions starting with the form\nAu = e−iαu f (r),\n\nAr = e−iαu h(r),\n\nAv = e−iαu q(r)\n\nwhere u = t + φ, v = t − φ. To get a constant connection at the boundary we set α = 0.\n\nThen using the relations in Appendix D we get h = 0. Further, we find\nq,r =\n\nC\nr(1 + r 2 )\n\n(2.20)\n\n(Note that in the notation of Appendix D we have Q = 2 for the equation that we are\nsolving.) For a solution regular at r = 0 we take q,r = 0, and thus set q = 1. Then we get\n7\n\n\ff = (1 + 2r 2 ). Note that near r = 0 we have Aφ = Au − Av = f − q = O(r 2 ), so that\n\nthe connection is regular at r = 0. Near r = ∞, Au dominates over Av , and we thus get a\n\nconnection at the boundary that is a left moving 1-form on the boundary.\n\nIf we had taken instead the condition (∗d + 4)A = 0 from (2.18) then we would find\nthat the solution that is large at infinity is not chiral. For this reason it appears reasonable\nto identify the solution of (∗d − 2)A = 0 as the function dual to the constant mode of the\ncurrent operator in the boundary.\n\nHaving solved for the field Aμ we can recover the field Bμ from the relation (2.14).\nThus we observe that we can obtain solutions for the fields Aμ , Bμ that go over to a conatant\nvalue of the connection at the boundary, and give solutions that are smooth inside the AdS3\nspacetime. These fields lift to a smooth geometry of AdS3 × S 3 when we recall the relation\n\nbetween the gauge group index and the vector fields on S 3 , listed in Appendix A. We have\nalso found along the way excitations that are pure gauge, in eqn (2.14); we take Λ 6= 0\nbut F = G = 0. We will look at such solutions (at the nonperturbative level) in the next\n\nsection, but note here that such locally pure gauge connections are typically singular at\nr = 0, in contrast to the smooth solutions listed in this subsection.\n2.3. Obtaining the field equations from 10-D supergravity\nThe equations (2.6)(2.7) were obtained in [12] for a general N = 4b supergravity\ntheory in D=6. Let us see how we get such a set of equations from dimensional reduction\nof Type IIB supergravity in D = 10, compactified on AdS3 × S 3 × M4 . The relevant part\n\nof the supergravity action is\n\nS=\n\nZ\n\n√\n1\n1\nd10 x −g[R − ∂φ∂φ − eφ H 2 ]\n2\n3\n\n(2.21)\n\nwhere we are using the Einstein metric, φ is the dilaton, and H = dB. (We have chosen\nthe normalization of B to agree with the notation of [12].) The field equation for φ is\n△φ =\n\n1 φ 2\ne H\n3\n\n(2.22)\n\nThus if H 2 = 0 then we can consistently set φ = 0. The background (2.1)- (2.3)\nsatisfies\nH = ∗H,\n\nH 2 = H ∧ ∗H = H ∧ H = 0\n\nwhere the ∗ is taken in AdS3 × S 3 .\n8\n\n(2.23)\n\n\f2\n\nLet us look for deformations B → B + δB which continue to satisfy H = ∗H, so that\n\nH = 0 and the dilaton can continue to be set to zero. The Einstein equations give\nRaμ = HaAB Hμ AB\n\n(2.24)\n\nLet the nonzero components of the perturbation be of the form\nhμa = Kμa (x)Ya1,1 (y),\nǫa bc ∂b hμc = 2hμa ,\n\nBaμ = Zμa (x)Ya1,1 (y)\n\n(2.25)\n\nǫa bc ∂b Bcμ = 2haμ\n\n(2.26)\n\nThen we get to lowest order in the perturbation\n1\n;A\n− haA;μ ;A ]\nRaμ = − [hμa;A ;A + hA\nA ;μa − hμA;a\n2\n1\n= − [Kμ;ν ν − Kν ;ν μ − 2Kμ ]\n2\n\n(2.27)\n\nOn the other hand\nHμAB Ha AB = ǫμ νλ [Baν,λ − Baλ,ν ] + [Bμb,c − Bμc,b ]ǫa bc = 2ǫμ νλ Zν,λ − 4Zμ\n\n(2.28)\n\nwhere we have expanded to lowest order in the perturbation, and used the background\nvalues of H and (2.26). Thus we obtain from (2.24) the equation\n△Kμ − Kν ;ν μ − 2Kμ + 4ǫμ νλ Zν,λ − 8Zμ = 0\n\nis\n\n(2.29)\n\nNow let us look at the condition H = ∗H. The relevant component of this equation\nHνλc = (∗H)νλc\n\n(2.30)\n\nHνλc = ∂ν Bλc − ∂λ Bνc\n\n(2.31)\n\nBut\n\n(∗H)νλc =\n\n′\n′\n′\n1\nǫνλcABC HA′ B′ C ′ g AA g BB g CC = ǫνλμ hμc + 2ǫνλ μ Bcμ\n6\n\n(2.32)\n\nContracting (2.30) with ǫμ νλ (and using (2.26)) we get\nǫμ νλ ∂ν Zμ + 2Zλ + Kμ = 0\n9\n\n(2.33)\n\n\fThus we get the equations in [12].1 If we had used the perturbations K 1,−1 , Z 1,−1\ninstead then we would get the lower signs in (2.6), (2.7).\nTo evaluate correlation functions using the AdS/CFT correspondence we must\nevalaute the value of the action of the solution of the supergravity equations. The action to quadratic order is\nZ\n√\n1\n1\n1\nS = d3 x −g[− Fμν F μν − 2Aμ Aμ + 4(−2Bμ B μ − Gμν Gμν ± 2Aμ B μ − ǫμνλ Aμ Gνλ )]\n4\n4\n2\n(2.34)\nwhere F = dA, G = dB. The first two terms come from the dimensional reduction of\n√\n−gR in 6-D, and the others come from reduction of − 31 H 2 . The upper and lower signs\n\ncorrespond to the modes Y 1,±1 in the harmonic expansions on S 3 . We are assuming here\n\nthat we excite fields in a way such that H remains self-dual, so that the dilaton is not\nexcited.\nThe above action should also yield the anomalies of the CFT, following the method\nused for the case AdS5 × S 5 in [4].\n3. 'Locally pure gauge' deformations\n3.1. Different types of deformations\nIn our analysis of section 2.1 we saw that there were locally pure gauge excitations\ngiven in (2.16) where the field strengths satisfied G = F = 0. These solutions can be\nnevertheless nontrivial if we have a nonzero value for the integral of the connection around\na cycle. There are no nonvanishing cycles in AdS3 , but if we allow r = 0 to be a singular\npoint, then we can find nontrivial flat connections. Such flat conections can be locally\ngauged away, so locally the spacetime must look like AdS3 × S 3 though globally it need\nnot reduce to this product form.\n\nThus we wish to look at the possible ways that one can have a space that looks locally\nthe same as AdS3 × S 3 ; with this analysis we will then not be constrained to the linear\n\norder of 'locally pure gauge' deformations. For simplicity of presentation let us first look at\n1\n\nIn [10] it was argued that to get a consistent dimensional reduction from 6-D to 3-D we must\n\nuse both self-dual and anti-self dual parts of the 2-form gauge field. This does not contradict the\nfact that we can obtain a class of solutions using only the self-dual part of the field and obtain\nfor these the equations in [12]; we are investigating these special solutions to obtain the dual of a\nconstant background potential in the CFT.\n\n10\n\n\fa 'toy model' where the space is locally AdS3 × S 1 . Let us therefore start with a 'product\nmetric'\n\nds2 = −(1 + r 2 )dt2 +\n\ndr 2\n+ r 2 dφ2 + dχ2\n1 + r2\n\n(3.1)\n\nwhere 0 ≤ χ < 2π is a circle of unit length. To get a space that looks locally the same we\ncan do three things:\n(a)\n\n'Twists' We can write the metric as\ndr 2\n+ r 2 dφ2 + (dχ − αdφ)2\nds = −(1 + r )dt +\n2\n1+r\n2\n\n2\n\n2\n\n(3.2)\n\nwith α a constant. We then say that the variables φ, χ are still the ones that are well\ndefined in the sense that φ → φ + 2π and χ → χ + 2π give the identifications of the\n\nspacetime. (Thus even though with the definition χ′ = χ − αφ the metric (3.2) looks\nlocally like (3.1), the two metrics are really different.) In a 'Kaluza-Klein' ansatz where\nthe coordinate χ denotes an internal direction, we would write the metric as\n\u0012\n\u0013\ngχχ\nAχμ gχχ\nĝAB =\nAχμ gχχ gμν + Aχμ Aχν gχχ\n\n(3.3)\n\n(see for example [14]). Here A, B are coordinates of the 4-d space in (3.3), ĝAB is the\nmetric (3.2) and μ, ν are the coordinates t, r, φ. The 1-form gauge connection is Aχμ , with\nFμν = ∂μ Aχν − ∂ν Aχμ . We find Aχφ = α, so the potential is locally pure gauge. The effective\n3-d metric is then\n\ngμν dxμ dxν = −(1 + r 2 )dt2 +\n\ndr 2\n+ r 2 dφ2\n1 + r2\n\n(3.4)\n\nNote that gχχ = 1, so the scalar corresponding to the length of the compact circle is not\nexcited. The 4d metric (3.2) is not in general regular at r = 0. (It is regular if α is an\ninteger n in which case the deformation can be undone by a coordinate transformation.)\nWe will call this type of deformations 'twists'.\n(b)\n\n'Magnetic solutions' We can write a metric\nds2 = −(1 + r 2 )dt2 +\n\ndr 2\n+ r 2 (dφ + βdχ)2 + dχ2\n1 + r2\n\n(3.5)\n\nwhere again the coordinates φ, χ are periodic with period 2π. Now gχχ = 1 + r 2 β 2 , so\nthe scalar corresponding to the size of the compact circle is excited, and in fact grows\n2\n\nmonotonically with increasing r. The gauge potential is Aχφ = (gχχ )−1 gχφ = β 1+rr 2 β 2 .\n11\n\n\fThere is a nonvanishing magnetic field strength Frφ . The effective metric gμν in the\nKaluza-Klein ansatz is\ngμν dxμ dxν = −(1 + r 2 )dt2 +\n\ndr 2\nr2\n+\ndφ2\n1 + r2\n1 + r2 β 2\n\n(This is the 'string metric' which has a gravity action\n\nR√\n\n(3.6)\n\n−ge−2φ R + . . . where φ =\n\n− 14 log gχχ .) Note that at r ≈ 0 the metric (3.5) approaches (3.1), and so is regular at\n\nr = 0. If we set the t, r part of the metric to equal −dt2 + dr 2 then this metric would be\n\nequivalent to the one appearing in the Melvin solution2 [15].\n(c)\n\nWe can take the metric (3.1) but include a 'conical defect'; i.e., let the range of φ\n\nbe 0 ≤ φ < 2πγ. We can define a new coordinate φ′ = φ/γ that still runs over 0 ≤ φ′ < 2π\nby writing\ndr 2\n+ r 2 γ 2 dφ′2 + dχ2\n1 + r2\nd(rγ)2\n= −(γ 2 + (rγ)2 )d(t/γ)2 + 2\n+ (rγ)2 dφ′2 + dχ2\nγ + (rγ)2\ndr ′2\n2\n′2\n′2\n+ r ′2 dφ′2 + dχ2\n= −(γ + r )dt + 2\n′2\nγ +r\n\nds2 = −(1 + r 2 )dt2 +\n\n(3.7)\n\nwhere we have defined r ′ = rγ, t′ = t/γ in the last step.3\nIt can be seen that we can 'mix' the deformations of types (a), (b), (c) to make other\nspacetimes. Thus we can take an arbitrary linear combinations of φ, χ (with constant\ncoefficients) to multiply the terms in (3.1) with coefficients r 2 and unity, and for any such\nconstruction we can limit the range of the coordinate φ as in (c).\n2\n\nI thank A. Tseytlin for pointing out these references.\n\n3\n\nWriting γ 2 = δ, we can continue (3.7) to δ = −A. Defining φ̃ = it, t̃ = iφ, r̃ 2 = r 2 − A, it is\n\ninteresting that we get\nds2 = −(r 2 − A)dt2 +\n\ndr̃ 2\ndr 2\n+ r 2 dφ2 = −(r̃ 2 + A)dt̃2 + 2\n+ r̃ 2 dφ̃2\n−A\nr̃ + A\n\nr2\n\nFurther, after allowing rotations in t, φ it would be interesting to investigate the possible relation\nof such metrics to the 'kinks' observed in thermal strings in [16].\n\n12\n\n\f3.2. 'Twists' for AdS3 × S 3\nThe metric of the undeformed AdS3 × S 3 is\nds2 = − cosh2 ρdt2 + dρ2 + sinh2 ρdφ2 + dΩ23\n\n(3.8)\n\nwhere we have taken unit radius for the AdS and sphere factors. The vector field Aμ\nin the above section arose from haμ , and a corresponding perturbation of the 2-form field\nB. A nonzero value for haμ indicates that the AdS space is not orthogonal to the sphere,\nthough since we are trying to make a flat connection, locally it should be possible to choose\ncoordinates where no effect of the gauge field is seen at all.\nLet the sphere be given by\nx21 + x22 + x23 + x24 = 1\n\n(3.9)\n\nLet\nx1 = q cos χ\nx3 = q sin χ\np\nx2 = 1 − q 2 cos ψ\np\nx4 = − 1 − q 2 sin ψ\n\n(3.10)\n\nIn Appendix A we list the vector fields on S 3 that correspond to the decomposition\nso(4) = su(2) ⊕ su(2). Let Mij be the generators of the rotations of the Cartesian coordi-\n\nnates xi of the sphere (see Appendix A ). Let us make the analogue of the deformation of\ntype (a) in the above subsection. We wish to choose a fixed generator of rotations of this\nS 3 , and rotate the S 3 at a constant rate as we increase the AdS coordinate φ. We can\ntake any linear combination of the generators Mij , or equivalently, of the left and right\nsu(2) generators J a , K a (a = 1, 2, 3). For presentational purposes the simplest case is\nwhere we have an equal magnitude of rotation in the two su(2) factors. We can choose\ncoordinates on the sphere so that these rotations are in the directions J 3 , K 3 , and then\nfor equal rotations in the two su(2)s the generator of rotations is propotional to\nJ3 + K3 =\n\n1\n∂\n1\n[M13 + M42 ] + [M13 − M42 ] = M13 →\n2\n2\n∂χ\n\n(3.11)\n\nThus we get a rotation of the circle χ as we increase the AdS coordinate φ, so this is\nsimilar to the situation in (3.2). But note that the radius of the χ circle q is not a constant\nbut varies in the range 0 ≤ q ≤ 1.\n13\n\n\fWe can find coordinates φ′ , χ′ in the φ, χ space where the metric in this subspace is\n′\n\ng =\n\n\u0012\n\ngχ′ ′ χ′\n0\n\n0\ngφ′ ′ φ′\n\n\u0013\n\n=\n\n\u0012\n\nq2\n0\n\n0\nr2\n\n\u0013\n\n(3.12)\n\n(The other coordinates are orthogonal to these two and their metrics are left unchanged.)\nThe coordinate φ′ still labels the different spheres over different points on a fixed ρ, fixed t\ncircle in the AdS space, but the coordinate χ′ is not a periodic one in the spacetime. Let\nthe periodic coordinate be instead\nχ = χ′ − αφ′ ,\n\nα = constant\n\n(3.13)\n\nWriting\nφ = φ′\n\n(3.14)\n\nwe get the metric in the φ, χ subspace in the unprimed coordinates\ng≡\n\n\u0012\n\ngχχ\ngφχ\n\ngχφ\ngφφ\n\n\u0013\n\n=\n\n\u0012\n\ngχ′ ′ χ′\nαgχ′ ′ χ′\n\nαgχ′ ′ χ′\ngφ′ ′ φ′ + α2 gχ′ ′ χ′\n\n\u0013\n\n(3.15)\n\nThe determinant is unchanged\ndetg = detg ′ = gφ′ ′ φ′ gχ′ ′ χ′\n\n(3.16)\n\nThe inverse metric in this subspace is\n\n\n(g)−1 = \n\n1\n′\ngχ\n′ χ′\n\n+\n\n− g′\n\nα2\n′\ngφ\n′ φ′\n\nα\n\nφ′ φ′\n\n− g ′α\n\nφ′ φ′\n\n1\n\ng′ ′ ′\nφ φ\n\n\n\n\n(3.17)\n\n3.3. Analogues of the other deformations\nWe can also make deformations of AdS3 × S 3 which are analogous to the deformations\n\nof type (b) ('magnetic deformations') and type (c) ('conical defects'). the conical defects\nare made in the same way as for AdS3 × S 1 , since the space is a direct product of an AdS3\n\nspace with conical defect (eq. (3.7)) with the internal space which can now be taken to be\nS 3 instead of S 1 . To make the analogue of the 'magnetic deformations' we take the circle\nparametrized by χ on S 3 (eq. (3.9)) and use this to replace the S 1 in the construction of\ntype (b) above. Note however that at q = 0 the size of this circle goes to zero, and thus\nthe spacetime is singular in general.\n14\n\n\f3.4. Changing to a chiral gauge\nThe above construction gives us a connection\n3\n\n3\n\nAJφ = AK\nφ = α\n\n(3.18)\n\nIn the boundary CFT the left movers can carry the charge J a and the right movers can\ncarry the charge K a . We can change gauge to let the J a component of Aμ be of the form\nAφ+t and the K a component be of the form Aφ−t . To do this we must make a gauge\nrotation linear in t, such that we get\n3\n=α\nAJt 3 = −AK\nt\n\nBut\nJ3 − K3 =\n\n(3.19)\n\n1\n∂\n1\n[M13 + M42 ] − [M13 − M42 ] = M42 →\n2\n2\n∂ψ\n\n(3.20)\n\nso that the above gauge transformation corresponds to\nψ = ψ ′ − αt′ ,\n\nt = t′\n\n(3.21)\n\nanalogous to (3.13), (3.14). The metric in the ψ, t subspace is\n\u0013 \u0012\n\u0012 ′\n\u0013\n1 − q2\n0\ngψ ′ ψ ′\n0\n′\n=\ng =\n0\n−(1 + r 2 )\n0\ngt′ ′ t′\ng≡\n\n\u0012\n\ngψψ\ngtψ\n\ngψt\ngtt\n\n\u0013\n\n=\n\n\u0012\n\ngψ′ ′ ψ ′\nαgψ′ ′ ψ ′\n\nαgψ′ ′ ψ ′\ngt′ ′ t′ + α2 gψ′ ′ ψ ′\n\n\u0013\n\n(3.22)\n\n(3.23)\n\nNote however that the only geometric invariants of these flat connections are the\nperiods of the J and K subgroups around the compact circle φ. The t direction is noncompact, and so we can adjust the generator Ât to be any constant we want by a gauge\ntransformation.\n3.5. Unequal values of the connection in the two subgroups\nWe list for completeness the metric that arises from the case where we have a connection with unequal magnitudes in the left and right su(2) factors. We can choose coordinates\nto again put the connections along J 3 , K 3 . Let the connection in the φ direction Âφ have\nthe form\nÂφ = αM13 + βM42 = α(J 3 + K 3 ) + β(J 3 − K 3 ) = (α + β)J 3 + (α − β)K 3\n15\n\n(3.24)\n\n\fIf we wish to make the J part of the connection to be of the form Aφ+t and the K part of\nthe connection of the form Aφ−t , then we let\nÂt = (α + β)J 3 − (α − β)K 3 = α(J 3 − K 3 ) + β(J 3 + K 3 ) = αM42 + βM13\nRecall that M13 →\n\n∂\n∂χ ,\n\nM42 →\n\n∂\n∂ψ .\n\n(3.25)\n\nWe then get the metric\n\ndr 2\nr2 + 1\n+ dθ 2 + 2(αdφ + βdt) cos2 θdχ + 2(αdt + βdφ) sin2 θdψ + cos2 θdχ2 + sin2 θdψ 2\n(3.26)\n\nds2 = − (r 2 + 1 − β 2 cos2 θ − α2 sin2 θ)dt2 + (r 2 + α2 cos2 θ + β 2 sin2 θ)dφ2 +\n\nIf we start instead with a metric having a conical defect (which had been put in the\nform given by the primed coordinates in (3.7)) and perform the twists as above, then we\nwould get the more general metric\nds2 = − (r 2 + γ 2 − β 2 cos2 θ − α2 sin2 θ)dt2 + (r 2 + α2 cos2 θ + β 2 sin2 θ)dφ2 +\n\ndr 2\nr2 + γ 2\n\n+ dθ 2 + +2(αdφ + βdt) cos2 θdχ + 2(αdt + βdφ) sin2 θdψ + cos2 θdχ2 + sin2 θdψ 2\n(3.27)\n\n4. Localised modes for the 'twisted geometries'\nIn [17] it was shown that if we consider a scalar of mass m in AdS3 then we obtain\nnormalisable solutions localised near ρ = 0 (over a scale of the order of the AdS radius)\nwhich are dual to primary operators in the boundary CFT of dimension h = h̄ = 1/2(1 +\n√\nm2 + 1). It is not clear what the significance of the general 'twisted geometry' is, so\nit is not clear how to interpret solutions to the scalar wave equation for general twists.\nNevertheless the spectrum of these modes appears to be interesting and solutions parallel\nin some ways the wavefunctions in [17] that were dual to chiral primary operators, so we\ncarry out this computation below.\nIn our case the 6-d space does not factorize globally into an AdS3 part and a sphere, so\nwe look at scalars in the 6-d theory. We let the scalar be massless and minimally coupled\nat the linear order (there are several such scalars in the theory). For a given R-charge\nthe lowest dimension CFT operators typically arise from supergravity fields that have two\nindices along the S 3 . Since we are starting with a scalar, we are considering supersymmetry\ndescendents of chiral primaries (this is analogous to the operator trF 2 dual to the dilaton\nin AdS5 × S 5 ).\n16\n\n\f3\n\n3\n\nConsider the metric that corresponds to the connection AJφ = AK\nφ = α:\nds2 = −(1+r 2 )dt2 +\n\ndr 2\n+dθ 2 +2α cos2 θdφdχ+(r 2 +α2 cos2 θ)dφ2 +cos2 θχ2 +sin2 θdψ 2\nr2 + 1\n(4.1)\n\nThe scalar f in 6-d satisfies the equation\n√\n1\n√ [f,M g M N −g],N = 0\n−g\n\n(4.2)\n\nf = e−iωt eimφ Y l1 ,0 (y)\n\n(4.3)\n\nConsider the ansatz\n\nwhere Y l1 ,0 is a spherical harmonic for the scalar (the left and right spins must be equal for\na scalar function: j = k = l1 /2, −j ≤ j3 ≤ j, −k ≤ k3 ≤ k), and y denotes the coordinates\n\non the sphere. With this ansatz we find the wave equation\n\n1\n[f,r r(1 + r 2 )],r + ω 2 (1 + r 2 )−1 f − [l1 (l1 + 2) + (α(j3 + k3 ) − m)2 r −2 ]f = 0\nr\n\n(4.4)\n\nIn Appendix E we bring this equation to a hypergeometric form that parallels the equation\nfor the 1-form fields studied in section 2.\nIn [17] the wavefunctions dual to the chiral primaries had the form\nf = e−iωt (cosh ρ)−μ Y l1 ,0 (y)\n\n(4.5)\n\nwhere r = sinh ρ. To get the generalisation of these special solutions to the twisted\ngeometries consider the ansatz\nf = e−iωt (cosh ρ)−μ (sinh ρ)−ν Y l1 ,0 (y)\n\n(4.6)\n\n(We have added a parameter ν since as we will see we will encounter a term singular at\nρ = 0 in our case.)\nSubstituting in the wave equation we find that we need to have vanish the expression\nω 2 (cosh ρ)−2−μ (sinh ρ)−ν + μ2 (cosh ρ)−μ−2 (sinh ρ)−ν+2\n+ (μ(ν − 2) + ν(μ − 2))(cosh ρ)−μ (sinh ρ)−ν + ν 2 (cosh ρ)−μ+2 (sinh ρ)−ν−2\n− [2j(j + 1) + 2k(k + 1)](cosh ρ)−μ (sinh ρ)−ν − α2 (j3 + k3 )2 (cosh ρ)−μ (sinh ρ)−ν−2\n(4.7)\n17\n\n\fThe most singular terms at the origin must cancel, so we set\nν 2 = α2 (j3 + k3 )2\n\n(4.8)\n\nLet us take α > 0. We get two choices\nν = ±α(j3 + k3 )\n\n(4.9)\n\nEquating the coefficients of the other independent expressions to zero we get\n−μ2 + ω 2 = 0,\n\nω = ±μ\n\n(4.10)\n\n(We will take ω > 0). and\nμ2 + ν 2 + μ(ν − 2) + ν(μ − 2) − l1 (l1 + 2) = 0\n\n(4.11)\n\nThen (4.11) gives\n(μ + ν)(μ + ν − 2) − l1 (l1 + 2) = 0\n\n(4.12)\n\nThus we get two choices\nμ + ν = l1 + 2,\n\nμ + ν = −l1\n\n(4.13)\n\nFor a convergent solution at infinity we need μ + ν > 0. So we discard the second choice.\nThen we have\nω = ±μ = ±[(l1 + 2) ∓ α(j3 + k3 )]\n\n(4.14)\n\nNote that states with negative ν are singular at ρ = 0 while those with positive ν are\nregular. It is interesting that we get solutions that are regular both at r = 0 and at r = ∞.\nIf we go to a gauge where the connections for the two gauge groups are purely left\n\nmoving or purely right moving forms then we get the metric (3.26) (with β = 0). The\nsolutions to the wave equation are of course the same as above since we have just made\na coordinate transformation. However in this new frame the frequencies can be read off\nfrom the dependence\n′\n\n′\n\n′\n\n′\n\ne−iωt ei(j3 −k3 )ψ ≡ e−iωt ei(j3 −k3 )(ψ +αt ) = e−i(ω−α(j3 −k3 ))t ei(j3 −k3 )ψ\n\n′\n\n(4.15)\n\nso that\nω ′ = ω − α(j3 − k3 )\n\n(4.16)\n\nand in particular for the modes (4.14)\nω ′ = ±(l1 + 2) − 2αj3 ,\nfor the two signs respectively in (4.14).\n18\n\nω ′ = ±(l1 + 2) + 2αk3\n\n(4.17)\n\n\f4.1. Including a 'conical defect'\nLet us take the metric (4.1) but let the range of φ be 0 ≤ φ ≤ 2πγ. In the ansatz\n\n(4.3) we need just take m = m′ /γ where m′ is an integer, and the rest of the computation\nfor the frequencies is unaffected. But it is also interesting to see the effect of the conical\ndefect on the specific modes (4.6). There is no explicit φ dependence, so the frequencies\n(4.14) in the coordinate t are unaffected. But φ, t are not asymptotically AdS coordinates\nnow, and to change to asymptotically AdS coordinates we must write φ′ = φ/γ, t′ = t/γ\n(see eq. (3.7)). Thus in these coordinates φ′ , t′ the frequencies are given through\ne−iωt = e−iω\n\n′ ′\n\nt\n\n′\n\n= e−iω t/γ ,\n\nω ′ = ωγ\n\n(4.18)\n\nThus the frequencies in the asymptotically AdS coordinates are not in general integral\nmultiples of the natural AdS frequency.\n\n5. Metrics from the rotating string\nIn [10], [11] a set of metrics was constructed that corresponded to the geometry of a D1D5 system carrying angular momentum. The string in 6-D (after compactifing spacetime\non a T 4 ) is wrapped on the circle φ and the fermions have periodic boundary conditions\non this circle. Thus the D1-D5 system has Ramond type boundary conditions. The metric\nas given in [11] is (after adapting the notation to the one we use)\nds2\n1\nr 2 dr 2\n√ = [−dt2 + dφ2 ] + hf [dθ 2 + 2\n]\nh\n(r + γ12 )(r 2 + γ22 )\nk\n2\n+\n[(γ2 dt + γ1 dφ) cos2 θdχ + (γ1 dt + γ2 dφ) sin2 θdψ]\nhf\n2\n2\n2\n2\n2\n2\n2\n2 sin θ\n2\n2\n2\n2 cos θ\n] cos θdχ + [h(r + γ1 ) − (γ1 − γ2 )\n] sin2 θdψ 2 ,\n+ [h(r + γ2 ) + (γ1 − γ2 )\n2\n2\nhf\nhf\nf = r 2 + γ12 cos2 θ + γ22 sin2 θ,\n√\nRy2 Q1 1/2\nRy2 Q5 1/2\nk\nh = 2 (1 +\n) (1 +\n)\nRy\nkf\nkf\n(5.1)\nHere k = N1 N5 , where N1 , N5 are the numbers of D1 and D5 branes.\nFor equal rotations in the left and right su(2) factors the near horizon geometry is\ndr 2\nds2\n√ = −(r 2 + γ12 cos2 θ)[dt2 − dφ2 ] + 2\nr + γ12\nk\n+ 2γ1 dφdχ cos2 θ + 2γ1 dtdψ sin2 θ + cos2 θdχ2 + sin2 θdψ 2\n19\n\n(5.2)\n\n\fThe coefficient of dt2 is\n−(r 2 + γ12 cos2 θ) = −(r 2 + γ12 − γ12 sin2 θ)\n\n(5.3)\n\nThus the metric (5.2) is of the form (3.27) if we have a conical defect with γ = γ1 and\nperform 'twists' with α = γ1 , β = 0. (The case γ1 6= γ2 of [11] is not of the form (3.26)\n\nsince the metric differs by a shift in the coefficient of dφ2 of the form r 2 → r 2 + C.)\n5.1. Microscopics of the D1-D5 system\n\nTo comment on some interesting aspects of the solution in [10], [11] we recall the\nmicroscopics of the D1-D5 system. We can think of the D1-D5 bound state as a set of N1\nD1-branes living inside N5 D5-branes. Each D-string in the 5-branes can be regarded as\nbeing 'fractionated' into N5 substrings, giving N1 N5 substrings in all. Each substring can\nbe placed in a state which is spin (0, 0) under su(2) ⊕ su(2), in a state which is (1/2, 1/2),\nor into fermionic states that are (1/2, 0) + (0, 1/2). Two or more substrings can be joined\ninto a 'long string', but this long string can carry only the spins that a single substring\ncould have carried. Thus in particular if we join all the substrings into one long string then\nwe can only get a spin of order unity, which will not be visible at the classical level. On\nthe other hand if we do not join any of the fractionated strings to each other, and orient\nthe spins of each to all lie in the same direction, then we can get a state with left and right\nangular momenta (jL , jR ) = (k/2, k/2), where k = N1 N5 .\n(One way to see the above properties is to perform a sequence of S and T dualities\n(along the compact T 4 and φ directions) such that the N5 D5-branes and N1 D-strings\ntransform to an N5 times wound elementary string carrying N1 units of momentum. The\nN1 units of momentum can be carried by oscillators (acting on the elementary string\nwinding state) which each carry a momentum in multiples of 1/N5 [18], and a vector index\nof the space transverse to the string; this index can be chosen to give spin 1 in the so(4) =\nsu(2) ⊕ su(2) which must be used to describe the angular momenta of the system.)\n\n(a) First we note that the D1-D5 system that has been given an angular momentum\n\n(jL , jR ) = (k/2, k/2) (with no momentum charge) is in a different 'phase' from the D1D5 system which gives the D1-D5-momentum black holes. In the 3-charge black hole,\nthe microscopic state that is most favoured is one where the substrings of the D1-D5\nsystem all join up into one long string [19] (thus reducing their own angular momentum\nto essentially zero) and then any angular momentum that the system may have is carried\n20\n\n\fby momentum modes that run up and down the string (the left moving momentum modes\ncarry jL , the right moving ones carry jR ). The 3-charge extremal hole has only left\nmoving momentum modes, and so we only have jL . In the limit that we reduce this\nmomentum to zero, we get no momentum modes to carry any angular momentum, and so\nwe are forced to jL = 0, jR = 0. This fact is mirrored in the fact that the left and right\ntemperatures of the hole (which combine to give the Hawking temperature) are complex\nfor the classical configuration that has only D1 and D5 charges, unless jL = jR = 0. (The\ngeneral expressions for these temperatures can be found in [20].)\nBut from the microscopic picture we can see that starting from the 3-charge system\nwe can reduce the momentum (and the angular momentum) to zero, but then break up\nthe joined substrings into separate substrings (which can now each carry a spin (1/2, 1/2)\nunder su(2)⊕su(2)); thus the system acquires angular momentum by a different mechanism\nfrom the three charge hole. Closely related to this phenomenon are the 'phase transitions'\nwhere the substrings join or split to maximise entropy [21] (see also [22]).\n(b)\n\nNow we look at some interesting energy and angular momentum scales that\n\nappear from the geometry of [11], and find corresponding scales in the microscopic D1D5 theory. This analysis is rough, and it is not possible to claim from this that there\nis in fact an identification between the physical quantities being compared. But it is\nnevertheless interesting to see related scales appearing in the two pictures. We will look at\nthe case where the rotation parameters of [11] are γ1 = 1, γ2 = 0, which gives a nonsingular\nspacetime.\nIf we take Ry large then we find that we have a large region that is approximately\nAdS3 × S 3 , and can relate the analysis around r = 0 in the full metric of the spinning\nstring to quantities computed in the AdS geometry. In what follows we assume that such\n\na limit has been taken.\nThe near horizon geometry of the D1-D5 system is governed by the number N5 . Thus\na giant graviton made of a D-string has an angular momentum N5 units [23]. This is the\nsame as the maximum spin that can be achived by a D1 brane when it dissolves in the D5\nbranes. There is a 'twist' between the coordinates natural to the AdS region and natural\nat infinity. Thus while the angular momentum of the giant graviton in the AdS region\ncan have any orientation, these differently oriented states have different angular momenta\nas seen from infinity, depending on the relation between the direction of rotation and the\ndirection of the 'twist' in the geomery. In particular consider the configuration where the D\nstring is wound on the circle φ, and is extracted away from the AdS region to infinity. Here\n21\n\n\fwe can have a static configuration that will have no angular momentum. This appears to\nbe a reflection of the fact that when we extract a D1 brane from the D5 branes then it can\nno longer have a spin greater than unity.\n(c)\n\nNote that between r = 0 and r = ∞ there is a redshift\n1/2\n\ngtt (r = ∞)\n1/2\n\ngtt (r = 0)\n\n=\n\nh1/2 (r = 0)\nRy\n≈\nh1/2 (r = ∞)\nk 1/4\n\n(5.4)\n\nwhere at r ≈ 0 we have written r 2 + cos2 θ ≈ 1. In section 4 we had seen that there\n\nare localised solutions to the scalar wave equation in the 'twisted' AdS spaces. If the full\ngeometry has a large AdS type region then there can be long lived modes localised near\nr = 0. Such a mode has a wavelength of order the AdS radius ∼ k 1/4 , and thus a frequency\n\nin the t coordinate ω ∼ k −1/4 . After taking into account the redshift, this gives an energy\n\nas seen from infinity\n\nE ∼ k −1/4 (\n\n1\nRy −1\n)\n∼\nRy\nk 1/4\n\n(5.5)\n\nBut now note that from the microscopic view of the D1-D5 system at weak coupling, the\nenergy of excitation of the substrings is also ∼ 1/Ry ; since in the state with (jL , jR ) =\n\n(k/2, k/2) all the substrings are separately wound on a circle of length Ry and not joined\ntogether into longer strings.\n\nThe scalar wavefunctions localised in the AdS region have frequencies in the coordinate t that satisfy ω ≥ 1, so that they become travelling waves at r = ∞. Thus any\n\nwavepacket localised near r = 0 will escape to infinity. But as we increase Ry , we will have\na wavefunction that decays for a longer distance in the AdS part of the geometry, thus\nhaving a smaller overlap with the travelling wave at infinity, and thus a longer lifetime.\nThis agrees qualitatively with the microscopic intuition that excitations on a longer string\ntake longer to 'collide' and escape as radiation.\n(d)\n\nNow consider a D-string that is dissolved in the N5 D5 branes, and let its N5\n\nsubstrings join up into one long string. Then we expect the microscopic picture to yield\nan energy of excitation\nE∼\n\n1\nRy N5\n\n(5.6)\n\nLet us see if we can find such an energy scale anywhere in the classical geometry. The\nD-string under consideration is not joined to other substrings in the system, and can be\nthus a giant graviton wrapped in the AdS region. The mass of this giant graviton is N5\n−1\ntimes the natural energy scale RAdS\nof the AdS space. Since RAdS ∼ k 1/4 , we get for this\n\n22\n\n\fmass M = N5 k −1/4 . For AdS3 the giant graviton does not have a radius that is fixed by\nits angular momentum; rather the angular momentum is fixed and there is no potential\nfor the variable that gives the radius of the D-string. Thus we can have a slow variation of\nthis radius, getting the physics of a massive particle that is moving without potential. Let\nus set the momentum of this radial motion to be P ∼ 1/RAdS ∼ k −1/4 . Then the energy\n\nof the motion is P 2 /(2M ). Taking into account the redshift (5.4) we get the energy as\nseen from infinity\nE∼(\n\nRy −1 P 2\nRy −1 k −1/2\n1\n∼\n(\n)\n)\n∼\nM\nRy N5\nk 1/4\nk 1/4\nN5 k −1/4\n\n(5.7)\n\nwhich agrees with (5.6).\n\n6. Discussion\nWe have examined the equations of the fields in supergravity that have the correct\nquantum numbers to couple to the R-currents of the boundary CFT, and argued that these\nfields must be used to get the supergravity description corresponding to adding a constant\nexternal gauge potential to the boundary CFT. Such an external gauge field effectively\nchanges the boundary condition on the fermions, and thus can be used to generate a\n1-parameter family of CFTs starting with the CFT in the NS sector, which is dual to\nAdS3 × S 3 . We have not followed the smooth solutions beyond the lowest order in the\n\nfields, but based on a comparison of quantum numbers we expect that for boundary values\nof the supergravity fields that represent flat connections in the CFT we can find solutions\nat the nonlinear level using only the fields that we have considered here.\nBut in this process we argued that one must look at smooth solutions of these supergravity fields in the interior of AdS space. (As we follow the family of configurations to\nlarger values of the connection, at some point the solution may of course become singular\nas a solution of supergravity.) We can on the other hand look at 'Wilson lines in the bulk'\nwhich are deformations of the AdS3 × S 3 such that locally the space is still AdS3 × S 3 .\n\nWe looked at three different deformations of this kind, but these are spacetimes which are\ngenerically singular. While singular solutions can have a nonzero value of Aφ as r → 0\n\n(which can at special values be gauged away to zero) the family of regular solutions has\nAφ → 0 as r → 0.\n\nThe proposal of [8] was to represent spectral flow in the CFT (which corresponds to\n\nchanging boundary conditions of the fermions) by putting a Wilson line of the gauge field in\n23\n\n\fthe bulk which couples to the R-current, while also including a conical defect.4 The singular\nspacetimes could represent the supergravity solutions required to spectral flow the theory if\nthe action on these configurations was lower than the action on the smooth configurations;\nchecking this however would require resolving the singularity in string theory and then\ncomputing the resulting action. More generally, we have to distinguish states of the CFT\nfrom deformations of the Hamiltonian of the CFT; the former are localised near the center\nof AdS while the latter correspond to solutions that grow towards the boundary [24]. The\naddition of a background gauge potential to the CFT is a deformation of the Hamiltonian.\nThe issue of singular versus regular configurations is certainly one deserving further study.\nWe examined the wavefunctions of a scalar field that were localised near the center of\nthe AdS spaces with twists and conical defects. If we included only a twist, the shift in the\nspectrum (4.14) was formally similar to the effect of spectral flow. But after we change to a\ngauge where the left connection carries a left moving index and the right connection carries\nonly a right moving index, the form the the frequencies becomes different. (It is also not\nclear how to get the momentum of the state in the AdS to correspond to the momentum\nin the CFT.) If we include conical defects then the frequencies of these wavefunctions\n(expressed in a coordinates that are asymptotically AdS) are not integer multiples of the\nnatural AdS frequency.\nIn [11] the solution for γ1 = 1, γ2 = 0 was shown to be nonsingular. At r = ∞ the\n\nfermions of the theory are periodic around the circle φ, which becomes a compact circle of\nfixed radius. In this region the gauge connection has gone to zero, so we can say that we\nhave Ramond sector fermions. As we move to smaller r, the fermion wavefunction remains\nperiodic by continuity, but we develop a gauge connection. When we reach the region that\nR\ncan be approximated by AdS3 × S 3 then the value of this connection is Aφ dφ = 2π. We\ncan do a coordinate transformation to get A = 0, but in the process the fermions in the\nnew coordinate system would be antiperiodic around the φ circle. This means that they\ncan be smoothly continued to the origin at r = 0. Thus in the region where the spacetime\nis approximately AdS3 × S 3 we are in the NS sector in the locally correct coordinates; an\nR fermion at infinity gives an NS fermion in the AdS region. Thus this case differs from\n4\n\nIn [9],[10] a similar construction of Wilson lines and conical defects was used, but in these\n\nreferences the goal was to construct supersymmetric conical defects. In [10] the conical defect\nand 'Wilson lines in the bulk' were argued to be related to spectral flow, though in a manner\nsomewhat different from [8]; the singular spacetimes were argued to be ensembles of states in the\nR sector.\n\n24\n\n\fthe spacetime which we would obtain if we try to deform AdS3 × S 3 to get the R sector of\nthe CFT.\nIn [25] a method was found to compute the correlation functions of twist operators in\nthe bosonic CFT which arises from a sigma model with target space M4N /SN . Here SN is\nthe symmetric group, so the target space is an orbifold with this symmetry group. In [26]\nthis computation is extended to the supersymmetric CFT which is expected to correspond\nto the D1-D5 system at the orbifold point [27]. The latter computation also allows us\nto compute correlation functions in the Ramond sector of the CFT, thus giving a 'mini\nblack hole S-matrix'. By the observation of the preceeding paragraph, for the maximally\nspinning D1-D5 system, if we wish to replace the physics of the AdS region with an effective\nboundary CFT then this CFT will be in the NS ground state. It would be interesting to\ncompare correlation functions in the CFT with calculations in the dual string theory: it is\nnot clear which quantities will be protected against change when we move from the orbifold\npoint to the point in moduli space where the supergravity description is good.\nThe general issue of whether we can get nonsingular metrics from branes is very\ninteresting. The 6-brane of type IIA theory lifts to a nonsingular brane in 11-D (the\ngeometry shares some features with the metric (5.1) at γ1 = 1, γ2 = 0). Also, we can\ndualize any brane to a zero brane, which can be regarded as just a gravitational wave\nin M-theory. The geometry formed by D3-branes is nonsingular, but the Poincare patch\nappears to have a natural extension to a second region behind the horizon, which effectively\ndoubles up the spacetime [28]. In this case perhaps one should orbifold across the horizon,\nand thus keep only one copy of asymptotic infinity; we would get additional states at the\norbifold plane which could be excited in the process of absorption by the branes. The\nmetrics of [10][11] provide new interesting examples where the 'matter' representing the\nbranes has effectively been completely represented by the metric and gauge fields produced\nby the branes.\nAcknowledgements\nI am grateful to V. Balasubramanian, S. Das, A. Jevicki and O. Lunin for helpful\ndiscussions. This work is supported in part by DOE grant no. DE-FG02-91ER40690.\n25\n\n\fAppendix A. Vector fields on the sphere\nConsider the sphere S 3 . We will need to study vector fields on this sphere, since\nsupergravity fields like haμ , baμ have one index on this sphere, and so give rise to vector\nfields on this sphere. The lowest modes of these vector fields will give rise to the modes of\ninterest to us, so we construct them explicitly below.\nThe symmery group of this sphere is SO(4), which has the algebra\n[Mab , Mcd ] = δbc Mad + δad Mbc − δac Mbd − δbd Mac\nThe combinations\nJ1 =\n\n1\n1\n1\n[M12 + M34 ], J2 = [M23 + M14 ], J3 = [M13 + M42 ]\n2\n2\n2\n\n(A.1)\n\nform an SU (2), as do the combinations\nK1 =\n\n1\n1\n1\n[M12 − M34 ], K2 = [M23 − M14 ], K3 = [M13 − M42 ]\n2\n2\n2\n\n(A.2)\n\nThus we observe the decomposition SO(4) = SU (2) × SU (2):\n[Ji , Jj ] = ǫijk Jk ,\n\n[Ki , Kj ] = ǫijk Kk ,\n\n[Ji , Kj ] = 0\n\n(A.3)\n\nTo find a representation of this algebra on vector fields on S 3 , consider the unit sphere\nx21 + x22 + x23 + x24 = 1\n\n(A.4)\n\nWe can find vector fields on the sphere that form a representation of the generators\nMab , by writing Mab as matrices:\n(Mab )a′ b′ = δaa′ δbb′ − δab′ δba′\n\n(A.5)\n\nUnder a generator ǫMab we get the differmorphism of S 3\n1\nδXa′ = ǫ(Mab )a′ b′ Xb′ ≡ ǫ Va′\n2\n\n(A.6)\n\n(Thus these vector fields are the tangent vectors arising from the nonlinear action of the\nrotation group on the sphere. They are Killing vector fields for S 3 .)\n26\n\n\fThe following are three vector fields arising from the combinations Ji : – we list their\ncomponents at a point (x1 , x2 , x3 , x4 ):\nV (1) = {x2, −x1, x4, −x3}, V (2) = {x4, x3, −x2, −x1}, V (3) = {x3, −x4, −x1, x2}\n\n(A.7)\n\nThese fields have unit norm everywhere, and are orthogonal to each other at each point of\nthe sphere.\nThe fields arising from the combinations Ki are\nW (1) = {x2, −x1, −x4, x3}, W (2) = {−x4, x3, −x2, x1}, W (3) = {x3, x4, −x1, −x2}\n\n(A.8)\n\nThe fields V\n\n(i)\n\ngive a representation (3, 1) and the fields W\n\n(i)\n\ngive a representation\n\n(1, 3) under the SU (2)×SU (2). Each set of fields give a representation 3 under the diagonal\nSU (2) subgroup Ji + Ki .\n\nAppendix B. Symmetries of anti-de-Sitter space\nWe can obtain the anti-de-Sitter space AdS3 with unit radius as the surface\n−x21 − x22 + x23 + x24 = −1\n\n(B.1)\n\nThe symmetry group is SO(2, 2) = SU (1, 1) × SU (1, 1). Let\nηab = η ab = diag{1, 1, −1, −1}\n\n(B.2)\n\nbe a metric that will be used to raise and lower indices. The generators of the algebra can\nbe written as the matrices\n′\n\n′\n\n′\n\n(M̃ab )ab′ = δaa ηbb′ − ηab′ δba\n\n(B.3)\n\n[M̃ab , M̃cd ] = ηbc M̃ad + ηad M̃bc − ηac M̃bd − ηbd M̃ac\n\n(B.4)\n\nwhich satisfy the algebra\n\nThe generator ǫM̃ab acts on AdS3 as\n′\n′\n′\n1 ′\nδX a = ǫ(M̃ab )ab′ X b ≡ ǫ V a\n2\n\n27\n\n(B.5)\n\n\fThe combinations\n1\n1\n1\nJ ̃1 = [M̃12 − M̃34 ], J ̃2 = [M̃23 + M̃14 ], J ̃3 = [M̃13 + M̃42 ]\n2\n2\n2\n\n(B.6)\n\ngive\n[J ̃1 , J ̃2 ] = J ̃3 ,\n\n[J ̃2 , J ̃3 ] = −J ̃1 ,\n\n[J ̃3 , J ̃1 ] = J ̃2\n\nand the combinations\n1\n1\n1\nK̃1 = [M̃12 + M̃34 ], K̃2 = [M̃23 − M̃14 ], K̃3 = [M̃13 − M̃42 ]\n2\n2\n2\nalso give the same algebra\n[K̃1 , K̃2 ] = K̃3 ,\n\n[K̃2 , K̃3 ] = −K̃1 ,\n\n[K̃3 , K̃1 ] = K̃2\n\n(B.7)\n\n(B.8)\n\n(B.9)\n\nNow we note that the combinations\nL0 = iJ ̃1 ,\n\nL1 = iJ ̃2 + J ̃3 ,\n\nL−1 = iJ ̃2 − J ̃3\n\n(B.10)\n\nform the anomaly free part of the Virasoro algebra\n[L0 , L1 ] = −L1 ,\n\n[L0 , L−1 ] = L−1 ,\n\n[L1 , L−1 ] = 2L0\n\n(B.11)\n\n(We have Li = L†−i since the Ji are anti-Hermitian.) We get a similar copy of the Virasoro\nalgebra from the generators K̃i .\nLet us now choose convenient coordinates on anti-de-Sitter space. In the relation (B.1)\nwrite\n\nx23 + x24 = r 2 ,\n\nx3 = r cos φ, x4 = r sin φ\np\np\nx21 + x22 = 1 + r 2 , x1 = 1 + r 2 cos t, x2 = 1 + r 2 sin t\n\n(B.12)\n\nThen we get on anti-de-Sitter space the metric\n\ndr 2\n+ r 2 dφ2\n(B.13)\n1 + r2\nWe take the covering space of this space, so that −∞ < t < ∞ (we still have 0 ≤ φ < 2π).\nds2 = −(1 + r 2 )dt2 +\n\nIf we write r = sinh ρ we get\n\nds2 = − cosh2 ρdt2 + dρ2 + sinh2 ρdφ2\n\n(B.14)\n\nWriting the action of the Virasoro generators (B.11) in terms of their action of functions (an action X i → X i + ǫV i gives rise to an operation −ǫV i ∂i ) we get\nL0 = i∂u\ni\n1\n∂v − ∂ρ )\nSinh(2ρ)\n2\n1\ni\nL−1 = ie−iu (Coth(2ρ)∂u −\n∂v + ∂ρ )\nSinh(2ρ)\n2\nwhere u = t + φ, v = t − φ.\nL1 = ieiu (Coth(2ρ)∂u −\n\n28\n\n(B.15)\n(B.16)\n(B.17)\n\n\fAppendix C. The N = 4 algebra and spectral flow\nThe theory has a left moving and a right moving chiral algebra, which are each of the\nform\n[Lm , Ln ] = (m − n)Lm+n +\ni\n[Jm\n, Jnj ] = iǫijk Lm+n +\n\nc\nm(m2 − 1)δm+n,0\n12\n\nc\nmδm+n,0 ,\n12\n\ni\n[Lm , Jni ] = −nJm+n\n\ni\n+\n{Gar , Ḡb,s } = 2δba Lr+s − 2(r − s)(σ i)a b Jr+s\n\n[Lm , Gar ] = (\n\n(C.1)\n\nc\n(4r 2 − 1)δba δr+s,0\n12\n\n(C.2)\n(C.3)\n\n{Gar , Gbs } = 0,\n\n{Ḡa,r , Ḡb,s } = 0\n\nm\n− r)Gam+r ,\n2\n\n[Lm , Ḡa,r ] = (\n\nm\n− r)Ḡa,m+r\n2\n\n(C.5)\n\ni\n[Jm\n, Ḡa,r ] =\n\n1\nḠb,m+r (σ i )b a\n2\n\n(C.6)\n\n1\ni\n[Jm\n, Gar ] = − (σ i )a b Gbm+r ,\n2\n\n(C.4)\n\nUnder a spectral flow by parameter α we get\ncα2\nh = h − αj3 +\n24\n′\n\nj3′ = j3 −\n\n(C.7)\n\ncα\n12\n\nThus the NS vacuum with h = 0, j3 = 0 flows for α = 1 to h′ =\n\n(C.8)\nc\n′\n24 , j3\n\nof h′ correspods to a R sector ground state.\n\nc\n= − 12\n. This value\n\nWhile the spectral flow is formally just an automorphism of the algebra, we can look\nat the following physical situation. We increase the value of the flat connection starting\nfrom zero, and follow any chosen state of the system. Focusing for simpilicity on a U(1) in\nR\nthe gauge group, we note that Adx = 4π the theory returns to what it was at A = 0 ( at\nR\nAdx = 2π the fermions are antiperiodic even though the bosons have returned to their\n\noriginal Lagrangian). But the state that we were following does not return to the same\n\nstate, and thus we get a map from states of the system to states of the same system. This\nmap causes the changes in quantum numbers listed above under the spectral flow.\nThe D1-D5 system has c = 6N = 6Q1 Q5 . The length scale given by the radius of\n1\n√\n1\nthe space AdS3 and the sphere S 3 is l = α′ g62 N 4 . Here g6 is the 6-dimensional string\n√\ncoupling constant, and is given by g6 = g/ v, where g is the 10-d string coupling constant\nand the volume of the compact 4-d space (K3 or T 4 ) is (2π)4 α′2 v.\n29\n\n\fAppendix D. Solving the first order equations for a 1-form\nIn this appendix we look at the equations (2.19) that arise from the coupled equations\nfor the graviton and the 2-form field. Let us look at a more general set of equations of the\nform\n∗dW + QW = 0\nwhere Q is a constant.\nLet\nu = t + φ, v = t − φ,\nThen\n\nt=\n\n1\n1\n(u + v), φ = (u − v)\n2\n2\n\n1\nǫuvr = − ǫt̂φ̂r̂ r\n2\n\nWe let ǫt̂φ̂r̂ = 1.\nSince the background has translational invariance in t, φ we can separate harmonics\nin these variables. We look at an ansatz of the form\nWu = e−iαu f (r)\nWr = e−iαu h(r)\nWv = e−iαu q(r)\n(The parameter α here does not have any relation to the α used earlier in the paper to\ndenote the 'twist' of the spacetime; we are at present looking at perturbations around\nAdS3 × S 3 × M4 without any twist.) Then we have\nFur = Wr,u − Wu,r = [−iαh − f ′ ]e−iαu\nFvr = Wr,v − Wv,r = [−q ′ ]e−iαu\nFuv = Wv,u − Wu,v = [−iαq]e−iαu\nThis gives\n\n1\n[(1 + 2r 2 )(iαh + f ′ ) − q ′ ]e−iαu\n2r\n1\n(∗F )v = − [(iαh + f ′ ) − (1 + 2r 2 )q ′ ]e−iαu\n2r\n2iα\nqe−iαu\n(∗F )r = −\nr(1 + r 2 )\n\n(∗F )u = −\n\n30\n\n(D.1)\n(D.2)\n(D.3)\n\n\fFrom (D.3) we get\n\n2iα\nq\nQr(1 + r 2 )\n\n(D.4)\n\n2(r + r 3 )q ′\n+ (1 + 2r 2 )q\nQ\n\n(D.5)\n\nh=\nFrom (D.1), (D.2) we get\nf=\nPutting this in (D.2) we get\n\nr(1 + r 2 )[r(1 + r 2 )q ′ ]′ + [Q(2 − Q)r 2 (1 + r 2 ) − α2 ]q = 0\nLet us write\nQ(2 − Q) = P,\n\nr 2 = x,\n\nq = (√\n\n(D.6)\n\nr\n)α z\n1 + r2\n\nWe then get the equation of hypergeometric type\nP\nz=0\n(D.7)\n4\nFor Q = 2 (which is one of the cases in (2.19)) we get P = 0. Then we get the solution\n1 (1 + x)α\n+ Cx + D]\nq = xα/2 (1 + x)−α/2 [−\nα xα\nx(1 + x)zxx + (α + 1 + 2x)zx +\n\nAppendix E. The wave equation for scalars in the 'twisted' geometries\nConsider a massless scalar field in the 'twisted' geometry (4.1). For an ansatz\nf = e−iωt f (r)Y l1 ,0 (y)\nwe get the equation for the radial function\n1\n[f,r r(1 + r 2 )],r + ω 2 (1 + r 2 )−1 f − [l1 (l1 + 2) + α2 (j3 + k3 )2 r −2 ]f = 0\nr\nWriting\nr 2 = x,\n\n(E.1)\n\n1\n\nf = r −α(j3 +k3 ) (1 + r 2 )− 2 ω z\n\nwe get the equation of hypergeometric form\nx(1 + x)zxx + zx [(1 − α(j3 + k3 ))(1 + x) + (1 − ω)x] +\n\nP\nz=0\n4\n\nwhere\nP = (ω + α(j3 + k3 ))(ω + α(j3 + k3 ) − 2) − l1 (l1 + 2)\nThe solutions in section 4 with ω = l1 + 2 − α(j3 + k3 ) have P = 0, z = 1.\n\nIf we include a dependence eimφ on the angular coordinate of AdS, then the equation\n\n(E.1) becomes\n1\n[f,r r(1 + r 2 )],r + ω 2 (1 + r 2 )−1 f − [l1 (l1 + 2) + (α(j3 + k3 ) − m)2 r −2 ]f = 0\n(E.2)\nr\nThus we just get a replacement of α(j3 + k3 ) by α(j3 + k3 ) − m in the above discussion.\n\n31\n\n\fReferences\n[1] A. Strominger and C. Vafa, \"Microscopic Origin of the Bekenstein-Hawking Entropy,\"\nPhys. Lett. B379, 99 (1996) [hep-th/9601029], C. G. Callan and J. M. Maldacena, \"Dbrane Approach to Black Hole Quantum Mechanics,\" Nucl. Phys. B472, 591 (1996)\n[hep-th/9602043], S. R. Das and S. D. Mathur, \"Comparing decay rates for black\nholes and D-branes,\" Nucl. Phys. B478, 561 (1996) [hep-th/9606185], S. R. Das and\nS. D. Mathur, \"Interactions involving D-branes,\" Nucl. Phys. B482, 153 (1996) [hepth/9607149], A. Dhar, G. Mandal and S. R. Wadia, \"Absorption vs decay of black holes\nin string theory and T-symmetry,\" Phys. Lett. B388, 51 (1996) [hep-th/9605234],\nJ. Maldacena and A. Strominger, \"Black hole greybody factors and D-brane spectroscopy,\" Phys. Rev. D55, 861 (1997) [hep-th/9609026].\n[2] J. Maldacena, \"The large N limit of superconformal field theories and supergravity,\"\nAdv. Theor. Math. Phys. 2, 231 (1998) [hep-th/9711200].\n[3] S. S. Gubser, I. R. Klebanov and A. M. Polyakov, \"Gauge theory correlators from\nnon-critical string theory,\" Phys. Lett. B428, 105 (1998) [hep-th/9802109]\n[4] E. Witten, \"Anti-de Sitter space and holography,\" Adv. Theor. Math. Phys. 2, 253\n(1998) [hep-th/9802150].\n[5] O. Coussaert and M. Henneaux, Phys. Rev. Lett. 72, 183 (1994) [hep-th/9310194].\n[6] J. Maldacena and A. Strominger, \"AdS(3) black holes and a stringy exclusion principle,\" JHEP 9812, 005 (1998) [hep-th/9804085]\n[7] J. de Boer, \"Large N Elliptic Genus and AdS/CFT Correspondence,\" JHEP 9905,\n017 (1999) [hep-th/9812240].\n[8] J. R. David, G. Mandal, S. Vaidya and S. R. Wadia, \"Point mass geometries, spectral flow and AdS(3)-CFT(2) correspondence,\" Nucl. Phys. B564, 128 (2000) [hepth/9906112].\n[9] J. M. Izquierdo and P. K. Townsend, \"Supersymmetric space-times in (2+1) adS\nsupergravity models,\" Class. Quant. Grav. 12, 895 (1995) [gr-qc/9501018].\n[10] V. Balasubramanian, J. de Boer, E. Keski-Vakkuri and S. F. Ross, \"Supersymmetric\nconical defects: Towards a string theoretic description of black hole formation,\" hepth/0011217.\n[11] J. Maldacena and L. Maoz, \"De-singularization by rotation,\" hep-th/0012025.\n[12] S. Deger, A. Kaya, E. Sezgin and P. Sundell, \"Spectrum of D = 6, N = 4b supergravity\non AdS(3) x S(3),\" Nucl. Phys. B536, 110 (1998) [hep-th/9804166].\n[13] H. J. Kim, L. J. Romans and P. van Nieuwenhuizen, \"The Mass Spectrum Of Chiral\nN=2 D = 10 Supergravity On S**5,\" Phys. Rev. D32, 389 (1985).\n[14] J. Maharana and J. H. Schwarz, \"Noncompact symmetries in string theory,\" Nucl.\nPhys. B390, 3 (1993) [hep-th/9207016].\n32\n\n\f[15] M.A. Melvin, Phys. Lett. 8 (1964) 65, J. G. Russo and A. A. Tseytlin, \"Magnetic flux\ntube models in superstring theory,\" Nucl. Phys. B461, 131 (1996) [hep-th/9508068].\n[16] S. D. Mathur, \"Real time propagator in the first quantized formalism,\" Proceedings\nof the third Thermal Fields Workshop held at Banff. hep-th/9311025.\n[17] J. Maldacena and A. Strominger, \"AdS(3) black holes and a stringy exclusion principle,\" JHEP 9812, 005 (1998) [hep-th/9804085].\n[18] S. R. Das and S. D. Mathur, \"Excitations of D-strings, Entropy and Duality,\" Phys.\nLett. B375, 103 (1996) [hep-th/9601152].\n[19] J. M. Maldacena and L. Susskind, \"D-branes and Fat Black Holes,\" Nucl. Phys. B475,\n679 (1996) [hep-th/9604042].\n[20] M. Cvetic and F. Larsen, \"General rotating black holes in string theory: Greybody\nfactors and event horizons,\" Phys. Rev. D 56, 4994 (1997) [hep-th/9705192].\n[21] S. D. Mathur, \"Emission rates, the correspondence principle and the information\nparadox,\" Nucl. Phys. B529, 295 (1998) [hep-th/9706151].\n[22] M. Cvetic and S. S. Gubser, \"Thermodynamic stability and phases of general spinning\nbranes,\" JHEP9907, 010 (1999) [hep-th/9903132], J. Maldacena, talk at Strings 99,\nPotsdam.\n[23] J. McGreevy, L. Susskind and N. Toumbas, \"Invasion of the giant gravitons from antide Sitter space,\" JHEP0006, 008 (2000) [hep-th/0003075], M. T. Grisaru, R. C. Myers\nand O. Tafjord, \"SUSY and Goliath,\" JHEP0008, 040 (2000), A. Hashimoto, S. Hirano and N. Itzhaki, \"Large branes in AdS and their field theory dual,\" JHEP0008,\n051 (2000) [hep-th/0008016], [hep-th/0008015]. S. R. Das, A. Jevicki and S. D. Mathur,\n\"Giant gravitons, BPS bounds and noncommutativity,\" Phys. Rev. D 63, 044001\n(2001) [hep-th/0008088], S. R. Das, A. Jevicki and S. D. Mathur, \"Vibration modes\nof giant gravitons,\" Phys. Rev. D 63, 024013 (2001) [hep-th/0009019]\n[24] V. Balasubramanian, P. Kraus and A. Lawrence, \"Bulk vs. boundary dynamics in\nanti-de Sitter spacetime,\" Phys. Rev. D 59, 046003 (1999) [hep-th/9805171].\n[25] O. Lunin and S. D. Mathur, \"Correlation functions for M**N/S(N) orbifolds,\" hepth/0006196.\n[26] O. Lunin and S. D. Mathur, in preparation\n[27] F. Larsen and E. Martinec, \"U(1) charges and moduli in the D1-D5 system,\"\nJHEP9906, 019 (1999) [hep-th/9905064].\n[28] G. T. Horowitz and H. Ooguri, \"Spectrum of large N gauge theory from supergravity,\"\nPhys. Rev. Lett. 80, 4116 (1998) [hep-th/9802116].\n\n33\n\n\f"}