{"id": "http://arxiv.org/abs/hep-ph/0601128v1", "guidislink": true, "updated": "2006-01-17T11:16:03Z", "updated_parsed": [2006, 1, 17, 11, 16, 3, 1, 17, 0], "published": "2006-01-17T11:16:03Z", "published_parsed": [2006, 1, 17, 11, 16, 3, 1, 17, 0], "title": "Exclusive Higgs boson production at the LHC: hard rescattering\n  corrections", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0601096%2Chep-ph%2F0601180%2Chep-ph%2F0601048%2Chep-ph%2F0601080%2Chep-ph%2F0601094%2Chep-ph%2F0601025%2Chep-ph%2F0601035%2Chep-ph%2F0601095%2Chep-ph%2F0601057%2Chep-ph%2F0601237%2Chep-ph%2F0601201%2Chep-ph%2F0601111%2Chep-ph%2F0601271%2Chep-ph%2F0601195%2Chep-ph%2F0601085%2Chep-ph%2F0601072%2Chep-ph%2F0601046%2Chep-ph%2F0601164%2Chep-ph%2F0601104%2Chep-ph%2F0601192%2Chep-ph%2F0601182%2Chep-ph%2F0601187%2Chep-ph%2F0601103%2Chep-ph%2F0601153%2Chep-ph%2F0601161%2Chep-ph%2F0601016%2Chep-ph%2F0601002%2Chep-ph%2F0601017%2Chep-ph%2F0601026%2Chep-ph%2F0601142%2Chep-ph%2F0601247%2Chep-ph%2F0601077%2Chep-ph%2F0601012%2Chep-ph%2F0601167%2Chep-ph%2F0601010%2Chep-ph%2F0601078%2Chep-ph%2F0601074%2Chep-ph%2F0601203%2Chep-ph%2F0601241%2Chep-ph%2F0601206%2Chep-ph%2F0601150%2Chep-ph%2F0601090%2Chep-ph%2F0601146%2Chep-ph%2F0601245%2Chep-ph%2F0601065%2Chep-ph%2F0601128%2Chep-ph%2F0601240%2Chep-ph%2F0601184%2Chep-ph%2F0601066%2Chep-ph%2F0601034%2Chep-ph%2F0601076%2Chep-ph%2F0601243%2Chep-ph%2F0601185%2Chep-ph%2F0601125%2Chep-ph%2F0601155%2Chep-ph%2F0601113%2Chep-ph%2F0601043%2Chep-ph%2F0601158%2Chep-ph%2F0601217%2Chep-ph%2F0601058%2Chep-ph%2F0601178%2Chep-ph%2F0601242%2Chep-ph%2F0601041%2Chep-ph%2F0601020%2Chep-ph%2F0601031%2Chep-ph%2F0601205%2Chep-ph%2F0601177%2Chep-ph%2F0601121%2Chep-ph%2F0601088%2Chep-ph%2F0601176%2Chep-ph%2F0601045%2Chep-ph%2F0601119%2Chep-ph%2F0601156%2Chep-ph%2F0601188%2Chep-ph%2F0601214%2Chep-ph%2F0601166%2Chep-ph%2F0601149%2Chep-ph%2F0601141%2Chep-ph%2F0601013%2Chep-ph%2F0601114%2Chep-ph%2F0601233%2Chep-ph%2F0601268%2Chep-ph%2F0601138%2Chep-ph%2F0601225%2Chep-ph%2F0601197%2Chep-ph%2F0601147%2Chep-ph%2F0601236%2Chep-ph%2F0601100%2Chep-ph%2F0601037%2Chep-ph%2F0601089%2Chep-ph%2F0601014%2Chep-ph%2F0601171%2Chep-ph%2F0601174%2Chep-ph%2F0601193%2Chep-ph%2F0601052%2Chep-ph%2F0601194%2Chep-ph%2F0601260%2Chep-ph%2F0601009%2Chep-ph%2F0601132%2Chep-ph%2F0601087%2Chep-ph%2F0601101&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Exclusive Higgs boson production at the LHC: hard rescattering\n  corrections"}, "summary": "We examine, as a correction to the central exclusive Higgs boson production\nin $pp$ collisions at the LHC, the rescattering of gluonic ladders off the\nproton. As usual, at the lowest order the hard part of this process can be\ndescribed as a fusion of two hard gluonic ladders. We calculate corrections to\nthis hard amplitude which are due to rescattering of these ladders. These\ncorrections, which contain high mass diffractive excitations of the proton,\nhave not yet been taken into account by the usual soft survival probabilities.\nWe find that the correction due to the exchange of a single hard rescattering\nis negative, large and infrared sensitive. As a first step towards a more\nreliable description we therefore replace the rescattering exchange by a\nunitarized amplitude using the BK equation which generates the saturation scale\n$Q_s(x)$. We also include a soft gap survival probability factor. We discuss\nthe results and outline possible future strategies.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0601096%2Chep-ph%2F0601180%2Chep-ph%2F0601048%2Chep-ph%2F0601080%2Chep-ph%2F0601094%2Chep-ph%2F0601025%2Chep-ph%2F0601035%2Chep-ph%2F0601095%2Chep-ph%2F0601057%2Chep-ph%2F0601237%2Chep-ph%2F0601201%2Chep-ph%2F0601111%2Chep-ph%2F0601271%2Chep-ph%2F0601195%2Chep-ph%2F0601085%2Chep-ph%2F0601072%2Chep-ph%2F0601046%2Chep-ph%2F0601164%2Chep-ph%2F0601104%2Chep-ph%2F0601192%2Chep-ph%2F0601182%2Chep-ph%2F0601187%2Chep-ph%2F0601103%2Chep-ph%2F0601153%2Chep-ph%2F0601161%2Chep-ph%2F0601016%2Chep-ph%2F0601002%2Chep-ph%2F0601017%2Chep-ph%2F0601026%2Chep-ph%2F0601142%2Chep-ph%2F0601247%2Chep-ph%2F0601077%2Chep-ph%2F0601012%2Chep-ph%2F0601167%2Chep-ph%2F0601010%2Chep-ph%2F0601078%2Chep-ph%2F0601074%2Chep-ph%2F0601203%2Chep-ph%2F0601241%2Chep-ph%2F0601206%2Chep-ph%2F0601150%2Chep-ph%2F0601090%2Chep-ph%2F0601146%2Chep-ph%2F0601245%2Chep-ph%2F0601065%2Chep-ph%2F0601128%2Chep-ph%2F0601240%2Chep-ph%2F0601184%2Chep-ph%2F0601066%2Chep-ph%2F0601034%2Chep-ph%2F0601076%2Chep-ph%2F0601243%2Chep-ph%2F0601185%2Chep-ph%2F0601125%2Chep-ph%2F0601155%2Chep-ph%2F0601113%2Chep-ph%2F0601043%2Chep-ph%2F0601158%2Chep-ph%2F0601217%2Chep-ph%2F0601058%2Chep-ph%2F0601178%2Chep-ph%2F0601242%2Chep-ph%2F0601041%2Chep-ph%2F0601020%2Chep-ph%2F0601031%2Chep-ph%2F0601205%2Chep-ph%2F0601177%2Chep-ph%2F0601121%2Chep-ph%2F0601088%2Chep-ph%2F0601176%2Chep-ph%2F0601045%2Chep-ph%2F0601119%2Chep-ph%2F0601156%2Chep-ph%2F0601188%2Chep-ph%2F0601214%2Chep-ph%2F0601166%2Chep-ph%2F0601149%2Chep-ph%2F0601141%2Chep-ph%2F0601013%2Chep-ph%2F0601114%2Chep-ph%2F0601233%2Chep-ph%2F0601268%2Chep-ph%2F0601138%2Chep-ph%2F0601225%2Chep-ph%2F0601197%2Chep-ph%2F0601147%2Chep-ph%2F0601236%2Chep-ph%2F0601100%2Chep-ph%2F0601037%2Chep-ph%2F0601089%2Chep-ph%2F0601014%2Chep-ph%2F0601171%2Chep-ph%2F0601174%2Chep-ph%2F0601193%2Chep-ph%2F0601052%2Chep-ph%2F0601194%2Chep-ph%2F0601260%2Chep-ph%2F0601009%2Chep-ph%2F0601132%2Chep-ph%2F0601087%2Chep-ph%2F0601101&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We examine, as a correction to the central exclusive Higgs boson production\nin $pp$ collisions at the LHC, the rescattering of gluonic ladders off the\nproton. As usual, at the lowest order the hard part of this process can be\ndescribed as a fusion of two hard gluonic ladders. We calculate corrections to\nthis hard amplitude which are due to rescattering of these ladders. These\ncorrections, which contain high mass diffractive excitations of the proton,\nhave not yet been taken into account by the usual soft survival probabilities.\nWe find that the correction due to the exchange of a single hard rescattering\nis negative, large and infrared sensitive. As a first step towards a more\nreliable description we therefore replace the rescattering exchange by a\nunitarized amplitude using the BK equation which generates the saturation scale\n$Q_s(x)$. We also include a soft gap survival probability factor. We discuss\nthe results and outline possible future strategies."}, "authors": ["J. Bartels", "S. Bondarenko", "K. Kutak", "L. Motyka"], "author_detail": {"name": "L. Motyka"}, "author": "L. Motyka", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.73.093004", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/hep-ph/0601128v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-ph/0601128v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "28 pages, 9 figures", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-ph/0601128v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-ph/0601128v1", "journal_reference": "Phys.Rev.D73:093004,2006", "doi": "10.1103/PhysRevD.73.093004", "fulltext": "hep-ph/0601128\n\nExclusive Higgs boson production at the LHC:\nhard rescattering corrections\n\narXiv:hep-ph/0601128v1 17 Jan 2006\n\nJ. Bartels a) ∗,\n\na)\n\nS. Bondarenko a) †,\n\nK. Kutak\n\na),b) ‡\n\nand L. Motyka c),d) §\n\nII Institute for Theoretical Physics, University of Hamburg, Germany\nb)\n\nH. Niewodniczański Institute of Nuclear Physics, Kraków, Poland\nc)\nd)\n\nDESY Theory Group, Hamburg, Germany\n\nInstitute of Physics, Jagellonian University, Kraków, Poland\n\nJanuary 16, 2006\n\nAbstract\nWe examine, as a correction to the central exclusive Higgs boson production in pp collisions\nat the LHC, the rescattering of gluonic ladders off the proton. As usual, at the lowest order the\nhard part of this process can be described as a fusion of two hard gluonic ladders. We calculate\ncorrections to this hard amplitude which are due to rescattering of these ladders. These corrections,\nwhich contain high mass diffractive excitations of the proton, have not yet been taken into account\nby the usual soft survival probabilities. We find that the correction due to the exchange of a single\nhard rescattering is negative, large and infrared sensitive. As a first step towards a more reliable\ndescription we therefore replace the rescattering exchange by a unitarized amplitude using the BK\nequation which generates the saturation scale Qs (x). We also include a soft gap survival probability\nfactor. We discuss the results and outline possible future strategies.\n\n∗\n\nEmail: bartels@mail.desy.de\nEmail: sergb@mail.desy.de\n‡\nE-mail: kutak@mail.desy.de\n§\nE-mail: motyka@th.if.uj.edu.pl\n†\n\n\f1\n\nIntroduction\n\nOne of the main experimental goals to be achieved at the Large Hadron Collider (LHC) is the discovery\nof the Higgs boson and the investigation of its properties. The discovery potential of LHC should be\nsufficient to find the Standard Model Higgs boson as well as the supersymmetric Higgs particles in the\nwide range of masses, starting from the lower limit of 114.4 GeV imposed by the LEP [1] data up to\nthe mass of a few hundred GeV. Precise electroweak measurements indicate, however, that the mass\nof the Higgs boson should be rather at the lower end of the allowed window, with the central value at\n113 GeV being determined from radiative corrections, and the upper limit of about 240 GeV at the\nconfidence level of 95%. It has been proposed [2]–[15] that, if the Higgs boson mass, MH , is close to\nthe expected central value, a measurement of the exclusive diffractive reaction should be possible:\np p −→ p H p,\n\n(1)\n\nwith the Higgs boson separated by rapidity gaps from the protons. The main advantage of this process\nis an extremely low background which is much smaller than the potential signal. The background\nsuppression permits precise measurements – for instance of the quantum numbers of the Higgs boson.\nBesides that, in the exclusive production process, detection of protons provides a complete information\non the invariant mass of the produced system. This opens an exciting possibility to find resonances\ncorresponding to new heavy particles that would be invisible in conventional measurements, see [16,\n17, 18]. The main drawback of the exclusive Higgs production channel, however, is its very low rate.\nThe requirement of leaving the protons intact and of producing no secondary particles reduces the\ncross section by many orders of magnitude. In the series of papers [5]-[11] the authors discussed\nextensively the theoretical and phenomenological aspects of the exclusive production of heavy particle\nin pp collisions in perturbative QCD, and their approach will be used as the basis of our study.\nThe mechanism of the considered process is illustrated in the diagram in in Fig. 1a. Thus, the\nhard subprocess is given by a fusion of two colour singlet gluonic ladders into the Higgs scalar. The\ndiagram may be evaluated in the kt -factorisation framework using the unintegrated gluon densities.\nThe required absence of hard radiation leaves un-compensated the virtual corrections to the process.\nThose corrections turn out to be large as they contain the scale of the Higgs boson mass generating\nlarge double and single logarithmic contributions. The necessary resummation of these logarithmically\nenhanced terms is realized by including the Sudakov form factor, which not only reduces the cross section but also provides the infrared stability of the hard exclusive scattering amplitude. Unfortunately,\nthe basic hard subprocess is accompanied by multiple soft rescattering, which, typically, is inelastic\nand suppresses the exclusive cross section. Currently, the soft inelastic rescattering may be estimated\nonly in phenomenological models [19, 20, 21, 22]. Present calculations of the gap survival probability\nrely predominantly on a two channel eikonal model for the pp opacity, incorporating effects of the\nlow mass diffraction and of the pionic cloud. The model was developed in Refs. [20, 21], and the\n2\n\n\fa)\n\nb)\n\nFigure 1: The exclusive Higgs boson production in a pp collision: a) the Two Pomeron Fusion contribution and b) a hard absorptive correction.\nparameters were fitted to describe the data on the total pp and pp̄ cross section and on the elastic\npp and pp̄ scattering.\nIn this paper we shall address the problem of computing a hard absorptive correction to the\nexclusive production process, which has already been mentioned in the literature [18] but has not been\nstudied in detail yet. In brief, this contribution comes from an absorption of the hard gluonic ladders\nthat fuse to produce the Higgs boson in the pp scattering process, see Fig. 1b. This contribution can\nalso be viewed as the rescattering of a large mass intermediate diffractive state moving along one of\nthe protons (the proton at the top of in Fig. 1b; let us call it the projectile) off the other proton (the\nproton at the bottom of in Fig. 1b, the target), and this contribution is not part of the soft rescattering\nof the spectators that contributes to the standard opacity. In Fig. 1b, the large mass diffractive state is\nindicated by a dashed line. In perturbative QCD, within the leading logarithmic 1/x approximation,\nthe rescattering is driven by the exchange of a BFKL Pomeron [23, 24, 25, 26] which couples to the hard\ngluonic ladder by the triple Pomeron vertex [27, 28, 29, 30]. Such a contribution is potentially large,\nsince the BFKL rapidity evolution between the target proton and the triple Pomeron vertex extends\nover the length of Y > 14 and thus may generate an enhancement by two orders of magnitude. If this\ncorrection is really as large as anticipated, it is clear that also higher order unitarity corrections to\nthis hard rescattering will be sizable and should be evaluated as well.\nAs we shall discuss in detail, the situation is even more complicated. Namely, when evaluating the\nrescattering correction based on a simple BFKL Pomeron exchange, it turns out that the amplitude\n– which is infrared finite – exhibits a high sensitivity to the details of the infrared region. To be\nmore precise, the momentum scale around the triple Pomeron vertex tends to be small. At first sight,\ntherefore, this naïve approach seems to be highly questionable. However, if we include – perturbative –\nunitarity corrections, the problems with the infrared sensitivity may be greatly reduced. As a guiding\nexample let as quote results of Refs. [34, 35] on the impact of a special class of unitarity corrections on\n3\n\n\fthe behaviour of the gluon distribution at low momenta. In these references the Balitsky-Kovchegov\n(BK) equation [31, 32, 33] was investigated, as a model which unitarizes the BFKL Pomeron exchange\nby a resummation of the BFKL Pomeron fan diagrams. It was found that the equation generates a\nmomentum scale, the saturation scale Qs (Y ), which provides an effective lower cut-off on the gluon\nmomenta. The saturation scale grows exponentially with the evolution length Y , Qs (Y ) ∼ exp(λY ),\nwith λ ≃ 0.3, and the saturation scale enters the region in which perturbative QCD is applicable if Y\n\nis sufficiently large. Thus, in the presence of the perturbative saturation scale the high sensitivity\nto the infrared domain is eliminated. Let us stress here that the concept of a rapidity dependent\nsaturation scale is rather robust. The concept has received strong support from phenomenological\nconsiderations, being the central part of the very fruitful saturation model [36, 37]. It was also proven\nthat the generation of the saturation scale is a universal phenomenon in a wide class of non-linear\nevolution equations [38, 39, 40], which gives some confidence that the emergence of the saturation\nscale is not an accidental feature of the BK equation.\nIn the second part of our investigation, therefore, we shall replace the linear BFKL equation for\nthe screening Pomeron by the non-linear Balitsky-Kovchegov evolution equation. This corresponds\nto the resummation of the BFKL Pomeron fan diagrams originating from the target proton: this\nresummation will be shown to stabilize the correction amplitude in the infrared region. Certainly, in\ndoing so we have made rather crude approximations. Namely, we have not taken into account other\nimportant unitarity corrections present in the case of proton-proton scattering, for instance those\nrelated to possible interactions of the Pomerons in the fan diagrams with the projectile proton (for\na more detailed discussion see Section 7). For the total cross section of nucleus-nucleus collisions\nan effective field theory of interacting BFKL Pomerons has been formulated [41, 42, 43]. For pp\nscattering an analogous framework is still to be developed. We therefore view our study only as a first\nstep towards constructing a theoretical framework for evaluating hard absorptive corrections to the\nexclusive high mass production in pp collisions. We shall compute the magnitude of the correction in\nthis, rather crude, approximation in order to provide some insight into how important the discussed\neffects might be.\nThe structure of the paper is the following. In Section 2 we briefly review the standard framework\nintroduced in the series of papers [5]–[11]. We derive the hard rescattering correction in Section 3. The\ncalculation of the soft gap survival probability for the hard corrected amplitude is given in Section 4.\nIn Section 5 the Balitsky-Kovchegov evolution of the gluon density is described. The results of the\nnumerical evaluation of the hard rescattering corrections and the obtained cross sections are presented\nin Section 6. Implications of the results and future strategies are discussed in Section 7. Finally,\nconclusions are presented in Section 8.\n\n4\n\n\f111111111111\n000000000000\n000000000000\n111111111111\n000000000000\n111111111111\n000000000000\n111111111111\n000000000000\n111111111111\n000000000000\n111111111111\n000000000000\n111111111111\n000000000000\n111111111111\n000000000000\n111111111111\n000000000000\n111111111111\n\nx1\n\np1\nx 1 , k1\n\nFigure 2: Kinematics of the\n\nH\n\nk1 = k 2\n\nTwo Pomeron Fusion contribution to the exclusive Higgs\n\nx2\n\nx2 , k 2\n111111111111\n000000000000\n000000000000\n111111111111\n000000000000\n111111111111\n000000000000\n111111111111\n000000000000\n111111111111\n000000000000\n111111111111\n000000000000\n111111111111\n000000000000\n111111111111\n000000000000\n111111111111\n000000000000\n111111111111\n\n2\n\nboson production.\n\np2\n\nThe hard amplitude for exclusive Higgs production\n\nIn this Section we briefly review the main features of the standard QCD approach [5]–[11] to the hard\npart of the exclusive Higgs boson production in pp collisions.\nThe basic diagram is given in Fig. 2; the leading contribution of this amplitude is imaginary.\nThe diagram is evaluated in the high energy limit, where the t-channel gluons are in the so-called\nnonsense polarisation states, and their virtualities are dominated by the transverse components of\ntheir momenta. The matrix element describing the fusion of two gluons into the Higgs boson is given\nby the top quark triangle, taken in the limit of a point-like coupling. This effective approximation\nis very accurate as the gluon virtualities are much smaller than the top quark mass. The amplitude\nof finding, in the proton, two gluons that carry tranverse momenta k and k′ and fractions x and x′\nof the longitudinal momentum of the parent proton is represented by the off-diagonal unintegrated\ngluon density fgoff (x, x′ ; k, k′ ; μ), assuming that the density is probed at the scale μ. The three subamplitudes (Fig. 2), corresponding to the gluon emissions and to the Higgs boson production, are\nconvoluted using the kt -factorisation.\nThe kinematics of the exclusive Higgs boson production determines the arguments of the offdiagonal gluon densities. Thus, the elastic form-factor of the proton provides a sharp cut-off, which\nwe assume to be Gaussian: ∼ exp[−(k − k′ )2 R2 /4] with R2 ≃ 8 GeV2 , on the momentum transfer\n\ncarried by the gluonic system. Therefore, it is appropriate to write\n\nfgoff (x, x′ ; k, k′ ; μ) ≃ fgoff (x, x′ ; k2 ; μ) exp[−(k − k′ )2 R2 /4].\n\n(2)\n\nFor future use, let us also define the unintegrated gluon distribution depending on the position b in\nthe transverse plane\nf ̃goff (x, x′ ; k2 , b; μ) =\n\nZ\n\nd2 q iqb off\ne fg (x, x′ ; k, q − k; μ),\n(2π)2\n5\n\n(3)\n\n\fwhere q = k − k′ .\nThe next point that should be discussed is the disparity between the longitudinal momentum\nfractions x and x′ . The production of the heavy scalar particle occurs close to the central region\np\n√\nwhere x ≃ MH / s and x′ ∼ k2 /s, so x′ ≪ x. At the leading logarithmic level the off-diagonal\n\n(w.r.t. x) distribution reduces to the diagonal one. Beyond the LL accuracy the effect of different x\n\nvalues of the gluons may be approximated by a constant factor [44]\n22λ+3 Γ(λ + 5/2)\n,\nRξ = √\nπ Γ(λ + 4)\n\n(4)\n\nprovided the diagonal gluon distribution has a power-like x-dependence, fg (x, k2 ; μ) ∼ x−λ . For\n\nmoderate scales one has λ ≃ 0.25.\n\nThe last important point is the scale dependence of the unintegrated gluon density. In the BFKL\napproach to the evolution of the gluon density there is no dependence of the gluon density on the\nexternal scale. This happens because the virtual perturbative QCD corrections to the coupling of\nthe ladder to the Higgs production vertex generate only the DGLAP logarithms log(μ2 /k2 ) (double\nand single) and not the small x logarithms. In double logarithmic (in log(μ2 /k2 )) accuracy, the large\ncorrections may be resumed into the Sudakov form-factor [6]:\n\u0012\n\nTs (k, μ) = exp −\n\nZ\n\nμ2\n\ndp2 Nc αs\np2 π\n\nk2\n\nZ\n\nμ\np\n\ndω\n.\nω\n\u0013\n\n(5)\n\nThe calculation of the Sudakov form-factor at single logarithmic accuracy has also been performed [6],\ngiving\nTg (k, μ) = exp −\nwhere δ =\n\np\np+μ\n\nZ\n\nμ2\n\nk2\n\ndp2 αs (p2 )\np2 2π\n\nZ\n\n0\n\n1−δ\n\n\"\n\ndzz Pgg (z) +\n\nX\n\n#!\n\nPqg (z)\n\nq\n\n,\n\n(6)\n\nis chosen to provide the correct angular ordering of the real gluon emissions, and Pgg\n\nand Pqg are the DGLAP leading order splitting functions. For the exclusive Higgs production the\nscale μ ≃ 0.62MH should be chosen [11] in order to match exactly the first order single logarithmic\n\ncorrection. In our calculation we shall adopt the scale μ = MH /2, which does not introduce a\nsignificant change of the result compared to the choice of [11].\nA thorough discussion of how to determine the two-scale diagonal unintegrated gluon distribution\nhas been presented in Refs. [45, 46]. A simple and economic way to incorporate the Sudakov formfactor into the unintegrated gluon distribution is given by the approach in which the last step of\nthe DGLAP evolution is resolved in terms of the transverse momentum. In this approach, the twoscale unintegrated gluon distribution is obtained from the collinear gluon distribution in the following\nway [47, 45, 46]:\nfg (x, k2 ; μ) = Q2\n\n∂\nxg(x, Q2 ) * Tg (Q, μ)\n∂Q2\n\u0014\n\n\u0015\n\n.\n\n(7)\n\nQ2 =k 2\n\nIn the off-diagonal case which is relevant for our present study, the logarithmic virtual corrections are\nassociated with the production vertex at which the pair of gluons merges (see Fig. 2), in contrast to\n6\n\n\fthe standard case of a diagonal gluon distribution in DIS or in a hard inclusive production processes.\nThus, in (7) the Sudakov form-factor has to be replaced by its square root.\nCollecting all these results we arrive at:\nq\n∂\n2\n= Rξ Q\nxg(x,\nQ\n)\n*\nTg (Q, μ)\n∂Q2\n\nfgoff (x, k2 ; μ)\n\n\u0014\n\n2\n\n\u0015\n\n.\n\n(8)\n\nQ2 =k 2\n\nAfter contracting the polarisation tensors of the gluons with the ggH vertex we obtain the dominant\nimaginary part of the hard exclusive amplitude for pp → p H p in the forward direction in the\nfollowing form:\n\nIm M0 (y) = 2π 3 A\n\nZ\n\nd2 k off\nf (x1 , k2 ; μ) fgoff (x2 , k2 ; μ).\n2πk4 g\n\n(9)\n\nHere the constant A is given by\nA2 = K\n\n√\n2\n2 GF α2S (MH\n) /9 π 2 ,\n\n(10)\n\nwhere GF is the Fermi coupling, and K ≈ 1.5 is the NLO K-factor. The Higgs boson rapidity in\nthe centre of mass frame, y, defines the values of longitudinal momentum fractions:\nMH\nx1,2 = √ exp(±y).\ns\n\n(11)\n\nThe differential hard cross-section following from this amplitude takes the form:\ndσpp→pHp(y)\ndy dt1 dt2\n\n=\nt1 =t2 =0\n\n|M0 (y)|2\n.\n256π 3\n\n(12)\n\nAfter the inclusion of the proton elastic form-factors in the non-forward direction (parameterized by\n∼ exp[−(k − k′ )2 R2 /4] in (2)) one obtains the dependence of the cross section on t1 and t2 of the\nform of exp(R2 (t1 + t2 )/2). Thus, after the integration over momentum transfers t1 and t2 , the single\ndifferential cross section reads:\n\ndσpp→pHp(y)\n|M0 (y)|2\n=\n.\ndy\n64π 3 R4\n\n(13)\n\nNote that, in (9), the form of the integral over the transverse momentum suggests an important\nsensitivity to the infrared domain. The rescue comes from the Sudakov form-factor which suppresses\nthe low momenta of the unintegrated gluons faster than any power of k. It turns out that the dominant\ncontribution to the integral (9) comes from momenta k > 1 GeV.\nMore details about the derivation of the amplitude of the exclusive Higgs boson production are\ngiven in the series of papers [5]–[11]. In what follows we shall refer to the amplitude (9) as to the Two\nPomeron Fusion (TPF) Amplitude.\n\n7\n\n\fk1\n\nk1\n\n1111111111111\n0000000000000\n0000000000000\n1111111111111\n0000000000000\n1111111111111\n0000000000000\n1111111111111\n0000000000000\n1111111111111\n0000000000000\n1111111111111\n0000000000000\n1111111111111\n3P\n0000000000000\n1111111111111\n0000000000000\n1111111111111\n0000000000000\n1111111111111\n0000000000000\n1111111111111\n0000000000000\n1111111111111\n\nV\n\nk2\n3\n\nq\nk2 q\n\nk3 + q\n\nFigure 3: The triple Pomeron vertex.\n\nk3\n\nHard rescattering corrections\n\n3.1\n\nConstruction of the amplitude\n\nThe amplitude (9) includes resummed QCD corrections up to single logarithms of the Higgs boson\nmass. The large available rapidity gap between the scattered protons (Ytot ∼ 19 for the LHC energies),\n\nhowever, suggests that significant QCD corrections enhanced by small x logarithms should be also\nconsidered. The spectator rescattering is expected to be of non-perturbative nature, and commonly\nit is accounted for by a soft gap survival probability factor.\nFig. 4 illustrates a process of absorption of the perturbative gluonic ladder from the projectile\n(upper) proton in the target (lower) proton by the exchange of a QCD Pomeron across a large rapidity\ngap. Let us stress that the evolution length in rapidity of the screening Pomeron is large only if\nit couples to the ladder between the projectile proton and the produced Higgs boson. To be more\nspecific, for the central Higgs boson production at the LHC the rapidity distance between the hard\nladder that originates from one proton, and the other proton, y4 = log(1/x4 ) > 14, is large while\nthe rapidity range occupied by each of the two hard ladders, is much smaller, y1 = log(1/x1 ) < 5\nand y3 = log(1/x3 ) < 5. In contrast to this, the rapidity distance y4 can be much larger, and a\nsmall x (BFKL [26]) resummation of the perturbative QCD series may lead to a large enhancement\nof the amplitude ∼ exp(λy4 ) with λ ≃ 0.3. Therefore this correction may be sizable, despite the\n\nfact it is suppressed by the factor of α2s at the triple Pomeron vertex, illustrated in Fig. 3. Thus, we\nshall evaluate the absorptive correction corresponding to the rescattering of the hard projectile gluonic\nsystem off the target proton. The coupling of the screening Pomeron to the screened gluonic ladder is\nknown in the high energy limit; it is derived from the triple Pomeron vertex [27, 28, 29, 30].\nThe triple Pomeron vertex in pQCD has been computed in the LL1/x approximation [27, 28],\nand it follows from the 2 → 4 gluon vertex by projecting on the colour singlet states of the diagram\n\nrepresented symbolically in Fig. 3. In the process of interest the momentum transfers of all three\n8\n\n\f1111111\n0000000\n0000000\n1111111\n0000000\n1111111\n0000000\n1111111\n0000000\n1111111\n0000000\n1111111\n0000000\n1111111\n0000000\n1111111\n0000000\n1111111\n0000000\n0000000\n1111111\n(a)1111111\n0000000\n1111111\n\nfg\n\np1\nx 1,k1\n\n1111111111111\n0000000000000\n0000000000000\n1111111111111\n0000000000000\n1111111111111\nV3P\n0000000000000\n1111111111111\n0000000000000\n1111111111111\n\nGA\n\nx 4 , k4\n\nx 1,k2\nx 2 , k3\n\nH\n\nq\n(c)\n\nfg\n\nf\n\n(b)\ng\n\n111111\n000000\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n\nx 3 , k3\n111111\n000000\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n\np2\n\nFigure 4: The hard rescattering correction to the exclusive Higgs boson production.\nPomerons are small: for the upper Pomeron and for the lower left one they are damped by the\nelastic proton form-factors. We, therefore, will neglect them in the expression for the triple Pomeron\nvertex, and it is will be sufficient to evaluate the vertex in the triple-forward limit. In this limit, the\nconvolution [V3P ⊗ D] of the triple Pomeron vertex V3P with the two-gluon amplitude above the vertex\n\n(here we follow the notation of [28], below we will replace D by the unintegrated gluon density) is\ngiven by [27, 28]:\n[V3P ⊗ D](k2 , k3 ) =\nα2s c3P\n\nZ\n\nd2 k1\n2πk12\n\nk12\n−\n(k1 − k2 )2\n\nk12\n−\n(k1 + k3 )2\n\n(\n\nk32\n(k2 + k3 )2 k12\nk22\n+\n−\n(k1 − k2 )2 (k1 + k3 )2 (k1 − k2 )2 (k1 + k3 )2\n\nk22\n(k2 + k3 )2\n−\n(k1 − k2 )2 + k12 (k1 − k2 )2 + (k1 + k3 )2\nk32\n(k2 + k3 )2\n−\n(k1 + k3 )2 + k12 (k1 − k2 )2 + (k1 + k3 )2\n\n!\n!\n\n!\n\nD(k1 )\n\n)\n\n,\n\nD(k2 )\nD(k3 )\n\n(14)\n\nwhere ±k2 and ±k3 are gluon momenta inside the two Pomerons below the vertex (see Fig. 3). Note\n\nthat, in formula (14), the triple Pomeron vertex includes both real (the first term in the l.h.s.) and\nvirtual (the next term in the l.h.s.) contributions. The normalisation factor, c3P , of the vertex will\nfixed by the form of the final expression for the correction amplitude (18), and we have constructed\nthis expression in such a way that c3P = 1.\nIn order to build up the complete expression of the amplitude of the diagram shown in Fig. 4 it is\nnecessary to take into account the following building blocks:\n(a)\n\n1. The unintegrated gluon distribution, fg (x1 , k12 ; μa ), describing the amplitude of the gluons\n9\n\n\fabove the triple Pomeron vertex V3P . This gluon distribution is evaluated at relatively large\nx1 , and the momentum scale in the vertex should be given by the typical virtualities of the\nvertex, μa ≃ k1 . So the gluon distribution will be evaluated using (7)1 , and we shall denote the\n(a)\n\nconvolution (14) of the triple Pomeron vertex with the unintegrated gluon, fg (x1 , k1 ; k1 ), by\n[V3P ⊗ fg(a) (x1 )](k2 , k3 ).\n\n(15)\n\n2. The two-gluon Green's function GA (k2 , k3 ; x1 , x2 ; μa , μb ) that describes the propagation of the\ntwo gluon singlet between the Higgs production vertex and the triple Pomeron vertex. Two approximations for the Green's functions will be considered: the two gluon approximation (G0 (. . .))\nand the diffusion approximation to the BFKL evolution (GBFKL (. . .)). The Green's function will\nhave the typical scales μa and μb , where the latter scale belongs to the Higgs production vertex.\nAs to the scale of the triple Pomeron vertex, μa ∼ k2 , a priori, we do not know whether it will\n\nbe large. However, the large scale is certainly present in the Higgs vertex, μb ≃ MH /2. In order\nto account for the scale dependence at the Higgs vertex, the Sudakov form factor,\nwill be included into the Green's function:\nG0 (k2 , k3 ; x1 , x2 ; μb ) =\n\nq\n\nTg (k3 , μb ),\n\nq\n\nTg (k3 , μb ) k24 δ(2) (k2 − k3 )\n\n(16)\n\nand\nq\n\nTg (k3 , μb )\nlog2 (k22 /k32 )\nk2 k3\np\nexp −\nGBFKL (k2 , k3 ; x1 , x2 ; μb ) =\n2π\n4D log(x1 /x2 )\nπD log(x1 /x2 )\n\"\n\n#\u0012\n\nx1\nx2\n\n\u0013ω0\n\n,\n\n(17)\n\nwhere only the leading conformal spin was taken into account, ω0 = 4 log(2)ᾱs is the LL BFKL\nintercept, D = 14ζ(3)ᾱs is the diffusion coefficient, and ᾱs = 3αs /π.\n3. The Higgs boson production vertex which does not differ from the TPF case.\n(b)\n\n4. The off-diagonal unintegrated gluon distribution, fg (x3 , k3 , q−k3 ; μb ), of the gluon distribution\nthat enters the Higgs boson production vertex from the lower side, with the total transverse\nmomentum q. The gluon distribution is taken to be the same as in the case of the Two Pomeron\nFusion, i.e. it is an off-diagonal gluon distribution given by formulae (8) and (2) and with\nμb = MH /2.\n(c)\n\n5. The off-diagonal unintegrated gluon distribution, fg (x4 , k4 , −q − k4 ; μc ), for the screening\nPomeron that propagates across the large rapidity distance from the lower proton to the triple\n\nPomeron vertex with momentum transfer −q. The scale μc is set by the gluon virtuality, so\n(c)\n\n(c)\n\none has fg (x4 , k4 , −q − k4 ) = fg (x4 , k4 , −q − k4 ; k4 ). For a detailed discussion of this gluon\ndistribution see Section 4.\n\n1\n\nNote that, for μa = k1 , the Sudakov form factor, Tg (k1 , μa ), in (7) introduces only a minor effect.\n\n10\n\n\fAfter these definitions the expression for the dominant imaginary part of the diagram of Fig. 4\ncan be written in the following form:\nIm\n\n(1)\nMcorr\n(y)\n\n9\n= − 16π 2 (2π 3 A)\n8\n\nZ\n\nxb\n\nxa\n\ndx4\nx4\n\nZ\n\nd2 q\n(2π)2\n\nd2 k2\n2πk24\n\nZ\n\nZ\n\nd2 k3\n2πk34\n\nZ\n\nd2 k4\n2πk44\n\n× [V3P ⊗ fg(a) (x1 )](k2 , k4 )GA (k2 , k3 ; x1 , x2 ; MH /2)\n× fg(b) (x3 , k3 , q − k3 ; MH /2) fg(c) (x4 , k4 , −q − k4 ),\nwhere\n\n9\n8\n\n=\n\nNc2\nNc2 −1\n\n(18)\n\ntends to unity in the large Nc limit, and the coefficient 2π 3 A has been extracted in\n\norder to enable an easier comparison with the Two Pomeron Fusion contribution given by (9). xa and\nxb denote the lower and the upper limits of the integration over x4 , respectively. The fractions of the\nlongitudinal momenta of the upper proton x1 and x2 and of the lower proton x3 , x4 read:\nMH\nx3 = √ exp(−y),\ns\nxa < x4 < xb ,\n\nMH\nx2 = √ exp(y),\ns\nxa ≃\n\nk02\n,\ns\n\nx1 ≃\n\nxb ≃\n\nk02\nx4 s\n\n(19)\n\nk02\n.\nx2 s\n\n(20)\n\nThe energy scale k02 that enters the definitions of gluon xi corresponds to typical values of the virtualities, and we set k02 = 1 GeV2 . The dependence on the momentum transfer q, circulating in the\n(b)\n\nPomeron-proton triangle, appears only inside the off-shell unintegrated gluon distributions, fg\n(c)\nfg ,\n\nand\n\nwhich contain the rapidly varying proton form-factor. The q dependence of the other vertices\n\nand of the Green's function, GA , is weak and will be neglected. The amplitude (18) includes a factor\nof 2 coming from the possible emissions of the Higgs boson from both of the Pomerons below the triple\nPomeron vertex. In addition, we have to add another contribution in which we interchange the role\nof projectile and target: since the structure of both protons is identical, we simply replace y → −y. So\nfinally the correction amplitude may be written as:\n\n(1)\n(1)\n(y) + Mcorr\n(−y).\nMcorr (y) = Mcorr\n\n(21)\n\n(1)\n\nIn the case of the central production, y = 0, and Mcorr (y) = 2 Mcorr (y).\n\n3.2\n\nInfrared stability\n\nIt is instructive to study the infrared behaviour of the integral in (18) using a simplified framework and\nthe saddle point method. First of all, we note that the integrals in (18) are infrared finite. This follows\nfrom properties of the triple Pomeron vertex (which vanishes whenever one of the external momenta\ngoes to zero) and of the unintegrated gluon densities (which, as a result of gauge invariance, also\nvanish as one of the two gluon momenta goes to zero). Next, after averaging over the angles in k2 and\nk4 , the triple Pomeron vertex (14) imposes the conditions k2 ≥ k1 and k4 ≥ k1 . Finally, disregarding\n11\n\n\firrelevant constants and details one finds that, for the real contribution of the triple Pomeron vertex,\nthe correction term (18) behaves as\nQR ∼\n\nZ\n\nk02\n\ndk12\nk12\n\nZ\n\nk12\n\ndk22\nk24\n\nZ\n\nk12\n\nq\ndk42 (a)\n2\n(b)\n2\n(c)\n2\nTs (k2 , MH /2),\nf\n(x\n,\nk\n)\nf\n(x\n,\nk\n;\nM\n/2)\nf\n(x\n,\nk\n)\n2\n3\nH\n4\ng\n1\ng\n2\ng\n4\nk44\n\n(22)\n\nwhere we used, for the Green's function GA , the approximation of the two-gluon exchange, see (16).\nNote that the Sudakov form-factor,\n\np\n\nTs (k2 , MH /2), is present in the Green's function (shown explic(b)\n\nitly in (22)) and, implicitly, in the gluon distributions fg (x3 , k22 ; MH /2).\nIn this analysis we have introduced a cut-off, k0 , of the low momenta in the integration over k1 .\nThe scale k0 is meant to lie in the perturbative domain above the low hadronic scale of the proton\nform-factor. The structure of the nested integrations in (22) implies that this scale k0 is a lower limit\nfor all momenta. By studying the variation of the integrals (22) as a function of k0 , we obtain a\nmeasure of the sensitivity of the correction to poorly known details of the proton structure at low\nmomentum scales. The strong coupling constant, αs , is kept fixed, as the running coupling introduces\nonly logarithmic corrections, and, for the moment, we are interested in tracing only the leading power\nof k0 that arises from the integral (22). In our estimate we use the Sudakov form-factor in the double\nlogarithmic approximation:\n\n3αs\nTs (k, μ) = exp −\nlog2 (μ2 /k2 ) .\n4π\n\u0012\n\n\u0013\n\n(23)\n\nLet us start by performing the analysis of QR with the conservative assumption of a vanishing\nanomalous dimension of the gluon density (i.e. a constant behaviour of the gluon density as a function\nof momentum). Then the integral over k2 behaves in the same way as the integral defining the Two\nPomeron Fusion amplitude. It is dominated by a contribution from a saddle point at a perturbative\nvalue, k2 = (MH /2) exp(−2π / 3αs ), with only marginal sensitivity to the infrared domain.\nThe nested integrations over k1 and k4 in (22) are dominated by momenta close to the cut-off\nscale k0 and lead to a result ∼ 1/k02 . This means that our correction is not small, but the magnitude\n(a)\n\nis sensitive to details of the gluon distributions fg\n\n(c)\n\nand fg\n\nat low momenta, and hence, unreliable.\n\nAt first sight, this seems to imply that the whole Ansatz of choosing, for the absorptive correction, a\nperturbative gluon ladder, cannot be justified.\nA closer look, however, shows that this may not be the final answer. Namely, many arguments\nhave been given that the gluon density at very small x should saturate, i.e. it scales and depends upon\nthe ratio k2 /Q2s (x). Here Qs (x) ∼ x−λ is the saturation scale which grows in 1/x with λ ≃ 0.3. This\nleads to a substantial change of the k2 -dependence of the gluon density for momenta being smaller\n\nthan the saturation scale: the saturation scale becomes an effective lower cut-off of the gluon momenta\nin the small-k2 region. The phenomenological analysis of HERA data [36, 37] indicates that Q2s (x4 )\ntakes values of a few GeV2 for the range of x4 relevant in our problem where log(1/x4 ) can be as large\nas 14 to 19 units.\n12\n\n\fApplying these arguments to our integral (22) we find that, in the presence of the saturation scale,\n(c)\n\nthe momentum dependence of gluon distribution fg\nk4 give\nZ\n\nQ2s (x4 )\n\ndk42\nk44\n\nZ\n\nk42\n\nk02\n\nis modified, and the nested integrals over k1 and\n\ndk12\nlog(Q2s (x4 )/k02 )\n.\n∼\n2\nQ2s (x4 )\nk1\n\n(24)\n\nWith Qs (x4 ) being well above the infrared scale k02 , this represents a well-behaved result with a low\nsensitivity to the infrared physics. Keeping in mind that, in (22), the integration over k2 is infraredsafe, one finds that QR is infrared stable.\nAn analogous reasoning can be applied also to the contribution of the virtual correction part of\nthe triple Pomeron vertex to the integrals in (18). The behavior is approximated by:\nQV ∼\n\nZ\n\nk02\n\ndk12\nk14\n\nZ\n\nk12\n\nq\ndk22\n2\n2 (a)\n2\n(b)\n2\n(c)\n2\nTs (k1 , MH /2),\nlog(k\n/k\n)f\n(x\n,\nk\n)\nf\n(x\n,\nk\n;\nM\n/2)\nf\n(x\n,\nk\n)\n2 1\n3 1\nH\n4 2\n2\n1 g\ng\ng\nk24\n(b)\n\n(25)\n\n(b)\n\nand a similar term, Q′V , is obtained by interchanging fg (x3 , k12 ; MH /2) → fg (x3 , k22 ; MH /2) and\n(c)\n\n(c)\n\nfg (x4 , k22 ) → fg (x4 , k12 ). One finds that the integral over k2 (k1 ) in QV (Q′V ) is stabilized in the\n\ninfrared by the saturation scale, and the integral over k1 (k2 ) is stabilized by the Sudakov form-factor.\nCollecting the estimates for QR , QV and Q′V one concludes that the perturbative determination\n(c)\n\nof the amplitude of screening correction is possible provided that the gluon distribution fg (x4 , k42 )\npossesses the saturation property, i.e. the simple gluon ladder that we have used initially has to be\n(c)\n\ncorrected. In this case the momentum scale at the upper end of the screening correction, fg , is\nnot small, and our perturbative Ansatz is justified. Note that, in this context, saturation plays a\nrole quite analogous to the Sudakov form factor at the production vertex: without the Sudakov form\nfactor the momentum integral near the production vertex would not have been infrared-safe. Similarly,\nsaturation renders the nested k1 and k4 integrations infrared-safe.\n\n4\n\nNonlinear evolution of the gluon distribution\n\nIn this section we use the simplest available tool, the nonlinear Balitsky- Kovchegov (BK) equation [31,\n32, 33], in order to model the unitarity corrections for the screening Pomeron ladder in Fig. 4. This\nequation resums fan diagrams of BFKL Pomerons (Fig. 5) in the LL1/x approximation, and it has\nbeen derived, in the large Nc limit, for the case of a small probe scattering off a large nucleus. The BK\nequation generates, in a natural way, the saturation scale growing exponentially with rapidity [29, 35].\nThe equation has originally been derived for the dipole scattering amplitude, but later on it was reformulated as an explicit equation for the evolution of the unintegrated gluon distribution [48, 49],\nand in this paper we employ the latter form.\nThe hard rescattering correction amplitude in (18) was given in the momentum representation, in\norder to match the variables of the triple Pomeron vertex. In this section, however, we find it more\n13\n\n\f000000\n111111\n111111\n000000\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n\np1\n\nV3P\nV3P\nV3P\n..\n.\n\n..\n.\n\nV3P\n\n...\n\n1111\n0000\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n\n1111\n0000\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n\nH\n\n..\n.\n\nV3P\n..\n.\n\nV3P\n\n...\n\n1111\n0000\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n\n..\n.\n\nV3P\n\n0000\n1111\n1111\n0000\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n0000 1111\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n0000 1111\n1111\n\n11111\n00000\n00000\n11111\n00000\n11111\n00000\n11111\n00000\n11111\n00000\n11111\n00000\n11111\n00000\n11111\n00000\n11111\n\n1111\n0000\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n\np2\n\nFigure 5: The fan diagram approximation to the hard rescattering correction to the exclusive Higgs\nboson production.\nconvenient to do a partial Fourier transform from momentum transfer carried by the Pomerons to the\nimpact parameter variable. The impact parameter space seems to be advantageous, both in performing\nthe non-linear gluon density evolution and for evaluating of the soft gap survival factor. The correct\ntreatment of the impact parameter dependence of the scattering amplitude is difficult in the BK\nframework. In the original formulation of the BK equation, the gluons are assumed to be massless, in\naccordance with perturbative QCD; this contradicts, however, essential features of non-perturbative\nQCD dynamics leading to the confinement of colour. In particular, in the perturbative framework\none finds contributions from large dipoles which generate a power like tail of the impact parameter\nprofiles [50, 51]. Such a tail leads to a violation of the Froissart bound [52]. Therefore, the limit of large\nimpact parameters of the BK must be modified, using some phenomenological model. In practice, all\nthe applications of the BK equation to the proton structure are based on the approximation of treating\nthe evolution at fixed impact parameter [35, 48, 53, 54], i.e. the evolution proceeds independently at\neach value of impact parameter b.\nThus, our starting point is the form of BK equation proposed in Ref. [48]:\n∂fg (x, k2 )\nαs Nc 2\n=\nk\n∂ log 1/x\nπ\n− α2s\n\nZ\n\nd\n1 − k2 2\ndk\n\n\u0012\n\nk02\n\ndk′2\nk′2\n\n\u00132\n\nk2\nR2\n\n(\n\n\u0001 )\n\nfg x, k 2\nfg x, k′2 − fg x, k 2\n+\n1\n|k′2 − k2 |\n[4k′4 + k4 ] 2\n\n\"Z\n\n\u0001\n\n∞\nk2\n\ndk ′2\nlog\nk′4\n\n\u0001\n\nk′2\nk2\n\n!\n\n#2\n\nfg (x, k ′2 )\n\n,\n\n(26)\n\nwhere the assumption has been made that the distribution of gluons is uniform inside a transverse\ndisc with the radius R. The unintegrated gluon density in the impact parameter plane therefore takes\n14\n\n\fthe form:\n\nθ(R − b)\nf ̃g (x, k 2 , b) = fg (x, k2 )\n.\nπR2\n\n(27)\n\nIn (26), the factor 1/R2 in front of the non-linear term is a result of the impact parameter integration:\nZ\n\nd2 b f ̃g (x, k12 , b)f ̃g (x, k22 , b) =\n\n1\nfg (x, k12 ) fg (x, k22 ).\nπR2\n\n(28)\n\nIn our case, however, it is necessary to control the impact parameter dependence in more detail.\nTherefore we assume, at x0 = 0.01, an initial Gaussian impact parameter profile:\nexp(−b2 /R2 )\nf ̃g (x0 , k2 , b) = fg (x0 , k2 )\n,\nπR2\n\n(29)\n\nand we set the radius R ≃ 2.83 GeV−1 (R2 = 8 GeV−2 ), in accordance with the proton radius seen in\n\nthe t-dependence of the exclusive J/ψ production at HERA. The evolution equation for the density\nof the unintegrated gluon reads:\n∂ f ̃g (x, k2 , b)\nαs Nc 2\n=\nk\n∂ log 1/x\nπ\n−\n\nπα2s\n\nZ\n\nk02\n\nd\n1−k\ndk2\n\n\u0012\n\n2\n\ndk′2\nk′2\n\n\u00132\n\nk\n\n2\n\n(\n\n\u0001\n\u0001\n\u0001\nf ̃g x, k 2 , b\nf ̃g x, k′2 , b − f ̃g x, k 2 , b\n+\n1\n|k′2 − k2 |\n[4k′4 + k4 ] 2\n\n\"Z\n\n∞\n\nk2\n\ndk′2\nlog\nk′4\n\nk′2\nk2\n\n!\n\n#2\n\nf ̃g (x, k , b)\n′2\n\n)\n\n.\n\n(30)\n\nThis evolution is local in b, but due to the non-linear term, for x < x0 , the impact parameter\ndependence cannot be factorized out from the resulting unintegrated gluon density, f ̃g (x, k2 , b).\nIt is clear, however, that the BK equation (26) needs many improvements to be applicable in\nphenomenology, in particular it is essential to take into account, in some approximate manner, the\nNLL1/x corrections to the linear BFKL kernel [55, 56]. Following the path proposed in series of\npapers [57, 48, 49], we include, in the linear evolution kernel, the following improvements:\n• the consistency constraint [58, 59] that models an essential part of the NNL1/x correction to the\nBFKL kernel and realizes, approximately, also a resummation of the corrections to all orders;\n\n• the non-singular part in the x → 0 limit of the DGLAP splitting function is added;\n• the DGLAP quark density evolution is also taken into account, and the evolution equation is\ncoupled to the gluon density evolution using the DGLAP splitting functions;\n\n• the strong coupling constant is running with the scale given by gluon virtualities in the BFKL\nladder.\n\nThese modifications are consistent with the exact NLL1/x corrections to the BFKL kernel, and they\nimpose the constraints on the evolution which follow from the DGLAP formalism in the collinear limit\n[60, 61, 62]. The implementation of these corrections has been described in detail in the recent papers\n15\n\n\f[48, 49], and the final form of the equation can be found there as well. It is rather straightforward to\nadd, on top of the modifications described above, the impact parameter dependence, in a manner very\nsimilar to (30). The normalisation of the input parameterisation for the gluon and quark distributions\nat high x has been tuned to provide a good fit of the F2 data [63], and the obtained distributions\nhave been shown to give a good description of inclusive heavy quark production at HERA and at the\nTevatron [64]. A detailed description of the properties of the obtained partonic densities will be given\nin a separate paper [63].\nIn our numerical calculations of the exclusive Higgs boson production (18) we will take f ̃(c) (x, k2 , b)\nas being the solution to the collinearly improved, impact parameter dependent BK equation. Let us\nremind that the other two gluon distributions of (18), f ̃(a) (x, k2 , b) and f ̃(b) (x, k2 , b), are probed at\nrather large values of x ∼ 0.01, and non-linear effects can safely be neglected. Instead, we apply the\n\nprescriptions (7) and (8), using with the CTEQ5 parameterisation for the collinear gluon distribution\nfunctions.\n\n5\n\nSoft gap survival probability\n\nThus far, we have determined the hard component of the amplitude for exclusive Higgs boson production. The condition to leave the protons intact in the production process, however, imposes constraints\non the soft rescattering of the protons. The soft gap survival probability factor, Ŝ 2 , quantifies the\nprobability that the protons emerge from the reaction intact despite possible soft rescatterings. The\ngap survival probability can conveniently be estimated in the impact parameter representation by employing, for instance, the two-channel eikonal model [20, 21]. Therefore, we now translate the exclusive\nHiggs boson production cross section into the impact parameter representation.\nLet us start with a general discussion. We consider a scattering amplitude of an exclusive production in the impact parameter representation\nM̃ (b1 , b2 ) =\n\nZ\n\nd2 q1\n(2π)2\n\nd2 q2\nM (q 1 , q 2 ) eiq1 b1 eiq2 b2 ,\n(2π)2\n\nZ\n\n(31)\n\nwhere M (q 1 , q 2 ) is the amplitude given as a function of the transverse momenta. Then, the integrated\ncross-section\nσ=\n\n1\n16π\n\nZ\n\nd2 q1\n(2π)2\n\nZ\n\nd2 q2\n|M (q 1 , q 2 )|2 ,\n(2π)2\n\n(32)\n\n2\n\nZ\n\nd2 b2 |M̃ (b1 , b2 )|2 ,\n\n(33)\n\nd2 b |M̃ (b1 , b − b1 )|2 ,\n\n(34)\n\ncan be expressed in the following way:\n1\nσ=\n16π\nor, alternatively,\nσ=\n\n1\n16π\n\nZ\n\nZ\n\nd b1\n\nd2 b1\n\nZ\n\n16\n\n\fexp( − Ω ( b) )\n\n111111\n000000\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n\np1\n\n111111\n000000\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n\nexp (−Ω ( b) )\n\n2\n\n2\n\nH\n\np2\n\n000000\n111111\n111111\n000000\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n\nf\n\nf g (b')\n\np1\n\n(b−b')\n\nGA\n\n+\n(c)\n\n111111\n000000\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n\n(a)\n\nfg\n\n1111111111111\n0000000000000\n0000000000000\n1111111111111\n0000000000000\n1111111111111\nV 3P\n0000000000000\n1111111111111\n0000000000000\n1111111111111\n\nH\n\n(b)\ng (b')\n\n111111\n000000\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n\np2\n\nFigure 6: The exclusive pp → p H p amplitude with a hard and soft rescattering correction.\nwhere b1 and b2 are transverse positions of the production vertex measured from centres of the protons,\nand b is the impact parameter of the collision.\nIn the Two Pomeron Fusion case, the off-diagonal unintegrated gluon distributions are probed at\nmoderate values of x ∼ 0.01 and at virtualities k2 > 1 GeV2 , so one can assume the gluon density to\n\ntake a factorized form:\n\nf ̃goff (x, x′ , k2 , b; μ) = fgoff (x, x′ , k2 ; μ) S(b)\nwith\n\n(35)\n\n1 − b22\ne R ,\n(36)\nπ R2\nis the proton radius, measured in the exclusive production of J/ψ production\nS(b) =\n\nwhere R ≃ 2.83 GeV−1\n\nat HERA (cf. our discussion of the impact parameter dependent BK equation), and S(b) is normalized\nZ\n\nd2 b S(b) = 1 .\n\n(37)\n\nTherefore, the cross section for the production of the Higgs boson in the Two Pomeron Fusion approximation takes the form:\n(0)\n\ndσpp→pHp (y)\ndy\n\n1\n=\n16π\n\nZ\n\n2\n\nd b\n\nZ\n\nd2 b1 |S(b1 )S(b − b1 )M0 (y)|2 ,\n\n(38)\n\nwith M0 (y) given by (9). Including the hard rescattering correction, we arrive at the following expression:\n\ndσ (0+1) (y)pp→pHp\n1\n=\ndy\n16π\n\nZ\n\n2\n\nd b\n\nZ\n\nd2 b1 |S(b1 )S(b − b1 )M0 (y) + M̃corr (y, b, b1 )|2 ,\n\nwhere the dominant parts of both M0 (y) and M̃corr (y, b, b1 ) are imaginary, and\nIm M̃corr (y, b, b1 ) = −\n\n(\n\n9\n16π 2 (2π 3 A)\n8\n17\n\nZ\n\nxb\n\nxa\n\ndx4\nx4\n\nZ\n\nd2 k2\n2πk24\n\nZ\n\nd2 k3\n2πk34\n\nZ\n\nd2 k4\n2πk44\n\n(39)\n\n\f× [V3P ⊗ f ̃g(a) (x1 , b − b1 )](k2 , k4 ) GA (k2 , k3 ; x1 , x2 ; MH /2)\no\n\n× f ̃g(b) (x3 , k32 , b1 ; MH /2) f ̃g(c) (x4 , k42 , b1 )\n\n− {y → −y}.\n\n(40)\n\n(a)\n(b)\nThe impact parameter dependence of f ̃g and f ̃g is given by S(b) and may be factorized out, in\n\nanalogy with the case of the Two Pomeron Fusion amplitude. The impact parameter dependence\n(c)\nof f ̃g is determined by the BK evolution, and it is different from S(b). Note that, in (18), the\n(b)\n(c)\nconvolution in the momentum transfer q leads to a product of f ̃g and f ̃g , evaluated at the same\npoint, b1 , in the transverse position space.\nHaving defined M̃corr (y, b, b1 ), it is straightforward to write down the cross section for the exclusive\nproduction, taking into account the soft rescattering\n(0+1),Ω\n\ndσpp→pHp(y)\ndy\n\n=\n\n1\n16π\n\nZ\n\nd2 b\n\nZ\n\nd2 b1 |S(b1 )S(b − b1 )M0 (y) + Mcorr (y, b, b1 )|2 exp(−Ω(s, b)),\n\n(41)\n\nwhere Ω(s, b) is the opacity of the pp scattering at squared energy s and impact parameter b. In\nthis paper we adopt the opacity factor of the two channel eikonal model proposed in [20, 21]. The gap\nsurvival probability reads:\n(0+1),Ω\n\ndσpp→pHp (y)\ndy\n\nŜ 2 =\n\n(0+1)\ndσpp→pHp\n\ndy\n\n!\n\n!\n\ny=0\n\n.\n\n(42)\n\ny=0\n\nThe impact parameter profile of the rescattering correction amplitude (40) is different from the Two\nPomeron Fusion case; thus the gap survival factor will take different values in those two cases.\n\n6\n\nResults\n\nWe have performed all numerical estimates of the amplitude and of the cross section for the central\n√\nexclusive Higgs boson production, choosing y=0, assuming the LHC energy, s = 14 TeV, and taking,\nfor the Higgs boson mass, MH = 120 GeV. As we have stated before, in this paper our main goal is\na general understanding of the hard screening mechanism and an estimate of its magnitude, rather\nthan a precise determination of the cross section.\nAs a first step, we have considered the rescattering due to a single BFKL ladder. As expected, due\nto the long rapidity evolution of the BFKL amplitude this correction is large. As we have discussed\nbefore, since this single-ladder correction is highly sensitive to the infrared region, the precise numerical\nvalue of its magnitude is not reliable. From this part of our analysis, we therefore only conclude\nthat this type of hard rescattering may potentially be large and, in any realistic estimate, unitarity\ncorrections of the screening BFKL ladder have to be taken into account.\n\n18\n\n\fIn the next step of our numerical analysis, therefore, we have made use of the BK-corrected\n(c)\n\nunintegrated gluon density, fg . First, using (40), we have evaluated the hard rescattering amplitude\nas a function of the impact parameter, at fixed x4 . The contribution of momenta lower than k0 = 1 GeV\nwas assumed to vanish. The main reason for that is that the gluon densities are poorly known for\ngluon momenta lower than k0 , so is the behaviour of gluon propagators, and in that region one has\nto rely on uncertain extrapolations. On the other hand, with the integrand of (18) being positive,\nthe application of the cut-off leads to a conservative estimate of the correction term. Still, the main\ncontribution to the correction amplitude comes from the range of momenta around the saturation\nscale Qs (x4 ).\nRecall that, for the four-point gluon Green's function which connects the Higgs vertex with the\ntriple Pomeron vertex, we consider two different scenarios – the simple two gluon exchange (16) and\nthe BFKL Green's function in the diffusion approximation (17). The strong coupling constant was\nfixed at αs = 0.15, both in the Green's function and in the triple Pomeron vertex. Such a choice is\nsuitable for the LL BFKL Green's function, as the small αs reduces both the Pomeron intercept and\nthe diffusion coefficient, in line with the NLO corrections to the BFKL evolution. This value of αs\nseems, however, to be too small for the triple Pomeron vertex: thus the estimate of the correction is\nconservative. Therefore, in the vertex, we shall consider also values of αs other than our default choice\nof αs = 0.15, while in the BFKL Green's function we always keep αs = 0.15.\nIn Fig. 7 we present the total hard rescattering correction to the amplitude in the form of the ratio\nRy (y1 ) =\n\n\"\n\n|dM̃corr (y, b, b1 )/dy1 |\n|M̃0 (y, b, b1 )|\n\n#\n\n,\n\n(43)\n\nb=b1 =0, y=0\n\nwith the impact parameter dependent Two Pomeron Fusion amplitude being given by (cf. (9) and\n(38))\nM̃0 (y, b, b1 ) = M0 (y) S(b − b1 )S(b1 ).\n\n(44)\n\nHere M0 (y) has also been evaluated with the infrared cut-off k0 = 1 GeV, and the off-diagonal\nunintegrated gluon distributions have been obtained from the CTEQ5 collinear gluon distribution.\nNote that we plotted the ratio as a function of the rapidity related variable, y1 = log(1/x1 ), instead\nof the less convenient variable x4 (the relation between these variables is given by (19)). The variable\ny1 has the meaning of a rapidity distance of the triple Pomeron vertex from the projectile proton, and\n2 ∼ k 2 exp(y ).\nit is related to the invariant mass of the rescattering intermediate state by MX\n1\n0\n\nIn Fig. 7 we compare the results, obtained with the two choices of Green's function and with the\ntwo values αs = 0.15 and αs = 0.25. The relative sign of the correction term is negative. From this\nfigure we draw the following conclusions:\n• The hard rescattering correction is the highest for the highest mass of the diffractive intermediate\n\nstate. This is due to the strong suppression of the gluon density in the proton at large values\n19\n\n\fRy\n1\n0.8\n\nα S = 0.25\n\n0.6\n0.4\nα S = 0.15\n\n0.2\n0\n2\n\n2.5\n\n3\n\n3.5\n\n4\n\n4.5\n\nY1\n\nFigure 7: The ratio Ry (y1 ) (see (43)) of the hard rescattering correction to the Two Pomeron Fusion\nterm at b = 0, as a function of the rapidity distance, y1 , of the Triple Pomeron Vertex from the\n√\nprojectile protons, for αs = 0.15 and αs = 0.25 at s = 14 TeV. The black line belongs to\nthe Green's function, GA = GBFKL , the dashed line to the approximation of two elementary gluons,\nGA = G0 .\nof the gluon x. We interpret this as an indication that the contribution of the hard rescattering\ncorrection is clearly separated from the soft rescattering contributions of the two-channel eikonal\nmodel [20, 21] which incorporates only the low mass diffractive intermediate states.\n• There is no significant difference between the BFKL Green's function and the exchange of two\n\nelementary gluons. The main reason is that the BFKL evolution length is short for larger values\nof y1 , which give the dominant part of the corrections. The relative BFKL effects are more\n\npronounced for small y1 , but this region provides only a small contribution.\n• The relative magnitude of the correction is quite significant for αs = 0.15, and for αs = 0.25 the\n\ncorrection even exceeds the Two Pomeron Fusion amplitude. The interpretation of this striking\nresult will be discussed in the next section.\n\nIn Fig. 8, results are shown for the impact parameter dependent correction amplitude, integrated\nover y1 , as a function of the transverse distance, b1 , of the Higgs boson production vertex from the\ncenter of the target proton:\nRb (b1 ) =\n\n\"\n\n|M̃corr (y, b, b1 )|\n|M̃0 (y, b, b1 )|\n20\n\n#\n\ny=0, b=0\n\n.\n\n(45)\n\n\fRb\n1.75\n1.5\n\nα s = 0.25\n\n1.25\n1\n\nα s = 0.15\n\n0.75\n0.5\n0.25\n0\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6 b1\n\nFigure 8: The ratio Rb (b1 ) (see (45)) of the hard rescattering correction to the Two Pomeron Fusion\nterm at b = 0, as a function of the transverse distance, b1 of the Triple Pomeron Vertex from the\n√\ncentre of the target proton, for the two values αs = 0.15 and αs = 0.25 at s = 14 TeV. We only\nshow the results for the BFKL Green's function.\nHere we have set b = 0, but, in fact, in the ratio the impact parameter dependence coming from\nthe form factor of the projectile proton drops out, and any value of b can be taken. In Fig. 8 only\nthe results obtained with the BFKL Green's function are displayed. There is not much difference\nbetween the BFKL Green's function and the two gluon approximation. One sees in the figure that\nthe ratio of the absorptive correction profile, M̃corr (y, b = 0, b1 ), to the Two Pomeron Fusion profile,\nM̃0 (y, b = 0, b1 ), decreases with increasing distance, b1 , from the proton center. Thus, the correction\nterm tends to suppress the Higgs production inside the target proton. It is also clearly visible that the\ncorrection is large for both choices of αs .\nPerforming, in (41), the integrations over the transverse positions, b1 and b, leads to the differential\n(0+1),Ω\n\ncross section of the exclusive Higgs boson production, dσpp→pHp(y) / dy which takes into account both\nthe soft and the hard rescattering corrections. The results of this calculation, for various values of αs\nin the triple Pomeron coupling, are collected in Tab. 1. At αs ≃ 0.2 the absolute value of the hard\n\nrescattering correction exceeds the Two Pomeron Fusion term, and this explains why, at this value of\nαs , the corrected cross section takes its smallest value. For all values of αs that we have considered\n\nthe cross section with the hard rescattering correction is smaller than the Two Pomeron Fusion cross\nsection by factor larger than 2.5. Let us repeat that, by varying αs , we want to illustrate the sensitivity\nof the result to the size of the triple Pomeron coupling. Further discussion will be given in the next\nsection.\n21\n\n\fdσTPF /dy\n\ndσ/dy (αs = 0.15)\n\ndσ/dy (0.17)\n\ndσ/dy (0.2)\n\ndσ/dy (0.22)\n\ndσ/dy (0.25)\n\n0.4\n\n0.16\n\n0.12\n\n0.042\n\n0.08\n\n0.14\n\nTable 1: The differential cross section\n\n\u0010\n\n\u0011\n\ndσpp→pHp\ndy\ny=0\n\n(in fb), obtained from the Two Pomeron Fusion\n\namplitude, and corrected by the hard rescattering and by the soft gap survival probability factor, for\n√\nvarious values of αs at s = 14 T eV .\n\nŜ 2 (TPF)\n\nŜ 2 (αs = 0.15)\n\nŜ 2 (0.17)\n\nŜ 2 (0.2)\n\nŜ 2 (0.22)\n\nŜ 2 (0.25)\n\n0.024\n\n0.037\n\n0.061\n\n0.051\n\n0.035\n\n0.016\n\nTable 2: The soft gap survival probability factor, Ŝ 2 , for the Two Pomeron Fusion amplitude, corrected\n√\nby the hard rescattering, for different values of αs at s = 14 T eV .\n\nNumerical values of the survival probability, based on (42), are given in Tab. 2 for different values\nof αs . The variation of Ŝ 2 with αs is a result of the modification, due to the correction term, of the\nshape in impact parameter b of the hard amplitude.\nThe definition of the survival probability, (42), which we used is different from the definition of\nŜ 2\n\nin [5]–[11], [20, 21]. In the case when we consider only the Two Pomeron Fusion term and the\n\nGaussian form of the form factors, the definitions of Ŝ 2 in (42) and in Ref. [20] lead to the same\nnumerical result. In the case of a general shape of the form-factors, however, we find it necessary to\nuse the general formula for the soft gap survival factor of (40), (41) and (42).\n\n7\n\nDiscussion and future strategies\n\nThe hard rescattering correction to the Two Pomeron Fusion amplitude, even after including unitarization of the single BFKL exchange, was found to be large. In particular, for a more realistic\nchoice of the strong coupling constant, αs = 0.25, in the triple Pomeron vertex, the correction exceeds\nsignificantly the Two Pomeron Fusion term. As a consequence, we have to conclude that we have\n22\n\n\ffound another potential source of a significant suppression of the exclusive Higgs boson production at\nthe LHC.\nAs we have said before, we cannot consider our results as representing a reliable numerical final\nanswer. In our calculation we have considered only a sub-class of the screening corrections which –\nin a BFKL-based description of diffractive Higgs production – should be included, and in evaluating\nthese diagrams, we have made severe approximations. In this paper, we have restricted ourselves to\nPomeron fan diagram configurations in the exchanged screening system which lead to the BalitskyKovchegov evolution of the gluon density. Such a choice is a natural starting point for an estimate of the\namplitude beyond the Two Pomeron Fusion contribution, but it does not exhaust the full correction,\nand, in future steps, more complex topologies of the interacting Pomerons have to be considered.\nMoreover, we have approximated the BK evolution kernel to be local in the impact parameter plane.\nIn momentum space, this amounts to restricting all Pomerons to carry zero momentum transfer: such\nan approximation can be justified for the scattering on a sufficiently large nucleus; in the case of the\nproton, however, it looks somewhat questionable. Finally, we neglected the contribution from low\nmass excitations of the target proton in the intermediate state, which somewhat reduces the estimated\nmagnitude of the rescattering correction.\nReturning to the selection of diagrams, in our previous choice of contributions one recognizes\na strong asymmetry between projectile and target protons, and it is obvious that a whole class of\ncontributions is missing. In physical terms, the Pomerons that give rise to the BK fan diagrams\npropagate in the colour field of the projectile proton and should be screened, too (examples are shown\nin Fig. 9). It is expected that these new corrections will continue to come with alternating signs, i.e.\nthe first screening correction of the screening Pomeron enters the amplitude with the positive sign\netc. Subsequent iterations of this kind lead to a whole tower of corrections. For the total cross-section\nof nucleus-nucleus collisions an effective theory of interacting BFKL Pomerons [41, 42, 43], beyond\nthe fan diagram approximation, has been formulated. Imposing a semiclassical approximation that\nresums Pomeron diagrams exemplified in Fig. 9a, and restricting all Pomerons to have zero momentum\ntransfer, numerical solutions have been found.\nAll these corrections can be derived from an effective action for interacting Pomerons of Refs. [41,\n42, 43]. Thus, a natural continuation of the present study could be an analysis of the hard rescattering in this framework. At present an evaluation of the interacting Pomeron diagrams of the type\nexemplified in Fig. 9a, analogous to the treatment of nucleus-nucleus scattering, might be realistic,\nwhereas the diagrams with closed Pomeron loops (see Fig. 9b) are, to our understanding, still beyond\nreach. Nevertheless, a careful treatment of the effective interacting BFKL Pomeron field theory in\nthe semi-classical limit should be capable to provide a more reliable estimate of the absorption of the\nhard gluonic ladders than the one performed in the present paper.\nAn important point in our analysis is the role of the saturation scale. Up to now, the analysis\nof diffractive Higgs production had been based upon a rather strict separation between hard and\n23\n\n\fa)\n\nb)\n\n0000\n1111\n1111\n0000\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n\n000\n111\n111\n000\n000\n111\n000\n111\n000\n111\n000\n111\n000\n111\n\np1\n\nV3P\n\n0000\n1111\n1111\n0000\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n\n0000\n1111\n1111\n0000\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n\n111\n000\n000\n111\n000\n111\n000\n111\n000\n111\n000\n111\n\np1\n\nV3P\n\nV3P\nV3P\nH\n\nV3P\n\nV3P\n\nH\n\nV3P\n\nV3P\nV3P\n1111\n0000\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n\n1111\n0000\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n\n00000\n11111\n11111\n00000\n00000\n11111\n00000\n11111\n00000\n11111\n00000\n11111\n00000\n11111\n00000\n11111\n00000\n11111\n\np2\n0000\n1111\n1111\n0000\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n\n0000\n1111\n1111\n0000\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n\n000000\n111111\n111111\n000000\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n000000\n111111\n\np2\n\nFigure 9: Examples of diagrams of interacting BFKL Pomeron field theory that contribute to the\nexclusive Higgs boson production: a) a diagram, without closed Pomeron loops, belonging to the class\nof diagrams that were studied in Refs. [41, 42, 43] in the case of nucleus-nucleus scattering; b) a\ndiagram with a closed Pomeron loop.\nsoft contributions: the hard Two Pomeron Fusion amplitude and the soft rescattering, encoded in\nthe survival probability factors. In the first part of our hard rescattering analysis, where a single\nBFKL Pomeron had been considered, we found a strong sensitivity to the infrared scale k0 which, at\nfirst sight, seemed to invalidate the BFKL Ansatz for the rescattering. However, the existence of a\nsaturation scale, which for x values being as small as x ≈ 10−6 lies above the infrared region, removes\n\nthis dominance of the small-momentum region and hence supports our perturbative approach. In\nother words, for the production of a Higgs boson which, at the production vertex, provides the large\nmomentum scale of MH , the perturbative nature of the scattering amplitude seems not be limited\nto the production vertex but seems to 'spread out' further away into the rescattering part of the\namplitude.\n\n8\n\nSummary\n\nIn this paper we have investigated hard rescattering corrections to the exclusive Higgs boson production\nat the LHC. In a first step, the absorptive correction was given by the exchange of a single BFKL\nladder which couples to the hard gluonic ladder through the triple Pomeron vertex. This amplitude\nhas turned out to be strongly sensitive to the infrared region. In our main part, we then have replaced\nthe single BFKL ladder by a Balitsky-Kovchegov gluon density. Due to emergence of a saturation\nscale in the perturbative domain, the infrared behavior stabilizes. We have found that the dominant\ncontribution to the hard rescattering correction comes high mass diffractive excitations of the the\nprojectile proton, indicating a clear separation of this contribution from that of low mass intermediate\nstates of the standard soft rescattering.\n24\n\n\fThe correction was found to be negative, with the absolute value being close or even exceeding the\nleading Two Pomeron Fusion contribution. This implies that the effect is significant. However, a more\nprecise estimate of the cross sections is not possible until yet more screening corrections are evaluated\nand certain approximation can be lifted. Nevertheless, our results seem to question the simple picture\nof the pp → p H p process, being described by two hard gluonic ladders that fuse into the Higgs\n\nboson and leaving space only to a soft rescattering of the protons. We have also discussed possibilities\nof improving, within the framework of the interacting BFKL Pomeron field theory, the description of\nthe exclusive Higgs production cross section.\nIn order to arrive at a numerical estimate of the exclusive Higgs boson production cross section at\nthe LHC, we have calculated the soft gap survival probability for the scattering amplitude containing\nboth the Two Pomeron Fusion term and the rescattering correction. For this we have used the\ndependence of the amplitude on the transverse position; due to the different shapes of the Two\nPomeron Fusion term and of the correction, the gap survival factors were found to depend on the\nstrength of the triple Pomeron coupling.\nIn our final numerical estimate of the exclusive Higgs boson production cross section we found\nthat the cross section may be smaller, and its theoretical uncertainty may be larger than previously\nexpected.\nThe method developed in this paper may be also applied to other exclusive diffractive production\nprocesses in pp or pp̄ collisions at the Tevatron or at the LHC. As examples, let us mention the exclusive\nproduction of di-jets or the exclusive production of heavy scalar mesons in the central region. We also\nview the results of this paper as a step towards developing a better understanding of the effective field\ntheory of interacting BFKL Pomerons and of its applications to high energy pp and pp̄ collisions.\n\nAcknowledgments\nWe thank Markus Diehl, Jeff Forshaw, Valery Khoze and Misha Ryskin for useful discussions. S.B.\nthanks the Minerva foundation for a fellowship, K.K. is supported by the Graduiertenkolleg Zukünftige\nEntwicklungen in der Teilchenphysik. L.M. gratefully acknowledges the support of the grant of the\nPolish State Committee for Scientific Research No. 1 P03B 028 28.\n\nReferences\n[1] S. Eidelman et al. [Particle Data Group], Phys. Lett. B 592 (2004) 1.\n[2] A. Schafer, O. Nachtmann and R. Schopf, Phys. Lett. B B249 (1990) 331.\n\n25\n\n\f[3] A. Bialas and P. V. Landshoff, Phys. Lett. B 256, 540 (1991).\n[4] J. R. Cudell and O. F. Hernandez, Nucl. Phys. B 471 (1996) 471.\n[5] V. A. Khoze, A. D. Martin and M. G. Ryskin, Phys. Lett. B 401 (1997) 330.\n[6] V. A. Khoze, A. D. Martin and M. G. Ryskin, Eur. Phys. J. C14 (2000) 525.\n[7] V. A. Khoze, A. D. Martin and M. G. Ryskin, Eur. Phys. J. C24 (2002) 581.\n[8] A. De Roeck, V. A. Khoze, A. D. Martin, R. Orava and M. G. Ryskin, Eur. Phys. J. C C25\n(2002) 391.\n[9] V. A. Khoze, A. D. Martin and M. G. Ryskin, Eur. Phys. J. C 26 (2002) 229.\n[10] A. B. Kaidalov, V. A. Khoze, A. D. Martin and M. G. Ryskin, Eur. Phys. J. C 31 (2003) 387.\n[11] A. B. Kaidalov, V. A. Khoze, A. D. Martin and M. G. Ryskin, Eur. Phys. J. C 33 (2004) 261.\n[12] D. Kharzeev and E. Levin, Phys. Rev. D 63 (2001) 073004.\n[13] M. Boonekamp, R. Peschanski and C. Royon, Phys. Rev. Lett. 87 (2001) 251806; Nucl. Phys. B\n669 (2003) 277 [Erratum-ibid. B 676 (2004) 493]; Phys. Lett. B 598 (2004) 243.\n[14] R. Enberg, G. Ingelman, A. Kissavos and N. Timneanu, Phys. Rev. Lett. 89 (2002) 081801;\nR. Enberg, G. Ingelman and N. Timneanu, Phys. Rev. D 67 (2003) 011301.\n[15] A. Bzdak, Phys. Lett. B 615 (2005) 240.\n[16] V. A. Khoze, A. D. Martin and M. G. Ryskin, Eur. Phys. J. C23 (2002) 311.\n[17] V. A. Khoze, A. D. Martin and M. G. Ryskin, Eur. Phys. J. C 34 (2004) 327.\n[18] K. Belotsky, V. A. Khoze, A. D. Martin and M. G. Ryskin, Eur. Phys. J. C 36 (2004) 503.\n[19] E. Gotsman, E. Levin and U. Maor, Phys. Rev. D 60 (1999) 094011.\n[20] V. A. Khoze, A. D. Martin and M. G. Ryskin, Eur. Phys. J. C 18 (2000) 167.\n[21] A. B. Kaidalov, V. A. Khoze, A. D. Martin and M. G. Ryskin, Eur. Phys. J. C21 (2001) 521.\n[22] S. Bondarenko and E. Levin, arXiv:hep-ph/0511124.\n[23] L. N. Lipatov, Sov. J. Nucl. Phys. 23 (1976) 338 [Yad. Fiz. 23 (1976) 642].\n[24] E. A. Kuraev, L. N. Lipatov and V. S. Fadin, Sov. Phys. JETP 45 (1977) 199 [Zh. Eksp. Teor.\nFiz. 72 (1977) 377].\n\n26\n\n\f[25] I. I. Balitsky and L. N. Lipatov, Sov. J. Nucl. Phys. 28 (1978) 822 [Yad. Fiz. 28 (1978) 1597].\n[26] L. N. Lipatov, Phys. Rept. 286 (1997) 131.\n[27] J. Bartels Z. Phys. C 60 (1993) 471.\n[28] J. Bartels, M. Wüsthoff, Z. Phys. C 66 (1995) 157.\n[29] M. A. Braun Eur. Phys. J. C 6 (1999) 321.\n[30] J. Bartels, M. G. Ryskin and G. P. Vacca, Eur. Phys. J. C 27 (2003) 101.\n[31] I. Balitsky, Nucl. Phys. B 463 (1996) 99.\n[32] Y. V. Kovchegov, Phys. Rev. D 60 (1999) 034008.\n[33] Y. V. Kovchegov, Phys. Rev. D 61 (2000) 074018.\n[34] N. Armesto and M. A. Braun, Eur. Phys. J. C 20 (2001) 517.\n[35] K. Golec-Biernat, L. Motyka and A. M. Staśto, Phys. Rev. D 65 (2002) 074037.\n[36] K. Golec-Biernat and M. Wusthoff, Phys. Rev. D 59 (1999) 014017.\n[37] K. Golec-Biernat and M. Wusthoff, Phys. Rev. D 60 (1999) 114023.\n[38] S. Munier and R. Peschanski, Phys. Rev. Lett. 91 (2003) 232001.\n[39] S. Munier and R. Peschanski, Phys. Rev. D 69, 034008 (2004).\n[40] S. Munier and R. Peschanski, Phys. Rev. D 70, 077503 (2004).\n[41] M. A. Braun, Phys. Lett. B 483 (2000) 115.\n[42] M. A. Braun, Eur. Phys. J. C 33 (2004) 113.\n[43] M. A. Braun, Phys. Lett. B 632 (2006) 297; hep-ph/0504002.\n[44] A. G. Shuvaev, K. J. Golec-Biernat, A. D. Martin and M. G. Ryskin, Phys. Rev. D 60 (1999)\n014015.\n[45] M. Kimber, A. D. Martin and M. G. Ryskin, Eur. Phys. J. C 12 (2000) 655.\n[46] M. Kimber, A. D. Martin and M. G. Ryskin, Phys. Rev. D 63 (2001) 114027.\n[47] Y. L. Dokshitzer, D. Diakonov and S. I. Troian, Phys. Rept. 58 (1980) 269.\n[48] K. Kutak and J. Kwieciński, Eur. Phys. J. C 29, 521 (2003).\n\n27\n\n\f[49] K. Kutak and A. M. Staśto, Eur. Phys. J. C 41, 343 (2005).\n[50] A. Kovner and U. A. Wiedemann, Phys. Rev. D 66 (2002) 051502.\n[51] K. Golec-Biernat and A. M. Staśto, Nucl. Phys. B 668 (2003) 345 [arXiv:hep-ph/0306279].\n[52] A. Kovner and U. A. Wiedemann, Phys. Lett. B 551 (2003) 311.\n[53] E. Gotsman, E. Levin, M. Lublinsky and U. Maor, Eur. Phys. J. C 27 (2003) 411.\n[54] E. Iancu, K. Itakura and S. Munier, Phys. Lett. B 590 (2004) 199.\n[55] V. S. Fadin and L. N. Lipatov, Phys. Lett. B 429 (1998) 127.\n[56] M. Ciafaloni and G. Camici, Phys. Lett. B 430 (1998) 349.\n[57] J. Kwieciński, A. D. Martin and A. M. Staśto, Phys. Rev. D 56, 3991 (1997).\n[58] B. Andersson, G. Gustafson and J. Samuelsson, Nucl. Phys. B 467 (1996) 443.\n[59] J. Kwieciński, A. D. Martin and P. J. Sutton, Z. Phys. C 71 (1996) 585.\n[60] G. P. Salam, JHEP 9807 (1998) 019.\n[61] M. Ciafaloni and D. Colferai, Phys. Lett. B 452 (1999) 372.\n[62] M. Ciafaloni, D. Colferai and G. P. Salam, Phys. Rev. D 60 (1999) 114036.\n[63] K. Kutak and L. Motyka, in preparation.\n[64] H. Jung, K. Kutak, L. Motyka and K. Peters, in the Proceedings of the HERA–LHC Workshop,\nhep-ph/0601013, p. 369.\n\n28\n\n\f"}