{"id": "http://arxiv.org/abs/hep-ph/0104268v1", "guidislink": true, "updated": "2001-04-25T14:16:35Z", "updated_parsed": [2001, 4, 25, 14, 16, 35, 2, 115, 0], "published": "2001-04-25T14:16:35Z", "published_parsed": [2001, 4, 25, 14, 16, 35, 2, 115, 0], "title": "Higgs: KeV precision and CP violation", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0104234%2Chep-ph%2F0104192%2Chep-ph%2F0104006%2Chep-ph%2F0104313%2Chep-ph%2F0104149%2Chep-ph%2F0104121%2Chep-ph%2F0104216%2Chep-ph%2F0104283%2Chep-ph%2F0104133%2Chep-ph%2F0104071%2Chep-ph%2F0104278%2Chep-ph%2F0104022%2Chep-ph%2F0104226%2Chep-ph%2F0104166%2Chep-ph%2F0104222%2Chep-ph%2F0104157%2Chep-ph%2F0104263%2Chep-ph%2F0104312%2Chep-ph%2F0104008%2Chep-ph%2F0104259%2Chep-ph%2F0104294%2Chep-ph%2F0104182%2Chep-ph%2F0104311%2Chep-ph%2F0104013%2Chep-ph%2F0104080%2Chep-ph%2F0104002%2Chep-ph%2F0104308%2Chep-ph%2F0104066%2Chep-ph%2F0104250%2Chep-ph%2F0104120%2Chep-ph%2F0104049%2Chep-ph%2F0104164%2Chep-ph%2F0104302%2Chep-ph%2F0104305%2Chep-ph%2F0104194%2Chep-ph%2F0104003%2Chep-ph%2F0104268%2Chep-ph%2F0104151%2Chep-ph%2F0104054%2Chep-ph%2F0104019%2Chep-ph%2F0104034%2Chep-ph%2F0104118%2Chep-ph%2F0104155%2Chep-ph%2F0104266%2Chep-ph%2F0104037%2Chep-ph%2F0104033%2Chep-ph%2F0104189%2Chep-ph%2F0104094%2Chep-ph%2F0104069%2Chep-ph%2F0104299%2Chep-ph%2F0104055%2Chep-ph%2F0104285%2Chep-ph%2F0104265%2Chep-ph%2F0104064%2Chep-ph%2F0104287%2Chep-ph%2F0104296%2Chep-ph%2F0104295%2Chep-ph%2F0104297%2Chep-ph%2F0104199%2Chep-ph%2F0104109%2Chep-ph%2F0104068%2Chep-ph%2F0104097%2Chep-ph%2F0104148%2Chep-ph%2F0104231%2Chep-ph%2F0104274%2Chep-ph%2F0104221%2Chep-ph%2F0104023%2Chep-ph%2F0104291%2Chep-ph%2F0104053%2Chep-ph%2F0104107%2Chep-ph%2F0104046%2Chep-ph%2F0104163%2Chep-ph%2F0104249%2Chep-ph%2F0104127%2Chep-ph%2F0104317%2Chep-ph%2F0104010%2Chep-ph%2F0104079%2Chep-ph%2F0104105%2Chep-ph%2F0104092%2Chep-ph%2F0104301%2Chep-ph%2F0104093%2Chep-ph%2F0104212%2Chep-ph%2F0104193%2Chep-ph%2F0104117%2Chep-ph%2F0104142%2Chep-ph%2F0104082%2Chep-ph%2F0104014%2Chep-ph%2F0104267%2Chep-ph%2F0104260%2Chep-ph%2F0104137%2Chep-ph%2F0104128%2Chep-ph%2F0104051%2Chep-ph%2F0104140%2Chep-ph%2F0104088%2Chep-ph%2F0104203%2Chep-ph%2F0104178%2Chep-ph%2F0104315%2Chep-ph%2F0104005%2Chep-ph%2F0104145%2Chep-ph%2F0104029%2Chep-ph%2F0104038&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Higgs: KeV precision and CP violation"}, "summary": "The prospects for a muon collider operated as a Higgs factory are reviewed.\nThe large muon mass means that the s-channel Higgs production mechanism is\navailable, and simultaneously suppresses bremsstrahlung so that the beam energy\nspread can be kept to the MeV level required to exploit this. Thus this is the\nonly machine which can make a direct scan over the Higgs resonance, and make an\nextraordinary mass measurement. Further possibilities such as a scan of the H\nand A of supersymmetry and CP violation are also mentioned.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0104234%2Chep-ph%2F0104192%2Chep-ph%2F0104006%2Chep-ph%2F0104313%2Chep-ph%2F0104149%2Chep-ph%2F0104121%2Chep-ph%2F0104216%2Chep-ph%2F0104283%2Chep-ph%2F0104133%2Chep-ph%2F0104071%2Chep-ph%2F0104278%2Chep-ph%2F0104022%2Chep-ph%2F0104226%2Chep-ph%2F0104166%2Chep-ph%2F0104222%2Chep-ph%2F0104157%2Chep-ph%2F0104263%2Chep-ph%2F0104312%2Chep-ph%2F0104008%2Chep-ph%2F0104259%2Chep-ph%2F0104294%2Chep-ph%2F0104182%2Chep-ph%2F0104311%2Chep-ph%2F0104013%2Chep-ph%2F0104080%2Chep-ph%2F0104002%2Chep-ph%2F0104308%2Chep-ph%2F0104066%2Chep-ph%2F0104250%2Chep-ph%2F0104120%2Chep-ph%2F0104049%2Chep-ph%2F0104164%2Chep-ph%2F0104302%2Chep-ph%2F0104305%2Chep-ph%2F0104194%2Chep-ph%2F0104003%2Chep-ph%2F0104268%2Chep-ph%2F0104151%2Chep-ph%2F0104054%2Chep-ph%2F0104019%2Chep-ph%2F0104034%2Chep-ph%2F0104118%2Chep-ph%2F0104155%2Chep-ph%2F0104266%2Chep-ph%2F0104037%2Chep-ph%2F0104033%2Chep-ph%2F0104189%2Chep-ph%2F0104094%2Chep-ph%2F0104069%2Chep-ph%2F0104299%2Chep-ph%2F0104055%2Chep-ph%2F0104285%2Chep-ph%2F0104265%2Chep-ph%2F0104064%2Chep-ph%2F0104287%2Chep-ph%2F0104296%2Chep-ph%2F0104295%2Chep-ph%2F0104297%2Chep-ph%2F0104199%2Chep-ph%2F0104109%2Chep-ph%2F0104068%2Chep-ph%2F0104097%2Chep-ph%2F0104148%2Chep-ph%2F0104231%2Chep-ph%2F0104274%2Chep-ph%2F0104221%2Chep-ph%2F0104023%2Chep-ph%2F0104291%2Chep-ph%2F0104053%2Chep-ph%2F0104107%2Chep-ph%2F0104046%2Chep-ph%2F0104163%2Chep-ph%2F0104249%2Chep-ph%2F0104127%2Chep-ph%2F0104317%2Chep-ph%2F0104010%2Chep-ph%2F0104079%2Chep-ph%2F0104105%2Chep-ph%2F0104092%2Chep-ph%2F0104301%2Chep-ph%2F0104093%2Chep-ph%2F0104212%2Chep-ph%2F0104193%2Chep-ph%2F0104117%2Chep-ph%2F0104142%2Chep-ph%2F0104082%2Chep-ph%2F0104014%2Chep-ph%2F0104267%2Chep-ph%2F0104260%2Chep-ph%2F0104137%2Chep-ph%2F0104128%2Chep-ph%2F0104051%2Chep-ph%2F0104140%2Chep-ph%2F0104088%2Chep-ph%2F0104203%2Chep-ph%2F0104178%2Chep-ph%2F0104315%2Chep-ph%2F0104005%2Chep-ph%2F0104145%2Chep-ph%2F0104029%2Chep-ph%2F0104038&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The prospects for a muon collider operated as a Higgs factory are reviewed.\nThe large muon mass means that the s-channel Higgs production mechanism is\navailable, and simultaneously suppresses bremsstrahlung so that the beam energy\nspread can be kept to the MeV level required to exploit this. Thus this is the\nonly machine which can make a direct scan over the Higgs resonance, and make an\nextraordinary mass measurement. Further possibilities such as a scan of the H\nand A of supersymmetry and CP violation are also mentioned."}, "authors": ["W. J. Murray"], "author_detail": {"name": "W. J. Murray"}, "author": "W. J. Murray", "arxiv_comment": "Proceedings of Moriond EW, 10-17th March 2001", "links": [{"href": "http://arxiv.org/abs/hep-ph/0104268v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-ph/0104268v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-ph/0104268v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-ph/0104268v1", "journal_reference": null, "doi": null, "fulltext": "arXiv:hep-ph/0104268v1 25 Apr 2001\n\nHiggs: KeV precision and CP violation\nW.J. Murray\nRutherford Appleton Laboratory, Chilton, Didcot, Oxon. OX11 0QX, UK\n\nThe prospects for a muon collider operated as a Higgs factory are reviewed. The large muon\nmass means that the s-channel Higgs production mechanism is available, and simultaneously\nsuppresses bremsstrahlung so that the beam energy spread can be kept to the MeV level\nrequired to exploit this. Thus this is the only machine which can make a direct scan over the\nHiggs resonance, and make an extraordinary mass measurement. Further possibilities such as\na scan of the H and A of supersymmetry and CP violation are also mentioned.\n\n1\n\nReminder of muon colliders\n\nThe muon collider1,2 is the only way of pushing the energy frontier beyond the region of applicability of electron colliders, while retaining the advantages of a point-like projectile. The mass\nis 200 times that of an electron, so storage rings behave like those of proton machines while a\nbeam energy spread as low at 10−5 may be possible, which means that narrow resonances can\nbe scanned. The lack of beamstrahlung means that thresholds are clean, and the energy can be\nmeasured to 10−6 via g-2.\nThis measurement of the Higgs mass benefits from the coupling ghμμ , which gives a crosssection for s-channel production 40,000 times the electron equivalent. This allows a direct scan,\ngiving the mass and width. This possibility depends upon a Higgs below the W threshold, so\nit is encouraging that EW fits3 and direct observation4 appear to favour this. Indeed one study2\nfound 115 GeV as the optimal Higgs mass for a muon collider.\nThe disadvantage of a muon collider is of course the muon lifetime of 2.2 μs, which means\nthat muon production and cooling has to be performed on a similar time-scale. Furthermore\nthe electrons from the muon decay will constitute a serious detector background. Both these\ndifficulties mean that we wish to maximize the luminosity per amp of muon current, which\nimplies cooling the beams as much as possible.\n\n\fThe decay of a high energy muon beam provides an ideal source of neutrinos for the study\nof the neutrino mixing. Such a project is simpler than a muon collider, particularly with regard\nto cooling, and it will therefore probably be built first. Its construction will bring advances in\nthe techniques required for the collider, and it will both serve as an important proof of principle\nand probably be directly used in the collider construction.\n2\n\nOverview of the accelerator components\nProton Linac\n2 linacs\nBuncher/\nAccel.\n\nLinac\nto 2GeV\n\nπ to μ\nTarget\n\nCooling\n\nHiggs\nRing\n\nRecirc Linac\n20 to 50GeV\nRecirc Linac\n2 to 20GeV\n\nFigure 1: The conceptual layout of a muon collider complex.\n\nFigure 1 shows the essential components of a muon collider. A proton source provides power\nin the megawatt range on a target, which is optimized for pion production. The pions are\nallowed to decay to muons, which are then rapidly cooled with ionization cooling. They are\nthen accelerated to the required energy, probably in a recirculating linear accelerator and fed\ninto a collider ring. The whole procedure will repeated many times per second.\n2.1\n\nProton driver\n\nThe proton source must provide a large amount of power, of the order of four megawatts at\nan energy large enough to produce pions copiously. The exact energy of the beam is under\ndiscussion, with possibilities ranging from 2.2 GeV to 24 GeV, and the HARP experiment5 at\nCERN is measuring pion production and will be important in making this choice. The pulse\nlength must be order 1 ns or so, in order to reduce the phase space of the outgoing muons, but\nthere is no advantage in reducing it below this, because the time jitter introduced by the π to\nμ decay is of the same order.\nThe proton driver can either be a linac or a rapid cycling synchrotron. The CERN proposal\nfor a Superconducting Proton Linac6 is the best example of the former. This accelerator would\nre-use the LEP superconducting cavities, supplemented by new cavities designed to work with\nlower velocity particles. It could in principle deliver even more than 4 MW, but the energy is\nlimited to 2.2GeV. Furthermore it needs bunching and compression if the small time structure\nis to be achieved.\nA synchrotron solution would be able to operate at higher beam energy, and this has the\nadvantage that less protons are required, and the phase space density requirements are easier.\nThus it may be more suitable for delivering a few high intensity muon pulses which are required\nfor a collider, rather than many small ones which might be satisfactory for a muon neutrino\nsource.\n2.2\n\nTarget and pion collection\n\nTo optimize the muon rate, it is important to collect as large a fraction of the pions produced\nas possible. The peak kinetic energy is rather low, or order of the pion mass, independent of\nthe beam power, because most pions are produced through secondary interactions. Such pions\n\n\fFigure 2: Cartoon of the pion target design. See text for details.\n\ncannot penetrate much material. However, it is important to use a large fraction of the energy\nin the proton beam, and this requires a thick target. The solution is to use a rod-shaped target,\nso that pions with any significant PT are emitted from the sides of the target. A radius around\n5mm seems to be optimal for a fairly dense target.\nThe target is either inside a solenoidal magnetic field or in front of a magnetic focusing horn,\nwhich serve to confine the pions into a drift volume. If a solenoid is used, as shown in figure 2\nthe field will be of order 20 Tesla, which encloses pions with a transverse momentum below\n225 MeV within a radius of 8 cm.\nThe target must be able to cope with the proton power of perhaps 4 MW. In such a small\ntarget this gives a very large heating, and while solid solutions7 are still under active investigation,\nthe preferred design is a liquid metal jet. The jet is of course a conductor, and it remains to\nbe shown that it can be injected into such a strong magnetic field without disruption. The\njet will certainly be disrupted by the beam, but reforms in around 20 ms, ready for the next\nproton pulse. The proposed system has a difficult combination of magnetic fields, heat transfer,\nmechanical stress and radiation exposure.\n2.3\n\nDecay and phase rotation\n\nThe pions must now be allowed to decay to muons which are to be cooled and accelerated.\nThese later steps require that the momentum spread of the beam be reduced so that the bunch\ndoes not diverge. The simplest way of doing this in principle is to drift for some tens of meters,\nduring which the decay occurs and a correlation between velocity and arrival time is created.\nA matched phase-rotating RF system can then be employed to decelerate the first arriving fast\nmuons and accelerate the slowest ones. That then gives a long bunch with relatively uniform\nenergy.\nA more sophisticated solution is to chop the bunch into several sub-bunches which are\ndifferentially accelerated, as above, but also given different paths so that they all arrive at the\nnext stage at the same time. The combination of the sub-bunches is by no means easy, and\nit will inevitably increase the transverse beam emittance, but this is relatively easy to reduce\nafterwards with ionization cooling.\n2.4\n\nCooling\n\nThe rapid muon decay means that traditional cooling techniques are too slow, but fortunately\nionization cooling seems to provide an answer. The principle is that muons loose energy when\n\n\fthey pass through matter, and they can be re-accelerated in the longitudinal direction. This\nprovides a net reduction in the transverse momentum, although not longitudinally.\n1 dEμ ǫn\nβ⊥ (0.014)2\ndǫn\n=− 2\n+ 3\ndx\nβ dx Eμ 2β Eμ mμ LR\n\n(1)\n\nWhere ǫn is the emittance in one transverse direction σx σPx /mμ c, β⊥ is the betatron function\nof the absorber and LR is the radiation length. The first term corresponds to ionization cooling,\nand the second to warming due to multiple scattering. There is an equilibrium when\nǫn =\n\nβ⊥\nβLR (dEμ /dx)\n\n(2)\n\nThe optimal cooling therefore calls for minimum β⊥ . This is clear: the minimum in the beta\nfunction corresponds to a maximum in the beam divergence, and at this point the contribution\nfrom multiple scattering is least important. However, we also wish a material which maximizes\nthe product of radiation length and dEμ /dx, which will be achieved for low Z. This product\n(evaluated at the minimum of the dE/dx curve), is 253 for Hydrogen, while for lithium, which\nis easier to handle and a conductor, it is 131. There is thus almost a factor of two advantage\nin using hydrogen, and heavier elements are correspondingly worse. Another possibility is LiH,\nwhich has LR (dEμ /dx) of 137, and could be a useful for an absorber with a complex shape.\nFor the first stages of cooling the beam is large, and the ultimate limit is not important, and\nhydrogen is a good choice of material. For the final cooling stages it may be that higher fields\ncan be created by the use of a lithium lens, with kAmps of current flowing through it, and that\na low β⊥ be more advantageous then using hydrogen.\n\na)\n\nb)\nD 0.5 m\nBending magnet\n45 deg, R = 42 cm\n\nD 1.6 m\n\nSolenoid coils\n\nεL (πmm)\n\n45\n\n6.07 m\n\nStart\n\n10 2\n\n3 TeV\nν fact. PJK\n\nDirection of magnetic field\nLiquid hydrogen absorber\n\nVBHEL5\n\n10\n\nLiH wedge absorber\nCuts off 1/2 of aperture\n201 MHz cavity\n\nRing cooler\nLithium\n100 GeV\n\n1\n\n1.41 m\n\n10\n\n-1\n\n1\n\n10\nεT (πmm)\n\nFigure 3: a) Sketch of a ring cooler, designed by V. Balbekov. Note the alternate field flips and shaped LiH\nabsorbers. b) shows the cooling required for the muons from production at pion decay to use in a collider. The\nx and y axes are the transverse and longitudinal emittance, and the grey lines show the effect of various designs\nof cooling channel.\n\nCooling is required in both transverse and longitudinal directions, but the latter cannot be\nachieved by ionization cooling directly. Instead it is necessary to exchange emittance between\ntransverse and longitudinal components, whilest cooling transverse. This is usually thought to\nbe done using a magnetic field to differentially deflect them beam, and then an absorber whose\n\n\fthickness varies with position so that a greater thickness is seen by the higher energy particles.\nHowever, detailed designs are difficult, as scatterings and imperfections tend to warm the beam.\nA promising recent development is the ring coolers8 , an example of which is shown in figure 3 a). These seem to be provide genuine six dimensional cooling despite allowing for windows\nand tails of scattering. However, a ring needs fast kickers to inject and eject the beam, and at\npresent there is no space available for these.\nA summary of cooling9 desired and designed can be seen in figure 3 b). There are many gaps\nin the chain, but the ring coolers and lithium lens devices do seem to be pieces of the overall\ncooling scheme.\n2.5\n\nAcceleration and collider\n\nThe acceleration is not in principle a great difficulty. To get to say 57.5 GeV per beam for a\nHiggs factory will require linear accelerators, but these can be recycling, either in a racetrack\nor dog-bone design. The latter seems to offer the best price for a specified performance, as the\nsame accelerating cavities are used by the muons in both directions, meaning that half as much\nRF is required.\nTable 1: Possible parameter sets for the collider. Higher energy machines are shown for comparison.\n\nCoM energy\np power, (MW)\n1/τμ (Hz)\nμ/bunch\ncircumference (m)\n< B > (T)\nf ective\nnef\nturns\nδp/p (%)\n6-D ǫ6,N (πm3 )\nRMS ǫT (π mm-rad)\nβ ∗ (cm)\nσz (cm)\nσr (μm)\nLuminosity, (cm2 s−1 )\n\n3 TeV\n4\n32\n2 × 1012\n6000\n5.2\n785\n0.16\n1.7 × 10−10\n0.05\n0.3\n0.3\n3.2\n7 × 1034\n\n400GeV\n4\n240\n2 × 1012\n1000\n4.7\n700\n0.14\n1.7 × 10−10\n0.05\n2.6\n2.6\n26\n1033\n\n100GeV\n4\n960\n2 × 1012\n350\n3\n450\n0.12\n1.7 × 10−10\n0.085\n4.1\n4.1\n86\n1.2 × 1032\n\n0.003\n1.7 × 10−10\n0.29\n14.1\n14.1\n294\n1031\n\nThe collider rings radius should be minimized to increase the number of turns the muons\nmake before they decay. For average dipole fields of 5 Tesla, 750 effective turns are made. A\n115 GeV collider could have a circumference of around 350 m, and a 3 TeV machine would be\nonly 6 km in circumference.\nHowever the dipoles do have to cope with the electrons coming from the muon decay, which,\ndue to their lower momentum are bent onto the inner wall of the collider. It may be that a\nsubstantially open design, allowing the electrons to emerge from the superconducting magnet\nregion is optimal, but in any case some cm of shielding will be required. This is why a 5 Tesla\nfield is considered, rather than the higher values achieved for LHC tests.\nOne of the great advantages of the muon collider is the energy precision and calibration. Due\nto the reduction of bremsstrahlung a bunch with a very small energy spread can be maintained,\nand the two 100 GeV machines in table 1 differ only in this spread. This is required if a narrow\nresonance like the Standard Model Higgs around 115 GeV is to be scanned.\nThe energy (and its spread) can be measured very accurately, using the muons spin precession. This is the same measurement as formed the basis of the LEP calibration, but is much\neasier because the muon decay to electron is self analyzing, and allows the measurement of the\n\n\fpolarization on every turn, and this means that each fill can be calibrated with a precision given\nby g-2. Also the energy spread can be extracted from the dilution of the polarization with time.\n2.6\n\nDetector\n\nThe detector suffers from one major difficulty - the background from electrons coming from the\nmuon decay. These will spill into the active volume creating fake tracks and noise hits, and at\nhigh energy Bethe-Heitler muons will also be created, which are too difficult to stop. Suppression\nof the decay electrons will rely upon a complex masking scheme, and current designs reduce the\nnoise levels to about the same as in LHC detectors. Unfortunately this does include a mask in\nthe low angle region, probably up to 20o to the axis, which will reduce the physics performance\nin the forward region. This leads to similar solutions being suggested: pixel detectors starting\nat a few cm radius appear to be able to cope with the noise.\nThe calorimeter may suffer from the Bethe-Heitler muons, and it seems that a segmented\ndesign, where these can be recognized by their orientation, will be required.\n\n30\n\n110 GeV Higgs\n\n25\n\nPYTHIA 6.120\n\n700\n\n800\n(b)\n\n500\n\n500\n\n400\n\nLHC and LC\n\n700\n600\n\n400\n\nFPMC\n(100-1pb\n)\n\nFPMC\n(10 -1fb\n)\n\n300\n\n300\n\n-1\n\nFitted, 10pb /point\n\n200\n7\n\n8\n\n9\n\n10\n\n15\n10\n5\n0\n-5\n109.98\n\n109.99\n\n110\n\n110.01\n110.02\n110.03\n2\n2 x beam energy, GeV/c\n\n200\n7\n\n11\ntanβ\n\n360\n(c)\n\n340\n\n2\nmA (GeV/c\n)\n\n20\n\n(a)\n\nLHC and LC\n\nb) 600\n\n2\nmA (GeV/c\n)\n\nσH π BR(H→bb), pb\n\na)\n\n800\n\n2\nmA (GeV/c\n)\n\nHiggs Physics\n2\nmA (GeV/c\n)\n\n3\n\n300\n\n280\n\n280\n\n10\n\n10.1\n\n10.2\ntanβ\n\n11\ntanβ\n\n(d)\n\n300\n\n9.9\n\n10\n\n340\n320\n\n9.8\n\n9\n\n360\n\n320\n\n260\n9.7\n\n8\n\n260\n9.7\n\n9.8\n\n9.9\n\n10\n\n10.1\n\n10.2\ntanβ\n\nFigure 4: a) The Higgs line-shape, with points corresponding to 10 pb−1 superimposed. b) The implications of\nthe h scan for the MSSM parameter space, assuming all other SUSY parameters are known.\n\nA sample scan of the Higgs resonance is shown in figure 4 a). The Higgs needs to be found\nbefore the collider can be built, and its mass known. However, if the mass information is accurate\nto only 60 MeV, as seems likely10 , then it will take a year to scan this region and locate the\nresonance. After a couple more years the width will be known to 1 MeV and the mass error is\nat present limited by g-2 to about 100 KeV.\nThe Higgs width is a very interesting test of the model, as it is uniquely fixed (given the\nmass) in the Standard Model, but differs in extensions such as supersymmetry. If the LHC and\na linear collider information can exclude the A of the MSSM (for tan β > 3) below 400 GeV,\none year with a muon collider will extend this to 900 GeV, and further with more luminosity.\nIf the h scan does show something more consistent with the MSSM than the SM we can\nimmediately constrain the model parameters. Figure 4 b) shows the improvement that the muon\ncollider would make compared with the information likely to be available from the LHC and\n\n\fLinear Collider10 . The plots on the left give the improvement from a very modest 100 pb−1 ,\nwhile those on the right show what could be learnt in 10 fb−1 were available. No theoretical\nerrors have been allowed for; these are currently substantial11 .\n3.1\n\nScan of H and A in the MSSM\n\nIf the standard Model Higgs weighs more than twice the W mass then its increased width due to\ndecay to W pairs means that the peak cross-section is too small for a direct scan to make sense.\nThis is not however true for the heavier Higgses of supersymmetry, and it will be desirable to\nmake a direct scan of these resonances as well.\n−4\n\n−4\n\nR=10 , mA=140 GeV, MSUSY=1TeV, Ab=0\nσpeak [pb]\n\nσpeak [pb]\n\nR=10 , mA=140 GeV, MSUSY=1TeV, Ab=0\n+ −\n\nμ μ −> h −> bb\n\n60\n\n−At=μ=MSUSY\n\n40\n\n+ −\n\nμ μ −> H, A −> bb\n\n120\n\n−At=μ=MSUSY\n\n100\n80\n\nAt=−μ=MSUSY\n\n60\n\n20\n\nAt=−μ=MSUSY\n\n40\n\nsinαeff~0\n\nHSM\n0\n\n140\n\n10\n\n20\n\n20\n\n30\n\n40\n\n50\n\n60\n\n70\n\ntanβ\n\n80\n\n0\n\nsinαeff~0\n\nA\nH\n10\n\n20\n\n30\n\n40\n\n50\n\n60\n\n70\n\n80\n\ntanβ\n\nFigure 5: The dependence of the Higgs couplings on tan β, for a particular choice of MSSM parameters. Note\nthat the SM Higgs mass is set equal to mh of the MSSM, and therefore depends upon tan β.\n\nThe coupling of the muon to the different Higgses depends upon the Higgs mixing angles,\nfor example ghμμ is proportional to sin αef f , but figure 512 makes it clear that if the lightest\nis suppressed the heavier Higgses will be enhanced. Thus the MSSM presents an even more\ninteresting picture for a muon collider.\nThe mass splitting of the H and A is rather small, and it is unlikely that any other machine\ncan resolve them as separate resonances. What value it is will depend upon the other parameters,\nbut it is clear from figure 5 that the cross-sections can be similar to or larger than the h, and if\nthe widths are relatively large the collider luminosity can be increased.\n3.2\n\nCP violation\n\nOne very interesting area for study is the CP properties of the Higgs system. In the MSSM, for\nexample, the h, H and A can in general be mixed, and so it is important to measure this. If\nthe second Higgs doublet is not so heavy that it decouples then the lightest physical Higgs state\nmay well have mixed CP. In this case there will be very interesting studies, because production\nof say b quark pairs can proceed through γ, Z or h exchange, and so interference can give rise\nto observable effects. The heavier states are in general more sensitive, because their masses are\nsimilar and mixing is more likely.\nFigure 6 shows one analysis13 based on direct CP violation. Note that for these parameters\nthe introduction of CP violation generates a mass splitting of the H and A which was not present\nwithout.\n4\n\nSummary\n\nThe muon collider operated as a Higgs factory will give the definitive measurement of the Higgs\nmass and width. There are also unequaled opportunities for establish the CP nature of the\n\n\f(a)\n\n3\n\nσRL [pb]\n\n(e)\n\n(c)\n\n3\n\n1\n\n(σRR+σLL) /2 [pb]\n\n2.5\n\n2.5\n\n2\n\n2\n\n1.5\n\n1.5\n\nσ|| [pb]\n\n0.8\n0.6\n0.4\n0.2\n0\n-0.2\n\n1\n\n1\n\n0.5\n\n0.5\n\n0\n\n0\n\n-0.4\n-0.6\n-0.8\n\n390\n\n400\n\n410\n√ s [GeV]\n\n(b)\n\n3\n\nσLR [pb]\n\n2.5\n2\n1.5\n1\n0.5\n\n390\n\n400\n\n410\n√ s [GeV]\n\n(d)\n\n300\n\n(σRR-σLL) /2 [fb]\n\n250\n\n390\n\n400\n\n410\n√ s [GeV]\n\n200\n150\n\n100\n\n100\n\n50\n\n50\n\n0\n\n0\n\n-50\n\n-50\n\n-100\n\n-100\n\n400\n\n410\n√ s [GeV]\n\n(f)\n\nσ⊥ [fb]\n\n250\n\n150\n\n-200\n\n390\n\n300\n\n200\n\n-150\n0\n\n-1\n\n-150\n390\n\n400\n\n410\n√ s [GeV]\n\n-200\n\n390\n\n400\n\n410\n√ s [GeV]\n\nFigure 6: Asymmetries sensitive to CP violation which can be constructed in the H, A system.\n\nsystem. There is a lot of work to be done before a machine can be constructed, but no insurmountable obstacles have been identified. In the meantime the neutrino factory developments\nwill push forward the technology.\nReferences\n1. C. Ankenbrandt et al., Status of Muon Collider Research and Development and Future\nPlans, Phys. Rev. ST Accel Beams 2,081001.\n2. B. Autin et al., Prospective study of muon storage rings at CERN, CERN 99–02, (1999).\n3. LEP Electro-weak working group, http://lepewwg.web.cern.ch/LEPEWWG/\n4. P.I. Kemenes, LEP Higgs working group report to LEPC, November 2000.\nhttp://lephiggs.web.cern.ch/LEPHIGGS/talks/pik lepc nov3 2000.ps\n5. Status of the HARP experiment, CERN-SPSC/2000-029 (2000)\nhttp://harp.web.cern.ch/hard/Documents/status report Oct2000.ps\n6. R. Garoby, M. Vretenar, Status of the Proposal for a Superconducting Proton Linac at\nCERN, CERN/PS/99-064 (RF), (1999).\n7. J.R.J. Bennett, A High Power Radiation Cooled Rotating Toroidal Target for Neutrino production, Jan 2000. http://nicewww.cern.ch/∼nfwg/nufactwg/ECFA/cern19jan00.ppt\n8. V. Balbekov, Ring Cooler Update, http://www-mucool.fnal.gov/mcnotes/muco189.ps,\nFeb 2001.\n9. R. Fernow, 3rd Higgs Factory workshop, UCLA, March 2001\n10. TESLA Technical Design Report, March 2001.\nhttp://tesla.desy.de/new pages/TDR CD/start.html\n11. G. Weiglen, Theoretical implications of the possible observation of Higgs Bosons at LEP,\nXXXXVI rencontres de Moriond, March 11-17, 2001, http://moriond.in2p3.fr.\n12. B. Autin et al., Continued study of muon storage rings at CERN, CERN Yellow report,\nto be published in 2001.\n13. E. Asakawa, S.Y. Choi and J.S. Lee, Phys. Rev. D62 (2000) 115005.\n\n\f"}