{"id": "http://arxiv.org/abs/hep-ph/0102097v1", "guidislink": true, "updated": "2001-02-08T13:48:02Z", "updated_parsed": [2001, 2, 8, 13, 48, 2, 3, 39, 0], "published": "2001-02-08T13:48:02Z", "published_parsed": [2001, 2, 8, 13, 48, 2, 3, 39, 0], "title": "Electroweak renormalization group corrections in high energy processes", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0102055%2Chep-ph%2F0102139%2Chep-ph%2F0102320%2Chep-ph%2F0102134%2Chep-ph%2F0102230%2Chep-ph%2F0102300%2Chep-ph%2F0102044%2Chep-ph%2F0102062%2Chep-ph%2F0102117%2Chep-ph%2F0102140%2Chep-ph%2F0102046%2Chep-ph%2F0102337%2Chep-ph%2F0102153%2Chep-ph%2F0102073%2Chep-ph%2F0102221%2Chep-ph%2F0102246%2Chep-ph%2F0102342%2Chep-ph%2F0102198%2Chep-ph%2F0102334%2Chep-ph%2F0102229%2Chep-ph%2F0102006%2Chep-ph%2F0102330%2Chep-ph%2F0102013%2Chep-ph%2F0102339%2Chep-ph%2F0102035%2Chep-ph%2F0102285%2Chep-ph%2F0102145%2Chep-ph%2F0102179%2Chep-ph%2F0102259%2Chep-ph%2F0102220%2Chep-ph%2F0102027%2Chep-ph%2F0102143%2Chep-ph%2F0102289%2Chep-ph%2F0102116%2Chep-ph%2F0102182%2Chep-ph%2F0102264%2Chep-ph%2F0102001%2Chep-ph%2F0102149%2Chep-ph%2F0102327%2Chep-ph%2F0102135%2Chep-ph%2F0102260%2Chep-ph%2F0102077%2Chep-ph%2F0102312%2Chep-ph%2F0102071%2Chep-ph%2F0102081%2Chep-ph%2F0102115%2Chep-ph%2F0102306%2Chep-ph%2F0102075%2Chep-ph%2F0102147%2Chep-ph%2F0102097%2Chep-ph%2F0102057%2Chep-ph%2F0102181%2Chep-ph%2F0102018%2Chep-ph%2F0102315%2Chep-ph%2F0102114%2Chep-ph%2F0102048%2Chep-ph%2F0102218%2Chep-ph%2F0102268%2Chep-ph%2F0102031%2Chep-ph%2F0102174%2Chep-ph%2F0102090%2Chep-ph%2F0102253%2Chep-ph%2F0102222%2Chep-ph%2F0102122%2Chep-ph%2F0102247%2Chep-ph%2F0102176%2Chep-ph%2F0102169%2Chep-ph%2F0102063%2Chep-ph%2F0102255%2Chep-ph%2F0102288%2Chep-ph%2F0102059%2Chep-ph%2F0102012%2Chep-ph%2F0102151%2Chep-ph%2F0102283%2Chep-ph%2F0102331%2Chep-ph%2F0102106%2Chep-ph%2F0102269%2Chep-ph%2F0102233%2Chep-ph%2F0102206%2Chep-ph%2F0102190%2Chep-ph%2F0102251%2Chep-ph%2F0102102%2Chep-ph%2F0102019%2Chep-ph%2F0102054%2Chep-ph%2F0102292%2Chep-ph%2F0102026%2Chep-ph%2F0102178%2Chep-ph%2F0102152%2Chep-ph%2F0102280%2Chep-ph%2F0102037%2Chep-ph%2F0102110%2Chep-ph%2F0102204%2Chep-ph%2F0102177%2Chep-ph%2F0102299%2Chep-ph%2F0102023%2Chep-ph%2F0102011%2Chep-ph%2F0102015%2Chep-ph%2F0102156%2Chep-ph%2F0102118%2Chep-ph%2F0102298%2Chep-ph%2F0102336&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Electroweak renormalization group corrections in high energy processes"}, "summary": "At energies ($\\sqrt{s}$) much higher than the electroweak gauge boson masses\n($M$) large logarithmic corrections of the scale ratio $\\sqrt{s}/M$ occur.\nWhile the electroweak Sudakov type double (DL) and universal single (SL)\nlogarithms have recently been resummed, at higher orders the electroweak\nrenormalization group (RG) corrections are folded with the DL Sudakov\ncontributions and must be included for a consistent subleading treatment to all\norders. In this paper we derive first all relevant formulae for massless as\nwell as massive gauge theories including all such terms up to order ${\\cal O}\n(\\alpha^n \\beta_0 \\log^{2n-1} \\frac{s}{M^2})$ by integrating over the\ncorresponding running couplings. The results for broken gauge theories in the\nhigh energy regime are then given in the framework of the infrared evolution\nequation (IREE) method. The analogous QED-corrections below the weak scale $M$\nare included by appropriately matching the low energy solution to the\nrenormalization group improved high energy results. The corrections are valid\nfor arbitrary external lines and largest in the scalar Goldstone and Higgs\nboson sector as well as for transverse gauge bosons. At TeV energies, these\nSL-RG terms change scattering cross sections in the percentile regime at two\nloops and are thus non-negligible for precision objectives at future linear\ncolliders.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0102055%2Chep-ph%2F0102139%2Chep-ph%2F0102320%2Chep-ph%2F0102134%2Chep-ph%2F0102230%2Chep-ph%2F0102300%2Chep-ph%2F0102044%2Chep-ph%2F0102062%2Chep-ph%2F0102117%2Chep-ph%2F0102140%2Chep-ph%2F0102046%2Chep-ph%2F0102337%2Chep-ph%2F0102153%2Chep-ph%2F0102073%2Chep-ph%2F0102221%2Chep-ph%2F0102246%2Chep-ph%2F0102342%2Chep-ph%2F0102198%2Chep-ph%2F0102334%2Chep-ph%2F0102229%2Chep-ph%2F0102006%2Chep-ph%2F0102330%2Chep-ph%2F0102013%2Chep-ph%2F0102339%2Chep-ph%2F0102035%2Chep-ph%2F0102285%2Chep-ph%2F0102145%2Chep-ph%2F0102179%2Chep-ph%2F0102259%2Chep-ph%2F0102220%2Chep-ph%2F0102027%2Chep-ph%2F0102143%2Chep-ph%2F0102289%2Chep-ph%2F0102116%2Chep-ph%2F0102182%2Chep-ph%2F0102264%2Chep-ph%2F0102001%2Chep-ph%2F0102149%2Chep-ph%2F0102327%2Chep-ph%2F0102135%2Chep-ph%2F0102260%2Chep-ph%2F0102077%2Chep-ph%2F0102312%2Chep-ph%2F0102071%2Chep-ph%2F0102081%2Chep-ph%2F0102115%2Chep-ph%2F0102306%2Chep-ph%2F0102075%2Chep-ph%2F0102147%2Chep-ph%2F0102097%2Chep-ph%2F0102057%2Chep-ph%2F0102181%2Chep-ph%2F0102018%2Chep-ph%2F0102315%2Chep-ph%2F0102114%2Chep-ph%2F0102048%2Chep-ph%2F0102218%2Chep-ph%2F0102268%2Chep-ph%2F0102031%2Chep-ph%2F0102174%2Chep-ph%2F0102090%2Chep-ph%2F0102253%2Chep-ph%2F0102222%2Chep-ph%2F0102122%2Chep-ph%2F0102247%2Chep-ph%2F0102176%2Chep-ph%2F0102169%2Chep-ph%2F0102063%2Chep-ph%2F0102255%2Chep-ph%2F0102288%2Chep-ph%2F0102059%2Chep-ph%2F0102012%2Chep-ph%2F0102151%2Chep-ph%2F0102283%2Chep-ph%2F0102331%2Chep-ph%2F0102106%2Chep-ph%2F0102269%2Chep-ph%2F0102233%2Chep-ph%2F0102206%2Chep-ph%2F0102190%2Chep-ph%2F0102251%2Chep-ph%2F0102102%2Chep-ph%2F0102019%2Chep-ph%2F0102054%2Chep-ph%2F0102292%2Chep-ph%2F0102026%2Chep-ph%2F0102178%2Chep-ph%2F0102152%2Chep-ph%2F0102280%2Chep-ph%2F0102037%2Chep-ph%2F0102110%2Chep-ph%2F0102204%2Chep-ph%2F0102177%2Chep-ph%2F0102299%2Chep-ph%2F0102023%2Chep-ph%2F0102011%2Chep-ph%2F0102015%2Chep-ph%2F0102156%2Chep-ph%2F0102118%2Chep-ph%2F0102298%2Chep-ph%2F0102336&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "At energies ($\\sqrt{s}$) much higher than the electroweak gauge boson masses\n($M$) large logarithmic corrections of the scale ratio $\\sqrt{s}/M$ occur.\nWhile the electroweak Sudakov type double (DL) and universal single (SL)\nlogarithms have recently been resummed, at higher orders the electroweak\nrenormalization group (RG) corrections are folded with the DL Sudakov\ncontributions and must be included for a consistent subleading treatment to all\norders. In this paper we derive first all relevant formulae for massless as\nwell as massive gauge theories including all such terms up to order ${\\cal O}\n(\\alpha^n \\beta_0 \\log^{2n-1} \\frac{s}{M^2})$ by integrating over the\ncorresponding running couplings. The results for broken gauge theories in the\nhigh energy regime are then given in the framework of the infrared evolution\nequation (IREE) method. The analogous QED-corrections below the weak scale $M$\nare included by appropriately matching the low energy solution to the\nrenormalization group improved high energy results. The corrections are valid\nfor arbitrary external lines and largest in the scalar Goldstone and Higgs\nboson sector as well as for transverse gauge bosons. At TeV energies, these\nSL-RG terms change scattering cross sections in the percentile regime at two\nloops and are thus non-negligible for precision objectives at future linear\ncolliders."}, "authors": ["Michael Melles"], "author_detail": {"name": "Michael Melles"}, "author": "Michael Melles", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.64.054003", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/hep-ph/0102097v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-ph/0102097v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "23 pages, 4 figures, uses LaTeX2e", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-ph/0102097v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-ph/0102097v1", "journal_reference": "Phys.Rev. D64 (2001) 054003", "doi": "10.1103/PhysRevD.64.054003", "fulltext": "arXiv:hep-ph/0102097v1 8 Feb 2001\n\nhep-ph/0102097\nPSI-PR-01-03\nFeb. 2001\n\nElectroweak renormalization group corrections in\nhigh energy processes\nMichael Melles∗\nPaul Scherrer Institute (PSI), CH-5232 Villigen, Switzerland.\n\nAbstract\n√\nAt energies ( s) much higher than the electroweak gauge boson masses (M )\n√\nlarge logarithmic corrections of the scale ratio s/M occur. While the electroweak Sudakov type double (DL) and universal single (SL) logarithms have\nrecently been resummed, at higher orders the electroweak renormalization group\n(RG) corrections are folded with the DL Sudakov contributions and must be\nincluded for a consistent subleading treatment to all orders. In this paper we\nderive first all relevant formulae for massless\nas well as massive\ngauge theories\n\u0011\n\u0010\n2n−1 s\nn\nby integrating over\nincluding all such terms up to order O α β0 log\nM2\nthe corresponding running couplings. The results for broken gauge theories in\nthe high energy regime are then given in the framework of the infrared evolution equation (IREE) method. The analogous QED-corrections below the weak\nscale M are included by appropriately matching the low energy solution to the\nrenormalization group improved high energy results. The corrections are valid\nfor arbitrary external lines and largest in the scalar Goldstone and Higgs boson\nsector as well as for transverse gauge bosons. At TeV energies, these SL-RG\nterms change scattering cross sections in the percentile regime at two loops and\nare thus non-negligible for precision objectives at future linear colliders.\n\n∗\n\nMichael.Melles@psi.ch\n\n\f1\n\nIntroduction\n\nWith the advent of colliders in the TeV regime there has been a renewed interest in\nthe high energy predictions of the Standard Model (SM). At hadronic colliders the\nexperimental and/or theoretical accuracy is usually in the few percent regime, and\nthus the effect of one loop electroweak corrections of the order of O (10 − 20%) at TeV\nenergies is indeed relevant for many processes. The reason for these large corrections\nto physical cross sections is primarily that they depend on the infrared cutoff, i.e. the\ngauge\nboson masses (M), leading to large DL and SL corrections of the scale ratio\n√\ns/M. Only soft photon effects need to be considered in a semi-inclusive way but\neven fully inclusive cross sections are expected to depend on log Ms 2 terms [1] due to\nthe fact that the initial states carry a non-Abelian group charge (the weak isospin)\nand thus violate the Bloch-Nordsieck theorem.\nAt this point all experimental constraints indicate that a light Higgs particle below\nthe W ± threshold is responsible for the breaking of the electroweak symmetry. If this\nscenario is realized in nature new physics is generally expected around the TeV scale in\norder to avoid the hierarchy problem. The high precision measurements of SLC/LEP\nhave limited the room for extensions of the SM considerably and in general, they\ncannot deviate from the SM to a large extent without evoking so-called conspiracy\neffects. It would therefore be very desirable to have a leptonic collider at hand in the\nfuture in order to answer questions posed by discoveries made at the LHC and possibly\nthe Tevatron. In particular, if only a light Higgs is discovered, say at 115 GeV, then\nit is mandatory to investigate all its properties in detail to experimentally establish\nthe Higgs mechanism including a possible reconstruction of the potential and of course\nof the Yukawa couplings. In addition one would have to look for additional heavy\nHiggs-bosons which could easily escape detection at the hadronic machines, but have a\nbetter chance for instance at the γγ-option at TESLA [2, 3, 4]. If any supersymmetric\nparticle would be found in addition, it is necessary to clarify and/or test the relations\nbetween couplings and properties of all new particles in as much detail as possible\nin a complementary way to what would already be known by that time. The overall\nimportance of leptonic colliders would thus be to clarify the physics responsible for\nthe electroweak symmetry breaking which in turn means it must be a high precision\nmachine.\nOn the theory side this means that effects at the 1 % level should be under control\nin both the SM as well as all extensions that are viable at that point. The focus of the\npresent work is the former. In particular the abovementioned large DL and SL corrections in the SM can, at two loops, be of the order of a few %. The largest contribution\nin the high energy limit, the DL corrections, were treated comprehensively to all orders\nin Ref. [5]. The method employed in Ref. [5] is based on a non-Abelian generalization of a bremsstrahlung theorem due to Gribov [6]. The essential point here is that\ncorrections factorize with respect to the perpendicular Sudakov component |k⊥ | of the\n1\n\n\fexchanged gauge boson. With a cutoff imposed on the allowed values of |k⊥ | ≥ μ ≥ M\nall gauge bosons in the unbroken (high energy) regime of the electroweak theory factorize according to the underlying SUL (2) × UY (1) symmetry in analogy to QCD. The\neffect of soft photon emission can then be included in the framework of the IREE\nmethod [7] with appropriate matching conditions. This approach was extended to the\nsubleading level and to longitudinal degrees of freedom via the equivalence theorem in\nRefs. [8, 9] by employing the virtual contributions to the respective splitting functions.\nIn Ref. [9] it was furthermore shown that also top-Yukawa enhanced subleading corrections can be included in this formalism to SL accuracy to all orders. These terms\nare typical for broken gauge theories as are longitudinal degrees of freedom in general.\nAt one loop, the approach was tested with calculations in the physical SM fields\nof Refs. [10, 11]. Also at the two loop level to DL accuracy, the approach was verified\nby explicit calculations in Refs. [12, 13, 14]. To subleading accuracy it agrees with the\nresult of Ref. [15] for e+ e− → f f to all orders (up to Yukawa terms), where results\nfor the QCD form factor were generalized to the electroweak theory in a similar spirit\nas detailed above. In addition, non-universal angular terms were calculated at the one\nloop level and it was proposed to resum these terms by multiplying these corrections\nwith the DL form factor.\nThe still outstanding corrections of the universal, i.e. process independent, type\nare the focus of this work. They are given by the folding of DL-corrections with RG\nloops\n\u0011 starting at the two loop level. These contributions are of order\n\u0010 at higher orders,\n2n−1 s\nn\nand as such need to be included in a genuinely SL analysis. We\nO α β0 log\nM2\nwill denote them as SL-RG in the following. Conventional RG corrections, however,\nare subsubleading at the two loop level.\nThe paper is organized as follows. In section 2 we review the case for unbroken\ngauge theories and focus on QCD in particular. We derive analytical formulas for\nboth virtual and real corrections to external quark and gluon lines depending on the\nexperimental requirements. Section 3 then applies the results according to the above\nconsiderations to the SM after briefly summarizing the results for the Sudakov corrections. We discuss the size of the results in section 4 and make concluding remarks in\nsection 5.\n\n2\n\nHigher order renormalization group corrections\nin QCD\n\nIn this section we review the case of unbroken gauge theories like QCD. Explicit comparisons with higher order calculations revealed that the relevant RG scale in the\nrespective diagrams is indeed the perpendicular Sudakov component [16, 17, 18]. We\ngive correction factors for each external line below. The universal nature of the higher\norder SL-RG corrections can be seen as follows. Consider the gauge invariant fermionic\n2\n\n\fFigure 1: A QED diagram at the two loop level yielding a SL-RG correction. The\nexplicit result obtained in Ref. [20] for the case of equal masses relative to the Born\n1 e4\n1 QED e4\namplitude was − 36\nlog3 ms2 = 12\nβ0 16π4 log3 ms2 . This result is reproduced exactly\n16π 4\nby including a running coupling into the one loop vertex correction diagram. The\nargument of the coupling must depend on the component of the loop momentum\n(going into the fermion loop) which is perpendicular to the external fermion momenta.\nIn QCD, although more diagrams contribute, the net effect is just to replace β0QED −→\nβ0QCD in the above expression.\npart (∼ nf ) as indicative of the full β0QCD term (replacing nf =\n\u0010\n\n\u0011\n\n3\nTF\n\n\u0010\n\n11\nC\n12 A\n\n\u0011\n\n− β0QCD ).\n\nIn order to lead to subleading, i.e. O αsn log2n−1 μs2 , this loop correction must be\nfolded with the exchange of a gauge boson between two external lines (producing a DL\ntype contribution) like the one depicted in Fig. 1. Using the conservation of the total\nnon-Abelian group charge, i.e.\nn\nX\n\nj=1\n\nT a (j)M(p1 , ..., pj , ..., pn ; k2⊥ ) = 0\n\n(1)\n\nthe double sum over all external insertions j and l is reduced to a single sum over all\nn external legs. Thus these types of corrections can be identified with external lines at\nhigher orders. The same conclusion is reproduced by the explicit pole structure of MS\nrenormalized scattering amplitudes at the two loop level in QCD [19]. In addition, from\nthe expression in Ref. [19] it can be seen that the SL-RG corrections are independent\nof the spin, i.e. for both quarks and gluons the same running coupling argument is to\nbe used. This is a consequence of the fact that these corrections appear only in loops\nwhich can yield DL corrections on the lower order level and as such, the available DL\nphase space is identical up to group theory factors. We begin with the virtual case.\n\n3\n\n\f2.1\n\nVirtual corrections\n\nThe case of virtual SL-RG corrections for both massless and massive partons has been\ndiscussed in Ref. [21] with a different Sudakov parametrization. Below we show the\nidentity of both approaches. The form of the corrections is given in terms of the\nprobabilities WiV (s, μ2 ). To logarithmic accuracy, they correspond to the probability\nto emit a soft and/or collinear virtual parton from particle i at high energies subject\nto an infrared cutoff μ. At the amplitude level all expressions below are universal for\neach external line and exponentiate according to\nn\n\u0011\n\u0010\n1X\nWiV s, μ2\nM(p1 , ..., pn , gs , μ) = MBorn (p1 , ..., pn , gs ) exp −\n2 i=1\n\n!\n\n(2)\n\nwhere n denotes the number of external lines. We begin with the massless case.\n2.1.1\n\nMassless QCD\n\nIn the following we denote the running QCD-coupling by\nαs (k2⊥ ) =\n\nαs (μ2 )\n1+\n\nαs (μ2 ) QCD\nβ0\nπ\n\n2\nlog k⊥\n\nμ2\n\n≡\n\nαs (μ2 )\n2\n1 + c log kμ2⊥\n\n(3)\n\n11\nCA − 31 TF nf and for QCD we have CA = 3, CF = 43 and TF =\nwhere β0QCD = 12\n1\nas usual. Up to two loops the massless β-function is independent of the chosen\n2\nrenormalization scheme and is gauge invariant in minimally subtracted schemes to\nall orders [22]. These features will also hold for the derived renormalization group\ncorrection factors below in the high energy regime. The scale μ denotes the infrared\ncutoff on the exchanged k⊥ between the external momenta pj , pl , where the Sudakov\ndecomposition is given by k = vpl + upj + k⊥ , such that pj k⊥ = pl k⊥ = 0. The cutoff μ\n2\n> 0 which\nserves as a a lower limit on the exchanged Euclidean component k2⊥ = −k⊥\ncan be defined in an invariant way as:\n\nμ2 ≤ k2⊥ ≡ min(2(kpl )(kpj )/(pl pj ))\n\n(4)\n\nfor all j 6= l. In order to avoid the Landau pole we must choose μ > ΛQCD . Thus, the\nexpressions given in this section correspond for quarks to the case where m ≪ μ. For\narbitrary external lines we then have\nf DL\nW\niV\n\n\u0010\n\ns, μ\n\n2\n\n\u0011\n\nαs C i\n=\n2π\n\nZ\n\ns\n\nμ2\n\nZ\n\ns\nαs C i\ndk2⊥ 1 dv\n=\nlog2 2\n2\n2\n4π\nμ\nk⊥ k⊥ /s v\n\n(5)\n\nThe RG correction is then described by including the effect of the running coupling\nfrom the scale μ2 to s according to [16, 17, 18] (see also discussions in Refs. [21, 23]):\n\u0010\n\nf RG s, μ2\nW\niV\n\n\u0011\n\n=\n\nCi\n2π\n\nZ\n\ns\nμ2\n\nZ\n\ndk2⊥ 1 dv\nαs (μ2 )\n2\n2\nk2⊥ k⊥ /s v 1 + c log k⊥\n2\nμ\n4\n\n\fαs (μ2 )Ci\n=\n2π\n\n(\n\n!\n\nαs (μ2 )\n1\ns\n1\nαs (μ2 )\nlog 2 log\n− 1 + 2 log\nc\nμ\nαs (s)\nc\nαs (s)\n\n)\n\n(6)\n\nwhere Ci = CA for gluons and Ci = CF for quarks. For completeness we also give\nthe subleading terms of the external line correction which is of course also important\nfor phenomenological applications. The terms depend on the external line and the\ncomplete result to logarithmic accuracy is given by:\n\u0010\n\n(\n\n\u0011\n\n!\n\nαs (μ2 )CA 1\ns\nαs (μ2 )\n1\nαs (μ2 )\n=\ns, μ\nlog 2 log\n− 1 + 2 log\n2π\nc\nμ\nαs (s)\nc\nαs (s)\n)\n2\ns\n− β0QCD log 2\nCA\nμ\n(\n!\n2\n\u0011\n\u0010\nαs (μ2 )\ns\n1\nαs (μ2 )\nαs (μ )CF 1\nRG\n2\nlog 2 log\n− 1 + 2 log\n=\nWqV s, μ\n2π\nc\nμ\nαs (s)\nc\nαs (s)\n)\n3\ns\n− log 2\n2\nμ\nWgRG\nV\n\n2\n\n(7)\n\n(8)\n\nIt should be noted that the subleading term in Eq. (7) proportional to β0QCD is not\na conventional renormalization group corrections but rather an anomalous scaling dimension, and enters with the opposite sign [8] compared to the conventional RG contribution.\n2.1.2\n\nMassive QCD\n\nHere we give results for the case when the infrared cutoff μ ≪ m, where m denotes\nthe external quark mass. We begin with the case of equal external and internal line\nmasses:\nEqual masses\nFollowing Ref. [21], we use the gluon on-shell condition suv = k2⊥ to calculate the\nintegrals. We begin with the correction factor for each external massive quark line.\nFollowing the diagram on the left in Fig. 2 we find:\n\u0010\n\nf RG s, μ2\nW\nqV\n\n\u0011\n\n=\n\nZ\n\nZ\n\ndu 1 dv\nm2\nm2\nΘ(suv − μ2 )Θ(u −\nv)Θ(v −\nu)\ns\ns\n0 u 0 v\nαs (m2 )\n×\n1 + c log suv\nm2\nCF\n2π\n\nCF\n=\n2π\n−\n\nZ\n\n1\n\n(Z\n\nμ\nm\nμ2\ns\n\nμm\ns\nμ2\ns\n\ndu\nu\n\ndu\nu\n\nZ\n\nZ\n\n1\nμ2\nsu\n\n1\nμ2\nsu\n\ndv\n+\nv\n\ndv\n−\nv\n5\n\nZ\n\nZ\n\n1\n\nμ\nm\nm2\ns\n\nμm\ns\n\ndu\nu\ndu\nu\n\nZ\n\nZ\n\n1\nm2\nu\ns\n\n1\ns\nu\nm2\n\ndv\nv\n\n\n\ndv  αs (m2 )\nv  1 + c log suv\nm2\n\n\fVirtual Sudakov DL-Phase Space\n\nVirtual Sudakov DL-Phase Space\n\n1\n\n1\n\nv\n\nv\n\nμ\n\nm\n\n2\n\nμ\n2\nm\n2\n\nm\n\ns\n\nμm\n\ns\n2\nμ\n\ns\n0\n\n2\n\nμ\n\ns\n2\n\nμ\n\nm\n\nμ μm\n \ns s\n\n1\n\nu\n\n0\n\nμ\n\n2\n\nm\n\n2\n\nk2⊥\n\ns\n\nFigure 2: The virtual Sudakov DL-phase space in massive QCD in the {u, v} and\n{k2⊥ , v} representation. The shaded area is the region of integration in each case. For\nμ ≥ m the relevant phase space is mass independent in each case.\nαs (m2 )CF\n=\n2π\n\n(\n\n!\n\n1\ns\nαs (μ2 )\n1\nαs (m2 )\nlog 2 log\n− 1 + 2 log\nc\nm\nαs (s)\nc\nαs (s)\n\n)\n\n(9)\n\nThe μ-dependent terms cancel out of any physical cross section (as they must) when\nreal soft Bremsstrahlung contributions are added and c = αs (m2 )β0QCD /π for massive\nquarks. In order to demonstrate that the result in Eq. (9) exponentiates, we calculated\nin Ref. [21] the explicit two loop renormalization group improved massive virtual\nSudakov corrections, containing a different \"running scale\" in each loop. It is of course\nalso possible to use the scale k2⊥ directly. In this case we have according to the right\ndiagram in Fig. 2:\n\u0010\n\nf RG s, μ2\nW\nqV\n\n\nZ\n\n\u0011\n\nCF \n=\n2π\n\nm2\n\nμ2\n\nαs (m2 )CF\n=\n2π\n\n\n\nZ 2\nZ\nZ s\ndk2⊥ 1 dv  αs (m2 )\ndk2⊥ k⊥ /m2 dv\n+\n2\n2\n2\nv\nk2⊥ /s v 1 + c log k⊥\nm2 k⊥\nk2⊥ k⊥ /s\nm2\n(\n\n!\n\n1\ns\nαs (μ2 )\n1\nαs (m2 )\nlog 2 log\n− 1 + 2 log\nc\nm\nαs (s)\nc\nαs (s)\n\n)\n\n(10)\n\nwhich is the identical result as in Eq. (9). For completeness we also give the subleading\nterms of the pure one loop form factor which is again important for phenomenological\napplications. The complete result to logarithmic accuracy is thus given by:\nWqRG\nV\n\n\u0010\n\ns, μ\n\n2\n\n\u0011\n\nαs (m2 )CF\n=\n2π\n\n(\n\n!\n\n1\ns\nαs (μ2 )\n1\nαs (m2 )\nlog 2 log\n− 1 + 2 log\nc\nm\nαs (s)\nc\nαs (s)\n6\n\n\fs\nm2\n3\n− log 2 − log 2\n2\nm\nμ\n\n)\n\n(11)\n\nFor m = μ Eq. (11) agrees with Eq. (8) in the previous section for massless quarks.\nUnequal masses\nIn this section we denote the external mass as before by m and the internal mass by mi\nand thus, the constant c = αs (m2i )β0QCD /π. We consider only the case at high energies\ntaking the first two families of quarks as massless. The running of all light flavors is\nimplicit in the nf term of the β0QCD function. The result is then given by:\n\u0010\n\nf RG s, μ2\nW\nqV\n\n\u0011\n\n\n\n\n\n2\nCF Z m2 dk2⊥ Z k⊥ /m2 dv Z s dk2⊥ Z 1 dv  αs (m2i )\n=\n+\n2\n2\n2π μ2 k2⊥ k2⊥ /s\nv\nk2⊥ /s v 1 + c log k⊥\nm2 k⊥\nm2\n\n(\n\nαs (m2i )CF 1\ns\nαs (μ2 )\n=\nlog 2 log\n−1\n2π\nc\nm\nαs (s)\n!)\nαs (m2 ) 1\nm2\n1\n+ log 2\n+ log\nc\nαs (s) c\nmi\n\ni\n\n!\n\n(12)\n\nIt is evident that the effect of unequal masses is large only for a large mass splitting.\nIn QCD, we always assume scales larger than ΛQCD and with our assumptions we have\nonly the ratio of mt /mb leading to significant corrections.\nThe full subleading expression is accordingly given by:\nWqRG\nV\n\n\u0010\n\ns, μ\n\n2\n\n\u0011\n\n(\n\n!\n\nαs (μ2 )\ns\nαs (m2i )CF 1\nlog 2 log\n−1\n=\n2π\nc\nm\nαs (s)\n)\n!\n1\nαs (m2 ) 1\nm2\ns\nm2\n3\n+ log\n+ log 2 − log 2 − log 2\nc\nαs (s) c\nmi\n2\nm\nμ\n(\n!\n2\n2\ns\nαs (μ )\nαs (mi )CF 1\nlog 2 log\n−1\n=\n2π\nc\nm\nαs (s)\n)\n1 αs (m2i )\nαs (m2 ) 3\ns\nm2\n+ 2\nlog\n− log 2 − log 2\nc αs (m2 )\nαs (s)\n2\nm\nμ\n\n(13)\n\nFor m = mi Eq. (13) agrees with Eq. (11) in the previous section for equal mass\nquarks.\nIf we want to apply the above result for the case of QED corrections later, then\nthere is no Landau pole (at low energies) and we can have large corrections of the form\nmb /me etc. In this case the running coupling term is given by\ne2 (k2⊥ ) =\n\ne2\n1−\n\n1 e2\n3 4π 2\n\nP nf\n\n2\n\nk⊥\n2 j\nj=1 Qj NC log m2\n\n7\n\nj\n\n(14)\n\n\fand instead of Eq. (13) we have:\nWfRG\nV\n\n\u0010\n\ns, μ\n\n2\n\n\u0011\n\ne2f\n= 2\n8π\n\n\n(\n\n!\n\ne2 (μ2 )\ns\n1\nlog 2 log 2\n−1 +\nc\nm\ne (s)\n\n\n\n\nnf\nm2  3\ne2 (m2 ) \n1 e2 X\ns\nm2 \n1\n2 j\nQ\nN\nlog\nlog\n1\n−\nlog\n−\nlog\n−\nc2\ne2 (s)\n3 4π 2 j=1 j C\nm2j\n2\nm2\nμ2 \n2\n\ne\nand where c = − 31 4π\n2\n\n2.2\n\nPnf\n\nj=1\n\n(15)\n\nQ2j NCj .\n\nReal gluon emission\n\nWe discuss the massless and massive case separately since the structure of the divergences is different in each case. For massive quarks we discuss two types of restrictions\non the experimental requirements, one in analogy to the soft gluon approximation.\nThe expressions below exponentiate on the level of the cross section, i.e. for observable\nscattering cross sections they are of the form\ndσ(p1 , ..., pn , gs , μexpt ) = dσBorn (p1 , ..., pn , gs ) ×\nexp\n\n(\n\nn h\nX\n\n\u0010\n\nWi,R s, μ\n\ni=1\n\n2\n\n, μ2expt\n\n\u0011\n\n\u0010\n\n− Wi,V s, μ\n\n2\n\n)\n\u0011i\n\n(16)\n\nwhere the sum in the exponential is independent of μ and only depends on the cutoff\nμexpt defining the experimental cross section. We begin with the massless case.\n2.2.1\n\nEmission from massless partons\n\nIn this section we consider the emission of real gluons with a cutoff k⊥ ≤ μexpt , related\nto the experimental requirements. For massless partons we have at the DL level:\nf DL\nW\niR\n\n\u0010\n\ns, μ\n\n2\n\n, μ2expt\n\n\u0011\n\nαs C i\n=\nπ\n\nZ\n\nμ2expt\n\nμ2\n\nZ\n\n(\n\n√\n\ns dω\ns\ndk2⊥\ns\nαs C i\nlog2 2 − log2 2\n=\n2\n4π\nμ\nμexpt\nk ⊥ |k ⊥ | ω\n\n)\n\n(17)\n\nand thus for the RG-improved correction:\nf RG\nW\niR\n\n\u0010\n\ns, μ\n\n2\n\n, μ2expt\n(\n\n\u0011\n\nCi\n=\nπ\n\nZ\n\nμ2expt\n\nμ2\n\nZ\n\n√\n\ns dω\ndk2⊥\nαs (μ2 )\n2\nk2⊥ |k⊥ | ω 1 + c log k⊥\n2\nμ\n\n!\n\n)\n\nμ2expt\nCi αs (μ2 ) 1\ns\nαs (μ2 )\n1\n1\nαs (μ2 )\n=\n(18)\nlog 2 log\n− 1 − log\n+ 2 log\n2π\nc\nμ\nαs (μ2expt )\nc\ns\nc\nαs (μ2expt )\nThis expression depends on μ as it must in order to cancel the infrared divergent virtual\ncorrections. In fact the sum of real plus virtual corrections on the level of the cross\n8\n\n\fsection is given by\n\u0011\n\n\u0010\n\n\u0011\n\n\u0010\n\ns, μ2 =\nWiRG\ns, μ2, μ2expt − WiRG\nV\nR\n(\n\nμ2expt 1\nαs (s)\nαs (s)\nCi\ns\nlog\n−\nlog\n+\nlog\nlog\nQCD\n2\nμ2\nαs (μexpt )\ns\nc\nαs (μ2expt )\n2β0\n!\nμ2expt\nπ\nαs (s)\nCi\n− log\nlog\n=\n2β QCD α(s)β0QCD\nαs (μ2expt )\ns\n\n)\n\n(19)\n\nand thus independent of μ. The full expressions to subleading accuracy are thus:\n(\n\n!\n\nμ2expt\nCA αs (μ2 ) 1\nαs (μ2 )\ns\n1\n2\n2\nWgRG\ns,\nμ\n,\nμ\n=\nlog\nlog\n−\n1\n−\nlog\nexpt\nR\n2π\nc\nμ2\nαs (μ2expt )\nc\ns\n)\n2\nαs (μ )\n2 QCD\ns\n1\n(20)\n−\nβ0\nlog 2\n+ 2 log\n2\nc\nαs (μexpt ) CA\nμ\n(\n!\n\u0010\n\u0011\nμ2expt\nCF αs (μ2 ) 1\nαs (μ2 )\ns\n1\nRG\n2\n2\nWqR s, μ , μexpt =\nlog 2 log\n−\n1\n−\nlog\n2π\nc\nμ\nαs (μ2expt )\nc\ns\n)\n2\nαs (μ )\n3\ns\n1\n(21)\n−\nlog\n+ 2 log\nc\nαs (μ2expt ) 2\nμ2\n\u0010\n\n\u0011\n\nAll divergent (μ-dependent) terms cancel when the full virtual corrections are added.\n2.2.2\n\nEmission from massive quarks\n\nIn the case of a massive quark, i.e. μ ≪ m, the overall infrared divergence is not as\nsevere. This means we can discuss different requirements which all have the correct\ndivergent pole structure canceling the corresponding terms from the virtual contributions. We divide the discussion in two parts as above.\nEqual masses\nThe constant c = αs (m2 )β0QCD /π below. We have the following expression without a\nrunning coupling:\n\u0010\n\nWqR s, μ\n\n2\n\n, μ2expt\n\n\u0011\n\nαs C F\n=\nπ\n\nZ\n\nμ2expt\nμ2\n\ndk2⊥\n\nZ\n\n√\n\n|k ⊥ |\n\n\n\u0012\n2\n2\n\n2\nαs CF 1\n\n− log m\n 2π 2 log ms2 + log ms2 log m\nμ2\nμ2\n\u0012\n≈\n2\n2\n\n2\nαs CF\n\n+ log μ2μ\n 2π log ms2 + log ms2 log m\nμ2\nexpt\n\n9\n\ns\n\ndω\nk2⊥\n\u0011\n\u0010\nω k2 + m2 /s ω 2 2\n⊥\n1\n2\n\n− log\n\n2\n\ns\n\nμ2expt\n\n\u0013\n\n− log ms2 log μ2s\n\nexpt\n\n, m ≪ μexpt\n\n\u0013\n\n, μexpt ≪ m\n\n(22)\n\n\fIf we want to employ a restriction analogously to the soft gluon approximation, we\nfind independently of the quark mass [8, 12]:\n\u0010\n\nWqR s, μ\n\n2\n\n, μ2expt\n\n\u0011\n\nαs C F\n=\nπ\n\nZ\n\nμ2expt\n\nμ2\n\ndk2⊥\n\nZ\n\n√\nμexpt\n\n|k ⊥ |\n\nk2⊥\ndω\n\u0011\n\u0010\nω k2 + m2 /s ω 2 2\n⊥\n\n!\n\ns\n1\ns\ns\nm2\nm2\ns\ns\n(23)\nlog2 2 + log 2 log 2 − log 2 + log 2 − log 2 log 2\n2\nm\nm\nμ\nμ\nμexpt\nm\nμexpt\n\nαs C F\n≈\n2π\n\nIn all cases above we have not taken into account all subleading collinear logarithms\nrelated to real gluon emission. In order to now proceed with the inclusion of the\nrunning coupling terms it is convenient to first consider only the DL phase space in\neach case. Thus we find\nf RG\nW\nqR\n\n\u0010\n\ns, μ\n\n2\n\n, μ2expt\n\n\u0011\n\nαs (m2 )CF\n=\n2π\n\nZ\n\nm2\n\nμ2\n\n\"\n\nZ μ2\n2\nexpt dk\ndk2⊥\ns\ns\n⊥\nlog\nlog 2\n+\n2\n2\n2\nm\nm2\nk⊥\nk⊥\nk⊥\n!\n\n!\n\n1\n2\n\n⊥\n1 + c log k\nm2\ns\n\nαs (m2 )CF 1\nαs (μ2 )\ns\n1\n≈\nlog 2 log\n− 1 + log 2\n2\n2π\nc\nm\nαs (μexpt )\nc\nμexpt\n#\n2\nαs (m )\n1\n, m ≪ μexpt\n+ 2 log\nc\nαs (μ2expt )\n\n(24)\n\nand\n\u0010\n\nf RG\nW\nqR\n\ns, μ\n\n2\n\n, μ2expt\n\n\u0011\n\ns\n1\nαs (m2 )CF Z μ2expt dk2⊥\n=\n2 log\n2\n2\n2π\nm 1 + c log k2⊥\nμ\nk⊥\nm2\n2\n2\ns\nαs (μ )\nαs (m )CF 1\nlog 2 log\n, μexpt ≪ m\n≈\n2π\nc\nm\nαs (μ2expt )\n\n(25)\n\nThe full subleading expressions are thus given by\nWqRG\nR\n\n\u0010\n\ns, μ\n\n2\n\n, μ2expt\n\n\u0011\n\n\"\n\n!\n\nαs (m2 )CF 1\nαs (μ2 )\ns\n1\ns\n≈\nlog 2 log\n− 1 + log 2\n2\n2π\nc\nm\nαs (μexpt )\nc\nμexpt\n#\n2\n2\n1\nαs (m )\nm\n+ 2 log\n− log 2 , m ≪ μexpt\n(26)\n2\nc\nαs (μexpt )\nμ\n\nand\nWqRG\nR\n\n\u0010\n\ns, μ\n\n2\n\n, μ2expt\n\n\u0011\n\n\"\n\ns\nαs (μ2 )\nμ2\nαs (m2 )CF 1\nlog 2 log\n+\nlog\n≈\n2π\nc\nm\nαs (μ2expt )\nμ2expt\n\n#\n\n, μexpt ≪ m\n(27)\n\n10\n\n\fIn case we also impose a cut on the integration over ω we have independently of the\nrelation between m and μexpt assuming only m2 ≪ s:\n\u0010\n\nf RG s, μ2 , μ2\nW\nqR\nexpt\n\n\u0011\n\n\n\n2\n\n=\n\nαs (m )CF \n\n2π\n\n×\n\nZ\n\nm2 μ2\nexpt\ns\n\nμ2\n\ndk2⊥\nk2⊥\n\nlog\n\ns\n+\nm2\n\nZ\n\nμ2expt\nm2 μ2\nexpt\ns\n\ndk2⊥\nk2⊥\n\n1\n\nlog\n\n\n\nμ2expt \n\nk2⊥\n\n2\n\n⊥\n1 + c log k\nm2\n\n\"\n\n!\n\nαs (m2 )CF 1\ns\nαs (μ2 )\n≈\nlog 2 log\n−1\n2π\nc\nm\nαs (μ2expt )\n#\nαs (μ2expt )\nαs (μ2expt m2 /s)\n1\ns\n1\n+ log 2 log\n(28)\n+ log\nc\nμexpt\nαs (μ2expt m2 /s) c2\nαs (μ2expt )\nThis expression agrees with the result obtained in Ref. [21] where the gluon on-shell\ncondition k2⊥ = suv was used and one integral over one Sudakov parameter was done\nnumerically. In Ref. [21] it was also shown that the RG-improved virtual plus soft\nform factor also exponentiates by explicitly calculating the two loop RG correction\nwith each loop containing a running coupling of the corresponding k2⊥ .\nThe full subleading expression for the RG-improved soft gluon emission correction\nis thus given by\n\"\n\n\u0011\n\n\u0010\n\n!\n\nαs (μ2 )\ns\nαs (m2 )CF 1\n2\n2\nlog\nlog\n−1\n≈\ns,\nμ\n,\nμ\nWqRG\nexpt\nR\n2π\nc\nm2\nαs (μ2expt )\n#\nαs (μ2expt )\nαs (μ2expt m2 /s)\n1\ns\n1\nm2\ns\n+ log 2 log\n+ log\n− log 2 + log 2 (29)\nc\nμexpt\nαs (μ2expt m2 /s) c2\nαs (μ2expt )\nμ\nμexpt\nfor the equal mass case. The case of different external and internal masses is again\nimportant for applications in QED and will be discussed next.\nUnequal masses\nWhile the gluonic part of the β-function remains unchanged we integrate again only\nfrom the scale of the massive fermion which is assumed to be in the perturbative\nregime. For applications to QED, however, we need the full expressions below. Here\nwe discuss only the case analogous to the soft gluon approximation. Considering again\nonly the high energy scenario we have for the case of an external mass m and a fermion\nloop mass mi :\n\u0010\n\nf RG s, μ2 , μ2\nW\nqR\nexpt\n\n\u0011\n\n=\n\nαs (m2i )CF\n2π\n\n\n\n\n\nZ\n\nm2 μ2\nexpt\ns\n\nμ2\n\n11\n\ndk2⊥\nk2⊥\n\nlog\n\ns\n+\nm2\n\nZ\n\nμ2expt\nm2 μ2\nexpt\ns\n\ndk2⊥\nk2⊥\n\n\n\nμ2expt \nlog 2 \nk⊥\n\n\f×\n\n1\n2\n\n⊥\n1 + c log k\nm2\n\n\"\n\ni\n\n!\n\nαs (m2i )CF 1\nαs (μ2 )\ns\n≈\nlog 2 log\n−1\n2π\nc\nm\nαs (μ2expt m2 /s)\n#\nαs (μ2expt )\nαs (μ2expt m2 /s)\nm2i\n1\n1\n(30)\n+ log\n+ log 2 log\nc\nμexpt\nαs (μ2expt m2 /s) c2\nαs (μ2expt )\nThis expression agrees with the result obtained in Eq. (28) for the case mi = m.\nThe full subleading expression for the RG-improved soft gluon emission correction\nis thus given by\n\u0010\n\n\"\n\n\u0011\n\n!\n\nαs (μ2 )\ns\nαs (m2i )CF 1\nlog 2 log\n−1\n≈\ns, μ\n2π\nc\nm\nαs (μ2expt m2 /s)\n#\nαs (μ2expt )\nαs (μ2expt m2 /s)\n1\nm2i\n1\nm2\ns\n+ log 2 log\n+ log\n− log 2 + log 2\nc\nμexpt\nαs (μ2expt m2 /s) c2\nαs (μ2expt )\nμ\nμexpt\n\"\n!\nαs (μ2 )\ns\nαs (m2i )CF 1\nlog 2 log\n−1\n=\n2π\nc\nm\nαs (μ2expt m2 /s)\n#\nαs (μ2expt m2 /s)\n1 αs (m2i )\nm2\ns\n+ 2\n(31)\nlog\n− log 2 + log 2\nc αs (μ2expt )\nαs (μ2expt )\nμ\nμexpt\n\nWqRG\nR\n\n2\n\n, μ2expt\n\nAs mentioned above, this expression is more useful for applications in QED or if the\nmass ratios are very large. In QED we have again the running coupling of the form\ngiven in Eq. (14), and Eq. (31) becomes\nWfRG\nR\n\n\u0010\n\ns, μ\n\n2\n\n, μ2expt\n\n\u0011\n\n\"\n\ne2 1\ns\ne2 (μ2 )\nlog 2 log 2 2\n−1\n≈ f2\n8π c\nm\ne (μexpt m2 /s)\n\n\n\n\n!\n\nnf\nμ2expt\ne2 (μ2expt m2 /s)\n1 e2 X\n1\n2 j\n1 −\n\nQ\nN\nlog\n+ 2 log\nc\ne2 (μ2expt )\n3 4π 2 j=1 j C\nm2j\n\nm2\ns\n− log 2 + log 2\nμ\nμexpt\n2\n\n#\n\n(32)\n\nPn\n\nf\ne\n2 j\nwhere again c = − 31 4π\n2\nj=1 Qj NC . This concludes the discussion of SL-RG effects in\nQCD. As a side remark we mention that for scalar quarks, the same function appears\nas for fermions since the DL-phase space for both cases is identical. Only β0 differs in\neach case.\n\n3\n\nElectroweak RG corrections\n\nWe now turn to the case of spontaneously broken gauge theories. As in the previous\nsection, we are interested only in terms of SL-accuracy. At one loop, these are the\n12\n\n\fobvious RG corrections from the running couplings as discussed in Refs. [10, 8, 9].\nAt higher orders, we have the same situation as in QCD that the RG corrections are\nfolded into loops which on a lower order lead to DL contributions. We begin with a\nsummary of the known higher order DL and SL corrections.\n\n3.1\n\nSubleading electroweak Sudakov corrections to all orders\n\nIn this section we are going to discuss the higher order Sudakov corrections in the\nelectroweak theory. While the method discussed below is general, for definiteness we\nconsider only the SM. The framework we use in the following is given by the infrared\nevolution equation (IREE) method. The basic physical idea behind this framework is to\nidentify the effective high energy theory at values of k⊥ ≫ μ ≥ M. The corresponding\ncontribution from QED below the scale M is then given by appropriate matching\nconditions at μ = M in order to recover the high energy theory solution. In this way\nall universal Sudakov DL and SL have been resummed in Refs. [5, 8, 9]. At one loop\nthe results obtained by the IREE method agree with the literature for all external\nlines and at two loops, the DL-results were checked by explicit calculations with the\nphysical SM fields [12, 13, 14]. Including soft bremsstrahlung with a cut on the allowed\nk⊥ ≤ μexpt ≤ M of the emitted real photons, and regularizing virtual IR divergences\nwith a cutoff k⊥ ≥ μ, we find for the semi-inclusive cross section1 :\ndσ(p1 , . . . , pn , g, g ′, μexp) = dσBorn (p1 , . . . , pn , g, g ′)\n(\n\n× exp −\n\"\n\n× exp −\n−\n\nng\nX\n\n2\n\nWgi (s, M ) −\n\ni=1\nnf \u0010\n\nX\ni=1\nnγ\n\nX\ni=1\n\nnf\nX\ni=1\n\n2\n\nWfi (s, M ) −\n\u0011\n\nwfi (s, μ2) − wfi (s, M 2 ) −\n#\n\n\u0010\n\nnφ\nX\n\nWφi (s, M )\n\ni=1\n\nnw \u0010\nX\ni=1\n\n2\n\n)\n\nwwi (s, μ2) − wwi (s, M 2 )\n\nwγi (M 2 , m2j ) × exp wγexpt (s, mi , μ, μexpt )\n\n\u0011\n\n\u0011\n\n(33)\n\nwhere ng denotes the number of transversely polarized gauge bosons and nf the number\nof external fermions. This expression omits all RG corrections, even at the one loop\nlevel. The functions W and w correspond to the logarithmic probability to emit a soft\nand/or collinear particle per line, where the capital letters denote the probability in\nthe high energy effective theory and the lower case letter the corresponding one from\npure QED corrections below the weak scale. The matching condition is implemented\n1\n\nWe emphasize that for photon and Z-boson final states the mixing effects have to be included\ncorrectly as described in Ref. [8]. In particular, for transverse degrees of freedom the corrections\ndon't factorize with respect to the physical Born amplitude but rather with respect to the amplitudes\ncontaining the fields in the broken phase. For longitudinally polarized Z-bosons, however, there is no\nmixing with photons and the corrections factorize with respect to the Born amplitude.\n\n13\n\n\fsuch that for μ = M only the high energy solution remains. For the contribution from\nscalar fields φ = {φ± , χ, H} above the scale M we have\nα\nWφi (s, M ) =\n4π\n2\n\n\"\n\nY2\nTi (Ti + 1) + tan θw i\n4\n#\n2\n3 mt\ns\n+\nlog 2\n2\n2M\nmt\n2\n\n!\u0012\n\ns\ns\nlog\n− 4 log 2\n2\nM\nM\n2\n\n\u0013\n\n(34)\n\nwhere α = g 2 /4π and tan2 θw = α′ /α. The last term is written as a logarithm containing the top quark mass mt rather than the weak scale M since these terms always\ncontain mt as the heaviest mass in the loop correction [9]. For fermions we have:\n\"\n\n!\u0012\n\n\u0013\n\ns\nY2\nα\ns\nTi (Ti + 1) + tan2 θw i\nlog2 2 − 3 log 2\nWfi (s, M ) =\n4π\n4\nM\nM\n#\n!\nm2f ′\n1 + δf,R m2f\ns\n+\n+\nδ\nlog 2\nf,L\n2\n2\n4\nM\n4M\nmt\n2\n\n(35)\n\nwhere f ′ denotes the weak isospin partner of f . For external transversely polarized\ngauge bosons:\n\u0013 !\n\n\u0012\n\ns\nα ′ Yi 2\nα\nlog2 2\nTi (Ti + 1) +\nWgi (s, M ) =\n4π\n4π 2\nM\n!\n′\nα\ns\nα\n− δi,W β0 + δi,B β0′ log 2\nπ\nπ\nM\n2\n\n(36)\n\nwith\n\n1\n1\n5\n1\n11\nCA − ngen − nh , β0′ = − ngen − nh\n(37)\n12\n3\n24\n9\n24\nwhere ngen denotes the number of fermion generations and nh the number of Higgs\ndoublets. Again we note that for external photon and Z-boson states we must include the mixing appropriately as discussed in Ref. [8]. For the terms entering from\ncontributions below the weak scale we have for fermions:\nβ0 =\n\n\n\n\n\n\n\n\n\nwfi (s, μ2 ) = \n\n\n\n\n\n\ne2i\n(4π)2\ne2i\n(4π)2\n\n\u0010\n\nlog2\n\n\u0014\u0012\n\ns\nμ2\n\n− 3 log μs2\n\u0013\n\n\u0011\n\nlog ms2 − 1 2 log\ni\n\n+ log2\n\ns\nm2i\n\n,\nm2i\nμ2\n\n− 3 log ms2\ni\n\n\u0015\n\nmi ≪ μ\n(38)\n\n,\n\nμ ≪ mi\n\nAnalogously, for external W-bosons and photons we find:\ne2i\nwwi (s, μ ) =\n(4π)2\n2\n\n\"\u0012\n\n\u0013\n\ns\ns\nM2\nlog 2 − 1 2 log 2 + log2 2\nM\nμ\nM\n14\n\n#\n\n(39)\n\n\fwγi (M 2 , μ2 ) =\n\n\n\n\n\n\n\nPnf\n\ne2j\nj\nj=1 4π 2 NC\nPnf e2j\nj\nj=1 4π 2 NC\n\n1\n3\n1\n3\n\nlog M\nμ2\n\n2\n\n,\n\nM2\n\n,\n\nlog\n\nm2j\n\nmj ≪ μ\n\n(40)\n\nμ ≪ mj\n\nfor the virtual corrections. For real photon emission we have in the soft photon approximation:\n\nwγexpt (s, mi , μ, μexpt ) =\n\n\n\u0014\n\u0015\nPn\ne2i\n\n2 s\n2 s\ns\n\n−\n3\nlog\n+\nlog\n−\nlog\n\n\ni=1 (4π)2\nμ2expt\nμ2\nμ2\n\n\n\u0013\n\u0014\u0012\n P\n2\n2\nm\nei\nn\nlog ms2 − 1 2 log μ2i + log2 ms2\ni=1 (4π)2\n\ni\ni\n\n\u0013\u0015\n\u0012\n\n\n\ns\ns\n\n −2 log μ2\nlog m2 − 1\nexpt\n\ni\n\n, mi ≪ μ\n(41)\n, μ ≪ mi\n\nwhere n is the number of external lines and the upper case applies only to fermions\nsince for W ± we have μ < M. Note that in all contributions from the regime μ < M\nwe have kept mass terms inside the logarithms.\n\u0011This approach is valid in the entire\n\u0010\nmt\nStandard Model up to terms of order O log M . The overall μ-dependence in the\nsemi-inclusive cross section cancels and we only have a dependence on the parameter\nμexpt related to the experimental energy resolution. All universal electroweak Sudakov\ncorrections at DL and SL level exponentiate.\n\n3.2\n\nRenormalization group improvement\n\nThe way to implement the SL-RG corrections is clear from the discussion in section 2.\nAt high energies, the DL phase space is essentially described by an unbroken SU(2) ×\nU(1) theory in which we can calculate the high energy contributions. In this regime,\nall particle masses can be neglected and we have to consider the following virtual\nelectroweak DL phase space integral with running couplings in each gauge group:\n\u0010\n\nf RG s, μ2\nW\niV\n\n\u0011\n\n=\n\n1\n2π\n\nZ\n\ndk2⊥\n2\nμ2 k⊥\ns\n\nZ\n\n1\n\nk\n\n2\n⊥ /s\n\n(\n\n\n\nT\n\n2\n\n\n\n\n(Yi2 /4)α′ (μ2 ) \n\ndv\ni (Ti + 1)α(μ )\n+\n2\n2\n\nv \n 1 + c log k⊥\n′ log k⊥ \n1\n+\nc\n2\n2\nμ\nμ\n!\n\n)\n\nα(μ2 )Ti (Ti + 1) 1\nα(μ2 )\ns\n1\nα(μ2 )\n=\nlog 2 log\n− 1 + 2 log\n2π\nc\nμ\nα(s)\nc\nα(s)\n(\n)\n!\nα′ (μ2 )\ns\n1\nα′ (μ2 )\nα′ (μ2 )Yi2 1\n(42)\nlog 2 log ′\n− 1 + ′ 2 log ′\n+\n8π\nc′\nμ\nα (s)\nα (s)\nc\n\nwhere α(μ2 ) = g 2 (μ2 )/4π, α′ (μ2 ) = g ′2 (μ2 )/4π, c = α(μ2 )β0 /π and analogously, c′ =\nα′ (μ2 )β0′ /π. In each case, the correct non-Abelian or Abelian limit is reproduced by\nletting the corresponding couplings of the other gauge group approach zero. In this\nway it is easy to see that the argument of the running couplings can only be what\nappears in Eq. (42).\n15\n\n\fThe form of Eq. (42) is valid for fermions, transversely and longitudinally polarized\nexternal lines but (omitted) subleading terms as well as the quantum numbers of the\nweak isospin Ti and the weak hypercharge Yi differ. In order to implement the missing\nsoft photon contribution, we choose the analogous form of solution in Eq. (32) and\nhave to implement it in such a way that for μ = M Eq. (42) is obtained. The full\nresult for the respective semi-inclusive cross sections is then given by:\ndσ RG (p1 , . . . , pn , g, g ′, μexp) = dσBorn (p1 , . . . , pn , g(s), g ′(s))\n(\n\n× exp −\n\"\n\n× exp −\n−\n\nng\nX\n\nWgRG\n(s, M 2 )\ni\n\ni=1\nnf \u0010\n\nX\ni=1\nnγ\n\nX\ni=1\n\n−\n\nnf\nX\n\nWfRG\n(s, M 2 )\ni\n\ni=1\n\n\u0011\n\nwfRG\n(s, μ2 ) − wfRG\n(s, M 2 ) −\ni\ni\n\nwγi (M\n\n2\n\n, m2j )\n\n#\n\n\u0010\n\n−\n\nnφ\nX\n\nWφRG\n(s, M 2 )\ni\n\ni=1\nn\nw\n\u0010\nX\nwwRG\n(s, μ2 )\ni\ni=1\n\n(s, mi , μ, μexpt )\n× exp wγRG\nexpt\n\n\u0011\n\n)\n\n− wwRG\n(s, M 2 )\ni\n\n\u0011\n\n(43)\n\nwhere nf denotes here again the number of external fermions. The argument of the\ngauge couplings in the Born cross section indicate the one loop renormalization of the\ncouplings which is not included in the exponential expressions but which at one loop\nis genuinely subleading:\n!\n\ns\nα(M 2 )\nlog 2\nα(s) = α(M 2 ) 1 − β0\nπ\nM\n!\n′\n2\ns\n′\n′\n2\n′ α (M )\nα (s) = α (M ) 1 − β0\nlog 2\nπ\nM\n\n(44)\n(45)\n\nwhere α(M 2 ) = e2 (M 2 )/4πs2w and α′ (M 2 ) = e2 (M 2 )/4πc2w with\n\n\n\n\nnf\nM2 \n1 e2 X\n2 j\n2\n2\n2\nlog\nQ\nN\ne (M ) = e 1 +\n3 4π 2 j=1 j C\nm2j\n\n(46)\n\nand e2 /4π = 1/137. If there are non-suppressed mass ratios in the Born term, also\nthese terms need to be renormalized at one loop (see Ref. [10]). Higher order mass\nrenormalization terms would then be sub-subleading. The function WφRG\n(s, M 2 ) is\ni\ngiven by\n(\n\nα(M 2 )Ti (Ti + 1)\n2π\n(\nα′ (M 2 )Yi2 1\ns\n+\nlog 2\n′\n8π\nc\nM\n\"\n2\nα(M )\nTi (Ti + 1) +\n−\n4π\n\nWφRG\n(s, M 2 ) =\ni\n\n!\n\n)\n\nα(M 2 )\ns\n1\nα(M 2 )\n1\nlog 2 log\n− 1 + 2 log\nc\nM\nα(s)\nc\nα(s)\n)\n!\nα′ (M 2 )\nα′ (M 2 )\n1\nlog ′\n− 1 + ′ 2 log ′\nα (s)\nα (s)\nc\n!\n#\n′\n2\n2\ns\nα (M ) Yi\n3 α(M 2 ) m2t\ns\n4 log 2 −\nlog 2 (47)\n4π\n4\nM\n2 4π M 2\nmt\n16\n\n\fwhere we again have mt in the argument of the Yukawa enhanced correction [9]. Analogously for fermions we have:\nWfRG\n(s, M 2 )\ni\n\n(\n\n)\n\n!\n\nα(M 2 )\ns\n1\nα(M 2 )\nα(M 2 )Ti (Ti + 1) 1\nlog 2 log\n− 1 + 2 log\n=\n2π\nc\nM\nα(s)\nc\nα(s)\n(\n)\n!\n′\n2\n2\n′\n2\n′\nα (M )Yi 1\ns\nα (M )\n1\nα (M 2 )\n+\nlog 2 log ′\n− 1 + ′ 2 log ′\n8π\nc′\nM\nα (s)\nα (s)\nc\n!\n\"\ns\nα′ (M 2 ) Yi2\nα(M 2 )\n3 log 2\nTi (Ti + 1) +\n−\n4π\n4π\n4\nM\n#\n!\n2\n2\n2\nmf ′\nα(M ) 1 + δf,R mf\ns\n(48)\n−\n+ δf,L\nlog 2\n4π\n4\nM2\n4M 2\nmt\n\nThe last term contributes only for left handed bottom and for top quarks as mentioned\nabove and f ′ denotes the corresponding isospin partner for left handed fermions.\n(\n\n)\n\n!\n\nα(M 2 )Ti (Ti + 1) 1\nα(M 2 )\ns\n1\nα(M 2 )\n=\nlog 2 log\n− 1 + 2 log\n2π\nc\nM\nα(s)\nc\nα(s)\n(\n)\n!\nα′ (M 2 )\ns\n1\nα′ (M 2 )\nα′ (M 2 )Yi2 1\nlog\nlog\n−\n1\n+\nlog\n+\n8π\nc′\nM2\nα′ (s)\nα′ (s)\nc′ 2\n!\nα(M 2 )\nα′ (M 2 ) ′\ns\n− δi,W\nβ0 + δi,B\nβ0 log 2\n(49)\nπ\nπ\nM\nWgRG\n(s, M 2 )\ni\n\nAgain we note that for external photon and Z-boson states we must include the mixing\nappropriately as discussed in Ref. [8]. For the terms entering from contributions below\nthe weak scale we have for fermions:\n 2 n\nei\n1\n\nlog\n\n\n8π 2 c n\n\n\n2\ne\n\ns\nμ2\n\n\u0010\n\n2\n\n2\n\n\u0011\n\nlog ee2(μ(s)) − 1 +\n\u0010\n\n1\n2\n\u0011c\n\n2\n\n2\n\nlog ee2(μ(s)) − 23 log μs2\n\n2 2\n2\n2\nlog ms2 log ee2(μ(s)) − 1 − 23 log ms2 − log m\n= 8πi2\n2\nwfRG\n(s,\nμ\n)=\nμ\ni\n\u0013\u001b\n\u0012\n\n\n2\n2\n2\n2 Pnf\n\n\n + 12 log e 2(m ) 1 − 1 e 2 j=1\nQ2j NCj log m\nc\ne (s)\n3 4π\nm2j\n\n1\nc\n\n2\n\ne\nwhere c = − 31 4π\n2\nfind:\n\nPnf\n\nj=1\n\nwwRG\n(s, μ2)\ni\n\no\n\n, mi ≪ μ\n(50)\n, μ ≪ mi\n\nQ2j NCj . Analogously, for external W-bosons and photons we\n\ne2i\n=\n8π 2\n\n(\n\n!\n\ne2 (μ2 )\n1\ns\nM2\nlog 2 log 2\n− 1 − log 2\nc\nM\ne (s)\nμ\n\n\nn\n\n(51)\n\n\nf\n1 e2 X\nM 2 \ne2 (M 2 ) \n1\n2 j\n1−\nQ\nN\nlog\n+ 2 log 2\nc\ne (s)\n3 4π 2 j=1 j C\nm2j \n\n2\n\n2\n\nwγi (M , μ ) =\n\n\n\n\n\n\n\n1\n3\n1\n3\n\nPnf\n\ne2j\nj\nj=1 4π 2 NC\nPnf e2j\nj\nj=1 4π 2 NC\n\n17\n\nlog M\nμ2\n\n2\n\n,\n\nM2\n\n,\n\nlog\n\nm2j\n\nmj ≪ μ\nμ ≪ mj\n\n(52)\n\n(53)\n\n\fNote that the function wγi (M 2 , μ2 ) does not receive any RG corrections to the order\nwe are working since it contains only SL terms. For the virtual corrections and for real\nphoton emission we have in the soft photon approximation:\n\nwγRG\n(s, mi , μ, μexpt ) =\nexpt\n\n\n\u0013\n\u001a\n\u0012\nPn e2i\nμ2expt\n\ne2 (μ2 )\ns\n1\n1\n\nlog\n−\n1\n−\nlog\nlog\n\n2\n2\n2\n2\n\ni=1 8π\nc\nμ\ne (μexpt )\nc\ns\n\n\n\u001b\n\n\n2 (μ2 )\n\ne\n\n, mi ≪ μ\n+ c12 log e2 (μ2 ) − 32 log μs2\n\n\n\n\n\u001a expt\n\u0012\n\u0013\n P\n2 2\ne2i\nn\n1\nlog ms2 log e2 (μe2 (μm)2 /s) − 1\ni=1 8π 2\nc\n\nexpt\n\n\u0013\n\u0012\n\n\nμ2expt\ne2 (μ2expt m2 /s)\n\n1 e2 Pnf\n1\n2 j\n\n1 − 3 4π2 j=1 Qj NC log m2\n+ c2 log e2 (μ2 )\n\n\n\nexpt\nj\n\n\u001b\n\n\n\ns\nm2\n\n, μ ≪ mi\n − log μ2 + log μ2\nexpt\n\n(54)\n\nwhere n is the number of external lines and nf fermions propagating in the loops folded\nwith the DL integrals. The upper case applies only to fermions since for W ± we have\nμ < M. Note that in all contributions from the regime μ < M we have kept mass\nterms inside the logarithms. For the running above the weak scale M we use only the\nmassless β0 , β0′ terms with ngen\n\u0010 = 3.\u0011 This approach is valid in the entire Standard\nt\n.\nModel up to terms of order O log m\nM\n\n4\n\nDiscussion\n\nIn this section we discuss briefly the size of the SL-RG corrections obtained in section 3.\nFor this purpose we will only compare the √\nterms which are new in the present analysis,\ni.e. the running from the weak scale M to s. We are thus interested in effects starting\nat the two loop level and want to compare the relative size of the RG-improved form\nfactors to the pure\u0011 Sudakov terms. It is therefore of interest to compare the ratios\n\u0010\nRG\nRG\ne{−Wi } − e{−Wi } /e{−Wi } for the various particle labels i. Since the physical scales\n√\nin the problem are given by M and s, the lower and upper limits of the couplings\nare given accordingly by these scales for the functions Wi . Fig. 3 compares the\nrespective ratios for various SM particles. For definiteness we take M = 80 GeV,\nmt = 175 GeV, s2w = 0.23, α(M 2 ) = 1/128/s2w , α′ (M 2 ) = 1/128/c2w , β0 = 19/24\nand β0′ = −41/24. The difference between the curves using M 2 and those using s\nas the scales in the conventional Sudakov form factors is a measure of the inherent\nscale uncertainty which is removed by the RG-improved Sudakov form factors WiRG .\nThe largest effect is obtained in the gauge boson sector. For external {φ+ , φ− , χ, H}\nparticles we have at 1 TeV a difference between the curves of about 0.3% per line on\nthe level of the cross section, growing to 0.5% at 2 TeV. The situation is very similar\nfor transversely polarized W + , W − particles where it reaches about 0.35% at 1 TeV\nand 0.6% at 2 TeV per line on the cross section level. For left handed quarks of the\n18\n\n\fRG\n\nRG\n\n(exp{-Wi } - exp{-Wi }) / exp{-Wi }\n0.01\n\n0.003\n0.002\n\n0.008\n\n0.001\n\n0.006\n\n0\n\n+\n\n0.004\n\n-\n\ni={φ ,φ ,χ,H}\n\n-0.001\n\n+\n\n-\n\ni={WT,WT}\n\n0.002\n\n-0.002\n0\n\n-0.003\n\n-0.002\n\n-0.004\n\n-0.004\n\n-0.005\n1000\nx 10\n\n2000\n\n3000\n\n4000\n\n5000\n\n√s\n\n-2\n\n1000\nx 10\n\n0.35\n\n0\n\n0.3\n\n-0.02\n\n0.25\n\n2000\n\n3000\n\n4000\n\n5000\n\n4000\n\n5000\n\n√s\n\n-2\n\n-0.04\n\n0.2\n\n-0.06\n\n0.15\n\ni={tR}\n\n-0.08\n\ni={tL,bL}\n\n0.1\n0.05\n\n-0.1\n\n0\n\n-0.12\n\n-0.05\n\n-0.14\n\n-0.1\n\n-0.16\n\n-0.15\n1000\n\n2000\n\n3000\n\n4000\n\n5000\n\n1000\n\n: α(M ) , α (M )\n2\n\n,\n\n2000\n\n3000\n\n: α(s) , α (s)\n\n2\n\n,\n\nFigure 3: This figure compares the renormalization group improved probabilities WiRG\nwith the conventional Sudakov exponentials Wi for various external particle lines. The\ncomparison is made with the indicated scale choices for\n√ the functions Wi and takes into\naccount only the RG corrections from the scale M to s. Taking the difference between\nthe two curves is a measure of the uncertainty removed in this work. The variations\nin the scale of the coupling in the Wi functions is largest in the scalar (Goldstone and\nHiggs boson) sector and for transverse W ± where the effect is about 0.6% at 2 TeV\nper line on the level of the cross section. In general, the RG improved form factors\ndiffer by fractions of one percent per line and need to be taken into account at future\ncolliders if the experimental accuracy is in the percentile regime.\n19\n\n\fthird generation the size of the corrections is about 0.125% at 1 TeV per line on the\nlevel of the cross section and 0.25% at 2 TeV. These corrections are thus considerably\nsmaller and only needed if precisions below the one percent level are necessary from\nthe theory side. For right handed top quarks the effect is even smaller since only the\nrunning of α′ enters and it is thus negligible for most applications. The form of the two\ncurves in case of right handed tops differs markedly from the other three cases because\nat the energies displayed, the dominant effect is actually due to subleading Yukawa\nenhanced corrections (∼ α) since the DL terms are proportional to α′ and since the\n√\nratio m2t /M 2 is of the size of an additional logarithm for these values of s.\nIn general it can be seen that-where the DL terms dominate-the renormalization\ngroup improved results are indeed in-between the upper and lower bounds given by\nthe respective scale choices in the conventional Sudakov form factors. Indeed also for\nright handed top quarks this pattern is observed if only DL corrections are taken into\naccount.\nIt should be emphasized again that also the QED-RG corrections can be sizable\nsince large mass ratios with light particles occur. These should of course also be\nimplemented in a full SM prediction at TeV energies.\n\n5\n\nConclusions\n\nIn this paper we have obtained the complete subleading electroweak renormalization\ngroup corrections to all orders in high energy processes in the framework of the infrared\nevolution equation (IREE) method. These are terms originating in loops which at a\nlower loop order lead to DL corrections and are of the type αn β0 log2n−1 Ms 2 . We\nhave derived the corrections for massless as well as massive gauge theories and used\nappropriate matching conditions to obtain the full SM contributions. These corrections\nstart at the two loop level and are universal, i.e. properties of external lines and thus\nprocess independent. They represent the last missing universal contribution needed\nfor a full SL-analysis at the two loop level. The size of the effect at TeV energies is in\ngeneral a fraction of one percent and is largest in the scalar and gauge boson sector,\nwhere at 2 TeV the uncertainty in the conventional Sudakov form factor is about 0.6%\nper line at the level of the cross section. These effects cannot be neglected at TeV\nlinear colliders for precision measurements in the percentile regime.\nThe last outstanding type of SL-correction at the two loop level is given by the\nnon-universal, process dependent angular terms of the type αn log2n−1 Ms 2 log ut . These\nterms also don't factorize with respect to the Born cross amplitude and the high\nprecision objectives of future linear colliders will make at least a two loop analysis of\nthese corrections mandatory.\n\n20\n\n\fAcknowledgments\nI would like to thank A. Denner for carefully reading the manuscript.\n\nReferences\n[1] M. Ciafaloni, P. Ciafaloni, D. Comelli; Phys. Rev. Lett. 84 (2000) 4810.\n[2] M.M. Mühlleitner, M. Kramer, M. Spira, P.M. Zerwas; DESY-00-192,\nEDINBURGH-2000-31, PM-00-45, PSI-PR-00-19, hep-ph/0101083.\n[3] I.F. Ginzburg, M. Krawczyk, P. Osland. IFT-2000-21, hep-ph/0101208.\n[4] M. Melles, W.J. Stirling, V.A. Khoze, Phys. Rev. D61 (2000) 054015.\n[5] V.S. Fadin, L.N. Lipatov, A.D. Martin, M. Melles; Phys. Rev. D61 (2000)\n094002.\n[6] V. N. Gribov, Yad. Fiz. 5 (1967) 399 (Sov. J. Nucl. Phys. 5 (1967) 280); Sov. J.\nNucl. Phys. 12 (1971) 543;\nL. N. Lipatov, Nucl. Phys. B307 (1988) 705;\nV. Del Duca, Nucl. Phys. B345 (1990) 369.\n[7] R. Kirschner, L. N. Lipatov; JETP 83 (1982) 488; Phys. Rev. D26 (1982) 1202.\n[8] M. Melles; Phys. Rev. D63 (2001) 034003.\n[9] M. Melles; hep-ph/0012157.\n[10] A. Denner, S. Pozzorini; PSI-PR-00-15, hep-ph/0010201.\n[11] W. Beenakker, A. Denner, S. Dittmaier, R. Mertig, T. Sack; Nucl. Phys. B410\n(1993) 245.\n[12] M. Melles; Phys. Lett. B495 (2000) 81.\n[13] W. Beenakker, A. Werthenbach; Phys. Lett. B489 (2000) 148.\n[14] M. Hori, H. Kawamura, J. Kodaira; Phys. Lett. B491 (2000) 275.\n[15] J.H. Kühn, A.A. Penin, V.A. Smirnov; Eur. Phys. J. C17 (2000) 97.\n[16] S.J. Brodsky, SLAC-PUB-2447 (1979), unpublished.\n[17] Yu.L. Dokshitzer, D.I. Dyakonov, S.I. Troyan, Phys. Lett. 78 B, (1978) 290;\n79B, (1978) 269 and Phys. Rept. 58, No. 5, (1980) 269.\n21\n\n\f[18] A.B. Carter, C.H. Llewellyn Smith, Nucl. Phys. B162, (1980) 397.\n[19] S. Catani; Phys. Lett. B427 (1998) 161.\n[20] G.J.H. Burgers; Phys. Lett. B164 (1985) 167.\n[21] M. Melles, W.J. Stirling; Nucl. Phys. B564 (2000) 325.\n[22] J. Collins, Renormalisation (Cambridge University Press, Cambridge, England,\n1984).\n[23] M. Melles; Phys. Rev. D60 (1999) 075009.\n\n22\n\n\f"}