{"id": "http://arxiv.org/abs/hep-th/0310227v3", "guidislink": true, "updated": "2003-12-21T04:08:44Z", "updated_parsed": [2003, 12, 21, 4, 8, 44, 6, 355, 0], "published": "2003-10-24T06:44:20Z", "published_parsed": [2003, 10, 24, 6, 44, 20, 4, 297, 0], "title": "Light-Front Hadron Dynamics and AdS/CFT Correspondence", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-th%2F0310274%2Chep-th%2F0310058%2Chep-th%2F0310156%2Chep-th%2F0310050%2Chep-th%2F0310113%2Chep-th%2F0310273%2Chep-th%2F0310265%2Chep-th%2F0310194%2Chep-th%2F0310219%2Chep-th%2F0310097%2Chep-th%2F0310069%2Chep-th%2F0310139%2Chep-th%2F0310230%2Chep-th%2F0310083%2Chep-th%2F0310003%2Chep-th%2F0310279%2Chep-th%2F0310136%2Chep-th%2F0310141%2Chep-th%2F0310202%2Chep-th%2F0310051%2Chep-th%2F0310272%2Chep-th%2F0310174%2Chep-th%2F0310091%2Chep-th%2F0310060%2Chep-th%2F0310238%2Chep-th%2F0310259%2Chep-th%2F0310035%2Chep-th%2F0310145%2Chep-th%2F0310254%2Chep-th%2F0310198%2Chep-th%2F0310170%2Chep-th%2F0310126%2Chep-th%2F0310266%2Chep-th%2F0310161%2Chep-th%2F0310212%2Chep-th%2F0310020%2Chep-th%2F0310285%2Chep-th%2F0310253%2Chep-th%2F0310075%2Chep-th%2F0310275%2Chep-th%2F0310189%2Chep-th%2F0310296%2Chep-th%2F0310251%2Chep-th%2F0310262%2Chep-th%2F0310029%2Chep-th%2F0310147%2Chep-th%2F0310088%2Chep-th%2F0310045%2Chep-th%2F0310076%2Chep-th%2F0310129%2Chep-th%2F0310025%2Chep-th%2F0310240%2Chep-th%2F0310103%2Chep-th%2F0310063%2Chep-th%2F0310094%2Chep-th%2F0310014%2Chep-th%2F0310213%2Chep-th%2F0310199%2Chep-th%2F0310071%2Chep-th%2F0310236%2Chep-th%2F0310177%2Chep-th%2F0310106%2Chep-th%2F0310055%2Chep-th%2F0310277%2Chep-th%2F0310187%2Chep-th%2F0310042%2Chep-th%2F0310119%2Chep-th%2F0310087%2Chep-th%2F0310178%2Chep-th%2F0310056%2Chep-th%2F0310001%2Chep-th%2F0310128%2Chep-th%2F0310227%2Chep-th%2F0310067%2Chep-th%2F0310104%2Chep-th%2F0310131%2Chep-th%2F0310164%2Chep-th%2F0310208%2Chep-th%2F0310117%2Chep-th%2F0310224%2Chep-th%2F0310090%2Chep-th%2F0310005%2Chep-th%2F0310210%2Chep-th%2F0310205%2Chep-th%2F0310040%2Chep-th%2F0310301%2Chep-th%2F0310057%2Chep-th%2F0310183%2Chep-th%2F0310223%2Chep-th%2F0310191%2Chep-th%2F0310152%2Chep-th%2F0310039%2Chep-th%2F0310024%2Chep-th%2F0310278%2Chep-th%2F0310160%2Chep-th%2F0310140%2Chep-th%2F0310077%2Chep-th%2F0310144%2Chep-th%2F0310246%2Chep-th%2F0310176%2Chep-th%2F0310061&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Light-Front Hadron Dynamics and AdS/CFT Correspondence"}, "summary": "A remarkable consequence of the AdS/CFT correspondence is the nonperturbative\nderivation of dimensional counting rules for hard scattering processes. Using\nstring/gauge duality we derive the QCD power behavior of light-front Fock-state\nhadronic wavefunctions for hard scattering in the large-$r$ region of the AdS\nspace from the conformal isometries which determine the scaling of string\nstates as we approach the boundary from the interior of AdS space. The\nnonperturbative scaling results are obtained for spin-zero and spin-$\\half$\nhadrons and are extended to include the orbital angular momentum dependence of\nthe constituents in the light-front Fock-expansion. The correspondence with\nstring states is considered for hadronic states of arbitrary orbital angular\nmomentum for a given hadron of spin $\\leq 2$. We examine the implications of\nthe color configuration of hadronic Fock-states for the QCD structure of\nscattering amplitudes at large $N_C$. Quark interchange amplitudes emerge as\nthe dominant large $N_C$ scattering mechanisms for conformal QCD.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-th%2F0310274%2Chep-th%2F0310058%2Chep-th%2F0310156%2Chep-th%2F0310050%2Chep-th%2F0310113%2Chep-th%2F0310273%2Chep-th%2F0310265%2Chep-th%2F0310194%2Chep-th%2F0310219%2Chep-th%2F0310097%2Chep-th%2F0310069%2Chep-th%2F0310139%2Chep-th%2F0310230%2Chep-th%2F0310083%2Chep-th%2F0310003%2Chep-th%2F0310279%2Chep-th%2F0310136%2Chep-th%2F0310141%2Chep-th%2F0310202%2Chep-th%2F0310051%2Chep-th%2F0310272%2Chep-th%2F0310174%2Chep-th%2F0310091%2Chep-th%2F0310060%2Chep-th%2F0310238%2Chep-th%2F0310259%2Chep-th%2F0310035%2Chep-th%2F0310145%2Chep-th%2F0310254%2Chep-th%2F0310198%2Chep-th%2F0310170%2Chep-th%2F0310126%2Chep-th%2F0310266%2Chep-th%2F0310161%2Chep-th%2F0310212%2Chep-th%2F0310020%2Chep-th%2F0310285%2Chep-th%2F0310253%2Chep-th%2F0310075%2Chep-th%2F0310275%2Chep-th%2F0310189%2Chep-th%2F0310296%2Chep-th%2F0310251%2Chep-th%2F0310262%2Chep-th%2F0310029%2Chep-th%2F0310147%2Chep-th%2F0310088%2Chep-th%2F0310045%2Chep-th%2F0310076%2Chep-th%2F0310129%2Chep-th%2F0310025%2Chep-th%2F0310240%2Chep-th%2F0310103%2Chep-th%2F0310063%2Chep-th%2F0310094%2Chep-th%2F0310014%2Chep-th%2F0310213%2Chep-th%2F0310199%2Chep-th%2F0310071%2Chep-th%2F0310236%2Chep-th%2F0310177%2Chep-th%2F0310106%2Chep-th%2F0310055%2Chep-th%2F0310277%2Chep-th%2F0310187%2Chep-th%2F0310042%2Chep-th%2F0310119%2Chep-th%2F0310087%2Chep-th%2F0310178%2Chep-th%2F0310056%2Chep-th%2F0310001%2Chep-th%2F0310128%2Chep-th%2F0310227%2Chep-th%2F0310067%2Chep-th%2F0310104%2Chep-th%2F0310131%2Chep-th%2F0310164%2Chep-th%2F0310208%2Chep-th%2F0310117%2Chep-th%2F0310224%2Chep-th%2F0310090%2Chep-th%2F0310005%2Chep-th%2F0310210%2Chep-th%2F0310205%2Chep-th%2F0310040%2Chep-th%2F0310301%2Chep-th%2F0310057%2Chep-th%2F0310183%2Chep-th%2F0310223%2Chep-th%2F0310191%2Chep-th%2F0310152%2Chep-th%2F0310039%2Chep-th%2F0310024%2Chep-th%2F0310278%2Chep-th%2F0310160%2Chep-th%2F0310140%2Chep-th%2F0310077%2Chep-th%2F0310144%2Chep-th%2F0310246%2Chep-th%2F0310176%2Chep-th%2F0310061&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A remarkable consequence of the AdS/CFT correspondence is the nonperturbative\nderivation of dimensional counting rules for hard scattering processes. Using\nstring/gauge duality we derive the QCD power behavior of light-front Fock-state\nhadronic wavefunctions for hard scattering in the large-$r$ region of the AdS\nspace from the conformal isometries which determine the scaling of string\nstates as we approach the boundary from the interior of AdS space. The\nnonperturbative scaling results are obtained for spin-zero and spin-$\\half$\nhadrons and are extended to include the orbital angular momentum dependence of\nthe constituents in the light-front Fock-expansion. The correspondence with\nstring states is considered for hadronic states of arbitrary orbital angular\nmomentum for a given hadron of spin $\\leq 2$. We examine the implications of\nthe color configuration of hadronic Fock-states for the QCD structure of\nscattering amplitudes at large $N_C$. Quark interchange amplitudes emerge as\nthe dominant large $N_C$ scattering mechanisms for conformal QCD."}, "authors": ["S. J. Brodsky", "G. F. de Teramond"], "author_detail": {"name": "G. F. de Teramond"}, "author": "G. F. de Teramond", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/j.physletb.2003.12.050", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/hep-th/0310227v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-th/0310227v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "LaTex, 21 pages. Additional references, corrected color factors, and\n  corrected Dirac conformal dimensions", "arxiv_primary_category": {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-th/0310227v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-th/0310227v3", "journal_reference": "Phys.Lett.B582:211-221,2004", "doi": "10.1016/j.physletb.2003.12.050", "fulltext": "SLAC-PUB-10200\nOctober 2003\n\nLight-Front Hadron Dynamics\n\narXiv:hep-th/0310227v3 21 Dec 2003\n\nand AdS/CFT Correspondence\nStanley J. Brodsky\n\n∗\n\n†\n\nStanford Linear Accelerator Center,\nStanford University, Stanford, California 94309, USA\nGuy F. de Téramond\n\n‡\n\nUniversidad de Costa Rica, San José, Costa Rica\n\nAbstract\nA remarkable consequence of the AdS/CFT correspondence is the nonperturbative derivation of dimensional counting rules for hard scattering processes.\nUsing string/gauge duality we derive the QCD power behavior of light-front\nFock-state hadronic wavefunctions for hard scattering in the large-r region of\nthe AdS space from the conformal isometries which determine the scaling of\nstring states as we approach the boundary from the interior of AdS space. The\nnonperturbative scaling results are obtained for spin-zero and spin- 12 hadrons\nand are extended to include the orbital angular momentum dependence of the\nconstituents in the light-front Fock-expansion. The correspondence with string\nstates is considered for hadronic states of arbitrary orbital angular momentum\nfor a given hadron of spin ≤ 2. We examine the implications of the color config-\n\nuration of hadronic Fock-states for the QCD structure of scattering amplitudes\nat large NC . Quark interchange amplitudes emerge as the dominant large NC\nscattering mechanisms for conformal QCD.\n\n∗\n\nWork partially supported by the Department of Energy, contract DE-AC03-76SF00515.\nE-mail: sjbth@slac.stanford.edu\n‡\nE-mail: gdt@asterix.crnet.cr\n†\n\n\fSince the early identification of large NC conformal QCD with the topological\nexpansion of a string [1], the connection between string theories and the large-NC\nlimit of field theories has drawn major attention. However, string theory is not\nconsistent in a four dimensional flat space, and at least one extra dimension has\nto be introduced [2]. It is only recently that a precise correspondence has been\nestablished between quantum field theories and string/M-theory on Anti-de Sitter\nspaces (AdS) [3], where strings live on the curved geometry of the AdS space and the\nobservables of the conformal field theory are defined in the boundary of AdS. The\npartition function of the AdS theory is identified with the generating functional of\nthe boundary conformal gauge field theory, and correlation functions are computed\nin the boundary of AdS where the quantum field theory operators are inserted [4, 5].\nThe AdS/CFT conjecture is indeed a concrete realization of the holographic principle\n[6, 7]. From the point of view of string theory/field theory duality, excitations near the\nboundary of the conformal AdS space correspond to states in the field theory. Hardscattering interactions occur in the large-r region of the AdS space, so effectively we\nrequire the 't Hooft parameter, the product of the string coupling and the number\nof colors gs NC , to be sufficiently large so that the AdS radius R = (4πgs NC )1/4 α′1/2 ,\nwith α′ the string scale, is also large. We can map the string states degrees of freedom\nto the QCD degrees of freedom at the boundary of the AdS space [8].\nA remarkable consequence of the AdS/CFT correspondence is the derivation [9]\nof dimensional counting rules for the leading power-law fall-off of hard exclusive processes [10, 11]. The derivation from supergravity/string theory in a AdS5 × X back-\n\nground does not rely on perturbation theory, and thus is more general than perturbative QCD analysis [12]. Classical QCD with massless quarks is conformal. Corrections from nonconformal effects in QCD due to the inverse logarithmic running of\nthe coupling are moderate in the ultraviolet region. Theoretical [13, 14, 15] and phenomenological [16, 17] evidence is now accumulating that the QCD coupling becomes\nconstant at small virtuality; i.e., αs (Q2 ) develops an infrared fixed point. Indeed,\nQCD appears to be a nearly-conformal theory in the momentum regimes accessible\nto experiment. The amplitudes of confining gauge theories with superstring duals, in\naddition to the power-law hard dependence at large momentum transfer, have Regge\nbehavior at small angles for different kinematic domains [9]. The String/Gauge du2\n\n\fality for QCD in four dimensions can also be obtained from M-theory in a specific\nBlack Hole deformation of AdS 7 × S 4 [18] with Regge behavior in the near-forward\n\nlimit [19]. The AdS/CFT correspondence for gauge theories with dual strings has\nbeen used to describe deep inelastic scattering [20], and the derivation of scaling\n\nlaws in hadronic processes has been considered for exclusive processes, form factors\nand structure functions [21].\nIn this paper counting rules for light-front wavefunctions, the probability amplitudes which relate the constituents degrees of freedom with the asymptotic hadronic\nstates, are obtained from the AdS/CFT correspondence for large momentum transfer\nprocesses as we approach the boundary of the AdS space. The nonperturbative scaling\nresults are obtained for spin-zero and spin- 12 hadrons. We are indeed limited to string\nstates dual to hadrons of spin 0, 21 , 1,\n\n3\n2\n\nand 2, since in string theory there are only\n\nfields of spin ≤ 2, and consequently all fields with higher spin have masses of order\nof the string scale (α′ )−1/2 . The counting rules for light-front wavefunctions are also\n\nextended to include the orbital angular momentum dependence of the constituents\nby computing the corresponding scaling dimension from the conformal algebra of the\ngenerators and their action on the field operators. We also discuss the AdS/CFT\nstring/gauge theory duality for Fock-states with orbital angular momentum by examining the Kaluza-Klein (KK) modes in the compact manifolds required to match\nthe 10-dimensional critical-strings. Our goal is to use the AdS/CFT correspondence\nto constrain the form of the light-front wavefunctions of hadrons in QCD in the phenomenologically interesting near-conformal regime. Consequently we will evaluate\nthe dual string theory at finite 't Hooft coupling gs NC and well defined values of λR,\nwhere λ is the characteristic energy of a KK excitation.\nIt is well known that the quark interchange amplitudes for fixed-angle exclusive\nprocesses constitute a dominant mechanism in the large 't Hooft limit [1] NC → ∞,\n\n2\n2\n∼ gs , large but fixed at some given\nkeeping the product gQCD\n(μ)NC , with gQCD\n\nscale μ. The quark interchange amplitudes are planar Feynman diagrams and are\nleading amplitudes in a 1/NC expansion, with other non-planar contributions being\nsuppressed by powers of 1/NC . This result is related to hadronic duality [23], since\nin the large NC limit quark-interchange amplitudes are topologically equivalent to\nduality diagrams which keep track of the flow of quark quantum numbers; they rep3\n\n\fresent string world-sheets with the quark lines defining the boundaries. There is also\na set of graphs corresponding to multiple gluon exchange, where the gluons are connected to the same quark at each hadron and are clearly planar. However, planarity\nis not sufficient to ensure that a diagram is leading in the 1/NC expansion. Multiple\ngluon exchange planar diagrams are also considered, and it is shown that they are\nsuppressed relative to quark interchange.\nThe quark interchange amplitude for meson-meson scattering scales as 1/NC while\nother contributions scale faster as NC → ∞. The case for baryons is more complicated\n\nsince the baryons have NC quarks in their valence state, and the usual description of\nbaryon elastic scattering [22] gives a result which diverges linearly with NC for quark\nexchange amplitudes. It will be shown below that if proper account is taken of the\ncolor configuration in the normalization of the Fock components, the antisymmetrization properties of the SU(NC ) baryon wave function leads to the same NC counting\nrules for baryon and meson states. This is quite satisfactory. For example, the sum\nof the photon attachments in a form factor should give the total charge independent\nof NC , regardless that we are describing a meson or a baryon. The string/field theory\nduality predictions for hard scattering correspond precisely to the NC → ∞ limit,\n\nwhich is also the large gS NC limit. For large transverse momentum the relevant scale\nis μ ∼ Q, and quark exchange interactions occur in the large-r conformal region of\n\nthe AdS space.\n\nIn QCD the Hilbert space is constructed in terms of a complete Fock basis of non\ninteracting constituents at fixed light-front time, where the amplitudes are n-parton\nlight-front wave functions ψn/h corresponding to the expansion of color singlet hadron\nstates\n|Ψh i =\n\nX\nn\n\nψn/h |ni.\n\n(1)\n\nThe light-front Fock-state wavefunction provides a frame-independent representation\nof relativistic composite systems in QCD at the amplitude level, in terms of quark\nand gluon degrees of freedom which carry the symmetries within the hadrons.\nAccording to the AdS/CFT correspondence, a quantum gravity theory in AdS\nspace defines a conformal field theory on its boundary [3], where a string state is\nrelated with its corresponding renormalized four-dimensional quantum field operator [4, 5]. We thus expect that for large values of the 't Hooft parameter gs NC ,\n4\n\n\fnear-conformal QCD has an effective dual string description. We will show that\nthe scaling properties of the n-parton light-front wave functions are obtained from\nthe string/gauge theory duality, and their power-law dependence follows from the\nconformal dimension of the corresponding string state dual to hadron states. The\nzero-mode states of strings can be treated classically, whereas the higher Fock components of Eq. (1) are a manifestation of the quantum fluctuations of QCD. Indeed,\nHilbert space is defined in the boundary theory and not within the interior of AdS\nspace. Since string theory predicts the scaling behavior of string states corresponding to different numbers of constituents, we can apply this information to the higher\nFock components of physical hadrons and their corresponding interpolating operators.\nThe correspondence is particularly useful for exclusive reactions at large momentum\nwhich are controlled by Fock components with a minimum number of constituents.\nWe will also examine the correspondence of hadron Fock states with non-zero orbital\nangular momentum and string states with Kaluza-Klein excitations in the compact\nspace X. In this case the discussion is more complex, since the dimensions of the\nstates are in general not protected from acquiring large values at strong coupling, and\nconsiderations about the chirality properties of states are important.\nTo conserve Poincaré invariance in four dimensional Minkowski space the metric\nshould have the form\nds2 = w(z)2 [dx2 − dz 2 ],\n\n(2)\n\nwhere dx2 = ημν dxμ dxν . Reparametrization invariance allows us to factor out the\nwarp factor w(z)2 . The coordinates xμ are Minkowski spacetime variables and z\nlabels the new spatial dimension. If the four-dimensional gauge theory is conformal,\nit is invariant under the transformation x → ρx. If z → ρz is also an isometry of\n\n(2), then w(z) = R/z and the space is a five-dimensional Anti-de Sitter space, AdS5 ,\n\nand the conformal group SO(2, 4) in Minkowski space is also the group of symmetries\nof AdS5 . The value z = 0 corresponds to the four-dimensional boundary where the\ngauge theory is defined. Introducing a radial coordinate r = R2 /z we can express the\nAdS5 metric (2) as\n\n\u0011\nr2 \u0010 2\nR2 2\n2\n−\ndt\n−\nd~\nx\ndr .\n(3)\nR2\nr2\nIf the conformal gauge theory is dual to a critical string, a superstring theory in 10\n\nds2 =\n\ndimensions, spacetime is the product space AdS5 with a five-dimensional manifold X.\n5\n\n\fIn the original Maldacena conjecture [3] a correspondence was established between\nType IIB string - a closed string with left-right asymmetric vibrational patterns compactified on AdS5 × S 5 , and N = 4 large NC superconformal Yang-Mills theory\n\nat the boundary, with the solution R = (4πgs NC )1/4 α′1/2 for the radius of AdS and\nthe radius of the five-sphere. The theory with maximal supersymmetry corresponds\nto the sphere.\nThe observables of the gauge theory are defined at the boundary of the AdS\nspace. The AdS metric implies that a distance Llocal , measured in the local inertial\ncoordinates in the full space shrinks by a warp factor as one approaches the AdS\nboundary. Thus the length at large-r as observed in Minkowski space is\nR\nLr =\nr\n\u0012\n\n\u0013\n\nLlocal .\n\n(4)\n\nConsequently, a local scattering state in the bulk with local momentum Qlocal as determined in the inertial frame is shifted to the ultraviolet as measured by an observer\nin Minkowski space\n\nr\nQlocal .\n(5)\nQr =\nR\nSince the characteristic energy scale in the ten-dimensional space is Qlocal ∼ R−1 , it\n\u0013\n\n\u0012\n\nfollows that r ∼ QR2 . Thus large Q pointlike hard scattering processes occur in the\n\nlarge-r conformal region of the AdS space.\n\nThe geometry at small values of r and the form of the compact space X depend on\nthe nature of the gauge theory and the mechanisms of conformal symmetry breaking.\nQCD is a nearly conformal theory in the ultraviolet region and a confining theory in\nthe infrared with a mass gap corresponding to the scale Λo of the lightest glueball\nscale. We thus expect that a non-conformal metric will be manifest at r ∼ ro = Λo R2 .\nHowever, we are interested in probing the wavefunction at large transverse momentum\n\nof order Q ∼ r/R2 ≫ Λo . The interaction occurs in the r ∼ QR2 ≫ ro region where\n\nthe conformal geometry (3) is valid and where the specific form of the compact space\nX is not relevant [9].\nCoordinates on AdS5 are xμ and r, and coordinates in the compact space are\n\nlabelled y a . According to the AdS/CFT correspondence we expect hadronic states\nat the boundary to have dual scattering states in the bulk. Consider first a spin-zero\nhadron state with four momentum P μ in four-dimensional Minkowski space. The\n6\n\n\fphysical hadron in the boundary theory is expected to be dual to a string state represented by a 10-dimensional wavefunction Φ, which is identified with a spinless dilaton\nfield [9] satisfying the Laplace equation in ten-dimensional curved spacetime. For\nlarge values of r ≫ ro spacetime geometry is the product space AdS × X. The field\n\nΦ is expanded in terms of a complete set of normalized eigenfunctions φl of the five-\n\ndimensional Laplace operator, with proper boundary conditions on the compact space\nX and eigenvalues λ2l . We write Φ(x, r, y) =\n\nP\n\nl\n\nΨl (x, r)φl (y). From the point of view\n\nof ten-dimensional physics Φ is a string zero-mode of the ten-dimensional Laplace\nequation. However, we can still have a complete set of excited states corresponding to the Kaluza-Klein modes yet having zero modes in ten dimensions. Nonzero\neigenvalues on X are of the order of the inverse of the radius of the compact space\nX. For each eigenvalue λl in the compact manifold X, the field Ψ satisfies a d+1\ndimensional scalar equation in the warped geometry of AdSd+1 space with the linearly\nindependent solutions\nΨ(x, r) = Ce−iP *x r\n\n− d2\n\n\n\n\n\n\n\nJα\n\n\u0010\n\nNα\n\nMR2\nr\n\n\u0010\n\n\u0011\n\nMR2\nr\n\n\u0011\n\n,\n\n(6)\n\nwhere α2 = (d/2)2 + (λR)2 and M is the hadronic invariant mass, Pμ P μ = M2 . The\n\ndominant contribution at large-r is Ψ(r) ∼ r −∆ , where\n\u0011\n√\n1\u0010\n∆=\nd + d2 + 4λ2 R2\n2\n\n(7)\n\nis the conformal dimension for a scalar field in AdSd+1 . At large relative transverse\nmomentum, Q ∼ r/R2 , Ψ has the scaling behavior Ψ(Q) ∼ Q−∆ in the large-r region\nof AdS space. The limiting values of the operators in the bulk are the Heisenberg\n\nfield operators of the gauge field theory [3] specified by the boundary conditions [4, 5]\nlim Ψ(x, r) = r −∆ Ψo (x),\n\nr→∞\n\n(8)\n\nwhere Ψo (x) is the corresponding renormalized operator of the quantum field theory [26]. We shall first establish the correspondence with the QCD partonic degrees\nof freedom in the Fock expansion of hadronic quantum states in the AdS boundary\nfor the case λ = 0, corresponding to a zero mode in X space. We will return to\nthe excited modes on X, when discussing the extension of our results to include the\norbital angular momentum of the Fock components.\n7\n\n\fThe basic constituents in QCD appear from the light-front quantization of the\nexcitations of the dynamical fields, expanded in terms of creation and annihilation\noperators on the transverse plane with coordinates x− = z − ct and ~x⊥ at τ =\n\nz + ct = 0. The expansion of bound state hadronic systems in terms of Fock states\n\nprovides an exact representation of the local matrix elements used for calculating form\nfactors, distribution amplitudes, and generalized parton distributions [24]. In terms\nof the hadron four-momentum P = (P + , P − , P~⊥ ) with P ± = P 0 ± P 3 , the light-front\n\nQCD\nframe independent Hamiltonian for a hadronic composite system HLC\n= Pμ P μ =\nP − P + − P~⊥2 , has eigenvalues given in terms of the eigenmass M squared corresponding\nQCD\nto the mass spectrum of the color-singlet states in QCD, HLC\n|Ψh i = M2h |Ψh i. The\n\nhadron state |Ψh i is expanded in a Fock-state complete basis of non-interacting n-\n\nparticle states |ni with an infinite number of components\nE\n\nΨh (P , P~⊥ ) =\n+\n\nXZ\n\nn,λi\n\n[dxi d2~k⊥i ] ψn/h (xi , ~k⊥i , λi ) |n : xi P + , xi P~⊥ + ~k⊥i , λi i,\n\n(9)\n\nwhere the coefficients of the light-front Fock expansion\nψn/h (xi , ~k⊥i , λi ) = n : xi , ~k⊥i , λi |ψh ,\nD\n\nE\n\n(10)\n\ndepend only on the relative partonic coordinates, the longitudinal momentum fracP\nP\ntion xi = ki+ /P + , n xi = 1, the relative transverse momentum ~k⊥i , n ~k⊥i = ~0,\ni=1\n\ni=1\n\nand λi , the projection of the constituents' spin along the z direction. The amplitudes\n\nψn/h represent the probability amplitudes to find on-mass-shell constituents i with\nmomentum xi P + and xi P~⊥ + ~k⊥i and spin projection λi in the hadron h. The mea-\n\nsure of the constituents' phase-space momentum integration [dxi d2~k⊥i ] depends on\nthe normalization chosen. The complete basis of Fock-states |ni is constructed by\napplying free-field creation operators to the vacuum state |0i which has no particle\ncontent, P + |0i = 0, P~⊥ |0i = 0. Since all the quanta have positive k + , the vacuum\n\nstate is unique and equal to the nonperturbative vacuum. A one-particle state is\n√\ndefined by |qi = 2q + a† (q)|0i so that its normalization has the Lorentz invariant\n\nform hq|q ′i = 2q + (2π)3 δ(q + − q ′ + ) δ (2) (~q⊥ − ~q⊥ ′ ). The measure of the phase space\n\nintegration is defined by\n2~\n\n3\n\n\n\n[dxi d k⊥i ] = (16π ) δ 1 −\n\nn\nX\n\nj=1\n\n\n\nxj  δ\n8\n\n(2)\n\nn\nX\n\nl=1\n\n~k⊥l\n\n!\n\ndxi d2~k⊥i\n,\n3\ni=1 xi 16π\nn\nY\n\n(11)\n\n\fand a normalized hadronic state hψ|ψi = 1, can be expressed as a sum of overlap\n\nintegrals of light-front wavefunctions\nXZ\nn\n\n[dxi d2~k⊥i ] |ψn/h (xi , ~k⊥i , λi )|2 = 1.\n\n(12)\n\nIf the light-front wavefunctions do not fall quickly enough, infinities appear in\nthe unitarity sum given by (12). To avoid this problem we truncate the Fock-states\n2\nfor light-front transverse momenta ~k⊥\nabove an ultraviolet scale Λ2 [12]. Certainly\n\nthe introduction of a cutoff explicitly breaks the conformal invariance of the theory.\n\nWhen the coupling falls as an inverse logarithm, the anomalous dimensions of an\noperator yield logarithmic corrections to the scattering amplitudes; if the coupling is\nconstant the anomalous dimensions lead to power-law corrections [25].\nThe cutoff is usually taken in the limit Λ → ∞ when performing calculations. In\n\npractice, the cutoff has no effect on the results provided that Λ is much greater than\nall mass scales, so calculations are carried out with a finite cutoff by defining the\nwavefunctions, masses and couplings at the scale Λ. In a field theory where only a\nsingle scale Q is relevant, it is natural to take the cutoff Λ ∼ Q and redefine the basic\nparameters and wavefunctions at the scale Q. Discarding Fock states with transverse\n\nmomenta above Λ and taking the effective cutoff Λ as the scale Q for large values\n2\nof the momentum transfer, we can determine the large ~k⊥\nmomentum dependence\nof the light front amplitudes since we know the conformal behavior of the bulk state\nas we approach the boundary from the interior of AdS space. The correspondence\nat large-r follows from the conformal isometry which determines the scaling of the\nstring states.\nTo establish the correspondence between the hadron state and its dual string\nstate and determine the precise counting rule of each Fock component, consider an\n(n)\noperator Ψ which creates an n-partonic state by applying n-times a† (k + , ~k⊥ ) to the\nh\n\nvacuum state, creating n-constituent individual states with plus momentum k + and\ntransverse momentum ~k⊥ . Each higher n-parton projection in the Fock expansion\n(n)\n\n(9) corresponds to the higher-twist interpolating operator Ψh . Integrating over the\nrelative coordinates xi and ~k⊥i for each constituent using the expression for the phase\n(n)\n\nspace (11), we find the ultraviolet behavior of Ψh\n(n)\nΨh (Q)\n\n∼\n\nZ\n\nQ2\n\n[d2~k⊥ ]n−1 [a† (~k⊥ )]n ψn/h (~k⊥ ),\n9\n\n(13)\n\n\f2\nwhere the operator a† (~k⊥ ) scales as 1/k⊥ at large ~k⊥\n. We obtain the scaling behavior\n\nof each hadronic interpolating field Ψ(n) from (6) replacing the hadronic invariant\nmass M with the off-shell invariant mass of the n-partonic state\nM2n =\n\nn\nX\n\nkiμ kiμ =\n\ni=1\n\nn\nX\n\n2\nk⊥i\n+ m2i\n,\nxi\ni=1\n\n(14)\n\nsince Fock-states are eigenstates of the free light-front Hamiltonian, and Mn is computed from the sum of the non-interacting contributions. Near the boundary of AdS\n\nspace Ψ(n) ∼ Q−∆n , since Mn is a hadronic scale. The behavior of the light-front\n2\nwavefunctions for large ~k⊥\nthen follows immediately\nψn/h (k⊥ ) ∼ (k⊥ )\n\n∆n −n\n\n\"\n\n1\n2\nk⊥\n\n#∆n −1\n\n.\n\n(15)\n\nThe conformal dimension ∆n is nominally the number of constituents since each\ninterpolating fermion and gauge field operator has a minimum twist (dimension minus\nspin) of one. We thus identify ∆n = n + 2δn where δn represents the effect of the\nanomalous dimension of the higher-twist interpolating operators. Thus the light-front\nFock state has the leading power behavior\n1\nψn/h (~k⊥ ) →\n~k 2\n\n⊥\n\n!n+δn −1\n\n.\n\n(16)\n\nNotice that the light-front amplitude ψn/h does not scale as its mass dimension M −n+1 .\nAlthough we have derived the scaling behavior of light-front amplitudes for a\nspinless hadron, identical scaling is obtained for a spin- 12 hadron corresponding to\na massless dilatino state χ in the bulk that obeys the massless Dirac equation in\nthe 10-dimensional curved geometry of spacetime. In the large-r conformal region\nthe dilatino field is expanded in terms of eigenfunctions ηl of the Dirac operator in\ncompact space X with eigenvalues λl . Specifically χ(x, r, y) =\n\nP\n\nl\n\nΨl (x, r)ηl (y), where\n\nΨ is a spinor field defined in a conformal d+1 space and η is a compact manifold\nspinor. For each eigenvalue λl on X, Ψl obeys a d + 1 dimensional Dirac equation in\nthe warped AdSd+1 space with the solution [27]\n−iP *x − d+1\n2\n\nΨ(x, r) = Ce\n\nr\n\nMR2\nMR2\n) μ+ (P ) + Jα+1 (\n) μ− (P ) ,\nJα (\nr\nr\n#\n\n\"\n\n10\n\n(17)\n\n\fwhere α = λR − 12 , M =\n\nq\n\nPμ P μ and Γ̂μ± = ±μ± . If d is even Γ̂ = iΓ1 ...Γd is the\n\nd-dimensional chirality operator and the spinors in Eq. (17) are chiral. For AdS5 , Γ̂\nis the four dimensional chirality operator γ5 . The dominant contribution at large-r\nalso scales as r −∆ where\n∆=\n\nd\n+ |λR|\n2\n\n(18)\n\nis the conformal dimension for a spinor field in AdSd+1 . The scaling is not changed\nby the spinors since they are boundary spinors.\nIn QCD each Fock state is an eigenfunction of the total angular momentum projection J z =\n\nPn\n\ni=1\n\nszi +\n\nPn−1\ni=1\n\nliz , where the sum over the spin szi corresponds to the\n\nintrinsic spins of the n-constituent\nFock states,\nand the sum over the n − 1 orbital\n\u0012\n\u0013\nangular momenta liz = −i ki1 ∂k∂ 2 − ki2 ∂k∂ 1 excludes the contribution from the moi\n\ni\n\ntion of the center-of-mass [28]. Parton orbital angular momentum components in\n\nthe light-front expansion of hadronic states are essential in order to describe hadron\nspin-flip amplitudes in QCD, such as the l = 1 proton |uudi state which is required\n\nto have a non-zero Pauli form factor.\n\nIn d-dimensional Minkowski space it is simple to extend our previous scaling results to obtain the power fall-off behavior at high relative transfer momentum of\nlight-front wave functions including orbital angular momentum. The derivation follows immediately from the algebra of the generators of the conformal group SO(2, d).\nIn particular, the generator of scaling transformations D and the generator of translations Pμ obey the commutation relations [D, Pμ ] = −iPμ . Consider a state with orbital\n\nangular momentum l, Ψl ∼ pl Ψ, where the interpolating field Ψ is an eigenfunction\nof the scaling operator D with eigenvalue −i∆ [29]\n\n[D, Ψ] = i(−∆ + xμ ∂μ )Ψ.\n\n(19)\n\nUsing the commutation relation of the operator D with Pμ as written above, we\nobtain the scaling dimension ∆l of the field Ψl representing a state with orbital\nangular momentum l\n[D, Ψl ] = i(−∆l + xμ ∂μ )Ψl ,\n\n(20)\n\nwith ∆l = ∆ + l. The dimensional scaling law for the light-front wavefunctions at\nlarge Q including constituent orbital angular momentum l follows directly from the\n11\n\n\fidentification ∆n → ∆n,l = n + 2δn + l in (15)\nψn/h (~k⊥ ) → (k⊥ )\n\nl\n\n\"\n\n1\n~k 2\n\n⊥\n\n#n+δn +l−1\n\n.\n\n(21)\n\nSince O(d + 1, 1) the isometry group of AdSd+1 in d + 1 dimensions, acts as the\nconformal group SO(2, d) in d-dimensional Minkowski space [30], it is natural to ask\nif a correspondence can be established between a string moving in AdS space and\nthe QCD Fock-states with orbital angular momentum. According to the AdS/CFT\nduality, we would expect that all the states of the hadronic expansion in a complete\nFock-basis spanning all the Hilbert space of the boundary theory are matched with\nthe string degrees of freedom in a one-to-one correspondence. We know from string\ntheory that the correspondence could not be established for spin greater than two, and\na Fock-state can have high orbital angular momentum. However, the QCD eigenstate\nitself has no large spin, since the Jz component of each Fock-state is identical to that\nof the hadron itself. If the sum of orbital components liz is large, it is compensated by\nthe sum of the constituents' spin szi for each of the n − 1 orbital angular momentum\nstates corresponding to a Fock-state with n partons.\n\nFrom (7) or (18) it is clear that only if the compact space X has dimensions of\norder R, would the product λR be independent of the 't Hooft coupling. The KK\nstates should also be protected from quantum or string effects which potentially can\ngive contributions of the order of the string scale to ∆. As an example, for a string that\nlives on M 4 × K, the product of Minkowski spacetime and a six-dimensional compact\n\nspace K, excited KK states are non-chiral [31]. Consequently, no mechanism can\nin this case prevent the excited eigenmodes from acquiring a very large mass from\ninvariant mass terms at tree level in the Lagrangian. The non-chiral states acquire a\n√\nmass given by the highest scale available, λ ∼ 1/ α′ , and decouple from the theory\n\naccording to the survival hypothesis [32], leaving effectively the massless modes. If\n(λR)2 ∼ (gs NC )1/2 , we would expect from (7) or (18) the dimension of an excited\n\nKK state to grow as ∆ ∼ (gs NC )1/4 at large 't Hooft coupling. In the case of the\n\nsupersymmetric Yang-Mills correspondence with Type IIB strings on AdS5 × S 5 [3],\n\nall Kaluza-Klein excited states transform in short supergravity multiplets and the\nradius of curvature of S 5 is also R. The associated dimensions are protected by the\nsupersymmetry algebra [8].\n12\n\n\fStrings moving in the warped geometry of AdS5 × X spacetime involve both\n\npositive and negative chirality solutions as given by Eq. (17). In this case, the\nopposite chirality states have different dimensions and thus very different dependences\non r; they do not pair to form an invariant mass term. Indeed only the positive\n\nchirality solution is dominant at large r, corresponding to a QCD state with proper\nnear-conformal scaling at the AdS boundary. Contrary to strings on M 4 × K, the\n\ndimensions associated with KK modes for strings on AdS5 × X space are protected,\n\ni.e. the dimensions are independent of the 't Hooft coupling as long as the compact\nspace has dimensions of order R.\n\nHarmonic KK modes are eigenstates of the Laplacian on an N-sphere S N with\neigenvalues l(l + N − 1), where l is an integer. For N = d + 1, the product λR is thus\n\nquantized according to (λR)2 = l(l + d). From (7) it follows that ∆l = ∆ + l, where\n\n∆ is the conformal dimension corresponding to a KK zero mode. The matching of\nstates in the AdS/CFT correspondence is carried out near the boundary of AdS space\nr = R2 /z with z ∼ 0. We then can identify l = l.\nThe case for the spinor field is slightly more complex. The Dirac operator on\n\u0010\n\nan N-sphere has eigenvalues [33] ± l +\n\nN\n2\n\n\u0011\n\n, where l is a non negative integer l =\n\u0010\n\n0, 1, 2, ... Consequently λR obeys the quantization condition λR = ± l +\n\nd\n2\n\n+\n\n1\n2\n\n\u0011\n\nfor\n\nN = d + 1, and the lowest KK Dirac mode on the N-sphere has non-zero mass.\nFrom (18) we obtain for the conformal dimension of the spinor field ∆l = d + l + 12 ,\nand thus the relation ∆l = ∆ + l is also valid in this case. Here also ∆ is the\nconformal dimension for l = 0. We have thus established a correspondence of orbital\nangular momentum components for the Fock expansion of meson and baryon states\nwith the corresponding KK modes in the compact space. Only 10-dimensional string\nexcitations, or stringy excitations, have masses of order of the string scale (α′ )−1/2\nand dimensions ∆ ∼ (gs NC )1/4 .\nTo specify the angular momentum properties of hadronic states [34] in QCD, the\norbital angular momentum component of the hadron wavefunction is constructed in\nterms of the n − 1 transverse momenta of the components and has the general struc-\n\n± |lz1 | ± |lz2 |\n±\n±\nture [35]: (k1⊥\n) (k2⊥ ) ...(k(n−1)⊥\n)|lz(n−1) | , with ki⊥\n= ki1 ± iki2 . In the regime of\n\nmoderate value of the 't Hooft coupling we expect the anomalous dimension to be\nsmall to retain the near-conformal features of QCD phenomena. The phenomeno13\n\n\flogical success of dimensional counting rules suggest indeed that the effect of the\nanomalous dimensions is small. We thus write for the hard component of the lightfront wavefunction\nψn/h (xi , ~k⊥i , λi , lzi ) ∼\n\n1\n(n−1)\n2\n\n(gs NC )\n√\nNC\n\nn−1\nY\ni=1\n\n\n\n± |lzi |\n(ki⊥\n)\n\n\n\n\nΛo\nM2\n\n−\n\n~k 2 +m2\ni\n⊥i\ni\nxi\n\nP\n\n+\n\nΛ2o\n\nn+|lz |−1\n\n\n\n,\n\n(22)\n\nwhere Λo represents the basic QCD mass scale and the normalization factor (NC )−1/2\ndepends on the color structure of each Fock state. For example for a valence meson\nstate NC = NC , for a valence baryon state NC = NC !, and for the lowest component\n\nglue state NC = NC2 . The form (22) is compatible with the scaling properties predicted\nby the AdS/CFT correspondence (21) including orbital angular momentum [36].\n\nFixed-angle large transverse momentum exclusive collision processes in QCD take\nplace in the large conformal region of AdS space. Let us review first the results for\nhard meson scattering in a theory with gauge symmetry SU(NC ) for large NC [37].\nWe use the 't Hooft double-line representation [1] of Feynman diagrams where a quark\npropagator is represented by a single-index line and a gluon propagator by two-index\nlines. To obtain the 1/NC expansion for a meson form factor F , we note that there\nis a factor of NC from a closed color quark loop where the photon is attached and\n√\na normalization factor of 1/ N C for each meson wave function and thus F ∝ NC0 ,\nindependent of NC as it should.\n\nTo compute the meson-meson scattering amplitude M in the large NC limit, we\ninclude a factor of NC from a closed color quark loop from quark interchange and a\n√\nfactor of 1/ N C for the normalization of each meson wave function; thus MQIM ∝\n\n2\n1/NC . The counting rule is not changed at fixed gQCD\nNC by any number of ladder\n\ngluon exchanges between quarks within the same meson, as would result from the\niteration of the equation of motion of the meson wavefunction. The evaluation of\nplanar multiple gluon exchange diagrams is also simple. In the case of two-gluon\nexchange in meson-meson scattering, the index color-counting of the gluon exchange\nin terms of qq pairs gives an additional factor NC relative to the quark interchange\n√\ndiagram from the additional quark color loop, but each vertex has a factor 1/ N C\nand thus M2g ∝ 1/NC2 . The 1/NC2 dependence is not modified by additional exchange\n\nof gluons, since each new gluon introduces two extra vertices and one additional closed\n14\n\n\fcolor loop which cancels the NC factor, and the scaling is given by the wavefunction\nnormalization; thus Mng ∝ 1/NC2 .\nBaryons constitute a difficult problem in the large NC limit since they are represented by a totally antisymmetric color state with NC different quarks, and the\nnumber of quark lines in a given diagram grows with NC . It is expected, however,\nthat baryons will follow simple scaling laws in a 1/NC expansion. In his theory of\nbaryons at large NC , Witten uses graphical methods to describe the n-body force\nand introduces a bound state which consists of a large number of weakly interacting\nparticles described in the Hartree approximation [22]. In the case under discussion,\nlarge transverse momentum hadron-hadron scattering, the problem is simplified, since\nall the NC constituents (NC large but finite) change their collinear direction in the\ncollision process and acquire high transverse momentum. Thus one requires the highQ components of the hadronic wavefunction corresponding to large-r values of AdS\n√\nspace given by (22), with the normalization factor 1/ NC ! for each baryon wave\nfunction. Then combinatorial factors for the quark loops are computed, giving the\nnon-trivial 1/NC expansion with the usual index counting in the diagrams.\nConsider first the 1/NC expansion for a baryon form factor F for an NC component fully antisymmetric color singlet state |Bi =\n\n√ 1 ǫi ,i ,...,i\n|qi1 qi2 ...qiNC i,\nNC\nNC ! 1 2\n\nwith\n\nhB|Bi = 1. To evaluate the combinatoric factors it is useful to consider the color\nquark loop with the anti-color index from the effective remaining NC − 1 quarks in\n\nthe baryon wavefunction. There is a factor NC from the closed color quark loop for\nthe quark in the baryon attached to the high transverse momentum photon, times the\n\nfactor (NC − 1)! to account for all the possible loops from the different permutations\n√\nin the baryon wavefunction. Taking into account the normalization factor NC ! for\neach baryon wavefunction we obtain F ∝ NC0 , independent of NC .\nFor the baryon-baryon scattering amplitude M there is a factor NC from a closed\nquark loop from quark interchange and a factor [(NC − 1)!]2 , which counts all the\n\nloops from the possible permutations from the two baryon wavefunctions. There is\n√\nalso a factor (1/ NC !)4 from the baryon wavefunction normalization. Combining the\ndifferent factors we obtain MQIM ∝ 1/NC . The analysis of planar multiple gluon\nexchange diagrams is performed along the same lines giving an additional 1/NC factor compared to the dominant quark interchange amplitudes. Repeating the analysis\n15\n\n\ffor the 1/NC power counting for meson-baryon processes, or baryon-antibaryon scattering, we obtain identical results: the quark interchange amplitudes scale as 1/NC ,\nwhereas multiple gluon amplitudes from planar graphs scale as 1/NC2 . Non-planar\ncontributions are naturally suppressed relative to the planar diagrams and could\nexplain the absence of Landshoff pinch contributions [38] in the large transverse momentum fixed t/s proton-proton scattering data, where each pair of quarks scatter\nindependently by gluon exchange. These are nonplanar.\nWe are now in a position to write general expressions for transition amplitudes\ncorresponding to the hard component of the light-front wavefunction (22) obtained\nfrom the AdS/CFT correspondence at large values of gs NC , for arbitrary number of\ncomponents in the Fock expansion including orbital angular momentum. To compare\nwith the quantum field theory results, the 't Hooft parameter gs NC appearing in the\n√\nlight-front wavefunction (22) has to be scaled according gs NC → gs NC [36]. The\nnon-perturbative expression for the form factor at large transverse momentum is\n2\n\nF (Q ) ∼\n\n2\n(gQCD\n\nNC )\n\nn−1\n\n\"\n\nΛo\nQ\n\n#2n+|lz |−2\n\n2\n, gQCD\n∼ gs ,\n\n(23)\n\nwhere n is the number of components in the Fock state and |lz | is the angular momentum component. The extra factor Λon−1 comes from the soft components of the\n\nwavefunction after integrating the exact Drell-Yan-West expression for the form facn−1\ntor [39] over d2~k⊥\nphase space. For lz = 0 (23) agrees with the nominal counting\n\nperturbative QCD results. The equivalent expression for the hadronic scattering reaction A+B → C +D is obtained from the general structure of the quark interchange\n\namplitude [40], including the appropriate number of integration loops\n1\n\n2\n\nM(Q )A+B→C+D\n\n(g 2\nNC ) 2 (n−2) Λo\n∼ QCD\nNC\nQ\n\"\n\n#(n+|lz |−4)\n\n,\n\n(24)\n\nwhere n is the total number of constituents entering the reaction, n = nA + nB +\n2\nnC + nD , and gQCD\n∼ gs . The additional Λo factor corresponds to the soft momentum\n\ncomponents of the wavefunction from phase space loop integration.\n\nIn this paper we have shown how the scaling properties of the hadronic interpolating operator in the extended AdS/CFT space-time theory determines the scaling\nof light-front hadronic wavefunctions at high relative transverse momentum. The\n16\n\n\fangular momentum dependence of the light-front wavefunctions also follows from\nthe AdS/CFT correspondence mapping the Fock components into string states in\nAdS × X spacetime, and identifying the partonic states with orbital angular momentum with the Kaluza Klein eigenmodes in the compact space X. The scaling\n\npredictions agree with the perturbative QCD analysis given in Ref. [35], but here\nthe analysis is performed at strong coupling without the use of perturbation theory. Quark interchange is the dominant mechanism at large momentum transfer in\nthe NC → ∞ limit of QCD and consistent expressions are obtained for meson and\n\nbaryon scattering at large transverse momentum. The near-conformal scaling properties of light-front wavefunctions lead to a number of predictions for QCD which\nare normally discussed in the context of perturbation theory, such as constituent\ncounting scaling laws for the leading power fall-off of form factors and hard exclusive\n\nscattering amplitudes for QCD processes. The ratio of Pauli to Dirac baryon form\nfactor has the nominal asymptotic form F2 (Q2 )/F1 (Q2 ) ∼ 1/Q2 , modulo logarithmic\n\ncorrections, in agreement with the perturbative results of Ref. [41]. Our analysis can\n\nalso be extended to study the spin structure of scattering amplitudes at large transverse momentum and other processes which are dependent on the scaling and orbital\nangular momentum structure of light-front wavefunctions.\nWe thank Oleg Andreev, Joe Polchinski, Helen Quinn, Jörg Raufeisen, and Matt\nStrassler for helpful comments.\n\n17\n\n\fReferences\n[1] G. 't Hooft, Nucl. Phys. B 72, 461 (1974).\n[2] A. M. Polyakov, Nucl. Phys. Proc. Suppl. 68, 1 (1998) [arXiv:hep-th/9711002].\n[3] J. M. Maldacena, Adv. Theor. Math. Phys. 2, 231 (1998) [Int. J. Theor. Phys.\n38, 1113 (1999)] [arXiv:hep-th/9711200].\n[4] S. S. Gubser, I. R. Klebanov and A. M. Polyakov, Phys. Lett. B 428, 105 (1998)\n[arXiv:hep-th/9802109].\n[5] E. Witten, Adv. Theor. Math. Phys. 2, 253 (1998) [arXiv:hep-th/9802150].\n[6] G. 't Hooft, arXiv:gr-qc/9310026.\n[7] L. Susskind, J. Math. Phys. 36, 6377 (1995) [arXiv:hep-th/9409089].\n[8] For a review of the correspondence between large N gauge theories and string\ntheories see for example, O. Aharony, S. S. Gubser, J. M. Maldacena, H. Ooguri\nand Y. Oz, Phys. Rept. 323, 183 (2000) [arXiv:hep-th/9905111].\n[9] J. Polchinski and M. J. Strassler, Phys. Rev. Lett. 88, 031601 (2002)\n[arXiv:hep-th/0109174].\n[10] S. J. Brodsky and G. R. Farrar, Phys. Rev. Lett. 31, 1153 (1973); Phys. Rev. D\n11, 1309 (1975).\n[11] V. A. Matveev, R. M. Muradian and A. N. Tavkhelidze, Lett. Nuovo Cim. 7,\n719 (1973).\n[12] G. P. Lepage and S. J. Brodsky, Phys. Rev. D 22, 2157 (1980); Phys. Rev. Lett.\n43, 545 (1979) [Erratum-ibid. 43, 1625 (1979)].\n[13] L. von Smekal, R. Alkofer and A. Hauck, Phys. Rev. Lett. 79, 3591 (1997)\n[arXiv:hep-ph/9705242].\n[14] D. Zwanziger, arXiv:hep-ph/0303028.\n18\n\n\f[15] D. M. Howe and C. J. Maxwell,\n\nPhys. Lett. B 541,\n\n129 (2002)\n\n[arXiv:hep-ph/0204036]; arXiv:hep-ph/0303163.\n[16] A. C. Mattingly and P. M. Stevenson, Phys. Rev. D 49, 437 (1994)\n[arXiv:hep-ph/9307266].\n[17] S. J. Brodsky, S. Menke, C. Merino and J. Rathsman, Phys. Rev. D 67, 055008\n(2003) [arXiv:hep-ph/0212078].\n[18] R.\n\nC.\n\nBrower\n\nand\n\nC.\n\nI.\n\nTan,\n\nNucl.\n\nPhys.\n\nB\n\n662,\n\n393\n\n(2003)\n\n[arXiv:hep-th/0207144].\n[19] See also, H. Boschi-Filho and N. R. Braga, Phys. Lett. B 560, 232 (2003)\n[arXiv:hep-th/0207071].\n[20] J.\n\nPolchinski\n\nand\n\nM.\n\nJ.\n\nStrassler,\n\nJHEP\n\n0305,\n\n012\n\n(2003)\n\n[arXiv:hep-th/0209211].\n[21] O. Andreev, Phys. Rev. D 67, 046001 (2003) [arXiv:hep-th/0209256].\n[22] E. Witten, Nucl. Phys. B 160, 57 (1979).\n[23] H. Harari, Phys. Rev. Lett. 22 (1969) 562; J. L. Rosner, Phys. Rev. Lett. 22, 689\n(1969); P.G.O. Freund, Nuovo Cimento Lett. 4, 147 (1970); R. Dolen, D. Horn\nand C. Schmid, Phys. Rev. 166, 1768 (1968).\n[24] S. J. Brodsky, H. C. Pauli and S. S. Pinsky, Phys. Rept. 301, 299 (1998)\n[arXiv:hep-ph/9705477].\n[25] J. B. Kogut and L. Susskind, Phys. Rev. D 9, 697 (1974).\n[26] In terms of the boundary conditions (8) the partition function in AdS space\nZAdS , is identified with the generating functional of the conformal field theory\nZCF T on the boundary [4, 5]: ZAdS [Ψ(x, r)|r→∞ = Ψo (x)] = ZCF T [Ψo (x)].\n[27] M.\n\nHenningson\n\nand\n\nK.\n\nSfetsos,\n\nPhys.\n\nLett.\n\nB\n\n431,\n\n63\n\n(1998)\n\n[arXiv:hep-th/9803251]; W. Muck and K. S. Viswanathan, Phys. Rev. D\n58, 106006 (1998) [arXiv:hep-th/9805145].\n19\n\n\f[28] S. J. Brodsky, D. S. Hwang, B. Q. Ma and I. Schmidt, Nucl. Phys. B 593, 311\n(2001) [arXiv:hep-th/0003082].\n[29] G. Mack and A. Salam, Annals Phys. 53 (1969) 174.\n[30] Technically, the symmetry group SO(2, d) acts on Md , the hypersurface at the\nboundary of AdSd+1 space, z = R2 /r = 0, a copy of d-dimensional Minkowski\nspace plus a single point at z = ∞.\n[31] E. Witten, Shelter Island II: Proceedings of the 1983 Shelter Island Conference\non Quantum Field Theory and the Fundamental Problems of Physics, eds. R.\nJackiw et al. (MIT Press, Cambridge, Mass.), 1985.\n[32] H. Georgi, Nucl. Phys. B 156, 126 (1979).\n[33] R. Camporesi and A. Higuchi, arXiv:gr-qc/9505009.\n[34] V. A. Karmanov and A. V. Smirnov, Nucl. Phys. A 546, 691 (1992).\n[35] X. D. Ji, F. Yuan and J. P. Ma, Phys. Rev. Lett. 90 (2003) 241601. These authors\ninclude the analysis of amplitude mixing under renormalization.\n[36] The model wavefunction (22) does not include the soft component required for\nthe convergence of the integrals when computing physical observables. Note also\nthe fractional power in the 't Hooft parameter in the light-front wavefunction\n1\n\n(22) that scales as (gs NC ) 2 (n−1) instead of (gs NC )(n−1) , as would be expected\nfrom PQCD counting. The fractional dependence comes from the replacement\n√\ngN → gN to obtain agreement with the string results [9, 21]. Similar depen-\n\ndence is found in the large N superconformal evaluation of a quark-antiquark\n\npotential. See: S. J. Rey and J. T. Yee, Eur. Phys. J. C 22, 379 (2001)\n[arXiv:hep-th/9803001]; J. M. Maldacena, Phys. Rev. Lett. 80, 4859 (1998)\n[arXiv:hep-th/9803002].\n[37] For a review of large N methods see for example, S. R. Coleman, SLAC-PUB2484 Presented at 1979 Int. School of Subnuclear Physics, Pointlike Structures\nInside and Outside Hadrons, Erice, Italy, Jul 31-Aug 10, 1979; A. V. Manohar,\narXiv:hep-ph/9802419.\n20\n\n\f[38] P. V. Landshoff, Phys. Rev. D 10, 1024 (1974).\n[39] S. D. Drell and T. M. Yan, Phys. Rev. Lett. 24, 181 (1970); G. B. West, Phys.\nRev. Lett. 24, 1206 (1970).\n[40] J. F. Gunion, S. J. Brodsky and R. Blankenbecler, Phys. Lett. B 39, 649 (1972),\nPhys. Rev. D8, 287 (1973).\n[41] A. V. Belitsky, X. d. Ji and F. Yuan, Phys. Rev. Lett. 91, 092003 (2003)\n[arXiv:hep-ph/0212351], and references therein.\n\n21\n\n\f"}