{"id": "http://arxiv.org/abs/hep-ph/0212069v2", "guidislink": true, "updated": "2002-12-05T03:51:53Z", "updated_parsed": [2002, 12, 5, 3, 51, 53, 3, 339, 0], "published": "2002-12-04T20:28:18Z", "published_parsed": [2002, 12, 4, 20, 28, 18, 2, 338, 0], "title": "The Accelerated Universe and the Moon", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0212196%2Chep-ph%2F0212034%2Chep-ph%2F0212317%2Chep-ph%2F0212099%2Chep-ph%2F0212237%2Chep-ph%2F0212108%2Chep-ph%2F0212375%2Chep-ph%2F0212201%2Chep-ph%2F0212255%2Chep-ph%2F0212035%2Chep-ph%2F0212264%2Chep-ph%2F0212018%2Chep-ph%2F0212354%2Chep-ph%2F0212042%2Chep-ph%2F0212105%2Chep-ph%2F0212052%2Chep-ph%2F0212268%2Chep-ph%2F0212312%2Chep-ph%2F0212056%2Chep-ph%2F0212117%2Chep-ph%2F0212369%2Chep-ph%2F0212290%2Chep-ph%2F0212274%2Chep-ph%2F0212220%2Chep-ph%2F0212188%2Chep-ph%2F0212243%2Chep-ph%2F0212361%2Chep-ph%2F0212380%2Chep-ph%2F0212176%2Chep-ph%2F0212393%2Chep-ph%2F0212346%2Chep-ph%2F0212116%2Chep-ph%2F0212040%2Chep-ph%2F0212300%2Chep-ph%2F0212233%2Chep-ph%2F0212047%2Chep-ph%2F0212067%2Chep-ph%2F0212385%2Chep-ph%2F0212155%2Chep-ph%2F0212210%2Chep-ph%2F0212217%2Chep-ph%2F0212405%2Chep-ph%2F0212408%2Chep-ph%2F0212098%2Chep-ph%2F0212167%2Chep-ph%2F0212011%2Chep-ph%2F0212325%2Chep-ph%2F0212058%2Chep-ph%2F0212132%2Chep-ph%2F0212388%2Chep-ph%2F0212076%2Chep-ph%2F0212245%2Chep-ph%2F0212234%2Chep-ph%2F0212166%2Chep-ph%2F0212037%2Chep-ph%2F0212152%2Chep-ph%2F0212374%2Chep-ph%2F0212378%2Chep-ph%2F0212363%2Chep-ph%2F0212173%2Chep-ph%2F0212319%2Chep-ph%2F0212324%2Chep-ph%2F0212069%2Chep-ph%2F0212205%2Chep-ph%2F0212170%2Chep-ph%2F0212367%2Chep-ph%2F0212292%2Chep-ph%2F0212112%2Chep-ph%2F0212021%2Chep-ph%2F0212092%2Chep-ph%2F0212119%2Chep-ph%2F0212321%2Chep-ph%2F0212074%2Chep-ph%2F0212060%2Chep-ph%2F0212191%2Chep-ph%2F0212055%2Chep-ph%2F0212186%2Chep-ph%2F0212007%2Chep-ph%2F0212318%2Chep-ph%2F0212294%2Chep-ph%2F0212343%2Chep-ph%2F0212335%2Chep-ph%2F0212068%2Chep-ph%2F0212208%2Chep-ph%2F0212023%2Chep-ph%2F0212125%2Chep-ph%2F0212395%2Chep-ph%2F0212164%2Chep-ph%2F0212404%2Chep-ph%2F0212370%2Chep-ph%2F0212130%2Chep-ph%2F0212045%2Chep-ph%2F0212314%2Chep-ph%2F0212089%2Chep-ph%2F0212070%2Chep-ph%2F0212157%2Chep-ph%2F0212331%2Chep-ph%2F0212129%2Chep-ph%2F0212295%2Chep-ph%2F0212242%2Chep-ph%2F0212185&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Accelerated Universe and the Moon"}, "summary": "Cosmologically motivated theories that explain small acceleration rate of the\nUniverse via modification of gravity at very large, horizon or super-horizon\ndistances, can be tested by precision gravitational measurements at much\nshorter scales, such as the Earth-Moon distance. Contrary to the naive\nexpectation the predicted corrections to the Einsteinian metric near\ngravitating sources are so significant that fall within sensitivity of the\nproposed Lunar Ranging experiments. The key reason for such corrections is the\nvan Dam-Veltman-Zakharov discontinuity present in linearized versions of all\nsuch theories, and its subsequent absence at the non-linear level ala\nVainshtein.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0212196%2Chep-ph%2F0212034%2Chep-ph%2F0212317%2Chep-ph%2F0212099%2Chep-ph%2F0212237%2Chep-ph%2F0212108%2Chep-ph%2F0212375%2Chep-ph%2F0212201%2Chep-ph%2F0212255%2Chep-ph%2F0212035%2Chep-ph%2F0212264%2Chep-ph%2F0212018%2Chep-ph%2F0212354%2Chep-ph%2F0212042%2Chep-ph%2F0212105%2Chep-ph%2F0212052%2Chep-ph%2F0212268%2Chep-ph%2F0212312%2Chep-ph%2F0212056%2Chep-ph%2F0212117%2Chep-ph%2F0212369%2Chep-ph%2F0212290%2Chep-ph%2F0212274%2Chep-ph%2F0212220%2Chep-ph%2F0212188%2Chep-ph%2F0212243%2Chep-ph%2F0212361%2Chep-ph%2F0212380%2Chep-ph%2F0212176%2Chep-ph%2F0212393%2Chep-ph%2F0212346%2Chep-ph%2F0212116%2Chep-ph%2F0212040%2Chep-ph%2F0212300%2Chep-ph%2F0212233%2Chep-ph%2F0212047%2Chep-ph%2F0212067%2Chep-ph%2F0212385%2Chep-ph%2F0212155%2Chep-ph%2F0212210%2Chep-ph%2F0212217%2Chep-ph%2F0212405%2Chep-ph%2F0212408%2Chep-ph%2F0212098%2Chep-ph%2F0212167%2Chep-ph%2F0212011%2Chep-ph%2F0212325%2Chep-ph%2F0212058%2Chep-ph%2F0212132%2Chep-ph%2F0212388%2Chep-ph%2F0212076%2Chep-ph%2F0212245%2Chep-ph%2F0212234%2Chep-ph%2F0212166%2Chep-ph%2F0212037%2Chep-ph%2F0212152%2Chep-ph%2F0212374%2Chep-ph%2F0212378%2Chep-ph%2F0212363%2Chep-ph%2F0212173%2Chep-ph%2F0212319%2Chep-ph%2F0212324%2Chep-ph%2F0212069%2Chep-ph%2F0212205%2Chep-ph%2F0212170%2Chep-ph%2F0212367%2Chep-ph%2F0212292%2Chep-ph%2F0212112%2Chep-ph%2F0212021%2Chep-ph%2F0212092%2Chep-ph%2F0212119%2Chep-ph%2F0212321%2Chep-ph%2F0212074%2Chep-ph%2F0212060%2Chep-ph%2F0212191%2Chep-ph%2F0212055%2Chep-ph%2F0212186%2Chep-ph%2F0212007%2Chep-ph%2F0212318%2Chep-ph%2F0212294%2Chep-ph%2F0212343%2Chep-ph%2F0212335%2Chep-ph%2F0212068%2Chep-ph%2F0212208%2Chep-ph%2F0212023%2Chep-ph%2F0212125%2Chep-ph%2F0212395%2Chep-ph%2F0212164%2Chep-ph%2F0212404%2Chep-ph%2F0212370%2Chep-ph%2F0212130%2Chep-ph%2F0212045%2Chep-ph%2F0212314%2Chep-ph%2F0212089%2Chep-ph%2F0212070%2Chep-ph%2F0212157%2Chep-ph%2F0212331%2Chep-ph%2F0212129%2Chep-ph%2F0212295%2Chep-ph%2F0212242%2Chep-ph%2F0212185&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Cosmologically motivated theories that explain small acceleration rate of the\nUniverse via modification of gravity at very large, horizon or super-horizon\ndistances, can be tested by precision gravitational measurements at much\nshorter scales, such as the Earth-Moon distance. Contrary to the naive\nexpectation the predicted corrections to the Einsteinian metric near\ngravitating sources are so significant that fall within sensitivity of the\nproposed Lunar Ranging experiments. The key reason for such corrections is the\nvan Dam-Veltman-Zakharov discontinuity present in linearized versions of all\nsuch theories, and its subsequent absence at the non-linear level ala\nVainshtein."}, "authors": ["Gia Dvali", "Andrei Gruzinov", "Matias Zaldarriaga"], "author_detail": {"name": "Matias Zaldarriaga"}, "author": "Matias Zaldarriaga", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.68.024012", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/hep-ph/0212069v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-ph/0212069v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-ph/0212069v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-ph/0212069v2", "arxiv_comment": null, "journal_reference": "Phys.Rev. D68 (2003) 024012", "doi": "10.1103/PhysRevD.68.024012", "fulltext": "NYU-TH/02/12/1\n\narXiv:hep-ph/0212069v2 5 Dec 2002\n\nThe Accelerated Universe and the Moon\nGia Dvali, Andrei Gruzinov, and Matias Zaldarriaga\nCenter for Cosmology and Particle Physics\nDepartment of Physics, New York University, New York, NY 10003\n\nAbstract\nCosmologically motivated theories that explain small acceleration rate of the Universe via modification of gravity at very large, horizon or super-horizon distances,\ncan be tested by precision gravitational measurements at much shorter scales, such\nas the Earth-Moon distance. Contrary to the naive expectation the predicted corrections to the Einsteinian metric near gravitating sources are so significant that might\nfall within sensitivity of the proposed Lunar Ranging experiments. The key reason\nfor such corrections is the van Dam-Veltman-Zakharov discontinuity present in linearized versions of all such theories, and its subsequent absence at the non-linear\nlevel ala Vainshtein.\n\n\f1\n\nGeneralities\n\nRecent observations suggest that the Universe is accelerating on the scales of the\npresent cosmological horizon [1]. This indicates that, either there is a small vacuum\nenergy (or some \"effective\" vacuum energy), or that conventional laws of Einstein\ngravity get modified at very large distances, imitating a small cosmological constant\n[2, 7, 8]. The first possibility is unnatural in the view of quantum field theory1 ,\nsince the required value of vacuum energy ∼ 10−12 GeV4 is unstable under quantum\ncorrections. This unnaturalness goes under the name of the Cosmological Constant\nProblem.\nIn this respect the second approach, of modifying gravity in far infrared can be\nmore promising since it is perturbatively stable under quantum corrections. The\nunnaturally small value of the vacuum energy is replaced by the idea that laws of\nconventional gravity break down at very large distances, beyond a certain crossover\nscale rc . The value of rc is perturbatively-stable ie. it does not suffer from cut-off\nsensitive corrections experienced by vacuum energy. This modification at the level\nof linearized effective four-dimensional equation for the freely propagating metric\nfluctuations hμν (x) about the flat background can be described in the following\ngeneral way [2, 7, 8, 19]:\n1\n(1)\n(∇2 + 2 f (rc2∇2 ) ) hμν = 0\nrc\nHere ∇2 = ∇μ ∇μ denotes four-dimensional d'Alambertian, and f (rc2 ∇2 )/rc2 is an\noperator that dominates over ∇2 only for momenta q ≪ 1/rc . One way to think\nof this modification is that the effective gravitational coupling (effective Newton's\n\"constant\")\n\"\n#−1\n1\nf (rc2∇2 )\nGef f =\n1+\n(2)\n2\n8πMPl\nrc2 ∇2\n\nbecomes dependent on the wave-length. We will assume that the function f (rc2 ∇2 )\nis expandable in power series of ∇2 .\nDepending on the precise structure, such models can be divided in the following\nthree categories. The first category is the model [2], in which Newtonian gravity\nturns into the five dimensional 1/r 2 -potential at distances r ≫ rc . This effect is\ndue to existence of an infinite-volume flat extra dimension to which gravity \"leaks\"\nfrom the 3-brane, where the conventional particles live. So a brane-observer sees\neffectively four-dimensional theory of gravity, in which the effective 4D graviton is\nunstable, but with an arbitrarily large lifetime τ ∼ rc , over which it decays into\nfive-dimensional continuum of states.\nAlthough extra dimensions play crucial role in formulating the manifestly generallycovariant theory, for our purposes we can equally well use purely 4D language. For\nthe brane observer interested in metric on the brane created by brane sources, there\nis an effective four-dimensional description in terms of a single four-dimensional\n1\n\nAn alternative explanation could be provided by Anthropic approach [24]\n\n2\n\n\fgraviton hμν . Not surprisingly, this effective 4D theory is non-local, but non-local\nterms only dominate in far infrared. Moreover, if one is interested in estimates\nof sub-leading corrections to Einstein metric near the gravitating sources, the 4D\nlanguage is simpler. At the linearised level this 4D theory is given by (1) with [7]\n√\nf (rc2 ∇2 ) = rc −∇2\n(3)\nIn this theory the smallness of cosmological constant is not explained. However,\nif one postulates that vacuum energy is zero due to some other reason, the model\nexplains the accelerated expansion of the Universe without any need of dark energy\n[5,6]. The reason, as discovered in [5], is that in [2] the effective Friedmann equation\ngets modified by additional powers of Hubble parameter H, that dominate for very\nlow curvatures (late times). In the leading order the resulting equation can be\nparameterized as [5, 6]\nρ\nH\n.\n(4)\n=\nH2 −\n2\nrc\n3MPl\nAt late times, this equation has a self-accelerating cosmological branch with H = r1c .\nObservation fix the crossover scale to be rc ∼ 1028 cm. Confronted with minimal\nmodels where dark energy is a pure vacuum energy, the above model also contains\njust one parameter (rc versus the vacuum energy), but the difference is that the\nvalue of rc is insensitive to quantum loops.\nIn two other classes of models [7, 8], one can address the cosmological constant\nproblem . Models of [7] are based on higher-dimensional generalization of [2] with\nN > 1 extra dimensions [3]. As a result, the feature of 4D Newtonian gravity\nturning into the high-dimensional 1/r 1+N -potential for r ≫ rc is shared by N > 1\ntheories. However, having more than one extra dimensions proved to be crucial for\ncosmological constant. In these theories the large 4D vacuum energy (E) curves the\nfour-dimensional space only mildly resulting in an accelerated expansion, with the\nrate inversely proportional to a power of E. In four-dimensional language, gravity\nis modified in such a way that sources of wave-length ≫ rc gravitate very weakly.\nThus although vacuum energy is huge, it actually does not curve the space and can\nlead to an observable small acceleration.\nFinally there is a third class [8, 19], which does not refer to any underlying highdimensional theory, but is rather based on infrared modification of gravity directly\nin four-dimensions. In this models, Gef f is postulated to act as a high-pass filter, so\nthat as in [7] sources of wavelength ≫ rc gravitate extremely weakly.\nIn the above models, value of rc may of may not be fixed. For instance, in the\nmodels of [7] it is actually fixed to be rc ∼ 1028 cm , due to the current lower limits\non Newtonian 1/r gravity.\nThe common feature of all the above theories, is that beyond the crossover scale\nrc Newtonian 1/r gravity gets substantially modified. But, at short distances (near\nthe gravitating sources), all the prediction of Einstein gravity are reproduced up\nto some small corrections. These corrections are the central interest of the present\nwork.\n3\n\n\fGiven the fact that crossover scale is rc , one could naively conclude that deviations are suppressed by powers of rrc . If this were the case, then for rc ∼ 1028 cm,\nthe corrections would be completely negligible at any distance of potential precision\nmeasurements.\nInterestingly, the story is very different. Recall that near any gravitating object\nthere is a second (much smaller scale) in the problem, the gravitational radius of the\nbody rg . It was shown in [13] that leading corrections to the gravitational potential\nΨ in the model of [2] are strongly enhanced by inverse powers rg and are given by\nδΨ\nr\nǫ =\n∼\nΨ\nrc\n\ns\n\nr\nrg\n\n(5)\n\nThe aim of the present work is to show that in a large class of theories that modify\ngravity beyond some horizon or super-horizon size distance rc , there are corrections\nof the type [13] that penetrate at much shorter scales r∗ ≪ rc , and could be potentially measurable. These corrections can be detected in precision gravitational\nmeasurements in systems that are much smaller than rc , e.g., such as the EarthMoon system. In most interesting cases, such as the expression (5), they are on\nthe border line of existing measurements, and thus can be detected if the existing\nsensitivities are improved.\nThe key reason for such an unexpected behavior is that the graviton in the\nabove-discussed theories has extra polarization that also couples to the conserved\nenergy-momentum source, and mediates a scalar-type force. As a result, at the\nlinearized level gravity is of that scalar-tensor type. Therefore whenever linearized\napproximation is valid the predictions of the above theory differ from those of Einstein gravity by a finite amount, no matter how small is the ratio r/rc .\nThis effect was originally pointed out in the framework of linearized theory of\nmassive gravity [9], and goes under the name of van Dam - Veltman - Zakharov discontinuity (vDVZ). It lead vDVZ to the conclusion that massive theories of gravity\nare ruled out. Later the similar effect was observed in the linearized version of the\ngenerally-covariant model of [2].\nThe crucial point [10], however, is that discontinuity is an artifact of the linearized approximation, and is cured by non-linear corrections. In reality, the solution is continuous in the limit 1/rc → 0. This was originally suggested by Vainshtein\nin [10]2 and later confirmed by explicit fully-nonlinear analysis in generally covariant model of [2], both in cosmological solutions [11], as well as for localized sources,\nsuch as cosmic strings [12] and Schwarzschild [13, 16]. These studies uncover the\nsame persistent pattern. Near the sources the solutions are arbitrarily close to those\nof Einstein gravity, and continuous for large rc . However, the corrections set in at\n2\n\nOn AdS space vDVZD can be absent already at the linear level, if graviton mass is smaller\nthan the AdS curvature [22, 20, 21]. The roots of this phenomenon can again be attributed to the\neffect of [10]. Such situation probably is not experimentally interesting interesting, and won't be\ndiscussed here.\n\n4\n\n\fdistances, (or time scales) much smaller than rc , which makes them potentially observable even if rc is very large (e.g. horizon size) (the relevance of this corrections\nfor the orbit of Jupiter was pointed out in [13]). This makes us think that analogous behavior must take place in any theory with infrared modification of gravity\nof the form in (1). The key message of our analysis is that in all such theories of\ninterest vDVZ discontinuity indeed disappears at the non-linear level in accordance\nto [10, 11, 12, 13], and standard predictions of Einstein gravity are recovered near\nthe gravitating sources, where non-linearities are important. But as in [13] for any\ngiven localized source, there exists a distance r∗ for which the non-linearities are\nunimportant and thus the \"wrong predictions\" take over.\nWe give a qualitative prescription to estimate the leading order corrections to the\nEinstein metric using the form of the function f (rc2 ∇2 ) in theories interest. Using\nthis prescription one can derive observational constraints on such theories.\nThe rest of the paper is organized as follows. In section 2, we briefly summarize\nour theoretical results and in section 3 we discuss their relevance for observations,\nthrough the anomalous perihelion precession of orbits of planets. The reader interested in purely the phenomelogical applications of our results can dismiss the rest\nof the paper which is devoted to more theoretical considerations. In section 4 we\ndiscuss the role of extra graviton polarization in creating the observable effects at\nintermediate scales in theories with infrared-modified gravity. In section 5 we briefly\ndiscuss the applicability range of our results.\n\n2\n\nResults\n\nHere we shall briefly summarize our results. We will be interested in a class of\ngenerally-covariant theories, containing exclusively spin-2 states, for which the linearized perturbations about the flat space satisfy:\n1\n∇ + 2 f (rc2 ∇2 )\nrc\n2\n\n!\n\nhμν\n\n1\n=− 2\nMP l\n\n(\n\nTμν\n\nβ\n− ημν Tαα\n2\n\n)\n\n+ ***\n\n(6)\n\nwhere the ellipsis stands for some derivative-dependent terms that vanish in convolution with conserved sources. The over-all coefficient on r.h.s. was absorbed in\nredefinition of MP l . In all theories of interest β 6= 1, as opposed to the case of\nEinstein theory of massless graviton with two polarizations, in which β = 1. Thus\nthe theory exhibits the analog of vDVZ discontinuity.\nThen our analysis suggests the following.\nAs suggested by Vainshtein, vDVZ is cured at the non-linear level. That is, the\nsolution are continuous in the limit rc → ∞ near the sources. For any gravitating\nsource, with gravitational radius rg ≪ rc there is an important intermediate scale\nin the problem\nrg ≪ r∗ ≪ rc\n(7)\n5\n\n\fwhere r∗ is determined from the following equation\ns\n\nrg\n∼\nr∗\n\nr∗2\nrc2\n\n!\n\nf\n\nrc2\nr∗2\n\n!\n\n(8)\n\nThe various distance scales work as follows. For r ≪ r∗ the metric produced by\nthe source is nearly Schwarzchild, with the leading correction to the metric that can\nbe estimated as\nq\n!\nrg r 3\nrc2\nδΨ ∼\nf\n(9)\nrc2\nr2\nThis expression, for the particular form of the f -function given by (3), correctly\nreproduces the result of [13] given in (5), found by solving the full nonlinear highdimensional equation of [2].\nAs will be discussed below, the above corrections can play the crucial role for\ntesting theories in question in precision gravitational measurements.\nIn the interval r∗ ≪ r ≪ rc , the linearized approximation is valid. So gravity is\nstill 1/r, but is of scalar-tensor type. Note that the term \"scalar-tensor\" only refers\nto the similarity in the tensor structure, rather than to existence of an independent\nspin-0 state in the theory. Instead the \"scalar\" admixture comes from the extra\npolarization of spin-2 graviton.\nFinally, for the distances r ≫ rc , gravity becomes unconventional, with the\npotential given by\nZ\nrc2\nΨ(r) ∼ d3 q\ne−iqr\n(10)\nf (rc2 q 2 )\nwhere q is the three-momentum.\n\n3\n\nAnomalous Perihelion Precession\n\nThe considered class of theories predict slight modification of the gravitational potential of a massive body at observed distances according to (9). This modifications\ncan be observable in the experiments that are sensitive to anomalous perihelion\nprecession of planets. Let ǫ be the fractional change of the gravitational potential\nǫ≡\n\nδΨ\n,\nΨ\n\n(11)\n\nwhere Ψ = −GM/r is the Newtonian potential. The anomalous perihelion precession (the perihelion advance per orbit due to gravity modification) is\nδφ = πr(r 2(r −1 ǫ)′ )′ ,\nwhere ′ ≡ d/dr.\nLet us apply this to the model of [2]. In this theory, [13]\n√\nǫ = − 2rc−1 rg−1/2 r 3/2 .\n6\n\n(12)\n\n(13)\n\n\fThe numerical coefficient deserves some clarification. The above coefficient was\nderived in [13] on Minkowski background. However, non-linearities created by cosmological expansion can further correct the coefficient. One would expect these\ncorrections to scale as powers of rc H, where H is the observed value of the Hubble parameter. On the accelerated branch [5], as it's obvious from (4), H ∼ 1/rc\nand thus, one would expect the corrections to be of order one. Recently, a very\ninteresting fact was pointed out by Lue and Starkman [14]3 , that the cosmological\nbackground only affects the sign of the coefficient. The sign depends on the particular cosmological branch. It is negative for the standard cosmological branch, and\npositive for the self-accelerated one. We will restrict ourselves to order of magnitude\nestimate, but the sign will be very important if the effect is found, since according\nto [14] it could give information about the cosmological branch.\nWe get\nδφ = (3π/4)ǫ.\n(14)\nNumerically, the gravitational radius of the Earth is rg = 0.886cm, the Earth-Moon\ndistance is r = 3.84 × 1010 cm, the gravity modification parameter that gives the\nobserved acceleration without dark energy rc = 6 Gpc. We get the theoretical\nprecession\nδφ = 1.4 × 10−12 .\n(15)\nThis is to be compared to the accuracy of the precession measurement by the lunar\nlaser ranging. Today the accuracy is σφ = 2.4 × 10−11 and no anomalous precession\nis detected at this accuracy [17]. In the future a tenfold improvement of the accuracy\nis expected [18].\nAs noted in [14], anomalous Martian precession is also of interest for testing [2]\nwith cosmologically intersting values of rc . For rc = 6 Gpc we get δφM ars = 4×10−11 .\nThis is to be compared to the accuracy of σφM ars = 9 × 10−11 which might become\npossible as a result of the Pathfinder mission [15].\nLet us now consider some generalizations. In [2] f (rc2 ∇2 ) has the form (3).\nConsider now the minimal modification of the form\nf (rc2 ∇2 ) = (rc2 ∇2 )\n\n1−γ\n2\n\n.\n\n(16)\n\nAccording to (9) this modification of the graviton propagator gives the fractional\nchange of the gravitational potential analogous to (3):\nǫ ∼ rc−1−γ rg−1/2 r 3/2+γ .\n\n(17)\n\nThe corresponding anomalous lunar perihelion precession is\n\n3\n\nδφ ∼ rc−1−γ rg−1/2 r 3/2+γ .\nWe thank these authors for sharing their preliminary results with us.\n\n7\n\n(18)\n\n\fObservations of accuracy σφ can therefore test gravity theories with\nr\nrc < r\n2\nσφ rg\n\n!\n\n1\n2(1+γ)\n\n.\n\n(19)\n\nOne can speculate that in the absence of additional scales the gravity theories\nthat produce self-acceleration, without vacuum energy should have rc ∼few Gpc.\nThen the lunar precession accuracy of σφ ∼ 10−12 will tests the γ = 0 theory [2].\nThe dependence of the right-hand side of (3) on γ is very strong, and cosmologically\ninteresting theories with γ < 0 are ruled out by current observations, while theories\nwith γ > 0 are not testable by the solar system observations.\n\n4\n\nvDVZ Discontinuity and its Absence\n\nSome time ago van Dam and Veltman, and Zakharov [9] suggested that the solar\nsystem observations rule out the possibility of non-zero graviton mass, no matter\nhow small. Their conclusion was based on a linearized theory of massive graviton\nwith the following action\nS = SEl +\n\nZ\n\n4\n\ndx\n\nMP2 l m2g 2\n1\n( hμν − (hμμ )2 ) + hμν T μν\n2\n2\n\n!\n\n(20)\n\nThe first term on the r.h.s. is the standard Einstein action expanded to a quadratic\norder in the metric fluctuations about the flat space gμν = ημν + hμν . The mass\nterm in (20), has the Pauli-Fierz form [23], which is the only possible ghost-free\ncombination quadratic in hμν .\nDiscontinuity is due to the fact that massive graviton contains five degrees of\nfreedom (five polarizations) as opposed to two polarizations in the massless case.\nThree out of the five polarizations couple to the conserved energy momentum source,\nleading to an additional scalar attraction at distances r ≪ m1g , as compared to\nthe massless case. Since the additional degree of freedom couples differently to\nrelativistic and non-relativistic sources, the effect is not merely reducible to the\nrescaling of the Newton's constant GN , and is observable at the level of one-graviton\nexchange. Thus, at this level the theory is discontinuous in the limit mg → 0.\nThe amplitude of the lowest tree-level exchange by a single massless graviton\n′\nbetween two sources with energy-momentum tensors Tμν and Tαβ\nis (the tilde sign\ndenotes the quantities which are Fourier transformed to momentum space):\nAmassless\n\n8π GN\n1\n= − 2\nT̃μν − ημν T̃ββ\nq\n2\n\u0012\n\n\u0013\n\nT̃ ′μν .\n\n(21)\n\nT̃ ′μν .\n\n(22)\n\nIn the massive case this amplitude takes the form:\nAmassive\n\n1\n8π GN\nT̃μν − ημν T̃ββ\n= − 2\n2\nq + mg\n3\n\u0012\n\n8\n\n\u0013\n\n\fThe additional scalar attraction for massive case, is reflected in the difference in\nthe tensor structure. This difference can not be eliminated by simple redefinition of\nparameters and is finite, for arbitrarily small graviton mass.\nThis result goes under the name of vDVZ discontinuity, and if true, would be an\nextremely powerful result, as it would rule out not only the possibility of massive\ngravity, but much wider classes of theories that modify gravity in far-infrared.\nHowever, the story is not so straightforward as we shall now discuss. Shortly\nafter vDVZ observation, Vainshtein [10] suggested that vDVZ discontinuity was an\nartifact of the linearized approximation, and would be absent in fully non-linear\ntheory. That is, vDVZ result was obtained at one-graviton exchange level, that is in\nthe first order in GN expansion. This corresponds to solving the linearized equation\nδ SEl\nT μν\n+ m2g (hμν − ημν hαα ) =\nδhμν\nMP2 l\n\n(23)\n\nHowever, Vainshtein noted that perturbative expansion in GN breaks down in the\nzero mg limit.\nHowever, he also showed that if one takes into account non-linearities, then for\nsmall mg the perturbative expansion in powers of mg can be organized, in which\ncase discontinuity can disappear. Since no fully non-linear generally-covariant theory\nfor massive graviton was known, Vainshtein used a theory obtained by non-linear\ncompletion of only the first, Einstein, term in r.h.s. of (23):\nGμν + m2g (hμν − ημν hαα ) = 8πGN Tμν\n\n(24)\n\nwhere Gμν is the Einstein tensor. In which case solving for g00 = eν(r) and grr =\neλ(r) components of the spherically-symmetric metric outside massive body, he found:\nν(r) = −\n\nq\nrg\n+ O m2g rg r 3 ,\nr\n\u0012\n\n\u0013\n\nλ(r) =\n\nq\nrg\n+ O m2g rg r 3 ,\nr\n\u0012\n\n\u0013\n\n(25)\n\nNote that in the same parametrization the standard Schwarzschild solution of the\nmassless theory takes the following form:\n\u0012\n\nν Schw (r) = −λSchw (r) = ln 1 −\n\nrg\nr\n\n\u0013\n\n= −\n\nrg 1 rg\n−\nr\n2 r\n\u0012\n\n\u00132\n\n+ ... ,\n(26)\n\nHere rg ≡ 2GN M is the gravitational radius of the source of mass M.\nThis expression is fully continuous in mg and reproduces Einsteinian results in\nthe zero-mass limit. Thus vDVZ has indeed disappeared at the non-linear level.\nNotice the two important facts. First the sub-leading corrections to the metric are\n9\n\n\fnon-analytic in rg . Secondly, the deviations from the standard Einstein gravity\nbecome important at distance\nr∗ =\n\n(mg rg )1/5\n,\nmg\n\n(27)\n\nwhich is parametricaly shorter than the Compton wave-length of graviton. This is\nnot surprising, if we recall that vDVZ was cured by non-linearities that are most\nimportant in the neighborhood of the heavy sources (large rg ). As a result the heavier\nis the source, the larger is the critical distance at which linear approximation takes\nover.\nThe above results however, may not sound completely satisfactory, since the\nmass term in (24) was still kept at the linearized level, and as a result theory was\nnot fully generally-covariant. As we shall see, the above results nevertheless persists\nin theories, which are fully non-linear and generally-covariant. There too the discontinuity is absent and corrections can penetrate at distances much shorter than\nthe scale at which linearized gravity gets modified. The latter fact gives possibility of experimentally testing such theories through precision measurements at the\nrelatively short distances.\nAn example of generally-covariant theory that modifies gravity in far infrared,\nand which exhibits vDVZ at the linearized level is given by the following action [2,3]\n2\nMPl\nS =\n4rc\n\nZ\n\n4\n\nd x dy\n\nq\n\n|g (5) |\n\n2\nMPl\nR+\n2\n\nZ\n\n4\n\ndx\n\nq\n\n|g| R(x) .\n\n(28)\n\n(5)\n\nWhere gAB is 5D metric tensor, A, B are five-dimensional indexes, and R is the\nfive-dimensional Ricci scalar, gμν denotes the induced metric on the brane which we\ntake as\n(5)\ngμν (x) ≡ gμν\n(x, y = 0) ,\n\nμ, ν = 0, 1, 2, 3 ,\n\n(29)\n\nneglecting the brane fluctuations.\nWe assume that our observable 4D world is confined to a brane which is located\nat the point y = 0 in extra fifth dimension. That is the energy-momentum tensor\nof 4D matter has the form Tμν (x) δ(y).\nAlthough, the underlying theory is high-dimensional, from the point of view of\na 4D observer localized on the brane, Newtonian gravitational potential is just the\nusual 1/r gravity, which gets modified to 1/r 2 only at very large distances r ≫ rc .\nThe gravitational potential between the two bodies located on the brane can be\nread-off from the form of the Greens function (it is convenient to work in momentum\nspace in the four world-volume directions and in position space with respect to the\ntransverse coordinate y).\nNeglecting the tensorial structure of the propagator the scalar part of the Green\nfunction has the following form [2]:\n1\n1\n√ ,\nG̃(q, y = 0) =\n(30)\n2\nq2\nMPl 2\nq + rc\n10\n\n\fFor the static gravitational potential Ψ(r), one gets at short distances, i.e., when\nr ≪ rc\n1\n1\nΨ(r) = − 2 2\n8π MPl r\n\n\u001a\n\nπ\nrc\n+ −1 + γ − ln\n2\nr\n\u0014\n\n\u0012\n\n\u0013\u0015 \u0012\n\nr\nrc\n\n\u0013\n\n2\n\n\u001b\n\n+ O(r ) .\n\n(31)\n\nHere γ ≃ 0.577 is the Euler constant. The leading term in this expression has the\nfamiliar 1/r scaling of the four-dimensional Newton law. For r ≫ rc one finds:\nΨ(r) = −\n\n1\n1\n1\n+O 3\n2\n3\n2\n16π M∗ r\nr\n\u0012\n\n\u0013\n\n.\n\n(32)\n\nThe long distance potential scales as 1/r 2 in accordance with the 5D Newton law.\nThe above model (28) exhibits the vDVZ discontinuity in the one-graviton treelevel exchange. This can be seen directly from the μν components of linearized\nEinstein equation for bulk metric fluctuations about the flat 5D metric, which after\ngauge fixing can be brought into the following form [2]\n\u0012\n\n1 2\n1\n(∇ − ∂y2 ) + δ(y) ∇2 hμν = − 2\nrc\nMP l\n\u0013\n\n1\n− ημν Tαα δ(y) + δ(y) ∂μ∂ν hαα .(33)\n3\n\n\u001a\n\n\u001b\n\nTμν\n\nThe first term on r.h.s of this equation has a structure which is identical to that\nof a massive 4D graviton. The second term, ∂μ ∂ν , vanishes vanishes whenever it is\ncontracted with the conserved energy-momentum tensor, and thus plays no role at\none graviton exchange level. As a result, the amplitude of interaction of two test\nsources takes the form:\nA(q) ∝\n\n′\n−\nT̃ μν T̃μν\n2\nq +\n\n1\n3\n\nT̃μμ T̃ν′ν\n\nq\nrc\n\n,\n\n(34)\n\n√\nwhere q ≡ q 2 . We see that the tensor structure is the same as in the case of the\nmassive 4D theory, see Eq. (22), which signals vDVZ discontinuity.\nThe discontinuity however is cured at the nonlinear level. This was demonstrated\nexplicitly both for cosmological solution [11], as well as for cosmic strings [12] and\nSchwarzchild [13], [16]. We shall concentrate on the latter case. The solution of [13]\nhas the form:\nν(r) = −\n\nrg\n1 q 3\nrg r ,\n+O\nr\nrc r\n\u0012\n\n\u0013\n\nλ(r) =\n\n1 q 3\nrg\nrg r ,\n+O\nr\nrc r\n\u0012\n\n\u0013\n\n(35)\n\nThis expression exhibits some interesting behavior. First, we see that the two features observed by Vainshtein persist here, but there are some peculiarities. The\ncorrection is non-analytic in rg , and moreover it becomes important at distances\nmuch closer than rc . This is in accordance with Vainshtein case. However, there\nare important differences which are crucial for observations. Notice that, one would\n11\n\n\fnaively expect that if Vainshtein's analysis is correct, then the above expression\nshould be obtained from Vaishtein case by substitution mg → 1/rc . The reason is\nthat, although we are not dealing with massive gravity in the strict sense, nevertheless, rc is the scale at which 1/r-law of linearized approximation breaks down.\nIt is true that in our case it is replaced by 1/r 2 rather than by exponentially suppressed Youkawa potential, but this difference naively seems inessential. So naively\none would conclude that rc should play the role of mg in controlling the strength\nof correction. However, this is not the case. Instead, the expression of ref [13] is\nobtained from Vainshtein by substitution:\nm2g →\n\n1\nrrc\n\n(36)\n\nWe shall now try to understand why this is the case, but let us first explain\nnon-analyticity of the correction in rg . The above theory contains two parameters\nMP l and rc . vDVZ happens at the linear level due to the term that is proportional\nto 1/rc , and is cured by the non-linear corrections proportional to MP2 l . These\nnon-linear corrections make sure that metric gets standard Einstein form near the\nsources. The deviation from the standard metric is due to the fact that linearized\napproximation becomes good again and 1/rc -terms take over. Thus, corrections to\nthe metric are due to the fact that one-particle exchange dominates at large scales.\nThen the leading corrections should be proportional to 1/rc . Close to the source the\nmetric can be expanded in powers of 1/rc , e.g.\ng00 ( r, rc , rg ) = 1 +\n\n1 α 1−α\nrg\n+\nr r\n+ higher order terms\nr\nrc g\n\n(37)\n\nwhere α is some positive power. Now, we know that for the fixed r, for weak\nsources, the linearized approximation is valid, and thus the effect of extra graviton\npolarization must be reintroduced. Thus, for fixed r, the second term on r.h.s. of\n(37) must dominate in the limit rg → 0. This can only happen if α < 1, which\nexplains non-analyticity of the correction. To summarize shortly, given the fact\nthat difference in the tensor structure of the metric is introduced by dominance of\none-particle exchanges, which are proportional to r1c , and dominate for small rg , the\ncorrections to Schwarzchild cannot be analytic in rg .\nTo understand which quantity plays the role of mg , the following observation is\nuseful. If we are interested in making 4D metric on the brane continuously approach\nSchwarzchild in the limit 1/rc → 0, it is enough to have non-linear action on the\nbrane only, and keep high-dimensional part of the action linear. In other words\nfor curing vDVZ the non-linear interactions in the bulk are unimportant. That is,\nfor obtaining Schwarzchild solution in the leading order on the brane the following\nequation is enough\nMP2 l\n\n\u0012\n\n1 L\nG + δ(y)Gμν\nrc μν\n12\n\n\u0013\n\n= δ(y)Tμν\n\n(38)\n\n\fL\nWhere, Gμν\nis the five-dimensional Einstein tensor, linearized on a flat background.\nThis system describes the five dimensional graviton hμν (x, y) that freely propagates\nin the bulk, and has non-linear self-couplings only on the brane. These branelocalized self couplings are most important for determining the metric on the brane\nnear the source localized on the brane. Diagrammatically, this fact can be understood as follows. The nonlinear corrections that cure vDVZ discontinuity correspond to all the tree-level diagrams with virtual graviton lines that end on the\nsources localized on the brane. The self-interaction vertexes of virtual gravitons can\nbe located both on the brane or in the bulk. The bulk non-linearities come from\nthe 1/rc -suppressed bulk curvature term and are subleading. So the diagrams for\nwhich graviton self-interaction vertices are not located on the brane are sub-leading\nin 1/rc -expansion. Theory with linearized bulk action (38) gives rise only to the diagrams in which all graviton vertices are located on the brane. Since these diagrams\nare dominant, the eq (38) is suffices to cure vDVZ discontinuity. Now let us compare\nthe five-dimensional theory defined in by eq. (38) to an effective four-dimensional\ntheory of four-dimensional graviton hμν (x) defined by the following equation\n\nMP2 l\n\n\u0012\n\nGμν\n\n1√ 2\n+\n∇ (hμν − ημν hαα )\nrc\n\n\u0013\n\n= Tμν\n\n(39)\n\nThese can be treated as two independent theories, but some sub-class of amplitudes\nin the two cases are equal. In fact the interaction amplitudes between brane-localized\nsources with no graviton emission in 5D theory are equal to the ones of 4D one.\nNotice that the two theories are designed in such a way, that the Greens function of\nthe four-dimensional theory, is equal to the greens function of the five-dimensional\none evaluated at the point y = 0:\nh hμν (x) hαβ (x′ ) i = h hμν (x, y = 0) hαβ (x′ , y = 0) i\n\n(40)\n\nAlso all the nonlinear interactions in two theories are the same. Given these facts,\nit is obvious that any interaction amplitude between the brane-localized sources\nTμν (x1 ), Tμν (x2 ), ... Tμν (xn ), (in which no gravitons are emitted in the final state) in\nfive dimensional theory (38) will be equal to a similar amplitude in four-dimensional\ntheory (39). For instance consider the lowest three-level interaction among the three\nsources with a single intermediate three-graviton vertex V (x)δ(y):\nA∼\n′ ′\n\nZ\n\nd4 x1 dy1 d4 x2 dy2d4 x3 dy3 d4 xdy T μν (x1 )δ(y1 ) T αβ (x2 )δ(y2 ) T γρ (x3 ) δ(y3)\n′ ′\n\n′ ′\n\nV μ ν ,α β ,γ ρ (x) δ(y) h hμν (x1 y1 ) hμ′ ν ′ (x, y) i h hαβ (x2 , y2 ) hα′ β ′ (x, y) i\nh hγρ (x3 , y3 ) hγ ′ ρ′ (x, y) i =\n\nZ\n\n′ ′\n\n′ ′\n\n′ ′\n\nd4 x1 d4 x2 d4 x3 d4 x T μν (x1 ) T αβ (x2 ) T γρ (x3 ) V μ ν ,α β ,γ ρ (x) h hμν (x1 ) hμ′ ν ′ (x) i\n\nh hαβ (x2 ) hα′ β ′ (x) i h hγρ(x3 ) hγ ′ ρ′ (x) i\n\n(41)\n\nThe last expression represents a similar amplitude evaluated in theory of eq. (39).\nGeneralization of the above relation to more complicated diagrams with arbitrary\n13\n\n\fnumber of internal vertexes and external sources is trivial. As a result any such\namplitude in high-dimentional theory eq. (38) has an equal counterpart in fourdimensional one. Thus, if for example, we are interested in the metric created\nby the brane-localized source on the brane in theory defined by eq. (38), we can\ninstead solve eq. (39) and get the correct answer. But for solving perturbatively for\nSchwarzschild metric, the equation (39) in the leading order is equivalent to that of\nVainshtein (24) in which m2g is substituted by 1/rrc .\nNow we can generalize this result and give a simple qualitative prescription that\ngives a possibility to estimate the sub-leading correction to Schwarzschild in other\ntheories of interest, in which Einstein gravity is modified in far infrared by adding\nsome operators that at the linearized level behave as\nGμν +\n\n1\nf (rc2∇2 )(hμν − ημν hαα ) = 0\nrc2\n\n(42)\n\nThen subleading correction to the metric can be estimated from (25) by substitution\nm2g\n\n1\n→ 2f\nrc\n\nrc2\nr2\n\n!\n\n(43)\n\nwhere action of the operator should be understood in terms of the eigenvalues of ∇.\nFor instance:\nZ\ne−irp\n2 2 1\nd3 p f (rc2p2 ) 2\n(44)\nf (rc ∇ ) =\nr\np\nIt should be noted that we have neglected corrections of the same order in 1/rc\ncoming from the nonlinear completion of the mass term. Thus our results is just an\norder of magnitude estimate. In principle there could be theories in which the additional terms exactly cancel the corrections to Schwarzschild we computed although\nthis is not the case in the theories of [2, 3].\n\n5\n\nApplicability\n\nWe shall now briefly formulate the applicability range of our analysis. Consider a\ntheory which, in some gauge, at the linearized level reduces to eq. (6). The criteria\nfor the presence of discontinuity (β 6= 1) is the existence of the following spectral\nrepresentation:\nZ ∞\n1\nds ρ(s)\n=\n(45)\n2\n2\n2\nq + f (rc q )\ns + q2\n0\nwith a semi-positive definite spectral function ρ(s), which is requirement for the\nabsence of unphysical negative norm states. In such a case the equation (6) is\nderivable from the action\nS =\n\nZ\n\n0\n\n∞\n\n\n\n(s)\n\nds  SEl +\n\nZ\n\nq\n\n\n\n\n\nρ(s) (s) μν\ns\n2\n(s)μ 2\nh T \nd4 x  ( (h(s)\nμν ) − (hμ ) ) +\n2\n2MP l μν\n14\n\n(46)\n\n\fq\n\nwhere hμν = ds ρ(s)h(s)\nμν . This action describes the linearized theory of continuum\nof free massive gravitons with masses m2 = s.√They all couple to the same conserved\nR\n\nρ(s)\n\nsource Tμν but with mass-dependent coupling 2MP l . Therefore the propagator of this\ntheory is simply an integral over the continuum of the massive propagators taken\nwith the weights ρ(s)\nA(q) = − 8π GN\n\nZ\n\n∞\n0\n\nT̃μμ T̃ν′ν\nT̃μν T̃ ′μν − c(s)\n3\ndsρ(s)\ns + q2\n\n(47)\n\nwhere in our parametrization c(0) = 3/2 and c(s 6= 0) = 1.\nA useful illustrative example, in which vDVZ can be seen from the above reasoning is the model of [2]. There the representation (46) has a simple physical\nmeaning [4]. It is just an expansion into the continuum of massive Kaluza-Klein\nstates. In that case the spectral function is given by ρ(s) = √s(4 1+ r2 s) . In this\nc\nlanguage the presence of vDVZ discontinuity in [2] is trivially understood. Since\neach Kaluza-Klein mode is a massive spin-2 particle, each of them exhibits vDVZ\ndiscontinuity by default. Thus exchange by tower of Kaluza-Klein states exhibits\nthe same discontinuity as the individual exchanges do.\n\n6\n\nConclusion\n\nThere are strong motivations coming from cosmology for modifying the standard\nEinstein gravity at large distances. A wide class of such gravity theories can be\ntested by astronomical observations of the solar system.\nAcknowledgments\nWe thank Gregory Gabadadze and Glennys Farrar for valuable discussions and\nErich Adelberger for the discussions on Lunar Ranging experiments, that inspired\nthis work. The work of G.D. is supported in part by David and Lucile Packard\nFoundation Fellowship for Science and Engineering, by Alfred P. Sloan foundation\nfellowship and by NSF grant PHY-0070787. Work of A.G. is supported by part by\nDavid and Lucile Packard Foundation Fellowship for Science and Engineering. Work\nof M. Z. is supported by part by David and Lucile Packard Foundation Fellowship\nfor Science and Engineering.\n\nReferences\n[1] A.G.Riess et al. Astron. J. 116, 1009 (1998), astro-ph/9805201; S. Perlmutter\net al. Astrophys. J. 517, 565 (1999) astro-ph/9812133.\n[2] G. Dvali, G. Gabadadze and M. Porrati, Phys. Lett. B485, 208 (2000) [hepth/0005016].\n15\n\n\f[3] G. Dvali and G. Gabadadze, Phys. Rev. D 63, 065007 (2001) [hep-th/0008054].\n[4] G. Dvali, G. Gabadadze, M. Kolanovic and F. Nitti, Phys. Rev. D64 (2001)\n084004, hep-ph/0102216; Phys. Rev. D65 (2002) 024031, hep-th/0106058.\n[5] C. Deffayet, Phys. Lett. B 502, 199 (2001) [hep-th/0010186].\n[6] C. Deffayet, G. Dvali and G. Gabadadze, astro-ph/0105068.\n[7] G. Dvali, G. Gabadadze, and M. Shifman, hep-th/0202174; hep-th/0208096.\n[8] N. Arkani-Hamed, S. Dimopoulos, G. Dvali and G. Gabadadze, hepth/0209227.\n[9] H. van Dam and M. Veltman, Nucl. Phys. B22, 397 (1970); V. I. Zakharov,\nJETP Lett. 12, 312 (1970) .\n[10] A. I. Vainshtein, Phys. Lett. 39B, 393 (1972) .\n[11] C. Deffayet, G. R. Dvali, G. Gabadadze and A. I. Vainshtein, Phys. Rev. D 65,\n044026 (2002) hep-th/0106001.\n[12] A. Lue, hep-th/0111168\n[13] A. Gruzinov, astro-ph/0112246\n[14] A. Lue and G. Starkman, astro-ph/0212083.\n[15] K. Nordtvedt, Phys. Rev. D 61, 122001 (2000)\n[16] M. Porrati, Phys. Lett. B 534, 209 (2002)\n[17] Williams, J. G., Boggs, D. H., Dickey, J. O., & Folkner, W. M., \"Lunar Tests of\nthe Gravitational Physics,\" Proceedings of the Ninth Marcel Grossman Meeting,\nRome, Italy, June 2000, World Scientific Publications, R. Jantzen, ed., (2001)\n[18] T. W. Murphy, Jr., J. D. Strasburg, C. W. Stubbs, E. G. Adelberger, J. Angle,\nK. Nordtvedt, J. G. Williams, J. O. Dickey, & B. Gillespie, \"The Apache Point\nObservatory Lunar Laser-ranging Operation (APOLLO),\" 12th International\nLaser Ranging Workshop, Matera, Italy, (2000).\n[19] A. Adams, J. McGreevy and E. Silverstain, hep-th/0209226\n[20] I. I. Kogan, S. Mouslopoulos and A. Papazoglou, Phys. Lett. B 503, 173 (2001),\nhep-th/0011138.\n[21] M. Porrati, Phys. Lett. B 498, 92 (2001), hep-th/0011152\n[22] A. Higuchi, Nucl. Phys. B 282, 397 (1987); Nucl. Phys. B 325, 745 (1989).\n16\n\n\f[23] M. Fierz, Helv. Phys. Acta 12 (1939) 3;\nM. Fierz, W. Pauli, Proc. Roy. Soc. 173 (1939) 211.\n[24] J. Garriga, M. Livio, A. Vilenkin, Phys. Rev. D 61, 023503 (2000) [astroph/9906210]; J. Garriga and A. Vilenkin, Phys. Rev. D 61, 083502 (2000)\n[astro-ph/9908115]; Phys. Rev. D 64, 023517 (2001); [hep-th/0011262]. For the\nrecent review, see, A. Vilenkin, Talk given at XVIIIth IAP conference on the\n\"Nature of dark energy\", Paris, 1-5 July 2002.\n\n17\n\n\f"}