{"id": "http://arxiv.org/abs/hep-th/0701268v2", "guidislink": true, "updated": "2007-02-21T23:22:27Z", "updated_parsed": [2007, 2, 21, 23, 22, 27, 2, 52, 0], "published": "2007-01-29T20:28:06Z", "published_parsed": [2007, 1, 29, 20, 28, 6, 0, 29, 0], "title": "Symplectic geometry and Noether charges for Hopf algebra space-time\n  symmetries", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-th%2F0701190%2Chep-th%2F0701083%2Chep-th%2F0701223%2Chep-th%2F0701186%2Chep-th%2F0701140%2Chep-th%2F0701117%2Chep-th%2F0701234%2Chep-th%2F0701249%2Chep-th%2F0701166%2Chep-th%2F0701135%2Chep-th%2F0701024%2Chep-th%2F0701237%2Chep-th%2F0701218%2Chep-th%2F0701067%2Chep-th%2F0701185%2Chep-th%2F0701055%2Chep-th%2F0701081%2Chep-th%2F0701278%2Chep-th%2F0701049%2Chep-th%2F0701178%2Chep-th%2F0701206%2Chep-th%2F0701275%2Chep-th%2F0701006%2Chep-th%2F0701099%2Chep-th%2F0701078%2Chep-th%2F0701115%2Chep-th%2F0701224%2Chep-th%2F0701053%2Chep-th%2F0701060%2Chep-th%2F0701141%2Chep-th%2F0701255%2Chep-th%2F0701120%2Chep-th%2F0701222%2Chep-th%2F0701149%2Chep-th%2F0701121%2Chep-th%2F0701082%2Chep-th%2F0701052%2Chep-th%2F0701058%2Chep-th%2F0701279%2Chep-th%2F0701260%2Chep-th%2F0701106%2Chep-th%2F0701264%2Chep-th%2F0701181%2Chep-th%2F0701267%2Chep-th%2F0701263%2Chep-th%2F0701235%2Chep-th%2F0701227%2Chep-th%2F0701143%2Chep-th%2F0701232%2Chep-th%2F0701233%2Chep-th%2F0701184%2Chep-th%2F0701002%2Chep-th%2F0701208%2Chep-th%2F0701176%2Chep-th%2F0701189%2Chep-th%2F0701271%2Chep-th%2F0701034%2Chep-th%2F0701065%2Chep-th%2F0701091%2Chep-th%2F0701256%2Chep-th%2F0701272%2Chep-th%2F0701187%2Chep-th%2F0701243%2Chep-th%2F0701133%2Chep-th%2F0701179%2Chep-th%2F0701286%2Chep-th%2F0701109%2Chep-th%2F0701050%2Chep-th%2F0701123%2Chep-th%2F0701013%2Chep-th%2F0701225%2Chep-th%2F0701066%2Chep-th%2F0701134%2Chep-th%2F0701100%2Chep-th%2F0701174%2Chep-th%2F0701022%2Chep-th%2F0701171%2Chep-th%2F0701035%2Chep-th%2F0701126%2Chep-th%2F0701207%2Chep-th%2F0701268%2Chep-th%2F0701124%2Chep-th%2F0701095%2Chep-th%2F0701089%2Chep-th%2F0701116%2Chep-th%2F0701130%2Chep-th%2F0701090%2Chep-th%2F0701114%2Chep-th%2F0701247%2Chep-th%2F0701063%2Chep-th%2F0701161%2Chep-th%2F0701194%2Chep-th%2F0701113%2Chep-th%2F0701193%2Chep-th%2F0701241%2Chep-th%2F0701287%2Chep-th%2F0701042%2Chep-th%2F0701153%2Chep-th%2F0701209%2Chep-th%2F0701008%2Chep-th%2F0701059&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Symplectic geometry and Noether charges for Hopf algebra space-time\n  symmetries"}, "summary": "There has been a certain interest in some recent works in the derivation of\nNoether charges for Hopf-algebra space-time symmetries. Such analyses relied\nrather heavily on delicate manipulations of the fields of non-commuting\ncoordinates whose charges were under study. Here we derive the same charges in\na \"coordinate-independent\" symplectic-geometry type of approach and find\nresults that are consistent with the ones of hep-th/0607221.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-th%2F0701190%2Chep-th%2F0701083%2Chep-th%2F0701223%2Chep-th%2F0701186%2Chep-th%2F0701140%2Chep-th%2F0701117%2Chep-th%2F0701234%2Chep-th%2F0701249%2Chep-th%2F0701166%2Chep-th%2F0701135%2Chep-th%2F0701024%2Chep-th%2F0701237%2Chep-th%2F0701218%2Chep-th%2F0701067%2Chep-th%2F0701185%2Chep-th%2F0701055%2Chep-th%2F0701081%2Chep-th%2F0701278%2Chep-th%2F0701049%2Chep-th%2F0701178%2Chep-th%2F0701206%2Chep-th%2F0701275%2Chep-th%2F0701006%2Chep-th%2F0701099%2Chep-th%2F0701078%2Chep-th%2F0701115%2Chep-th%2F0701224%2Chep-th%2F0701053%2Chep-th%2F0701060%2Chep-th%2F0701141%2Chep-th%2F0701255%2Chep-th%2F0701120%2Chep-th%2F0701222%2Chep-th%2F0701149%2Chep-th%2F0701121%2Chep-th%2F0701082%2Chep-th%2F0701052%2Chep-th%2F0701058%2Chep-th%2F0701279%2Chep-th%2F0701260%2Chep-th%2F0701106%2Chep-th%2F0701264%2Chep-th%2F0701181%2Chep-th%2F0701267%2Chep-th%2F0701263%2Chep-th%2F0701235%2Chep-th%2F0701227%2Chep-th%2F0701143%2Chep-th%2F0701232%2Chep-th%2F0701233%2Chep-th%2F0701184%2Chep-th%2F0701002%2Chep-th%2F0701208%2Chep-th%2F0701176%2Chep-th%2F0701189%2Chep-th%2F0701271%2Chep-th%2F0701034%2Chep-th%2F0701065%2Chep-th%2F0701091%2Chep-th%2F0701256%2Chep-th%2F0701272%2Chep-th%2F0701187%2Chep-th%2F0701243%2Chep-th%2F0701133%2Chep-th%2F0701179%2Chep-th%2F0701286%2Chep-th%2F0701109%2Chep-th%2F0701050%2Chep-th%2F0701123%2Chep-th%2F0701013%2Chep-th%2F0701225%2Chep-th%2F0701066%2Chep-th%2F0701134%2Chep-th%2F0701100%2Chep-th%2F0701174%2Chep-th%2F0701022%2Chep-th%2F0701171%2Chep-th%2F0701035%2Chep-th%2F0701126%2Chep-th%2F0701207%2Chep-th%2F0701268%2Chep-th%2F0701124%2Chep-th%2F0701095%2Chep-th%2F0701089%2Chep-th%2F0701116%2Chep-th%2F0701130%2Chep-th%2F0701090%2Chep-th%2F0701114%2Chep-th%2F0701247%2Chep-th%2F0701063%2Chep-th%2F0701161%2Chep-th%2F0701194%2Chep-th%2F0701113%2Chep-th%2F0701193%2Chep-th%2F0701241%2Chep-th%2F0701287%2Chep-th%2F0701042%2Chep-th%2F0701153%2Chep-th%2F0701209%2Chep-th%2F0701008%2Chep-th%2F0701059&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "There has been a certain interest in some recent works in the derivation of\nNoether charges for Hopf-algebra space-time symmetries. Such analyses relied\nrather heavily on delicate manipulations of the fields of non-commuting\ncoordinates whose charges were under study. Here we derive the same charges in\na \"coordinate-independent\" symplectic-geometry type of approach and find\nresults that are consistent with the ones of hep-th/0607221."}, "authors": ["Michele Arzano", "Antonino Marciano"], "author_detail": {"name": "Antonino Marciano"}, "author": "Antonino Marciano", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.75.081701", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/hep-th/0701268v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-th/0701268v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "12 pages, RevTex4; clarifying remarks added and incorrect statement\n  rectified; typos corrected", "arxiv_primary_category": {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-th/0701268v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-th/0701268v2", "journal_reference": "Phys.Rev.D75:081701,2007", "doi": "10.1103/PhysRevD.75.081701", "fulltext": "Symplectic geometry and Noether charges for Hopf algebra space-time\nsymmetries\nMichele Arzano∗\nPerimeter Institute for Theoretical Physics\n31 Caroline St. N, N2L 2Y5, Waterloo ON, Canada\n\narXiv:hep-th/0701268v2 21 Feb 2007\n\nAntonino Marcianò†\nUniversità degi Studi di Roma \"La Sapienza\"\nDipartimento di Fisica, P.le A. Moro 2, 00185 Roma, Italy\nAbstract\nThere has been a certain interest in some recent works in the derivation of Noether charges\nfor Hopf-algebra space-time symmetries. Such analyses relied rather heavily on delicate\nmanipulations of the fields of non-commuting coordinates whose charges were under study.\nHere we derive the same charges in a \"coordinate-independent\" symplectic-geometry type of\napproach and find results that are consistent with the ones of hep-th/0607221.\n\nI.\n\nINTRODUCTION\n\nThe emergence of a non-trivial structure of space-time at very short (Planckian) scales has been\npart of a common intuition in the quantum gravity community since its very early days. In general\nthe typical new feature expected to emerge at the Planck scale is some sort of \"discretization\" in\nwhich the Planck length/energy plays a leading role [1]. Non-commutative geometry is an example of such scenarios where the \"quantization\" of classical flat space-time manifold manifests in\na non-vanishing commutator for space-time coordinates. In general non-commutative space-times\ndo not enjoy usual relativistic symmetries, Poincaré invariance can be either broken or replaced by\n\"deformed\" symmetries described by certain Hopf algebras [2, 3, 4].\nIn recent years, the possibility that non-classical, \"quantum\", symmetries of flat space-time might\nemerge in the low-energy limit of quantum gravity has also received much attention (see e.g. [5, 6]).\nFurther interest in these specific type of quantum symmetries, described by the κ-Poincaré Hopf\nalgebra, has been motivated by the suggestion that they might lead to observable effects, e.g.\n∗\n†\n\nElectronic address: marzano@perimeterinstitute.ca\nElectronic address: antonino.marciano@roma1.infn.it\n\n\f2\npossible experimental signatures of a modification of the energy/momentum dispersion relation in\ncertain astrophysical phenomena (see e.g.[7]).\nThe relevance of κ-Poincaré in the context of non-commutative geometry relies on the observation\n[3] that such Hopf algebra can be regarded as the symmetry algebra of the so-called κ-Minkowski\nnon-commutative space-time (NCST). One of the major difficulties in working with such a space is\nthat in order to properly handle fields as functions of non-commuting coordinates one has to fix an\nordering prescription. Different choices of ordering prescription give rise to different actions of the\nsymmetries on the algebra of functions which in turn correspond to different choices of the basis of\ngenerators of κ-Poincaré. Such freedom in the choice of ordering leads to apparent ambiguities in\nthe physical interpretation of such theories [11, 12] e.g. the energy and the wave-vector of a field\nwould appear to be related by different dispersion relations depending on the choice of ordering.\nAs a contribution to the understanding of these issues, in [13], in collaboration with Agostini,\nAmelino-Camelia and Tacchi, we obtained, for the first time, the Noether charges associated to\nthe translation sector of the κ-Poincaré symmetries for a classical field theory on κ-Minkowski\nspacetime. Such charges were shown to be, although for narrow class of non-linear basis redefinitions, invariant by change of basis of the κ-Poincaré Hopf algebra, i.e. to be invariant by ordering\nconvention of the elements of the κ-Minkowski space-time manifold. More recently in [14], working\nwith the same type NCST but considering a different differential calculus and a different formalization of the fields, the authors obtained charges that are different from the ones of [13]. Since\nthese studies relied heavily on different assumptions, we thought it could be useful to develop an\nalternative procedure, by simplectic-geometry considerations, in analyzing the problem of Noether\ncharges. Indeed a symplectic, \"non-coordinate\", formulation [8] appears to be extremely useful for\nthe purpose of study the conserved charges associated with Hopf algebra symmetries.\nIn our new framework, the Noether charges we derive coincide with the ones obtained in [13].\nMoreover in the formalism introduced it is easy too see that, once a concept of deformed symmetry transformation has been given, these charges are unique. We hope that such formalism\nmight provide, in general, a powerful tool for the study of classical (and quantum) field theories\non non-commutative spaces.\nIn section II A we review the symplectic-geometry approach to classical field theories and adapt\nit to the Noether analysis for a linear massless scalar field invariant under standard relativistic\nsymmetries. Such approach, based on the symplectic geometry of the phase space, gives a clearer\npicture of the symmetry structure of the theory since the charges associated with local symmetries\ncan be expressed in terms of the central object: the symplectic product [8].\n\n\f3\nIn section II B we summarize the main features of κ-Poincaré \"quantum\" relativistic symmetries\nand the transition from the standard Lie algebra setting to Hopf algebra symmetries.\nIn section III, we show how to define an analogous symplectic structure for a field theory whose\nsymmetries are described by κ-Poincaré. This will be done introducing a suitable mapping from\nthe space of solutions of the standard equation of motion to the solutions of the κ-deformed KleinGordon equation. As an application of the new formalism we derive the Noether charges associated\nwith translational symmetries in few, simple steps.\nSection IV contains some closing remarks.\n\nII.\nA.\n\nPRELIMINARIES\n\nSymplectic geometry and phase space of classical field theories\n\nThe idea behind a symplectic geometrical description of classical field theories is to provide a\ncanonical formulation of the phase space which does not spoil the symmetries of the theory, in\nprimis Poincaré invariance. The central object of such description is a non-degenerate 2-form ω\nwhich provides a \"coordinate-free\" global expression for the Poisson brackets. Such a description\nof the phase space will turn out very useful for our purposes allowing a clear identification of the\nNoether charges associated with space-time symmetries when the standard Poincaré Lie algebra is\nreplaced by a quantum (Hopf) algebra.\nWe will focus on the simplest example of a massless scalar field with Lagrangian\nZ\n1\n(∂α Φ∂ α Φ)\nL=\n2\nM\n\n(1)\n\nwhere M is the space-time manifold on which the theory is defined which in our particular case\nis just standard Minkowski space-time. The phase space of such theory is the infinite dimensional manifold Γ whose elements are the pairs {Φ, Π} where Π =\n\n∂L\n∂ Φ̇\n\nis the momentum (density)\n\ncanonically conjugate to Φ. Such definition requires singling out a time coordinate t, a choice\nthat obscures the relativistic invariance of the theory. The crucial observation [8] is that there is\nindeed a one-to-one correspondence between the points of the classical phase space and the space\nof solutions of the equation of motion\n\u0003Φ = 0 ,\n\n(2)\n\nthanks to the uniqueness properties of the initial value problem for such equation in Minkowski\nspace. In other words, in our geometrical description, points in phase space are identified with\n\n\f4\nsolutions of the classical equation of motion i.e. the phase space Γ is the space of solutions S.\nThe next step in the geometrical formulation is the definition of a symplectic structure through\nthe introduction of the non-degenerate two-form ω. To do so one needs to specify what are the\nfunctions, tangent and cotangent elements on S. A function on S is e.g. the map\nΦ(x) : Φ ∈ S → Φ(x) ∈ R ,\n\n(3)\n\nwhile a tangent vector δΦ ∈ T S is a small displacement in Φ which is compatible with (2)\n\u0003δΦ = 0 .\n\n(4)\n\nOne-forms on S are linear functionals on T S. For every δΦ ∈ T S its value at a space-time point\nx ∈ M is a real number so we can define a one-form δΦ(x) ∈ T ∗ S as a mapping\nδΦ(x) : δΦ ∈ T S → δΦ(x) ∈ R .\n\n(5)\n\nA general p-form will be written as [8]\nZ\nF = dx1 . . . dxp fx1 ***xp δΦ(x1 ) ∧ * * * ∧ Φ(xp )\n\n(6)\n\nwhere the integral is analogous to a sum over the indices x1 * * * xp and as usual 0-forms are just\nfunctions on S. One can define an exterior derivative δ mapping p-forms to p+1-forms, satisfying\nδ2 = 0 ,\n\nδ(F G) = (δF ) G + (−1)r(F ) F δ(G) ,\n\n(7)\n\nwhere r(F ) is the rank of F , whose action on functions and p-forms is given by\nZ\n∂f\nδΦ(x)\nδf = dx\n∂Φ(x)\nδF =\n\nZ\n\ndx1 . . . dxn\n\n(8)\n\n∂fx1 ***xn\nδΦ(x0 ) ∧ δΦ(x1 ) ∧ * * * ∧ Φ(xn ) .\n∂Φ(x0 )\n\nThe non-degenerate, symplectic 2-form ω will be defined by\n\u0012Z\n\u0013\ndσα J α\nω≡δ\n\n(9)\n\n(10)\n\nΣ\n\nwith the \"symplectic potential current\" J α defined by\nJα ≡\n\n∂L\nδΦ(x)\n∂(Φ,α )\n\n(11)\n\nwhere Φ,α = ∂α Φ is viewed as an independent field from Φ. It can be easily shown [8] that ω is\nPoincaré invariant and for a vector field tangent to the orbit of space-time symmetry Vs ∈ T S\nω(Vs ) = −δ(Qs )\n\n(12)\n\n\f5\nwhere Qs is the generator of the symmetry. In particular for a choice of Σ as the standard t = 0\nspace-like hypersurface (10) reduces to the more familiar expression for the symplectic form on the\nphase space manifold\n1\nω=\n2\n\nZ\n\nδΠ ∧ δΦ\n\n(13)\n\nΣt\n\nand\n1\nω(Vs ) =\n2\n\nZ\n\n(δΠ(Vs )δΦ − δΠδΦ(Vs )) .\n\n(14)\n\nΣt\n\nAs a vector space, S is isomorphic to the tangent space at any given point TΦ S. Through this\ncorrespondence the 2-form ω and the one form ω(Vs ) can be used to define, respectively, a bilinear\nand a linear functional on S. The bilinear will induce a symplectic product on S\nZ\n1\nω(Φ1 , Φ2 ) =\n(Π1 Φ2 − Φ1 Π2 )\n2 Σt\n\n(15)\n\nand the linear functional ω(Vs ) evaluated on a solution Φ will give the (conserved) value of the\nNoether charge associated with the symmetry\nZ\n\u0001\n1\n(L(Vs ) Π)Φ − Π(L(Vs ) Φ) = −Qs\nω(Vs )(Φ) =\n2 Σt\n\n(16)\n\nwhere the contraction of a 1-form with the Killing vector field Vs is replaced by the Lie derivative1\nof Φ ∈ S and its canonically conjugate momentum2 Π. When the Killing vector fields correspond\nto (external) space-time symmetries we will use the following notation for the action of the Lie\n(Hopf) algebra element associated with the symmetry on functions\nL(Mμν ) Φ = Mμν ⊲ Φ\n\n(17)\n\nto stress the fact that S is an ∞-dimensional representation of the Poincaré algebra.\nOn the space of complex solutions of the (massless) Klein-Gordon equation S C our symplectic\nstructure will define an hermitian inner product\n(Φ1 , Φ2 ) = −2i ω(Φ∗1 , Φ2 )\n1\n\n2\n\n(18)\n\nFrom the expression of the Lie derivative of a general p-form LVs F = (δF )(Vs ) + δ(F (Vs )) which for a function\n(0-form) implies LVs f = (δf )(Vs ).\nIn general, introducing the notion of \"covariant conjugate momenta\" [9] Πα = Φ,α , the expressions below can be\nwritten in covariant form as\nZ\n1\nα\ndσα (Πα\nω(Φ1 , Φ2 ) =\n1 Φ2 − Φ1 Π2 )\n2 Σ\nand\nZ\n`\n ́\n1\nω(Vs )(Φ) =\ndσα (L(Vs ) Πα )Φ − Πα (L(Vs ) Φ) = −Qs .\n2 Σ\n\n\f6\nwhere Φ∗i denotes the complex conjugate of Φ ∈ S C . It will be useful for our purposes to write\nsuch product in an explicit covariant form as\n(Φ1 , Φ2 ) =\n\nZ\n\np0 ∗\nd4 p\nδ(C(p))\nΦ̃ 1 (−p)Φ̃2 (p)\n3\n(2π)\n|p0 |\n\n(19)\n\nwhere Φ̃i (p), Φ ̃∗ i (p) are the Fourier transforms of Φi , Φ∗i and C(p) is the relativistic \"mass\" Casimir\nwhich relates the Fourier parameters pμ according to (2).\nNotice how all the formulas above are independent of the choice of basis of functions on S. In this\nletter will focus on the Noether charges associated with the space-time translation symmetries.\nAs we stressed in the previous section the latter can be expressed in terms of the action of the\nsymmetry algebra generators Pμ acting on the fields Φ and \"freezing\" such action, in a coordinate\nindependent way, using the conserved symplectic product. We have\n1\nQμ = (Φ, Pμ ⊲ Φ)\n2\n\n(20)\n\nwhich written in a explicit form reads\nQμ =\n\nB.\n\nZ\n\np0\nd4 p\nδ(C(p))\npμ Φ ̃∗ (−p)Φ̃(p) .\n3\n2(2π)\n|p0 |\n\n(21)\n\nRelativistic symmetries: from (Poincaré) Lie algebras to Hopf algebras\n\nAs mentioned in the introduction, the idea that Hopf algebras might replace the standard\nframework of Lie algebras in describing the symmetries of flat space-time, as it emerges from the\nlow-energy limit of a general theory of quantum gravity, has become increasingly popular in recent\nyears.\nIt is well known that the standard Poincarè algebra P can be endowed with the structure of a\n(trivial) Hopf algebra. If Y = {Pμ , Mμν } are the generators of P, the co-product, co-unit and\nantipode can be defined respectively as\n∆(Y ) = Y ⊗ 1 + 1 ⊗ Y, ǫ(Y ) = 0, S(Y ) = −Y .\n\n(22)\n\nWe will consider κ-deformations of relativistic symmetries described by a Hopf algebra in which\nboth the co-algebra sector and the product (commutator) of the algebra elements (symmetries\ngenerators) are deformed. In particular, in this letter, we will focus on the example of the κPoincarè Hopf algebra Pκ [10]. In the bicrossproduct basis [3] the deformed commutators for the\n\n\f7\ngenerators of translations P0 , Pi , rotations Mi and boosts Ni are\n[P0 , Pj ] = 0\n\n[Mj , Mk ] = iǫjkl Ml\n\n[P0 , Nl ] = −iPl\n\n[Mj , Nk ] = iǫjkl Nl\n\u0010 \u0010\n\u0011\n2P0\n[Pl , Nj ] = −iδlj κ2 1 − e− κ +\n\n[P0 , Mk ] = 0\n\n[Nj , Nk ] = iǫjkl Ml\n\u0011\n1 ~2\n+ κi Pl Pj\nP\n2κ\n\n[Pj , Mk ] = iǫjkl Pl\n\n(23)\n\nwhere ǫjkl is the Levi-Civita symbol and j, k, l are spatial indices.\nThe non-cocommutative coproducts are\n∆(Pj ) = Pj ⊗ 1 + e−P0 /κ ⊗ Pj\n\n∆(P0 ) = P0 ⊗ 1 + 1 ⊗ P0\n∆(Mj ) = Mj ⊗ 1 + 1 ⊗ Mj\n\n∆(Nj ) = Nj ⊗ 1 + e−P0 /κ ⊗ Nj +\n\nǫjkl\nPk ⊗ Nl .\nκ\n\n(24)\n\nthe antipodes\nS(Ml ) = −Ml\nS(P0 ) = −P0\nS(Pl ) = −e\nS(Nl ) = −e\n\nP0\nκ\nP0\nκ\n\nPl\nNl +\n\nP0\n1\nǫljk e κ Pj Mk ,\nκ\n\n(25)\n\nwhile for the co-units\nǫ(Pμ ) = ǫ(Mj ) = ǫ(Nk ) = 0.\n\n(26)\n\nThe (deformed) mass Casimir Cκ of the κ-Poincaré Hopf algebra links the generators of translations\nand is given by\nCκ =\n\nIII.\n\n\u0012\n\n2κ sinh\n\n\u0012\n\nP0\n2κ\n\n\u0013\u00132\n\n− P~ 2 e\n\nP0\nκ\n\n.\n\n(27)\n\nNOETHER CHARGES FOR κ-POINCARÉ HOPF ALGEBRA SYMMETRIES\n\nIn this section we consider a classical field theory with space-time symmetries described by the\nnon-trivial Hopf algebra introduced above. We will see how, in analogy with the standard case,\nthe phase space of the theory can be described in terms of the space of solutions of the deformed\nequation of motion. It will be shown how such a space, as a vector space, is isomorphic to the space\n\n\f8\nof solutions of the standard equations of motion. Such isomorphisms will enable us to introduce a\nconserved inner product on the κ-space of solutions and we shall use such product to express the\n(conserved) Noether charges associated with space-time translation operators providing a simplified\nderivation of the results obtained in [13].\nIn our Hopf algebra symmetry case plane waves will still be solutions of a deformed Klein-Gordon\nequation [15]. However wave exponentials labeled by a given value of the spatial momentum will\ncombine according to the coproduct structure of the non-trivial co-algebra sector of the Hopf\nalgebra. Seen from a dual space-time point of view [16] this corresponds to introducing a ∗multiplication for the algebra of functions on space-time coordinates. Roughly speaking any such\n∗-structure corresponds to a different choice of normal ordering for functions of non-commuting\ncoordinates or a different choice of basis for the generators of the κ-Poincaré (Hopf) algebra [11].\nUnlike the standard Lie-algebra symmetry case, in κ-Poincaré in the bicrossproduct basis, for each\nmode p~ the positive and negative real roots of the deformed mass Casimir Cκ (p) will not be equal\nin modulus. Infact there will be two real roots3 :\np0± (~\np) = κ log(Ω(~\np)± )\n\n(28)\n\nwhere Ω± (~\np) is a function of |~\np| and in our specific case reads\nΩ(~\np)± =\n\n1\n1∓\n\n|~\np|\nκ\n\n(29)\n\nIn the limit κ → ∞ the real part of each solution approaches the value of the standard roots\np0± = ±|~\np|.\nWe denote with SκC the spaces of (complex) solutions of the κ-Klein-Gordon equation. The set\no\nn\nof plane waves φκp~± , with the subscript p~± specifying plane waves whose momentum labels\nare on the positive or negative deformed mass-shell, will provide a basis for the associated vector\n\nspace SκC . In fact such functions are linearly independent (i.e. every finite sub-collection is linear\nindependent) and they span SκC . This can be easily seen introducing a linear map\nm : SκC → S C\n3\n\n(30)\n\nIn C we will actually have a countable infinite set of (complex) roots for Cκ (p) = 0. As it will become clear from\nour considerations below, each pair of such complex roots will correspond to a copy of the same deformed space\nof solutions. For our purposes the restriction to a single pair of (real) roots will be enough to construct a model\nof field theory with deformed relativistic symmetries.\n\n\f9\nwhich associates every element of SκC to its \"classical\" counterpart in S C . In particular we have\nfor a basis of plane wave solutions\nm(φκp~± ) = φp~± ,\n\n(31)\n\nwhere, with obvious notation, φp~± are standard plane wave solutions labeled by points on the\npositive or negative undeformed mass-shell p0± = ±|~\np|. The map m is an isomorphism of vector\nspaces (linear, one-to-one and onto), which proves the above claim. Notice here that, in analogy\nC and S C , spanned respectively\nwith the undeformed case, there will be two subspaces of SκC : Sκ+\nκ−\no\no\nn\nn\nby φκp~+ and φκp~− . These spaces are mapped into each other by deformed complex conjugation\n\nφ̄κp~+ = φκ−̇~p+ = φ~κk\n\n−\n\nwith ~k given by ~k = −~\npe\n\np+\n0\nκ\n\n(32)\n\nand the label −̇~\np± is a short hand notation meaning that we are taking\n\nthe antipode (25) of a four-momentum on-shell in the plane wave.\nBoth in the standard and in the κ-deformed case the spaces of positive and negative energy solutions\ncan be shown to be isomorphic to the spaces of functions on the positive and negative mass-shell,\nrespectively, through (non-commutative) Fourier transforms [11]. In analogy with a Weyl map\n[17] for functions of spacetime coordinates, using the map m one can associate every element in\nthe (commutative) algebra of functions of standard solutions with elements of a non-commutative\nalgebra of functions of deformed solutions. Indeed, using the notation introduced in (3) for functions\non S, we can write\n(Φ(x) ◦ m) * (Φ(y) ◦ m) = (Φ(x) ∗ Φ(y)) ◦ m\n\n(33)\n\nwhere Φ(x), Φ(y) are two distinct functions on S and ∗ is the non-commutative multiplication\nwhich turns the space of functions on S into a non-commutative algebra.\nAs a vector space SκC can be endowed with a symplectic structure if we require m to be a Poisson\nmap. More precisely we have that in general a map between Poisson manifolds M : P → Q, it is\nsaid to be a Poisson map iff\n{f1 , f2 }Q ◦ M = {f1 ◦ M, f2 ◦ M }P\n\n(34)\n\nwith f1 , f2 smooth functions on Q. Now suppose we go back for a moment to the space of \"standard\"\nreal solutions S. We have a map m : Sκ → S. Functions on S can be defined in analogy to Section\nII A and, keeping in mind the isomorphism between S and the space of functions on the mass-shells,\nas\nΦ(~\np) : Φ ∈ S → Φ̃(~\np) ∈ R\n\n(35)\n\n\f10\nwhere Φ̃(~\np) has support on the positive or negative undeformed mass-shells. Tangent vectors\nδΦ ∈ T S are small displacements in the field configuration (see Section II A). We have\n{Φ(~\np1 ), Φ(~\np2 )} = ω(δΦ1 , δΦ2 )\n\n(36)\n\nfrom which, as we stressed in Section II A, one can define a bilinear functional ω(Φ1 , Φ2 ) on S.\nOur Poisson map induces a symplectic structure on Sκ through\n{Φ(~\np1 ) ◦ m, Φ(~\np2 ) ◦ m}κ = {Φ(~\np1 ), Φ(~\np2 )} ◦ m .\n\n(37)\n\nThis, in turn, corresponds4 to a bilinear functional on Sκ given by\nωκ (Φκ1 , Φκ2 ) = (m−1 ⊗ m−1 )(ω(Φ1 , Φ2 )).\n\n(38)\n\nGoing back to the complexified spaces SκC and S C we can write down an explicit form of the\ndeformed hermitian product5 (Φ1 , Φ2 )κ = −2iωκ (Φ∗1 , Φ2 ) as\nZ\np0 3p0  ̃∗\nd4 p\nδ(Cκ (p))\ne κ Φ 1 (−̇p)Φ̃2 (p) ,\n(Φ1 , Φ2 )κ =\n3\n(2π)\n|p0 |\n\n(39)\n\nwhere Cκ (p), the deformed mass Casimir of κ-Poincaré, describes the deformed mass-shell and we\n\u0010\n\u0011∗\n3p0\nused the fact the following property Φ̃∗ (−̇p) = e− κ Φ̃(p) holds for κ-Fourier transforms [11].\nWe can now associate conserved quantities to the symmetries of the theory, in particular we can\n\nderive the energy and momentum charges associated with the κ-deformed translation symmetries\nfor each Φ ∈ SκC\nQκμ =\n\n1\n(Φ, Pμκ ⊲ Φ)κ\n2\n\nwhich written in explicit form is analogous to the result found in [13]\nZ\n3p0\nd4 p\np0\nκ\nQμ =\nδ(Cκ (p))\npμ e κ Φ ̃∗ (−̇p)Φ̃(p) .\n3\n2(2π)\n|p0 |\n\n(40)\n\n(41)\n\nEach choice of map m amounts to a choice of formalization of the same classical field theory and\nto the same class of deformed transformations. The point we would like to stress here is that the\napproach we followed naturally leads to a unique form of deformed Noether charges associated\nwith these new (Hopf algebra) translation symmetries.\n4\n\n5\n\nFixing a point Φ ∈ Sκ the condition for m to be a Poisson map translates into the following condition on the\nsymplectic 2-forms ω and ωκ\n(mΦ )∗ ⊗ (mΦ )∗ (ω)m(Φ) = (ωκ )Φ\n∗\nwith (ωκ )Φ ∈ Λ2Φ Sκ and (ω)m(Φ) ∈ Λ2m(Φ) S and where (mΦ )∗ : Tm(Φ)\nS → TΦ∗ Sκ is the pullback associated with m.\nHere we drop the superscript κ being now obvious that in the following we refer to elements of SκC .\n\n\f11\nIV.\n\nCONCLUSIONS\n\nWe have introduced a new (symplectic) geometrical approach to study classical field theories on\nnon-commutative spaces invariant under deformed (Hopf algebra) symmetries. The new formalism\nprovides a clear picture of how invariant quantities can be associated with the symmetries of the\ntheory. In particular we were able to derive the Noether charges relative to deformed translations\nin a rather simple way and see how they are univocally determined once a notion of deformed\nsymmetry transformation has been specified.\n\nAcknowledgments\n\nWe are very grateful to Giovanni Amelino-Camelia for stimulating discussions during the preparation of the present work. We would also like to thank Bianca Dittrich, Laurent Freidel and Jurek\nKowalski-Glikman for helpful remarks. AM would like to thank Perimeter Institute for hospitality\nwhile part of this work was being completed.\nResearch at Perimeter Institute for Theoretical Physics is supported in part by the Government of\nCanada through NSERC and by the Province of Ontario through MRI.\n\n[1] L. J. Garay, Int. J. Mod. Phys. A 10, 145 (1995) [arXiv:gr-qc/9403008].\n[2] G. Amelino-Camelia, arXiv:gr-qc/0201012; G. Amelino-Camelia, arXiv:gr-qc/0205125.\n[3] S. Majid and H. Ruegg, Phys. Lett. B 334, 348 (1994) [arXiv:hep-th/9405107].\n[4] M.\n\nChaichian,\n\nP.\n\nPresnajder\n\nand\n\nA.\n\nTureanu,\n\nPhys.\n\nRev.\n\nLett.\n\n94,\n\n151602\n\n(2005)\n\n[arXiv:hep-th/0409096].\n[5] G. Amelino-Camelia, L. Smolin and A. Starodubtsev, Class. Quant. Grav. 21, 3095 (2004)\n[arXiv:hep-th/0306134].\n[6] L. Freidel and E. R. Livine, Phys. Rev. Lett. 96, 221301 (2006) [arXiv:hep-th/0512113].\n[7] G. Amelino-Camelia, arXiv:astro-ph/0312014; G. Amelino-Camelia and S. Majid, Int. J. Mod. Phys.\nA 15, 4301 (2000) [arXiv:hep-th/9907110].\n[8] C. Crnkovic and E. Witten, Print-86-1309 (PRINCETON); C. Crnkovic, Class. Quant. Grav. 5, 1557\n(1988); C. Crnkovic, Nucl. Phys. B 288, 419 (1987).\n[9] H. Ozaki, Annals Phys. 319, 364 (2005).\n[10] J. Lukierski, A. Nowicki and H. Ruegg, Phys. Lett. B 293, 344 (1992).\n[11] A. Agostini, G. Amelino-Camelia and F. D'Andrea, Int. J. Mod. Phys. A 19, 5187 (2004)\n[arXiv:hep-th/0306013].\n\n\f12\n[12] J. Kowalski-Glikman and S. Nowak, Phys. Lett. B 539, 126 (2002) [arXiv:hep-th/0203040]; J. KowalskiGlikman and S. Nowak, Int. J. Mod. Phys. D 12, 299 (2003) [arXiv:hep-th/0204245].\n[13] A. Agostini, G. Amelino-Camelia, M. Arzano, A. Marciano and R. A. Tacchi, arXiv:hep-th/0607221.\n[14] L. Freidel, J. Kowalski-Glikman, S. Nowak arXiv:hep-th/0612170.\n[15] A. Agostini, G. Amelino-Camelia and M. Arzano, Class. Quant. Grav. 21, 2179 (2004)\n[arXiv:gr-qc/0207003].\n[16] G. Amelino-Camelia and M. Arzano, Phys. Rev. D 65, 084044 (2002) [arXiv:hep-th/0105120].\n[17] A. Agostini, F. Lizzi and A. Zampini, Mod. Phys. Lett. A 17, 2105 (2002) [arXiv:hep-th/0209174].\n\n\f"}