{"id": "http://arxiv.org/abs/hep-ph/0211374v1", "guidislink": true, "updated": "2002-11-24T22:30:07Z", "updated_parsed": [2002, 11, 24, 22, 30, 7, 6, 328, 0], "published": "2002-11-24T22:30:07Z", "published_parsed": [2002, 11, 24, 22, 30, 7, 6, 328, 0], "title": "Transverse Polarization Signatures of Extra Dimensions at Linear\n  Colliders", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0211071%2Chep-ph%2F0211424%2Chep-ph%2F0211002%2Chep-ph%2F0211137%2Chep-ph%2F0211322%2Chep-ph%2F0211430%2Chep-ph%2F0211395%2Chep-ph%2F0211358%2Chep-ph%2F0211324%2Chep-ph%2F0211390%2Chep-ph%2F0211429%2Chep-ph%2F0211186%2Chep-ph%2F0211201%2Chep-ph%2F0211334%2Chep-ph%2F0211166%2Chep-ph%2F0211099%2Chep-ph%2F0211371%2Chep-ph%2F0211293%2Chep-ph%2F0211119%2Chep-ph%2F0211411%2Chep-ph%2F0211323%2Chep-ph%2F0211070%2Chep-ph%2F0211396%2Chep-ph%2F0211465%2Chep-ph%2F0211276%2Chep-ph%2F0211003%2Chep-ph%2F0211127%2Chep-ph%2F0211363%2Chep-ph%2F0211442%2Chep-ph%2F0211385%2Chep-ph%2F0211259%2Chep-ph%2F0211090%2Chep-ph%2F0211039%2Chep-ph%2F0211044%2Chep-ph%2F0211207%2Chep-ph%2F0211076%2Chep-ph%2F0211236%2Chep-ph%2F0211284%2Chep-ph%2F0211138%2Chep-ph%2F0211043%2Chep-ph%2F0211152%2Chep-ph%2F0211146%2Chep-ph%2F0211337%2Chep-ph%2F0211374%2Chep-ph%2F0211389%2Chep-ph%2F0211243%2Chep-ph%2F0211148%2Chep-ph%2F0211158%2Chep-ph%2F0211383%2Chep-ph%2F0211223%2Chep-ph%2F0211081%2Chep-ph%2F0211169%2Chep-ph%2F0211047%2Chep-ph%2F0211421%2Chep-ph%2F0211453%2Chep-ph%2F0211185%2Chep-ph%2F0211213%2Chep-ph%2F0211048%2Chep-ph%2F0211366%2Chep-ph%2F0211328%2Chep-ph%2F0211021%2Chep-ph%2F0211441%2Chep-ph%2F0211295%2Chep-ph%2F0211086%2Chep-ph%2F0211310%2Chep-ph%2F0211299%2Chep-ph%2F0211056%2Chep-ph%2F0211279%2Chep-ph%2F0211308%2Chep-ph%2F0211142%2Chep-ph%2F0211114%2Chep-ph%2F0211331%2Chep-ph%2F0211045%2Chep-ph%2F0211046%2Chep-ph%2F0211130%2Chep-ph%2F0211113%2Chep-ph%2F0211320%2Chep-ph%2F0211346%2Chep-ph%2F0211181%2Chep-ph%2F0211422%2Chep-ph%2F0211426%2Chep-ph%2F0211433%2Chep-ph%2F0211289%2Chep-ph%2F0211450%2Chep-ph%2F0211028%2Chep-ph%2F0211353%2Chep-ph%2F0211041%2Chep-ph%2F0211319%2Chep-ph%2F0211252%2Chep-ph%2F0211084%2Chep-ph%2F0211316%2Chep-ph%2F0211190%2Chep-ph%2F0211372%2Chep-ph%2F0211417%2Chep-ph%2F0211438%2Chep-ph%2F0211451%2Chep-ph%2F0211413%2Chep-ph%2F0211079%2Chep-ph%2F0211326%2Chep-ph%2F0211013%2Chep-ph%2F0211108&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Transverse Polarization Signatures of Extra Dimensions at Linear\n  Colliders"}, "summary": "If significant longitudinal polarization of both the electrons and positrons\nbecomes feasible at a future linear collider(LC), it may be possible to use\nspin rotators to produce transversely polarized beams. Using the transverse\npolarization of both beams, new azimuthal spin asymmetries can be formed which\nwill be sensitive probes for new physics beyond the Standard Model. Here we\ndemonstrate that these asymmetries are particularly sensitive to the exchange\nof Kaluza-Klein towers of gravitons, or other spin-2 fields, that are predicted\nto exist in higher dimensional theories which address the hierarchy problem.\nThese new asymmetries are shown to be able to extend the search reach for such\nnew physics by more than a factor of two, provide an additional tool for\nisolating the signatures for spin-2 exchange up to mass scales in excess of\n$10\\sqrt s$, and can be used to help differentiate among the proposed solutions\nto the hierarchy problem below the production threshold for new particles.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0211071%2Chep-ph%2F0211424%2Chep-ph%2F0211002%2Chep-ph%2F0211137%2Chep-ph%2F0211322%2Chep-ph%2F0211430%2Chep-ph%2F0211395%2Chep-ph%2F0211358%2Chep-ph%2F0211324%2Chep-ph%2F0211390%2Chep-ph%2F0211429%2Chep-ph%2F0211186%2Chep-ph%2F0211201%2Chep-ph%2F0211334%2Chep-ph%2F0211166%2Chep-ph%2F0211099%2Chep-ph%2F0211371%2Chep-ph%2F0211293%2Chep-ph%2F0211119%2Chep-ph%2F0211411%2Chep-ph%2F0211323%2Chep-ph%2F0211070%2Chep-ph%2F0211396%2Chep-ph%2F0211465%2Chep-ph%2F0211276%2Chep-ph%2F0211003%2Chep-ph%2F0211127%2Chep-ph%2F0211363%2Chep-ph%2F0211442%2Chep-ph%2F0211385%2Chep-ph%2F0211259%2Chep-ph%2F0211090%2Chep-ph%2F0211039%2Chep-ph%2F0211044%2Chep-ph%2F0211207%2Chep-ph%2F0211076%2Chep-ph%2F0211236%2Chep-ph%2F0211284%2Chep-ph%2F0211138%2Chep-ph%2F0211043%2Chep-ph%2F0211152%2Chep-ph%2F0211146%2Chep-ph%2F0211337%2Chep-ph%2F0211374%2Chep-ph%2F0211389%2Chep-ph%2F0211243%2Chep-ph%2F0211148%2Chep-ph%2F0211158%2Chep-ph%2F0211383%2Chep-ph%2F0211223%2Chep-ph%2F0211081%2Chep-ph%2F0211169%2Chep-ph%2F0211047%2Chep-ph%2F0211421%2Chep-ph%2F0211453%2Chep-ph%2F0211185%2Chep-ph%2F0211213%2Chep-ph%2F0211048%2Chep-ph%2F0211366%2Chep-ph%2F0211328%2Chep-ph%2F0211021%2Chep-ph%2F0211441%2Chep-ph%2F0211295%2Chep-ph%2F0211086%2Chep-ph%2F0211310%2Chep-ph%2F0211299%2Chep-ph%2F0211056%2Chep-ph%2F0211279%2Chep-ph%2F0211308%2Chep-ph%2F0211142%2Chep-ph%2F0211114%2Chep-ph%2F0211331%2Chep-ph%2F0211045%2Chep-ph%2F0211046%2Chep-ph%2F0211130%2Chep-ph%2F0211113%2Chep-ph%2F0211320%2Chep-ph%2F0211346%2Chep-ph%2F0211181%2Chep-ph%2F0211422%2Chep-ph%2F0211426%2Chep-ph%2F0211433%2Chep-ph%2F0211289%2Chep-ph%2F0211450%2Chep-ph%2F0211028%2Chep-ph%2F0211353%2Chep-ph%2F0211041%2Chep-ph%2F0211319%2Chep-ph%2F0211252%2Chep-ph%2F0211084%2Chep-ph%2F0211316%2Chep-ph%2F0211190%2Chep-ph%2F0211372%2Chep-ph%2F0211417%2Chep-ph%2F0211438%2Chep-ph%2F0211451%2Chep-ph%2F0211413%2Chep-ph%2F0211079%2Chep-ph%2F0211326%2Chep-ph%2F0211013%2Chep-ph%2F0211108&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "If significant longitudinal polarization of both the electrons and positrons\nbecomes feasible at a future linear collider(LC), it may be possible to use\nspin rotators to produce transversely polarized beams. Using the transverse\npolarization of both beams, new azimuthal spin asymmetries can be formed which\nwill be sensitive probes for new physics beyond the Standard Model. Here we\ndemonstrate that these asymmetries are particularly sensitive to the exchange\nof Kaluza-Klein towers of gravitons, or other spin-2 fields, that are predicted\nto exist in higher dimensional theories which address the hierarchy problem.\nThese new asymmetries are shown to be able to extend the search reach for such\nnew physics by more than a factor of two, provide an additional tool for\nisolating the signatures for spin-2 exchange up to mass scales in excess of\n$10\\sqrt s$, and can be used to help differentiate among the proposed solutions\nto the hierarchy problem below the production threshold for new particles."}, "authors": ["Thomas G. Rizzo"], "author_detail": {"name": "Thomas G. Rizzo"}, "author": "Thomas G. Rizzo", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/1126-6708/2003/02/008", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/hep-ph/0211374v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-ph/0211374v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "22 pages, 6 figs. LaTex", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-ph/0211374v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-ph/0211374v1", "journal_reference": "JHEP 0302 (2003) 008", "doi": "10.1088/1126-6708/2003/02/008", "fulltext": "SLAC-PUB-9564\nNovember 2002\n\nTransverse Polarization Signatures of Extra\nDimensions at Linear Colliders ∗\n\narXiv:hep-ph/0211374v1 24 Nov 2002\n\nThomas G. Rizzo\nStanford Linear Accelerator Center\nStanford University\nStanford CA 94309, USA\nAbstract\nIf significant longitudinal polarization of both the electrons and positrons becomes\nfeasible at a future linear collider(LC), it may be possible to use spin rotators to produce\ntransversely polarized beams. Using the transverse polarization of both beams, new\nazimuthal spin asymmetries can be formed which will be sensitive probes for new\nphysics beyond the Standard Model. Here we demonstrate that these asymmetries\nare particularly sensitive to the exchange of Kaluza-Klein towers of gravitons, or other\nspin-2 fields, that are predicted to exist in higher dimensional theories which address\nthe hierarchy problem. These new asymmetries are shown to be able to extend the\nsearch reach for such new physics by more than a factor of two, provide an additional\n√\ntool for isolating the signatures for spin-2 exchange up to mass scales in excess of 10 s,\nand can be used to help differentiate among the proposed solutions to the hierarchy\nproblem below the production threshold for new particles.\n\n∗\n\nWork supported by the Department of Energy, Contract DE-AC03-76SF00515\n\n\f1\n\nIntroduction\n\nNew Physics beyond the Standard Model (SM) is expected to lie at or near the TeV scale on\nrather general grounds. Once this scale is probed by future colliders, such at the LHC and\nthe Linear Collider (LC), this new physics should begin to show itself. What is uncertain\nis the form this manifestation will take. The most straightforward scenario to visualize and\nanalyze experimentally would be the production of new particles such as SUSY or KaluzaKlein resonances. A second possibility is that new processes which are not allowed within\nthe SM framework will begin to be observed; it may be very difficult in this case to access\nthe underlying theory. Lastly, one can imagine that the data begins show small deviations\nfrom the SM predictions for various observables, e.g., cross sections and asymmetries, which\ngrow with increasing energy. This last possibility signals the existence of new physics beyond\nthe kinematic reach of the collider which is manifesting itself in the form of higher dimensional operators, i.e., generalized contact interactions. These operators can arise from the\nexchanges of new particles, too massive to be directly produced, with different spins and in\nvarious channels depending upon the particular model. From the literature it is easy to construct a rather long list of potential new physics scenarios of this type; clearly this list does\nnot exhaust all of the possibilities: a Z ′ from an extended gauge model[1, 2], scalar or vector\nleptoquarks[1, 3], R-parity violating sneutrino(ν̃) exchange[4], scalar or vector bileptons[5],\ngraviton Kaluza-Klein(KK) towers[6, 7] in extra dimensional models[8, 9], gauge boson KK\ntowers[10, 7], and even string excitations[11].\nIf such deviations are observed it will be necessary to have techniques available to\ndifferentiate the multiple possibilities experimentally and point us in the direction of the\ncorrect scenario. One possible path to take if this situation is realized is to compare the\nobserved shifts with the predictions of all of the currently available models[12]. An alternative\nto this approach is to develope specific tools to rapidly identify certain classes of models which\n1\n\n\flead to uniquely distinct signatures. In this paper we examine one such tool which becomes\navailable at the LC provided both the e− and e+ beams are initially longitudinally polarized\nand spin rotators are used to convert these to transversely polarized beams. As we will see\nbelow, transverse polarization (TP)[13] allows for new asymmetries to be constructed which\nare associated with the azimuthal angle formed by the directions of the e± polarization and\nthe plane of the momenta of the outgoing fermions in the e+ e− → f f ̄ process. Historically,\nthe possible use of TP as a tool for new physics searches and analyses has not gotten the\nattention it deserves in the literature[13]. Here, in an effort to partially remedy this situation,\nwe are interested in using the associated TP asymmetries to uniquely probe for the s-channel\nexchange of spin-2 fields in e+ e− collisions which we normally associate with the KaluzaKlein graviton towers of the Arkani-Hamed, Dimopoulos and Dvali(ADD)[8] or RandallSundrum(RS)[9] scenarios.\nThe organization of this paper is as follows. After our introduction, we outline the\ninfluence of transverse polarization on the process e+ e− → f f ̄ in the presence of graviton\nexchange in both the ADD and RS scenarios. In particular we examine how the new asymmetries associated with transverse polarization can be used to probe for spin-2 graviton-like\nexchanges. In section 3 we analyze these asymmetries in detail and their applications for\nspin-2 exchange identification at a future LC. We demonstrate the usefulness of TP in distinguishing s-channel spin-2 exchange from other possible new physics scenarios. We will see\nthat TP allows one to expand the sensitivity range for the cutoff scale over which graviton\nKK exchange can be observed by up to a factor of two. We also show that TP may allow us\nto differentiate the ADD and RS scenarios below KK production threshold. Our conclusions\ncan be found in Section 4.\n\n2\n\n\f2\n\nTransverse Polarization Asymmetries\n\nFor our analysis we will follow a slightly modified version of the notations and conventions\nemployed by Hikasa[13]. Consider the process e+ e− → f f ̄ with the both electron and\npositron beams polarized. We will denote the linear and transverse components of the e− (e+ )\n′\npolarizations by PL,T (PL,T\n) and for simplicity assume that the two transverse polarization\n\nvectors are parallel up to a sign. In this case, the spin-averaged matrix element for this\nprocess can be written as\n|M̄|2 =\n\n1\n(1 − PL PL′ )(|T+ |2 + |T− |2 ) + (PL − PL′ )(|T+ |2 − |T− |2 )\n4\n\n+ (2PT PT′ )[cos 2φ Re(T+ T−∗ ) − sin 2φ Im(T+ T−∗ )] ,\n\n(1)\n\nwhere φ is the azimuthal angle defined on an event-by-event basis described above. (Note\nthat φ is defined in such a way so that the 2 → 2 process always takes place in the φ =\n0 plane.) It is interesting to note that the φ−dependent pieces of |M̄|2 are particularly\nsensitive to the relative phases between the two sets of amplitudes. We also observe from\nthis expression the important fact that the φ-dependent pieces are only accessible if both\nbeams are simultaneously transversely polarized. Thus to have azimuthal asymmetries at a\nLC we must begin with both beams longitudinally polarized and employ spin rotators.\nLet us first consider the simple case with massless fermions in the final state assuming\nno s−channel scalar exchanges are present. Let us define the quantities\nfLL = Qe Qf + gZ (ve − ae )(vf − af )P\nfRR = Qe Qf + gZ (ve + ae )(vf + af )P\nfLR = Qe Qf + gZ (ve − ae )(vf + af )P\nfRL = Qe Qf + gZ (ve + ae )(vf − af )P ,\n3\n\n(2)\n\n\fwhere ve , ae (vf , af ) are the vector and axial vector couplings of the initial electron(final\nfermion) to the Z and Qe,f are their corresponding electric charges, with\nGF M 2\ngZ = √ Z ,\n2 2πα\n\n(3)\n\nand\nP =\n\ns−\n\nMZ2\n\ns\n.\n+ iMZ ΓZ\n\n(4)\n\nWithout scalar exchange but allowing for the possibility of spin-2 the relevant helicity amplitudes for this process are given by\n+−\nT+−\n= fLL (1 + z) − fg (z + 2z 2 − 1)\n−+\nT+−\n= fLR (1 − z) − fg (z − 2z 2 + 1)\n+−\nT−+\n= fRL (1 − z) − fg (z − 2z 2 + 1)\n−+\nT−+\n= fRR (1 + z) − fg (z + 2z 2 − 1) .\n\n(5)\n\nwhere z = cos θ. Note that the spin-2 exchange merely augments the amplitudes which are\nalready present in the SM(though with different cos θ dependencies), i.e., no new helicity\namplitudes are generated by spin-2 over those due to spin-1. In contrast to this, scalar\n++\nexchange would yield additional amplitudes of the form T++\netc. not present in the SM and\n\nwould thus be easily isolated using the more conventional asymmetries associated with two\nbeam longitudinal polarization[4]. Clearly isolating spin-2 exchange will be somewhat more\ndifficult since no new amplitudes appear. fg is a model-dependent quantity; in the usual\nADD model, employing the convention of Hewett[6], one finds\n\nfg =\n\nλs2\n.\n4παMH4\n4\n\n(6)\n\n\fwhere MH represents the cutoff scale in the KK graviton tower sum and λ = ±1. In the RS\nmodel the corresponding expression can be obtained through the replacement\n−1 X\n1\nλ\n→\n.\n4\n2\n2\nMH\n8Λπ n s − mn + imn Γn\n\n(7)\n\nwhere Λπ is of order a few TeV and mn (Γn ) are the masses(widths) of the TeV scale graviton\nKK excitations. In what follows we will always assume that we are below the threshold for\nthe production of these resonances otherwise the spin-2 nature of the new exchange would be\neasily identified through an examination of the resonances themselves. We will also assume\nthat we are sufficiently distant from these resonances in energy that there widths can be\nneglected in cross section calculations.\nIn the case of massive final state fermions, such as tops, the helicity amplitudes given\n±±\n±±\nabove are slightly altered and new amplitudes T+−\nand T−+\nare also present. The exact\n\nforms of these expressions in this case are not very enlightening so we will not present them\nhere but they will be included in the analysis in the case of top quark pair production.\nWhat is the form or the angular distribution, dσ/dzdφ, in the SM? (Here we define\nz = cos θ as above.) In particular, we are interested in the z-dependence of the terms\nassociated with cos 2φ and sin 2φ in the expression above when no new physics is present.\nWe note that the a small 'imaginary' term will be present even in the SM due to the finite\n√\nwidth of Z. For s ≥ 500 GeV this term can be safely neglected for most of our analyses\nhere but we include it for completeness. As shown in, e.g., the work of Hikasa, both of these\nφ-dependent terms are always proportional to 1−z 2 in the SM and will remain so even if new\ngauge boson exchanges are present. However, due to the more complex z-dependence of the\nspin-2 contributions to the helicity amplitudes we expect significant modifications of the SM\nresult when gravitons are exchanged. In fact, interference between SM and spin-2 exchange\namplitudes are found to produce both even and odd−z terms with the latter proportional\n5\n\n\fto ∼ z(1 − z 2 ) whereas the smaller pure gravity terms are instead found to be even in z and\nproportional to z 2 − (2z 2 − 1)2 . The general difference in the z-dependence of the of the φ\nsensitive terms and, in particular, the existence of the odd-z contributions is clearly a signal\nfor spin-2 exchange. We note in passing that in the case of scalar exchange no odd-z terms\nwill be generated since the spin-0 and spin-1 exchanges do not interfere.\nLet us assume, as mentioned above, that we are in an energy regime where the effects\nof the finite width of the Z can be neglected. For the moment, this would seem to imply\nthat the term proportional to sin 2φ can be neglected in the case of KK graviton exchange.\nLet us proceed making this assumption but remembering to return to this important point\nbelow. We will later see that the terms that we now neglecting will have no influence on this\npart of our analysis. In order to attempt to isolate the spin-2 exchange contributions we first\ncan form a differential azimuthal asymmetry distribution which we symbolically define by\n1 dA\n=\nN dz\nwhere\n\nR\n\n±\n\n\"R\n\ndσ\n+ dzdφ\n\nR\n\n−\n\ndσ\n− dzdφ\n\nR\n\ndσ\n\n#\n\n,\n\n(8)\n\nare integrations over regions where cos 2φ takes on ± values; integration over the\n\nfull ranges of z and φ occurs in the denominator. It is important to note that we expect\nthis differential asymmetry to take on rather small numerical values since it is normalized\nto the total cross section and not to the differential cross section at the same value of z as is\nusually done. As we will see below, this particular normalization is most useful in isolating\nthe most important aspects of TP physiucs. To get a feeling for this asymmetry, we show its\nbehaviour for both the SM and in the ADD scenario in Fig.1 at a 500 GeV LC for the final\nstates f = μ or τ, c and b. Note that from here on we will combine results for the f = μ and\nτ final states to get added statistics. In this figure we have for concreteness assumed that\nthe spin rotators are nearly 100% efficient[14] so that PT = 0.8 and PT′ = 0.6. Note that the\nspin-2 effects are large and in particular the fact that the azimuthal asymmetry distribution\n6\n\n\fis no longer symmetric under z → −z as we might expect from the discussion above.\nThere are two ways to naively access the odd-z terms. First, one can take the differential azimuthal asymmetry defined above, separately integrate it over positive and negative values of z, then take the difference, i.e., form a forward-backward asymmetry using\nN −1 dA/dz:\nAF B\n\n1\n=\nN\n\n\"Z\n\nz≥0\n\ndA\n−\ndz\ndz\n\nZ\n\nz≤0\n\n#\n\ndA\n.\ndz\ndz\n\n(9)\n\nIt is important to be reminded that in the SM and in any new physics scenario with s-channel\nZ ′ exchanges one has AF B = 0. This is also true in the usual four-fermion contact interaction\nscenario[16] which involves only vector and axial-vector couplings. Due to the nature of spin0 exchange it is clear that AF B would remain zero in this case as well. A second possibility\nis to take odd moments of the asymmetry with respect to, e.g., the Legendre polynomials\nPn (z)[15]:\n\"\n#\ndA\n1 Z\ndz Pn (z)\n.\n< Pn >=\nN\ndz\n\n(10)\n\nNote that only < P1,3 > will be non-zero in this case since no factors of z 5 appear in the\ncross section. As in the case of AF B , these moments are zero in both the SM and Z ′ models.\nIn the case of graviton exchange, not only are the moments < P1,3 > non-zero, they are also\nnot independent of each other. A short analysis finds that in the case of spin-2 exchange the\nratio of moments is fixed: < P3 > / < P1 >= −3/7, uniquely. It is thus rather obvious that\nthe existence of odd-z terms is a signal for graviton, or more generally, spin-2 exchange.\n\n7\n\n\f8\nFigure 1: Differential azimuthal asymmetry distribution\nfor e+ e− → f f ̄ at a 500 GeV LC\n−1\nassuming a luminosity of 500 f b . The histograms are the SM predictions while the data\npoints assume the ADD model with MH = 1.5 TeV. In the top panel f = μ and τ are\ncombined, while in the middle(lower) panel, f = c(b). PT = 0.8 and PT′ = 0.6 are assumed.\n\n\f3\n\nAnalysis\n\nIt is clear that non-zero values of either AF B or < P1,3 > provide a clean signature for spin-2\nexchange in the e+ e− → f f ̄ process. Their appearance at the level of 5σ can thus be claimed\nas, not just a discovery of new physics, but spin-2 exchange in particular. To be specific in\nwhat follows let us concentrate on the ADD model; (almost) all limits obtained there can be\nimmediately translated to the case of the RS scenario. From Fig.1 it is apparent that modest\nvalues of MH cause quite sizeable distortions in the N −1 dA/dz distribution. However, as we\nwill see this sensitivity is somewhat diluted if we are only asking whether or not, e.g. AF B\nis non-zero. After all the asymmetry distribution may be quite different than what the SM\npredicts in both magnitude and shape and yet AF B will remain zero. Such a possibility\nwill occur in the case of , e.g., spin-0 exchange. To determine the 5σ identification reach\nwe will assume that the individual polarizations are known rather well, δP/P = 0.003, that\nthe efficiencies of identifying the final state fermions is rather high: 100% for f = μ, τ , 60%\nfor f = c, t, and 80% for f = b with no associated systematic uncertainties and include the\neffects of initial state radiation. The 5σ identification reaches, making these assumptions,\n√\nare shown in Figs. 2 and 3 for different values of s as functions of the integrated luminosity.\nIn obtaining these results we have combined all of the various final states above into a single\nfit. In all cases a small angle cut of 100 mrad around the beam pipe has been employed; our\nresults are not particularly sensitive to this value.\nThese reaches are, as one might expect, somewhat sensitive to the fact that we have\nassumed values of PT = 0.8 and PT′ = 0.6. If the efficiency of the spin rotators is somewhat less than ∼ 100% or if such high initial longitudinal polarizations are not achieved\nthe 5σ identification reach will clearly degrade. This reduction in reach will not be very\nserious unless the product PT PT′ is very greatly reduced or unless other errors dominate the\n\n9\n\n\fFigure 2: 5σ identification reach in MH using AF B as a function of the integrated luminosity\nfrom the process e+ e− → f f ̄, with f summed over μ, τ, b, c and\n√ t. Here PT = 0.8 and\nPT′ = 0.6 are assumed. From bottom to top the curves are for s = 0.5, 0.8, 1, 1.2 and 1.5\nTeV, respectively.\n\n10\n\n\fexperimental uncertainties in the measurements.\nFrom these two figures some immediate conclusions can be drawn. First, it is clear\nthat the identification reach obtained from AF B is somewhat superior to that obtained from\nthe measurements of < P1,3 >. Secondly, it is clear that the identification reach in either case\n√\nalone, MH ∼ (3.5 − 4) s, is not as good as what can be obtained employing longitudinal\npolarization[15]. Thirdly, it is unclear that combining the two sets of observables would be\nvery useful since AF B is correlated with the values of < P1,3 >. In order to obtain better\nreaches we must try something more aggressive.\n\nFigure 3: Same as the previous figure but now using the moments < P1,3 >.\nWe noted above that in the SM, in all Z ′ models and in the case of conventional fourfermion contact interactions the azimuthal asymmetry always takes the form N −1 dA/dz ∼\n(1 − z 2 ). Clearly these specific forms of new physics will only modify the normalization\nof the azimuthal asymmetry distribution since its shape is left unaltered. We can thus\nask up to what value of the cutoff scale, MH , can we differentiate the effects of gravity–a\n11\n\n\fchange in the shape of these distributions–from a simple overall change in the normalization\nof distributions for the various final states. This allows us to set a limit on the value of\nMH below which graviton exchange can be distinguished from Z ′ exchange or four-fermion\ncontact interactions. To do this we fix MH and try to fit the N −1 dA/dz distributions for\nμ, τ , c and b final states assuming a SM shape but allowing the normalization to float\nindependently for each final state. If the CL of the fit is very poor we raise MH until we\nachieve a CL equivalent to 5σ, i.e., 5.7 × 10−5 . For luminosities above 100 − 200 f b−1\nthe errors are completely dominated by systematics and we find the results shown in Table\n1. (Changing the luminosities in our range of interest\n\n1\n2\n\n− 2 f b−1 has little quantitative\n\neffect and only modifies the second decimal place in these results.) Here we see that for\n√\n′\nMH <\n∼ (10 − 11) s the effects of spin-2 graviton exchange can be distinguished from a Z\nor any form of the four-fermion contact interactions. This identification reach is numerically\nsimilar to the 95% CL discovery reach for graviton exchange obtained using only singly\nlongitudinally polarized beams[15, 17, 18] for the same process. Since these results are so\ndominated by the systematics it is important that a more detailed study of this type be\nperformed using a realistic detector simulation since the likely size of the true systematic\nerrors will be somewhat larger than those assumed in this analysis. However, the reach here\nis so large it is clear that this is an avenue worth persuing.\nGiven these results we can go a step further. If graviton and Z ′ exchanges can be\n√\n< (10 − 11) s using TP, what is the corresponding 95% CL search\ndistinguished up to MH ∼\nreach for graviton exchange obtainable with TP? For this type of analysis we assume that the\nN −1 dA/dz distributions for each final state fermion are given by their SM values and ask at\nwhat value of MH the corresponding ones with graviton exchange become indistinguishable\nfrom these. Again we find that above very modest integrated luminosities the errors are\ncompletely dominated by systematics; we thus expect our results to again be on the high\n\n12\n\n\fECM (GeV) Reach (TeV)\n500\n\n5.4\n\n800\n\n8.8\n\n1000\n\n11.1\n\n1200\n\n13.3\n\n1500\n\n16.7\n\nTable 1: Identification reach for MH in the ADD model assuming the distribution\nN −1 dA/dz ∼ 1 − z 2 and varying the individual normalizations for the final states f = μ, τ ,\nf = b and f = c for LC of different center of mass energies.\n\nside of what would be obtained in a more detailed detector study. These results are shown in\n√\n> 20 s. These are such enormous\nTable 2 where we see that the values are in the range MH ∼\nnumbers that even a degradation by 30 − 40% would lead to the highest search reaches for\nKK graviton exchange found so far in the literature[18].\nECM (GeV) Reach (TeV)\n500\n\n10.2\n\n800\n\n17.0\n\n1000\n\n21.5\n\n1200\n\n26.0\n\n1500\n\n32.7\n\nTable 2: 95% CL search reach for MH as described in the text.\n\nGiven the great sensitivity of transverse polarization to KK graviton/spin-2 exchange\nit would be natural to ask if TP can be used to distinguish the ADD from the RS model\nscenarios below KK production threshold. At first, there would seem to be no difference\nbetween the predictions of these two models for the situation under discussion. In the RS\n\n13\n\n\fmodel, if we are away from the Z and graviton KK poles the imaginary part of amplitude\nwhich enters the term proportional to sin 2φ becomes vanishingly small. However, as was\nrecently pointed out by Datta, Gabrielli and Mele[19], the exchange of an essentially continuous spectrum of ADD gravitons leads to a finite, cutoff-independent imaginary part of the\n√\namplitude. This forgotten piece grows very rapidly with increasing s and depends quite\nsensitively upon the number of extra dimensions. Since this term is finite it directly probes\nthe effective fundamental Planck scale of the extra-dimensional theory. Using the notation\nemployed above one now finds that fg has an grown imaginary part:\n\"\n#\n√\nλs2\nπMH4 ( s)δ−2 Sδ−1\nfg =\n1−i\n,\n4παMH4\n16MDδ+2\n\n(11)\n\nwhere δ is the number of extra dimensions, MD is the δ dimensional fundamental scale and\nSδ−1 is the area of the δ sphere. We again note that the magnitude of this new imaginary\npart, unlike the real part as parameterized in the Hewett scheme, depends quite strongly on\nthe number of extra dimensions.\nTo proceed we can form a new asymmetry in analogy to the above:\n1 dAi\n=\nN dz\nwhere now the\n\nR\n\n±\n\ndσ\n+ dzdφ\n\n\"R\n\nR\n\n−\n\nR\n\ndσ\n\ndσ\n− dzdφ\n\n#\n\n,\n\n(12)\n\nare integrations over regions where sin 2φ takes on ± values and we\n\nintegrate over all z and φ in the denominator as before. We note that when we perform the\nintegrations in this manner all terms proportional to cos 2φ are found to cancel implying that\nthere is no cross contamination from this other asymmetry source. (This also implies that\nall of our analyses above will go through even if a term proportional to sin 2φ is present.)\nOf course this new distribution is identically zero in both the SM as well as the RS model\naway from the Z and RS KK graviton poles. Thus, observing any non-zero value for this\n14\n\n\fFigure 4: The N −1 dAi /dz distributions at a 500 GeV collider assuming MH = MD = 1.5\nTeV and δ = 3 with an integrated luminosity of 500 f b−1 . The plotted points from top to\nbottom in the center of the plot correspond to f = b, μ plus τ and c, respectively.\nquantity is a signal for the ADD model. This is particularly true after the spin-2 nature of the\nexchange has already been established. Fig 4 shows how these new asymmetry distributions\nmay appear at a 500 GeV LC assuming as before that PT = 0.8 and PT′ = 0.6 and taking\nδ = 3 for purposes of demonstration. (We do not consider the case δ = 2 here as the bounds\non the scale MD in this case are in excess of ∼ 100 TeV[18]). For simplicity we have assumed\nMH = MD in this figure and will continue to do so in our discussion below; we expect these\ntwo mass scales to be reasonably comparable, though if for some reason MH << MD this\nwould lead to a serious modification in the sensitivity to this observable.\nAssuming a value of δ we can ask up to what value of MH = MD we can determine\nthat the N −1 dAi /dz distribution is non-zero at the 5σ level. Based on the expression above\nwe expect that this reach will be reasonably sensitive to the value of δ; this is indeed what we\n\n15\n\n\fFigure 5: 5σ reach for the discovery of a nonzero value of the azimuthal asymmetry\nN −1 dAi /dz distribution as a function of the integrated luminosity at a LC. The top(bottom)\npanel\nis for δ = 3(4). Within each panel, from bottom to top the curves are for\n√\ns = 0.5, 0.8, 1, 1.2 and 1.5 TeV, respectively. MH = MD is assumed throughout as is\nPT = 0.8 and PT′ = 0.6.\n\n16\n\n\ffind from Figs. 5-6 which show the resulting reaches at the 5σ level for the range δ = 3 − 6.\nThe first thing to notice is that the sensitivity to this imaginary term decreases as δ is\nincreased. This is not surprising since we see from the equation above that the magnitude\n√\n√\nof this term goes as ( s/MH )δ−2 and s/MH is always < 1 while δ ≥ 3. For δ = 3 the\n√\n√\nreach is found to be ∼ (2.5 − 3) s while for δ = 6 one obtains only ∼ 2 s. Although these\nnumbers are not large in comparison to those we've obtained in the other analyses above\nthey provide the first indication that these two scenarios can be distinguished at a collider\nvia indirect measurements.\n\n4\n\nSummary and Conclusion\n\nHistorically, transverse polarization has not received much attention in the literature as a\nprobe for new physics signatures. However, in searching for and identifying new physics at\ncolliders one must make use of as many tools as possible.\nIn this paper we have examined the possible uses of transverse polarization in searching for, discovering and identifying spin-2 graviton exchange signatures in models with extra\ndimensions. The results of our analysis are as follows: (i) We have found that the interference of SM and spin-2 graviton KK exchanges leads to contributions to the azimuthal\nasymmetry distributions which are odd in cos θ, a rather unique signature. The appearance\nof such odd terms does not happen in the case of other new physics such as a Z ′ , contact\ninteractions, gauge boson KK excitations or the exchange of new scalars. (ii) Using two\ndifferent sets of observables that probe the integrated contributions of these odd terms, we\nshowed that it possible to differentiate KK graviton/spin-2 exchanges from all other new\nphysics contributions to contact interactions at the 5σ level up to ADD cutoff scales of\n√\nMH ∼ (3.5 − 4) s. (iii) Fitting to the shape of the full differential distribution itself was\n17\n\n\fFigure 6: Same as the previous figure but now for δ = 5(top) and δ = 6(bottom).\n\n18\n\n\fshown to provide much more discriminating power; we found that the 5σ identification reach\n√\nwas substantially increased to MH = (10 − 11) s, about a factor two improvement over\nwhat we obtained in our earlier analysis in the case of longitudinal polarization. This result\nis, however, quite sensitive to our assumptions about the sizes of various systematic errors.\n(iv) Using this same type of analysis we obtained a 95% CL search reach for new physics in\n√\nexcess of mH = 20 s; this is again about a factor of two improvement over other analyses.\nAs in the previous analysis, this result is also quite sensitive to the assumed values of the\nsystematic errors. Clearly, more detailed studies are required to verify these results. (v) In\nthe case of the ADD model, an additional imaginary piece of the amplitude is present in\ncomparison to the RS model below KK production threshold. We showed that this leads\nto a new asymmetry, produced through transverse polarization, which allows RS and ADD\n√\nmodel separation at 5σ up to masses MH = (2.5 − 3) s.\nIt is clear from our analysis that transverse polarization, though somewhat long neglected, can be a very powerful tool in identifying new physics, particularly in the case of\nextra dimensions. Further detailed study of the effects examined here may prove extremely\nuseful for future linear collider experiments.\n\nAcknowledgements\nThe author would like to thank J.L. Hewett for discussion related to this work. The\nauthor would also like to thank K. Desch for an inspirational talk on transverse polarization\nat the Jeju meeting that returned his interest to this subject after many years.\n\nReferences\n[1] J. L. Hewett and T. G. Rizzo, Phys. Rept. 183, 193 (1989).\n\n19\n\n\f[2] A. Leike, Phys. Rept. 317, 143 (1999) [arXiv:hep-ph/9805494]; M. Cvetic and S. Godfrey, arXiv:hep-ph/9504216.\n[3] W. Buchmuller, R. Ruckl and D. Wyler, Phys. Lett. B 191, 442 (1987) [Erratumibid. B 448, 320 (1999)]; J. L. Hewett and T. G. Rizzo, Phys. Rev. D 58, 055005\n(1998) [arXiv:hep-ph/9708419], Phys. Rev. D 56, 5709 (1997) [arXiv:hep-ph/9703337]\nand Phys. Rev. D 36, 3367 (1987).\n[4] J. Kalinowski, R. Ruckl, H. Spiesberger and P. M. Zerwas, Phys. Lett. B 414, 297 (1997)\n[arXiv:hep-ph/9708272]; J. Kalinowski, R. Ruckl, H. Spiesberger and P. M. Zerwas,\nPhys. Lett. B 406, 314 (1997) [arXiv:hep-ph/9703436]; T. G. Rizzo, Phys. Rev. D 59,\n113004 (1999) [arXiv:hep-ph/9811440].\n[5] F. Cuypers and S. Davidson, Eur. Phys. J. C 2, 503 (1998) [arXiv:hep-ph/9609487].\n[6] J. L. Hewett, Phys. Rev. Lett. 82, 4765 (1999) [arXiv:hep-ph/9811356]; G. F. Giudice,\nR. Rattazzi and J. D. Wells, Nucl. Phys. B 544, 3 (1999) [arXiv:hep-ph/9811291];\nT. Han, J. D. Lykken and R. J. Zhang, Phys. Rev. D 59, 105006 (1999) [arXiv:hepph/9811350]; T. G. Rizzo, Phys. Rev. D 59, 115010 (1999) [arXiv:hep-ph/9901209].\n[7] For an overview of RS phenomenology, see H. Davoudiasl, J. L. Hewett and T. G. Rizzo,\nPhys. Rev. D 63, 075004 (2001) [arXiv:hep-ph/0006041]; Phys. Lett. B 473, 43 (2000)\n[arXiv:hep-ph/9911262]; Phys. Rev. Lett. 84, 2080 (2000) [arXiv:hep-ph/9909255];\nJ. L. Hewett, F. J. Petriello and T. G. Rizzo, JHEP 0209, 030 (2002) [arXiv:hepph/0203091].\n[8] N. Arkani-Hamed, S. Dimopoulos and G. R. Dvali, Phys. Lett. B 429, 263\n(1998) [arXiv:hep-ph/9803315]; I. Antoniadis, N. Arkani-Hamed, S. Dimopoulos and\n\n20\n\n\fG. R. Dvali, Phys. Lett. B 436, 257 (1998) [arXiv:hep-ph/9804398]; N. Arkani-Hamed,\nS. Dimopoulos and G. R. Dvali, Phys. Rev. D 59, 086004 (1999) [arXiv:hep-ph/9807344].\n[9] L. Randall and R. Sundrum, Phys. Rev. Lett. 83, 3370 (1999).\n[10] See, for example, I. Antoniadis, Phys. Lett. B 246, 377 (1990); T. G. Rizzo and\nJ. D. Wells, Phys. Rev. D 61, 016007 (2000) [arXiv:hep-ph/9906234]; M. Masip and\nA. Pomarol, Phys. Rev. D 60, 096005 (1999) [arXiv:hep-ph/9902467]; T. G. Rizzo,\nPhys. Rev. D 64, 015003 (2001) [arXiv:hep-ph/0101278].\n[11] S. Cullen, M. Perelstein and M. E. Peskin, Phys. Rev. D 62, 055012 (2000) [arXiv:hepph/0001166].\n[12] G. Pasztor and M. Perelstein, in Proc. of the APS/DPF/DPB Summer Study on the\nFuture of Particle Physics (Snowmass 2001) ed. R. Davidson and C. Quigg, arXiv:hepph/0111471.\n[13] R. Budny, Phys. Rev. D14, 2969 (1976); H.A. Olsen, P. Osland and I. Overbo, Phys.\nLett. B97, 286 (1980); K. Hikasa, Phys. Rev. D33, 3203 (1986); C.P. Burgess and\nJ.A. Robinson, Int. J. Mod. Phys. A6, 2709 (1991); A. Djouadi, F.M. Renard and C.\nVerzegnassi, Phys. Lett. B241, 260 (1990); F.M. Renard, Z. Phys. C44, 75 (1989);\nJ.L. Hewett and T.G. Rizzo, Z. Phys. C44, 75 (1987) and Z. Phys. C36, 209 (1987);\nJ. Fleischer, K. Kolodziej and F. Jegerlehner, Phys. Rev. D49, 2174 (1994); for a\nrecent discussion of this option at the LC, see K. Desch, talk given at the International\nWorkshop on the Linear Collider, LCWS2002, Jeju Island, Korea, Aug. 2002.\n[14] G. Moortgat-Pick, private communication.\n[15] T.G. Rizzo, JHEP 0210 013 2002.\n21\n\n\f[16] E. Eichten, K. Lane and M. Peskin, Phys. Rev. Lett. 50, 811 (1983).\n[17] J. A. Aguilar-Saavedra et al. [ECFA/DESY LC Physics Working Group Collaboration], \"TESLA Technical Design Report Part III: Physics at an e+e- Linear Collider,\"\narXiv:hep-ph/0106315; S. Riemann, TESLA Linear Collider Note LC-TH-2001-007'\n[18] For a review of the current and anticipated future collider reaches for extra dimensions,\nsee J. Hewett and M. Spiropulu, \"Particle physics probes of extra spacetime dimensions,\" arXiv:hep-ph/0205106.\n[19] A. Datta, E. Gabrielli and B. Mele, hep-ph/0210318.\n\n22\n\n\f"}