{"id": "http://arxiv.org/abs/hep-ph/0002134v3", "guidislink": true, "updated": "2000-10-10T11:28:50Z", "updated_parsed": [2000, 10, 10, 11, 28, 50, 1, 284, 0], "published": "2000-02-11T21:50:44Z", "published_parsed": [2000, 2, 11, 21, 50, 44, 4, 42, 0], "title": "The Higgs sector of the MSSM in the decoupling limit", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0406080%2Chep-ph%2F0406325%2Chep-ph%2F0406108%2Chep-ph%2F0406050%2Chep-ph%2F0406058%2Chep-ph%2F0406254%2Chep-ph%2F0406262%2Chep-ph%2F0406311%2Chep-ph%2F0406314%2Chep-ph%2F0406284%2Chep-ph%2F0406260%2Chep-ph%2F0406034%2Chep-ph%2F0406092%2Chep-ph%2F0406158%2Chep-ph%2F0406193%2Chep-ph%2F0406152%2Chep-ph%2F0406085%2Chep-ph%2F0406204%2Chep-ph%2F0406288%2Chep-ph%2F0406179%2Chep-ph%2F0406144%2Chep-ph%2F0002086%2Chep-ph%2F0002242%2Chep-ph%2F0002087%2Chep-ph%2F0002290%2Chep-ph%2F0002217%2Chep-ph%2F0002114%2Chep-ph%2F0002016%2Chep-ph%2F0002093%2Chep-ph%2F0002052%2Chep-ph%2F0002075%2Chep-ph%2F0002144%2Chep-ph%2F0002192%2Chep-ph%2F0002233%2Chep-ph%2F0002189%2Chep-ph%2F0002160%2Chep-ph%2F0002147%2Chep-ph%2F0002271%2Chep-ph%2F0002096%2Chep-ph%2F0002218%2Chep-ph%2F0002276%2Chep-ph%2F0002197%2Chep-ph%2F0002009%2Chep-ph%2F0002125%2Chep-ph%2F0002234%2Chep-ph%2F0002207%2Chep-ph%2F0002037%2Chep-ph%2F0002024%2Chep-ph%2F0002228%2Chep-ph%2F0002076%2Chep-ph%2F0002062%2Chep-ph%2F0002044%2Chep-ph%2F0002219%2Chep-ph%2F0002107%2Chep-ph%2F0002245%2Chep-ph%2F0002046%2Chep-ph%2F0002103%2Chep-ph%2F0002287%2Chep-ph%2F0002275%2Chep-ph%2F0002061%2Chep-ph%2F0002079%2Chep-ph%2F0002285%2Chep-ph%2F0002222%2Chep-ph%2F0002010%2Chep-ph%2F0002165%2Chep-ph%2F0002066%2Chep-ph%2F0002072%2Chep-ph%2F0002298%2Chep-ph%2F0002221%2Chep-ph%2F0002216%2Chep-ph%2F0002278%2Chep-ph%2F0002001%2Chep-ph%2F0002264%2Chep-ph%2F0002060%2Chep-ph%2F0002141%2Chep-ph%2F0002162%2Chep-ph%2F0002249%2Chep-ph%2F0002091%2Chep-ph%2F0002134%2Chep-ph%2F0002176%2Chep-ph%2F0002099%2Chep-ph%2F0002293%2Chep-ph%2F0002210%2Chep-ph%2F0002241%2Chep-ph%2F0002259%2Chep-ph%2F0002021%2Chep-ph%2F0002053%2Chep-ph%2F0002301%2Chep-ph%2F0002152%2Chep-ph%2F0002149%2Chep-ph%2F0002108%2Chep-ph%2F0002297%2Chep-ph%2F0002115%2Chep-ph%2F0002106%2Chep-ph%2F0002077%2Chep-ph%2F0002063%2Chep-ph%2F0002068%2Chep-ph%2F0002232%2Chep-ph%2F0002243%2Chep-ph%2F0002050%2Chep-ph%2F0002022&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Higgs sector of the MSSM in the decoupling limit"}, "summary": "We study the heavy Higgs sector of the MSSM composed of the H^\\pm, H^0 and\nA^0 particles in the so-called decoupling limit where m_{A^0} >> m_Z. By\nintegrating out these heavy Higgs particles to one-loop, we compute the\neffective action for the electroweak gauge bosons and find out that, in the\ndecoupling limit, all the heavy Higgs effects can be absorbed into\nredefinitions of the Standard Model electroweak parameters. This demonstrates\nexplicitely that the decoupling theorem works for the heavy MSSM Higgs\nparticles. This is also compared with the paradigmatic and different case of\nthe Standard Model heavy Higgs particle. Finally, this work together with our\ntwo previous works, complete the demonstration that all the non-standard\nparticles in the MSSM, namely, squarks, sleptons, charginos, neutralinos and\nthe heavy Higgs particles, decouple to one-loop from the low energy electroweak\ngauge boson physics.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0406080%2Chep-ph%2F0406325%2Chep-ph%2F0406108%2Chep-ph%2F0406050%2Chep-ph%2F0406058%2Chep-ph%2F0406254%2Chep-ph%2F0406262%2Chep-ph%2F0406311%2Chep-ph%2F0406314%2Chep-ph%2F0406284%2Chep-ph%2F0406260%2Chep-ph%2F0406034%2Chep-ph%2F0406092%2Chep-ph%2F0406158%2Chep-ph%2F0406193%2Chep-ph%2F0406152%2Chep-ph%2F0406085%2Chep-ph%2F0406204%2Chep-ph%2F0406288%2Chep-ph%2F0406179%2Chep-ph%2F0406144%2Chep-ph%2F0002086%2Chep-ph%2F0002242%2Chep-ph%2F0002087%2Chep-ph%2F0002290%2Chep-ph%2F0002217%2Chep-ph%2F0002114%2Chep-ph%2F0002016%2Chep-ph%2F0002093%2Chep-ph%2F0002052%2Chep-ph%2F0002075%2Chep-ph%2F0002144%2Chep-ph%2F0002192%2Chep-ph%2F0002233%2Chep-ph%2F0002189%2Chep-ph%2F0002160%2Chep-ph%2F0002147%2Chep-ph%2F0002271%2Chep-ph%2F0002096%2Chep-ph%2F0002218%2Chep-ph%2F0002276%2Chep-ph%2F0002197%2Chep-ph%2F0002009%2Chep-ph%2F0002125%2Chep-ph%2F0002234%2Chep-ph%2F0002207%2Chep-ph%2F0002037%2Chep-ph%2F0002024%2Chep-ph%2F0002228%2Chep-ph%2F0002076%2Chep-ph%2F0002062%2Chep-ph%2F0002044%2Chep-ph%2F0002219%2Chep-ph%2F0002107%2Chep-ph%2F0002245%2Chep-ph%2F0002046%2Chep-ph%2F0002103%2Chep-ph%2F0002287%2Chep-ph%2F0002275%2Chep-ph%2F0002061%2Chep-ph%2F0002079%2Chep-ph%2F0002285%2Chep-ph%2F0002222%2Chep-ph%2F0002010%2Chep-ph%2F0002165%2Chep-ph%2F0002066%2Chep-ph%2F0002072%2Chep-ph%2F0002298%2Chep-ph%2F0002221%2Chep-ph%2F0002216%2Chep-ph%2F0002278%2Chep-ph%2F0002001%2Chep-ph%2F0002264%2Chep-ph%2F0002060%2Chep-ph%2F0002141%2Chep-ph%2F0002162%2Chep-ph%2F0002249%2Chep-ph%2F0002091%2Chep-ph%2F0002134%2Chep-ph%2F0002176%2Chep-ph%2F0002099%2Chep-ph%2F0002293%2Chep-ph%2F0002210%2Chep-ph%2F0002241%2Chep-ph%2F0002259%2Chep-ph%2F0002021%2Chep-ph%2F0002053%2Chep-ph%2F0002301%2Chep-ph%2F0002152%2Chep-ph%2F0002149%2Chep-ph%2F0002108%2Chep-ph%2F0002297%2Chep-ph%2F0002115%2Chep-ph%2F0002106%2Chep-ph%2F0002077%2Chep-ph%2F0002063%2Chep-ph%2F0002068%2Chep-ph%2F0002232%2Chep-ph%2F0002243%2Chep-ph%2F0002050%2Chep-ph%2F0002022&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We study the heavy Higgs sector of the MSSM composed of the H^\\pm, H^0 and\nA^0 particles in the so-called decoupling limit where m_{A^0} >> m_Z. By\nintegrating out these heavy Higgs particles to one-loop, we compute the\neffective action for the electroweak gauge bosons and find out that, in the\ndecoupling limit, all the heavy Higgs effects can be absorbed into\nredefinitions of the Standard Model electroweak parameters. This demonstrates\nexplicitely that the decoupling theorem works for the heavy MSSM Higgs\nparticles. This is also compared with the paradigmatic and different case of\nthe Standard Model heavy Higgs particle. Finally, this work together with our\ntwo previous works, complete the demonstration that all the non-standard\nparticles in the MSSM, namely, squarks, sleptons, charginos, neutralinos and\nthe heavy Higgs particles, decouple to one-loop from the low energy electroweak\ngauge boson physics."}, "authors": ["Antonio Dobado", "Maria J. Herrero", "Siannah Penaranda"], "author_detail": {"name": "Siannah Penaranda"}, "author": "Siannah Penaranda", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1007/s100520000486", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/hep-ph/0002134v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-ph/0002134v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "LaTeX, 26 pages, 1 figure included. Uses cite.sty. Version accepted\n  in Eur. Phys. J. C", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-ph/0002134v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-ph/0002134v3", "journal_reference": "Eur.Phys.J.C17:487-500,2000", "doi": "10.1007/s100520000486", "fulltext": "FTUAM 99/20\nhep-ph/0002134\nFeb.-2000\n\narXiv:hep-ph/0002134v3 10 Oct 2000\n\nTHE HIGGS SECTOR OF THE MSSM\nIN THE DECOUPLING LIMIT\nANTONIO DOBADO ⋆\nDepartamento de Fı́sica Teórica\nUniversidad Complutense de Madrid\n28040– Madrid, Spain\nMARIA J. HERRERO †\nand\nSIANNAH PEÑARANDA ‡\nDepartamento de Fı́sica Teórica\nUniversidad Autónoma de Madrid\nCantoblanco, 28049– Madrid, Spain\n\nABSTRACT\nWe study the heavy Higgs sector of the MSSM composed of the H ± , H 0 and A0\nparticles in the so-called decoupling limit where mA0 ≫ mZ . By integrating out these\nheavy Higgs particles to one-loop, we compute the effective action for the electroweak\ngauge bosons and find out that, in the decoupling limit, all the heavy Higgs effects can\nbe absorbed into redefinitions of the Standard Model electroweak parameters. This\ndemonstrates explicitely that the decoupling theorem works for the heavy MSSM\nHiggs particles. This is also compared with the paradigmatic and different case of\nthe Standard Model heavy Higgs particle. Finally, this work together with our two\nprevious works, complete the demonstration that all the non-standard particles in\nthe MSSM, namely, squarks, sleptons, charginos, neutralinos and the heavy Higgs\nparticles, decouple to one-loop from the low energy electroweak gauge boson physics.\n\n⋆ e-mail: dobado@eucmax.sim.ucm.es\n† e-mail: herrero@delta.ft.uam.es\n‡ e-mail: siannah@delta.ft.uam.es\n\n\f1\n\nIntroduction\n\nThe absence of any signal from Supersymmetric (SUSY) particles in the existing data indicates\nthat either SUSY theories are not the proper ones for low energy physics beyond the Standard\nModel (SM) or the SUSY spectrum is above the available energies at present experiments. In\nthe simplest SUSY theory, the Minimal Supersymmetric Standard Model (MSSM), the predicted\nspectrum is composed of squarks q̃ and sleptons  ̃l, ν̃ for the three generations, charginos χ̃±\n1,2 ,\no\nneutralinos χ̃1,2,3,4 , gluinos g̃, and the Higgs sector with five Higgs particles, two CP-even Higgs\nbosons ho and H o , a CP-odd or pseudoscalar Higgs boson Ao , and two charged Higgs particles H ± .\nAlthough the precise mass bound varies for each particle, it is clear that, at present time, there is\nlittle room for light MSSM particles, say lighter than the W gauge boson mass mW . Particularly\nstringent are the bounds for the strongly interacting particles, the squarks and gluinos with\na lower mass limit already above 200 GeV [1]. Under these circumstances it is a reasonable\nhypothesis to think of a mass gap between the SM particles and the genuine MSSM particles. In\ncase this energy separation occurs, its size should not be larger than about 1 T eV , if the MSSM\nis required to repair the hierarchy problem. We will assume here the extreme but plausible\nsituation where all the MSSM spectrum lay well above the electroweak scale MEW . For the\npurpose of this paper we just need to assume the existence of this sizeable gap, but the particular\nvalue of the gap width is not relevant. There is just one exception in this large SUSY mass\nassumption, the lightest CP-even ho particle which stays close to the SM spectrum. It is well\nknown that when the pseudoscalar mass mAo is very large, that is much larger than the Z boson\nmass mAo ≫ mZ , the heavy CP-even, CP-odd and charged Higgs bosons are nearly degenerate,\nmH o ≃ mH ± ≃ mAo , while the ho particle reaches its maximal mass value which, at tree level,\nis bounded from above by mZ , and when radiative corrections are included, this upper bound\nis shifted towards ∼ 130 GeV [2–14]. In this so-called decoupling limit [15], the lightest SUSY\nHiggs boson ho and the SM Higgs boson HSM have very similar properties, since both have\nsimilar couplings to fermions and vector bosons and therefore the task of discriminating between\nthese two particles will be quite hard. This equality of couplings is exact at tree level when the\ndecoupling limit is reached asymptotically and both their production rates and decay branching\nrations are identical. However, it is not known with complete generality if this equality remains\nbeyond tree level. It is a very interesting subject, since in case it does not happen it will provide\nthe clue for discriminating between the SM and MSSM, even in the extreme situation mentioned\nabove where all the rest of the MSSM spectrum is well above the electroweak scale and hence\nnot reachable at present experiments. This topic has been studied by several authors [15–31] by\nlooking to particular observables of interest in phenomenology, as for instance, the parameters\nS, T and U 1 that measure the radiative corrections at LEP [15, 28, 29], the ho production rates\nat LEP and LHC and the decay branching rations of ho to γγ [24] and to f f ̄ [20, 30, 31]. Most\nof these studies analyzed the decoupling of SUSY particles numerically. Although the numerical\nanalysis are complicated since they depend on many MSSM parameters, there are indications\nfrom these studies that the SUSY particles indeed tend to decouple in the previous observables\nwhen the SUSY masses are taken numerically very large. In particular, the MSSM ho couplings\nto γγ [24] and to f f ̄ [30] seem to approach those of the HSM particle in the decoupling limit\nand in the one loop approximation, confirming therefore the enormous challenge that will be\n1\n\nor equivalently ∆r, ∆ρ, ∆κ or the ǫi parameters.\n\n2\n\n\fdiscriminating between these two particles at future high energy colliders as the LHC.\nIn this paper we study the MSSM Higgs sector in the decoupling limit at a more formal level.\nOur object of interest is the effective action for the SM particles and the contributions to this action from the loops of the MSSM Higgs sector in the limit where all the Higgs particles, except ho ,\nare very heavy, namely, when mAo ≫ mZ . We want to demonstrate the decoupling of the MSSM\nHiggs particles á la Appelquist Carazzone [32], meaning that the required proof should show that\nthe decoupling theorem also applies for this particular case. This is the third work belonging to a\nprogram that we initiated in [33,34] which aims to demonstrate the decoupling of SUSY particles\nbeyond tree level in each of the MSSM sectors. In generic words, and by following the AppelquistCarazzone approach, the proof of decoupling of SUSY particles at low energies amounts to first\ncompute the effective action Γeff [φ] for the SM particles φ (φ = q, l, ν, Z, W ± , γ, g, HSM ) that\nis generated through functional integration of all the non-standard particles of the MSSM φ̃\n(φ̃ = q̃,  ̃l, ν̃, χ̃± , χ̃o , g̃, H ± , H o , Ao )\niΓef f [φ]\n\ne\nwith\n\nΓMSSM [φ, φ̃] ≡\nand LMSSM is the MSSM Lagrangian.\n\nZ\n\n=\n\nZ\n\n[dφ̃] eiΓMSSM [φ,φ̃] ,\n\n(1)\n\ndxLMSSM (φ, φ̃) ; dx ≡ d4 x ,\n\n(2)\n\nSecondly, one must perform a large SUSY mass expansion of Γeff [φ] to be valid for low energies,\nsay MEW ≪ Mφ̃ , and, as a result, one should get finally the following behaviour,\nΓeff [φ] = Γ̂SM [φ] + O\n\n\"\n\nMEW\nMφ̃\n\n!n #\n\n,\n\n(3)\n\nwhich means that all the effects of the heavy SUSY particles φ̃ can be absorbed into redefinitions\nof the SM couplings and wave functions of the SM fields φ, or else they are suppressed by inverse\npowers of the heavy masses Mφ̃ and therefore vanish in the asymptotic limit Mφ̃ → ∞. We\nbelieve that only an explicit computation as the one just outlined can be considered as a formal\nand general proof of decoupling of non-standard particles from the low energy SM physics.\nWe have started this program with the computation of the part of the effective action for\nthe electroweak gauge bosons, but, of course, a complete proof of decoupling will require to\nobtain the total effective action for the other SM particles as well, namely, the fermions, the\ngluon and the SM Higgs particle itself. In particular, the study of the h0 bb̄ vertex is one of\nthe most interesting observables in the Higgs phenomenology [35]. The reason to start with the\nelectroweak gauge boson sector is, first, for simplicity and, second, because we were interested in\nstuding the implications for some of the precision observables at LEP with external gauge bosons\nas the S, T and U or related parameters. We have proved that, to one loop level, the functional\nintegration of the various MSSM sparticle sectors factorize in the effective action for electroweak\nbosons and, therefore, this integration can be performed sector by sector separately. In [33, 34]\nwe have completed the integration of squarks, sleptons, charginos and neutralinos in the MSSM\nto one loop, and have demonstrated their decoupling in the large SUSY masses limit. Since\nthe asymptotic behaviour of the Feynman loop integrals appearing in the computation depend\n3\n\n\fon the relative sizes of the various sparticle masses in the loop propagators, one must perform\nthe computation by assuming a particular hypothesis for these masses. We assumed in [33, 34]\n2\nthat the large SUSY masses limit is taken for each sector such that MEW\n≪ Mφ̃2i ∀i, but with\n|Mφ̃2i − Mφ̃2j | ≪ |Mφ̃2i + Mφ̃2j | if i 6= j. That is, all the SUSY masses are large as compared to the\nelectroweak scale but they are close to each other. This is a plausible hypothesis in the MSSM but\nis not the most general one for all the sectors. In particular for the squarks of the third generation\nwhere, even assuming a common soft-SUSY-breaking mass, one has (m̃2t1 − m̃2t2 ) ≃ mt (At −μ cot β)\nand (m̃2b1 − m̃2b2 ) ≃ mb (Ab − μ tan β) and, therefore, for large enough values of At , Ab , μ and/or\ntan β the previous hypothesis may not hold. In consequence, for these particular cases where\n|Mφ̃2 − Mφ̃2 | ≃ O|Mφ̃2 + Mφ̃2 | for i 6= j an independent demonstration of decoupling should be\ni\nj\ni\nj\ndone.\nIn the present work we complete the computation of the effective action for electroweak gauge\nbosons to one loop by integrating out the heavy MSSM Higgs particles, namely the charged H ± ,\nthe pseudoscalar Ao and the heaviest CP-even Higgs boson H o . We then perform the large mass\nexpansion which in the Higgs sector case corresponds to work in the above mentioned decoupling\nlimit. Notice that for the Higgs sector the previous assumption for the relative Higgs mass values,\n|m2Hi − m2Hj | ≪ |m2Hi + m2Hj | if i 6= j holds trivially, since when mAo ≫ mZ the four heavy Higgs\nbosons, H ± , Ao and H o tend to be degenerate with a mass close to mAo .\nThe paper is organized as follows. In the second section we define the effective action for\nthe electroweak gauge bosons and summarize the relevant part of the MSSM lagrangian for the\npurpose of integration of the MSSM Higgs sector to one loop level. The exact results to one loop\nof the contributions to the effective action from the 2, 3, and 4 point electroweak gauge bosons\nfunctions are presented in section three. We also analyze in that section the behaviour of these\nfunctions in the decoupling limit, mAo ≫ mZ , and present the corresponding asymptotic results\nin terms of the large Higgs masses mH ± , mAo , mH o . In section four the previous asymptotic\nexpressions are rewritten in a form that will allow us to conclude on the decoupling of the Higgs\nsector á la Appelquist Carazzone as announced. In particular, by using the common language\nof renormalization, the required redefinitions of the SM couplings and wave functions for the\nelectroweak bosons are presented in the form of specific contributions to the SM counterterms.\nSection five is devoted to a comparison with the paradigmatic and dramatically different case of\nthe SM with a very heavy Higgs particle, MEW ≪ MHSM , which is well known not to decouple\nfrom low energy electroweak physics [36–43]. We find illustrative to perform this comparison\nin the language of the effective action. This non-decoupling of the SM Higgs particle has been\nshown to manifest at one loop level in several observables, as for instance ∆ρ [38, 39, 44], and it\nis being very relevant in the indirect Higgs searches at the present colliders. In section five we\nreobtain this non-decoupling behavior by computing the effective action for electroweak gauge\nbosons after integration to one loop of the SM Higgs particle and by studying its large MHSM\nexpansion. We will see that the non-decoupling of the Higgs particle manifests in this context as\na violation of the decoupling theorem in the four point electroweak gauge functions. Finally, the\nconclusions of this work are summarized in section six.\n\n4\n\n\f2\n\nIntegration of the MSSM Higgs sector to one loop\n\nThe effective action for the electroweak gauge bosons, Γeff [V ] (V = A, Z, W ± ) gets contributions\nto one loop from all the MSSM sectors, except from gluinos which will start contributing at\nand beyond two loops. This effective action is defined through functional integration of all\nthe sfermions f ̃ (q̃,  ̃l, ν̃), neutralinos χ̃o (χ̃o1...4 ), charginos χ̃± (χ̃±\n1,2 ), and the Higgs bosons H\n(H ± , H o, Ao ) by:\neiΓef f [V ] =\n\nZ\n\n ̃\n\n+\n\n ̄ ][dχ̃o ][dH]eiΓMSSM [V ,f,χ̃\n[df ̃][df ̃∗ ][dχ̃+ ][dχ̃\n\n+ ,χ̃o ,H]\n\n,\n\n(4)\n\nwhere the relevant part of the MSSM classical action can be written as,\nZ\n\nΓMSSM [V, f ̃, χ̃+ , χ̃o , H] ≡\n\nZ\n\n=\n\ndxLMSSM (V, f ̃, χ̃+ , χ̃o , H)\n(0)\n\ndxL (V ) +\n\nZ\n\ndxLf ̃(V, f ̃) +\n\nZ\n\ndxLχ̃ (V, χ̃) +\n\n≡ Γ0 [V ] + Γf ̃[V, f ̃] + Γχ̃ [V, χ̃] + ΓH [V, H] .\n\nZ\n\ndxLH (V, H)\n(5)\n\nHere, L(0) (V ) is the free gauge boson lagrangian at tree level, and Lf ̃, Lχ̃ and LH are the\nlagrangians of sfermions, inos (i.e. charginos and neutralinos) and Higgs bosons respectively. By\nlooking into the particular form of these lagrangians it is inmediate to see that the integration\nof the various sectors at the one-loop level can be factorized out, and their contributions to the\neffective action can be computed separately sector by sector.\nIn [33, 34] we have performed the complete integration to one loop of the sfermions and inos\nsectors. Here we present the corresponding integration of the heavy Higgs sector defined as,\niΓH\n[V ]\nef f\n\ne\n\n=\n\nZ\n\n[dH]ei\n\nR\n\ndx(L(0) (V )+LH (V,H))\n\n,\n\n(6)\n\nwhere we have introduced a short hand notation for the heavy Higgs particles,\n\n\n\n\n\nH =\n\nH1\nH2\nHo\nAo\n\n\n\n\n\n\n\n,\n\nwith H 1 and H 2 being related to the physical charged Higgs particles by H ± ≡\nand LH (V, H) is the relevant MSSM Higgs sector lagrangian that is given by,\nLH (V, H) = L(0) (H) + LHV V + LHHV + LHHV V .\n\n(7)\n\n√1\n2\n\n(H 1 ± iH 2 ),\n(8)\n\nHere L(0) (H) is the free lagrangian for the heavy Higgs particles,\nL(0) (H) =\n\n\u0011\n1\u0010\n∂μ H T ∂ μ H − H T MH2 H ,\n2\n\n(9)\n\nthe squared mass matrix is given in terms of the physical Higgs boson masses by\nMH2 ≡ diag(m2H + , m2H + , m2H o , m2Ao ) , mH + = mH − .\n5\n\n(10)\n\n\fand we have used the superscript T to denote the transpose matrix. The interaction lagrangian\npieces can be written as follows [45],\nLHV V\nLHHV\nLHHV V\nwhere\nB≡\n\n\n\n\n\n\n\n\n= BT H ,\n\n↔\n\n= H T ∨(1)μ ∂μ H ,\n= H T ∨(2) H .\n\n0\n0\n\u0010\n+\ngcαβ mW Wμ W μ− +\n0\n\n(11)\n\n\n\n\u0011 \n\nmZ\nμ \nZ\nZ\nμ\n\n2cW\n\n,\n\n(12)\n\nand ∨(1)μ , ∨(2) are the 4×4 Higgs interaction matrices with one and two gauge bosons respectively\ndefined by,\nμ\n\n∨(1)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n∨(2) \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[V (1)μ ]ij = 0 if i = j , [V (1)μ ]ij = −[V (1)μ ]ji if i 6= j ,\ng\ng\n2W\n[V (1)μ ]12 = eAμ + gc\nZ μ , [V (1)μ ]13 = sαβ W2μ , [V (1)μ ]14 = W1μ\n2cW\ng\ng 2\ng 2 μ\n[V (1)μ ]23 = − sαβ W1μ , [V (1)μ ]24 = W2μ , [V (1)μ ]34 = −\nsαβ Z\n2\n2\n2cW\n[V (2) ]ij = [V (2) ]ji ∀ i, j \", [V (2) ]12 = [V (2) ]34 = 0 ,\n#\ne2\neg c2W\ng 2 + μ− g 2 c22W\nμ\nμ\nμ\n(2)\n(2)\nZμ Z + Aμ A +\nWμ W +\nAμ Z ,\n[V ]11 = [V ]22 = 2\n8c2W\n2\n2cW\n#\n\"4\ng2\ng 2 + μ−\nWμ W + 2 Zμ Z μ ,\n[V (2) ]33 = [V (2) ]44 = 2\n4\n8cW #\n\"\n2 2\neg\ng\ns\nW\n[V (2) ]i3 = sβα − Aμ W i μ +\nZμ W i μ , i = 1, 2 ,\n2\n2c\nW\n\"\n#\n2 2\neg\ng\ns\nW\n[V (2) ]i4 = − Aμ W i μ +\nZμ W i μ , i = 1, 2 .\n2\n2cW\n\n(13)\n\nHere, as usual, g and e are the electroweak and electromagnetic couplings respectively, and we\nhave used a shorthand notation for the sines and cosines of the weak angle θW and the β angle\n(tan β ≡ vv12 )) given by\nsαβ ≡ sin(α − β)\nc2W ≡ cos 2θW\ncW ≡ cos θW\n\n, cαβ ≡ cos(α − β) ,\n, s2W ≡ sin 2θW ,\n, sW ≡ sin θW .\n\nCorrespondingly, we can define the various contributions to the classical action by,\n1\nΓH [V, H] = hBT Hi + h H T AH H i ,\n2\nwhere,\n(0)\n\n(1)\n\n(14)\n\n(15)\n\n(2)\n\nAH ≡ AH + AH + AH ,\n\nhBT Hi ≡\nT\n\nh H AH H i ≡\n\nZ\n\nZ\n\ndk̃ BkT Hk ,\n\n(i)\n\ndk̃ dp̃ HkT AHkp Hp , i = 0, 1, 2 .\n6\n\n(16)\n\n\fwith,\ndk̃ ≡\n\nd4 k\n,\n(2π)4\n\n(17)\n\nand we have chosen the representation in momentum space which is more convenient for functional\nintegration,\n(0)\n\nAHkp ≡ (2π)4 δ(k + p) (k 2 − MH2 ) ,\n(1)\nAHkp\n\n≡ i (2π)\n\n4\n\nAHkp ≡ (2π)4\n\nZ\n\n(2)\n\nBkT ≡ (2π)4\n\nZ\n\nZ\n\nh\n\ndq̃ δ(k + p + q) (k − p)μ ∨(1) μ\nh\n\ndq̃ dr̃ δ(k + p + q + r) ∨(2)\nT\ndq̃ dp̃ δ(k + p + q) Bq,p\n.\n\ni\n\nq,r\n\ni\n\nq\n\n,\n\n,\n\n(18)\n\nOnce the classical action has been written in the proper form (15), we proceed with the\nfunctional integration to one loop of the heavy Higgs particles H. By using the standard path\nintegral techniques we get the following result for the effective action,\ni\n1 T −1\nΓH\nef f [V ] = Γ0 [V ] + Tr log AH − hB AH Bi ,\n2\n2\nwhere,\nhB\n\nT\n\nA−1\nH\n\nBi ≡\n\nZ\n\n(19)\n\ndk̃ dp̃ BkT A−1\nHkp Bp .\n\nij\nIn (19) we have introduced the functional trace which for a generic matrix operator C ij (k, p) ≡ Ckp\nis defined by [33]:\nZ\n\nTrC ≡\n\nX\n\nii\ndk̃Ckk\n.\n\ni\n\nNext, by expanding the logarithm and the inverse operator in (19), the effective action can be\nwritten as,\n∞\n∞\n1X\n(−1)k+1\niX\n(1)\n(2) k\n(1)\n(2)\nTr[GH (AH + AH )] −\n] = Γ0 [V ] +\n(−1)k hBT [GH (AH + AH )]k GH Bi ,\n2 k=1\nk\n2 k=0\n(20)\n(0) −1\nwhere GH is the heavy Higgs propagator matrix, defined as GH = (AH ) , and is given in\nmomentum space by,\nGHkp = (2π)4 δ(k + p)(k 2 − MH2 )−1 ,\n(21)\n\nΓH\nef f [V\n\nwith\n(q 2 − MH2 )−1 = diag(\n\nq2\n\n1\n1\n1\n1\n, 2\n, 2\n, 2\n).\n2\n2\n2\n− mH 1 q − mH 2 q − mH o q − m2Ao\n\nFinally, if we keep just the terms that contribute to the two, three and four point V Green\nfunctions we get,\n1 T\nΓH\nef f [V ] = Γ0 [V ] − hB GH Bi\n2\n7\n\n\fi\ni\n(2)\n(1)\nTr(GH AH ) − Tr(GH AH )2\n2\n4\ni\ni\n(1)\n(2)\n(1)\n−\nTr(GH AH GH AH ) + Tr(GH AH )3\n2\n6\ni\ni\n(2) 2\n(1)\n(1)\n(2)\nTr(GH AH ) + Tr(GH AH GH AH GH AH )\n−\n4\n2\ni\n(1) 4\n−\nTr(GH AH ) + O(V 5 ) .\n8\n+\n\n(22)\n\nThe various contributions can be clearly identified from this expression. The third and fourth\nterms give the one-loop contributions to the two-point functions; the two next terms to the threepoint functions; and the last three terms correspond to the four-point functions. Notice that\nthere is just one contribution from the Higgs integration at the tree level. This is the second\nterm in eq. (22) and contributes just to the four point functions. Note that it is the unique sector\nthat generates a contribution to the electroweak gauge boson functions at the tree level. As we\nhave seen in [33, 34] the integration of sfermions and inos in the effective action for electroweak\ngauge bosons give only contributions starting from one-loop level. In addition, notice also that\nthe resulting effective action in eq. (22) is gauge independent, as expected. This is due to the\nfact that we only integrate the physical Higgs particles whose interactions with the electroweak\ngauge bosons are gauge independent.\nFinally, and for the purpose of illustration, we have shown in Fig. 1 the Feynman diagrams\ncorresponding to the different terms appearing in the above eq. (22).\n\n3\n\nThe n-point functions of electroweak gauge bosons\n\nThe effective action can be written in terms of the n-point Green's functions in momentum space,\ngenerically as:\nΓef f [V ] =\n\nX\n\n1\nCV1 V2 ...Vn\n\nZ\n\nn\nV2 ...Vn\nΓVμ1ν...\nρ (k1 k2\n\ndk̃1 . . . dk̃n (2π)4 δ(Σni=1 ki ) ×\n. . . kn ) V1μ (−k1 ) V2ν (−k2 ) . . . Vnρ (−kn ) ,\n\n(23)\n\nwhere CV1 V2 ...Vn are the proper combinatorial factors accounting for the identical external field,\nand we have assumed the convention of incoming momenta ki for the external gauge bosons.\nIn this section we present the exact results to one-loop for the various contributions to the\neffective action of eq. (22) coming from the 2, 3 and 4 point functions and write them in terms\nof the standard one-loop integrals of 't Hooft, Veltman and Passarino [46, 47]. We latter analyze\nthe asymptotic behaviour of the electroweak bosons Green's functions in the limit of large Higgs\nmasses. The analysis of the one-loop integrals in the large masses limit have been done by means\nof the m-Theorem [48].\nAfter working out the functional traces in eq. (22) and by computing the corresponding\nFeynman integrals in dimensional regularization we get the following contributions, ΓH\nef f [V ][n] ,\n8\n\n\fV1\n\nV3\nH\n\nV2\nH\nV1\n\nV1\nV1\n\nH\n\nH\n\nV2\nH V3\n\nV1\n\nH V2\nV1 H V3\nH\nH\nV2 H V4\n\nV1 H V3\nV2 H V4\n\nH V4\n\nV2\n\nH\n\nV1\n\nV2\nV3\n\nH V3\n\nH\n\nV2\n\nH\nH\n\nV4\n\nFigure 1: Generic Feynman diagrams corresponding to the tree-level and one-loop contributions\nto the two-, three- and four-point functions of electroweak gauge bosons.\nfrom the n = 2, 3 and 4 point functions respectively2 ,\n2\nΓH\nef f [V ][2] = −π\n\nZ\n\ndp̃ dk̃ δ(p + k)\n\n(\n\nXh\ni\n\n∨(2)\n\niii\n\np,k\n\nA0 (mi )\n\n\n\n1 X h (1)μ iij h (1)ν iji i j\n+\nIμν (k, mi , mj ) ,\n∨\n∨\n\nk\np\n4 i6=j\n\n2\nΓH\nef f [V ][3] = −iπ\n\nΓH\nef f [V ][4]\n2\n\nZ\n\ndp̃ dk̃ dr̃ δ(p + k + r)\n\n\nX h\n\n\ni6=j\n\n∨(1)μ\n\n(24)\n\niji h\np\n\n∨(2)\n\n1 ji\nT (p, mi , mj )\nk,r 2 μ\n\niij\n\n\n\n\n1 X h (1)μ iij h (1)ν ijk h (1)σ iki i j k\nTμ ν σ (p, k, mi , mj , mk ) ,\n∨\n∨\n∨\n+\n\n−r\n−k\n−p\n6 i6=j6=k\n\n1X\n= −\n2 i\n\nZ\n\ndp̃ Bpi\n\np2\n\n1\nBi\n− m2i −p\n\n(25)\n\nNotice that in dimensional reduction the results would be the same, since we are not integrating out gauge\nbosons. This also applies to the results of our two previous papers [33, 34].\n\n9\n\n\f+ π2\n+\n\nZ\n\nXh\n\ni,j,k\n\n+\n\n\nX h\n\ndp̃ dk̃ dr̃ δ(p + k + r) \n\n∨(1)μ\n\niij h\n−p\n\n∨(1)ν\n\nijk h\n−k\n\n∨(2)σ\n\ni,j\n\niki\n\n∨(2)μ\n\n−r,−t\n\niij\n\n−p,−k\n\nh\n\n∨(2)\n\niji\n\n−r,−t\n\nij\nJp+k\n(p + k, mi , mj )\n\nJμi jνk (p, k, mi , mi , mk )\n\n\n\n1 X h (1)μ iij h (1)ν ijk h (1)σ ikl h (1)λ ili i j k l\nJμ ν σ λ (p, k, r, mi , mj , mk , ml ) ,\n∨\n∨\n∨\n∨\n\n−t\n−r\n−k\n−p\n8 i,j,k,l\n\n(26)\n\nIn the above expressions the indices i, j, k, l run from 1 to 4 and correspond to the four entries\nin the heavy Higgs matrix H of eq. (7). In these formulas and in the following, a proper symmetrization over the indices and momenta of the external identical fields, although not explicitely\nij\nshown, must be assumed. The one loop integrals Tμj i , Tμi jν kσ , Jp+k\n, Jμi jνk and Jμi jνkσlλ are defined in\nterms of the standard integrals, A0 , B0, μ, μν , C0, μ, μν, μνσ and D0, μν, μνσ, μνσλ [46, 47] in appendix A\nij\nof our previous work [34]. Similarly, the two-point integral Iμν\nis defined by,\nij\nIμν\n(k, mi , mj ) = [4Bμν + 2kν Bμ + 2kμ Bν + kμ kν B0 ] (k, mi , mj ).\n\n(27)\n\nWe refer the reader to [34] for these and more details on the Feynman integrals.\nFinally, from the previous expressions in eq. (24) and by using the definition in (23) we\nextract, after a rather tedious computation, the exact results to one loop for the two-point, ΓVμν1 V2 ,\nV1 V2 V3 V4\n1 V2 V3\nthree-point, ΓVμνσ\n, and four-point, Γμνσλ\n, Green's functions with all the possible choices for\nthe external legs, Vi = A, Z, W ± which are collected in appendix A. We would like to mention that\nwe have performed all the one-loop computations of this paper by the standard diagrammatic\nmethod as well and we have got the same results.\nIn the following, and in order to get the n-point Green's functions in the decoupling limit,\nwe use the asymptotic results for the standard one-loop integrals A0 (mi ), B0, μ, μν (p, mi , mj ),\nC0, μ, μν, μνσ (p, k, mi , mj , mk ) and D0, μ,μν, μνσ, μνσλ (p, k, r, mi , mj , mk , ml ) that we have computed in\ndimensional regularization and by using the m-Theorem [48], and were presented in (A.12) of\nRef. [34]. These expressions are valid if the masses mi, j, k, l in the propagators of the integrals\nare much larger that the external momenta p, k, r and if the differences of the squared masses\ninvolved in the same integral are much smaller than their sums. This last condition is fulfilled in\nthe present case of the heavy MSSM Higgs sector, even after radiative corrections are included in\nthe Higgs mass predictions. In order to illustrate this point we shortly present in the following the\napproximate MSSM Higgs mass values in the decoupling limit that include the leading radiative\ncorrections. But the conclusions hold even when the full radiative corrections are employed. To\nbe more precise, in the MSSM, using mAo and tan β as input parameters, and including the\nleading radiative corrections which can be parametrized in terms of the quantity,\n\n\n\n\nMQ̃2\n3 GF m4t\n\n√\nδ≡\nlog 1 + 2  ,\nmt\n2π 2 sin2 β\n\nthe Higgs masses approach the following values, in the decoupling limit, mAo ≫ mZ [9],\nmho −→\n\nq\n\nm2Z cos2 2β + δ sin2 β\n\n\"\n\n10\n\n1+\n\nδ m2Z cos2 β\n2 m2Ao (m2Z cos2 2β + δ sin2 β)\n\n\fm2 sin2 2β + δ cos2 β\n− Z\n,\n2 m2Ao\n#\n\"\nm2Z sin2 2β + δ cos2 β\n,\n−→ mAo 1 +\n2 m2Ao\n#\n\nmH o\n\nmH ± −→ mAo\n\nm2\n1 + 2W\nmAo\n\n\"\n\n#1/2\n\n,\n\n(28)\n\nand the mixing angle in the Higgs sector, α, approaches to,\nα→β−\n\nπ\n⇒ sαβ → −1 .\n2\n\nWe see, from the previous expressions that indeed, in the decoupling limit, mho always stays\nbelow a maximum value which can grow up to about 130 GeV depending on the particular value\nof tan β and the common squark mass MQ̃ .3 The other Higgs bosons, H o , H ± and Ao become very\nheavy and approximately degenerate in the decoupling limit, where mH o ∼ mH ± ∼ mAo ≫ mZ .\nTherefore the condition that the squared mass differences for the heavy Higgs sector of the MSSM\nare always smaller than their sums is largely justified in the decoupling limit both to tree level\nand in the one loop approximation. Notice however that in the present computation of the\nelectroweak Green's functions to one loop level, we use the tree level Higgs masses in the internal\npropagators. The use of the radiatively corrected Higgs masses would be effectively a two loop\neffect.\nFinally, by considering sαβ → −1 and inserting the asymptotic expressions of the one loop\nintegrals into eq. (24) and, after some algebra, we get the Green functions in the decoupling limit\nthat are collected in appendix A. These asymptotic results can be summarized by the following\ngeneric expressions [34],\nV2 ...Vn\nV2 ...Vn\n2 ...Vn\nΓμV1ν...ρ\n= Γ0V1μVν...ρ\n+ ∆ΓμV1ν...ρ\n(29)\nwhere the subscript 0 refers to the tree level functions, and the one-loop contributions to the two,\nthree and four-point functions behave, in the decoupling limit, respectively as follows,\n∆ΓμV1νV2\n∆ΓVμ1νVσ2 V3\n∆ΓμV1νVσ2λV3 V4\n\n=\n\nh\n\nV1 V2\nΣ(0)\n\n+\n\nV1 V2 2\nΣ(1)\nk\n\ni\n\ngμ ν +\n\nV1 V2\nR(0)\n\nk 2 ∆m2\nkμ kν + O\n,\nΣm2 Σm2\n\nk 2 ∆m2\n= F\nLμ ν σ + O\n,\nΣm2 Σm2\n!\nk 2 ∆m2\nV1 V2 V3 V4\n,\n= G\nβμ ν σ λ + O\nΣm2 Σm2\nV1 V2 V3\n\nwhere,\nV1 V2\nΣ(0)\n\n→0,\n\nV1 V2\nR(0)\n\n=\n\nV1 V2\n−Σ(1)\n\n!\n\n!\n\nk 2 ∆m2\n, O\n,\nΣm2 Σm2\n\n(30)\n\n!\n\n→ 0,\n\n(31)\n\nk denotes generically any of the external momenta and Σm2 and ∆m2 refer generically to sums\nand differences of Higgs squared masses respectively. The relevant content are in the functions\n3\n\nSimilar conclusions are found if the more general hypothesis of non-common squark mass parameter is assumed.\n\n11\n\n\fV1 V2\nΣ(1)\n, F V1 V2 V3 and GV1 V2 V3 V4 which contain a ∆ǫ proportional term, with ∆ǫ being defined in\n(A.1), and a finite contribution that is a logarithmic function of the heavy Higgs masses, mH 0 ,\nmH + and mA0 . These functions are precisely the only remnant of the heavy Higgs particles and,\ntherefore, a priori, they summarize all the potential non-decoupling effects of these particles in\nthe low energy electroweak gauge bosons physics. In the next section we will show, however, that\nthese apparent non-decoupling effects are, indeed, non-physical since they do not manifest in the\nelectroweak observables.\n\n4\n\nDecoupling of the MSSM Higgs particles á la Appelquist\nCarazzone\n\nIn the previous section we have presented the asymptotic results of the electroweak gauge boson\nfunctions coming from the integration at one loop of the heavy MSSM Higgs particles. We have\nshown that all the potential non-decoupling effects of these heavy Higgs particles manifest as\ndivergent contributions in D = 4 and some finite contributions logarithmically dependent on\nthe heavy Higgs masses. Furthermore, as can be seen in eq. (30), these contributions are both\nproportional to the tree level functions, so that we expect them to be finally absorbed by some\nproper redefinition of the low energy SM parameters.\nIn this section we are going to complete the demonstration of decoupling of the MSSM\nHiggs particles á la Appelquist Carazzone by finding a particular set of counterterms for the SM\nelectroweak parameters which precisely allow to absorb all the mentioned effects. We will also\nshow that these explicit counterterms coincide with the expressions of the corresponding on-shell\nSM counterterms in the decoupling limit. By using the common language in the renormalization\ncontext, it is equivalent to say that the decoupling at the Green functions (or effective action)\nlevel manifests if (and only if) the on-shell prescription for the counterterms is fixed. Of course,\nonce the decoupling is shown at the electroweak gauge boson functions level, the decoupling in\nthe observables with external electroweak gauge bosons is automatically ensured, and this latter\nis obviously independent of the renormalization prescription.\nLet us start by stating the condition for decoupling in terms of the renormalized electroweak\ngauge boson functions. As usual, these functions are obtained as follows,\nV1 V2 ...Vn\nV1 V2 ...Vn\nV2 ...Vn\n2 ...Vn\nΓRV1μVν...\n(ci R ) + δΓμV1ν...\n(ci R ) ,\nρ (ci R ) = Γ0 μ ν... ρ (ci R ) + ∆Γμ ν... ρ\nρ\n\n(32)\n\nwhere, once more, Γ0 denote the tree level contributions, ∆Γ are the one-loop contributions, and\nδΓ represent the contributions from the counterterms of the SM parameters and wave functions.\nAll these contributions must be written in terms of the renormalized parameters that we have\ndenoted here generically by ci R . Now, the decoupling of heavy particles á la Appelquist Carazzone\nis equivalent to the statement that the renormalized Green functions are equal to the corresponding tree level functions, evaluated at the renormalized parameters, plus corrections that go as\ninverse powers of the heavy masses and vanish in the asymptotic limit. Therefore, it implies the\nfollowing conditions,\nV2 ...Vn\nV2 ...Vn\n∆ΓμV1ν...\n(ci R ) + δΓμV1ν...\n(ci R ) ≈ 0 ; k 2 ≪ m2i , ∀i ,\nρ\nρ\n\n12\n\n(33)\n\n\fwhere, for the present case, mi are the heavy Higgs masses, k any of the external momenta, and,\nby ≈ 0 we mean quantities vanishing\n\u0010 2 in the\n\u0011 decoupling limit which have been written generically\n∆m2\nk\nalong this paper as being of O Σm\n,\n2 Σm2 .\n\nIn order to find the wanted explicit SM counterterms we need to include in eq. (33) the\nasymptotic results presented in the previous section for ∆Γ, write δΓ in terms of the SM counterterms and finally solve the complete system of equations with all the two, three and four point\nfunctions included.\n\nBy using the standard multiplicative renormalization procedure [44, 49], the bare SM electroweak fields and parameters, denoted here by a superscript 0, and the renormalized ones are\nrelated by,\n1/2 ~\n~ μ0 ≡ ZW\nW\nWμ\n\n0\nξW\n≡ ξW (1 + δξW )\n−1/2\n\ng 0 ≡ ZW\n\n1\n\n1\n\n1/2\n\n, Bμ0 ≡ ZB Bμ , Φ0 = (ZΦ ) 2 Φ,\nξB0 ≡ ξB (1 + δξB ),\n\n,\n\n0\n\n−1/2\n\n, g ′ ≡ ZB\n\n(g − δg)\n\nv 0 = (ZΦ ) 2 (v − δv)\n\n,\n\n(g ′ − δg ′ ) ,\n\nZi ≡ 1 + δZi , i ≡A,Z,W,B,Φ .\n\n(34)\n\nThe counterterms for the physical masses and physical fields are related to the previous ones by,\nδv\nδg\n− 2 − δZW )\ng\nv\nδg\nδv\nδg ′\n= m2Z (δZΦ − 2c2W\n− 2s2W ′ − 2 − δZZ )\ng\ng\nv\n2\n2\n= sW δZW + cW δZB\n= c2W δZW + s2W δZB ,\n\nδm2W = m2W (δZΦ − 2\nδm2Z\nδZA\nδZZ\n\n(35)\n\nwhere, as usual, s2W = 1 − m2W /m2Z and e = gsW .\nThe contributions from the various renormalization constants to the two, three and four point\nfunctions can be written as [44],\nδΓAA\n=\nμν\n\nh\n\n\"\n\nδΓAZ\nμν\n\n\u0010\n\n\u0011\n\ni\n\n− s2W δZW + c2W δZB k 2 gμν\n!\n\n!\n\n!\n\n!#\n\n!\n\n!#\n\nδξW\nδξB\n1\n1\n+ sW\nδZW + c2W\nδZB\nkμ kν ,\n+ 1−\n+ 1−\nξW\nξW\nξB\nξB\n#\n!\n\"\nsW 2 δg ′ δg\n2\nm\n− sW cW ( δZW − δZB ) k gμν\n−\n=\ncW W g ′\ng\n\"\n!\n!\n#\nδξW\nδξB\n1\n1\n+ sW cW\nδZW −\nδZB kμ kν ,\n+ 1−\n− 1−\nξW\nξW\nξB\nξB\n\nδΓZZ\n=\nμν\n+\nW\nδΓW\n=\nμν\n\nh\n\n\"\n\nh\n\n2\n\n\u0010\n\nδm2Z + m2Z − k 2\n2\n\ncW\n\n\u0011\u0010\n\nc2W δZW + s2W δZB\n\nδξW\n1\n+ 1−\nξW\nξW\n\u0010\n\nδm2W + m2W\n\n!\n\n!\n\n\u0011i\n\ngμν\n\n1\nδξB\nδZW + sW\n+ 1−\nδZB\nkμ kν ,\nξB\nξB\n!\n#\n\"\n\u0011\ni\n1\nδξ\nW\nδZW kμ kν ,\n+ 1−\n− k 2 δZW gμν +\nξW\nξW\n13\n\n2\n\n\f+W −\nδΓAW\nμνσ\n\n+W −\nδΓAAW\nμν σλ\n\n+W −\n\nδΓZZW\nμνσλ\n\n\"\n\n= g sW Lμ ν σ δZW\n\nδg\n−\ng\n\n#\n\n\"\n\n+W −\nδΓZW\nμνσ\n\n,\n\n\"\n\n= g cW Lμ ν σ δZW\n\n#\n\nδg\n−\ng\n\n#\n\n,\n\n\"\n\n#\n\nδg\nδg\n+W −\n= −g sW ßμνσλ δZW − 2\n, δΓAZW\n,\n= −g 2 sW cW ßμνσλ δZW − 2\nμν σλ\ng\ng\n#\n#\n\"\n\"\nδg\nδg\n+\n−\n+\n−\nW\nW\nW\nW\n2\n, δΓμ ν σ λ\n.\n= g ßμσνλ δZW − 2\n= −g 2 c2W ßμνσλ δZW − 2\ng\ng\n(36)\n2\n\n2\n\nThe results for the one-loop contributions to the electroweak gauge boson functions, presented in\nthe previous section and in appendix A, can be rewritten in a more simplified form and in terms\nof just the heavy mA0 mass as follows,\ne2\nKμ ν ΨH\n8π 2\ng2\nW\nKμ ν ΨH\n∆ΓW\n=\n−\nμν\n16π 2\neg 2\n+W −\n∆ΓμAW\n=\nLμ ν σ Ψ H\nνσ\n16π 2\ne2 g 2\n+W −\nßμνσλ ΨH\n∆ΓAAW\n=\n−\nμν σλ\n16π 2\ng4 2\n+W −\n∆ΓZZW\n=\n−\nc ßμνσλ ΨH\nμνσλ\n16π 2 W\nA\n∆ΓA\nμν = −\n\n,\n,\n,\n,\n,\n\neg (2s2W − 1)\nKμ ν ΨH ,\n16π 2\ncW\ng 2 (2s2W − 1)2 + 1\n∆ΓZμ νZ = −\nKμ ν ΨH ,\n16π 2\n2c2W\ng3\n+W −\n∆ΓZW\n=\ncW Lμ ν σ ΨH ,\nμνσ\n16π 2\neg 3\n+W −\n∆ΓAZW\ncW ßμνσλ ΨH ,\n=\n−\nμνσλ\n16π 2\ng4\n+\n−\n+\n−\n∆ΓμWν σWλ W W =\nßμσνλ ΨH\n16π 2\nZ\n∆ΓA\nμν =\n\n(37)\n\nwhere,\n1\nΨH ≡\n6\n\nm2A0\n∆ǫ − log 2\nμo\n\n!\n\n,\n\nKμ ν ≡ k 2 g μ ν − k μ k ν\n\n(38)\n\nBy plugging the previous results of eqs. (35) through (38) into eq. (33) and by solving the system\nwe finally find the following solution for the SM counterterms:4\nδZA = −\n\ne2\nΨH\n8π 2\n\ng2\nm2 ΨH\n16π 2 W\ng 2 m2Z\n(1 − 2s2W + 2s4W )ΨH ,\n= −m2Z δZZ =\n16π 2 c2W\n\nδm2W = −m2W δZW =\nδm2Z\n\n(39)\n\nand,\nδξW = δZW\nδg ′\n≈0\ng′\n4\n\n,\n,\n\nδξB = δZB ,\nδg\n≈ 0.\ng\n\nSimilar results have been found for sfermions, charginos and neutralinos in [50].\n\n14\n\n(40)\n\n\fNotice that, as in our previous formulas, the results for all the counterterms above have corrections, not explicitely shown, that vanish in the asymptotic limit of infinitely heavy mA0 .\nTo finish this section we find interesting to compare the previous results for the SM counterterms with the corresponding counterterms of the on-shell renormalization prescription which are\ndefined, as usual, by [51]:\nW\nδm2W = −Re ΣW\n(m2W ) ,\nT\n2\nδm2Z = −Re ΣZZ\nT (mZ ) ,\n\nδZA = Re\n\n2\n∂ΣAA\nT (k )\n|k2 =0\n∂k 2\n\n,\n\nW\n∂ΣW\n(k 2 )\nT\n|k2 =m2W\n∂k 2\n2\n∂ΣZZ\nT (k )\nδZZ = Re\n|k2 =m2Z\n∂k 2\nδg\n1 ΣAZ\nT (0)\n=\ng\ncW sW mZ\n\nδZW = Re\n\n(41)\n\nplus the solution for δg ′ that is a consequence of the U(1)Y Ward identity,\nδg ′\n= 0,\ng′\n\n(42)\n\nNotice that, after plugging our asymptotic expressions for the ΣTV1 V2 functions of appendix A\ninto eq. (41), the solutions for the on-shell counterterms coincide with our solutions of eqs. (39)\nand (40) in the decoupling limit.\nIn summary, we have shown in this section that the heavy MSSM Higgs particles decouple\nfrom the low energy electroweak gauge boson physics. We have found as well that the SM\ncounterterms that are needed to absorb all the (non-physical) heavy Higgs effects are precisely\nthe on-shell counterterms, being these consistently evaluated in the decoupling limit.\n\n5\n\nComparison with the SM Higgs boson case\n\nWe present in this section the paradigmatic case of the SM heavy Higgs boson and its comparison\nwith the present case of a MSSM heavy Higgs sector. It is very well known that the SM Higgs\nparticle does not decouple from the low energy electroweak physics. The logarithmic dependent\nterms on the heavy Higgs mass that appear in various electroweak precision observables to oneloop, as for instance, ∆ρ, ∆r.., are clear remnants of the non-decoupling SM Higgs effects. Indeed,\nit is precisely this non-decoupling phenomenon that is after all being responsible for the present\nupper Higgs mass limit, mH < 230 GeV at 95%CL, which is imposed by the present data not\nallowing easily to accommodate a heavy Higgs.\nWe present in the following the results of integrating out the heavy SM Higgs particle at the\none-loop level for the electroweak gauge boson part of the SM effective action. The corresponding\nresults for the so-called effective Electroweak Chiral Lagrangian and the chiral parameters were\nfound some years ago in [40–43, 52]. We will work here instead in the different context of the\neffective SM action and the Appelquist Carazzone Theorem that we have chosen in this paper.\n\n15\n\n\fBy integrating out the physical Higgs boson particle at the one-loop level in the SM, and by\nfollowing the same procedure as outlined in the previous sections, we have found the following\nasymptotic results for the two, three and four-point electroweak gauge functions, to be valid in\nthe very large Higgs mass limit, MHSM ≫ MZ , k,\nAZ\n∆ΓAA\nμν ≈ 0 , ∆Γμν ≈ 0\n\nMH2 SM\ng2\n1\n2\n=\nM\n+ 1 gμν ,\n∆\n−\nlog\nǫ\n16π 2 2 c2W HSM\nμ2o\n!\nMH2 SM\ng2 1 2\nWW\n+ 1 gμν ,\n∆Γμν =\nM\n∆ǫ − log\n16π 2 2 HSM\nμ2o\n!\n\n∆ΓZZ\nμν\n\nW\nZW W\n∆ΓAW\nμ ν σ ≈ 0 , ∆Γμ ν σ ≈ 0\nW\nAZW W\n∆ΓAAW\nμ ν σ λ ≈ 0 , ∆Γμ ν σ λ ≈ 0\n\nMH2 SM\ng4\n1\n=\n∆ǫ − log\ngμν gσλ ,\n16π 2 2 c2W\nμ2o\n!\nMH2 SM\ng4 1\nWWWW\n∆ǫ − log\n(gμν gσλ + gμλ gνσ ) ,\n∆Γμ ν σ λ =\n16π 2 2\nμ2o\n!\nMH2 SM\ng4 1\nZZZZ\n∆ǫ − log\n(gμν gσλ + gμλ gνσ + gμσ gνλ ) ,\n∆Γμνσλ =\n16π 2 2 c4W\nμ2o\n!\n\nW\n∆ΓZZW\nμνσλ\n\n(43)\n\nwhere ≈ 0 here means quantities that go with inverse powers of the SM Higgs mass and vanish\nin the asymptotic limit.\nNext, it is inmediate to find out the corresponding SM counterterms given by,\nMH2 SM\nδm2W\nδm2Z\ng 2 1 MH2 SM\n∆\n−\nlog\n+1 ,\n=\n=\n−\nǫ\nm2W\nm2Z\n16π 2 2 m2W\nμ2o\nδg\nδg ′\n≈ 0 , ′ ≈ 0,\ng\ng\nδZW = δξW ≈ 0 , δZB = δξB ≈ 0 .\n!\n\n(44)\n\nBy comparing eq. (44) and eqs. (39), (40) we already see some differences. While in the MSSM all\nthe Higgs mass dependence, in the decoupling limit, is logarithmic, in the SM case the dominant\ncontribution to the two point functions goes with the square of the Higgs mass. Another relevant\ndifference is in the four point functions. The results in eq. (44) show that the one-loop corrections\nfrom the SM Higgs integration are not proportional to the tree level tensor, ßμνσλ , and, as a\nconsequence, these can not be absorbed by the SM counterterms. This is a clear indication of\nthe non-decoupling of the Higgs particle.\nFinally, by substituting the previous results of eqs. (43) and (44) into eq. (32) , we see that\nthe resulting renormalized SM Green functions at low energies, k ≪ MHSM , are not all equal to\nthe tree level ones evaluated at the renormalized parameters, as in the MSSM case, but there are\n\n16\n\n\fsome extra terms in the four functions given generically by,\nΓRV1μVν2 Vσ3λV4 (ci R )\nwith,\n\n−\n\nΓ0Vμ1 Vν2σV3λV4 (ci R )\n\n= a5\n\ng2\ng2\nWμ W μ + 2 Zμ Z μ\n2\n4cW\n\nMH2 SM\nv2\n1 1\n∆\n−\nlog\n+\na5 =\nǫ\n8MH2 SM\n16π 2 4\nμ2o\n\n!\n\n.\n\n!2\n\n,\n\n(45)\n\n(46)\n\nNotice that the value of this effective parameter does not coincide with the so-called electroweak\nchiral parameter a5 computed in [40,41,53]. The reason is because this later contains the quantum\neffects of mixed diagrams with both gauge bosons and the Higgs particle in the loops which are\nrelevant for the computation of the non-decoupling contributions to observables as for instance\n∆ρ. In contrast the result presented in eq. (46) does not include these mixed diagrams.\nIn summary, the previous eq. (45) shows explicitely that the decoupling theorem of Appelquist\nand Carazzone does not apply in the case of the SM with a very heavy Higgs particle.\n\n6\n\nConclusions\n\nWe have shown in this work that the heavy Higgs Sector of the MSSM composed of the H ± ,\nH 0 and A0 scalar particles decouple from the electroweak SM gauge boson physics at the one\nloop level and under the hypothesis that the Higgs masses are well above the electroweak gauge\nboson masses. The demonstration has consisted of the computation of the effective action for the\nelectroweak gauge bosons that results after the integration to one loop of the H ± , H 0 and A0\nHiggs bosons. We have found that, in the limit of very large m0A as compared to the electroweak\nscale, all these one-loop effects can be absorbed into redefinitions of the SM parameters, more\nspecifically by the counterterms of eqs. (39) and (40).\nIn this decoupling limit the only remnant to low energies is, therefore, the light MSSM Higgs\nparticle h0 with a mass below approximately 130 GeV . However, it is still an open question if all\nthe interactions of this light Higgs particle with all the SM particles, fermions and gauge bosons,\nin the decoupling limit and to all orders in perturbation theory, are exactly the same as the SM\nHiggs particle interactions. In our opinion, it is an interesting subject that is worth to investigate.\n\nAcknowledgments.\nWe wish to thank H.E.Haber and W.Hollik for interesting discussions. S.P. would like to thank\nJ.Guasch for many helpful discussions. This work has been partially supported by the Spanish\nMinisterio de Educación y Cultura under projects CICYT AEN97-1678, AEN93-0776 and PB980782, and the fellowship AP95 00503301.\n\n17\n\n\fAppendix A.\nWe present here the exact results for the 2, 3 and 4-point Green functions of the electroweak\ngauge bosons, and their asymptotic results in the decoupling limit, mAo ≫ mZ , and with all the\nheavy Higgs masses much larger than any of the external momenta.\nIn order to present these results for the corresponding Green functions, we use the notation\nintroduced in eq. (29). For brevity, we have omitted the arguments of the one-loop integrals and\nwe use the following compact notation:\n32\n32\n14\n14\n≡ Iμν\n(k, mH o , mH2 )\nIμν\n≡ Iμν\n(k, mH1 , mAo ) , Iμν\n\nTμ14 ≡ Tμ14 (p, mH 1 , mAo ) , Tν31 ≡ Tν31 (k, mH o , mH 1 ) ,\n\n231\n231\n123\n123\n≡ Tνσμ\n(k, r, mH 2 , mH o , mH 1 ) , etc.\nTμνσ\n≡ Tμνσ\n(p, k, mH 1 , mH 2 , mH o ) , Tνσμ\n\nLet us mention that all the asymptotic expressions below have corrections that are suppressed\nby inverse powers of the heavy masses, which vanish in the asymptotic large mass limit. They\nhave been evaluated to one loop in dimensional regularization, with:\n∆ǫ =\n\n2\n− γǫ + log(4π) , ǫ = 4 − D ,\nǫ\n\n(A.1)\n\nand μo is the scale of dimensional regularization.\n\nTwo-Point Functions\nBy following the notation given in eq. (29) for the 2-point Green functions, Γ0 Vμ1νV2 represent the\ntree level contributions which are written in a covariant arbitrary gauge Rξ as,\n!\n\n1\nkμ kν (V = Z, W ) ,\nΓ0 Vμ νV (k) = (m2V − k 2 )gμ ν + 1 −\nξV\n!\n1\nAA\n2\nkμ kν , Γ0 μV1νV2 = 0 if V1 6= V2 ,\nΓ0 μ ν = −k gμ ν + 1 −\nξA\n\n(A.2)\n\nand ∆ΓμV1νV2 are the one-loop contributions defined in terms of the transverse and longitudinal\nparts, ΣTV1 V2 and ΣLV1 V2 , by:\n∆ΓμV1νV2\n\nV1 V2\n\n= ΣT\n\n(k) gμ ν\n\nkμ kν\n− 2\nk\n\n!\n\n+ ΣLV1 V2 (k)\n\nkμ kν\n.\nk2\n\n(A.3)\n\nThe exact results for the one-loop contributions to the two-point Green functions of the\nelectroweak gauge bosons are:\nA\n∆ΓA\nμ ν (k)\n\n\u001a\ni\u001b\n1 h 12\ne2\n21\nI + Iμν\n[A0 (mH1 ) + A0 (mH2 ) ] gμν −\n= −\n16 π 2\n2 μν\n\n18\n\n(A.4)\n\n\fg2 1 n 2\nc [A0 (mH1 ) + A0 (mH2 )] gμν + [A0 (mH o ) + A0 (mAo )] gμν\n16 π 2 4 c2W 2W\nh\ni\ni\u001b\n1 2 h 34\n1\n2\n12\n21\n2\n43\n(A.5)\n− (2sW − 1) Iμν + Iμν − sαβ Iμν + Iμν\n2\n2\n\n∆ΓZμ νZ (k) = −\n\nZ\n∆ΓA\nμ ν (k) = −\n\neg 1\n16 π 2 2 cW\n\nh\ni\u001b\n1\n12\n21\n(2s2W − 1) Iμν\n+ Iμν\n2\n(A.6)\n\n\u001a\n\nc2W [A0 (mH1 ) + A0 (mH2 )] gμν +\n\ng2 1 n\n[A0 (mH1 ) + A0 (mH2 ) + A0 (mH o ) + A0 (mAo )] gμν\n16 π 2 4\n\u0010\n\u0011 i\u001b\n1 h 14\n24\n41\n42\n13\n23\n31\n32\n−\nIμν + Iμν\n+ Iμν\n+ Iμν\n+ s2αβ Iμν\n+ Iμν\n+ Iμν\n+ Iμν\n,\n4\n\nW\n∆ΓW\nμ ν (k) = −\n\n(A.7)\n\nij\nwhere Iμν\nhas been defined in eq. (27) and A0 is the scalar one-loop integral, which is defined\nin [46, 47].\n\nBy using the asymptotic results of the one-loop integrals that were presented in our previous\nwork [33,34], we obtain the following asymptotic results for the one-loop heavy Higgs contributions\nto the transverse and longitudinal parts:\n•\n\nm2H ± ≫ k 2 :\nΣAA\n(k)H\nT\nAZ\nT\n\nΣ (k)H\n•\n\ne2 k 2\n= −\n16 π 2 3\n\nm2 +\n∆ǫ − log H2\nμo\n\ne g (2s2W − 1) k 2\n=\n16 π 2\n2cW\n3\n\n!\n\n,\n\nm2 +\n∆ǫ − log H2\nμo\n\n(A.8)\n!\n\n,\n\n(A.9)\n\nm2H ± , m2H o , m2Ao ≫ k 2 ; |m2H o − m2Ao | ≪ |m2H o + m2Ao |:\ng2\n1 n\nh(m2H o , m2Ao )\n16 π 2 4 c2W\n\"\n!\n!#)\nm2H +\nk2\nm2H o + m2Ao\n2\n2\n−\n(2sW − 1) ∆ǫ − log 2\n+ ∆ǫ − log\n,\n3\nμo\nμ2o\n\nΣZZ\n(k)H =\nT\n\n(A.10)\n•\n\nm2H ± , m2H o , m2Ao ≫ k 2 ; |m2H o − m2H ± | ≪ |m2H o + m2H ± | ; |m2Ao − m2H ± | ≪ |m2Ao + m2H ± |:\nWW\nT\n\nΣ\n\n(k)H\n\ni\ng2 1 n h\n2\n2\n2\n2\nh(m\n=\n+ , mH o ) + h(mH + , mAo )\nH\n16 π\"2 4\n!\n!#)\nk2\nm2H + + m2Ao\nm2H + + m2H o\n−\n+ ∆ǫ − log\n,\n∆ǫ − log\n3\n2μ2o\n2μ2o\n\n(A.11)\n\nwhere h(m21 , m22 ) is a function defined as:\nh(m21 , m22 ) ≡ m21 log\n\n2m21\n2m22\n2\n+\nm\nlog\n,\n2\nm21 + m22\nm21 + m22\n19\n\n(A.12)\n\n\fand whose asymptotic behaviour in the large m1 and m2 limit, with |m21 − m22 | ≪ |m21 + m22 | is:\n\n\nm21 − m22  (m21 − m22 )\nm21 − m22\nh(m21 , m22 ) →\n+\nO\n2\n(m21 + m22 )\nm21 + m22\n\n!2 \n\n.\n\n(A.13)\n\nV2\nV2\nV2\n+ ΣTV1(1)\nk 2 , where ΣTV1(0)\nThe above results can be written, in a generic form, as: ΣTV1 V2 (k) = ΣTV1(0)\nV2\nand ΣTV1(1)\nare k independent functions. The results for the corresponding longitudinal parts can\nbe summarized in short by:\nV V\nΣLV1 V2 (k) = ΣT1(0)2 ∀ V1 V2 .\n\nFor example,\nW\nΣW\n(k)H =\nL\n\no\ng2 1 n\n2\n2\n2\n2\nh(m\n+ , mH o ) + h(mH + , mAo ) .\nH\n16 π 2 4\n\n(A.14)\n\nThree-Point Functions\nAnalogously to the previous case, we define the three-point Green functions by following the\nnotation introduced in eq. (29), with ingoing momenta assignments V1μ (−p), V2ν (−k) and V3σ (−r).\nThe tree level contributions, Γ0 Vμ1νVσ2 V3 , are given by,\n+W −\n\nΓ0 AW\nμνσ\n\n+W −\n\n= e Lμνσ , Γ0 ZW\nμνσ\n\n= gcW Lμνσ ,\n\n(A.15)\n\nwith:\nLμ ν σ ≡ [(k − p)σ gμ ν + (r − k)μ gν σ + (p − r)ν gμ σ ] ,\n\n(A.16)\n\nand the AW + W − and ZW + W − exact one-loop contributions are:\n+W −\n\n∆ΓμAW\nνσ\n\nH\n\n+W −\n\n∆ΓZW\nμν σ\n\nH\n\ni\neg 2 1 n 2 h 13\n31\n31\n13\n(T\n−\nT\n)\ng\n+\n(T\n−\nT\n)\ng\ns\nμν\nμσ\nσ\nσ\nν\nν\nαβ\n2\nh 8 16 π\ni\n+ (Tσ14 − Tσ41 ) gμν + (Tν41 − Tν14 ) gμσ\ni\n1 2 h 231\n231\n321\n321\n123\n123\n−\nsαβ Tνσμ − Tσνμ\n+ Tσμν\n− Tνμσ\n+ Tμνσ\n− Tμσν\n3\ni\u001b\n1 h 142\n142\n412\n412\n124\n124\nT\n− Tσνμ + Tσμν − Tνμσ + Tμνσ − Tμσν ,\n−\n3 νσμ\n\n= −\n\n=\n+\n−\n−\n+\n+\n\ni\ng 3 1 n 2 2 h 13\n31\n31\n13\ns\ns\n(T\n−\nT\n)\ng\n+\n(T\n−\nT\n)\ng\nμν\nμσ\nσ\nσ\nν\nν\n8 cW 16 π 2 αβ W\nh\ni\ns2W (Tσ14 − Tσ41 ) gμν + (Tν41 − Tν14 ) gμσ\nh\ni\n1 2\n231\n231\n321\n321\n123\n123\nsαβ (2s2W − 1) Tνσμ\n− Tσνμ\n+ Tσμν\n− Tνμσ\n+ Tμνσ\n− Tμσν\n6\nh\ni\n1 2\n142\n142\n412\n412\n124\n124\n(2sW − 1) Tνσμ\n− Tσνμ\n+ Tσμν\n− Tνμσ\n+ Tμνσ\n− Tμσν\n6\n1 2 h 341\n341\n431\n431\n143\n143\ns T\n− Tμσν\n+ Tμνσ\n− Tμσν\n+ Tσμν\n− Tνμσ\n6 αβ μνσ\nio\n134\n134\n413\n413\n314\n314\n,\nTσμν\n− Tνμσ\n+ Tνσμ\n− Tσνμ\n+ Tνσμ\n− Tσνμ\n\n20\n\n(A.17)\n\n(A.18)\n\n\fijk\nwhere Tμij and Tμνσ\nare the one-loop integrals as defined in [34].\n\nBy using the asymptotic results of the above mentioned integrals, we have obtained the\nfollowing expressions for the three-point functions in the decoupling limit:\n+W −\n∆ΓμAW\nνσ H\n\n1 eg 2\n=\nLμ ν σ\n16π 2 12\n\n(\n\n2m2H + + m2Ao\n2m2H + + m2H o\n− log\n2∆ǫ − log\n3μ2o\n3μ2o\n\n)\n\n,\n(A.19)\n\n+W −\n\n∆ΓZW\nμν σ\n\nH\n\n3\n\n=\n\n+ m2H o + m2Ao\n3μ2o\n!)\n2m2H + + m2Ao\n.\n3μ2o\n\nm2H +\n\n(\n\n1 g\n1\nLμ ν σ c2W ∆ǫ − log\n2\n16π 6cW\n2\n2\n2\nc2W\n2mH + + mH o\n−\nlog\n+ log\n4\n3μ2o\n\n(A.20)\n\nFour-Point Functions\nFinally, for the 4-point Green functions, ΓμV1νVσ2λV3 V4 , with ingoing momenta assignments V1μ (−p),\nV2ν (−k), V3σ (−r) and V4λ (−t) we have obtained the results presented below. The tree level\ncorresponding contributions different from zero are:\n+\n\n+\n\n−\n\n−\n\nW\nW\nΓAAW\n= −e2 ßμνσλ , ΓAZW\n= −g 2 sW cW ßμνσλ ,\n0 μν σλ\n0 μν σλ\n+\n\n+\n\n−\n\n−\n\nW\nΓZZW\n= −g 2 c2W ßμνσλ , Γ0Wμ νWσ λW\n0 μν σλ\n\n+W −\n\n= g 2ssμσνλ ,\n\n(A.21)\n\nwhere ßμσνλ is defined by,\nßμ ν σ λ ≡ [2gμ ν gσ λ − gμ σ gν λ − gμ λ gν σ ] ,\n\n(A.22)\n\n4\nand the exact results for the one-loop contributions of the heavy Higgs sector, ∆ΓμV1νVσ2λV3 VH\n, are\nthe following:\n\n\u0011\n1\u0010\ne2 g 2\n14\n14\n11\ng\ng\nJ\n+\ng\ng\nJ\ng\ng\nJ\n+\nμσ νλ p+r\nνσ μλ k+r\nμν σλ p+k\nH\n16π 2\n4\n\u0011\ns2αβ \u0010\n1\n31\n31\n111\n111\n+\ngμσ gνλ Jp+r\n+ gνσ gμλ Jk+r\n− gσλ [Jμν\n+ Jνμ\n]\n4\n2\ns2αβ\n113\n113\n113\n113\n−\n[gσν Jμλ\n+ gσμ Jνλ\n+ gλν Jμσ\n+ gλμ Jνσ\n]\n4\ns2\n1\n1\n114\n114\n114\n114\n311\n141\n+ gσμ Jνλ\n+ gλν Jμσ\n+ gλμ Jνσ\n] − αβ gμν Jλσ\n− gμν Jλσ\n− [gσν Jμλ\n4\n2\n2\n\u001b\ns2αβ 1113\n1 1141\n1141\n+\nJ\n+ [J\n+ Jμσλν ] ,\n4 μνλσ 4 μλσν\n+W −\n\n∆ΓAAW\nμν σλ\n\n=\n\n\u001a\n\n\u0011\ns2W \u0010\neg 3\n11\n14\n14\nc\ng\ng\nJ\n−\ng\ng\nJ\n−\ng\ng\nJ\n=\n2W\nμν\nσλ\nμσ\nνλ\nνσ\nμλ\np+k\np+r\nk+r\n32π 2 cW\n2\n2\n2 \u0010\n\u0011\ns s\nc2W\n31\n31\n111\n111\n− αβ W gμσ gνλ Jp+r\n− gνσ gμλ Jk+r\n−\ngσλ [Jμν\n+ Jνμ\n]\n2\n2\n+W −\n∆ΓAZW\nμν σλ H\n\n\u001a\n\n21\n\n(A.23)\n\n\fs2αβ c2W\ns2αβ s2W\n113\n113\n113\n113\n[ gνλ Jμσ + gνσ Jμλ ] −\n[ gμλ Jνσ\n+ gμσ Jνλ\n]\n+\n2\n4\ns2αβ c2W\nc2W\ns2\n114\n114\n114\n114\n311\n+ gνσ Jμλ\n]−\n[gμλ Jνσ\n+ gμσ Jνλ\n]−\ngμν Jλσ\n+ W [gνλ Jμσ\n2\n4\n2\ns2αβ\nc2W\n141\n134\n134\n431\n431\n−\ngμν Jλσ +\n[ gμλ Jνσ\n+ gμσ Jνλ\n+ gμλ Jνσ\n+ gμσ Jνλ\n]\n2\n4\n\u001b\ns2\ns2 c2W 1113\nc2W 1141\n1113\n1141\n1134\n1134\n[ Jμνσλ + Jμνλσ\n]+\n[ Jμλσν + Jμσλν\n] − αβ [ Jνσμλ\n+ Jνλμσ\n] ,\n+ αβ\n4\n4\n4\n+W −\n\n∆ΓZZW\nμν σλ\n\nH\n\n=\n\n(A.24)\n\n1\ng4\n11\n33\n44\nc22W gμν gσλ Jp+k\n+ gμν gσλ [Jp+k\n+ Jp+k\n]\n2\n2\n64π cW\n2\n\u001a\n\n\u0010\n\n\u0011\n\n\u0010\n\n31\n31\n14\n14\n+ gμλ gνσ Jk+r\n+ s2αβ s4W gμσ gλν Jp+r\n+ gμλ gνσ Jk+r\n+s4W gμσ gλν Jp+r\n\n\u0011\n\ns2αβ\nc22W\n1\n111\n111\n133\n414\ngσλ [Jμν\n+ Jνμ\n]−\ngμν Jσλ\n− gμν Jσλ\n2\n2\n2\ns2αβ s2W c2W\n113\n113\n113\n113\n+\n[ gμλ Jνσ\n+ gνλ Jμσ\n+ gμσ Jνλ\n+ gνσ Jμλ\n]\n2\ns2 c2W\n114\n114\n114\n114\n+ W\n[ gμλ Jνσ\n+ gνλ Jμσ\n+ gμσ Jνλ\n+ gνσ Jμλ\n]\n4\n\u0011\ns2αβ \u0010\nc2\n434\n343\n141\n− 2W gμν Jλσ\ngσλ Jμν\n+ gσλ Jμν\n−\n2\n2\ns2 s2\n431\n431\n431\n431\n− αβ W [gνλ Jμσ\n+ gμλ Jνσ\n+ gνσ Jμλ\n+ gμσ Jνλ\n2\n134\n341\n134\n341\n+gμλ Jνσ\n+ gνλ Jμσ\n+ gμσ Jνλ\n+ gνσ Jμλ\n]\n−\n\ns2αβ c22W 1113\nc2\n1113\n1141\n1141\n[ Jμνσλ + Jμνλσ\n] + 2W [ Jμλσν\n+ Jμσλν\n]\n+\n4\n4\ns4\ns2\n4341\n4341\n3431\n3431\n+ Jμνλσ\n] + αβ [ Jμνσλ\n+ Jμνλσ\n]\n+ αβ [ Jμνσλ\n4\n4\n\u001b\ns2αβ c2W 4311\n4311\n4311\n4311\n[ Jνσμλ + Jμσνλ + Jνλμσ + Jμλνσ ] ,\n−\n4\n\n(A.25)\n\n1 33\n1 44\ng4\n11\ngμν gσλ [ Jp+k\n+ Jp+k\n+ Jp+k\n]\n=\n2\n64π\n2\n2\n1 44\n1\n1 33\n414\n414\n414\n414\n11\n+ Jk+r\n] + [ gνσ Jμλ\n− gνμ Jσλ\n− gλσ Jμν\n+ gλμ Jσν\n]\n+gσν gμλ [ Jk+r\n+ Jk+r\n2\n2\n2\n\u0011\n\u0011\n\u0010\n\u0011\n\u0010\n\u0011\n\u0010\n\u0010\ns2αβ\n313\n131\n313\n131\n313\n131\n313\n131\n−\n]\n+ gλμ Jσν\n+ Jνσ\n+ gλσ Jμν\n+ Jνμ\n+ gνμ Jσλ\n+ Jλσ\n[gνσ Jμλ\n+ Jλμ\n2\ns2\n141\n141\n141\n141\n− αβ [ − gνσ Jλμ\n+ gνμ Jλσ\n+ gλσ Jνμ\n− gλμ Jνσ\n]\n2\ns4αβ 3131\n1 4141\n1313\n1313\n1313\n1414\n1414\n1414\n[ Jμνσλ + Jμλσν\n+ Jμσνλ\n+ Jμσλν\n] + [ Jμνσλ\n+ Jμλσν\n+ Jμσνλ\n+ Jμσλν\n]\n+\n4\n4\n\u001b\ns2αβ 1413\n3141\n1314\n4131\n1314\n1314\n1413\n1413\n[J\n+ Jμλσν + Jμλσν + Jμλσν − Jμσλν − Jμσνλ − Jμσλν − Jμσνλ ] .\n(A.26)\n+\n4 μλσν\n+\n−\n+\n−\n∆ΓμWν σWλ WH W\n\n\u001a\n\nij\nijkl\nijk\nHere, Jp+k\n, Jμν\nand Jμνσλ\nare the one-loop integrals given in [34].\n\n22\n\n\fThe asymptotic results of the above contributions in the decoupling limit can be written as:\n+W −\n∆ΓAAW\nμν σλ H\n\ne2 g 2\n=\n16π 2\n\n\u001a\n\n1\n− ßμνσλ ∆ǫ + gμ ν gσ λ g1 (mH + , mH o , mAo )\n6\n\u001b\n\n+ (gμ σ gν λ + gμ λ gν σ ) g2 (mH + , mH o , mAo )\n+W −\n\n∆ΓAZW\nμν σλ\n\nH\n\n= −\n\neg 3 1\n16π 2 2 cW\n\n\u001a\n\nßμνσλ\n\nc2W\n∆ǫ + gμ ν gσ λ g3 (mH + , mH o , mAo )\n3\n\n+ (gμ σ gν λ + gμ λ gν σ ) g4 (mH + , mH o , mAo )\n+W −\n\n∆ΓZZW\nμν σλ\n\nH\n\n= −\n\ng4\n1\n2\n16π 2 c2W\n\n\u001a\n\nßμνσλ\n\n+\n\n−W +W −\n\nH\n\n=\n\ng4 1\n16π 2 4\n\n\u001a\n\nßμσνλ\n\n\u001b\n\n\u001b\n\n2\n∆ǫ + gμ σ gν λ g7 (mH + , mH o , mAo )\n3\n\u001b\n\n+ (gμ ν gσ λ + gμ λ gν σ ) g8 (mH + , mH o , mAo )\nwhere the gi (mH + , mH o , mAo ) (i = 1 . . . 8) functions are given by,\ng1 =\n−\ng2 =\n+\ng3 =\n+\ng4 =\n+\n+\ng5 =\n−\n\n1\n1\n2m2H + + m2Ao\n2m2H + + m2H o\n+\nlog\nlog\n2\n3μ2o\n2\n3μ2o\n1\n1\n3m2H + + m2Ao\n3m2H + + m2H o\n3 log\n−\n,\nlog\n3\n4μ2o\n3\n4μ2o\n1\nm2 + + m2 o\nm2 + + m2 o 1\n2m2H + + m2Ao\n1\n− log H 2 A − log H 2 H + log\n4\n2μo\n4\n2μo\n2\n3μ2o\n1\n1\n1\n2m2H + + m2H o\n3m2H + + m2Ao\n3m2H + + m2H o\n−\n−\n,\nlog\nlog\nlog\n2\n3μ2o\n3\n4μ2o\n3\n4μ2o\nc2W\n2m2H + + m2Ao\n2m2H + + m2H o c2W\n3m2H + + m2Ao\nc2W\n−\n+\nlog\nlog\nlog\n−\n2\n3μ2o\n2\n3μ2o\n3\n4μ2o\nc2W\n1\n3m2H + + m2H o\n2m2H + + m2H o + m2Ao\n−\n,\nlog\nlog\n3\n4μ2o\n3\n4μ2o\n\u0012\n\u0013\ns2\n1\n2m2H + + m2H o\nm2 + + m2 o\nm2 + + m2 o\ns2\nlog\n− W log H 2 A − W log H 2 H + s2W −\n2\n2μo\n2\n2μo\n4\n3μ2o\n\u0012\n\u0013\n2\n2\n2\n2\n2\n1\n2mH + + mAo c2W\nc2W\n3mH + + mH o\n3mH + + m2Ao\n2\nsW −\nlog\n+\n+\nlog\nlog\n4\n3μ2o\n3\n4μ2o\n3\n4μ2o\n1\nm2 + + m2H o + m2Ao\n2m2H + + m2H o + m2Ao\n1\n−\n,\nlog H\nlog\n2\n3μ2o\n3\n4μ2o\n1\n1\n1\n1\nm2 o\nm2 o\n2m2H o + m2H +\n2m2Ao + m2H +\n−\nlog H2 + log A2 − log\nlog\n4\nμo\n4\nμo\n4\n3μ2o\n4\n3μ2o\nc22W\n1\n2m2H + + m2Ao\n2m2H + + m2H o\nm2H o + 2m2Ao\nc22W\n−\n−\nlog\nlog\nlog\n4\n3μ2o\n4\n3μ2o\n4\n3μ2o\n23\n\n(A.28)\n\nc4W\n∆ǫ + gμ ν gσ λ g5 (mH + , mH o , mAo )\n3\n\n+ (gμ σ gν λ + gμ λ gν σ ) g6 (mH + , mH o , mAo )\n∆ΓμWν σWλ\n\n(A.27)\n\n(A.29)\n\n(A.30)\n\n\f−\n+\n−\ng6 =\n+\n+\n+\ng7 =\ng8 =\n+\n−\n\n2m2H o + m2Ao c22W\n3m2H + + m2H o c22W\n3m2H + + m2Ao\n1\n+\n+\nlog\nlog\nlog\n4\n3μ2o\n6\n4μ2o\n6\n4μ2o\n2\n2\n2\n2\n2\n2\n1\nm + + mH o + 2mAo 1\nm + + 2mH o + mAo\n+ log H\nlog H\n2\n6\n4μo\n6\n4μ2o\n2m2H + + m2H o + m2Ao\nc2W\n,\nlog\n3\n4μ2o\ns4W\nm2 + + m2H o + m2Ao\nm2 o + m2 + s4\nm2 o + m2 +\nlog H 2 H + W log A 2 H − s2W log H\n2\n2μo\n2\n2μo\n3μ2o\n2m2H + + m2Ao\n2m2H + + m2H o\nc2W\n2 c2W\n+\ns\nlog\nlog\ns2W\nW\n2\n3μ2o\n2\n3μ2o\nc22W\nc2W\n3m2H + + m2H o c22W\n3m2H + + m2Ao\n2m2H + + m2H o + m2Ao\n+\n−\nlog\nlog\nlog\n6\n4μ2o\n6\n4μ2o\n3\n4μ2o\n1\nm2 + + m2H o + 2m2Ao 1\nm2H + + 2m2H o + m2Ao\n+\n,\nlog H\nlog\n6\n4μ2o\n6\n4μ2o\n2\nm2H o + m2H +\nm2Ao + m2H +\n2\n− log\n− log\n3\n2μ2o\n3\n2μ2o\nm2 +\n1\n1\n2m2H o + m2H +\nm2 o\nm2 o\n− log H2 − log H2 − log A2 + log\nμo\n2\nμo\n2\nμo\n3μ2o\n2m2Ao + m2H +\n2m2H + + m2Ao\n2m2H + + m2H o\n+\nlog\n+\nlog\nlog\n3μ2o\n3μ2o\n3μ2o\n2\nm2 + + m2 o\nm2 + + m2 o\n2\n(A.31)\nlog H 2 H − log H 2 A .\n3\n2μo\n3\n2μo\n\nNotice that all these gk functions behave in the decoupling limit generically as,\nm2Ao\no\no\n+\ngk (mH , mH , mA ) = O log 2\nμ0\n\n!\n\n∆m2\n+O\nΣm2\n\n!\n\n(A.32)\n\nand the differences ∆m2 vanish in the present case of the heavy MSSM Higgs sector in the\nasymptotic limit.\n\nReferences\n[1] C. Caso et al., Eur. Phys. J. C3 (1998) 1–794.\n[2] Y. Okada, M. Yamaguchi, T. Yanagida, Prog. Theor. Phys. 85 (1991) 1–6.\n[3] H. E. Haber, R. Hempfling, Phys. Rev. Lett. 66 (1991) 1815–1818.\n[4] R. Barbieri, M. Frigeni, F. Caravaglios, Phys. Lett. B258 (1991) 167–170.\n[5] J. Ellis, G. Ridolfi, F. Zwirner, Phys. Lett. B262 (1991) 477–484.\n24\n\n\f[6] J. Ellis, G. Ridolfi, F. Zwirner, Phys. Lett. B257 (1991) 83–91.\n[7] R. Hempfling, A. H. Hoang, Phys. Lett. B331 (1994) 99-106, hep-ph/9401219.\n[8] J. A. Casas, J. R. Espinosa, M. Quirós, A. Riotto, Nucl. Phys. B436 (1995) 3–29,\nhep-ph/9407389.\n[9] H. E. Haber, R. Hempfling, A. H. Hoang, Z. Phys. C75 (1997) 539, hep-ph/9609331.\n[10] M. Quirós, J. R. Espinosa, hep-ph/9809269.\n[11] J. A. Casas, J. R. Espinosa, H. E. Haber, Nucl. Phys. B526 (1998) 3, hep-ph/9801365.\n[12] S. Heinemeyer, W. Hollik, G. Weiglein, Phys. Rev. D58 (1998) 091701, hep-ph/9803277.\n[13] S. Heinemeyer, W. Hollik, G. Weiglein, Phys. Lett. B440 (1998) 296-304, hep-ph/9807423.\n[14] J. R. Espinosa, R.-J. Zhang, hep-ph/9912236.\n[15] H. E. Haber, hep-ph/9305248. Proceedings of INFN Eloisatron Project: 23rd Workshop:\nThe Decay Properties of SUSY Particles, Erice, Italy, 28 Sep - 4 Oct 1992, p. 321-372.\n[16] M. Drees, K. Hagiwara, Phys. Rev. D42 (1990) 1709–1725.\n[17] P. Gosdzinsky, J. Solà, Phys. Lett. B254 (1991) 139–147.\n[18] P. H. Chankowski et al., Nucl. Phys. B417 (1994) 101–129.\n[19] D. Garcia, J. Solà, Mod. Phys. Lett. A9 (1994) 211–224.\n[20] A. Dabelstein, Z. Phys. C67 (1995) 495–512, hep-ph/9409375.\n[21] D. Garcia, R. A. Jiménez, J. Solà, Phys. Lett. B347 (1995) 309–320, hep-ph/9410310.\n[22] D. Garcia, R. A. Jiménez, J. Solà, Phys. Lett. B347 (1995) 321–331, hep-ph/9410311.\nErratum-ibid. B351, 602 (1995).\n[23] J. A. Coarasa, D. Garcia, J. Guasch, R. A. Jiménez, J. Solà, Eur. Phys. J. C2 (1998) 373,\nhep-ph/9607485.\n[24] A. Djouadi, V. Driesen, W. Hollik, J. I. Illana, Eur. Phys. J. C1 (1998) 149–162,\nhep-ph/9612362.\n[25] M. Carena, M. Quirós, C. E. M. Wagner, Nucl. Phys. B461 (1996) 407–436,\nhep-ph/9508343.\n[26] P. Chankowski, S. Pokorski, J. Rosiek, Nucl. Phys. B423 (1994) 437–496, hep-ph/9303309.\n[27] S. Alam, K. Hagiwara, S. Kanemura, R. Szalapski, Y. Umeda, hep-ph/0002066.\n[28] T. Inami, C. S. Lim, A. Yamada, Mod. Phys. Lett. A7 (1992) 2789–2798.\n[29] H. E. Haber. SCIPP-92-31, in Perspectives in Physics, World Scientific, (1992), p.79-125.\n25\n\n\f[30] J. A. Coarasa, R. A. Jiménez, J. Solà, Phys. Lett. B389 (1996) 312–320, hep-ph/9511402.\n[31] M. Carena, S. Mrenna, C. E. M. Wagner, hep-ph/9907422.\n[32] T. Appelquist, J. Carazzone, Phys. Rev. D11 (1975) 2856.\n[33] A. Dobado, M. J. Herrero, S. Peñaranda, Eur. Phys. J. C7 (1999) 313, hep-ph/9710313.\n[34] A. Dobado, M. J. Herrero, S. Peñaranda, Eur. Phys. J. C12 (2000) 673, hep-ph/9903211.\n[35] H. Haber, M. Herrero, H. Logan, S. Peñaranda, S. Rigolin, D. Temes, FTUAM 99-27,\nhep-ph/0007006.\n[36] M. B. Einhorn, D. R. T. Jones, M. Veltman, Nucl. Phys. B191 (1981) 146.\n[37] T. Appelquist, C. Bernard, Phys. Rev. D22 (1980) 200.\n[38] A. C. Longhitano, Phys. Rev. D22 (1980) 1166.\n[39] A. C. Longhitano, Nucl. Phys. B188 (1981) 118.\n[40] M. J. Herrero, E. Ruiz Morales, Nucl. Phys. B418 (1994) 431–455, hep-ph/9308276.\n[41] M. J. Herrero, E. Ruiz Morales, Nucl. Phys. B437 (1995) 319–355, hep-ph/9411207.\n[42] S. Dittmaier, C. Grosse-Knetter, Phys. Rev. D52 (1995) 7276–7293, hep-ph/9501285.\n[43] D. Espriu, J. Matias, Phys. Lett. B341 (1995) 332–341, hep-ph/9407292.\n[44] M. Bohm, H. Spiesberger, W. Hollik, Fortsch. Phys. 34 (1986) 687.\n[45] J. F. Gunion, H. E. Haber, Nucl. Phys. B272 (1986) 1. Erratum ibid. B402 (1993) 567-569.\n[46] G. 't Hooft, M. Veltman, Nucl. Phys. B153 (1979) 365–401.\n[47] G. Passarino, M. Veltman, Nucl. Phys. B160 (1979) 151.\n[48] G. Giavarini, C. P. Martin, F. Ruiz-Ruiz, Nucl. Phys. B381 (1992) 222–280,\nhep-th/9206007.\n[49] W. Hollik, Fortschr. Phys. 38 (1990) 165–260.\n[50] S. Peñaranda Rivas, Desacoplamiento de Partı́culas Supersimétricas. PhD thesis,\nUniversidad Autónoma de Madrid, Madrid (Spain), January, 2000.\n[51] A. Denner, Fortschr. Phys. 41 (1993) 307–420.\n[52] S. Dittmaier, C. Grosse-Knetter, Nucl. Phys. B459 (1996) 497–536, hep-ph/9505266.\n[53] D. Espriu, M. J. Herrero, Nucl. Phys. B373 (1992) 117–168.\n\n26\n\n\f"}