{"id": "http://arxiv.org/abs/math/0405196v1", "guidislink": true, "updated": "2004-05-11T17:23:04Z", "updated_parsed": [2004, 5, 11, 17, 23, 4, 1, 132, 0], "published": "2004-05-11T17:23:04Z", "published_parsed": [2004, 5, 11, 17, 23, 4, 1, 132, 0], "title": "Rational functions with real critical points and the B. and M. Shapiro\n  conjecture in real enumerative geometry", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=math%2F0405190%2Cmath%2F0405483%2Cmath%2F0405170%2Cmath%2F0405456%2Cmath%2F0405498%2Cmath%2F0405576%2Cmath%2F0405489%2Cmath%2F0405192%2Cmath%2F0405038%2Cmath%2F0405257%2Cmath%2F0405034%2Cmath%2F0405158%2Cmath%2F0405073%2Cmath%2F0405105%2Cmath%2F0405196%2Cmath%2F0405302%2Cmath%2F0405538%2Cmath%2F0405420%2Cmath%2F0405047%2Cmath%2F0405494%2Cmath%2F0405236%2Cmath%2F0405361%2Cmath%2F0405219%2Cmath%2F0405463%2Cmath%2F0405082%2Cmath%2F0405537%2Cmath%2F0405364%2Cmath%2F0405473%2Cmath%2F0405485%2Cmath%2F0405598%2Cmath%2F0405532%2Cmath%2F0405495%2Cmath%2F0405535%2Cmath%2F0405541%2Cmath%2F0405521%2Cmath%2F0405403%2Cmath%2F0405480%2Cmath%2F0405414%2Cmath%2F0405130%2Cmath%2F0405174%2Cmath%2F0405564%2Cmath%2F0405129%2Cmath%2F0405516%2Cmath%2F0405505%2Cmath%2F0405095%2Cmath%2F0405202%2Cmath%2F0405026%2Cmath%2F0405321%2Cmath%2F0405178%2Cmath%2F0405566%2Cmath%2F0405450%2Cmath%2F0405408%2Cmath%2F0405131%2Cmath%2F0405066%2Cmath%2F0405478%2Cmath%2F0405217%2Cmath%2F0405126%2Cmath%2F0405048%2Cmath%2F0405444%2Cmath%2F0405592%2Cmath%2F0405590%2Cmath%2F0405226%2Cmath%2F0405008%2Cmath%2F0405591%2Cmath%2F0405506%2Cmath%2F0405335%2Cmath%2F0405448%2Cmath%2F0405114%2Cmath%2F0405127%2Cmath%2F0405542%2Cmath%2F0405260%2Cmath%2F0405355%2Cmath%2F0405304%2Cmath%2F0405051%2Cmath%2F0405003%2Cmath%2F0405481%2Cmath%2F0405214%2Cmath%2F0405554%2Cmath%2F0405461%2Cmath%2F0405318%2Cmath%2F0405337%2Cmath%2F0405437%2Cmath%2F0405139%2Cmath%2F0405297%2Cmath%2F0405136%2Cmath%2F0405185%2Cmath%2F0405227%2Cmath%2F0405017%2Cmath%2F0405503%2Cmath%2F0405291%2Cmath%2F0405497%2Cmath%2F0405148%2Cmath%2F0405283%2Cmath%2F0405176%2Cmath%2F0405360%2Cmath%2F0405559%2Cmath%2F0405033%2Cmath%2F0405112%2Cmath%2F0405241%2Cmath%2F0405488%2Cmath%2F0405484&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Rational functions with real critical points and the B. and M. Shapiro\n  conjecture in real enumerative geometry"}, "summary": "Suppose that 2d-2 tangent lines to the rational normal curve z\\mapsto (1 : z\n: ... : z^d) in d-dimensional complex projective space are given. It was known\nthat the number of codimension 2 subspaces intersecting all these lines is\nalways finite; for a generic configuration it is equal to the d^{th} Catalan\nnumber. We prove that for real tangent lines, all these codimension 2 subspaces\nare also real, thus confirming a special case of a general conjecture of B. and\nM. Shapiro. This is equivalent to the following result:\n  If all critical points of a rational function lie on a circle in the Riemann\nsphere (for example on the real line), then the function maps this circle into\na circle.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=math%2F0405190%2Cmath%2F0405483%2Cmath%2F0405170%2Cmath%2F0405456%2Cmath%2F0405498%2Cmath%2F0405576%2Cmath%2F0405489%2Cmath%2F0405192%2Cmath%2F0405038%2Cmath%2F0405257%2Cmath%2F0405034%2Cmath%2F0405158%2Cmath%2F0405073%2Cmath%2F0405105%2Cmath%2F0405196%2Cmath%2F0405302%2Cmath%2F0405538%2Cmath%2F0405420%2Cmath%2F0405047%2Cmath%2F0405494%2Cmath%2F0405236%2Cmath%2F0405361%2Cmath%2F0405219%2Cmath%2F0405463%2Cmath%2F0405082%2Cmath%2F0405537%2Cmath%2F0405364%2Cmath%2F0405473%2Cmath%2F0405485%2Cmath%2F0405598%2Cmath%2F0405532%2Cmath%2F0405495%2Cmath%2F0405535%2Cmath%2F0405541%2Cmath%2F0405521%2Cmath%2F0405403%2Cmath%2F0405480%2Cmath%2F0405414%2Cmath%2F0405130%2Cmath%2F0405174%2Cmath%2F0405564%2Cmath%2F0405129%2Cmath%2F0405516%2Cmath%2F0405505%2Cmath%2F0405095%2Cmath%2F0405202%2Cmath%2F0405026%2Cmath%2F0405321%2Cmath%2F0405178%2Cmath%2F0405566%2Cmath%2F0405450%2Cmath%2F0405408%2Cmath%2F0405131%2Cmath%2F0405066%2Cmath%2F0405478%2Cmath%2F0405217%2Cmath%2F0405126%2Cmath%2F0405048%2Cmath%2F0405444%2Cmath%2F0405592%2Cmath%2F0405590%2Cmath%2F0405226%2Cmath%2F0405008%2Cmath%2F0405591%2Cmath%2F0405506%2Cmath%2F0405335%2Cmath%2F0405448%2Cmath%2F0405114%2Cmath%2F0405127%2Cmath%2F0405542%2Cmath%2F0405260%2Cmath%2F0405355%2Cmath%2F0405304%2Cmath%2F0405051%2Cmath%2F0405003%2Cmath%2F0405481%2Cmath%2F0405214%2Cmath%2F0405554%2Cmath%2F0405461%2Cmath%2F0405318%2Cmath%2F0405337%2Cmath%2F0405437%2Cmath%2F0405139%2Cmath%2F0405297%2Cmath%2F0405136%2Cmath%2F0405185%2Cmath%2F0405227%2Cmath%2F0405017%2Cmath%2F0405503%2Cmath%2F0405291%2Cmath%2F0405497%2Cmath%2F0405148%2Cmath%2F0405283%2Cmath%2F0405176%2Cmath%2F0405360%2Cmath%2F0405559%2Cmath%2F0405033%2Cmath%2F0405112%2Cmath%2F0405241%2Cmath%2F0405488%2Cmath%2F0405484&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Suppose that 2d-2 tangent lines to the rational normal curve z\\mapsto (1 : z\n: ... : z^d) in d-dimensional complex projective space are given. It was known\nthat the number of codimension 2 subspaces intersecting all these lines is\nalways finite; for a generic configuration it is equal to the d^{th} Catalan\nnumber. We prove that for real tangent lines, all these codimension 2 subspaces\nare also real, thus confirming a special case of a general conjecture of B. and\nM. Shapiro. This is equivalent to the following result:\n  If all critical points of a rational function lie on a circle in the Riemann\nsphere (for example on the real line), then the function maps this circle into\na circle."}, "authors": ["A. Eremenko", "A. Gabrielov"], "author_detail": {"name": "A. Gabrielov"}, "author": "A. Gabrielov", "arxiv_comment": "25 pages, published version", "links": [{"href": "http://arxiv.org/abs/math/0405196v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/math/0405196v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.AG", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.AG", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.CV", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/math/0405196v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/math/0405196v1", "journal_reference": "Ann. of Math. (2) 155 (2002), no. 1, 105--129", "doi": null, "fulltext": "arXiv:math/0405196v1 [math.AG] 11 May 2004\n\nAnnals of Mathematics, 155 (2002), 105–129\n\nRational functions with real critical points\nand the B. and M. Shapiro conjecture\nin real enumerative geometry\nBy A. Eremenko and A. Gabrielov*\n\nAbstract\nSuppose that 2d − 2 tangent lines to the rational normal curve z 7→\n(1 : z : . . . : z d ) in d-dimensional complex projective space are given. It\nwas known that the number of codimension 2 subspaces intersecting all these\nlines is always finite; for a generic configuration it is equal to the dth Catalan\nnumber. We prove that for real tangent lines, all these codimension 2 subspaces are also real, thus confirming a special case of a general conjecture of\nB. and M. Shapiro. This is equivalent to the following result:\nIf all critical points of a rational function lie on a circle in the Riemann\nsphere (for example, on the real line), then the function maps this circle into\na circle.\n\n1. Introduction\nTwo rational functions f1 and f2 will be called equivalent if f1 = l ◦ f2 ,\nwhere l is a fractional-linear transformation. Equivalent rational functions\nhave the same critical sets.\nTheorem 1. If all critical points of a rational function f are real, then f\nis equivalent to a real rational function.\nLisa Goldberg [11] addressed the following question: how many equivalence classes of rational functions of degree d with a given critical set of 2d − 2\npoints may exist? She reduced this to the following problem of enumerative\ngeometry:\nProblem P. Given 2d − 2 lines in general position in projective space\nCPd , how many projective subspaces of codimension 2 intersect all of them?\n∗ The first author was supported by NSF grant DMS-0100512 and by Bar Ilan University. The\nsecond author was supported by NSF grant DMS-0070666 and by MSRI.\n\n\f106\n\nA. EREMENKO AND A. GABRIELOV\n\nTo explain this reduction, to each rational function\nf (z) =\n\na0 + . . . + ad z d\nb0 + . . . + bd z d\n\nof degree d, we associate a projective subspace Hf ⊂ CP d defined by the\nfollowing system of two equations in homogeneous coordinates\na0 x0 + . . . + ad xd = 0,\nb0 x0 + . . . + bd xd = 0.\nThis gives a bijective correspondence between the set of equivalence classes\nof rational functions of degree d and the set of subspaces of CP d of codimension 2 which do not intersect the image of the rational normal curve E(z) =\n(1 : z : . . . : z d ) ∈ CP d , z ∈ CP 1 . By straightforward computation one can\nverify that z0 is a critical point of f if and only if the tangent line at E(z0 ) to\nthe rational normal curve intersects the subspace Hf .\nThe answer to Problem P, going back to Schubert [17] (see also [14, 15]),\nis\n1\nud =\nd\n\n(1)\n\n2d − 2\nd−1\n\n!\n\n,\n\nthe dth Catalan number.\n\nThus the result is\nTheorem A (Goldberg [11]). The number of equivalence classes of rational functions of degree d with given 2d − 2 critical points is at most ud .\nWe prove\nTheorem 2. For given 2d − 2 distinct real points, there exist at least ud\nclasses of real rational functions of degree d with these critical points.\nTheorems A and 2 imply Theorem 1.\nIn general, even if the lines in Problem P are real, the subspaces of codimension 2 might not be real [14]. Fulton asked the following general question\n(see [8, p. 55]): how many solutions of real equations can be real, particularly\nfor enumerative problems? We refer to a recent survey [21] of results related to\nthis question. A specific conjecture for the Problem P was made by Boris and\nMichael Shapiro (see, for example, [20]): if the lines in question are tangent to\nthe rational normal curve at real points, then all ud solutions of the problem\nare real. Our Theorem 2 implies that this conjecture is true.\nTo reformulate Theorem 1, we write a rational function as a ratio of polynomials without a common factor, f = f1 /f0 , and suppose for simplicity that\n∞ is not a critical point of f . Then critical points of f coincide with zeros of\nthe Wronski determinant W (f0 , f1 ) = f0 f1′ − f0′ f1 , and Theorem 1 is equivalent\nto the following: if the Wronskian of two polynomials has only real zeros, then\n\n\fRATIONAL FUNCTIONS WITH REAL CRITICAL POINTS\n\n107\n\nthese polynomials can be made real by a linear transformation with constant\ncoefficients. A more general conjecture of B. and M. Shapiro states that this is\ntrue for any number of polynomials. It is not enough to require that the Wronskian has real coefficients. Indeed, if f1 (z) = z 3 + 3iz 2 and f0 (z) = z − i, then\nW (f0 , f1 ) = 2z 3 + 6z has real coefficients, but no nontrivial linear combination\nof f0 and f1 is a real polynomial.\nA general discussion of the B. and M. Shapiro conjectures, with experimental evidence and bibliography, is contained in [19], [20]. For the related\nproblem of pole assignment in the theory of automatic control we refer to\n[6], [7].\nAs a corollary from his main result in [18], Sottile proved that there exists\nan open (in the usual topology) set X ⊂ R2d−2 , such that for x ∈ X there exist\nud classes of real rational functions of degree d, whose critical set is given by\nx. Theorem 2 was proved by Sottile for d = 3, and tested, using computers,\nfor d ≤ 9. The computation for d = 9 (u9 = 1, 430) is due to Verschelde [23].\nIt is interesting that our proof of Theorem 1 is based on the fact that\ntwo different enumerative problems have the same sequence of integers as their\nsolution. These two problems are Problem P and the one in Lemma 1 below.\nWe prove Theorem 2 in Sections 2–6 and derive Theorem 1 in Section 7.\nThe scheme of our proof of Theorem 2 is following. We consider the unit\ncircle T instead of the real line. Let R be the set of rational functions of\ndegree d, mapping T into itself, having 2d − 2 distinct critical points in T, and\nbeing properly normalized. For f ∈ R we introduce a \"net\" γ(f ) = f −1 (T),\nconsidered modulo symmetric (with respect to T) normalized homeomorphisms\nof the Riemann sphere, preserving orientation. A net partitions the Riemann\nsphere into simply-connected regions; each of these regions is mapped by f\nhomeomorphically onto a component of C\\T. Equivalence classes of nets are\ncombinatorial objects, describing topological properties of rational functions\nf ∈ R. To describe a function f ∈ R completely, we need one more piece\nof data, which we call a labeling. It is a function on the set of edges of a\nnet, which assigns to each edge the length of its image. We give a precise\ndescription of all nets γ (modulo equivalence) and labelings which may occur.\nIt is important that, for a fixed γ, the space of possible labelings has simple\ntopological structure: it is a convex polytope. To recover f from its labeled\nnet, we first construct a ramified covering g : C → C, which maps each edge of\nγ homeomorphically onto an arc of the unit circle, whose length is specified by\nthe label of this edge. Furthermore g maps each component of the complement\nC\\γ homeomorphically onto an appropriate component of C\\T. Once such\nramified covering g is constructed, the Uniformization theorem implies the\nexistence of a homeomorphism φ : C → C, such that f = g ◦ φ−1 .\nThis construction leads to a parametrization of the set R by equivalence\nclasses of labeled nets. Similar parametrizations for polynomials and trigono-\n\n\f108\n\nA. EREMENKO AND A. GABRIELOV\n\nmetric polynomials were studied by Arnold in [2], [3], and for meromorphic\nfunctions on arbitrary Riemann surfaces by Vinberg [24], who used the nets.\nThe dual graph of a net of a meromorphic function is known in classical function theory as a \"line complex,\" or a Speiser graph [10], [25]. It is essentially\nour tree S, which will be described in Section 2.\nNonequivalent nets correspond to nonequivalent rational functions. For a\nfixed net γ, each labeling defines a rational function of the class R. Taking\nthe critical set of this rational function, we obtain a map Φ from the space of\nlabelings of γ to the space of critical sets on the unit circle. We prove that Φ\nis surjective. So for a given critical set, each γ gives a rational function of our\nclass R, and it remains to count all possible classes of nets γ. It turns out that\nthere are exactly ud of them (Lemma 1).\nThe main difficulty is the proof of surjectivity of Φ. This is achieved by\na version of the \"continuity method\" going back to Poincaré and Koebe (see,\nfor example, [12, Ch. V, §6]), but we have to use different tools from topology.\nWe extend Φ to a map between closed polytopes and show that the extended\nmap is continuous (Sections 3 and 4). This is done using a normal families\nargument, Lemma 4. An analysis of the boundary behavior of Φ in Section 5\npermits us to prove surjectivity using a topological argument in Section 6.\nWe thank M. Bonk, F. Nazarov and B. Shapiro for stimulating discussions. Bonk suggested the subtle normalization N5 and (8), which makes our\nargument in Section 4 work. We also thank the referee for valuable remarks.\nWe prove Theorem 1 only for d ≥ 3, because it is trivial for d = 2, and\nbecause our proof would require a modification in this case.\nWe fix an integer d ≥ 3. The map s : C → C, s(z) = 1/z̄ will be\ncalled the symmetry. A map will be called symmetric if it commutes with the\nsymmetry. A set will be called symmetric if the symmetry leaves it invariant.\nAll homeomorphisms and ramified coverings of the Riemann sphere C = CP 1 ,\nexcept the involutions like s, are assumed to preserve orientation. For a region\nD we denote by ∂D its oriented boundary (so that the region is on the left).\nThe unit circle T is always oriented anticlockwise, so T = ∂ U, where U is\nthe unit disc. The words \"distance\" and \"diameter\" refer to the spherical\nRiemannian metric on the Riemann sphere. It is obtained from the standard\nembedding of C as the unit sphere in R3 .\n\n2. Nets, labelings and critical sequences\nA cellular decomposition of a set X ⊂ C is a finite partition of X into sets,\ncalled cells, each of them homeomorphic to an open unit disc Uk ⊂ Rk , k =\n0, 1, 2; (by definition, U0 = {one point}), and has closure homeomorphic to the\nk\nclosed disc U . The cells are called vertices, edges and faces, according to their\n\n\fRATIONAL FUNCTIONS WITH REAL CRITICAL POINTS\n\n109\n\ndimension. The degree of a vertex is the number of edges to whose boundaries\nthis vertex belongs. A net γ ⊂ C is the union of edges and vertices of some\ncellular decomposition of C, which satisfies conditions N1–N5 below.\nN1. γ is symmetric, that is s(γ) = γ.\nN2. T ⊂ γ.\nN3. There are 2d − 2 vertices, all belong to T and have degree 4.\nN4. The point 1 ∈ T is a vertex.\nA cellular decomposition which satisfies N1–N4 is completely determined\nby its net γ, so we permit ourselves to speak of vertices, edges and faces of a\nnet. Because of N3, each face G has an even number of boundary vertices. For\nevery γ satisfying N1–N4 we choose certain distinguished elements as follows.\nLet v0 = 1, and v1 be the next vertex anticlockwise on T. There is a unique face\nG0 in the unit disc, whose boundary contains at least four vertices, v0 and v1\namong them. Let v−1 be the vertex preceding v0 on ∂G0 . So when tracing ∂G0\naccording to its orientation, we consecutively encounter v−1 , v0 , v1 in this order.\nWe also introduce two edges on the boundary of G0 : e1 = [v0 , v1 ] and e−1 =\n[v−1 , v0 ]. One of these two edges, e′ belongs to T, the other, e′′ does not. Thus\nwe have double notation for these two edges. For every γ satisfying N1–N4\nthere is a unique choice of the distinguished elements G0 , v−1 , v0 , v1 , e−1 , e1 , e′ ,\nand e′′ (see Figure 1). The vertices of γ will be enumerated as v1 , . . . , v2d−2 ,\nanticlockwise on T, so that v2d−2 = v0 , and v−1 = vN , for some N = N (γ) ∈\n[3, 2d − 3]. Our last assumption about nets is the normalization condition\nN5. v−1 = e−2πi/3 ,\n\nv0 = 1,\n\nand\n\nv1 = e2πi/3 ,\n\nthe cubic roots of 1.\n\n(The particular choice of these three points on T is irrelevant). Two nets γ1 and\nγ2 are called equivalent if there exists a symmetric homeomorphism h of the\nsphere C, such that h(γ1 ) = γ2 , and h leaves each cubic root of 1 fixed. Such\nh induces a bijective correspondence between the cells of the corresponding\ncellular decompositions, so we can speak of a vertex, an edge or a face of a\nclass of nets. Each distinguished element described above is mapped by h onto\na distinguished element with the same name. We denote by [γ] the equivalence\nclass of a net γ.\nFor a net γ we denote by V, E and Q the sets of its vertices, edges and\nfaces, respectively. Euler's formula implies |Q| = 2d and |E| = 4d − 4. We\ndenote by QU ⊂ Q the subset of faces which belong to U, and by ET the subset\nof edges, which belong to T.\n\n\f110\n\nA. EREMENKO AND A. GABRIELOV\n\nFigure 1 shows all nets for d = 4 with distinguished faces and vertices.\nFor aesthetic reasons we ignored N5 in this picture.\nv1\nG0\nv -1\n\ne′′\n\nv1\n\nv1\n\ne ′′\n\ne ′′\n\ne′′\n\nG0\n\nv0\n\ne′′\n\ne ′′\n\nv -1\n\nv -1\nv1\n\nv1\ne ′′\n\nG0\n\nv0\n\ne′′\n\nG0\n\nv0\n\ne′′\n\nv-1\n\nv0\n\nG0\n\nv0\n\ne ′′\n\nv -1\n\nFigure 1. All nets for d = 4. Only the parts in U are shown.\nLemma 1. There exist exactly ud classes of nets with 2d − 2 vertices,\nwhere ud is the Catalan number (1).\nThis can be found in [22, Exercise 6.19 n]. This exercise contains 66\ncombinatorial problems with the Catalan numbers as the answer (see also\nExersise 6.25 for algebraic interpretations of these numbers). Stanley uses\nnotation Cn = un+1 .\nTo each net γ corresponds the dual graph S of the cellular decomposition\nof U defined by γ. More precisely, each vertex q = qG of S corresponds to a\nface G = Gq ∈ QU , and two vertices of S are connected by an edge τ = τe in\nS if the two corresponding faces in QU have a common edge e = eτ in γ ∩ U.\nLet Ŝ be the graph obtained by the following extension of S: for every\nedge e ∈ ET , a vertex qe and an edge τe connecting qe with qG are added to S,\nwhere G is the face in QU with e ∈ ∂G.\nIt is easy to see that S and Ŝ are trees. We designate q0 = qG0 to be the\nroot of these trees. Notice that the edges of Ŝ are in bijective correspondence\nwith edges of γ in U, and the edges of S correspond to the edges of γ in U.\nThere is a natural partial order on the vertices of a rooted tree, so that the\nroot is the unique minimal element. Thus the tree S defines a partial order on\nfaces in QU :\n(2)\n\nG′ < G if the path in S from q0 to qG passes through qG′ .\n\n\fRATIONAL FUNCTIONS WITH REAL CRITICAL POINTS\n\n111\n\nWe can also order the set of faces in QU into a sequence G0 , . . . , Gd−1 so that,\nfor every k ∈ [1, d − 1], the face Gk has exactly one common boundary edge\nwith the union of the faces G0 , . . . , Gk−1 . Such ordering is always compatible\nwith the partial order (2):\n(3)\n\nfor every\n\nm, n ∈ [0, d − 1]\n\nGn < Gm\n\nimplies\n\nn < m.\n\nWe will use repeatedly the possibility of such ordering.\nFor a net we define a function σ : Q → {1, −1}, called parity. We put\nσ(G0 ) = 1, for the distinguished face, and then σ(G)σ(G′ ) = −1 if the faces G\nand G′ have a common edge on their boundaries. Such parity function exists\nfor every cellular decomposition whose vertices have even degree. With our\nnormalization σ(G0 ) = 1, the parity function is unique.\nA labeling of a net is a nonnegative function on the set of edges, p : E → R,\nsatisfying the following conditions:\n(4)\n\np(s(e)) = p(e)\n\nfor every\n\ne ∈ E,\n\nwhere s is the symmetry with respect to T,\n(5)\n\nX\n\np(e) = 2π\n\nfor every\n\nG ∈ QU ,\n\ne⊂∂G\n\nand\n(6)\n\np(e1 ) = p(e−1 ) = 2π/3.\n\nA pair (γ, p) is called a labeled net. Two labeled nets (γ1 , p1 ) and (γ2 , p2 ) are\nequivalent if there exists a symmetric homeomorphism h : C → C, fixing the\nthree cubic roots of 1, and having the properties h(γ1 ) = γ2 , and p2 (h(e)) =\np1 (e) for every edge e of γ1 .\nA labeling p is called degenerate if p(e) = 0 for some edges e ∈ E, otherwise\nit is called nondegenerate. The space of all labelings is a closed convex polytope\nLγ in the affine subspace A of R4d−4 defined by (4), (5) and (6). Its interior\nLγ with respect to A, the set of nondegenerate labelings, is homeomorphic to\na cell of dimension 2d − 5.\nThe statement about dimension will not be used, but it can be verified in\nthe following way. First, using the equations (4), we eliminate the variables\np(e) for all edges in C\\U. The number of remaining variables is 3d − 3. Each\nof the equations (5) corresponds to a face G ∈ QU . This face G has at least\none boundary edge on T, which does not belong to the boundaries of other\nfaces in QU . Thus each equation in (5) contains a variable which does not\nshow in other equations. So the codimension of the affine subspace defined by\nall equations (5) is d. Equations (6) increase the codimension to d + 2. So the\ndimension of Lγ is 2d − 5.\n\n\f112\n\nA. EREMENKO AND A. GABRIELOV\n\nA critical sequence corresponding to γ is a map c : V → T, which\nleaves v0 , v1 and vN = v−1 fixed, and preserves the (nonstrict) cyclic order. We describe critical sequences by nonnegative functions l : ET → R,\nFor k = 1, . . . , 2d − 2, the value l([vk−1 , vk ]) is defined as the length of the\narc [c(vk−1 ), c(vk )], of T, described anticlockwise from c(vk−1 ) to c(vk ). This\nfunction l has the following properties:\n(7)\n\nl([v0 , v1 ]) =\n\nN\nX\n\nl([vk−1 , vk ]) =\n\nk=2\n\n2d−2\nX\n\nl([vk−1 , vk ]) =\n\nk=N +1\n\n2π\n,\n3\n\nand\n\nl ≥ 0,\n\nwhere N = N (γ). Thus we identify the set of all critical sequences with the\nconvex polytope Σγ , described by (7). This polytope is a product of two\nsimplexes of dimensions N − 2 and 2d − N − 3, so its dimension is 2d − 5.\nThe interior Σγ of our polytope consists of critical sequences with l > 0. We\ncall such critical sequences nondegenerate, and the critical sequences in Σγ \\Σγ\ndegenerate.\nWe denote by R∗ the class of all rational functions of degree at most d,\nwhich preserve the unit circle, whose critical points all belong to the unit circle,\nand which satisfy the normalization condition\n(8)\n\nf (z) = z,\n\nf ′ (z) = 0,\n\nfor\n\nz ∈ {1, e2πi/3 , e−2πi/3 }.\n\nThis normalization implies that two different functions of the class R∗ are never\nequivalent.\nFor each class of nets [γ], we consider a subclass Rγ ⊂ R∗ defined by the\nfollowing condition:\n(9)\n\nf −1 (T) ∈ [γ].\n\nIt follows from (9) that Rγ consists of rational functions of degree d with simple\ncritical points, which coincide with the vertices of f −1 (T). Furthermore, (8)\nand (9) imply that f maps the distinguished face G0 of the net f −1 (T) onto\nthe unit disc.\nIt will follow from the results of Section 3 that Rγ 6= ∅ for every γ.\n3. Construction of a map\n(10)\n\nFγ : Lγ → R∗ × Σγ .\n\nIn this section, for each net γ, we construct a map (10), where Lγ , R∗ and Σγ\nwere introduced in Section 2, with the following properties:\n(11)\n\nFγ (Lγ ) ⊂ Rγ × Σγ .\n\nIf p is a nondegenerate labeling, and (f, c) = Fγ (p), then c is the sequence of\n\n\fRATIONAL FUNCTIONS WITH REAL CRITICAL POINTS\n\n113\n\ncritical points of f . An additional property, related to the boundary behavior\nof Fγ , is stated in Proposition 1 below. In Section 4 we will prove that the\nsecond component Φγ of Fγ is continuous, and in Section 6 that Φγ is surjective.\nTo construct our map Fγ , we fix γ and a labeling p ∈ Lγ . We introduce\nthe following notation. Let Z be the union of edges e with p(e) = 0, and D\nthe component of C\\Z, containing G0 . We claim that\n(12)\n\n0 < p(e) < 2π\n\nfor every\n\ne ⊂ D.\n\nThe left inequality follows immediately from the definition of D. To prove the\nright inequality, we suppose without loss of generality that e ⊂ U, and use the\ntree S introduced in Section 2. Let G ⊂ D be a face in QU whose boundary\ncontains e. Then there is a path in S from the root q0 to qG . It is easy to see\nthat all Gq for q in this path belong to D. The labels of all edges along this\npath are positive, because the whole path belongs to D. It follows from (5)\nthat the labels of all edges of this path are less than 2π. Thus no edge in ∂G\ncan have label 2π.\nWe put B = C\\D and introduce an equivalence relation in C : x ∼ y if x\nand y belong to the same component of B. Let Y = C/ ∼ be the factor space,\nand w : C → Y the projection map.\nSince D is connected, every component of B is contractible, hence Y is\na topological sphere, so we can identify it with the Riemann sphere. The\nsymmetry s : C → C is an involution which leaves every point of T fixed. Since\nevery component of B contains a vertex, it intersects T. It follows that each\ncomponent of B is symmetric. So Y also has an involution, such that w splits\nthe involutions. This means that the identification of Y with C can be made\nin such a way that\n(13)\n\nw:C→Y ∼\n= C,\n\nw(x) = w(y)\n\nif and only if\n\nx∼y\n\nis symmetric. In particular w(T) = T. Furthermore, in view of (6), no component of B can contain two cubic roots of unity, so we can arrange that\nw(v) = v, for each cubic root v of 1. The cellular decomposition of C defined\nby γ generates via w a cellular decomposition X = X(p) of Y , so that the\ncells of X are w(C), where C are the cells of the original decomposition. If the\nlabeling p is nondegenerate, then w is a homeomorphism.\nWe are going to construct a continuous map g∗ : D → S ∼\n= C, where S\nis another copy of the Riemann sphere. As a first step of our construction of\ng∗ , we define a continuous map g̃ : γ ∩ D → T ⊂ S. To do this, we orient the\nedges of γ in the following way. Each edge e ∈ E belongs to the boundaries of\nexactly two faces; let G be that one with σ(G) = 1. Then e ⊂ ∂G by definition\ninherits positive orientation of ∂G.\n\n\f114\n\nA. EREMENKO AND A. GABRIELOV\n\nWe are going to define g̃, so that the following condition be satisfied for\nevery e ⊂ D:\nif p(e) > 0, then g̃ maps e onto an arc of T of length p(e),\n(14)\n\nhomeomorphically, respecting orientation,\nand if p(e) = 0, then g̃ maps e into a point.\n\nIn particular the edges in ∂D are mapped into points, but closures of all edges\nin D are mapped homeomorphically onto their images. This follows from (12).\nFirst we define g̃ on ∂G0 , so that condition (14) is satisfied, and g̃(v0 ) = 1.\nCondition (5) with G = G0 ensures that there is a unique way to define such\ncontinuous g̃ on ∂G0 . Furthermore, (6) implies that g̃ fixes all three cubic roots\nof 1.\nNow we order all faces of γ in D ∩ U into a sequence (G0 , G1 , . . . , Gm )\nso that for every k = 1, . . . , m the face Gk has exactly one common boundary\nedge e∗ with\n(15)\n\nk−1\n[\n\n∂Gj .\n\nj=0\n\nThe existence of such ordering was explained in Section 2, before (3).\nSuppose that g̃ has been already defined on the edges in (15). In particular,\nit is defined on the edge e∗ ∈ ∂Gk . Condition (5) with G = Gk allows us to\nextend g̃ to all other edges in ∂Gk , so that (14) is satisfied.\nAfter g̃ is defined for all edges in U, we extend it to the edges in\nD\\U by symmetry. This construction defines a symmetric continuous map\ng̃ : γ ∩ D → T, which sends every component of ∂D to a point.\nNotice that for every face G, the map g̃ : ∂G → T has degree ±1, and is\nmonotone; that is g̃|∂G preserves or reverses the nonstrict cyclic order. As a\nnext step, for each face G ⊂ D, we extend g̃ to a continuous map g∗ : G →\nU ⊂ S, if σ(G) = 1, or g∗ : G → S\\U, if σ(G) = −1, so that the restriction on\nG is a homeomorphism onto the image. This can be done for every continuous\nmonotone map ∂G → T of degree ±1.\nIt is clear, that this extension of g̃ into the interior of components G ∈ Q,\nG ⊂ D, can be made symmetrically; that is\n(16)\n\ng∗ ◦ s = s ◦ g∗ .\n\nFinally we extend g∗ to a continuous map C → S so that it is constant on\nevery component of the set B = C\\D. Then g∗ (x) = g∗ (y) whenever x ∼ y,\nthe equivalence relation ∼ in (13). It follows that g∗ factors as g∗ = g ◦ w,\nwhere w is the continuous map in (13). Here g is a continuous map Y → S.\n\n\fRATIONAL FUNCTIONS WITH REAL CRITICAL POINTS\n\n115\n\nIf C is a cell of the cellular decomposition defined by γ, then w and g∗\nmap C in the same way: either homeomorphically or to a point. It follows that\ng maps every closed cell of the form w(C) homeomorphically onto the image.\nFurthermore, the cells w(C) make a cellular decomposition X of Y , so g is a\nramified covering. It can be ramified only at the vertices of X. If the labeling\np is nondegenerate, that is w in (13) is a homeomorphism, all vertices of X\nhave order 4, and g is ramified exactly at these vertices, having local degree 2\nat each vertex.\nThere exists a unique conformal structure on Y , which makes g holomorphic. By the Uniformization theorem [1], [12], there exists a unique homeomorphism φ : Y → C, normalized by\n(17)\n\nφ(e−2πi/3 ) = e−2πi/3 ,\n\nφ(1) = 1,\n\nφ(e2πi/3 ) = e2πi/3 ,\n\nand such that f = g ◦ φ−1 is a holomorphic map C → S, that is a rational\nfunction. It is easy to see that f is nonconstant and has degree at most d.\nThis function is the first component of Fγ (p) in (10). The second component is\n(18)\n\nc : v 7→ φ ◦ w(v),\n\nv ∈ V,\n\nwhich is a critical sequence in Σγ . Indeed, by the symmetry property (16) and\nthe symmetry of the normalization (17), φ is symmetric. Applying (16) again,\nwe conclude that our rational function f is symmetric, and that all values of\nthe function c belong to T. An important consequence of our construction of\nFγ is the following proposition, which we state in terms of function l as in (7):\nProposition 1. Let Φγ : Lγ → Σγ be the second component of the map\nFγ , and l = Φγ (p) for some p ∈ Lγ . Then l(e) 6= 0 if and only if e ⊂ D ∩ T.\nThis follows from (18), taking into account that φ is a homeomorphism,\nand w collapses exactly those edges of γ which do not belong to D.\nIf the labeling p is nondegenerate, then the map w in (13), (18) is a\nhomeomorphism, which implies that all c(v), v ∈ V , are distinct and coincide\nwith critical points of f . In this case we have l(e) > 0 for all edges e ∈ ET . So\nthe second component Φγ of Fγ maps the set of nondegenerate labelings Lγ to\nthe set of nondegenerate critical sequences Σγ , and γ is equivalent to f −1 (T)\nvia φ ◦ w, and we have (11).\nNow we show that our map Fγ in (10) is well defined, that is f and c\nare independent of the choice of a labeled net within its equivalence class, and\nalso independent of the extensions of g into the interiors of the components G.\nThis independence follows from\n\n\f116\n\nA. EREMENKO AND A. GABRIELOV\n\nLemma 2. Let Xi , i = 0, 1, be cell complexes, h′ a bijection between their\ncells such that h′ (∂C) = ∂h′ (C), Y a topological space and fi : Xi → Y two\ncontinuous maps, whose restrictions to every closed cell are homeomorphisms\nonto the image, and f1 (C) = f0 (h′ (C)) for every cell C in X1 . Then there\nexists a homeomorphism h such that f1 = f0 ◦ h.\n−1\n−1\nProof. We define h on every cell C in X1 as f0,h\n′ (C) ◦ f1 |C , where f0,h′ (C)\n′\n′\nis the inverse of the restriction f0 |h′ (C) : h (C) → f0 (h (C)).\n\nApplying Lemma 2 to two rational functions f0 and f1 , constructed from\nequivalent labeled nets, we conclude that f0 = f1 ◦ h, where h is a homeomorphism of the Riemann sphere. This homeomorphism is evidently conformal\nand fixes three points; thus h = id and f1 = f0 .\nLemma 3. The critical sequence c = Φγ (p) is well defined, that is it\ndepends only on the class of labeled nets ([γ], p).\nProof. Consider the cellular decomposition X, introduced after equation\n(13). If v is a vertex of X of degree at least 4, then z = φ(v) is a critical\npoint of f , so c(v) is well defined. Suppose now that v 1 , . . . , v m is a maximal\nchain of vertices of X of degree 2, which means that there are edges in X\nbetween these vertices, but no other edges connecting v 1 or v m to vertices of\ndegree 2. There is a unique way to extend this chain by adding v 0 and v m+1 ,\nvertices of degree at least 4, so that v 0 is connected to v1 and v m to v m+1 by\nedges of X. Then z j = φ(v j ), j ∈ {0, m + 1}, are critical points of f , and\naj = f (z j ), j ∈ {0, m + 1}, corresponding critical values. The restriction of\nf onto the arc [z 0 , z m+1 ] ⊂ T maps this arc homeomorphically onto the arc\n[a0 , am+1 ] ⊂ T. Then the position of the points z j = φ(vj ), j = 1, . . . , m, is\ndetermined from the fact that the length of each arc [f (z k ), f (z k+1 )] ⊂ T is\nequal to p(w−1 ([v k , v k+1 ])), the label of an edge of γ.\n4. Continuity of Φ\nFor a fixed γ, the second component of our map Fγ in (10) is a map\nbetween two closed polytopes\n(19)\n\nΦ : L → Σ,\n\nwhere L = Lγ , Σ = Σγ and Φ = Φγ . In this section we prove that Φ is\ncontinuous.\nSuppose that p1 ∈ L; we are going to prove that Φ is continuous at p1 .\nLet p0 be a point close to p1 . Using the notation, similar to that introduced\nin Section 3, before (12), we consider the sets Zi and the regions Di , i = 0, 1.\n\n\fRATIONAL FUNCTIONS WITH REAL CRITICAL POINTS\n\n117\n\nIn addition, let B1 , . . . , Bm be the complete list of components of ∂D1 . Then\nBj ⊂ Z1 for j = 1, . . . , m. If p0 is close enough to p1 , we may assume\n(20)\n\nZ0 ⊂ Z1 ,\n\nand thus D1 ⊂ D0 .\n\nWe have the maps wi : C → Yi ∼\n= C, i = 0, 1 as in (13), and fi = gi ◦ φ−1\ni ,\ni = 0, 1, defined in Section 4. All maps involved in our argument are shown on\nthe diagram below, where we use double notation S = C as in Section 3. For\nevery vertex v ∈ V the \"critical value\" a(v) = g1 ◦ w1 (v) is defined,\n(21)\n\nak = a(vk ) = f1 ◦ φ1 ◦ w1 (vk ) ∈ S, k = 1, . . . , 2d − 2.\n\nThe actual set of critical values of f1 is a subset of {ak } which might be proper.\n\n↓\n\nC\nw1\nw0\n↓ g0\ng1\nY0 → S ← Y1\n↓ ↓\n\nφ 0 f0\n↓\nC←\n\nf1 φ\n1\n↓\nC\n\nh\n\nWe choose arbitrary δ > 0. Then there exists ε > 0, such that the open\ndiscs Uk of radii ε around ak are either disjoint or coincide, and have the\nproperty that every component K of the preimage of their union under f1 has\ndiameter less than δ. We set ε1 = ε/(8d) and suppose that\n(22)\n\n|p1 (e) − p0 (e)| < ε1\n\nfor every\n\ne ∈ E.\n\nIn particular, in view of (20),\n(23)\n\n|p0 (e)| < ε1\n\nfor\n\ne⊂\n\nm\n[\n\nBj .\n\nj=1\n\nThe set\n(24)\n\nH = S\\\n\n2d−2\n[\n\nUk\n\nk=1\n\nhas a cell decomposition with two 2-dimensional cells C and C ∗ , where\nC = U\\\n\n2d−2\n[\n\nUk ,\n\nk=1\n\nand C ∗ the symmetric cell to C. We choose 1-dimensional cells of this decomposition to be arcs of the unit circle and arcs of the circles ∂Uk , and for\n0-dimensional cells we take the points of intersections of the circles ∂Uk with\nthe unit circle.\n\n\f118\n\nA. EREMENKO AND A. GABRIELOV\n\nLet H1 be the preimage of the set H in (24) under f1 . Then H1 has a cell\ndecomposition, which is the preimage of our cell decomposition of (24), and\nf1 |H1 maps every cell of this decomposition homeomorphically. In fact f1 |H1\nis a covering, because f1 has no critical points in H1 .\nIt follows from (23) that\n(25)\n\ndiam f0 ◦ φ0 ◦ w0 (Bj ) < ε/2,\n\nfor each component Bj of ∂D1 ,\n\nbecause Bj is made of at most 4d − 4 edges e, whose labels p0 (e) are at most\nε1 each. Furthermore, (22) and (21) imply that\n(26)\n\ndist (f0 ◦ φ0 ◦ w0 (vk ), ak ) < ε/2,\n\nk = 1, . . . , 2d − 2,\n\nso f0 has no critical values in H. As every Bj contains at least one vertex vk\nof γ, we conclude from (25) and (26) that\n(27)\n\nf0 ◦ φ0 ◦ w0 (Bj ) ∩ H = ∅,\n\nj = 1, . . . , m,\n\nwhere H was defined in (24). Let H0 be the component of f0−1 (H) intersecting\nφ0 ◦ w0 (G0 ). As f0 has no critical values in H, the restriction f0 |H0 : H0 → H\nis a covering. It follows from (27) that H0 ⊂ φ0 ◦ w0 (D1 ), because every\ncomponent Bk of ∂D1 is mapped by f0 ◦ φ0 ◦ w0 into C\\H.\nThe cell decomposition of H defined above pulls back to H0 , and f0 maps\neach closed cell of this pullback onto a cell in H homeomorphically. Notice\nthat each open cell of H0 is contained in a unique cell of the form φ0 ◦ w0 (C)\nfor some cell C ⊂ D1 of γ. A similar statement holds for cells of H1 . This\ndefines a bijection between cells of H1 and those of H0 which commutes with\nthe boundary operator ∂. So Lemma 2 can be applied to fi |Hi . We conclude\nthat\n(28)\n\nf1 = f0 ◦ h\n\non\n\nH1 ,\n\nwhere h : H1 → H0 is a homeomorphism. Evidently h is holomorphic, and its\nboundary values on ∂H1 belong to ∂H0 . Moreover, the components of ∂H1\nseparating H1 from the cubic roots of 1, are mapped to components of ∂H0\nseparating the same cubic roots of 1 from H0 . Now we use the following\nLemma 4. Suppose that a finite set X = {x1 , x2 , . . . , xn } ⊂ C, is given,\nsuch that n ≥ 3, and x1 , x2 and x3 are the cubic roots of 1. Then for every\nη > 0 there exists δ ∈ (0, η) with the following property. Let J1 , . . . , Jn be\ndisjoint open Jordan regions of diameter less than δ, xk ∈ Jk , k = 1, . . . , n,\nand h be an injective holomorphic function\nh : C\\\n\nn\n[\n\nk=1\n\nJk → C,\n\n\fRATIONAL FUNCTIONS WITH REAL CRITICAL POINTS\n\n119\n\nsuch that for k ≤ 3 the curves h(∂Jk ) separate xk from the two other cubic\nroots of 1. Then\ndist (h(z), z) < η,\n\nwhenever\n\ndist (z, X) ≥ η.\n\nProof (compare [4, Theorem 13]). Our proof is by contradiction. Suppose\nthat there is a sequence (δj ) → 0 and a sequence (hj ), which satisfies all\nconditions, but\n(29)\n\ndist (hj (zj ), zj ) ≥ η\n\nfor some η > 0 and some points zj with dist (zj , X) ≥ η. It is easy to see that the\nclosed domains Rj = C\\∪nk=1 Jk,j tend to C\\{x1 , . . . , xn } and that all functions\nhj omit three cubic roots of 1 in their domains. By Montel's criterion [16], [12],\n(hj ) is a normal family and we can select a convergent subsequence. The limit\nh of this subsequence is a holomorphic injective function h in C\\{x1 , . . . , xn },\nwhich omits the three cubic roots of 1. By the Great Theorem of Picard all\npoints xk are removable singularities, so h extends to a fractional-linear map.\nBut this fractional-linear map also fixes three points, the cubic roots of 1, so\nit is the identity. This contradicts (29).\nApplying Lemma 4 to h : H1 → C, we obtain that dist (h(z), z) < η, z ∈\nH1 , so the critical sequences (φ1 ◦ w1 (v)), v ∈ V and (φ0 ◦ w0 (v)), v ∈ V are\nη-close. So our map (19) is continuous.\n5. Boundary behavior of Φ\nOur goal is to prove that Φγ : Lγ → Σγ is surjective. This will be achieved\nwith the help of Lemma 9 in Section 6. To verify that the conditions of this\nlemma are satisfied, we need to show that the preimages of closed faces of Σγ\nare homologically trivial. These preimages can be complicated, so we begin\nwith an analysis of preimages of open faces. In this section, a net γ is fixed,\nso we do not show explicitly the dependence of various objects on γ.\nSuppose that a convex polytope K is described by\nAx = b,\n\nx ≥ 0,\n\nx ∈ Rn ,\n\nwhere A is an m × n matrix, and b ∈ Rm . An open face of K is defined as\n(30)\n\nAW = {x ∈ K : xj > 0, j ∈ W and xj = 0, j ∈\n/ W },\n\nwhere W is a subset of {1, . . . , n}, such that AW 6= ∅. A closed face is the\nclosure of an open face, and\n(31)\n\nAW = {x ∈ K : xj = 0, j ∈\n/ W }.\n\n\f120\n\nA. EREMENKO AND A. GABRIELOV\n\nVertices are open faces and closed faces simultaneously. All open and closed\nfaces are nonempty convex sets. We also notice that each closed face is a finite\nunion of open faces.\nWe are going to apply these definitions to the convex polytope Σ, described\nby (7), in the space of real-valued functions l on ET . First we state precisely\nwhich subsets W ⊂ ET define open faces, that is for which W the set (30) is\nnonempty. It follows from (7) that the necessary and sufficient conditions are:\n[v0 , v1 ] ∈ W , and that each of the two sequences\n[v1 , v2 ], . . . , [vN −1 , vN ] and\n\n[vN , vN +1 ], . . . , [v2d−3 , v2d−2 ]\n\ncontains at least one edge in W . Using the notation e′ , e′′ for the distinguished\nedges, introduced in Section 2, these conditions can be restated as\n(a) e′ ∈ W, and\n(b) there is at least one edge in W \\{e′ } on each side of e′′ .\nFor a set W ⊂ ET , satisfying these conditions, we define the open face\nAW of Σ by\n(32)\n\nAW = {l : l(e) > 0 for e ∈ W and l(e) = 0 for e ∈ ET \\W }.\n\nWe introduce a partial order on the set of open faces: A1 ≺ A2 if and only\nif A1 ⊂ A2 . From our definition (32) it follows that\n(33)\n\nAW1 ≺ AW2\n\nif and only if\n\nW1 ⊂ W2 .\n\nTo characterize the preimage Φ−1 (AW ), of an open face, we use Proposition 1 from Section 3 and Lemma 5 below. To state this lemma, we need the\nfollowing notation, similar to that used in Sections 3 and 4. For p ∈ L, we\ndefine Z(p) as the union of the closed edges e in E such that p(e) = 0, and\nD(p) as the connected component of C\\Z(p) containing G0 . Notice that D(p)\nalways contains at least three boundary edges of G0 , including e−1 and e1 .\nThis follows from (5) with G = G0 and (6). Let\n(34)\n\nE 0 (p) = {e ∈ E : e ⊂ ∂D(p) ∩ U}\n\nand\n(35)\n\nE(p) = {e ∈ E : e ⊂ D(p) ∩ T}.\n\nFigure 2 shows the part in U of a net γ with d = 5, the set E 0 (p) (bold\nlines), and the set E(p), which consists of the edges [v0 , v1 ], [v2 , v3 ], [v5 , v6 ],\n[v6 , v7 ] and [v7 , v8 ] on T.\n\n\fRATIONAL FUNCTIONS WITH REAL CRITICAL POINTS\n\n121\n\nv2\nv3\n\nv1\n\nq0\n\nv4\n\nv5\n\nv8 = v0\n\nv 7 = v− 1\nv6\n\nFigure 2: S(p) in dotted lines, E 0 (p) in bold.\nIt is clear from the definitions (34) and (35), that the set E 0 (p) determines\nE(p) uniquely. The opposite is also true:\nLemma 5.\nE 0 (p).\n\nFor p ∈ L, the set E(p) ⊂ E, uniquely determines the set\n\nProof. We use the rooted tree Ŝ, introduced in Section 2. Let S(p) be the\nsubtree of Ŝ spanned by q0 and {qe : e ∈ E(p)}. Figure 2 shows the tree S(p)\nin dotted lines.\nWe claim that S(p) = S ′ (p), where S ′ (p) is the subtree of Ŝ spanned by\n{qx : x ⊂ D(p) ∩ U} (here x may stand for a face or an edge of γ).\nBy definition of E(p), we have S(p) ⊂ S ′ (p). It remains to prove S ′ (p) ⊂\nS(p), which means that D(p) ∩ U contains exactly those faces G ∈ QU which\nhave the property qG ∈ S(p). Thus E(p) uniquely determines D(p), and D(p)\nuniquely determines E 0 (p).\nTo prove our claim, suppose that S ′ (p) 6⊂ S(p). Since both S(p) and S ′ (p)\nbelong to the tree Ŝ, there exists a leaf q of S ′ (p) which does not belong to\nS(p). If q = qe , where e ∈ ET , then e ⊂ D(p), hence qe is a vertex of S(p), in\ncontradiction to our choice of q. Suppose now that q = qG , where G ⊂ D(p),\nis a face in QU . Let Sq be the path in S connecting q and q0 . Conditions\n(5) imply that 0 < p(e) < 2π for every e = eτ , τ ∈ Sq (See also (12).) This\nimplies that there is an edge e ⊂ ∂G such that τe ∈\n/ Sq and 0 < p(e) < 2π.\nSince q ∈\n/ S(p), we have τe ∈\n/ S(p). If e ⊂ T, we have a contradiction with the\ndefinition of S(p). Otherwise, the other face in QU , having the edge e on its\nboundary, belongs to D(p), and G is not a leaf of S ′ (p), again a contradiction.\n✷\n\n\f122\n\nA. EREMENKO AND A. GABRIELOV\n\nIt follows from Proposition 1 of Section 3 and (35) that the preimage of\nan open face AW ⊂ Σ is\n(36)\n\nΦ−1 (AW ) = {p ∈ L : E(p) = W }.\n\nBy Lemma 5, for every p ∈ L, the set W = E(p) uniquely determines a\n0 = E 0 (p). According to the remark before Lemma 5, E 0 (p) uniquely\nset EW\ndetermines E(p). Thus (36) can be rewritten as\n(37)\n0\nΦ−1 (AW ) = {p ∈ L : p(e) = 0 for all e ∈ EW\n, and p(e) > 0 for all e ∈ W }.\nNow we prove that these preimages (37) are nonempty.\nLemma 6. For each subset W ⊂ ET satisfying (a) and (b) in the beginning of this section, there exists p ∈ Lγ such that W = E(p).\nProof. Given a subset W of edges of γ ∩ T satisfying (a) and (b), let us\ndefine a subtree SW of the tree Ŝ, as the union of all paths in Ŝ connecting\nvertices qe , for e ∈ W , with q0 . The labeling p is defined inductively along the\ntree Ŝ, starting from the vertex q0 . As W contains at least one edge, other\nthan e′ , at each side of e′′ , we have τe′′ ∈ SW , and there is at least one edge e of\nG0 , other than e′ and e′′ , such that τe ∈ SW . Let m ≥ 1 be the number of all\nsuch edges. We define p(e) = 2π/(3m) for each of them, p(e′ ) = p(e′′ ) = 2π/3,\nand p(e) = 0 for all other edges of G0 . This guarantees that (5) is satisfied\nfor G0 . Notice that 0 < p(e) < 2π for an edge e ⊂ ∂G0 if and only if τe ∈ SW .\nSuppose now that the values of p(e) are defined for all edges of faces\nGq ∈ QU , with q in a subtree S ′ of S containing q0 , so that 0 < p(e) < 2π if\nand only if τe belongs to SW , and (5) is satisfied. If S ′ = S, then the labeling p\nis complete. Otherwise, there exists a vertex q ∗ in S \\ S ′ which is an extremity\nof an edge τ ∗ of S with another extremity of τ ∗ being in S ′ . Let G∗ = Gq∗\nand e∗ = eτ ∗ . Since an extremity of τ ∗ belongs to S ′ , the label p(e∗ ) is already\ndefined.\nIf p(e∗ ) = 2π or p(e∗ ) = 0, then τ ∗ does not belong to SW ; hence all other\nboundary edges of G∗ do not belong to SW . In the first case, we define p(e) = 0\nfor all edges e 6= e∗ of G∗ . In the second case, we choose an edge e∗∗ 6= e∗ of\nG∗ and define p(e∗∗ ) = 2π and p(e) = 0 for all other edges of G∗ . Then (5) is\nsatisfied for G = G∗ .\nIf 0 < p(e∗ ) < 2π, then τ ∗ belongs to SW . Since e∗ ∈\n/ T, there is at least\n∗\none other edge e of G such that τe belongs to SW . Let n ≥ 1 be the number\nof all such edges. We define p(e) = (2π − p(e∗ ))/n for all these edges, and\np(e) = 0 for all other edges e 6= e∗ of G∗ . Again we have (5) for G = G∗ .\n\n\fRATIONAL FUNCTIONS WITH REAL CRITICAL POINTS\n\n123\n\nNow the values of p(e) are defined for all edges of faces Gq ∈ QU , for the\nvertices q of a connected subtree S ′′ of S obtained by adding τ ∗ and q ∗ to S ′ ,\nwhich concludes our inductive step. We extend our labeling p to edges in C\\U\nby symmetry, so that (4) is satisfied. The labeling p constructed in this way\nsatisfies (5), (6) and W = E(p).\nThe closure of the set (37) is\n(38)\n\n0\nΦ−1 (AW ) = {p ∈ L : p(e) = 0 for all e ∈ EW\n},\n\nwhich is nonempty and convex. Actually Φ−1 (AW ) is a closed face of L.\nNow we begin a study the intersection pattern of these sets (38), which\nwill be continued in Lemma 8.\nLemma 7. If A1 ≻ A2 ≻ . . . ≻ Ak is a decreasing chain of open faces of\nΣ, then the intersection of closures of their preimages Φ−1 (A1 ) ∩ . . . ∩ Φ−1 (Ak )\nis a nonempty convex subset of L (a closed face).\nProof. The sets Φ−1 (Aj ) are convex, so their intersection is convex. It\nremains to verify that the intersection is nonempty.\nWe have Aj = AWj for some Wj ⊂ ET . As in the proof of Lemma 6,\nfor each j ∈ [1, k], we define a subtree Sj ⊂ Ŝ as the union of all paths in Ŝ\nconnecting vertices qe , e ∈ Wj , with the root q0 . We also define Ej0 as the set\nof all edges e of γ, such that τe ∈ Ŝ\\Sj , and τe has a vertex in Sj . It is easy to\ncheck that these definitions are consistent with notation of Lemmas 5 and 6:\nif Wj = E(p) then Ej0 = E 0 (p).\nWe have the following inclusions:\nW1 ⊃ . . . ⊃ Wk ,\n\nand\n\nS1 ⊃ . . . ⊃ Sk .\n\nThe first inclusion follows from the assumption of the Lemma and (33), the\nsecond follows from the first one, and the definition of Sj . We assume without\nloss of generality that A1 = Σ, so W1 = ET , and S1 = Ŝ. According to (38),\nΦ−1 (Aj ) = {p : p(e) = 0 for all e ∈ Ej0 }.\nThus we have to show that there exists a labeling p, such that\np(e) = 0\n\nfor all\n\ne∈\n\nk\n[\n\nEj0 .\n\nj=1\n\nTo construct this labeling p, we order the set of faces in QU into a sequence\nG0 , . . . , Gd−1 , such that for every n ∈ [1, d − 1], the face Gn has exactly one\ncommon boundary edge with the union of faces G0 , . . . , Gn−1 . (Such ordering\nwas explained in Section 2, before (3).)\n\n\f124\n\nA. EREMENKO AND A. GABRIELOV\n\nFirst we construct p(e) for the edges e in ∂G0 , as it is done in the proof\nof Lemma 6, using Wk as W . For these edges e, we have p(e) > 0 if and only\nif τe ∈ Sk . Hence p(e) > 0 implies τe ∈ Sj , and thus e ∈\n/ Ej0 for all j ∈ [1, k].\nSuppose that p is already defined for all boundary edges of faces G0 , . . . ,\nGn−1 , for some n < d, so that\n(39)\n\np(e) > 0\n\nonly if\n\ne∈\n/ Ej0 ,\n\nfor all\n\nj ∈ [1, k].\n\nWe want to extend p to the boundary edges of G = Gn , so that the property\n(39) is preserved.\nLet m ∈ [1, k] be the integer, such that qG ∈ Sm \\Sm+1 (Sk+1 := ∅).\nConsider the path Γ in the tree S from q0 to qG . Let qG′ be the vertex on this\npath preceding qG . Then G′ < G in the sense of the partial order defined in\n(2), and this implies by (3) that G′ ∈ {G0 , . . . , Gn−1 }. There exists exactly\none boundary edge e∗ in ∂G ∩ ∂G′ . This is the only edge in ∂G, on which p is\ndefined so far. Since qG ∈ Sm , we have qG′ ∈ Γ ⊂ Sm . This implies τe∗ ∈ Sm .\nThere is at least one more boundary edge e∗∗ of G, such that τe∗∗ ∈ Sm .\nThis is because all leaves of Sm are in T; hence qG is not a leaf. We define\np(e∗∗ ) = 2π − p(e∗ ), and p(e) = 0 for all edges on ∂G, other than e∗ and e∗∗ .\nNotice that on this inductive step, the only new edge for which a positive\nvalue of p was defined is the edge e∗∗ . Now we are going to prove that the\ncondition (39) was preserved on the inductive step. Since qe∗∗ ∈ Sm , we have\n/ Sm+1 , e∗∗ does not belong to any\nqe∗∗ ∈ Sj and e∗∗ ∈\n/ Ej0 for j ≤ m. Since qG ∈\n′′\n0\nEj for j > m. Otherwise, the face G 6= G such that e∗∗ ⊂ ∂G ∩ ∂G′′ would\nhave the property qG′′ ∈ Sj ; hence the path from qG′′ to q0 , which contains qG ,\nwould belong to Sj , which is impossible since qG ∈\n/ Sj .\nThis inductive procedure defines p(e) for all edges. The labeling p we\ndefined satisfies (39), as required.\n6. Surjectivity of Φ and proof of Theorem 2\nIn this section we use homology groups with integral coefficients. We call\na topological space homologically trivial if it has the same homology groups\nas one point. In particular, such set is nonempty and connected. Nonempty\nconvex sets are homologically trivial. Thus Lemma 7 of the previous section\nshows that our map Φ satisfies the conditions of the following\nLemma 8. Let Φ : L → Σ be a continuous map of closed polytopes, such\nthat for every k ≥ 1 and for every decreasing chain A1 ≻ . . . ≻ Ak of open\nfaces of Σ, the set\nΦ−1 (A1 ) ∩ . . . ∩ Φ−1 (Ak )\nis homologically trivial. Then for every k ≥ 1 and for every decreasing chain\nA1 ≻ . . . ≻ Ak of open faces of Σ, the set\n\n\fRATIONAL FUNCTIONS WITH REAL CRITICAL POINTS\n\n125\n\nΦ−1 (A1 ) ∩ . . . ∩ Φ−1 (Ak−1 ) ∩ Φ−1 (Ak )\nis homologically trivial. In particular, Φ−1 (A) is homologically trivial for every\nopen face A.\nTo prove this lemma we need the following result from [9], Corollaire de\nThéorème 5.2.4 (of Leray). Suppose that a compact topological space K has\na finite covering by its closed subsets {Kj }, such that all intersections\n(40)\n\nKj1 ∩ . . . ∩ Kjm\n\nare either empty or homologically trivial. The nerve of such a covering is\ndefined as the simplicial complex, whose vertices are Kj and a subset of vertices\n{Kj1 . . . , Kjm } defines a simplex if and only if the intersection (40) is nonempty.\nThen K has the same homology groups as the nerve.\nAnother version of this result was proved by K. Borsuk [5]. Borsuk's theorem assumes the nonempty intersections to be absolute retracts, and concludes\nthat K is of the same homotopy type as the nerve. We can use either of these\ntwo results, but we prefer the homology version.\nProof of Lemma 8. We use induction on d = dim Ak . For d = 0, Ak is one\npoint, so Ak = Ak , and the assumption of the lemma contains its conclusion\nin this case.\nSuppose now that a chain A1 ≻ . . . ≻ Ak is given, dim Ak = d ≥ 1, and\nthe conclusion of the lemma holds for all decreasing chains whose last term is\nof dimension at most d − 1. Consider the set\nX = Φ−1 (A1 )∩. . .∩Φ−1 (Ak−1 )∩Φ−1 (Ak ) = X0 ∪{XB : B ≺ Ak , dim B ≤ d−1},\nwhere\nX0 = Φ−1 (A1 ) ∩ . . . ∩ Φ−1 (Ak ),\nand\nXB = Φ−1 (A1 ) ∩ . . . ∩ Φ−1 (Ak−1 ) ∩ Φ−1 (B),\nfor all open faces B ≺ Ak of dimension at most d − 1. Then for every collection\nB1 , . . . , Bq of such open faces we have\n(41)\n\nX0 ∩ XB1 ∩ . . . ∩ XBq = Φ−1 (A1 ) ∩ . . . ∩ Φ−1 (Ak ) ∩ Φ−1 (B),\n\nwhere B = B1 ∩ . . . ∩ Bq is a face of dimension at most d − 1. The set (41)\nis homologically trivial if and only if B is nonempty, by the assumption of\ninduction. Similarly,\n(42)\n\nXB1 ∩ . . . ∩ XBq = Φ−1 (A1 ) ∩ . . . ∩ Φ−1 (Ak−1 ) ∩ Φ−1 (B),\n\nwhere B = B1 ∩ . . . ∩ Bq is homologically trivial if and only if B is nonempty.\n\n\f126\n\nA. EREMENKO AND A. GABRIELOV\n\nThis means that the nerve of the closed covering X0 ∪B XB of X coincides\nwith the nerve of the covering of Ak by the closures of open faces B ≺ Ak ,\nincluding Ak itself. By the corollary of Leray's theorem stated above, X has\nthe same homology groups as Ak , but Ak is nonempty and convex, so X is\nhomologically trivial.\nFrom Lemma 8 we conclude that the preimages of closed faces of Σ under\nΦ are homologically trivial, in particular, they are nonempty and connected.\nTo complete the proof of Therem 2 we use the following\nLemma 9. Let L be a topological space, Σ a finite cell complex, all closed\ncells of Σ are homeomorphic to closed balls, and Φ : L → Σ a continuous\nmapping such that the preimage of each closed cell in Σ is homologically trivial.\nThen Φ is surjective.\nProof. Let Ck (L) be the space of k-chains of L with integer coefficients.\nLet C∗ be the corresponding chain complex, with the natural differential ∂ :\nCk (L) → Ck−1 (L). Let C∗ (Σ) be the corresponding chain complex for Σ.\nFor every closed k-cell A of Σ, we are going to construct a chain WA ∈\nA\nCk (L) so that Φ(WA ) ⊂ A, Φ(∂WA ) ⊂ ∂A and ΦA\n∗ [WA ] = [A]. Here Φ∗ is the\n−1\n−1\nmapping Hk (Φ (A), Φ (∂A)) → Hk (A, ∂A) induced by Φ, [WA ] is the class\nof WA in Hk (Φ−1 (A), Φ−1 (∂A)), and [A] is the class of A in Hk (A, ∂A) ∼\n= Z.\nWe proceed inductively on k = dim A. For k = 0, the preimage of the\nvertex A is nonempty, and we take a point in Φ−1 (A) as WA . Suppose that the\nchains WA are defined for all cells A of Σ with dim A < k, so that ΦA\n∗ [WA ] = [A]\nP\nand ∂WA = W∂A . Here a chain WC , for a chain C = mν Aν , is defined as\nP\nmν WAν .\nLet A be a cell in Ck (Σ). Due to the induction hypothesis, W∂A is a cycle in\n−1\n∂A\nCk−1 (L), and Φ∂A\n∗ [W∂A ] = [∂A]. Here Φ∗ is the mapping Hk−1 (Φ (∂A)) →\n−1\nHk−1 (∂A) induced by Φ. As Φ (A) is a homologically trivial subcomplex of\nL, there exists a chain WA ∈ Ck (L) such that WA ⊂ Φ−1 (A) and ∂WA = W∂A .\nFrom the commutative diagram\n∂\n\nHk (Φ−1 (A), Φ−1 (∂A)) −→ Hk−1 (Φ−1 (∂A))\nΦA\n∗\n\n\n\n\ny\n\nHk (A, ∂A)\n\nΦ∂A\n∗\n∂\n\n−→\n\n\n\n\ny\n\nHk−1 (∂A)\n\n∂A\n∼\nwe have ∂ΦA\n∗ [WA ] = Φ∗ ∂[WA ] = [∂A]. As Hk (A, ∂A) = Z is generated by [A]\nA\nand ∂[A] = [∂A] 6= 0, this implies Φ∗ [WA ] = [A].\nTo complete the proof, we have to show that the mapping Φ : WA → A is\nsurjective, for any cell A of Σ. If this is not so, then there exists an internal\npoint a ∈ A not covered by Φ(WA ). Since A \\ a is contractible to ∂A, this\ncontradicts the condition ΦA\n∗ ([WA ]) = [A] 6= 0.\n\n\fRATIONAL FUNCTIONS WITH REAL CRITICAL POINTS\n\n127\n\nProof of Theorem 2. It remains to summarize what has been done. In\nSection 3, for each net γ we constructed a map (10), which transforms labelings into pairs (f, c), where f is a rational function of the class R∗ , and c a\ncritical sequence. Restricting this map to nondegenerate labelings we obtain\nrational functions of the class Rγ ⊂ R∗ , whose critical points are given by the\nnondegenerate sequence c (see (11)). By Proposition 1 in Section 3, degenerate\nlabelings produce degenerate critical sequences, that is Φ−1 (Σ) = L in Lemma\n9. This lemma implies that all possible critical sets, consisting of 2d − 2 points,\ncan be obtained in this way. So each γ produces a rational function of the\nclass Rγ with prescribed critical points. We conclude by Lemma 1, that the\nnumber of rational functions in R∗ , with 2d − 2 prescribed critical points is at\nleast ud . This proves Theorem 2 because, as we saw in the end of Section 2,\ndifferent functions from R∗ are nonequivalent.\n✷\n7. Proof of Theorem 1\nIn this section we derive Theorem 1 from Theorems A and 2. The vector\nspace Polyd of polynomials of degree at most d with complex coefficients is\nidentified with Cd+1 . Every pair (r, q) of nonproportional polynomials spans a\n2-dimensional subspace in Polyd .\nTo parametrize the equivalence classes of rational functions of degree d, we\nconsider the Grassmannian G(2, d+1), which is the set of all 2-dimensional subspaces in Poly d , and the locus D1 ⊂ G(2, d + 1) of those pairs of\npolynomials (r, q), for which deg r/q < d. Then D1 is an algebraic subvariety of\nG(2, d + 1) of codimension 1. Two pairs (ri , qi ), i = 1, 2, represent the same\npoint in G(2, d + 1)\\D1 if and only if the rational functions r1 /q1 and r2 /q2\nare equivalent. Thus classes of rational functions of degree d are parametrized\nby G(2, d + 1)\\D1 .\nThe Wronski determinant of two nonproportional polynomials\nW (r, q) =\n\nr q\nr′ q′\n\nis a nonzero polynomial of degree at most 2d − 2, whose zeros are finite critical\npoints of f = r/q, counting multiplicities, and common zeros of r and q.\nThe common zeros of r and q are multiple zeros of W (r, q). If two pairs of\npolynomials define the same point in G(2, d + 1), then the Wronskians of these\npairs differ by a constant multiple. The set of all nonzero polynomials of\ndegree at most 2d − 2, modulo proportionality, is parametrized by CP 2d−2 .\nf : G(2, d + 1) → CP 2d−2 , defined by taking the\nThus we have a regular map W\nproportionality class of the Wronski determinant.\nf is a finite map [13, p. 177]. This fact is known [6],\nWe show that W\n[11], but we include a short proof. We normalize our Wronskians, so that the\n\n\f128\n\nA. EREMENKO AND A. GABRIELOV\n\ncoefficient of the monomial of the smallest degree equals 1. Notice that each\nmonomial z n , where 0 ≤ n ≤ 2d − 2, has only finitely many preimages under\nf , namely the 2-subspaces, generated by pairs (z k , z m ), where k + m = n + 1\nW\nand k 6= m. If (r, q) represents a point in G(2, d + 1), we consider the oneparametric family of points represented by (rλ , qλ ), λ ∈ C∗ , where rλ (z) =\nf (r , q ), we obtain W (r , q )(z) =\nr(λz) and qλ (z) = q(λz). Putting wλ = W\nλ λ\nλ λ\nλW (r, q)(λz), and after normalization wλ (z) = λ−n−1 W (r, q)(λz), where n ∈\nf −1 (wλ ) =\n[0, 2d − 2] is the smallest degree of monomials in W (r, q). So dim W\nf −1 (w1 ) for λ ∈ C∗ , and\ndim W\nw0 := lim wλ\nλ→0\n\nis\n\nw0 (z) = z n .\n\nAs the dimension of preimage is an upper semi-continuous function of the point\n[13, p. 138], for regular mappings into compact spaces, that is\nf −1 (w ) ≤ dim W\nf −1 (w0 ) = 0,\nlim sup dim W\nλ\nλ→0\n\nf −1 (w1 ) = 0 for every w1 ∈ CP 2d−2 , so the preimages\nwe conclude that dim W\nf is finite.\nare finite, and the map W\n2d−2\nLet D2 ⊂ CP\nbe the locus of polynomials with multiple roots, or\nf (D1 ) ⊂ D2 . According to\nhaving smaller degree than 2d − 2. Notice that W\n2d−2\nf −1 (w)| ≤ ud . On the\nTheorem A, for every point w in CP\n\\D2 we have |W\nother hand, our Theorem 1 implies that for every point w in the open set V in\nRP 2d−2 formed by polynomials with 2d− 2 distinct real zeros the cardinality of\nf −1 (w)∩GR (2, d+1) is at least ud . Here GR (2, d+1) stands for the 'real part'\nW\nof the Grassmannian, that is the collection of those 2-dimensional subspaces\nwhich can be generated by pairs of real polynomials. This means that\nf −1 (V) ⊂ GR (2, d + 1).\nW\n\nf −1 (w) = limw′ →w W\nf −1 (w′ ), so\nOn the other hand, for finite maps we have W\n2d−2\n−1\nf\nW (V) ⊂ GR (2, d + 1), where V is the subset of RP\nformed by polynomials with all real zeros.\nPurdue University, West Lafayette, IN\nE-mail addresses: eremenko@math.purdue.edu\nagabriel@math.purdue.edu\n\nReferences\n\n[1] L. Ahlfors, Conformal Invariants: Topics in Conformal Theory, McGraw Hill, NY, 1973.\n[2] V. I. Arnold, Springer numbers and Morsification spaces, J. Algebraic Geom. 1 (1992),\n197–214.\n[3]\n, Topological classification of real trigonometric polynomials and cyclic serpents\npolyhedron, The Arnold-Gelfand Math. Seminar, Birkhäuser, Boston, 1997, 101–106.\n[4] P. P. Belinskii, General Properties of Quasiconformal Mappings, Nauka, Novosibirsk,\n1974 (Russian).\n\n\fRATIONAL FUNCTIONS WITH REAL CRITICAL POINTS\n\n129\n\n[5] K. Borsuk, On the imbedding of systems of compacta in simplicial complexes, Fund.\nMath. 35 (1948), 217–234.\n[6] R. W. Brockett and C. I. Byrnes, Multivariable Nyquist criteria, root loci, and pole\nplacement: a geometric viewpoint, IEEE Trans. Automatic Control 26 (1981), 271–284.\n[7] C. I. Byrnes, Pole assignment by output feedback, Three Decades of Mathematical System\nTheory (H. Nijmeijer and J. Schumacher, eds.), Lect. Notes in Control and Inform. Sci .\n135, Springer-Verlag, New York, 1989, 31–78.\n[8] W. Fulton, Intersection Theory, second edition, AMS, Providence, RI, 1998.\n[9] R. Godement, Théorie des Faisceaux , Hermann, Paris, 1964.\n[10] A. A. Goldberg and I. V. Ostrovskii, Distribution of Values of Meromorphic Functions,\nMoscow, Nauka, 1970 (Russian).\n[11] L. Goldberg, Catalan numbers and branched coverings by the Riemann sphere, Adv.\nMath. 85 (1991), 129–144.\n[12] G. Goluzin, Geometric theory of functions of a complex variable, Transl. Math. Monogr .\n26, AMS, Providence, RI, 1969.\n[13] J. Harris, Algebraic Geometry. A First Course, Grad. Texts in Math. 133, SpringerVerlag, New York, 1992.\n[14] S. Kleiman, Problem 15: rigorous foundation of Schubert's enumerative calculus, in Mathematical Developments Arising from Hilbert Problems (F. Browder, ed.), Proc. Sympos.\nPure Math. 28, AMS, Providence, RI, 1976, 445–482.\n[15] S. Kleiman and D. Laksov, Schubert calculus, Amer. Math. Monthly 79 (1972), 1061–\n1082.\n[16] P. Montel, Leçons sur les Familles Normales de Fonctions Analytiques et Leurs Applications, Gauthier-Villars, Paris, 1927.\n[17] H. Schubert, Anzahl-bestimmungen für lineare Räume beliebiger dimension, Acta Math.\n8 (1886), 97–118.\n[18] F. Sottile, The special Schubert calculus is real, Electronic Res. Announc. AMS 5\n(1999), 35–39.\n[19]\n, The conjecture of Shapiro and Shapiro, preprint, www.math.umass.edu/ ̃sottile/\npages/shapiro.\n[20]\n, Real Schubert calculus: polynomial systems and a conjecture of Shapiro and\nShapiro, Experimental Math. 9 (2000), 161–182.\n, Enumerative real algebraic geometry, preprint.\n[21]\n[22] R. Stanley, Enumerative Combinatorics, Vol. 2, Cambridge Univ. Press, Cambridge,\n1999.\n[23] J. Verschelde, Numerical evidence for a conjecture in real algebraic geometry, Experimental Math. 9 (2000), 183–196.\n[24] E. B. Vinberg, Real entire functions with prescribed critical values, in Problems in Group\nTheory and in Homological Algebra, Yaroslav. Gos. Univ., Yaroslav, 1989, 127–138 (Russian).\n[25] H. Wittich, Neuere Untersuchungen über eindeutige analytische Funktionen, SpringerVerlag, New York, 1955.\n(Received January 25, 2000)\n\n\f"}