{"id": "http://arxiv.org/abs/math/0210125v2", "guidislink": true, "updated": "2003-10-02T18:44:17Z", "updated_parsed": [2003, 10, 2, 18, 44, 17, 3, 275, 0], "published": "2002-10-08T18:23:31Z", "published_parsed": [2002, 10, 8, 18, 23, 31, 1, 281, 0], "title": "A remark on K-theory and S-categories", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=math%2F0210290%2Cmath%2F0210252%2Cmath%2F0210241%2Cmath%2F0210353%2Cmath%2F0210375%2Cmath%2F0210429%2Cmath%2F0210321%2Cmath%2F0210050%2Cmath%2F0210041%2Cmath%2F0210276%2Cmath%2F0210164%2Cmath%2F0210023%2Cmath%2F0210178%2Cmath%2F0210163%2Cmath%2F0210277%2Cmath%2F0210454%2Cmath%2F0210213%2Cmath%2F0210211%2Cmath%2F0210430%2Cmath%2F0210221%2Cmath%2F0210259%2Cmath%2F0210485%2Cmath%2F0210251%2Cmath%2F0210435%2Cmath%2F0210431%2Cmath%2F0210226%2Cmath%2F0210339%2Cmath%2F0210064%2Cmath%2F0210148%2Cmath%2F0210467%2Cmath%2F0210201%2Cmath%2F0210223%2Cmath%2F0210312%2Cmath%2F0210009%2Cmath%2F0210483%2Cmath%2F0210120%2Cmath%2F0210088%2Cmath%2F0210151%2Cmath%2F0210015%2Cmath%2F0210444%2Cmath%2F0210080%2Cmath%2F0210262%2Cmath%2F0210413%2Cmath%2F0210355%2Cmath%2F0210073%2Cmath%2F0210235%2Cmath%2F0210208%2Cmath%2F0210421%2Cmath%2F0210392%2Cmath%2F0210166%2Cmath%2F0210329%2Cmath%2F0210400%2Cmath%2F0210398%2Cmath%2F0210402%2Cmath%2F0210345%2Cmath%2F0210243%2Cmath%2F0210125%2Cmath%2F0210450%2Cmath%2F0210310%2Cmath%2F0210132%2Cmath%2F0210098%2Cmath%2F0210095%2Cmath%2F0210443%2Cmath%2F0210347%2Cmath%2F0210288%2Cmath%2F0210296%2Cmath%2F0210344%2Cmath%2F0210128%2Cmath%2F0210030%2Cmath%2F0210020%2Cmath%2F0210138%2Cmath%2F0210074%2Cmath%2F0210432%2Cmath%2F0210475%2Cmath%2F0210314%2Cmath%2F0210433%2Cmath%2F0210394%2Cmath%2F0210032%2Cmath%2F0210196%2Cmath%2F0210099%2Cmath%2F0210199%2Cmath%2F0210319%2Cmath%2F0210352%2Cmath%2F0210452%2Cmath%2F0210022%2Cmath%2F0210040%2Cmath%2F0210017%2Cmath%2F0210470%2Cmath%2F0210455%2Cmath%2F0210377%2Cmath%2F0210049%2Cmath%2F0210115%2Cmath%2F0210137%2Cmath%2F0210270%2Cmath%2F0210061%2Cmath%2F0210010%2Cmath%2F0210286%2Cmath%2F0210227%2Cmath%2F0210287%2Cmath%2F0210458%2Cmath%2F0210150&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A remark on K-theory and S-categories"}, "summary": "It is now well known that the K-theory of a Waldhausen category depends on\nmore than just its (triangulated) homotopy category (see [Schlichting]). The\npurpose of this note is to show that the K-theory spectrum of a (good)\nWaldhausen category is completely determined by its Dwyer-Kan simplicial\nlocalization, without any additional structure. As the simplicial localization\nis a refined version of the homotopy category which also determines the\ntriangulated structure, our result is a possible answer to the general\nquestion: ``To which extent $K$-theory is not an invariant of triangulated\nderived categories ?''", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=math%2F0210290%2Cmath%2F0210252%2Cmath%2F0210241%2Cmath%2F0210353%2Cmath%2F0210375%2Cmath%2F0210429%2Cmath%2F0210321%2Cmath%2F0210050%2Cmath%2F0210041%2Cmath%2F0210276%2Cmath%2F0210164%2Cmath%2F0210023%2Cmath%2F0210178%2Cmath%2F0210163%2Cmath%2F0210277%2Cmath%2F0210454%2Cmath%2F0210213%2Cmath%2F0210211%2Cmath%2F0210430%2Cmath%2F0210221%2Cmath%2F0210259%2Cmath%2F0210485%2Cmath%2F0210251%2Cmath%2F0210435%2Cmath%2F0210431%2Cmath%2F0210226%2Cmath%2F0210339%2Cmath%2F0210064%2Cmath%2F0210148%2Cmath%2F0210467%2Cmath%2F0210201%2Cmath%2F0210223%2Cmath%2F0210312%2Cmath%2F0210009%2Cmath%2F0210483%2Cmath%2F0210120%2Cmath%2F0210088%2Cmath%2F0210151%2Cmath%2F0210015%2Cmath%2F0210444%2Cmath%2F0210080%2Cmath%2F0210262%2Cmath%2F0210413%2Cmath%2F0210355%2Cmath%2F0210073%2Cmath%2F0210235%2Cmath%2F0210208%2Cmath%2F0210421%2Cmath%2F0210392%2Cmath%2F0210166%2Cmath%2F0210329%2Cmath%2F0210400%2Cmath%2F0210398%2Cmath%2F0210402%2Cmath%2F0210345%2Cmath%2F0210243%2Cmath%2F0210125%2Cmath%2F0210450%2Cmath%2F0210310%2Cmath%2F0210132%2Cmath%2F0210098%2Cmath%2F0210095%2Cmath%2F0210443%2Cmath%2F0210347%2Cmath%2F0210288%2Cmath%2F0210296%2Cmath%2F0210344%2Cmath%2F0210128%2Cmath%2F0210030%2Cmath%2F0210020%2Cmath%2F0210138%2Cmath%2F0210074%2Cmath%2F0210432%2Cmath%2F0210475%2Cmath%2F0210314%2Cmath%2F0210433%2Cmath%2F0210394%2Cmath%2F0210032%2Cmath%2F0210196%2Cmath%2F0210099%2Cmath%2F0210199%2Cmath%2F0210319%2Cmath%2F0210352%2Cmath%2F0210452%2Cmath%2F0210022%2Cmath%2F0210040%2Cmath%2F0210017%2Cmath%2F0210470%2Cmath%2F0210455%2Cmath%2F0210377%2Cmath%2F0210049%2Cmath%2F0210115%2Cmath%2F0210137%2Cmath%2F0210270%2Cmath%2F0210061%2Cmath%2F0210010%2Cmath%2F0210286%2Cmath%2F0210227%2Cmath%2F0210287%2Cmath%2F0210458%2Cmath%2F0210150&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "It is now well known that the K-theory of a Waldhausen category depends on\nmore than just its (triangulated) homotopy category (see [Schlichting]). The\npurpose of this note is to show that the K-theory spectrum of a (good)\nWaldhausen category is completely determined by its Dwyer-Kan simplicial\nlocalization, without any additional structure. As the simplicial localization\nis a refined version of the homotopy category which also determines the\ntriangulated structure, our result is a possible answer to the general\nquestion: ``To which extent $K$-theory is not an invariant of triangulated\nderived categories ?''"}, "authors": ["Bertrand Toen", "Gabriele Vezzosi"], "author_detail": {"name": "Gabriele Vezzosi"}, "author": "Gabriele Vezzosi", "arxiv_comment": "23 pages; final version, accepted for publication in 'Topology'", "links": [{"href": "http://arxiv.org/abs/math/0210125v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/math/0210125v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.KT", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.KT", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.AG", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.AT", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.CT", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/math/0210125v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/math/0210125v2", "journal_reference": null, "doi": null, "fulltext": "arXiv:math/0210125v2 [math.KT] 2 Oct 2003\n\nA remark on K-theory and S-categories\n\nBertrand Toën\n\nGabriele Vezzosi\n\nLaboratoire Emile Picard\nUMR CNRS 5580\nUniversité Paul Sabatier, Toulouse\nFrance\n\nDipartimento di Matematica\nUniversità di Bologna\nItaly\n\nAbstract\nIt is now well known that the K-theory of a Waldhausen category depends on more than just its (triangulated) homotopy category (see [20]). The purpose of this note is to show that the K-theory spectrum\nof a (good) Waldhausen category is completely determined by its Dwyer-Kan simplicial localization, without any additional structure. As the simplicial localization is a refined version of the homotopy category\nwhich also determines the triangulated structure, our result is a possible answer to the general question:\n\"To which extent K-theory is not an invariant of triangulated derived categories ?\"\n\nKey words: K-theory, simplicial categories, derived categories.\nMSC-class: 55N15, 19D10, 18E30, 18G55, 18D20.\n\nContents\n1 Introduction\n\n1\n\n2 Good Waldhausen categories\n\n5\n\n3 DK-equivalences and the approximation theorem\n\n7\n\n4 Simplicial localization of good Waldhausen categories\n\n10\n\n5 K-theory of S-categories\n\n12\n\n6 Comparison\n\n15\n\n7 Final comments\n\n19\n\n1\n\nIntroduction\n\nAs recently shown by Marco Schlichting in [20], the K-theory spectrum (actually the K-theory groups) of\na stable model category depends on strictly more than just its triangulated homotopy category; indeed he\nexhibits two Waldhausen categories having equivalent (triangulated) homotopy categories and non weakly\nequivalent associated K-theory spectra. Because of this there is no longer any hope of defining a reasonable\nK-theory functor on the level of triangulated categories (see [20, Prop. 2.2]). In this paper we show that, if\none replaces in the above statement the homotopy category (i.e. the Gabriel-Zisman localization with respect\n\n\fto weak equivalences), with the more refined simplicial localization of Dwyer and Kan, then one actually\ngets an invariance statement; more precisely, we prove that the K-theory spectrum of a good Waldhausen\ncategory (see Definition 2.1) is an invariant of its simplicial localization without any additional structure.\nAs the simplicial localization is a refined version of the homotopy category, that is a simplicially enriched\ncategory lying in between the category itself and its homotopy category, we like to consider this result as\na possible answer to the general question: \"To which extend K-theory is not an invariant of triangulated\nderived categories ?\". In a sense, our result explains exactly what \"structure\" is lacking in the derived (or\nhomotopy) category of a good Waldhausen category, in order to reconstruct its K-theory.\nOur approach consists first in defining a K-theory functor on the level of S-categories (i.e. of simplicially\nenriched categories) satisfying some natural properties, and then in proving that, when applied to the simplicial localization of a good Waldhausen category C, this construction yields a spectrum which is weakly\nequivalent to the Waldhausen's K-theory spectrum of C.\nGood Waldhausen categories. Let us briefly describe the class of Waldhausen categories for which\nour result holds (see Definition 2.1 for details and the last paragraph of the Introduction for our conventions\nand notations on Waldhausen categories). Roughly speaking, a good Waldhausen category is a Waldhausen\ncategory that can be embedded in the category of fibrant objects of a pointed model category, and whose\nWaldhausen structure is induced by the ambient model structure (Definition 2.1). Good Waldhausen categories behave particularly well with respect to simplicial localization as they possess a nice homotopy\ncalculus of fractions (in the sense of [7]). The main property of good Waldhausen categories is the following\nform of the approximation theorem.\nProposition 1.1 (See Proposition 3.2) Let f : C −→ D be an exact functor between good Waldhausen\ncategories. If the induced morphism LH C −→ LH D between the simplicial localizations is an equivalence of\nS-categories, then the induced morphism\nK(f ) : K(C) −→ K(D)\nis a weak equivalence of spectra.\nThough there surely exist non-good Waldhausen categories (see Example 2.2), in practice it turns out\nthat given a Waldhausen category there is always a good Waldhausen model i.e. a good Waldhausen category with the same K-theory space up to homotopy. For example, the category of perfect complexes on a\nscheme and the category of spaces having a given space as a retract, both have good Waldhausen models\n(see Example 2.4); this shows that the class of good Waldhausen categories contains interesting examples1 .\nK-Theory of S-categories. For an S-category T , which is pointed and has fibered products (see\ndefinitions 4.1 and 4.2 for details), we define an associated good Waldhausen category M (T ), by embedding\nT in the model category of simplicial presheaves on T . The K-theory spectrum K(T ) is then defined to be\nthe Waldhausen K-theory spectrum of M (T )\nK(T ) := K(M (T )).\nProposition 1.1 immediately implies that K(T ) is invariant, up to weak equivalences of spectra, under\nequivalences in the argument T (see the end of Section 3).\nIf C is a good Waldhausen category, then its simplicial localization LH C is pointed and has fibered\nproducts (Proposition 4.4). One can therefore consider its K-theory spectrum K(LH C). The main theorem\nof this paper is the following\nTheorem 1.2 (See Theorem 6.1) If C is a good Waldhausen category, there exists a weak equivalence\nK(C) ≃ K(LH C).\n1\n\nActually, we do not know any reasonable example for which there is no good Waldhausen model.\n\n\fAs a main corollary, we get the following result that actually motivated this paper\nCorollary 1.3 (See Corollary 6.6) Let C and D be two good Waldhausen categories. If the two S-categories\nLH C and LH D are equivalent, then the K-theory spectra K(C) and K(D) are isomorphic in the homotopy\ncategory of spectra.\nAnother interesting consequence is the following.\nCorollary 1.4 (See Corollary 7.1) Let M1 := mM(Z/p2 ) and M2 := mM(Z/p[ǫ]) be the two stable model\ncategories considered in [20]. Then, the two S-categories LH M1 and LH M2 are not equivalent.\nThis last corollary implies the existence of two stable S-categories (see Section 7), namely LH M1 and\nwith equivalent triangulated homotopy categories, but which are not equivalent.\n\nLH M2 ,\n\nWhat we have not done. To close this introduction let us mention that we did not investigate the full\nfunctoriality of the construction T 7→ K(T ) from S-categories to spectra, and more generally we did not try\nto fully develop the K-theory of S-categories, though we think that this deserves to be done in the future.\nIn a similar vein, we think that the equivalence of our main theorem (Thm. 1.2) is in a way functorial in\nC, at least up to homotopy, but we did not try to prove this. Thus, the results of this paper definitely\ndo not pretend to be optimal, as our first motivation was only to give a proof of Corollary 6.6. However,\nthe interested reader might consult the last section in which we present some ideas towards more intrisinc\nconstructions and results, independent of the notion of Waldhausen category.\nOrganization of the paper. In Section 2 we introduce the class of Waldhausen categories (good\nWaldhausen categories) for which our main result holds; for such categories C, we prove that the geometric realization of the subcategory W of weak equivalences is equivalent to the geometric realization of the\nS-category of homotopy equivalences in the hammock localization LH (C) of C along W . We also list some\nexamples of good Waldhausen categories. In Section 3 we define DK-equivalences and prove Proposition\n1.1, a strong form of the approximation theorem for good Waldhausen categories. In Section 4 we define\nwhen an S-category is pointed and has fibered products, and prove that the hammock localization of a good\nWaldhausen category along weak equivalences is an S-category of this kind. In Section 5 we define the\nK-theory of pointed S-categories with fibered products and study its functoriality with respect to equivalences. Section 6 contains the main theorem showing that the K-theory of a good Waldhausen category is\nequivalent to the K-theory of its hammock localization along weak equivalences. As a corollary we get that\nthe hammock localization completely determines the K-theory of a good Waldhausen category. Finally, in\nSection 7 we discuss possible future directions and relations with other works.\nConventions and review of Waldhausen categories, S-categories and simplicial localization.\nThroughout this paper, a Waldausen category will be the dual of a usual Waldhausen category, i.e. our\nWaldhausen categories we will always be categories with fibrations and weak equivalences satisfying the\naxioms duals to Cof1, Cof2, Cof3 ([26, 1.1]), Weq1 and Weq2 ([26, 1.2]). The reason for such a choice is\nonly stylistic, in order to avoid having to dualize too many times in the text.\nExplicitly, in this paper a Waldhausen category will be a triple (C, fib(C), w(C)) consisting of category C\nwith subcategories w(C) ֒→ C and fib(C) ֒→ C whose morphisms will be called (weak) equivalences and\nfibrations, respectively, satisfying the following axioms\n• C has a zero object ∗.\n• (Cof 1)op : The subcategory fib(C) contains all isomorphisms in C.\n• (Cof 2)op : For any x ∈ C, the morphism x → ∗ is in fib(C).\n• (Cof 3)op : If x → y is a fibration, then, for any morphism y ′ → y in C, the pullback x ×y y ′ exists in\nC and the canonical morphism x ×y y ′ → y ′ is again a fibration.\n\n\f• (Weq1)op : The subcategory w(C) contains all isomorphisms in C.\n• (Weq2)op : If in the commutative diagram\ny\n\np\n\n\u000f\n\ny′\n\np′\n\n/xo\n\nz\n\n\u000f\n/ x′ o\n\nz′\n\n\u000f\n\nin C, p and p′ are fibrations and the the vertical arrows are equivalences, then the induced morphism\ny ×x z → y ′ ×x′ z ′ is again an equivalence.\nTo any usual Waldhausen category there is an associated K-theory spectrum (or space) as defined in\n[26, §1.3] using Waldhausen S• -construction. If C is a Waldhausen category according to our definition\nabove, then there is a dual S• -construction, denoted by S•op , formally obtained by replacing cofibrations\nwith fibrations (with opposed arrows) and pushouts with pullbacks in the usual S• -construction. The dual\nS• -construction applied to our C, produce a K-theory spectrum\nn 7→ |wS•op * * * S•op C|\ndenoted by K(C). Note that K(C) obviously coincides with the usual Waldhausen K-theory spectrum (as\ndefined in [26, §1.3 p. 330]) of the dual category C op , considered as a usual Waldhausen category (i.e. a\ncategory with equivalences and cofibrations satisfying the dual of the above axioms).\nFor model categories we refer to [14] and [12] which are standard references on the subject. We will often\nuse a basic link between model categories and Waldhausen categories, namely the fact that if M is a pointed\nmodel category (i.e. a model category in which the initial object ∅ and the final object ∗ are isomorphic),\nthen its subcategory M f of fibrant objects together with the induced subcategories of equivalences and\nfibrations is in fact a Waldhausen category (according to our convention). This follows from [12, Thm.\n19.4.2 (2) & Prop. 19.4.4 (2)], and can also be checked more elementarily.\nBy an S-category, we will mean a category enriched over the category of simplicial sets. If T is an\nS-category, we will denote by π0 T the category with the same objects as T and with morphisms given by\nHomπ0 T (x, y) := π0 (HomT (x, y)), where HomT (x, y) is the simplicial set of morphisms between x and y in\nT . Recall the following fundamental definition.\nDefinition 1.5 Let f : T −→ T ′ be a morphism of S-categories.\n1. The morphism f is essentially surjective if the induced functor π0 f : π0 T −→ π0 T ′ is an essentially\nsurjective functor of categories.\n2. The morphism is fully faithful if for any pair of objects (x, y) in T , the induced morphism fx,y :\nHomT (x, y) −→ HomT ′ (f (x), f (y)) is an equivalence of simplicial sets.\n3. The morphism f is an equivalence if it is essentially surjective and fully faithful.\nGiven a category C and a subcategory W , W. Dwyer and D. Kan have defined in [7] an S-category\ncalled the hammock localization, which is an enhanced version of the localized category W −1 C.\nH\nL (C, W ) (often denoted simply by LH (C) when W is clear from the context) is a model for the DwyerKan simplicial localization of C along W ([5] and [7]). LH (C, W ) has the advantage, with respect to the\nsimplicial localization of [5], that there is a natural morphism (called localization morphism) of S-categories\nL : C → LH (C, W ). With the same notations, we will write Ho(C) for the standard localization W −1 C\nand call it the homotopy category of C. In such a context, we will say that two objects in C are equivalent\nif they are linked by a string of morphisms in W . Equivalent objects in C goes to isomorphic objects in\nHo(C), but the contrary is not correct in general (though it will be true in most of our context, e.g. when\nLH (C, S),\n\n\fC is a model category or a good Waldhausen category).\nThe construction (C, W ) 7→ LH (C, W ) is functorial in the pair (C, W ) and it also extends naturally to the\ncase where W is a sub-S-category of an S-category C (see [5, §6]). Two fundamental properties of the\nfunctor LH : (C, W ) 7→ LH (C, S) are the following\n• The localization morphism L identifies π0 (LH (C, W )) with the (usual, Gabriel-Zisman) localization\nW −1 C.\n• If M be a simplicial model category, and W ⊂ M is its subcategory of equivalences, then the full\nsub-S-category M cf of M , consisting of objects which are cofibrant and fibrant, is equivalent to\nLH (M, W ).\nWe will neglect all kind of considerations about universes in our set-theoretic and categorical setup,\nleaving to the reader to keep track of the various choices of universes one needs in order the different constructions to make sense.\n\n2\n\nGood Waldhausen categories\n\nIn this section we introduce the class of Waldhausen categories (good Waldhausen categories) we are going\nto work with and for which our main theorem (Theorem 6.1) holds. Regarding the choice of this class, it\nturns out in practice that, though some usual Waldhausen categories might not be good in our sense, to our\nknowledge there always exists a good Waldhausen model for them, i.e. a good Waldhausen category with\nthe same K-theory space (up to homotopy). In other words, we do not know any relevant example which,\nfor K-theoretical purposes, could require using non-good Waldhausen categories.\nWe would also like to stress that the class of good Waldhausen categories is not the most general one for\nwhich our results hold. As the reader will notice, our main results should still be correct for any Waldhausen\ncategory having a good enough homotopy calculus of fractions (in the sense of [7, §6]).\nIf M is a model category, we denote by M f its full subcategory of fibrant objects. When the model\ncategory M is pointed, the category M f will be considered as a Waldhausen category in which weak equivalences and fibrations are induced by the model structure of M .\n\nDefinition 2.1 A good Waldhausen category is a Waldhausen category C for which there exists a pointed\nmodel category M and a fully faithful functor i : C −→ M f satisfying the following conditions\n1. The functor i commutes with finite limits (in particular i(∗) = ∗).\n2. The essential image i(C) ⊂ M f is stable by weak equivalences (i.e., if x ∈ M f is weakly equivalent to\nan object of i(C), then x ∈ i(C)).\n3. A morphism in C is a fibration (resp. a weak equivalence) if and only if its image is a fibration (resp.\na weak equivalence) in M .\nMost of the time we will identify C with its essential image i(C) in M and forget about the functor i.\nHowever, the model category M and the embedding i are not part of the data.\n\nExample 2.2 Let k be a ring and Ch(k) be the category of (unbounded) chain complexes of k-modules.\nThe category Ch(k) is a model category with weak equivalences (resp. fibrations) given by the quasiisomorphisms (resp. by the epimorphisms). The subcategory V of bounded complexes of finitely generated\nprojective k-modules is a Waldhausen category, where fibrations and weak equivalences are induced by Ch(k).\nHowever, V might not be a good Waldhausen category because it is not closed under quasi-isomorphisms in\n\n\fCh(k): its closure is the category Perf(k) of perfect complexes in Ch(k), which is indeed a good Waldhausen\ncategory (for the induced structure). Nevertheless, the K-theory spectra of V and of Perf(k) are naturally\nequivalent. This is a typical situation of a Waldhausen category that might not be good but which admits\na good Waldhausen model.\nIt is clear from Definition 2.1 that any morphism f : x → y in a good Waldhausen category C possesses\na (functorial) factorization\nf: x\n\nj\n\n/ x′\n\np\n\n/ y,\n\nwhere j is a cofibration and p a fibration, and one of them is a weak equivalence. Here, by cofibration in\nC we mean a morphism that has the left lifting property with respect to all fibrations in C that are also\nweak equivalences. Using [7, 8.2] (with W1 being the class of trivial cofibrations in C, and W2 the class of\ntrivial fibrations), one sees that the existence of such factorizations implies that the category C has a two\nsided homotopy calculus of fractions with respect to the weak equivalences W . In particular, the simplicial\nsets of morphisms in LH C can be computed using hammocks of types W −1 CW −1 ([7, Prop. 6.2 (i)]). As\nan immediate consequence, we get the following important fact.\nProposition 2.3 Let C be a good Waldhausen category, and W its sub-category of weak equivalences. Let\nwLH C be the sub-S-category of LH C consisting of homotopy equivalences (i.e. of morphisms projecting to\nisomorphisms in π0 (LH C)). Then, the natural morphism induced on the geometric realizations\n|W | −→ |wLH C|\nis a weak equivalence of simplicial sets.\nProof: Indeed, as C has a two sided homotopy calculus of fractions, then [7, 6.2 (i)] implies that the\nnatural morphism |LH W | −→ |wLH C| is a weak equivalence. As [5, 4.2] and [7, Prop. 2.2] implies that the\nnatural morphism |W | −→ |LH W | is also a weak equivalence, so is the composition\n|W | −→ |LH W | −→ |wLH C|\n✷\nLet C be a good Waldhausen category, and i : C ֒→ M f an embedding as in Definition 2.1. Condition\n(2) of Definition 2.1, and the definition of the hammock localization of [7, 2.1], implies immediately that the\ninduced morphism of S-categories\nLH C −→ LH M f\nis fully faithful (in the sense of defintion 1.5). This implies that the (homotopy type of the) simplicial sets\nof morphisms of LH C can actually be computed in the model category M by using the standard simplicial\nand co-simplicial resolutions techniques available in model categories (see [8]).\nThe induced functor Ho(C) −→ Ho(M ) being fully faithful, one sees that any morphism a → b in the\nu\n/ b in\nhomotopy category of a good Waldhausen category C can be represented by a diagram a o\na′\nC, where u is a weak equivalence (recall that any object in C is fibrant in M ). From a general point of view,\nhomotopy categories of good Waldhausen categories behave very much like categories of fibrant objects in\na model categories. For example the set of morphisms in the homotopy category can be computed using\nhomotopy classes of morphisms from cofibrant to fibrant objects (as explained in [14]). In this work we will\noften use implicitely all these properties.\nExample 2.4\n1. The first standard example of a good Waldhausen category is the category Perf(k) of perfect complexes\nover a ring k. Recall that the fibrations are the epimorphisms and the quasi-isomorphisms are the weak\nequivalences. The category Perf(k) is clearly a full subcategory of Ch(k), the category of all chain\ncomplexes of k-modules. If we endow Ch(k) with its projective model structure of [14, Thm 2.3.11]\n(for which the weak equivalences are the quasi-isomorphisms and the fibrations are the epimorphisms)\nthen one checks immediately that the conditions of the Definition 2.1 are satisfied.\n\n\f2. The previous example can be generalized in order to construct a good Waldhausen category that\ncomputes the K-theory of schemes in the sense of [21]. One possible way to do this, is by using\nthe model category ChQCoh (X) of complexes of quasi-coherent OX -Modules on a quasi-compact and\nquasi-separated scheme X defined in [15, Cor. 2.3 (b)]. Recall that in this injective model structure\nthe cofibrations are the monomorphisms and weak equivalences are the quasi-isomorphisms. Inside\nChQCoh (X) we have the full subcategory of perfect complexes Perf(X) ⊂ ChQCoh (X), which is a\nWaldhausen category for which weak equivalences are the quasi-isomorphisms and the fibrations are\nthe epimorphisms, and that computes the K-theory of the scheme X. This Waldhausen category does\nnot seem to be good in the sense of Definition 2.1, however its full subcategory of fibrant objects\nPerf(X)f ⊂ Perf(X) is good if we endow it with the induced structure of Waldhausen category\ncoming from ChQCoh (X)f . Now, the inclusion functor Perf(X)f ֒→ Perf(X) is an exact functor of\nWaldhausen categories (as fibrations in ChQCoh (X) are in particular epimorphisms, [15, Prop. 2.12]),\nand the approximation theorem ([26, Theorem 1.6.7]) tells us that it induces a weak equivalence on\nthe corresponding K-theory spectra. Therefore, the K-theory of the scheme X can be computed using\nthe good Waldhausen category Perf(X)f .\n3. More generally, for any ringed site (C, O), there exists a good Waldhausen category that computes the\nK-theory of the Waldhausen category of perfect complexes of O-modules on C. This requires a model\ncategory structure on the category of complexes of O-modules that we will not describe in this work.\n4. For a topological space X, one can use the model category of spaces under-and-over X (retractive\nspaces over X), X/Top/X, in order to define a good Waldhausen category computing the Waldhausen\nK-theory of X ([26, 2.1]).\n\n3\n\nDK-equivalences and the approximation theorem\n\nIf C is any Waldhausen category we will simply denote by LH C its hammock localization along the subcategory of weak equivalences as defined in [7, 2.1]. LH C is an S-category that comes together with a\nlocalization functor\nl : C −→ LH C.\nIf f : C −→ D is an exact functor between Waldhausen categories, then it induces a well defined morphism\nof S-categories Lf : LH C −→ LH D, such that the following diagram is commutative\nC\n\nl\n\n/ LH C\nLf\n\nf\n\n\u000f\n\nD\n\nl\n\n\u000f\n\n/ LH D.\n\nDefinition 3.1 An exact functor f : C −→ D between Waldhausen categories is a DK-equivalence if the\ninduced morphism Lf : LH C −→ LH D is an equivalence of S-categories (in the sense of [6, 1.3 (ii)]).\nObviously, the expression DK-equivalence refers to Dwyer and Kan.\nThe following proposition is a strong form of the approximation theorem for good Waldhausen categories.\nIt is probably false for more general Waldhausen categories.\nProposition 3.2 If f : C −→ D is a DK-equivalence between good Waldhausen categories then the induced\nmorphism on the K-theory spectra\nK(f ) : K(C) −→ K(D)\nis a weak equivalence.\n\n\fProof: Let Sn C and Sn D denote the dual versions (with cofibration replaced by fibrations) of the categories with weak equivalences defined and denoted in the same way in [26, 1.3]. We will prove the following\nmore precise claim\nClaim: \"For any n ≥ 0, the induced functor\nSn f : Sn C −→ Sn D\ninduces a weak equivalence on the classifying spaces of weak equivalences\nwSn f : |wSn C| ≃ |wSn D|.\"\nNote that the category wSn C is equivalent to the category of strings of fibrations in C\nxn\n\n/ xn−1\n\n/ ...\n\n/ x1\n\nand levelwise weak equivalences between them. As nerves of categories are preserved (up to a weak equivalence) by equivalences of categories, we can assume that Sn C (resp. Sn D) actually is the category of strings\nof fibrations in C (resp., in D); the fact that Sn C is a bit more complicated than just the category of strings\nof fibrations is only used to have a strict simplicial diagram of categories [n] 7→ Sn C (see [26, 1.3, p. 329]).\nLemma 3.3 Let f : C −→ D be a DK-equivalence between good Waldhausen categories. Then the induced\nmorphism on the classifying spaces\n|f | : |wC| −→ |wD|\nis a weak equivalence.\nProof of Lemma. This follows immediately from Proposition 2.3.\n\n✷\n\nNote that the previous lemma already implies the Claim above for n = 1. For general n, it is then enough\nto prove that the categories Sn C and Sn D are again good Waldhausen categories and that the induced exact\nfunctor\nSn f : Sn C −→ Sn D\nis again a DK-equivalence, and then apply Lemma 3.3 to get the Claim.\nWe need to recall here the Waldhausen structure on the category Sn C. The fibrations (resp. weak\nequivalences) are the morphisms\n/ x1\n/ ...\n/ xn−1\nxn\n\u000f\n\nyn\n\n\u000f\n/ yn−1\n\n/ ...\n\n\u000f\n/ y1\n\nsuch that each induced morphism\nxi −→ xi−1 ×yi−1 yi\nis a fibration in C (resp., such that each morphism xi → yi is a weak equivalence in C). With this definition\nwe have\nLemma 3.4 If C is a good Waldhausen category then so is Sn C.\nProof of lemma. Let us consider an embedding C ⊂ M f , of C in the category of fibrant objects in\na pointed model category M (and satisfying the conditions of Definition 2.1). We consider the category\nSn M := M I(n−1) , of strings of (n − 1) composable morphisms in M . Here we have denoted by I(n − 1) the\nfree category with n composable morphism\n\b\n/ ...\n/1 .\n/n−1\nI(n − 1) := n\n\n\fThe objects of Sn M are therefore diagrams in M\n/ xn−1\n\nxn\n\n/ ...\n\n/ x1 .\n\nWe endow the category Sn M with the model structure for which weak equivalences are defined levelwise.\nThe fibrations are morphisms\n/ ...\n/ x1\n/ xn−1\nxn\n\u000f\n/ yn−1\n\n\u000f\n\nyn\n\n/ ...\n\n\u000f\n/ y1\n\nsuch that each induced morphism\nxi −→ xi−1 ×yi−1 yi\nis a fibration in M . Note that in particular fibrant objects in Sn M are strings of fibrations in M\n/ xn−1\n\nxn\n\n/ ...\n\n/ x1 .\n\nThis model structure is known as the Reedy model structure described e.g. in [14, Thm. 5.2.5], when the\ncategory I(n − 1) is considered as a Reedy category in the obvious way. Now, the category Sn C has an\ninduced natural embedding into (Sn M )f , which satisfies the conditions of Definition 2.1. This concludes\nthe proof of Lemma 3.4.\n✷\nLemma 3.5 The induced exact functor\nSn f : Sn C −→ Sn D\nis a DK-equivalence.\nProof of lemma. Let us first show that the induced morphism\nLH Sn f : LH Sn C −→ LH Sn D\nis fully faithful. To see this, let C ֒→ M f be an embedding of C in a pointed model category as in\nDefinition 2.1. Then, the simplicial sets of morphisms in LH C are equivalent to the corresponding mapping\nspaces computed in the model category M . Applying this argument to the embedding Sn C ֒→ Sn M , we\ndeduce that the simplicial sets of morphisms of LH Sn C are equivalent to the corresponding mapping spaces\ncomputed in the model category Sn M . Finally, it is quite easy to compute the mapping spaces in Sn M\nin terms of the mapping spaces of M . The reader will check that the simplicial set of morphisms from\n/ ...\n/ x1 ) to y := (yn\n/ ...\n/ y1 ) in LH Sn C is given by the\n/ xn−1\n/ yn−1\nx := (xn\nfollowing iterated homotopy fiber product\nHomLH C (xn , yn ) ×hHom\n\n(x ,y\n)\nLH C n n−1\n\nHomLH C (xn−1 , yn−1 ) ×h * * * ×hHom\n\n(x2 ,y1 )\nLH C\n\nHomLH C (x1 , y1 ).\n\nThis description of the simplicial sets of morphisms in LH Sn C is of course also valid for LH Sn D. It shows\nin particular that if LH f : LH C −→ LH D is fully faithful, then so is LH Sn f : LH Sn C −→ LH Sn D for any n.\nIt remains to show that the morphism\nLH Sn f : LH Sn C −→ LH Sn D\nis essentially surjective. It is enough to prove that for any object\ny := (yn\n\n/ yn−1\n\n/ ...\n\n/ y1 )\n\nx := (xn\n\n/ xn−1\n\n/ ...\n\n/ x1 )\n\nin Sn D, there exists an object\n\n\fin Sn C, an object\n\n/ ...\n\n/ zn−1\n\nz := (zn\n\n/ z1 )\n\nin Sn D and a diagram of weak equivalences in Sn D\nf (x) o\n\nz\n\n/ y.\n\nFor this, we let z → y be a cofibrant replacement of y in the good Waldhausen category Sn D (recall\nthat cofibrations in a Waldhausen category are defined to be morphisms having the left lifting property with respect to fibrations which are weak equivalences; by definition of a good Waldhausen category, a cofibrant replacement functor always exists). By induction, we may assume that there exists\n/ ...\n/ x1 ) ∈ Sn−1 D, and a weak equivalence z≤n−1 → f (x≤n−1 ) in\n/ xn−2\nx≤n−1 := (xn−1\n/ zn−2\n/ ...\n/ z1 ) ∈ Sn−1 D. And it remains to show that there\nSn−1 D, where z≤n−1 := (zn−1\nexists a fibration xn → xn−1 in C, and a weak equivalence zn → f (xn ) in D, such that the following diagram\nin D commutes\n/ zn−1\nzn\n\u000f\n\nf (xn )\n\n\u000f\n/ f (xn−1 ).\n\nAs f induces an equivalence Ho(C) ≃ Ho(D) on the homotopy categories and the zi are cofibrant objects\nin D, it is clear that one can find a fibration xn → xn−1 in C, and a weak equivalence zn → f (xn ) in D\nsuch that the above diagram is commutative in Ho(D). But, as zn is cofibrant and f (xn ) → f (xn−1 ) is a\nfibration between fibrant objects, we can always choose the weak equivalence zn → f (xn ) in such a way that\nthe above diagram commutes in D (the argument is the same as in the case of model categories, therefore\nwe leave the details to the reader).\nThis construction gives the required diagram in D\nf (x) o\n\nz\n\n/ y,\n\nand concludes the proof of the lemma.\n\n✷\n\nLemmas 3.4 and 3.5 show that Sn f : Sn C −→ Sn D is also a DK-equivalence between good Waldhausen\ncategories for any n, and therefore Lemma 3.3 finishes the proof of the Claim and therefore of Proposition\n3.2.\n✷\n\n4\n\nSimplicial localization of good Waldhausen categories\n\n/Zo\nGiven fibrant simplicial sets X, Y and Z, and a diagram X\nY , we denote by X ×hZ Y the\ncorresponding standard homotopy fibered product. Explicitly, it is defined by\n1\n\nX ×hZ Y := (X × Y ) ×Z×Z Z ∆ .\nNote that for any simplicial set A, there is a natural isomorphism of simplicial sets\nHom(A, X ×hZ Y ) ≃ Hom(A, X) ×hHom(A,Z) Hom(A, Y ).\nDefinition 4.1 Let T be an S-category. We say that T is pointed if there exists an object ∗ ∈ T such that\nfor any other object x ∈ T , the simplicial sets HomT (x, ∗) and HomT (∗, x) are weakly equivalent to ∗.\nFor the next definition, recall that an S-category is said to be fibrant if all its simplicial sets of morphisms\nare fibrant simplicial sets. The existence of a model structure on S-categories with a fixed set of objects (see\nfor example [5]) implies that for any S-category T , there exists a fibrant S-category T ′ and an equivalence\nof S-categories T −→ T ′ (this equivalence is furthermore the identity on the set of objects). Such a T ′ will\nbe called a fibrant model of T .\n\n\fDefinition 4.2\n1. Let T be a fibrant S-category. We say that T has fibered products if for any diagram\nof morphisms in T\nx u /zo v y\nthere exists an object t ∈ T , two morphisms\nxo\n\np\n\nt\n\nq\n\n/y\n\n1\n\nand a homotopy h ∈ HomT (t, z)∆ such that\n∂0 h = u ◦ p\n\n∂1 h = v ◦ q,\n\nand which satisfies the following universal property:\n\"for any object w ∈ T , the natural morphism induced by (p, q, h)\nHomT (w, t) −→ HomT (w, x) ×hHom\n\nT (w,z)\n\nHomT (w, y)\n\nis a weak equivalence.\"\nSuch an object t together with the data (p, q, h) is called a fibered product of the diagram x\n\n/zo\n\n2. For a general S-category T , we say that T has fibered products if one of its fibrant model has.\nThe fact that most of the time the hammock localization of a category is not a fibrant S-category might\nbe annoying. There exists however a more intrinsic version of the above definition that we now describe.\nFor an S-category T , one can consider the category of simplicial functors from its opposite S-category T op\nto the category SSet, of simplicial sets. This category is a model category for which the weak equivalences\nand the fibrations are defined levelwise; we will denote it by SPr(T ). There exists a simplicially-enriched\nYoneda functor\nh : T −→ SPr(T )\nthat sends an object x ∈ T to the diagram\nSSet\nhx : T op −→\ny\n7→ HomT (y, x).\nWe will say that an object of SPr(T ) is representable if it is weakly equivalent in SPr(T ) to some hx for\nsome x ∈ T . With these notions the reader will check the following fact as an exercise.\nLemma 4.3 An S-category T has fibered products if and only if the full subcategory of SPr(T ) consisting\nof representable objects is stable under homotopy pull-backs.\nNote that one can then assume the property after the \"iff\" in the previous Lemma as an equivalent\ndefinition of S-category with fiber products. The following proposition is well known when C is a model\ncategory (see for example [13, 8.4]).\nProposition 4.4 Let C be a good Waldhausen category. Then the S-category LH C is pointed and has\nfibered products.\nProof: Let C ֒→ M be an embedding of C as a full subcategory of a pointed model category as in\nDefinition 2.1. The conditions of 2.1 imply that the induced morphism of S-categories\nLH C −→ LH M\nis fully faithful (i.e. induces a weak equivalence on the corresponding simplicial sets of morphisms). Therefore, LH C is equivalent to the full sub-S-category of LH M consisting of objects belonging to C. Now, it\nis well known that the S-category LH M has fibered products and furthermore that the fibered products\n\ny.\n\n\fin LH M can be identified with the homotopy fibered products in the model category M (see [13, 8.4]).\nBy Definition 2.1, the full sub-S-category of LH M of objects belonging to C is therefore stable by fibered\nproducts. This formally implies that LH C has fibered products (the details are left to the reader).\nIn the same way, as M is a pointed model category, the object ∗ in M , viewed as an object in LH M ,\nsatisfies the condition of Definition 4.1, so LH M is a pointed S-category. But, by condition (1) of Definition\n2.1, this ∗ belongs to the image of LH C in LH M . As LH C −→ LH M is fully faithful, this shows that LH C\nis a pointed S-category.\n✷\n\n5\n\nK-theory of S-categories\n\nIn this section, we define for any pointed S-category T with fibered products a K-theory spectrum K(T ).\nWe will show that K(T ) is invariant, up to weak equivalences, under equivalences of S-categories in T . The\nconstruction T 7→ K(T ) is also functorial in T , but we will not investigate this in this work, as it is more\ntechnical to prove and is not really needed for our main purpose.\nWe fix T a pointed S-category with fibered products. We consider the model category SPr(T ) of simplicial\ndiagrams on T op , and its associated Yoneda embedding\nSPr(T )\nh : T −→\nx 7→ HomT (−, x)\nRecall the following homotopy version of the simplicially enriched Yoneda lemma (e.g. [23, Prop. 2.4.2])\nLemma 5.1 Let T ′ be any S-category. For any object F ∈ SPr(T ′ ) and any object x ∈ T ′ , there is a natural\nisomorphism in the homotopy catgory of simplicial sets\nRHom(hx , F ) ≃ F (x).\nIn particular, the induced functor h : π0 T ′ → Ho(SPr(T ′ )) is fully faithful.\nRecall that any object in SPr(T ) which is weakly equivalent to some hx is called representable. If ∗\ndenotes the final object in SPr(T ), let us consider the model category\nTb∗ := ∗/SPr(T ),\nof pointed objects in the model category SPr(T ) (see [14, p. 4 and Ch. 6]). Clearly, Tb∗ is a pointed\nmodel category. We now consider its full subcategory of fibrant objects, denoted by Tb∗f , and define the\ncategory M (T ) to be the full subcategory consisting of objects in Tb∗f whose underlying objects in SPr(T )\nare representable.\nAs we supposed that T has fibered products, one checks immediately that M (T ) is a full subcategory\nb\nof T∗f which is stable under weak equivalences and homotopy pull-backs (see Lemma 4.3). Moreover, M (T )\ncontains the final object of Tb∗ since this is weakly equivalent to h∗ for any object ∗ ∈ T as in Definition 4.2.\nTherefore, endowed with the induced Waldhausen structure coming from Tb∗f , M (T ) clearly becomes a good\nWaldhausan category.\nDefinition 5.2 The K-theory spectrum of the S-category T is defined to be the K-theory spectrum of the\nWaldhausen category M (T ). It is denoted by\nK(T ) := K(M (T )).\nWe will now show that the construction T 7→ K(T ) is functorial with respect to equivalences of Scategories. Though T 7→ K(T ) actually satisfies a more general functoriality property, its functoriality with\nrespect to equivalences of S-categories will be enough for our present purpose which is to deduce that K(T )\nonly depends (up to weak equivalences) on the S-equivalence class of T .\n\n\fLet f : T −→ T ′ be an equivalence of pointed S-categories with fibered products. We deduce a pull-back\nfunctor\nf ∗ : SPr(T ′ ) −→ SPr(T ),\nas well as its pointed version\n\nf ∗ : Tb′ ∗ −→ Tb∗ .\n\nThis functor is in fact a right Quillen functor whose letf adjoint is denoted by\nf! : Tb∗ −→ Tb′ ∗ .\nAs the morphism f is an equivalence of S-categories, this Quillen adjunction is actually known to be a\nQuillen equivalence (see [6]). The functor f ∗ (pointed-version) being right Quillen, it induces a functor on\nthe subcategories of fibrant objects\nf\nf ∗ : Tb′ ∗ −→ Tb∗f .\nProposition 5.3 The functor above sends the subcategory M (T ′ ) ⊂ (Tb′ ∗ )f into the subcategory M (T ) ⊂\n(Tb∗ )f .\nProof: By definition of M (−), it is enough to show that the right derived functor\nRf ∗ ≃ f ∗ : Ho(SPr(T ′ )) −→ Ho(SPr(T ))\npreserves the property of being a representable object. But, this functor is an equivalence of categories\nwhose inverse is the functor\nLf! : Ho(SPr(T )) −→ Ho(SPr(T ′ )).\nThe reader will check that, by adjunction, one has for any object x ∈ T a natural isomorphism in Ho(SPr(T ′ ))\nLf! (hx ) ≃ hf (x) .\nAs f is an equivalence of S-categories, for any object y ∈ T ′ there exists x ∈ T and a morphism u : f (x) −→ y\nin T ′ inducing an isomorphism in π0 T ′ . Clearly hu : hf (x) −→ hy is an equivalence in SPr(T ). Therefore,\none has\nf ∗ (hy ) ≃ f ∗ (hf (x) ) ≃ f ∗ ◦ Lf! (hx ) ≃ hx .\nThis implies that f ∗ ≃ Rf ∗ preserves representable objects.\n\n✷\n\nThe above proposition implies that any equivalence of S-categories f : T → T ′ induces a well defined\nexact functor of good Waldhausen categories\nf ∗ : M (T ′ ) −→ M (T ).\nThe rule f 7→ f ∗ is clearly controvariantly functorial in f (i.e. one has a natural isomorphism (g◦f )∗ ≃ f ∗ ◦g ∗ ,\nsatisfying the usual co-cycle condition). Therefore we get a controvariant (lax) functor from the category\nof pointed S-categories with fibered products and S-equivalences to the category of Waldhausen categories\nand exact functors2 .\nProposition 5.4 Let f : T −→ T ′ be an equivalence of pointed S-categories with fibered products. Then the\ninduced exact functor\nf ∗ : M (T ′ ) −→ M (T )\nis a DK-equivalence (see Definition 3.1).\n2\n\nBy applying the standard strictification procedure we will assume that M 7→ M (T ) is a genuine functor from S-categories\ntowards Waldhausen categories\n\n\fProof: By construction, there is a commutative diagram on the level of hammock localizations\nf\n\nLH f ∗\n\nO\n\n/ LH (Tbf )\nO ∗\n\nLH M (T ′ )\n\n/ LH M (T )\n\nLH (Tb′ ∗ )\n\nThe functor f ∗ being a Quillen equivalence it is well known that the top horizontal arrow is an equivalence\nof S-categories ([7]). But, as the vertical morphisms of S-categories are fully faithful this implies that the\nmorphism\nLH f ∗ : LH M (T ′ ) −→ LH M (T )\nis fully faithful. But the isomorphism in Ho(SPr(T ))\nf ∗ (hf (x) ) ≃ hx\nshows that the induced functor\nπ0 LH f ∗ : π0 LH M (T ′ ) −→ π0 LH M (T )\nis also essentially surjective, and we conclude.\n\n✷\n\nUsing propositions 3.2, 5.3 and 5.4, we obtain the following conclusion. Let us denote by S − Catex\n∗\nthe category of S-categories which are pointed and have fibered products. Restricting the morphisms to\nequivalences of S-categories, we get a subcategory wS − Catex\n∗ . Moreover, we denote by Sp the category of\nspectra, and by wSp its subcategory of weak equivalences. The previous constructions yield a well defined\nfunctor\nK : wS − Catex\n−→\nwSpop\n∗\nT\n7→ K(T ) := K(M (T ))\nf\n7→\nK(f ∗ )\nWe can geometrically realize this functor to get a morphism on the corresponding classifying spaces\nop\nK : |wS − Catex\n∗ | −→ |wSp | ≃ |wSp|,\n\nwhich has to be understood as our K-theory functor from the moduli space of pointed S-categories with\nfibered products to the moduli space of spectra.\nThe fundamental groupoids of the spaces |wS − Catex\n∗ | and |wSp| have the following description. Let\nus denote by Ho(S − Cat) (resp. by Ho(Sp)) the homotopy category of S-categories obtained by formally\ninverting the S-equivalences (resp., the homotopy category of spectra). Then, the fundamental groupoid\nΠ1 (|wS−Catex\n∗ |) is naturally equivalent to the sub-groupoid of Ho(S−Cat) consisting of pointed S-categories\nwith fibered products and isomorphisms between them (in Ho(S − Cat)). In the same way, the fundamental\ngroupoid Π1 (|wSp|) is naturally equivalent to the maximal sub-groupoid of Ho(Sp) consisting of spectra and\nisomorphisms (in Ho(Sp)). The K-theory morphism\nop\nK : |wS − Catex\n∗ | −→ |wSp | ≃ |wSp|\n\ndefined above, induces a well defined functor between the corresponding fundamental groupoids\nop\nK : Π1 (|wS − Catex\n∗ |) −→ Π1 (|wSp|) .\n\nIn other words, for any pair of pointed S-categories with fibered products T and T ′ , and any isomorphism\nf : T ≃ T ′ in Ho(S − Cat), we have an isomorphism\nKf := K(f ∗ )−1 : K(T ) ≃ K(T ′ )\nwhich is functorial in f .\nNote however that the morphism K : |wS − Catex\n∗ | −→ |wSp| contains more information as for example\nit encodes the various morphisms on the simplicial monoids of self-equivalences\nAut(T ) −→ Aut(K(T )).\n\n\fRemark 5.5 In closing this section, we would like to mention that the above construction of the K-theory\nspectrum K(T ) of an S-category T can actually be made functorial enough in order to produce a well defined\nfunctor at the level of the underlying homotopy categories\nK : Ho(S − Catex\n∗ ) −→ Ho(Sp).\nMoreover, one can actually show that this can also be lifted to a morphism of S-categories\nH\nK : LH (S − Catex\n∗ ) −→ L Sp\n\nbetween the corresponding hammock localizations, which is the best possible functoriality one could ever\nneed in general.\n\n6\n\nComparison\n\nIn this section we prove that the K-theory spectrum of a good Waldhausen category (Definition 5.2) can be\nreconstructed from its simplicial localization. The main result is the following.\nTheorem 6.1 Let C be a good Waldhausen category and LH C its hammock localization. Then, there exists\nan isomorphism in the homotopy category of spectra\nK(C) ≃ K(LH C),\nwhere the left hand side is the Waldhausen construction and the right hand side is defined in Definition 5.2.\nProof: We will explicitly produce a natural string of exact functors between good Waldhausen categories,\nall of which are DK-equivalences, that links C to M (LH C). Then, Proposition 3.2 will imply the theorem.\nWe start by choosing a pointed model category M and an embedding C ֒→ M f as in Definition 2.1. Let\nΓ be a cofibrant replacement functor in M , in the sense of [12, Def. 17.1.8]. Recall that this means that Γ\nis a functor from M to the category of co-simplicial objects in M , together with a natural transformation\nΓ −→ c, where c is the constant co-simplicial diagram in M ; moreover, for any x ∈ M , the natural morphism\nΓ(x) −→ c(x)\nis a Reedy cofibrant replacement of the constant co-simplicial diagram c(x) (i.e. it is a Reedy trivial fibration\nand Γ(x) is cofibrant in the Reedy model category ([14, 5.2]) of co-simplicial objects in M ).\nOne should notice that if x ∈ C, since all the objects Γ(x)n are fibrant objetcs in M which are weakly\nequivalent to x, then Γ(x) is actually a co-simplicial object in C.\nb the category of simplicial presheaves on C, and by C\nb∗ the category of pointed objects\nLet us denote by C\nb\nin C (i.e. the category of presheaves of pointed simplicial sets). Both these categories will be endowed with\ntheir projective model structures for which fibrations and weak equivalences are defined objectwise.\nFor x ∈ C, we define a pointed simplicial presheaf\nSSet∗\nhx : C op −→\ny\n7→ hx (y) := Hom(Γ(y), x).\nb can\nNote that hx is a pointed simplicial presheaf because C is pointed (and therefore the final object in C\nbe identified with h∗ , where ∗ is the final and the initial object in C). The construction x 7→ hx then gives\nrise to a functor\nb∗\nC\nh : C −→\nx 7→ hx := Hom(Γ(−), x).\nAs all objects in C are fibrant in M , the standard properties of mapping spaces tell us that for any x ∈ C\nb∗ (see [12, Cor. 17.5.3 (1)]). What we actually get\nthe pointed simplicial presheaf hx is a fibrant object in C\nis, therefore, a functor\nbf .\nh : C −→ C\n∗\n\n\fb∗f with the induced Waldhausen structure coming from the projective model\nIf we endow the category C\nb∗ , the properties of mapping spaces also imply that the functor h is an exact functor between\nstructure on C\ngood Waldhausen categories (see [12, Cor. 17.5.4 (2) and Cor. 17.5.5 (2)]).\nb∗f consisting of objects weakly equivalent (in C\nb∗ ) to h ,\nWe denote by R(C) the full subcategory of C\nx\nfor some x ∈ C. Objects in R(C) will simply be called representable objects. As the functor h commutes\nwith finite limits, this subcategory is clearly a good Waldhausen category when endowed with the induced\nWaldhausen structure.\nLemma 6.2 The exact functor between good Waldhausen categories h : C −→ R(C) is a DK-equivalence.\nProof: By construction the functor is essentially surjective up to weak equivalence, which implies that\n: LH C −→ LH R(C) is indeed essentially surjective. It remains to show that it is also fully faithful.\nLet us consider the composition\nbf .\nLH C −→ LH R(C) −→ LH C\n∗\n\nLH h\n\nb∗f ), it is enough to\nThe second morphism being fully faithful (as R(C) is closed by weak equivalences in C\nb∗ is fully faithful. This essentially follows from the Yoneda\nshow that the composite morphism LH C −→ LH C\nlemma for pseudo-model categories of [23, Lemma 4.2.2], with the small difference that C is not exactly\na pseudo-model category ([23, Def. 4.1.1]), but only the subcategory of fibrant objects in a pseudo-model\ncategory.\nTo fix this, we proceed as follows. Let C ′ be the full subcategory of M of objects weakly equivalent\nto some object in C. Then, clearly C ′ is a pseudo-model category ([23, Def. 4.1.1]), there is an obvious\nembedding C ֒→ C ′ and (identifying C with its essential image in M ) its subcategory of fibrant objects\n(C ′ )f coincides with C . Moreover, if we denote by R a fibrant replacement functor in M , the functor\nb∗\nhR : C ′ −→ C\nsending x ∈ C ′ to hR(x) preserves weak equivalences ([12, Cor. 17.5.4 (2)]) and one has, by definition, a\ncommutative diagram\nh\n\n/ b\n> C∗\n}\n}}\nR }}}\nh\n}} R\n\nCO\n\nC ′,\ngiving rise to a corresponding commutative diagram of S-categories\n\nLH R\n\nLH h\n\n/ LH C\nb∗\n:\nu\nu\nu\nuu\nuu\nuu LH hR\n\nLHO C\n\nLH C ′ .\nApplying LH to the inclusion C ֒→ C ′ , one sees that the morphism LH R : LH C ′ −→ LH C is an equivalence\nb∗ is fully faithful by the following application\nof S-categories. Finally, the morphism LH hR : LH C ′ −→ LH C\nof the Yoneda lemma for pseudo-model categories [23, Lemma 4.2.2]. For any x and y in C ′ , we have a chain\nof weak equivalences of simplicial sets\nHomLH (C ′ ) (x, y) ≃ MapM (x, y) ≃ MapM (Rx, Ry) ≃ hRy (Rx),\nwhere Map(−, −) denotes the mapping space. But, by the standard simplicially enriched Yoneda lemma,\nthe simplicial set hRy (Rx) is isomorphic to HomC\nc′ (hRx , hRy ), where hRx denotes presheaf of constant\nsimplicial sets z 7→ HomM (z, Rx); moreover, if we let W ′ denote the weak equivalences in C ′ , hRx is\ncofibrant (C ′ , W ′ )∧ (defined in [23, Def. 4.1.4]) and hRy is fibrant in (C ′ , W ′ )∧ . Hence hRy (Rx) is weakly\nequivalent to Map(C ′ ,W ′ )∧ (hRx , hRy ) and then, by [23, Lemma 4.2.2], to Map(C ′ ,W ′ )∧ (hRx , hRy ) which in\nturn is weakly equivalent to HomLH ((C ′ ,W ′ )∧ ) (hRx , hRy ). This shows that the morphism of S-categories\n\n\fb is\nLH hR : LH C ′ → LH ((C ′ , W ′ )∧ ) is fully faithful. To infer from this that the morphism LH C ′ → LH C\nlikewise fully faithful, it is enough to observe that we have a commutative diagram of S-categories\nLH ((C ′ , W ′ )∧ )\n\u000f\n\nLH ((C, W )∧ )\n\nc′\nLH C\n/\n\n/\n\n\u000f\n\nb\nLH C\n\nc′ and\nin which the horizontal arrows are fully faithful (as (C ′ , W ′ )∧ is a left Bousfield localization of C\n∧\nb\n(C, W ) is a left Bousfield localization of C) and the left vertical arrow is an S-equivalence because (C ′ )f\nequals C ([23, Prop. 4.1.6]).\nb is fully faithful. One checks easily that as LH C ′ is a\nThis shows that the morphism LH C ′ −→ LH C\nb∗ is also fully faithful.\npointed S-category, this also implies that the morphism LH C ′ −→ LH C\n✷\nFor the second half of the proof of Theorem 6.1, let us consider the localization morphism l : C −→ LH C\nand the induced functor on the model categories of pointed simplicial presheaves\n[\nH C −→ C\nb∗ .\nl∗ : L\n∗\n[\nH C )f\nRecall that, by definition, the good Waldhausen category M (LH C) is the full subcategory of (L\n∗\nconsisting of representable objects3\nThe Yoneda lemmas for pseudo-model categories (see [23, Lemma 4.2.2]) and for S-categories [23, Prop.\n[\nH C )) is representable if and only if there exists an\nb∗ ) (resp. F ′ ∈ Ho(L\n2.4.2]) imply that an object F ∈ Ho(C\n∗\nb∗ ) that sends weak equivalences in C to equivalences of simplicial\nobject x ∈ C such that for any G ∈ Ho(C\n[\nH C )), one has a natural isomorphism\nsets (resp. for any G′ ∈ Ho(L\n∗\nHomHo(Cb∗ ) (F, G) ≃ π0 (G(x)∗ )\n\n(resp. Hom\n\n[\nHC )\nHo(L\n∗\n\n(F ′ , G′ ) ≃ π0 (G(x)∗ ) ).\n\nHere, we have denoted by G(x)∗ the homotopy fiber of G(x) −→ G(∗) at the distinguished point ∗ ∈ G(∗)\nvia the natural morphism ∗ → x (note that in LH C the natural morphism ∗ −→ x is only uniquely defined\nup to homotopy, which is however enough for our purposes).\n[\n[\nH C −→ C\nH C is representable\nb∗ be the functor defined above. Then, an object F ∈ L\nLemma 6.3 Let l∗ : L\n∗\n∗\nb∗ .\nif and only if its image l∗ F is representable in C\nProof: We consider the induced functor on the level of homotopy categories\n[\nH C ) −→ Ho(C\nb∗ ).\nl∗ : Ho(L\n∗\nBy [23, Thm. 2.3.5] and standard properties of the left Bousfield localization (e.g. see the discussion at the\nend of [23] page 19), this functor is fully faithful and its essential image consists precisely of those functor\nC op −→ SSet∗ sending weak equivalences in C to weak equivalences of simplicial sets.\nb∗ ), l∗ (hx ) ≃ hx : this will show\nNow, let x ∈ C and let us show that there exists an isomorphism in Ho(C\nb∗ ) belongs\nthe only if part of the lemma. The standard properties of mapping spaces imply that hx ∈ Ho(C\n∗\n∗\n∗\nto the essential image of the functor l . Therefore, as l is fully faithful, to prove that l (hx ) ≃ hx , it will\n[\nH C ), there exists a natural isomorphism\nbe enough to show that, for any G ∈ Ho(L\n∗\nHomHo(Cb∗ ) (l∗ (hx ), l∗ (G)) ≃ HomHo(Cb∗ ) (hx , l∗ (G)).\n\nb∗ and the other\nWe warn the reader that we are dealing here with two different notions of representable objects, one in C\n[\nH C . In the same way, we will not make any difference between h as an object in C\n[\nH C (this\nb\none in L\nor\nas\nan\nobject\nin L\n∗\n∗\n∗\nx\nmight be a bit confusing as C and LH C have the same set of objects). Note however that this abuse is justified by the fact that\nthe standard properties of mapping spaces imply that the \"simplicial\" hx defined on page 10 coincides, up to equivalence, with\nthe model (or good Waldhausen, involving the choice of a cosimplicial resolution Γ) hx defined on page 15.\n3\n\n\fBut, again by full-faithfulness of l∗ , the Yoneda lemma for S-categories [23, Prop. 2.4.2] implies that the\nleft hand side is naturally isomorphic to\nHom\n\n[\nHC )\nHo(L\n∗\n\n(hx , G) ≃ π0 (G(x)∗ ).\n\nOn the other hand, the Yoneda of pseudo-model categories [23, Lemma 4.2.2] implies for the right hand side\nan isomorphism\nHomHo(Cb∗ ) (hx , l∗ (G)) ≃ π0 (l∗ (G)(x)∗ ).\n\nAs the simplicial sets G(x)∗ and l∗ (G)(x)∗ are clearly functorially equivalent, this shows the first part of the\nlemma.\n\n[\nH C ) is such that l∗ (F ) is representable, then F is itself repreIt remains to prove that if F ∈ Ho(L\n∗\nsentable. For this, we use what we have just proved before, i.e. that l∗ (hx ) ≃ hx . So, if one has l∗ (F ) ≃ hx ,\nthe fact that l∗ is fully faithful implies that F ≃ hx .\n✷\nThe previous lemma implies in particular that the functor l∗ restricts to an exact functor\nl∗ : M (LH C) −→ R(C).\nLemma 6.4 The above exact functor l∗ : M (LH C) → R(C) is a DK-equivalence.\nProof: By [6] (see also [23, Thm. 2.3.5]), we know that the induced morphism of S-categories\n[\nH C −→ LH C\nb∗\nLH l ∗ : LH L\n∗\nis fully faithful. As the natural morphisms\nb∗\nLH R(C) −→ LH C\n\n[\nHC\nLH M (LH C) −→ LH L\n∗\n\nare also fully faithful, we get, in particular, that the induced morphism of S-categories\nLH l∗ : LH M (LH C) −→ LH R(C)\nis fully faithful. Furthermore, the \"if\" part of Lemma 6.3 implies that this morphism is also essentially\nsurjective. This proves that the exact functor of good Waldhausen categories\nl∗ : M (LH C) −→ R(C)\nis a DK-equivalence.\n\n✷\n\nTo summarize, we have defined (lemmas 6.2 and 6.4) a diagram of DK-equivalences between good\nWaldhausen categories\nC\n\nh\n\n/ R(C) o\n\nl∗\n\nM (LH C).\n\nBy Proposition 3.2, this induces a diagram of weak equivalences on the K-theory spectra\nK(C)\n\nK(h)\n\n/ K(R(C)) o K(l\n\nThis concludes the proof of Theorem 6.1.\n\n∗)\n\nK(M (LH C)) = K(LH C).\n✷\n\nRemark 6.5 With some work, one might be able to check that the isomorphism K(C) ≃ K(LH C) in the\nhomotopy category of spectra is functorial with respect to DK-equivalences of good Waldhausen categories.\nIt is actually functorial with respect to exact functors, but this would require the strong functoriality property\nof the construction T 7→ K(T ), for S-categories T , that we choosed not to discuss in this paper.\nThe most important corollary of Theorem 6.1 is the following one, which was our original goal. It\nstates that the K-theory spectrum of a good Waldhausen category is completely determined, up to weak\nequivalences, by its simplicial (or hammock) localization.\nCorollary 6.6 If C and D are good Waldhausen categories, and if the S-categories LH C and LH D are\nequivalent (i.e. are isomorphic in the homotopy category Ho(S−Cat)) then the K-theory spectra K(C) and\nK(D) are isomorphic in the homotopy category of spectra.\n\n\f7\n\nFinal comments\n\nK-theory of Segal categories. The definition we gave of the K-theory spectrum of a pointed S-category\nwith fibered products (Definition 5.2) makes use of Waldhausen categories and the Waldhausen construction.\nIn a way this is not very satisfactory as one would like to have a definition purely in terms of S-categories.\nSuch a construction surely exists but might not be so easy to describe. A major problem is that, by\nmimicking Waldhausen construction, one would like to define, for an S-category T , a new S-category Sn T\nclassifying strings of (n−1) composable morphisms in T , or, in other words, an object like T I(n−1) . However,\nit is well known that the naive version of T I(n−1) does not give the correct answer, as for example it might\nnot be invariant under equivalences of S-categories in T . One way to solve this problem would be to use\nweak simplicial functors and weak natural transformations as defined in [3]. Another, completely equivalent,\nsolution is to use the theory of Segal categories of [13, 19].\nAs shown in [13, 19] (for an overview of results, see also [23, Appendix]) Segal categories behave very\nmuch like categories, and many of the standard categorical constructions are known to have reasonable\nanalogs. There exists for example a notion of Segal categories of functors between Segal categories, a\nnotion of limit and colimit and more generally of adjunctions in Segal categories, a Yoneda lemma . . . .\nThese constructions could probably be used in order to define the K-theory spectrum of any pointed Segal\ncategory with finite limits in a very intrinsic way and without referring to Waldhausen construction. Roughly\nspeaking, the construction should proceed as follows. We start from any such Segal category A, and consider\nthe simplicial Segal category\nS∗ A : ∆op −→\nSegal Cat\n[n] 7→ Sn A := AI(n−1) ,\nwhere the transitions morphisms are given by various fibered products as in Waldhausen original construction\n(this diagram is probably not really a simplicial Segal category, but only a weak form of it. In other words the\nfunctor S∗ A has itself to be understood as a morphism from ∆op to the 2-Segal category of Segal categories,\nsee [13]). Then we consider the simplicial diagram of maximal sub-Segal groupoids (called interiors in [13,\n§2])\nwS∗ A : ∆op −→\nSegal Groupoids\n[n] 7→ wSn A := (AI(n−1) )int ,\nand define the K-theory spectrum of A to be the geometric realization of this diagram of Segal groupoids, or\nin other words, to be the colimit of the functor wS∗ A computed in the 2-Segal category of Segal groupoids.\nThis construction would then give a well defined morphism\nK : (Segal Cat)ex\n∗ −→ Sp,\nfrom the 2-Segal category (Segal Cat)ex\n∗ of pointed Segal categories with finite limits, exact functors and\nequivalences between them, to the Segal category of spectra.\nThis theory can also be pushed further, by introducing monoidal structures. Indeed, there exists a notion of monoidal Segal categories, as well as symmetric monoidal Segal categories (see [22]). The previously\nsketched construction could then be extended to obtain E∞ -ring spectra from pointed Segal categories with\nfinite limits and with an exact symmetric monoidal structure.\nThough there are practical reasons for having a K-theory functor defined on the level of Segal categories\n(e.g., to develop the algebraic K-theory of derived geometric stacks in the sense of [24]), there is also a\nconceptual reason for it. Indeed, Segal categories are models for ∞-categories for which i-morphisms are\ninvertible for all i > 1, and therefore the K-theory spectrum of a Segal category can be viewed as the\nK-theory of an ∞-category. Now, the simplicial localization LH (C, S) of a category C with respect to a\nsubcategory S is identified in [13, §8] as the universal Segal category obtained from C by formally inverting\nthe arrows in S. From a higher categorical point of view this means that LH (C, S) is a model for the\n∞-category formally obtained from C by inverting all morphisms in S. In other words, LH (C, S) is a model\nfor the ∞-categorical version of the usual homotopy category S −1 C, and is therefore a kind of ∞-homotopy\ncategory in a very precise sense.\n\n\fThinking in these terms, Theorem 6.1 says that the K-theory of a good Waldhausen category, while not\nan invariant of its usual (0-truncated) homotopy category, is indeed an invariant of its ∞-homotopy category.\nTriangulated structures. The reader will notice that we did not consider at all triangulated structures.\nThis might look surprising as in several recent works around the theme K-theory and derived categories the\nmain point was to see whether one could reconstruct or not the K-theory from the triangulated derived\ncategories (see [18, 20, 4]). From the point of view adopted in this paper, Theorem 6.1 tells us that, in order\nto reconstruct the K-theory space of C, one only needs the S-category LH C and nothing more. The reason\nfor this is that the triangulated structure on the homotopy category Ho(C), when it exists, is completely\ndetermined by the S-category LH C. Indeed, both fiber and cofiber sequences can be reconstructed from\nLH C, as well as the suspension functor.\nThe observation that the triangulated structure can be reconstructed from the simplicial structure has\nlead to a notion of stable S-category (this notion was introduced by A. Hirschowitz, C. Simpson and the\nfirst author in order to replace the old notion of triangulated category). Very similar notions already exist\nin homotopy theory, as the notion of stable model category of [14, §7], of enhanced triangulated category of\n[1] (see also [13, §7]), and of stable homotopy theory of [11]. To be a bit more precise, a stable S-category\nis an S-category T satisfying the following three conditions.\n1. The S-category T is pointed.\n2. The S-category T has fibered products and fibered co-products (i.e. T and T op satisfy the conditions\nof Definition 4.2).\n3. The loop space functor\nΩ : π0 T\nx\n\n−→ π0 T\n7→ ∗ ×hx ∗\n\nis an equivalence of categories.\n/xo\nHere, the object ∗ ×hx ∗ is a fibered product of the diagram *\n* in T , in the sense of\nDefinition 4.2.\nClearly, the simplicial localization LH M of any stable model category M is a stable S-category. Conversely, one can show that a stable S-category T always embeds nicely in some LH M , for M a stable model\ncategory. The homotopy category π0 T will then be equivalent to a full sub-category of Ho(M ) which is stable\nby taking homotopy fibers. In particular, the general framework of [14, §7] will imply that the category π0 T\npossesses a natural triangulated structure.\nOur Corollary 6.6 implies the following result.\n\nCorollary 7.1 There exist two non-equivalent stable S-categories T and T ′ , whose associated triangulated\ncategories π0 T and π0 T ′ are equivalent.\nProof: Let M1 := mM(Z/p2 ) and M2 := mM(Z/p[ǫ]) be the two stable model categories considered\nin [20]. The two simplicial localizations LH M1 and LH M2 are stable S-categories, which by Corollary 7.1\nand [20] can not be equivalent. However, it is shown in [20] that the corresponding triangulated categories\nπ0 LH M1 ≃ Ho(M1 ) and π0 LH M2 ≃ Ho(M2 ) are indeed equivalent.\n✷\nWe conclude in particular that a stable S-category T contains strictly more information than its triangulated homotopy category π0 T .\nS-Categories and \"dérivateurs de Grothendieck\". In this work we have used the construction\nM 7→ LH M , sending a model category M to its simplicial localization LH M as a substitute to the construction of the homotopy category. There exists another natural construction associated to a model category\nM , the dérivateur D(M ) of M , which was introduced by A. Heller in [10] and by A. Grothendieck in [9]\n\n\f(see [16] for more detailed references). The object D(M ) consists essentially of the datum of the 2-functor\nsending a category I to the homotopy category Ho(M I ), of I-diagrams in M .\nIts seems very likely that the strictification theorem [13, Thm. 18.5] (see also [23, Thm. A.3.3] or [25,\nThm. 4.2.1]) together with the results of [6] imply that both objects LH M and D(M ) determine more\nor less each others4 and therefore should capture roughly the same kind of homotopical information from\nM . One should be able to check for example that for two model categories M and M ′ , LH M and LH M ′\nare equivalent if and only if D(M ) and D(M ′ ) are equivalent. Therefore, our reconstruction theorem 6.1\nsuggests that the K-theory of a reasonable Waldhausen category is more or less an invariant of its associated\ndérivateur, and there have already been some conjectures in this direction by G. Maltsiniotis (see [17]).\nHowever, we would like to mention that the obvious generalization of conjecture 1 of [17] to all Waldhausen categories can not be true for obvious functoriality reasons. Indeed, if true for all Waldhausen\ncategories, [17, Conjecture 1] would imply that the Waldhausen K-theory of spaces X 7→ K(X) would\nfactor, up to a natural equivalence, through the category of pré-dérivateurs (the category of 2-functors\nfrom Catop to Cat). This would imply that the natural morphism induced on the simplicial monoids of\nself-equivalences\nAut(X) −→ Aut(K(X))\nwould factor through the simplicial monoid of self equivalences of some object in the category of prédérivateurs, which is easily seen to be 1-truncated (it is equivalent to the nerve of the category of self\nnatural equivalences and isomorphisms between them). Therefore, [17, Conjecture 1] would imply that the\nmorphism\nAut(X) −→ Aut(K(X))\nfactors through the 1-truncation of Aut(X). But, this is clearly false as K(X) contains the stabilization\nΩ∞ S ∞ (X) as a direct factor, and the action of Aut(X) on Ω∞ S ∞ (X) is not 1-truncated for a general X.\nWe think that this observation, though not strictly speaking a counter-example to the original conjecture 1 on [17], suggests that there is no reasonable way to define a K-theory functor directly on the level of\nGrothendieck dérivateurs, in the same way as there is no reasonable K-theory functor defined on the level\nof triangulated categories.\nS-Categories and derived equivalences. Recently, D. Dugger and B. Shipley have shown that if two\nrings k and k′ have equivalent triangulated derived categories then their K-theory spectra K(k) and K(k′ )\nare equivalent (see [4]). We would like to mention here that our reconstruction theorem 6.1 and its main\ncorollary 6.6 are results of different nature and can not be recovered by the techniques of [4]. Indeed, in [4]\nthe authors only deal with very particular type of Waldhausen categories, the categories of complexes over\nsome rings, which from a homotopical point of view behave in a very particular way (see Remarks 2.5 and\n6.8 of [4]). For example, our results allows one to reconstruct the K-theory spectra of some ring spectra R,\nwhereas the techniques of [4] do not apply in this case (in fact, there are examples of two ring spectra with\nequivalent triangulated homotopy categories of modules but with non-equivalent S-categories of modules).\nIn some sense the results of the present paper explain Remarks 2.5 and 6.8 of [4], and show that the only\nmissing information in order to reconstruct the K-theory spectrum of some Waldhausen category from its\ntriangulated homotopy category is encoded the mapping spaces and their composition. From our point of\nview, the triangulated structure is a way to catch a bit of this information, but in general it does not see all\nof it.\n\nAcknowledgments. Originally, the feeling that Corollary 1.3 might have been true came after a question asked a few years ago by P. Bressler, concerning the possibility of defining K-theory, cyclic cohomology\nThis has to be understood in a very weak sense. To be a bit more precise the S-category LH M seems to reconstruct\ncompletely D(M ), but D(M ) only determines LH M as an object in the homotopy category of S-categories Ho(S − Cat). In\nparticular some higher homotopical information is lost when passing from LH M to D(M ). For example the simplicial monoid\nof self-equivalences of LH M seems out of reach from D(M ).\n4\n\n\fand the Chern character directly on the level of Segal categories. Since then, the main ideas of this paper\nhave been circulating informally, and we would like to thank J. Borger, A. Neeman, M. Schlichting and C.\nSimpson for conversations that have motivated us to write up a detailed proof.\nThe second-named author was partially supported by the University of Bologna, funds for selected research\ntopics.\n\nReferences\n[1] A. Bondal, M. Kapranov, Enhanced triangulated categories, Math. USSR-Sbornik, Vol. 70 (1991),\n93–107.\n[2] D. Cisinski, K-théorie de Waldhausen\nhttp://www.math.jussieu.fr/∼ cisinski.\n\net\n\nK-théorie\n\ndérivée,\n\npreprint\n\navailable\n\nat\n\n[3] J.M. Cordier, T. Porter, Homotopy coherent category theory, Trans. Amer. Math. Soc. 349, 1-54.\n[4] D. Dugger, B. Shipley, K-theory and derived equivalences, Preprint math.KT/0209084.\n[5] W. Dwyer, D. Kan, Simplicial localization of categories, J. Pure and Appl. Algebra 17 (1980), 267-284.\n[6] W. Dwyer, D. Kan, Equivalences between homotopy theories of diagrams, in: Algebraic topology and\nalgebraic K-theory, Annals of Math. Studies 113, Princeton University Press, Princeton, 1987, 180–205.\n[7] W. Dwyer, D. Kan, Calculating simplicial localizations, J. Pure and Appl. Algebra 18 (1980), 17–35.\n[8] W. Dwyer, D. Kan, Function complexes in homotopical algebra, Topology 19 (1980), 427–440.\n[9] A. Grothendieck, Dérivateurs, unpublished manuscript, around 1990.\n[10] A. Heller, Homotopy theories, Memoirs of the Amer. Math. Soc. 71 (383), 1988.\n[11] A. Heller, Stable homotopy theories and stabilization, J. Pure Appl. Algebra 115 (1997), 113–130.\n[12] P. S. Hirschhorn, Model Categories and Their Localizations, Mathematical Surveys and Monographs,\nVol. 99, AMS, Providence, 2003.\n[13] A. Hirschowitz, C. Simpson, Descente pour les n-champs, Preprint math.AG/9807049.\n[14] M. Hovey, Model categories, Mathematical surveys and monographs, Vol. 63, Amer. Math. Soc. Providence 1998.\n[15] M. Hovey, Model categories structures on chain complexes of sheaves, Transactions of the AMS 353\n(2001), 2441–2457.\n[16] G. Maltsiniotis,\nIntroduction à\nhttp://www.math.jussieu.fr/∼ maltsin.\n\nla\n\n[17] G.\nMaltsiniotis,\nLa\nK-théorie\nhttp://www.math.jussieu.fr/∼ maltsin.\n\nd'un\n\nthéorie\n\ndes\n\ndérivateur\n\ndérivateurs,\ntriangulé,\n\npreprint\npreprint\n\navailable\n\nat\n\navailable\n\nat\n\n[18] A. Neeman, K-Theory for triangulated categories 3 34 , K-theory, 22 (2001), 1-144.\n[19] R. Pellissier, Catégories enrichies faibles, Thèse, Université de Nice-Sophia Antipolis, June 2002,\nPreprint math.AT/0308246.\n[20] M. Schlichting, A note on K-theory and triangulated categories, Inv. Math. 150 (2002), 111–116.\n[21] R. W. Thomason, T. Trobaugh, Higher algebraic K-theory of schemes and of derived categories, in:\nThe Grothendieck Festschrift, Vol. III, Birkhäuser, 1990, pp. 247-435.\n\n\f[22] B. Toën, Dualité de Tannaka supérieure I:\nhttp://www.mpim-bonn.mpg.de.\n\nStructures monoı̈dales, MPI Preprint, available at\n\n[23] B. Toën, G. Vezzosi, Homotopy Algebraic Geometry I: Topos theory, preprint math.AG/0207028, submitted.\n[24] B. Toën, G. Vezzosi, Homotopy Algebraic Geometry II: Derived geometric stacks, in preparation.\n[25] B. Toën, G. Vezzosi, Segal topoi and stacks over Segal sites, to appear in: Proceedings of the program\nStacks, Intersection theory and Non-abelian Hodge Theory, MSRI Berkeley, January-May 2002.\n[26] F. Waldhausen, Algebraic K-theory of spaces, in: A. Ranicki, N. Levitt, F. Quinn (eds.), Algebraic\nand Geometric Topology, Lecture Notes in Mathematics 1126, Springer 1985, pp. 318-419.\n\n\f"}