{"id": "http://arxiv.org/abs/math/0512527v2", "guidislink": true, "updated": "2006-02-10T10:38:25Z", "updated_parsed": [2006, 2, 10, 10, 38, 25, 4, 41, 0], "published": "2005-12-22T14:34:20Z", "published_parsed": [2005, 12, 22, 14, 34, 20, 3, 356, 0], "title": "Equations of log del Pezzo surfaces of index 2", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=math%2F0512010%2Cmath%2F0512118%2Cmath%2F0512158%2Cmath%2F0512034%2Cmath%2F0512209%2Cmath%2F0512055%2Cmath%2F0512353%2Cmath%2F0512415%2Cmath%2F0512060%2Cmath%2F0512537%2Cmath%2F0512304%2Cmath%2F0512046%2Cmath%2F0512045%2Cmath%2F0512119%2Cmath%2F0512507%2Cmath%2F0512545%2Cmath%2F0512332%2Cmath%2F0512484%2Cmath%2F0512621%2Cmath%2F0512316%2Cmath%2F0512431%2Cmath%2F0512050%2Cmath%2F0512290%2Cmath%2F0512048%2Cmath%2F0512009%2Cmath%2F0512165%2Cmath%2F0512160%2Cmath%2F0512151%2Cmath%2F0512099%2Cmath%2F0512279%2Cmath%2F0512056%2Cmath%2F0512367%2Cmath%2F0512293%2Cmath%2F0512554%2Cmath%2F0512427%2Cmath%2F0512494%2Cmath%2F0512428%2Cmath%2F0512610%2Cmath%2F0512180%2Cmath%2F0512132%2Cmath%2F0512232%2Cmath%2F0512369%2Cmath%2F0512286%2Cmath%2F0512508%2Cmath%2F0512551%2Cmath%2F0512482%2Cmath%2F0512253%2Cmath%2F0512418%2Cmath%2F0512187%2Cmath%2F0512580%2Cmath%2F0512527%2Cmath%2F0512570%2Cmath%2F0512186%2Cmath%2F0512029%2Cmath%2F0512659%2Cmath%2F0512637%2Cmath%2F0512658%2Cmath%2F0512240%2Cmath%2F0512059%2Cmath%2F0512245%2Cmath%2F0512411%2Cmath%2F0512053%2Cmath%2F0512242%2Cmath%2F0512363%2Cmath%2F0512062%2Cmath%2F0512351%2Cmath%2F0512026%2Cmath%2F0512564%2Cmath%2F0512635%2Cmath%2F0512464%2Cmath%2F0512030%2Cmath%2F0512568%2Cmath%2F0512049%2Cmath%2F0512126%2Cmath%2F0512075%2Cmath%2F0512237%2Cmath%2F0512468%2Cmath%2F0512224%2Cmath%2F0512303%2Cmath%2F0512457%2Cmath%2F0512487%2Cmath%2F0512502%2Cmath%2F0512154%2Cmath%2F0512013%2Cmath%2F0512159%2Cmath%2F0512315%2Cmath%2F0512157%2Cmath%2F0512152%2Cmath%2F0512220%2Cmath%2F0512052%2Cmath%2F0512470%2Cmath%2F0512575%2Cmath%2F0512412%2Cmath%2F0512012%2Cmath%2F0512235%2Cmath%2F0512084%2Cmath%2F0512503%2Cmath%2F0512436%2Cmath%2F0512401%2Cmath%2F0512622%2Cmath%2F0512105&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Equations of log del Pezzo surfaces of index 2"}, "summary": "Del Pezzo surfaces over C with log terminal singularities of index \\le 2 were\nclassified by Alekseev and Nikulin. In this paper, for each of these surfaces,\nwe find an appropriate morphism to projective space. These morphisms enable us\nto describe del Pezzo surfaces of index \\le 2 by equations in some weighted\nprojective space. Obtained results are natural completions of similar results\nof Du Val, and Hidaka and Watanabe, describing del Pezzo surfaces of index 1.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=math%2F0512010%2Cmath%2F0512118%2Cmath%2F0512158%2Cmath%2F0512034%2Cmath%2F0512209%2Cmath%2F0512055%2Cmath%2F0512353%2Cmath%2F0512415%2Cmath%2F0512060%2Cmath%2F0512537%2Cmath%2F0512304%2Cmath%2F0512046%2Cmath%2F0512045%2Cmath%2F0512119%2Cmath%2F0512507%2Cmath%2F0512545%2Cmath%2F0512332%2Cmath%2F0512484%2Cmath%2F0512621%2Cmath%2F0512316%2Cmath%2F0512431%2Cmath%2F0512050%2Cmath%2F0512290%2Cmath%2F0512048%2Cmath%2F0512009%2Cmath%2F0512165%2Cmath%2F0512160%2Cmath%2F0512151%2Cmath%2F0512099%2Cmath%2F0512279%2Cmath%2F0512056%2Cmath%2F0512367%2Cmath%2F0512293%2Cmath%2F0512554%2Cmath%2F0512427%2Cmath%2F0512494%2Cmath%2F0512428%2Cmath%2F0512610%2Cmath%2F0512180%2Cmath%2F0512132%2Cmath%2F0512232%2Cmath%2F0512369%2Cmath%2F0512286%2Cmath%2F0512508%2Cmath%2F0512551%2Cmath%2F0512482%2Cmath%2F0512253%2Cmath%2F0512418%2Cmath%2F0512187%2Cmath%2F0512580%2Cmath%2F0512527%2Cmath%2F0512570%2Cmath%2F0512186%2Cmath%2F0512029%2Cmath%2F0512659%2Cmath%2F0512637%2Cmath%2F0512658%2Cmath%2F0512240%2Cmath%2F0512059%2Cmath%2F0512245%2Cmath%2F0512411%2Cmath%2F0512053%2Cmath%2F0512242%2Cmath%2F0512363%2Cmath%2F0512062%2Cmath%2F0512351%2Cmath%2F0512026%2Cmath%2F0512564%2Cmath%2F0512635%2Cmath%2F0512464%2Cmath%2F0512030%2Cmath%2F0512568%2Cmath%2F0512049%2Cmath%2F0512126%2Cmath%2F0512075%2Cmath%2F0512237%2Cmath%2F0512468%2Cmath%2F0512224%2Cmath%2F0512303%2Cmath%2F0512457%2Cmath%2F0512487%2Cmath%2F0512502%2Cmath%2F0512154%2Cmath%2F0512013%2Cmath%2F0512159%2Cmath%2F0512315%2Cmath%2F0512157%2Cmath%2F0512152%2Cmath%2F0512220%2Cmath%2F0512052%2Cmath%2F0512470%2Cmath%2F0512575%2Cmath%2F0512412%2Cmath%2F0512012%2Cmath%2F0512235%2Cmath%2F0512084%2Cmath%2F0512503%2Cmath%2F0512436%2Cmath%2F0512401%2Cmath%2F0512622%2Cmath%2F0512105&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Del Pezzo surfaces over C with log terminal singularities of index \\le 2 were\nclassified by Alekseev and Nikulin. In this paper, for each of these surfaces,\nwe find an appropriate morphism to projective space. These morphisms enable us\nto describe del Pezzo surfaces of index \\le 2 by equations in some weighted\nprojective space. Obtained results are natural completions of similar results\nof Du Val, and Hidaka and Watanabe, describing del Pezzo surfaces of index 1."}, "authors": ["Grzegorz Kapustka", "Michal Kapustka"], "author_detail": {"name": "Michal Kapustka"}, "author": "Michal Kapustka", "arxiv_comment": "minor changes, 29 pages", "links": [{"href": "http://arxiv.org/abs/math/0512527v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/math/0512527v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.AG", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.AG", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "14J26; 14J28, 14J10", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/math/0512527v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/math/0512527v2", "journal_reference": null, "doi": null, "fulltext": "arXiv:math/0512527v2 [math.AG] 10 Feb 2006\n\nEQUATIONS OF LOG DEL PEZZO SURFACES OF\nINDEX ≤ 2\nGRZEGORZ KAPUSTKA AND MICHA\u008a KAPUSTKA\nDel Pezzo surfa es over C with log terminal singularities of index ≤ 2 were lassi\u001ced by Alekseev and Nikulin. In this\npaper, for ea h of these surfa es, we \u001cnd an appropriate morphism\nto proje tive spa e. These morphisms enable us to des ribe log del\nPezzo surfa es of index ≤ 2 by equations in some weighted proje tive spa e. Obtained results give a natural ompletion of similar\nresults of Du Val, and Hidaka and Watanabe, des ribing del Pezzo\nsurfa es of index 1.\n\nAbstra t.\n\nIntrodu tion\nA log del Pezzo surfa e is a omplex surfa e with quotient singularities whose anti- anoni al divisor is ample. The index of a log del Pezzo\nsurfa e Z is the minimal number i ∈ N su h that the divisor iKZ is a\nCartier divisor.\nLog del Pezzo surfa es of index 1 have been studied by Du Val in\n[DVa, DVb℄, Demazure in [D℄, and \u001cnally lassi\u001ced by Hidaka and\nWatanabe in [HW℄. Hidaka and Watanabe gave two lassi\u001c ations, the\n\u001crst one is in terms of blowing ups and blowing downs, whereas the\nse ond one is in terms of equations in some weighted proje tive spa e.\nIn presented paper, we study log del Pezzo surfa es of index ≤ 2.\nThese surfa es were lassi\u001ced by Nikulin and Alekseev in terms of diagrams (graphs) of ex eptional urves on an appropriate resolution of\nsingularities (see [AN℄). This is a ounterpart of the \u001crst lassi\u001c ation\nof Hidaka and Watanabe. Our aim is to extend their se ond des ription\nto this larger family of log del Pezzo surfa es. That is, we are interested in \u001cnding simple equations in some weighted proje tive spa e\ndes ribing them.\nThe main results of the paper (Theorems 2.2, 4.1, 5.2 and 5.3) may\nbe formulated as the following theorem.\nThe work was done during the authors stay at the University of Liverpool supported by the Marie Curie program.\nMSC- lass: 14J26; 14J28, 14J10.\n1\n\n\f2\n\nGRZEGORZ KAPUSTKA AND MICHA\u008a KAPUSTKA\n\nTheorem 1. If Z is a log del Pezzo surfa e of index 2 then we have\none of the following ases:\na) KZ2 = 1 and Z is isomorphi to a hypersurfa e of degree 6 in\nP(1, 1, 2, 3)\nb) KZ2 = 2 and Z is isomorphi either to a hypersurfa e of degree\n8 in P(1, 1, 4, 4) or to a hypersurfa e of degree 4 in P(1, 1, 1, 2)\n) KZ2 = 3 and Z is isomorphi to a omplete interse tion in\nP(1, 1, 1, 1, 2) of two hypersurfa es of degree 2 and 3 respe tively\n2\nd) KZ2 ≥ 4 and Z an be embedded in P(1KZ +1 , 2) in su h a way\n\nthat its ideal is generated by elements of degree 2 and 3. Moreover Z is then:\n(i) either isomorphi to a one over a rational normal quarti\nurve\n(ii) or ontained in a threefold one isomorphi to a one over\na Veronese embedding of a rational normal s rollar surfa e\nor P2 .\n\nThe main idea of the proof is to study embeddings of K3 surfa es\nasso iated by Alekseev and Nikulin ([AN℄) to ea h onsidered del Pezzo\nsurfa e.\nIn se tion 0 we revise the onstru tion of asso iated K3 surfa es and\nolle t some preliminary results on erning log del Pezzo surfa es and\ntheir resolutions.\nIn se tion 1 we introdu e a linear system |Dg | on the onstru ted K3\nsurfa e and then, we use results of Saint-Donat (see [SD℄) to des ribe\nthe morphism given by it. The morphism des ent to a mapping from\nthe log del Pezzo surfa e to the quotient of the proje tive spa e by a\nhyperplane symmetry. In most ases, our des ription is related to the\nmorphism given by the anti- anoni al divisor.\nWe onsider ea h of the ases from the theorem in a separate se tion.\nIn ea h of these se tions beside proving the appropriate part we make\na deeper analysis of the obtained examples.\nSe tion 2 deals with surfa es Z for whi h g = KZ2 + 1 = 2. The\naim of that se tion is to give a omplete des ription of log del Pezzo\nsurfa es having above property. The \u001crst theorem (Thm. 2.1) gives\na des ription in terms of overings. More pre isely we \u001cnd a 2:1 morphism onto a quadri one in P3 (that is onto the weighted proje tive\nspa e P(1, 1, 2)) and des ribe its bran h lo us. The equations follow\nthen easily (Thm. 2.2).\nIn this se tion, obtained equations o ur as natural deformations\n(and some kind of ompletion) of analogous equations des ribed in\n[HW℄ for Gorenstein log del Pezzo surfa es (i. e. of index 1).\n\n\fEQUATIONS OF LOG DEL PEZZO SURFACES OF INDEX ≤ 2\n\n3\n\nFor instan e Du Val, in [DVa, DVb℄, introdu es Du Val singularities\nas arising from the double overing of a quadri one bran hed over\nthe interse tion of this one with a smooth ubi surfa e not passing\nthrough its vertex. This surfa e is Gorenstein and log del Pezzo. We\nobtain the ases where the ubi passes through the vertex as models\nof log del Pezzo surfa es of index 2. This surfa es have a singularity\nover the vertex of the one that is not Du Val. It is a singularity of the\nso- alled type Kn .\nThe third se tion deals with the ase when KZ2 = 2. In this se tion\nwe are adapting to the ase g = KZ2 + 1 = 3 the same te hni s whi h\nhad been used earlier for g = KZ2 + 1 = 2. The di\u001beren e is that the\nmorphism |Dg | is no more 2:1. The des ription looses a little bit of\nits larity be ause it not free from he king singularities of resulting\nequations.\nHere we also get a natural generalization of the analogous ase from\n[HW℄. But there is one example that does not arise as a natural deformation of any of the surfa es des ribed there. Elements from this new\nfamily happens to be the only ones that has more than one singularity\nof index 2 (they have exa tly 2 singularities of type K1 ).\nThe next se tion gathers all remaining ases. After proving the main\ntheorem we des ribe ea h of the possibilities from its assertion in a more\npre ise way in ontext of the diagrams of ex eptional urves from [AN℄.\nHowever, for KZ2 ≥ 5 the des ription is not so pre ise as earlier. Instead\nwe use onstru tions given in [AN℄ to give a omplete list of families\nof log del Pezzo surfa es of index 2 with g ≥ 6. We an moreover \u001cnd\na good des ription for some of the examples from this list, separately\nfrom the rest, by realizing them as quinti hypersurfa es in P(1, 1, 1, 4).\nThe last se tion shows an appli ation of these results from a di\u001berent\npoint of view. With the help of [AN℄, we get the list of all on\u001cgurations of singularities that an o ur in ea h of the surfa es des ribed\nthroughout all the paper. For example, we an list all possible on\u001cgurations of ADE singularities on symmetri quarti s in P3 , extending the\ndes ription of [HW℄ with the ases where the quarti passes through\nthe enter of symmetry. By studying interse tions of a quadri one\nwith a ubi in P3 , we an do the same for symmetri sexti s in P2 .\n\nA knowledgements\nWe would like to express our gratitude to Prof. V. Nikulin for his\nenormous help and fruitful dis ussions during our work on this paper.\n\n\f4\n\nGRZEGORZ KAPUSTKA AND MICHA\u008a KAPUSTKA\n\n0.\n\nNotation and basi tools\n\nIn this se tion, we re all the notation and basi fa ts about log del\nPezzo surfa es of index ≤ 2, ontained in [AN℄, that we will use in the\npaper.\nFirst observe that the only singularities of index ≤ 2 on log del Pezzo\nsurfa es are Du Val (of index 1) or of the type Kn .\n\nDe\u001cnition 0.1.\n\nA singularity on a surfa e is alled of type Kn if the\nex eptional divisor of its minimal resolution is one of the following\non\u001cgurations of n urves:\n\u0015 a rational urve of self interse tion −4 for n = 1\n\u0015 two rational urves of self interse tion −3 utting in one point for\nn=2\n\u0015 two rational urves of self interse tion −3 onne ted by a hain of −2\nurves for n ≥ 3\nIn other terms the diagram of ex eptional urves in the minimal\nresolution is the following:\n(i) ❝❛ for n=1\n(ii) x❝ x❝ for n=2\n(iii) |x❝ s s {z. . . s x}❝\n\nfor n ≥ 3\n\nn\n\nWhere a bla k vertex denotes a rational −2 urve a double transparent\nvertex a rational −4 urve and a rossed transparent vertex a rational\n−3 urve.\nTo work with log del Pezzo surfa es, we need to resolve their singularities. In our ontext, the interesting resolution will not be the\nminimal one, but the right resolution introdu ed in [AN℄.\n\nDe\u001cnition 0.2.\n\nIf Z is a log del Pezzo surfa e of index ≤ 2 its resolution of singularity is alled right if and only if:\n(i) it is a minimal resolution of the Du Val singularities\n(ii) the singularities of type Kn are resolved by omposing the minimal\nresolution with the blowing up of all points of interse tion of urves in\nthe ex eptional divisor. The ex eptional divisor takes the form:\n\n|❛❝ ❝ ❛❝ {z. . .\n2n−1\n\n❝\n\n}❛❝\n\nwhere transparent verti es denote −1 urves.\n\nDe\u001cnition 0.3.\n\nA right DPN surfa e of ellipti type surfa e (for us\nshortly a DPN surfa e) is a smooth surfa e that we an obtain as a\nright resolution of a log del Pezzo surfa e of index ≤ 2.\n\n\fEQUATIONS OF LOG DEL PEZZO SURFACES OF INDEX ≤ 2\n\n5\n\nFor basi properties and hara terization of DPN surfa es we refer\nthe reader to [AN℄, where they were de\u001cned in a di\u001berent but equivalent\nway.\nFrom now on, Z will denote a log del Pezzo surfa e of index ≤ 2, on\nwhi h we shall put additional onditions depending on the subfamily\nwe are going to work with.\nWe will denote by g the number KZ2 + 1. This invariant plays an\nimportant role in the lassi\u001c ation of log del Pezzo surfa es of index\n≤ 2 given in [AN℄. It has a geometri al interpretation, as we an see\nbelow in the following onstru tion.\n\nConstru tion 0.1 (see [AN, se\n\n2.1℄). Let Z be a log del Pezzo surfa e\nof index ≤ 2. Let r : Y −→ Z be its right resolution. Y is then a right\nDPN surfa e of ellipti type. Denote by Ei (for i ∈ {1, . . . , k}) the\n(−4) ex eptional urves of r . From [AN, thm 1.5℄, we know that in\nthe system | − 2KY |, there exists a smooth urve C of the form C =\nCg +E1 +E2 +* * *+Ek (in parti ular Cg .Ei = 0), where Cg ∈ |r ∗ (−2KZ )|\nis a smooth urve of genus g . We an now take the double overing\nπ : X −→ Y of Y bran hed in the urve C . By adjun tion formula, X\nis a K3 surfa e.\n\nRemark 0.1. In the above onstru tion, we have a large hoi e of urves\n\nCg , ea h of them giving by this onstru tion a di\u001berent K3 surfa e X .\nWe will hoose one of them and keep this notation as \u001cxed throughout\nthe paper (however, in a suitable pla e, we will show what hanges if\nwe make another hoi e).\nWe an see from the onstru tion that, any right DPN surfa e of\nellipti type an be obtained as a quotient of some K3 surfa e X by\nan involution θ with \u001cxed lo us being a smooth urve of the form\nDg + F1 + * * * + Fk , where Dg is a urve of genus g ≥ 2 and Fi are\nrational. Su h an involution on a K3 surfa e is alled non-symple ti\nof ellipti type. The onverse is also true, namely if X is a K3 surfa e\nand θ a non-symple ti involution of ellipti type, then the quotient of\nX by θ is a right DPN surfa e of ellipti type.\nAn involution is alled non-symple ti if its \u001cxed lo us is a smooth\nurve. This type of involution is also hara terized in the following way.\nLet ωX be any non-zero regular 2-dimensional di\u001berential form on X ,\nthen an involution θ is non-symple ti if and only if θ∗ (ωX ) = −ωX .\nAn involution on a K3 surfa e that does not satisfy this ondition has\nto be a symple ti involution, that is θ∗ (ωX ) = ωX , and then its \u001cxed\nlo us is a \u001cnite set of points.\n\n\f6\n\nGRZEGORZ KAPUSTKA AND MICHA\u008a KAPUSTKA\n\nTogether with g = KZ2 + 1 in the lassi\u001c ation ontained in [AN℄ two\nmore invariants are important. They are alled k and δ (see [AN, Se .\n2.3℄).\nThe number k is related to the type of singularities of index 2 appearing on the del Pezzo surfa e. It is the number of −4 urves on the\norresponding DPN surfa e. It happens that in most of the ases there\nis only one singularity of this index, it is by de\u001cnition a singularity Kk .\nThe only ex eptions are del Pezzo surfa es with two K1 singularities,\nthey all form one family in the des ription of [AN℄ (in the Table 3 it\nhas number 25) and naturally have k = 2 by de\u001cnition.\nThe invariant δ takes only one of two values 0 or 1. The δ = 0 if and\nonly if the redu ed urve π −1 (Cg + E1 + * * * + Ek ) is divisible by 2 in\nthe Pi ard latti e of the K3 surfa e X .\nTable 3 in [AN℄ gives a omplete list of possible diagrams of ex eptional urves on right DPN surfa es of ellipti type. It is very long, so\nfor la k of spa e we refer to the original paper. However, we should\nre all some basi fa ts about how to understand this list.\nAs earlier, bla k verti es denote −2 urves, transparent ones −1\nurves and double transparent ones −4 urves. Ea h of them orresponds to a family of DPN surfa es that we onstru t by blowing up\nP2 , P1 × P1 or some Fn to obtain a on\u001cguration of ex eptional urves\n( urves with negative self-interse tion) as in the diagram.\nWe denote the diagram of ex eptional urves on a DPN surfa e Y\nby Γ(Y ). The graph of bla k verti es in a diagram Γ determines the\ntype and the on\u001cguration of Du Val singularities on the orresponding del Pezzo surfa es. It is alled the Du Val part of the diagram\nand is denoted by Duv(Γ). The Table 3 in [AN℄ does not ontain all\ndiagrams, ea h of them generate a number of others orresponding to\nany subgraph of Duv(Γ). In this way for any subgraph D ⊂ Duv(Γ)\nthere is a DPN surfa e with a on\u001cguration of -2 urves des ribed by\nD.\nThe double transparent verti es together with those transparent ones\nthat are onne ted with two double transparent ones form a subgraph\nalled the logarithmi part of the diagram Γ and denoted by Log(Γ).\nTo obtain a log del Pezzo surfa e from a DPN surfa e with a diagram\nΓ of ex eptional urves, we need to ontra t the urves from Log(Γ) and\nDuv(Γ). These graphs des ribe the index 2 and the Du Val singularities\nof the obtained del Pezzo surfa e respe tively. We see that if Γ is a\ndiagram from Table 3 in [AN℄, then for any subgraph D ⊂ Duv(Γ)\nthere is a del Pezzo surfa e with a on\u001cguration of Du Val singularities\ndes ribed by D .\n\n\fEQUATIONS OF LOG DEL PEZZO SURFACES OF INDEX ≤ 2\n\n7\n\nWe know also that the urves from a diagram of ex eptional urves\nof a DPN surfa e Y represent all ex eptional urves on Y . Ex ept the\nases where Pic(Y ) is generated by ≤ 2 elements (this happens only\nwhen Y is isomorphi to P2 , P1 × P1 or some Fn ), these ex eptional\nurves generate Pic(Y) = Num(Y ). This last equation follows from the\nfa t that Y is obtained from P2 , P1 × P1 or some Fn by a sequen e of\nblowing ups. The diagram lifts up to a on\u001cguration of urves on the\nK3 surfa e X in su h a way that the pre-images of double transparent\nand transparent verti es are smooth rational urves on X and the preimages of bla k verti es split up to two disjoint omponents ea h of\nthem being a smooth rational urve on X . The obtained urves are all\nrational urves on X .\nObserve (see [AN, Rem 3.2℄) that it is easy to write down the urve\nCg as numeri ally equivalent to a ombination of verti es of the diagram, as we know the interse tion numbers with ea h of these verti es.\nIndeed if V is a urve represented by a vertex of the diagram, then:\n• Cg .V = 0 if V is represented by a double transparent vertex or\na bla k vertex,\n• Cg .V = 2 − i if V is represented by a transparent vertex and i is\nthe number of interse tion points of V with urves represented\nby double transparent verti es.\n1.\n\nGeneral onstru tion\n\nLet us \u001crst do a general onstru tion that we will use throughout all\nthe paper. We \u001cx the notation from the dis ussion in se tion 0. Let\nDg ⊂ X be the redu tion of the divisor π ∗ Cg . Observe that the urve\nDg is isomorphi to Cg and that π ∗ Cg = 2Dg\nThe aim of the onstru tion is to \u001cnd a natural and easy to des ribe\nmorphism from Z to a weighted proje tive spa e. We will use the\nmorphism given by |Dg | on the K3 surfa e X . First we need to ompute\nsome invariants to onstru t a suitable diagram.\n\nLemma 1.1. The following formulas hold\n1)\n2)\n3)\n4)\n\ndim |Cg | = 3g − 3\nCg2 = 4g − 4\ndim |Dg | = g\nDg2 = 2g − 2\n\nProof. Observe that |2Dg | = |π ∗ (Cg )| and use Riemann-Ro h theorem.\n\u0003\nOn X , we have an involution determined by the overing π , let us\ndenote it by i. This i \u001cxes the urve Dg so, a ts on its linear system.\n\n\f8\n\nGRZEGORZ KAPUSTKA AND MICHA\u008a KAPUSTKA\n\nOne obtains an involution on H 0 (X, OX (Dg )) and so on its proje tivisation Pg . Su h an involution, sin e it is not the identity, is a symmetry\ns with respe t to two disjoint linear subspa es generating Pg (be ause\nit is a symmetry in the asso iated a\u001ene spa e). By de\u001cnition, we have\nthat:\n(1.1)\n\nφ|Dg | ◦ i = s ◦ φ|Dg | .\n\nIn parti ular the image φ|Dg | (X) is symmetri with respe t to s. Sin e\nthe urve Dg is ontained in the \u001cxed part of i, its image φ|Dg | has\nto be ontained in one of the \u001cxed subspa es. But this image spans\na hyperplane H in Pg . Hen e s is a symmetry with respe t to the\nhyperplane H and some point O . We an onsider α : Pg −→ P(1g , 2)\nthe quotient morphism of the symmetry s. Now, we need only to \u001cnd\na morphism to lose the diagram as in the following lemma.\n\nLemma 1.2. There exists a morphism φ su h that the following diagram ommutes:\n\n[[\n[\n[\n^[[\nw\n\nφ|Dg |\n\nX\n\nπ\n\n(1.2)\n\nY\n\nr\n\nw Pg\nα\n\nw P(1 , 2)\n\nwP\n\nu\n\ng\n\nZ\n\nφ\n\nψ\n\ng(g+1)\n2\n\nHere ψ denotes the natural embedding of P(1g , 2) into P\nall monomials of weighted degree 2.\n\ng(g+1)\n2\n\ngiven by\n\nProof. Observe that the urves Ei are also invariant and are not in the\npre-image φ∗|Dg | (H), so they have to map to the point O . We know\nthat the morphism α ◦ φ|Dg | : X −→ P(1g , 2) is invariant under i, so\nit fa tors through π whi h is the quotient morphism of the involution\ni. In a natural way, we have obtained a morphism φ : Y −→ P(1g , 2)\nmaking the diagram ommutative. Observe that:\nπ ∗ ((ψ ◦ φ)∗ (O\n\nP\n\ng(g+1)\n2\n\n(1))) = (ψ ◦ φ ◦ π)∗ (O\n\nP\n\n(ψ ◦ α ◦ φ|Dg | )∗ (O\n\nP\n\ng(g+1)\n2\n\ng(g+1)\n2\n\n(1)) =\n\n(1)) ⊂ |2Dg | = |π ∗ (Cg )|.\n\nBy proje tion formula, we dedu e that ea h element of the system\n(ψ ◦ φ)∗ (O g(g+1) (1)) is numeri ally, thus also linearly (see se tion 0),\nP 2\nequivalent to Cg . This means that the morphism ψ ◦ φ is given by a\nsubsystem of |Cg |. Hen e ψ ◦ φ fa tors through the morphism r that\nonly ontra ts urves F su h that F.Cg = 0.\n\u0003\n\n\fEQUATIONS OF LOG DEL PEZZO SURFACES OF INDEX ≤ 2\n\n9\n\nRemark 1.1. Changing oordinates in Pg to x0 , x1 , .., xg , we an assume\n\nH to be xg = 0 and O the point (0 : 0 : ... : 0 : 1). From now on, we\nmake this assumption.\n\nRemark 1.2. If in Lemma 1.2 we use another urve Cg ∈ | − 2KZ |, the\nmorphism φ will stay un hanged. It is just the bran h lo us of the\nquotient by the symmetry s that hanges. It simply be omes another\nsmooth hypersurfa e of weighted degree 2 in P(1g , 2).\n2.\n\nDel Pezzo surfa es with g = KZ2 + 1 = 2\n\nWe an now pass to the des ription of the \u001crst family of log del\nPezzo surfa es of index ≤ 2. From now on, in this se tion, Z is a del\nPezzo surfa e with g = 2 (i. e. KZ2 = 1). We an formulate the main\ntheorem.\n\nTheorem 2.1.\n1) Let Z be a log del Pezzo surfa e with g = KZ2 + 1 = 2. The map\n\ngiven by the linear system | − 2KZ | is a \u001cnite 2 : 1 morphism onto\na quadrati one Q in P3 . The bran h divisor R of this morphism is\nredu ed and is the interse tion of the one Q with a smooth ubi (the\nmorphism is also bran hed in the vertex of the one). Moreover R is\nnot the interse tion of Q with three planes meeting in a point lying on\nthis one.\n2) Conversely, the normal double overing of a quadrati one Q′ ⊂ P 3 ,\nbran hed over su h an interse tion R′ (it is enough to assume that the\nubi is smooth in the vertex of the one), is a log del Pezzo surfa e of\nindex ≤ 2 with g = 2.\n\nLet us \u001crst prove the following lemma des ribing the singularities\nthat an o ur on a symmetri plane sexti whi h will appear in this\nse tion later.\n\nLemma 2.1. Let K be a redu ed plane sexti , whi h is symmetri with\n\nrespe t to a line H and a point O , and not ontaining the symmetry line\nH , and with at most a double singularity in the enter of symmetry O .\nThen K an have only simple singularities or it the sum of three tangent\noni s. Moreover, if K passes through O , it has at O a singularity of\ntype An with n being an odd number.\nProof. Let us denote the symmetry with respe t to O and H in P2 by\n\ns. Choosing appropriate oordinates, we an assume that\ns : P2 ∋ (x : y : z) 7→ (x : y : −z) ∈ P2 .\n\nWe \u001crst onsider the ase when K passes through O . Suppose that\nK is singular in some point P 6= O . Then it is also singular in its\n\n\f10\n\nGRZEGORZ KAPUSTKA AND MICHA\u008a KAPUSTKA\n\nsymmetri adjoint P ′ = s(P ) with the same multipli ity. Take the line\nL = P P ′. If L is not a omponent of K , then from the Bézout theorem\nthe singularities in P and P ′ have multipli ity at most 2. If L is a\nomponent of K , then K is the sum of L and some quinti K5 , su h\nthat L 6⊂ K5 . From Bézout theorem the singularities in the points P\nand P ′ of K5 have multipli ity at most 2 and L is not any of their\ntangent ones. This means, that the tangent ones to K at P and\nP ′ onsist of at least two lines. From the hara terization of Du Val\nsingularities (see [BPV℄), we dedu e that K has in P and P ′ simple\nsingularities.\nAs we have assumed the singularity of K at the point O is a double\nsingularity hen e is of some type An . To determine this n onsider the\ne −→ P2 bran hed over the sexti K . The surfa e\ndouble overing π2 : X\ne is then a K3 surfa e with Du Val singularities, and a singularity An\nX\ne is given in P(1, 1, 1, 3)\nin the inverse image of O . We an see that X\nwith oordinates x, y, z, t by the equation t2 = F (x, y, z), where F is\nthe equation of K in P2 . Consider the involution P(1, 1, 1, 3) ∋ (x :\ne . In\ny : z : t) 7→ (x : y : −z : t) ∈ P(1, 1, 1, 3), we an indu e it to X\ne . Observe that π2 ◦ ei = s ◦ π2 .\nthis way, we obtain an involution ei on X\ne . It is a K3 surfa e. The\nConsider the minimal resolution X of X\ne\ninvolution ei on X lifts up to an involution i on X in su h a way that\nthe inverse image on X of the symmetry point is a graph of urves of\ntype Af whi h preserved by the involution.\nLet us look how i a ts on the graph Af . This graph is obtained from\ne\nX as the graph of ex eptional divisors of su essive blow ups and ea h\nblow up lifts the involution ei. In this way all urves from the graph\nare preserved by the involution i and the \u001crst one is \u001cxed. From the\ndes ription of involutions on K3 surfa es (see se tion 0) the \u001cxed lo us\nof i is a smooth urve. In parti ular i annot have isolated \u001cxed points\nand no two \u001cxed urves from the graph interse t. Moreover as the\ngraph Af of ex eptional urves does not interse t any \u001cxed urve not\nfrom this graph, every \u001cxed point in this ex eptional lo us has to lie\non a \u001cxed urve from the graph. Now it is enough to observe that, if a\nurve is preserved by the involution, then this involution indu ed on it\nis either the identity or has exa tly two \u001cxed points. This means that\nevery se ond urve from the hain Af is \u001cxed by i and that the urves\nat both ends of the hain are \u001cxed. By this last argument, we see that\nwe had to blow up an odd number of times.\nIf K does not pass through O , then we an use [HW℄.\n\u0003\nLet us pass to the proof of the theorem.\n\n\fEQUATIONS OF LOG DEL PEZZO SURFACES OF INDEX ≤ 2\n\n11\n\nProof of Theorem 2.1.\n\n1) We do the general\n\nonstru tion des ribed in the previous se tion\nand keep the notation \u001cxed there. We will \u001crst des ribe the morphism\ngiven by |Cg | = r ∗ (| − 2KZ |) on the DPN surfa e Y (after that, we will\nfa tor it through r ).\nWe have g = 2 and D2 is a smooth urve of genus 2 (hen e it is\nhyperellipti ) on a K3 surfa e. From [SD, 5.1℄ this urve gives a 2 : 1\nmorphism to P2 bran hed over a redu ed sexti with Du Val singularities. We denote this urve by R6 . This R6 has to be symmetri\nwith respe t to H and O , be ause from the property 1.1, we have\n−1\nφ−1\n|D2 | (p) = i ◦ φ|D2 | (s(p)) and i is a bije tion. Sin e the pullba k to X\nof the line H = {z = 0} is |D2 | (it is smooth of genus 2), the sexti R6\nhas to ut H transversely. In parti ular, it annot have any singularity\non H . The diagram from Lemma 1.2 takes the form.\nφ|D\n\n|\n\n2\nX −−−→\nP2\n2:1\n\n\n\n\nπy\nα\ney\n\nY −−−→ P3\nψ◦φ◦r\n\nHere α\ne := ψ ◦ α : P2 −→ P3 is given by (x20 : x21 : x0 x1 : x22 ), thus its\nimage is a quadri one Q. Observe that the bran h divisor of the map\nψ ◦ φ ◦ r is the image by α\ne of the sexti R6 .\nWe laim that this bran h divisor is a redu ed interse tion of the\none Q with a smooth ubi .\nIndeed, let F be the equation of R6 in P2 . The equation F ◦ s also\nde\u001cnes R6 so F ◦s = F or F ◦s = −F sin e F ◦s◦s = F . Now F ◦s = −F\nis impossible be ause the \u001cxed line of the symmetry s annot be a\nomponent of R6 (as R6 is redu ed and symmetri of degree 6). We\nhave F ◦ s = F so F (x0 , x1 , x2 ) = G(x20 , x21 , x0 x1 , x22 ) where G(t, u, v, w)\nis a homogenous equation of degree 3. We know that R6 an have only\na singularity An in the symmetry point (0 : 0 : 1) so G de\u001cnes a variety\nin P3 smooth in the point (0 : 0 : 0 : 1). Moreover, we an hoose G to\nde\u001cne a smooth ubi in P3 , by adding a degree 3 polynomial divisible\nby (v 2 − tu) (the generi element of this system will be good sin e its\ninterse tion with the one is redu ed).\nComing ba k to the proof of the theorem, we have proved that the\nmorphism ψ ◦ φ ◦ r is a morphism of degree 2 onto a one Q with\nbran h divisor being the interse tion of Q with a smooth ubi R.\nMoreover from the proof of Lemma 1.2 (ψ ◦ φ ◦ r)∗ (OP3 (1)) ⊂ |C2 |.\n\n\f12\n\nGRZEGORZ KAPUSTKA AND MICHA\u008a KAPUSTKA\n\nFrom Lemma 1.1 dim |C2 | = 3. This means that these systems have\nthe same dimension, hen e are equal. Finally\n\nψ ◦ φ ◦ r = φ|Cg | = φr∗ |−2KZ | .\nThis morphism ontra ts only the urves F su h that F.Cg = 0. Thus\nthe morphism ψ ◦ φ is equal to φ|−2KZ | , and it is a \u001cnite 2:1 morphism\nonto the one Q bran hed in Q ∩ R and the vertex of the one.\nSin e Pic(Q) has no torsion, the normal double overing of Q is\nuniquely determined by its bran h divisor. Hen e Z is isomorphi to\nthe normal double overing of the one Q bran hed in the interse tion\nof Q with a smooth ubi R. The last assertion of 1) follows now from\nthe fa t that the normal double overing of a one bran hed over the\ninterse tion of this one with three hyperplanes meeting at a point on\nit, has an ellipti singularity (see [HW℄). Thus it annot be isomorphi\nto Z .\n\n2) To prove the se ond part, we repeat the same reasoning re onstru ting it ba kwards. We will use analogous notation for analogous\nobje ts but with added primes. Let Z ′ ,Q′ ,R′ be surfa es as in part 2)\nof the theorem. Let H1 be a hyperplane in P3 that uts transversely\nthe interse tion urve of the one Q′ with the ubi R′ . We an hoose\noordinates t′ , u′ , v ′ , w ′ in P 3 in su h a way that H1 = {w ′ = 0} and\nthe point (0 : 0 : 0 : 1) is the vertex of the one Q′ . Take the normal\ne′ : P2 ∋ (x′ , y ′, z ′ ) 7→ (x′2 , y ′2, y ′ z ′ , z ′2 ) ∈ Q′ ⊂ P3 of\ndouble overing α\nthe quadri one Q′ (that is P(1, 1, 2) ) bran hed over the interse tion\nof Q′ with H1 (that is over a degree 2 hypersurfa e in P(1, 1, 2)). The\ninverse image of this interse tion is a redu ed plane sexti R6′ symmetri with respe t to the overing involution s′ (whi h has to be the\nsymmetry with respe t to a line and a point). This R6′ uts transversely\nthe \u001cxed line H ′ of this involution and has a singularity of multipli ity\n≤ 2 in the enter of symmetry O ′ (the inverse image of the vertex of\nthe one).\nBy Lemma 2.1 R6′ must have Du Val singularities. The desingularization of the double overing of P2 bran hed over the sexti R6 is a K3\nsurfa e X ′ . In the same way as in the proof of Lemma 2.1, we obtain\nan involution i′ on X ′ .\nThe inverse image of the \u001cxed line H ′ is ontained in the \u001cxed part\nof the involution i′ and sin e R6′ uts H ′ transversely it is a urve of\ngenus 2 (this is a double overing of P1 bran hed in 6 points). Sin e the\n\u001cxed lo us of an involution on a K3 surfa e has onstant dimension,\nthe \u001cxed lo us of i′ is of odimension 1 in X . This implies that i′ has to\nbe a non-symple ti involution of ellipti type. So using [AN, thm 2.1℄\n\n\fEQUATIONS OF LOG DEL PEZZO SURFACES OF INDEX ≤ 2\n\n13\n\nthe quotient of X ′ by this involution is a right DPN surfa e of ellipti\ntype. Contra ting all ex eptional urves from LogΓ(Y ) and DuvΓ(Y )\n(see [AN, thm 4.1℄), one obtains a log del Pezzo surfa e Z ′′ of index 2\nwith KZ2 ′′ = 1.\nThe normal surfa e Z ′′ is a double overing of the one Q′ bran hed\nalong the interse tion of Q′ with the ubi R′ , so it is isomorphi to Z ′ .\nThus Z ′ is itself a log del Pezzo surfa e of index ≤ 2 and g = 2.\n\u0003\n\nRemark 2.1. Du Val in [DVa℄ onsidered the double overing of a one\n\nbran hed over the vertex and the interse tion of this one with a smooth\nubi not passing through the vertex. He determines the types of singularities that arise in this way (Du Val singularities). Here, we have a\nsituation a bit more general. In our ontext the ubi an pass through\nthe vertex of the one. The ase where it does pass gives rise to a\nlittle more ompli ated singularity (of index 2) that we an determine\nexa tly in the following way.\nAs we know from [AN℄ (see se tion 0), the only singularities of index\n2 are of type Kn . Hen e, we need to determine n. We an do this as\nfollows.\nThe minimal resolution of the one Q is the ruled surfa e F2 . We\nan easily ompute that the pullba k of the ubi (passing trough the\nvertex of the one) is then an element L ∈ |6f + 2C| (where C is the\nex eptional urve and f a \u001cber) that has neither multiple omponents\nnor C as a omponent. Now, if ne essary by resolving the singularity\nof L on C , we \u001cnd n.\nThe following theorem gives a des ription of log del Pezzo surfa es of\nindex ≤ 2 and with g = 2 in terms of equations in weighted proje tive\nspa e.\n\nTheorem 2.2.\n1) Let Z be a log del Pezzo surfa es of index ≤ 2 with g = 2. Then Z is\nisomorphi to a hypersurfa e in P(1, 1, 2, 3) (with oordinates x, y, z, t)\nde\u001cned by an equation F of degree 6 of the form\nF (x, y, z, t) = t2 − G(x, y, z) = 0\n\nwhere the urve in P2 (with oordinates a,b, ) given by the equation\nG(a, b, c2 ) is redu ed, has at most a double singularity in (0, 0, 1) and\nis not the sum of three tangent oni s.\n2) Conversely ea h hypersurfa e Z ′ in P(1, 1, 2, 3), de\u001cned by an equation as above is a log del Pezzo surfa e of index ≤ 2 with g = 2.\nProof. First let us prove that the hypersurfa e in P(1, 1, 2, 3), de\u001cned\n\nby the equation F is normal.\n\n\f14\n\nGRZEGORZ KAPUSTKA AND MICHA\u008a KAPUSTKA\n\nWe know that F de\u001cnes a hypersurfa e with isolated singularities.\nA ording to [IF℄ it is enough he k normality in the singular points of\nP(1, 1, 2, 3). But P(1, 1, 2, 3) has only two singularities (0 : 0 : 0 : 1),\n(0 : 0 : 1 : 0) and sin e we have F (0, 0, 0, 1) 6= 0, it is enough to he k\nthat this hypersurfa e is normal in (0 : 0 : 1 : 0). This point is obtained\nas a quotient of the du Val singularity t2 − G(x, y, 1) = 0 (in the a\u001ene\npie e z = 1) by the a tion of Z2 (the symmetry trough (0, 0, 0)). Sin e\nthis a tion lifts to the universal overing of the du Val singularity, the\npoint (0, 0, 1, 0) is a quotient singularity. Hen e, a ording to [B℄, it is\nnormal.\nTo \u001cnish the proof, we use Theorem 2.1 and the fa t that the normal\ndouble overing of a quadri one is uniquely determined by its bran h\ndivisor.\n\u0003\n\nRemark 2.2. We an determine the main invariants (g , k, δ ) of the\n\nobtained del Pezzo surfa e Z ′ from the geometry of the sexti (G = 0)\nin P2 .\nWe have g = 2.\nIf the sexti {G = 0} has a double point of type Af in the symmetri\npoint, then from Lemma 2.1 f = 2l + 1. Moreover, as we ould see\nin the proof of this lemma l is the number of rational urves in the\n\u001cxed lo us of the involution on the orresponding K3 surfa e X , that\nis l = k .\nTo ompute the invariant δ , we resolve the singularities of the sexti\n{G = 0} and form a diagram of ex eptional urves on X . Next, we\nompute δ from the de\u001cnition. That is, we he k how the obtained\nex eptional urves interse t D2 + π −1 (E1 ) + * * * + π −1 (Ek ). Sin e we\nhave obtained the diagram of ex eptional urves, we an also look at\n[AN, table 3℄.\n3.\n\nDel Pezzo surfa es with g = KZ2 + 1 = 3\n\nIn this se tion Z is a log del Pezzo surfa e of index ≤ 2 with g = 3.\nAs the main result, we get the following theorem whi h gives us a\ndes ription of all su h surfa es.\n\nTheorem 3.1.\n1) Let Z be a log del Pezzo surfa e of index ≤ 2 and with g = 3. Then\nZ is isomorphi to one of the following:\n(a) a hypersurfa e of degree 8 in P(1, 1, 4, 4) (with oordinates x,\ny , z , t) given by an equation of the form t2 = G(x, y, z) where\nthe equation G(a, b, c4 ) = 0 de\u001cnes in P2 (with oordinates a, b,\n\n\fEQUATIONS OF LOG DEL PEZZO SURFACES OF INDEX ≤ 2\n\n15\n\nc) a redu ed o ti with simple singularities whi h does not pass\nthrough the point (0 : 0 : 1).\n(b) a hypersurfa e of degree 4 in P(1, 1, 1, 2) given by an equation\nF (x, y, z, t) = 0 where {F (a, b, c, d2) = 0} is a quarti in P4\n(with oordinates a, b, c, d) with ADE singularities.\n2) Conversely, every surfa e des ribed by equations as in above ases\nis a log del Pezzo surfa e of index ≤ 2 with g = 3.\n\nProof. Let Z be a log del Pezzo surfa e of index ≤ 2 with g = 3. Using\n\nthe Lemma 1.2, we get the ommutative diagram 1.2. A ording to\n[SD, 4.1℄, we have two possibilities. The morphism given by the linear\nsystem |D3 | is:\n• either birational to a quarti with Du Val singularities in P3 (it\nis alled the non-hyperellipti ase)\n• or 2:1 to a quadri in P3 (it is alled the hyperellipti ase)\nMoreover, we know that the image φ|D3 | (X) is symmetri . We shall\nseparately onsider the two ases.\nThe non-hyperellipti ase - We an see in this ase, that the\nquarti does not have any singularity on the hyperplane of symmetry.\nThen φ from Lemma 1.2 is a \u001cnite birational morphism to the quotient of the quarti φ|D3 | (X) by the symmetry. Sin e this quarti is\nirredu ible, using a similar argument as in the proof of Theorem 2.1\nwe see that its equation is also symmetri . Hen e, its quotient is given\n(after a suitable hange of oordinates) by an equation in P(1, 1, 1, 2)\nas in ase (b) of the theorem. To prove that φ is an isomorphism, we\nneed only to remark that the quotient of the quarti is normal. This is\nbe ause the only singularity that is not Du Val appears as a quotient\nof a Du Val singularity, and this gives a quotient singularity (see proof\nof Theorem 2.2).\n\nThe hyperellipti ase - A priori, we have two sub- ases:\nThe quadri is smooth. Then the enter of symmetry must\n\nlie\noutside the quadri and taking the quotient, we get an equation of\ndegree 2 in P(1, 1, 1, 2) not vanishing at the point (0 : 0 : 0 : 1),\nthat is an equation of a surfa e isomorphi to P2 . And φ from the\nLemma 1.2 is a 2:1 morphism to this surfa e. In this ase Z an\nhave only Du Val singularities (as the bran h lo us of φ is lo ally\nisomorphi to the bran h lo us of the morphism given by |D3 |, i.e.\nhas simple singularities). We an then obtain Z as a double overing\nof P2 bran hed over a quarti with simple singularities, that is ase (b)\nfrom the theorem, but, in fa t we will see in Remark 4.2, that this ase\nnever o urs.\n\n\f16\n\nGRZEGORZ KAPUSTKA AND MICHA\u008a KAPUSTKA\n\nThe quadri is a one. It is then isomorphi to P(1, 1, 2). Let\nus denote this one by Q. The image of the urve D3 is a hyperplane\ne (it is smooth rational urve). But D3 is\nse tion of Q hen e a oni D\na smooth urve of genus 3, so the restri tion of the map given by |D3 |\ne bran hed in 8 distin t points.\nto it, is a double overing of the oni D\nMoreover the generi ray of the one Q is the image of an ellipti urve,\nso the map, restri ted to it, is bran hed in 4 distin t points. This gives\nus the bran h lo us to be a symmetri urve R8 with only Du Val\nsingularities, whi h is the interse tion of the one with a quarti (i.e.\na urve of degree 8 in P(1, 1, 2)). The points of interse tion of this\nurve with a generi ray is a symmetri on\u001cguration of four points.\nSu h on\u001cguration on a generi ray does not have any point lying on\ne (as R8 uts D\ne in 8 points) so do not ontain the enter of\nthe oni D\nsymmetry (that is the vertex of the one). Thus the bran h lo us does\nnot pass through the vertex of the one. After taking the quotient\nby the symmetry, we get φ to be a 2:1 morphism to P(1, 1, 4) with\nbran h lo us whi h is a urve of degree 8 that does not pass through\ne in P(1, 1, 4, 4) given\nthe point (0:0:1). Let us onsider the variety Z\nby the equation as in ase (a) from the assertion, with G de\u001cning the\nbran h lo us R8 . To prove that we are in this ase (a), we need to\ne. As Z and Ze have a 2:1 morphism\nprove that Z is isomorphi to Z\nonto P(1, 1, 4) with the same bran h lo us, it is enough to prove that Ze\nhas only quotient singularities, hen e is normal. The only singularities\ne are:\nof Z\n-The singularities of the bran h lo us - they are Du Val be ause the\nbran h lo us has only simple singularities and do not pass through the\nsingular point (0 : 0 : 1),\n- and the points in the pre-image (by the proje tion) of the singularity\non the base - but the proje tion is a lo al (analyti ) isomorphism of\ntheir neighborhood with the singularity of P(1, 1, 4) that is of type\n1\n(1, 1).\n4\nThis shows that we are in ase (a) of the theorem and ompletes the\nproof of the \u001crst part.\nFor the onverse let us take a surfa e des ribed in one of the ases\n(a), (b). We an he k by adjun tion formula that they are del Pezzo\nsurfa es (we have already he ked that they are normal). The only\nthing we need to prove is their type of singularities (index ≤ 2). We\nhave omputed that in ase (a) where the only non Du Val singularities\nare 14 (1, 1) that is of type K1 .\nIn ase (b) all singularities are Du Val ex ept the singularity in the\npoint (0:0:0:1) that is the quotient by the symmetry s of the singularity\n\n\fEQUATIONS OF LOG DEL PEZZO SURFACES OF INDEX ≤ 2\n\n17\n\nof the quarti given by the equation {F (a, b, c, d2 ) = 0} in the point\n(0:0:0:1). To prove that it is of type Kn , we need to prove that above\nquarti has a A2n+1 singularity in this point. This is a onsequen e of\nthe following lemma:\n\nLemma 4. If S is a surfa e in Pm with ADE singularities symmetri\n\nwith respe t to a point O (and a hyperplane) and singular in this point,\nthen it has a singularity A2n+1 in O .\n\nProof of lemma. Observe that resolving the singularities of S (by blowing up step by step) we an extend the symmetry to an involution on\nthe desingularization Se of S . This involution preserves the on\u001cguration of urves obtained as the pre-image of our point O . Moreover the\ninvolution indu ed on this on\u001cguration of urves has no isolated \u001cxed\npoints. Moreover it preserves one of its urves (the \u001crst ex eptional\ndivisor). We an see that from all ADE on\u001cgurations only A2n+1 an\nhave su h an involution. Indeed:\nIf the on\u001cguration is of type Ak then the involution preserves\nea h of the urves in the diagram. So ea h urve has at least two\n\u001cxed points on it. Moreover ea h urve is either \u001cxed (made of \u001cxed\npoints) or it interse ts exa tly two \u001cxed urves, and no two \u001cxed urves\ninterse t ea h other. Finally we get that k is odd.\nIf the on\u001cguration is of type Dk or Ek , let us onsider the urve\nthat uts three other urves (let us all it L). It has to be preserved\nby the involution. So it is \u001cxed or uts at exa tly two \u001cxed urves.\nIf it was \u001cxed then, all urves utting it would be preserved by the\ninvolution and not \u001cxed. But, one of them does not interse t any other\nurves ex ept L, so it has to be \u001cxed. This gives a ontradi tion. If\nit uts two \u001cxed urves then the third urve utting L also has to be\npreserved by the involution so it gives a third \u001cxed point on L. So L\nis \u001cxed and we get a ontradi tion.\nThis ends the proof of the lemma and in onsequen e the theorem.\n\u0003\nRemark 4.1. All ases of above theorem belong to the same family\n\nof omplete interse tions of hypersurfa es of degree 2 and 4 in the\nproje tive spa e P(1, 1, 1, 2, 2).\n\nRemark 4.2. We an observe that the hyperellipti\n\nase with smooth\nimage, from the proof of the theorem, never o urs. This is be ause it\nwould be an index 1 ase. In this ase ψ ◦ φ = φ|−2KZ | (see the proof\nof orollary 4.1). By using [HW℄, we then on lude, that in the index\n1 ase with g = 3 the system | − 2KZ | is very ample.\n\n\f18\n\nGRZEGORZ KAPUSTKA AND MICHA\u008a KAPUSTKA\n\nIn other words, any del Pezzo surfa es of index 1 an also be obtained as a double overing of P2 bran hed over a quarti urve, but\nby our onstru tion, it will be mapped dire tly onto a quarti surfa e\nin P(1, 1, 1, 2).\n\nRemark 4.3. Case (a) of Theorem 3.1 is the only example in the list of\n\ndel Pezzo surfa es from [AN℄ (it has number 25 in Table 3), with two\nindex 2 singularities. Case (b) of this theorem overs all other ases\nof del Pezzo surfa es of index 2 with g = 3. Gorenstein surfa es are\nrepresented by quarti s not passing through the point (0 : 0 : 0 : 1),\nwhile quarti s passing through this point have in this point their only\nindex 2 singularity.\nOn the other hand, Theorem 3.1 an be reformulated in the following\nway:\n\nCorollary 4.1. We have one of the following morphisms from Z to a\n\nproje tive spa e:\n(a) a 2 : 1 morphism onto the one in P5 , over the rational normal\nquarti urve in P4 , bran hed over the interse tion of this one\nwith a quadri not passing through its vertex,\n(b) an isomorphism given by | − 2KZ | to a omplete interse tion\nin P6 of a one over the Veronese surfa e with a (nonsingular)\nquadri .\nProof. The orollary follows from Theorem 3.1 by omposing our map\n\nφ from Lemma 1.2 with the embedding ψ .\nFrom the proof of Lemma 1.2 we have that (ψ◦φ◦r)∗ (OP3 (1)) ⊂ |C3 |.\nMoreover, by Lemma 1.1, the system |C3 | is of dimension 6 whi h is\nequal to the dimension of the spa e spanned by the image (ψ ◦φ◦r)(X)\nin ase (b). This means, that in this ase ψ ◦ φ = φ|−2KZ | .\nCase (a) from Theorem 3.1 leads dire tly to ase (a) in above orollary.\n\u0003\n\nRemark 4.4. From the above we dedu e that in ase (b) of Theorem\n\n3.1, the linear system | − 2KZ | is very ample. In ase (a) this reasoning\ndoesn't work, nevertheless in this ase we an also prove that | − 2KZ |\nis very ample. We prove that as follows. We an see that Z is a normal\nhypersurfa e of degree 8 in P(1, 1, 4, 4). Then by adjun tion formula\n| − 2KZ | = OP(1,1,4,4) (4)|Z . We know that the latter is very ample.\n5.\n\nHigher genus ases\n\nIn this se tion we work out the remaining ases, still using the same\nmethod. The basi result is the following theorem about the morphism\ngiven by the system | − 2KZ | on Z .\n\n\fEQUATIONS OF LOG DEL PEZZO SURFACES OF INDEX ≤ 2\n\n19\n\nTheorem 5.1. If Z is a log del Pezzo surfa e of index ≤ 2 with KZ2 ≥ 3\n\nthen | − 2KZ | gives an isomorphism onto the image.\n\nLet us \u001crst prove some lemmas that will be important in the further\ndis ussion.\n\nLemma 5.1. If S is a smooth rational normal s roll of degree d and\ndimension n in Pn+d−1 invariant under a symmetry with respe t to a\npoint O (and some hyperplane), then S is a quadri hypersurfa e not\npassing through O .\n\nProof. Suppose that S is a smooth s roll whi h is symmetri with re-\n\nspe t to a point O . By utting S with n−d generi hyperplanes passing\nthrough O , we redu e the problem to S being a rational normal urve\nof degree d in Pd .\nIf S is a symmetri rational normal urve o degree d in Pd , then a\ngeneri hyperplane H passing through O uts S in a symmetri on\u001cguration of d points that span this hyperplane. The only possibility for\nthis to happen is that d = 2 and O does not lie on S .\n\u0003\n\nLemma 5.2. The ideal of a symmetri variety V is generated by symmetri elements.\nProof. For ea h n let us onsider the linear system of hypersurfa es of\n\ndegree n ontaining V . This is a proje tive spa e with an involution\non it (given by the symmetry preserving V ). But an involution on a\nproje tive spa e is a symmetry. To \u001cnish the proof it is enough to\nobserve that the \u001cxed points of any symmetry on a proje tive spa e\ngenerate this spa e.\n\u0003\nLet us pass to the proof of the theorem.\n\nProof of Theorem 5.1. Using Lemma 1.2, to prove the \u001crst statement\n\nit is enough to he k that the map φ|Dg | is birational and dedu e that φ\nis an isomorphism onto its image. Next by omparing dimensions as in\npre eding theorems we obtain, that φ is given by the system | − 2KZ |.\nSuppose that |Dg | is hyperellipti . Sin e Dg have genus > 3 a ording to [SD, th.5.7℄ we have three possibilities for the morphism given\nby this system:\n• It is a double overing of a smooth entrally symmetri rational\nnormal s roll of degree g − 1 in Pg . This is impossible be ause smooth\ns rolls of odimension 2 are never entrally symmetri (see Lemma 5.1)\n• It is a double overing of a one over a twisted ubi . In this ase\ng = 4 and |D4 | = |3E + 2Γ1 + Γ2 | where E is an ellipti urve and\nΓ1 , Γ2 are smooth and rational urve su h that E.Γ1 = Γ1 .Γ2 = 1.\n\n\f20\n\nGRZEGORZ KAPUSTKA AND MICHA\u008a KAPUSTKA\n\nThe involution on the K3 surfa e X has to preserve the urves Γ1 , Γ2\n(be ause it preserves the system, the ellipti urve E and the inverse\nimage of the vertex of the one) and restri ted to them annot have\nisolated \u001cxed points (as Dg .Γi = 0 for i = 1, 2). This is impossible\nbe ause on ea h of these two urves there have to be at least two \u001cxed\npoints, but two \u001cxed urves annot interse t.\n• It is a double overing of a one over a twisted quarti . In this\nase g = 5 and |D5 | = |4E + 2Γ| where E is an ellipti urve and Γ is a\nsmooth rational urve su h that E.Γ = 1. Then the map given by D5\nan be extended to a map φ\ne on the desingularization of the one, that\nis the s roll F4 . The map φ\ne has to be bran hed over the ex eptional\nse tion e of the s roll (as its inverse image on the K3 surfa e X is\nan irredu ible −2 urve). Moreover we know that the bran h lo us of\nthis map has to ut the generi line from the ruling of the s roll in\na on\u001cguration of 4 points symmetri with respe t to the 2 points of\ninterse tion of this line with the se tion e and the image of D5 . It also\nuts D5 in 12 points. These statements together give us a ontradi tion\nbe ause the generi line of the ruling does not pass through any of\nthese 12 points, so the on\u001cguration of the three remaining points on\nthe generi line annot be symmetri .\n\u0003\nWe an know pass to a deeper analysis of parti ular ases onsidered\nin this se tion.\n\nTheorem 5.2.\n1) If Z is a log del Pezzo of index ≤ 2 with g = KZ2 + 1 = 4, it is\n\nisomorphi to a omplete interse tion in w.p.s. P(1, 1, 1, 1, 2) ⊂ P10\n(with oordinates x, y, z, t, u) de\u001cned by polynomials F, G of weighted\ndegree 2 and 3 respe tively, su h that the variety in P4 (with oordinates\na, b, c, d, e) given by equations F (a, b, c, d, e2 ) = 0, G(a, b, c, d, e2 ) = 0\nhas only Du Val singularities lying outside the hyperplane {e = 0}.\n2) Conversely every su h omplete interse tion is a log del Pezzo surfa e of index ≤ 2.\nProof. After the above dis ussion the proof of Theorem 5.2 is straight-\n\nforward. It is enough to observe (using [SD, 6.5.3℄) that the morphism\ngiven by D4 is birational onto the omplete interse tion of a symmetri\nquadri and a symmetri ubi in P4 . We then take the quotient by\nthis symmetry and \u001cnish the proof.\n\u0003\n\nRemark 5.1. From Lemma 5.1 we dedu e that the log del Pezzo surfa e\nobtained in Theorem 5.2 has an index 2 singularity if and only if the\nquadri given by F (a, b, c, d, e2 ) = 0 is singular. If this quadri is\nsmooth, then Z is isomorphi to a ubi surfa e in P3 .\n\n\fEQUATIONS OF LOG DEL PEZZO SURFACES OF INDEX ≤ 2\n\n21\n\nRe all (see [HW℄) that, if Z is of index 1 (Gorenstein) and g ≥ 5,\nthen it is isomorphi to an interse tion of (g−1)(g−4)\nhypersurfa es of\n2\ng−1\ndegree 2 in P . In the next theorem we deal with the ases of index\n= 2.\n\nTheorem 5.3. If Z is a log del Pezzo surfa e of index = 2 and with\nKZ2 ≥ 4, then the image φ|−2KZ | (Z):\n\n(a) is a one over a rational normal quarti in P5 ,\n(b) is ontained in a threefold one over the image by the double\n\nVeronese embedding of a rational normal s rollar surfa e,\n\n( ) is ontained in a threefold one over the image of the quadruple\nVeronese embedding of P2 in P14 .\n\nProof. Observe that by [SD, th.7.2℄ we know that the ideal I of the\n\nimage φ|Dg | (X) is generated by elements of degree 2 and 3. Sin e\nthe index 2 singularity an appear only if φ|Dg | (X) passes through the\nenter of symmetry O all quadri s and ubi s generating the ideal have\nto pass through O and by Lemma 1.1 have to de\u001cne symmetri varieties.\nThe only possibility that a quadri Q is symmetri with respe t to a\npoint lying on it is that Q is a one. Following [SD℄ let us denote\nthe variety given by all elements of degree 2 in I by T|Dg | . Naturally\nφ|Dg | (X) ⊂ T|Dg | . A ording to [SD℄ and taking into a ount that T|Dg |\nhas to be symmetri we have two possibilities:\n\n• either φ|Dg | (X) = T|Dg |\n• or T|Dg | is a threefold one\n\nIn the \u001crst ase φ|Dg | (X) has to be a\n\none with Du Val singularities (in parti ular isolated). Hen e, it has only one singularity, that is\nthe one in the vertex of the one. It has to be a singularity A1 sin e\nthe ex eptional urve of the blowing up of an irredu ible one is irredu ible. Therefore Z is a one with a singularity K1 in the vertex.\nUsing [AN, table 3℄ we get that the DPN surfa e Y is isomorphi to\nF4 . By ontra ting the ex eptional se tion we obtain Z to be the one\nover a rational normal quarti as in ase (a) of the theorem.\nIn the se ond ase following [SD℄ and taking into a ount that\nT|Dg | is a one we obtain that T|Dg | has to be one of the following:\n- a one over a rational normal s rollar surfa e\n- a one over the Veronese surfa e\nThis proves the theorem sin e after taking the quotient by the symmetry above ases pass to ases (b) and ( ) from the assertion respe \u0003\ntively.\n\n\f22\n\nGRZEGORZ KAPUSTKA AND MICHA\u008a KAPUSTKA\n\nAs a onsequen e of the proof of above theorem we get the following\norollary.\n\nCorollary 5.1. If Z is a log del Pezzo surfa e of index = 2 with g =\nKZ2 + 1 ≥ 4, then it is isomorphi to a surfa e in P(1g , 2) generated by\nequations of degree 2 and 3.\n\nIn the following theorem we write ase ( ) from Theorem 5.3 in\nterms of equations in a weighted proje tive spa e in a di\u001berent and\nmore pre ise way.\n\nTheorem 5.4.\n1) If Z is a log del Pezzo surfa e orresponding to ase ( ) of the\n\nTheorem 5.3, then Z is isomorphi to a surfa e in P(1, 1, 1, 4) given by\nan equation F5 su h that F5 (a, b, c, d4 ) = 0 de\u001cnes a surfa e of degree 5\nin P3 (with oordinates a, b, c, d) with ADE singularities and smooth\nin the point (0 : 0 : 0 : 1).\n2) The onverse statement is also true.\nProof. In this ase, the morphism φ|D6 | : X −→ P6 is birational onto\n\nits image, that is ontained in a one over the Veronese surfa e. This\nmeans that φ|D6 | (X) is a K3 surfa e with Du Val singularities lying on\na one over the Veronese surfa e (that is in P(1, 1, 1, 2)). Hen e it is a\nhypersurfa e of degree 5 in P(1, 1, 1, 2). Let us denote its equation by\nFe5 . Observe that the surfa e S , given in P3 (with oordinates a, b, c,\nd) by the equation Fe5 (a, b, c, d2 ) = 0, is normal as it is a hypersurfa e\nwith isolated singularities. The singularity of this surfa e in the point\n(0 : 0 : 0 : 1) is thus a normal double overing of a Du Val singularity\nbran hed in one point, hen e it is a Du Val singularity (or it an be\nsmooth). From Lemma 4 we dedu e that S is either smooth in (0 :\n0 : 0 : 1) or has there an A2n+1 singularity. The latter is impossible,\nsin e the quotient of an A2n+1 singularity by a entral symmetry is of\ntype Kn (that is not ADE). We dedu e that S is smooth in the point\n(0 : 0 : 0 : 1) and has only Du Val singularities outside.\nWe know from 1.1 that φ|D6 | (X) is irredu ible and symmetri with\nrespe t to the symmetry se: P(1, 1, 1, 2) ∋ (x : y : z : t) 7→ (x : y : z :\n−t) ∈ P(1, 1, 1, 2). In the same way as in theorems 2.1 and 3.1 this\nindu es that Fe5 is of the form F5 (x, y, z, t2 ). By taking the quotient by\nthe symmetry s, we obtain the \u001crst part of the theorem.\nThe onverse statement is a onsequen e of the adjun tion formula\n\u0003\nand the normality of above equations.\n\nRemark 5.2. From the above theorem we dedu e, that all surfa es orresponding to ase (c) of Theorem 5.3 have a K1 singularity.\n\n\fEQUATIONS OF LOG DEL PEZZO SURFACES OF INDEX ≤ 2\n\n23\n\nRemark 5.3. To distinguish between ases (a), (b) and ( ) from Theorem 5.3, we an use [SD℄ on e more.\nCase (a) is well des ribed and isolated. It is the only ase where\ng = 10. In table 3 of [AN℄ it has number 11\nCase (b) orresponds to the ase where there exists an ellipti pen il\n|E| on the K3 surfa e X su h that E.Dg = 3 (it means that we are in\nthe trigonal ase, i. e. the urve Dg is trigonal).\nCase ( ) orresponds to the ase where Dg is isomorphi to a plane\nquinti . In this ase g = 6 and |D6 | = |2B + Γ| where B is some urve\nof genus 2 and Γ a rational urve su h that B.Γ = 1.\nLet us see whi h of the ases from [AN, table 3℄ orresponds to ase\n(b) and ( ). To do this we he k all diagrams with k>0 and g = 6\ntogether with all diagrams that we obtain by hoosing subgraphs of\nabove ones. We see that, ex ept in ase 15, in all these ases there is\nalways one of the on\u001cguration of urves written below.\n(i)\n\n1\n1\n\n❝ 1❝\n\n❝\n❅\n❅❝\n1\n\n(iv)\n\n(v)\n\n❅\n❅1❝\n\n... ❝\n1\n\n1 ❝\n\n(ii)\n(iii)\n\n❝\n\n1\n\n. . . 1❝\n\n❅\n❅2❝ 2❝\n1 ❝\n\n...\n\n2❝\n\n❝1\n\n❅\n❅ ❝1\n\n1\n\n❝ 2❝ 3❝ 4❝ 3❝ 2❝ 1❝\n2❝\n\n2\n\n❝ 4❝ 6❝ 5❝ 4❝ 3❝ 2❝ 1❝\n3❝\n\n1❝\n\n2❝\n\n3❝\n\n2❝ 1❝\n\n2❝\n1❝\n\nWe wrote those on\u001cgurations of urves with some multipli ities, so\nthat they generate an appropriate linear system. We he k that the\nlinear systems of ea h of these on\u001cgurations of urves with hosen\nmultipli ities is an ellipti pen il on X (we do it by interse ting it with\nea h of its omponents and getting always zero). In all above ases, we\nan hoose these on\u001cgurations so that E.Cg = 3.\n\n\f24\n\nGRZEGORZ KAPUSTKA AND MICHA\u008a KAPUSTKA\n\nIn ase 15 for ea h of the diagrams (there is one main diagram but\nthere are also diagrams generated by subgraphs), using the method\ndes ribed at the end of se tion 0, we an write the system |Dg | as\n|2B + Γ|. For example in the ase represented by the full diagram we\nwrite |Dg | in the following way:\n8❝ 6❝ 4❝ 2❝\n❝ ❝ 10\n5 ❝ ❝ ❝ ❝\n8 6 4 2\n\n=\n\n❝\n\n+2\n\n×\n\n4❝ 3❝ 2❝ 1❝\n❝ ❝5\n2 ❝ ❝ ❝ ❝\n4 3 2 1\n\nRemark 5.4. Let Z be a log del Pezzo surfa e of index = 2 and with\ng = KZ2 + 1 = 5. Then the image of the map |D5 | is a degree eight\ninterse tion in P5 of a one over a rational normal s rollar surfa e in P4\n(it is of degree 3) with two symmetri (see Lemma 5.2) ubi hypersurfa es (in fa t it is a omponent of the interse tion of this one with one\nubi hypersurfa e where the se ond omponent has to be a plane). We\nan also obtain a onverse statement saying that: ea h surfa e with Du\nVal singularities and obtained as a omponent of degree 8 of a se tion\nof the one with a ubi surfa e is a K3 surfa e (singular). We add to\nthis the ondition to being symmetri . Then if we take the quotient by\nthe symmetry we obtain a des ription of del Pezzo surfa es of index 2\nand KZ2 = 4.\nIn general if Z has g ≥ 6 our method does not give satisfa tory\nresults be ause in those ases we do not have a list of orresponding\nK3 surfa es given in terms of equations. For this reason we give the\nomplete list of del Pezzo surfa es with g ≥ 6 (see [AN, table 3℄). We\ndo the following.\n\nTheorem 5.5. There are only \u001cve families of dimension ≥ 1 of del\n\nPezzo surfa es with index 2 and g ≥ 6 and a \u001cnite number of isomorphism lasses not in these families.\nProof. We use the tori argument des ribed in [AN, proof of thm 4.2℄\n\nto all the diagrams of DPN (see [AN, table 3℄) surfa es with g ≥ 6.\nWe do as follows. We onsider all diagrams of ex eptional urves that\no ur on DPN surfa es with g ≥ 6, that is all diagrams from [AN, table\n3℄ with g ≥ 3 and all their asso iated diagrams. The diagram permits\nus to write the DPN surfa es as obtained by a sequen e of blowing ups\nof P2 , P1 × P1 or Fn . These are tori varieties. The torus group a ts on\nthe spa e of hoi es for the blowing ups. Our task is to ompute the\ndimensions of spa es of orbits. After a straightforward omputation,\nwe obtain that the only non dis rete families of DPN surfa es of g ≥ 6\nwith a \u001cxed diagram of ex eptional urves are:\n\n\fEQUATIONS OF LOG DEL PEZZO SURFACES OF INDEX ≤ 2\n\n25\n\n(1) P2 blown up in \u001cve point on a line.\n(2) F1 blown up in four points on a \u001cber of whi h one on the exeptional se tion.\n(3) F3 blown up in four points on a \u001cber of whi h one on the exeptional se tion.\n(4) P1 × P1 blown up in four points on a \u001cber.\n(5) F2 blown up in four points on a \u001cber of whi h one on the exeptional se tion and another point on this se tion.\nThe \u001crst of them is two dimensional, be ause it is lassi\u001ced by on\u001cgurations of \u001cve point on a line. The others are one dimensional, as\nthey are onne ted with on\u001cgurations of four points on a line. By\nontra ting Duv and Log parts of the diagrams we obtain families of\nlog del Pezzo surfa es.\n\u0003\n\nRemark 5.5. The families (1) and (2) from above theorem ome from\n\nsubgraphs from the ase 15 of [AN, table 3℄, so their orresponding\nfamilies of del Pezzo surfa es are des ribed as quinti s in P(1, 1, 1, 4).\n6.\n\nAppli ation\n\nAs an appli ation of these results with the help of [AN, table 3℄ we\nan get the list of all on\u001cgurations of singularities that an o ur on\nsurfa es de\u001cned by equations des ribed in the paper, or equivalently\non symmetri singular K3 surfa es orresponding to them. Moreover\nfrom Se tion 0 we know that all these on\u001cgurations of singularities do\no ur. Below we show some interesting examples of this type.\n\nExample 6.1.\n\nAs an example we an get a list of all on\u001cgurations\nof singularities that appear on a symmetri sexti plane urve with\nat most a double singularity in the enter of symmetry. This result\nwithout the assumption of being symmetri is des ribed in [AN℄. The\nomplete list des ribed there is mu h longer (and not formulated expli itly). We \u001crst deal with the ase where the sexti is symmetri with\nrespe t to a point on it. We have the following list:\n- An A1 singularity in the enter of symmetry and twi e (beause singular points appear in pairs) the following on\u001cguration ( ompare with [AN, se .4.2℄):\n2D4 ;\nD8 ;\nD7 ;\nD6 2A1 , D6 A1 , D6 ; D5 A3 , D5 A2 , D5 2A1 , D5 A1 , D5 ;\nD4 A3 , D4 A2 , D4 3A1 , D4 2A1 , D4 A1 , D4 ;\nA7 ;\n\n\f26\n\nGRZEGORZ KAPUSTKA AND MICHA\u008a KAPUSTKA\n\n-\n\n-\n\n-\n\n-\n\n-\n\nA6 ;\nA52A1 , A5 A1 , A5 ;\nA4 A3 , A4 A2 , A4 2A1 , A4 A1 , A4 ;\n2A3 A1 , 2A3 , A3 A2 2A1 , A3 A2 A1 , A3 A2 , A3 4A1 , A3 3A1 , A3 2A1 ,\nA3 A1 , A3 ;\n2A2 2A1 , 2A2 A1 , 2A2 , A2 4A1 , A2 3A1 , A2 2A1 , A2 A1 , A2 ;\n6A1 , 5A1 , 4A1 , 3A1 ;\n2A1 , A1 ;\n∅;\nA singularity A3 in the enter of symmetry and twi e the following on\u001cguration:\nA7 ;\nA6 ;\nA5 A1 , A5 ;\nA4 A2 , A4 A1 , A4 ;\n2A3 , A3 A2 , A3 2A1 , A3 A1 , A3 ;\n2A2 A1 , 2A2 , A2 2A1 , A2 A1 , A2 ;\n4A1 , 3A1 , 2A1 , A1 ;\n∅.\nA singularity A5 in the enter of symmetry and twi e the following on\u001cguration:\nA5 A1 , A5 ;\nA4 A1 , A4 ;\nA3 2A1 , A3 A1 , A3 ;\n2A2 A1 , 2A2 , A2 2A1 , A2 A1 , A2 ;\n4A1 , 3A1 , 2A1 , A1 ;\n∅.\nA singularity A7 or A9 in the enter of symmetry and twi e the\nfollowing on\u001cguration:\nA4 ;\nA3 ;\nA2 A1 , A2 ;\n2A1 , A1 ;\n∅;\nA singularity A11 in the enter of symmetry and twi e the following on\u001cguration:\nA2 ;\nA1 ;\n∅;\nA singularity A13 in the enter of symmetry and twi e A1 or ∅;\nA singularity A15 or A17 in the enter of symmetry and smooth\noutside.\n\n\fEQUATIONS OF LOG DEL PEZZO SURFACES OF INDEX ≤ 2\n\n27\n\nIf the sexti does not pass through the enter of symmetry it is either\nthe sum of three tangent oni s or has only simple singularities. In\nthe latter we have a very long list of ases, des ribed by all possible\nsubgraphs of the following graphs:\nE8 , A8 , A7 A1 , A5 A2 A1 , 2A4 , D8 , D5 A3 , E6 E2 , E7 A1 , D6 2A1 , 2D4 ,\n2A3 2A1 , 4A2 .\n\nExample 6.2.\n\nAs in the previous example we get a des ription of all\non\u001cgurations of only Du Val singularities that appear on a symmetri\nquarti in P3 .\n- if the quarti passes through the enter of symmetry there an\nbe only An singularities and only in the following on\u001cgurations:\nA1 in the enter and a symmetri on\u001cguration of:\n∅, 2A7 , 2A6 , 2A5 , 2A4 , 2A3 , 2A2 , 2A1 ,\n2A5 2A1 , 2A4 2A2 , 4A3 , 2A4 2A1 , 2A3 2A1 , 2A2 2A1 , 4A1 , 2A3 2A2 ,\n4A2 ,\n2A3 4A1 , 2A2 4A1 , 6A1 , 4A2 2A1 ,\n8A1 ,\nor A3 in the enter and a symmetri on\u001cguration of:\n∅, 2A3 , 2A2 , 2A1 ,\n4A3 , 2A3 2A2 , 2A3 2A1 4A2 , 2A2 2A1 , 4A1 ,\n2A3 4A1 , 2A2 4A1 , 6A1 ,\n8A1 ,\nor A5 in the enter and a symmetri on\u001cguration of:\n∅, 2A2 , 2A1 ,\n4A2 , 2A2 2A1 , 4A1 ,\nor A7 in the enter and a symmetri on\u001cguration of:\n∅, 2A2 , 2A1 ,\n2A2 2A1 , 4A1 ,\nor A9 in the enter and a symmetri on\u001cguration of:\n∅, 2A2 , 2A1 ,\nor A1 1 in the enter and a symmetri on\u001cguration of:\n∅, 2A2 , 2A1\n- if the quarti does not pass through the enter of symmetry the\non\u001cgurations are des ribed in [HW℄ and orrespond to subf7 . We an also prove\ngraphs of the extended Dynkin diagram E\nthis looking to [AN, table 3℄.\n\nExample 6.3.\n\nWe know that the ase (a) of Theorem 3.1 is the only\nase with two index 2 singularities, and this is ase number 25 from\n[AN, table 3℄. The Du Val singularities of these log del Pezzo surfa es\n\n\f28\n\nGRZEGORZ KAPUSTKA AND MICHA\u008a KAPUSTKA\n\norrespond to the singularities of the bran h divisor of the map φ. From\nthis we dedu e, that all on\u001cgurations of singularities, that appear on\na urve of degree 8 in P(1, 1, 4) having only Du Val singularities and\nnot passing through the point (0 : 0 : 1), are de\u001cned by subgraphs of\nthe singularity A7 . That is, are one of the following:\nA7 , A6 ,\nA5 A1 , A4 A1 , A3 A1 , A2 A1 , 2A1 , A4 A2 , A3 A2 , A2 A2 , A3 A3 ,\nA3 2A1 , A2 2A1 , 2A2 A1 , 3A1 ,\n4A1 .\n\nExample 6.4. We an write down all on\u001cgurations of only Du Val\nsingularities that o ur on a symmetri surfa e being a omplete interse tion of a quadri and a ubi in P4 . They an have only An\nsingularities and only in the following on\u001cgurations:\n- if the surfa e passes through the enter of symmetry A1 in the\nenter and a symmetri on\u001cguration of:\n∅, 2A5 , 2A4 , 2A3 , 2A2 , 2A1 ,\n2A5 2A1 , 2A4 2A1 , 2A3 2A1 , 2A2 2A1 , 4A1 , 4A2 ,\n2A3 4A1 , 2A2 4A1 , 6A1 , 4A2 2A1 ,\n8A1 ,\nor A3 in the enter and a symmetri on\u001cguration of:\n∅, 2A2 , 2A1 ,\n4A2 , 2A2 2A1 , 4A1\nor A5 in the enter and a symmetri on\u001cguration of:\n∅, 2A2 , 2A1 ,\n4A2 , 2A2 2A1 , 4A1 ,\nor A7 in the enter and a symmetri on\u001cguration of:\n∅, 2A1 ,\nor A9 in the enter and a symmetri on\u001cguration of:\n∅, 2A1 ,\n- If the surfa e does not pass through the enter of symmetry,\nthen its quotient by the symmetry s is a double overing of a\nubi surfa e in P3 bran hed over a smooth urve. This implies that on\u001cgurations of singularities that an appear on this\nsurfa e are non-bran hed overings of the on\u001cgurations of singularities that an appear on the ubi . These are symmetri\non\u001cgurations of subgraphs of the following graphs:\nE6 , A5 A1 , 3A2 .\n\nExample 6.5. The on\u001cgurations of singularities that o ur on a quinti with only Du Val singularities outside the point (0 : 0 : 0 : 1) in\nP(1, 1, 1, 4) and quasi-smooth in this point are:\n\n\fEQUATIONS OF LOG DEL PEZZO SURFACES OF INDEX ≤ 2\n\n29\n\nA singularity K1 in the point (0 : 0 : 0 : 1) and one of the\nfollowing on\u001cgurations of An singularities:\n∅, A4 , A3 , A2 , A1 ,\nA2 A1 , 2A1\n\nReferen es\n[AN℄ V. Alekseev, V. Nikulin, Classi\u001c ation of log del Pezzo surfa es of index ≤ 2,\nPreprint (2004), math.AG/0406536, 141 pages.\n[AN2℄ V. Alekseev, V. Nikulin, Classi\u001c ation of del Pezzo surfa es with log-terminal\nsingularities of index = 2 and involutions of K3 surfa es, Soviet Math. Dokl.\n39 (1989), no. 3, 507\u0015511.\n[D℄\nM. Demazure, Surfa es de del Pezzo. II \u0016 IV, In M. Demazure, H. Ch.\nPinkham, and B. Teissier (eds.), Séminaire sur les Singularités des Surfa es,\nLe ture Notes in Mathemati s, vol. 777, Springer, Berlin, 1980, Held at the\nCentre de Mathématiques de l' é ole Polyte hnique, Palaiseau, 1976\u00151977,\n23-69.\n[DVa℄ P. Du Val, On isolated singularities of surfa es whi h do not a\u001be t the onditions of adjun tion. II, III, Pro . Cambridge Phil. So . 30 (1934), 453-465.\n[DVb℄ P. Du Val, On isolated singularities of surfa es whi h do not a\u001be t the onditions of adjun tion. II, III, Pro . Cambridge Phil. So . 30 (1934), 483\u0015491.\n[HW℄ F. Hidaka and K. Watanabe, Normal Gorenstein surfa es with ample antianoni al divisor, Tokyo J. Math. 4 (1981), no. 2, 319-330.\n[SD℄ B. Saint-Donat, Proje tive models of K3 surfa es, Amer. J. Math. 96 (1974),\n602-639.\n[C℄\nF.R. Cosse , Proje tive models of Enriques surfa es, Math. Ann. 265 (1983),\n283-334\n[BPV℄ W. Barth, C. Peters, A. Van de Ven, Compa t omplex surfa es, Heidelberg,\nBerlin, New York, Springer 1984.\n[B℄\nE. Brieskorn, Rationale Singularitäten Complexer Flä hen, Invent. Math. 4\n(1967/1968), 336-358.\n[IF℄ A.R. Iano-Flet her, Working with weighted omplete interse tions, in\nA. Corti and M. Reid, editors, Expli it birational geometry of 3-folds, LMS\nLe ture Notes Series 281, CUP, Cambridge, 2000, 101-173.\n[RS℄ M. Reid, K. Suzuki, Cas ades of proje tions from log del Pezzo surfa es, in\nNumber theory and algebrai geometry - to Peter Swinnerton-Dyer on his\n75th birthday, Cambridge University Press, Cambridge, 2003, 227- 249.\n[T℄\nH.Takagi, On lassi\u001c ation of Q-Fano 3-folds with Gorenstein index 2 and\nFano index 1/2, Preprint (1999), math.AG/9905068, 40 pages.\n\nGrzegorz Kapustka\nJagiellonian University\nul. Reymonta 4\n30-059 Kraków\nPoland\nemail: Grzegorz.Kapustka\bim.uj.edu.pl\n\nMi haa Kapustka\nJagiellonian University\nul. Reymonta 4\n30-059 Kraków\nPoland\nemail: Mi hal.Kapustka\bim.uj.edu.pl\n\n\f"}