{"id": "http://arxiv.org/abs/math/0312282v1", "guidislink": true, "updated": "2003-12-15T01:25:27Z", "updated_parsed": [2003, 12, 15, 1, 25, 27, 0, 349, 0], "published": "2003-12-15T01:25:27Z", "published_parsed": [2003, 12, 15, 1, 25, 27, 0, 349, 0], "title": "Bijective Proofs for \"Enumerative Properties of Ferrers Graphs\"", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=math%2F0312280%2Cmath%2F0312213%2Cmath%2F0312227%2Cmath%2F0312323%2Cmath%2F0312205%2Cmath%2F0312384%2Cmath%2F0312054%2Cmath%2F0312033%2Cmath%2F0312242%2Cmath%2F0312029%2Cmath%2F0312489%2Cmath%2F0312094%2Cmath%2F0312387%2Cmath%2F0312277%2Cmath%2F0312230%2Cmath%2F0312240%2Cmath%2F0312313%2Cmath%2F0312282%2Cmath%2F0312365%2Cmath%2F0312303%2Cmath%2F0312071%2Cmath%2F0312296%2Cmath%2F0312129%2Cmath%2F0312406%2Cmath%2F0312320%2Cmath%2F0312335%2Cmath%2F0312041%2Cmath%2F0312162%2Cmath%2F0312183%2Cmath%2F0312392%2Cmath%2F0312343%2Cmath%2F0312243%2Cmath%2F0312385%2Cmath%2F0312269%2Cmath%2F0312288%2Cmath%2F0312271%2Cmath%2F0312078%2Cmath%2F0312263%2Cmath%2F0312111%2Cmath%2F0312096%2Cmath%2F0312267%2Cmath%2F0312350%2Cmath%2F0312204%2Cmath%2F0405198%2Cmath%2F0405058%2Cmath%2F0405208%2Cmath%2F0405193%2Cmath%2F0405580%2Cmath%2F0405221%2Cmath%2F0405470%2Cmath%2F0405037%2Cmath%2F0405200%2Cmath%2F0405102%2Cmath%2F0405275%2Cmath%2F0405224%2Cmath%2F0405552%2Cmath%2F0405271%2Cmath%2F0405132%2Cmath%2F0405333%2Cmath%2F0405268%2Cmath%2F0405057%2Cmath%2F0405427%2Cmath%2F0405235%2Cmath%2F0405152%2Cmath%2F0405499%2Cmath%2F0405482%2Cmath%2F0405282%2Cmath%2F0405579%2Cmath%2F0405106%2Cmath%2F0405040%2Cmath%2F0405351%2Cmath%2F0405446%2Cmath%2F0405201%2Cmath%2F0405442%2Cmath%2F0405270%2Cmath%2F0405191%2Cmath%2F0405189%2Cmath%2F0405006%2Cmath%2F0405023%2Cmath%2F0405425%2Cmath%2F0405392%2Cmath%2F0405231%2Cmath%2F0405084%2Cmath%2F0405116%2Cmath%2F0405393%2Cmath%2F0405157%2Cmath%2F0405475%2Cmath%2F0405378%2Cmath%2F0405597%2Cmath%2F0405595%2Cmath%2F0405068%2Cmath%2F0405099%2Cmath%2F0405187%2Cmath%2F0405586%2Cmath%2F0405508%2Cmath%2F0405213%2Cmath%2F0405016%2Cmath%2F0405415%2Cmath%2F0405331%2Cmath%2F0405212%2Cmath%2F0405101&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Bijective Proofs for \"Enumerative Properties of Ferrers Graphs\""}, "summary": "Recently, Ehrenborg and Van Willenburg defined a class of bipartite graphs\nthat correspond naturally to Ferrers diagrams, and proved several results about\nthem. We give bijective proofs for the (already known) expressions for the\nnumber of spanning trees and (where applicable) Hamiltonian paths of these\ngraphs.\n  Their paper can be found at\nhttp://www.ms.uky.edu/~jrge/Papers/Ferrers_graphs.pdf .", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=math%2F0312280%2Cmath%2F0312213%2Cmath%2F0312227%2Cmath%2F0312323%2Cmath%2F0312205%2Cmath%2F0312384%2Cmath%2F0312054%2Cmath%2F0312033%2Cmath%2F0312242%2Cmath%2F0312029%2Cmath%2F0312489%2Cmath%2F0312094%2Cmath%2F0312387%2Cmath%2F0312277%2Cmath%2F0312230%2Cmath%2F0312240%2Cmath%2F0312313%2Cmath%2F0312282%2Cmath%2F0312365%2Cmath%2F0312303%2Cmath%2F0312071%2Cmath%2F0312296%2Cmath%2F0312129%2Cmath%2F0312406%2Cmath%2F0312320%2Cmath%2F0312335%2Cmath%2F0312041%2Cmath%2F0312162%2Cmath%2F0312183%2Cmath%2F0312392%2Cmath%2F0312343%2Cmath%2F0312243%2Cmath%2F0312385%2Cmath%2F0312269%2Cmath%2F0312288%2Cmath%2F0312271%2Cmath%2F0312078%2Cmath%2F0312263%2Cmath%2F0312111%2Cmath%2F0312096%2Cmath%2F0312267%2Cmath%2F0312350%2Cmath%2F0312204%2Cmath%2F0405198%2Cmath%2F0405058%2Cmath%2F0405208%2Cmath%2F0405193%2Cmath%2F0405580%2Cmath%2F0405221%2Cmath%2F0405470%2Cmath%2F0405037%2Cmath%2F0405200%2Cmath%2F0405102%2Cmath%2F0405275%2Cmath%2F0405224%2Cmath%2F0405552%2Cmath%2F0405271%2Cmath%2F0405132%2Cmath%2F0405333%2Cmath%2F0405268%2Cmath%2F0405057%2Cmath%2F0405427%2Cmath%2F0405235%2Cmath%2F0405152%2Cmath%2F0405499%2Cmath%2F0405482%2Cmath%2F0405282%2Cmath%2F0405579%2Cmath%2F0405106%2Cmath%2F0405040%2Cmath%2F0405351%2Cmath%2F0405446%2Cmath%2F0405201%2Cmath%2F0405442%2Cmath%2F0405270%2Cmath%2F0405191%2Cmath%2F0405189%2Cmath%2F0405006%2Cmath%2F0405023%2Cmath%2F0405425%2Cmath%2F0405392%2Cmath%2F0405231%2Cmath%2F0405084%2Cmath%2F0405116%2Cmath%2F0405393%2Cmath%2F0405157%2Cmath%2F0405475%2Cmath%2F0405378%2Cmath%2F0405597%2Cmath%2F0405595%2Cmath%2F0405068%2Cmath%2F0405099%2Cmath%2F0405187%2Cmath%2F0405586%2Cmath%2F0405508%2Cmath%2F0405213%2Cmath%2F0405016%2Cmath%2F0405415%2Cmath%2F0405331%2Cmath%2F0405212%2Cmath%2F0405101&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Recently, Ehrenborg and Van Willenburg defined a class of bipartite graphs\nthat correspond naturally to Ferrers diagrams, and proved several results about\nthem. We give bijective proofs for the (already known) expressions for the\nnumber of spanning trees and (where applicable) Hamiltonian paths of these\ngraphs.\n  Their paper can be found at\nhttp://www.ms.uky.edu/~jrge/Papers/Ferrers_graphs.pdf ."}, "authors": ["Jason Burns"], "author_detail": {"name": "Jason Burns"}, "author": "Jason Burns", "arxiv_comment": "6 pages, 5 figures", "links": [{"href": "http://arxiv.org/abs/math/0312282v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/math/0312282v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.CO", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "05C30", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/math/0312282v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/math/0312282v1", "journal_reference": null, "doi": null, "fulltext": "arXiv:math/0312282v1 [math.CO] 15 Dec 2003\n\nBijective Proofs for \"Enumerative Properties of Ferrers Graphs\"\nJason Burns\nOctober 31, 2018\n\n1\n\nIntroduction\n\nIn their paper [1], Richard Ehrenborg and Stephanie van Willigenburg introduce the concept of a\n\"Ferrers graph\". Given a Ferrers diagram,1 we construct its corresponding Ferrers graph by taking\nthe vertices to be the rows and columns of the diagram, and the edges to be the squares of the\ndiagram: row a and column b are connected by an edge if and only if there is a square in position\n(a, b) of the diagram.\nColumn 1r\n\n2r\n3\n4r ✥\n5r ✭6r\n✥\n✘✥\n✏r ✘✟\n✘\n✦\n✥✧\n✦\n✟\n✏✑\n✭✭\n✧\n✭\n✚\n✏\n✘\n✭\n✥\n✦\n✁\n✡\n✁✄✂✄ ✟✟✟\n✭\n✑\n✚\n✥\n✘✭\n✏\n✭✦✧\n✥✟\n✘✭\n✭✦\n✥\n✡✁✭\n✂ ✏✏\n✘\n✥\n✑\n✁✏\n✟\n✚\n✟\n✘\n✥\n✭\n✥✁✑ ✟✚\n✘✡\n✦ ✧\n✭\n✥\n✟\n✘\n✄ ✭\n✥\n✏\n✘\n✥\n✁✂✭\n✟✦✦✧✧\nRow 1 r✭\n✟\n✏\n✘✭\n✥\n✑✟✦\n✚\n✄\n✁\n✡✟✦\n✁✂ ✑\n✟✁✦ ✚✧✧\n✑\n✡✦\n✂ ✄✦\n✁✑\n✟\n✚\n✟\n✄ ✡ ✁ ✚✧✧\n2 r✦\n✑\n✁✟✂✦\n✧\n✚\n✂ ✄✡✚✁✧\n✂✡✄✧\n✚✁✧\n3 r✧\n✡\n✂✚✄ ✁\n✄✁\n✄✁\n4 r✁✄\nFigure 1: A Ferrers diagram and its graph.\nThis bipartite graph is clearly equivalent to the original diagram, but in this new form we can raise\nnew questions. Ehrenborg and Van Willigenburg examine several of these, including the number\nof spanning trees and Hamiltonian paths of the Ferrers graph; alas, the proofs they give for these\nare not bijective. In this paper, I give bijective proofs for both of these, which extend to weighted\nversions.\nEhrenborg and Jeffrey B. Remmel have independently found a bijection for the number of spanning\ntrees; I have not yet seen it.\n1\nRecall that a Ferrers diagram is a set of lattice points in the upper-right quadrant {(x, y) : x, y ∈ N} such that,\nif (x, y) is in the set, so is (x′ , y ′ ) for all x′ at most x and y ′ at most y. (We normally rotate the diagram by − π2 and\ndraw boxes for the lattice points.)\n\n1\n\n\f2\n\nHamiltonian paths\n\nLet's suppose our Ferrers diagram has the same number n of rows and columns.2 Ehrenborg and\nVan Willigenburg proved that the number of Hamiltonian paths for the corresponding Ferrers graph\nis the square of the number of n–rook placements on the Ferrers diagram. (By \"number of n–rook\nplacements\", we mean the number of ways to choose n squares from the diagram so that no two\nare in the same row or column.) To prove this bijectively, we seek a procedure converting any\nHamiltonian path to a pair of n–rook placements, and an inverse procedure converting any pair of\nn-rook placements back to a Hamiltonian path.\nColumn 1r\n\n2r\n3\n4r ✥5r\n✘\n✏r ✘✘\n✟✥✥✥\n✏✑\n✟\n✚\n✏✑\n✘✥\n✥\n✡\n✁✄✂☎✄☎ ✟✟✟\n✁\n✓\n☞\n✚\n✘\n✏\n✟\n☞\n✥\n✘✥✓✟✚\n✁✥\n✂ ✏✏\n✘✑\n✥\n✁✟\n✘✡\n✘✥\n✏\n✟✚\n✟\n✘\n✄☎ ✥\n✁☞✑✟✓\n✏\n✡\n✘✁✂✥\n✟\n✏\n✘✥\nRow 1 r✥\n✑\n✟✓ ✚\n☎\n☞\n✄\n✁\n✡\n✂\n✟\n✁ ✑\n☎✟✡✟✁☞ ✓✚\n✂ ✄✑\n✁✑\n✚\n✟\n☎\n☞\n2✑\nr✁✟✂ ✄ ✡ ✁ ✚✓\n☞✓\n✂ ✄✡☎ ✚✁✚\n✄ ☎ ✁ ☞✓\n✂✡✚\n☞\n✂✡ ✄ ☎ ✁ ✓\n3 r✚\n✄ ✁☎ ✓☞\n☎ ☞\n✄✁✓\n✁r✄ ☎ ☞\n4✓\n☎☞\n☎☞\n5 ☞r☎\nFigure 2: A Hamiltonian path in a Ferrers graph.\nHamiltonian paths to pairs of n–rook placements\nOne end of the Hamiltonian path is a row-vertex, and the other is a column-vertex. Suppose the\nvertices have labels a1 , b1 , a2 , b2 , . . . , an , bn , starting at the row end, so the \"a\" vertices are rows\nand the \"b\" vertices are columns.\n\n1. Start with an empty Ferrers diagram which we'll mark up with two distinct n–rook placements, labeled with A's and B's. Also set b0 := 1.\n2. Repeat for each pair of vertices ai , bi :\n(a) Mark an A in the square (ai , bi−1 ), unless there is already an A in column bi−1 . If there\nis an A in that column, mark the A in the next available column without an A.\n(b) Mark a B in the square (ai , bi ).\n(c) Move on to the next pair of vertices ai+1 , bi+1 .\n\nWe place one B in each row ai , and one B in each column bi , so the B's constitute an n–rook\nplacement. We place one A in each row ai , and we never place more than one A in any column, so\n2\n\nThis is not much of a restriction. Since any Hamiltonian path in the Ferrers graph must alternate between rows\nand columns, there can be at most one more (or fewer) row than column, if there are to be any Hamiltonian paths\nat all.\n\n2\n\n\fAB\nB\n\nA\nAB\nA\n\nA\n\nB\n\nB\n\nFigure 3: The n–rook configuration corresponding to the Hamiltonian path above.\nthe A's also constitute an n–rook placement. The only thing we need to check is that there always\nis a \"next available column\" in row ai , in which to place our A.\nThis seems easy: after all, we're about to mark a B in row ai , column bi , which guarantees that\ncolumn bi is possible. Since we mark as many A's as B's at every stage, and every column we've\nmarked so far with a B (that is, b1 through bi−1 ) is guaranteed to have an A, we also know that bi\ndoesn't have an A and is thus available. So there is at least one available column.\nThe problem is that we need a next available column, that is, one that follows bi−1 . The solution\nis to observe that the \"next available column\" is actually the first available column: every column\nabove it has an A already. Suppose, at some pair of vertices ai , bi , that the column bi−1 we would\nhave used already has an A. We've never been to bi before, so there are only two ways bi−1 could\nhave acquired that A. Either it was put there in the first iteration of the loop, and bi−1 = b0 is the\nfirst column (in which case the next column without an A is obviously the first one without an A),\nor else it was put there as the \"next available column\" (so bi−1 was at one time the first available\ncolumn, which means that all the columns before bi−1 contain an A). Hence the available column\nbi must follow bi−1 .\nPairs of n–rook placements to Hamiltonian paths\n1. Start with a Ferrers diagram marked with two different n–rook placements, labeled with A's\nand B's. Also set b0 := 1.\n2. Repeat until we've identified each pair of vertices ai , bi :\n(a) Remove the A in column bi−1 , or else the first column with an A, and set ai equal to\nthe row it was in.\n(b) Remove the B in row ai , and set bi equal to the column it was in.\n(c) Move on to identify the next pair of vertices ai+1 , bi+1 .\nThis is clearly the inverse of the procedure given earlier. Note that \"first column with an A\" is\nequivalent to \"next column with an A\", by our earlier argument.\n3\n\n\fOne last comment: if we switch the roles of rows and columns in the above procedures, or if we\nswitch the roles of A's and B's, we get another Hamiltonian path. It would be interesting to know\nif there is any deeper meaning to these two involutions.\n\n3\n\nSpanning trees\n\nThe number of spanning trees of a Ferrers graph is the product of the lengths of all but the first\ncolumn, times the product of the lengths of all but the first row. We can prove this with a similar\nbijection.\nWe represent this product combinatorially in a similar fashion to the rook placements above: in\neach row but the first we place an R, and in each row but the first we place a C. (Note that now\nthere may be more than one R in some column, or more than one C in some row; and we needn't\nhave equal number of rows and columns.) Also, place an X in the first row and first column, for a\nreason we'll see later.\n\nX\n\nC\n\nC\n\nRC\nR\n\nC\n\nRC\nFigure 4: A configuration corresponding to a spanning tree.\nGiven such a configuration of R's and C's, we will convert it to a spanning tree in two stages.\nFor the first stage, note that every row except the first has exactly one R, but it need not have any\nC's; and likewise, each column but the first has one C and as few as zero R's. If there is a row a\nwith an R in column b, but no other markings, we may construct a spanning tree by removing row\na, constructing the spanning tree on the remaining rows and columns, and then joining row a to the\nrest of the tree with a single edge to column b. Likewise, if there is a column b with a C in column\na, but no other markings, we may construct a spanning tree by removing column b, constructing\nthe spanning tree on the remaining rows and columns, and then joining column b to the rest of the\ntree with a single edge to row a. It clearly doesn't matter in which order we prune these rows and\ncolumns. Conversely, given a spanning tree, we can remove a leaf node (say, row-vertex a), mark\nthe square (a, b) corresponding to the edge connecting it with the rest of the tree (we would mark\nwith an R, since this is a row-vertex), and proceed to mark the remaining rows and columns of the\nspanning tree. Thus far, then, we have a bijection. Note that we cannot remove the first row or\ncolumn in this stage.\nFor the second stage, we are thus left with only the irreducible objects of each type: the configu4\n\n\frations of R's and C's for which every row but the first has at least one C and every column but\nthe first has at least one R, against the paths from the first row-vertex to the first column-vertex.\nRemove the first row and column: then what we have left are simply pairs of n–rook placements (in\nthe former case), and arbitrary Hamiltonian paths (in the latter), and we already have a bijection\nbetween these! If each row has a C then there must be at least as many C's as R's, and if each\ncolumn has an R then there are as many R's as C's, and so there are exactly as many R's as C's:\none per column, and also one per row. (So the R's are an n–rook placement, and so are the C's.)\nOn the other hand, a Hamiltonian path starting at the first column and ending at the first row is\nsimply an arbitrary Hamiltonian path on the second through nth rows and columns; just strip off\nthe first-row and first-column endpoints, or put them back on again.\nColumn 1r\n\n2\n3r ✘4r ✥\n5r\n6r\n✥\n✘\n✦\n✥\n✦\n✟r✏✏✏\n✟\n✘✥\n✧✭✭✭\n✥\n✑\n✭\n✟\n✧\n✚\n✭\n✘\n✦\n✡\n✁\n✁✄✂✄ ✟✟✏\n✭\n✑\n✚\n✥\n✘\n✭\n✟\n✭ ✦✧\n✘\n✁ ✥\n✭✚\n✡✥\n✂ ✏✏\n✘\n✭✥\n✑✥\n✁✏\n✟\n✭\n✘\n✟\n✧\n✭\n✥\n✦✦\n✘\n✭\n✟✦\n✥\n✘\n✭\n✟\n✑\n✄\n✁\n✥\n✏\n✭\n✚\n✧\n✡\n✂\n✘\n✥\n✭\n✁\n✟\n✏\n✘\nRow 1 ✟\n✭\n✥\nr\n✦\n✑\n✧\n✟\n✁ ✦✦✚✧\n✡✟\n✁ ✂✄ ✑\n✑✡✟\n✁✦✚✚✧\n✦\n✂ ✄✟\n✁✑\n✦\n✧\n✦\n✂ ✄ ✡ ✁ ✚✧\n2✟\n✑\nr ✟\n✁✦\n✧\n✚\n✄\n✁\n✂✡ ✧\n✧\n✄ ✚\n✁\n✂✡✚\n✧✁\n✄\n3 ✂✚\n✧\nr\n✡\n✄✁\n✄✁\n4 r✄✁\nFigure 5: The spanning tree.\n\n4\n\nWeighted spanning trees\n\nOur spanning-tree bijection also gives us a weighted formula for the total number of spanning trees.\nSpecifically, if we assign weight xa yb to the edge from row a to column b, then the weight of any\ngiven spanning tree is equal to the weight of the corresponding configuration of R's, C's, and one\nX in the upper-left corner. This in turn lets us sum the weights of all spanning trees by summing\nthe weights of all configurations, giving the product formula\nY\nY\n(x1 x2 * * * xm ) * (y1 y2 * * * yn ) *\n(y1 + * * * + yλa ) *\n(x1 + * * * + xλ′b )\n2≤a≤m\n\n2≤b≤n\n\nwhere λa and λ′b are the lengths of row a and column b respectively.3\nThat our spanning-tree bijection is weight-preserving is evident in the first stage, because we\nremove an edge of weight xa yb from both the configuration and the spanning tree; in the second\nstage it is only slightly less obvious. Each Hamiltonian path in the second stage starts in the\nfirst column and ends in the first row, but passes through all other vertices; hence it contributes\nx1 y1 (x2 * * * xm )2 (y2 * * * yn )2 to the total. Likewise, there is a single X in the first row and the\nfirst column, but an R and a C in each other row and column, so these marks also contribute\nx1 y1 (x2 * * * xm )2 (y2 * * * yn )2 .\n3\n\nThis is not hard to see. Since each symbol in the configuration can be placed independently of the others, we\nsimply calculate the weights each symbol can give, and multiply them together. The X must be placed in the upper\nleft corner, contributing x1 y1 ; the R in row a can be placed in column 1, 2, . . . , λa , for a factor of xa * (y1 + * * * + yλa );\nand the C in row b can be placed in rows 1, 2, . . . , λ′b , for a factor of yb * (x1 + * * * + xλ′b ).\n\n5\n\n\f5\n\nFuture research\n\nOne natural extension4 of the definition of a Ferrers graphs is to skew Ferrers diagrams. In fact, the\ndefinition works with no further changes; unfortunately, the results above fail, and no reasonable\nfix is apparent. Nothing interesting is yet known in this case.\nLet me suggest another extension which may prove more fruitful. One of the key invariants of\na graph is its Tutte polynomial, which can be specialized to give such quantities as the number\nof spanning trees and the chromatic polynomial. (Thus, a combinatorial determination of the\nTutte polynomial would encompass the result above.5 ) The Tutte polynomial can be computed\nrecursively by deleting and contracting edges, but if we try to calculate the Tutte polynomial of a\nFerrers graph recursively by removing rows, these contractions yield multiple edges. Specifically,\nwe get what we might call \"plane-partition graphs\": the number of edges from row a to column b\n(corresponding to square (a, b)) does not increase as we increase a or b - or, stated another way,\nif we were to write in square (a, b) the number of edges corresponding to that square, we would get\na plane partition.\n\nReferences\n[1]\n\nRichard Ehrenborg and Stephanie van Willenburg. Enumerative properties of Ferrers graphs.\n2003 preprint. Available at http://www.ms.uky.edu/~jrge/Papers/Ferrers_graphs.pdf .\n\n4\n5\n\nSuggested by Ehrenborg and Van Willenburg in their paper.\nEhrenborg and Van Willenburg also suggested investigating the Tutte polynomial.\n\n6\n\n\f"}