{"id": "http://arxiv.org/abs/math/0309431v1", "guidislink": true, "updated": "2003-09-26T12:23:35Z", "updated_parsed": [2003, 9, 26, 12, 23, 35, 4, 269, 0], "published": "2003-09-26T12:23:35Z", "published_parsed": [2003, 9, 26, 12, 23, 35, 4, 269, 0], "title": "On the Generation of Hyper-powersets for the DSmT", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=math%2F0309147%2Cmath%2F0309330%2Cmath%2F0309336%2Cmath%2F0309211%2Cmath%2F0309268%2Cmath%2F0309247%2Cmath%2F0309244%2Cmath%2F0309280%2Cmath%2F0309138%2Cmath%2F0309346%2Cmath%2F0309164%2Cmath%2F0309409%2Cmath%2F0309101%2Cmath%2F0309204%2Cmath%2F0309168%2Cmath%2F0309064%2Cmath%2F0309425%2Cmath%2F0309414%2Cmath%2F0309023%2Cmath%2F0309006%2Cmath%2F0309410%2Cmath%2F0309375%2Cmath%2F0309431%2Cmath%2F0309434%2Cmath%2F0309202%2Cmath%2F0309156%2Cmath%2F0309390%2Cmath%2F0309337%2Cmath%2F0309470%2Cmath%2F0309220%2Cmath%2F0309226%2Cmath%2F0309374%2Cmath%2F0309053%2Cmath%2F0309349%2Cmath%2F0309289%2Cmath%2F0309121%2Cmath%2F0309427%2Cmath%2F0309241%2Cmath%2F0309205%2Cmath%2F0309225%2Cmath%2F0309303%2Cmath%2F0309097%2Cmath%2F0309047%2Cmath%2F0309026%2Cmath%2F0309245%2Cmath%2F0309215%2Cmath%2F0309477%2Cmath%2F0309474%2Cmath%2F0309177%2Cmath%2F0309046%2Cmath%2F0309274%2Cmath%2F0309155%2Cmath%2F0309242%2Cmath%2F0309307%2Cmath%2F0309446%2Cmath%2F0309239%2Cmath%2F0309383%2Cmath%2F0309368%2Cmath%2F0309188%2Cmath%2F0309435%2Cmath%2F0309113%2Cmath%2F0309182%2Cmath%2F0309415%2Cmath%2F0309235%2Cmath%2F0309344%2Cmath%2F0309123%2Cmath%2F0309172%2Cmath%2F0309139%2Cmath%2F0309371%2Cmath%2F0309240%2Cmath%2F0309088%2Cmath%2F0309429%2Cmath%2F0309057%2Cmath%2F0309418%2Cmath%2F0309120%2Cmath%2F0309102%2Cmath%2F0309350%2Cmath%2F0309315%2Cmath%2F0309298%2Cmath%2F0309037%2Cmath%2F0309265%2Cmath%2F0309367%2Cmath%2F0309426%2Cmath%2F0309212%2Cmath%2F0309287%2Cmath%2F0309402%2Cmath%2F0309271%2Cmath%2F0309180%2Cmath%2F0309218%2Cmath%2F0309382%2Cmath%2F0309130%2Cmath%2F0309224%2Cmath%2F0309444%2Cmath%2F0309261%2Cmath%2F0309229%2Cmath%2F0309397%2Cmath%2F0309060%2Cmath%2F0309313%2Cmath%2F0309079%2Cmath%2F0309038%2Cmath%2F0309167&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "On the Generation of Hyper-powersets for the DSmT"}, "summary": "The recent theory of plausible and paradoxical reasoning (DSmT for short, or\nDezert-Smarandache Theory), developed by the authors, appears to be a nice\npromising theoretical tools to solve many information fusion problems (for\nexample in military defense, medicine, etc.), where the Shafer's model cannot\nbe used due to the intrinsic paradoxical nature of the elements of the frame of\ndiscernment and where a strong internal conflict between sources arises. The\nmain idea of DSmT is to work on the hyper-powerset of the frame of discernment\nof the problem under consideration. Although the definition of hyper-powerset\nis well established, the major difficulty in practice is to generate such\nhyper-powersets in order to implement DSmT fusion rule on computers. We present\nin this paper a simple algorithm for generating hyper-powersets and discuss the\nlimitations of our actual computers to generate such hyper-powersets when the\ndimension of the problem increases.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=math%2F0309147%2Cmath%2F0309330%2Cmath%2F0309336%2Cmath%2F0309211%2Cmath%2F0309268%2Cmath%2F0309247%2Cmath%2F0309244%2Cmath%2F0309280%2Cmath%2F0309138%2Cmath%2F0309346%2Cmath%2F0309164%2Cmath%2F0309409%2Cmath%2F0309101%2Cmath%2F0309204%2Cmath%2F0309168%2Cmath%2F0309064%2Cmath%2F0309425%2Cmath%2F0309414%2Cmath%2F0309023%2Cmath%2F0309006%2Cmath%2F0309410%2Cmath%2F0309375%2Cmath%2F0309431%2Cmath%2F0309434%2Cmath%2F0309202%2Cmath%2F0309156%2Cmath%2F0309390%2Cmath%2F0309337%2Cmath%2F0309470%2Cmath%2F0309220%2Cmath%2F0309226%2Cmath%2F0309374%2Cmath%2F0309053%2Cmath%2F0309349%2Cmath%2F0309289%2Cmath%2F0309121%2Cmath%2F0309427%2Cmath%2F0309241%2Cmath%2F0309205%2Cmath%2F0309225%2Cmath%2F0309303%2Cmath%2F0309097%2Cmath%2F0309047%2Cmath%2F0309026%2Cmath%2F0309245%2Cmath%2F0309215%2Cmath%2F0309477%2Cmath%2F0309474%2Cmath%2F0309177%2Cmath%2F0309046%2Cmath%2F0309274%2Cmath%2F0309155%2Cmath%2F0309242%2Cmath%2F0309307%2Cmath%2F0309446%2Cmath%2F0309239%2Cmath%2F0309383%2Cmath%2F0309368%2Cmath%2F0309188%2Cmath%2F0309435%2Cmath%2F0309113%2Cmath%2F0309182%2Cmath%2F0309415%2Cmath%2F0309235%2Cmath%2F0309344%2Cmath%2F0309123%2Cmath%2F0309172%2Cmath%2F0309139%2Cmath%2F0309371%2Cmath%2F0309240%2Cmath%2F0309088%2Cmath%2F0309429%2Cmath%2F0309057%2Cmath%2F0309418%2Cmath%2F0309120%2Cmath%2F0309102%2Cmath%2F0309350%2Cmath%2F0309315%2Cmath%2F0309298%2Cmath%2F0309037%2Cmath%2F0309265%2Cmath%2F0309367%2Cmath%2F0309426%2Cmath%2F0309212%2Cmath%2F0309287%2Cmath%2F0309402%2Cmath%2F0309271%2Cmath%2F0309180%2Cmath%2F0309218%2Cmath%2F0309382%2Cmath%2F0309130%2Cmath%2F0309224%2Cmath%2F0309444%2Cmath%2F0309261%2Cmath%2F0309229%2Cmath%2F0309397%2Cmath%2F0309060%2Cmath%2F0309313%2Cmath%2F0309079%2Cmath%2F0309038%2Cmath%2F0309167&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The recent theory of plausible and paradoxical reasoning (DSmT for short, or\nDezert-Smarandache Theory), developed by the authors, appears to be a nice\npromising theoretical tools to solve many information fusion problems (for\nexample in military defense, medicine, etc.), where the Shafer's model cannot\nbe used due to the intrinsic paradoxical nature of the elements of the frame of\ndiscernment and where a strong internal conflict between sources arises. The\nmain idea of DSmT is to work on the hyper-powerset of the frame of discernment\nof the problem under consideration. Although the definition of hyper-powerset\nis well established, the major difficulty in practice is to generate such\nhyper-powersets in order to implement DSmT fusion rule on computers. We present\nin this paper a simple algorithm for generating hyper-powersets and discuss the\nlimitations of our actual computers to generate such hyper-powersets when the\ndimension of the problem increases."}, "authors": ["Jean Dezert", "Florentin Smarandache"], "author_detail": {"name": "Florentin Smarandache"}, "author": "Florentin Smarandache", "arxiv_comment": "11 pages, 2 tables, one graph, one computer program. Presented to The\n  Sixth International Conference on Information Fusion, Cairns, Queensland,\n  Australia, 1118-1125, 8-11 July 2003", "links": [{"href": "http://arxiv.org/abs/math/0309431v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/math/0309431v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.GM", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.GM", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "94A15, 94A17", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/math/0309431v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/math/0309431v1", "journal_reference": "Published in the Proceedings of the Sixth International Conference\n  on Information Fusion, International Society for Information Fusion, Cairns,\n  Queensland, Australia, 1118-1125, 8-11 July 2003", "doi": null, "fulltext": "arXiv:math/0309431v1 [math.GM] 26 Sep 2003\n\nOn the generation of hyper-powersets\nfor the DSmT\nJean Dezert\nONERA\n29 Av. de la Division Leclerc\n92320 Châtillon, France.\nJean.Dezert@onera.fr\n\nFlorentin Smarandache\nDepartment of Mathematics\nUniversity of New Mexico\nGallup, NM 87301, U.S.A.\nsmarand@unm.edu\n\nAbstract – The recent theory of plausible and paradoxical reasoning (DSmT) developed by the authors appears\nto be a nice promising theoretical tools to solve many information fusion problems where the Shafer's model\ncannot be used due to the intrinsic paradoxical nature of the elements of the frame of discernment and where\na strong internal conflict between sources arises. The main idea of DSmT is to work on the hyper-powerset of\nthe frame of discernment of the problem under consideration. Although the definition of hyper-powerset is well\nestablished, the major difficulty in practice is to generate such hyper-powersets in order to implement DSmT\nfusion rule on computers. We present in this paper a simple algorithm for generating hyper-powersets and\ndiscuss the limitations of our actual computers to generate such hyper-powersets when the dimension of the\nproblem increases.\nKeywords: Dezert-Smarandache theory (DSmT), hyper-powersets, monotone boolean functions, Dedekind\nproblem, plausible and paradoxical reasoning, data fusion.\n\n1\n\nIntroduction\n\nThe Dezert-Smarandache theory (DSmT for short) of plausible and paradoxical reasoning [8, 9, 22] is a\ngeneralization of the classical Dempster-Shafer theory (DST) [18] which allows to formally combine any types of\nsources of information (rational, uncertain or paradoxical). The DSmT is able to solve complex fusion problems\nwhere the DST usually fails, specially when conflicts (paradoxes) between sources become large and when the\nrefinement of the frame of discernment Θ is inaccessible because of the vague, relative and imprecise nature of\nelements of Θ (see [9] for justification and examples). The foundation of DSmT is based on the definition of\nthe hyper-powerset DΘ of a general frame of discernment Θ. Θ must be considered as a set {θ1 , . . . , θn } of n\nelements considered as exhaustive which cannot be precisely defined and separated so that no refinement of Θ\nin a new larger set Θref of disjoint elementary hypotheses is possible in contrast with the classical DempsterShafer Theory (DST). The DSmT deals directly with paradoxical/conflicting sources of information into this new\nformalism and proposes a new and very simple (associative and commutative) rule of combination for conflicting\nsources of informations (corpus/bodies of evidence). Some interesting results based on DSmT approach can be\nfound in [24, 4]. Before going deeper into the DSmT it is necessary to briefly present first the foundations of\nthe DST and DSmT for a better understanding of the important differences between these two theories.\n\n2\n\nShort presentation of the DST\n\nLet Θ = {θ1 , θ2 , . . . , θn } be the frame of discernment of the problem under consideration having n exhaustive\nand exclusive elementary hypothesis θi . This corresponds to the Shafer's model of the problem. Such model\nassumes that an ultime refinement of the problem is possible so that θi are well precisely defined/identified in\nsuch a way that we are sure that they are exclusive and exhaustive. From this Shafer's model, a basic belief\nassignment (bba) m(.) : 2Θ → [0, 1] associated to a given body of evidence B (also called sometimes corpus of\nevidence) is defined by\nX\nm(A) = 1\n(1)\nm(∅) = 0\nand\nA∈2Θ\n\n\f2\nwhere 2Θ is called the powerset of Θ, i.e. the set of all subsets of Θ. From any bba, one defines the belief and\nplausibility functions of A ⊆ Θ as\nX\nBel(A) =\nm(B)\n(2)\nB∈2Θ ,B⊆A\n\nPl(A) =\n\nX\n\nm(B) = 1 − Bel(Ā)\n\n(3)\n\nB∈2Θ ,B∩A6=∅\n\nNow let Bel1 (.) and Bel2 (.) be two belief functions over the same frame of discernment Θ and their corresponding bba m1 (.) and m2 (.) provided by two distinct bodies of evidence B1 and B2 . Then the combined global\nbelief function denoted Bel(.) = Bel1 (.) ⊕ Bel2 (.) is obtained by combining the information granules m1 (.) and\nm2 (.) through the following Dempster's rule of combination [m1 ⊕ m2 ](∅) = 0 and ∀B 6= ∅ ∈ 2Θ ,\nP\nX∩Y =B m1 (X)m2 (Y )\nP\n(4)\n[m1 ⊕ m2 ](B) =\n1 − X∩Y =∅ m1 (X)m2 (Y )\n\nP\nThe notation X∩Y =B represents the sum over all X, Y ∈ 2Θ such that X ∩ Y = B. The orthogonal sum\nm(.) , [m1 ⊕ m2 ](.) is considered\nas a basic belief assignment if and only if the denominator in equation (4) is\nP\nnon-zero. The term k12 , X∩Y =∅ m1 (X)m2 (Y ) is called degree of conflict between the sources B1 and B2 .\nWhen k12 = 1, the orthogonal sum m(.) does not exist and the bodies of evidences B1 and B2 are said to be\nin full contradiction. Such a case can arise when there exists A ⊂ Θ such that Bel1 (A) = 1 and Bel2 (Ā) = 1.\nSame kind of trouble can occur also with the Optimal Bayesian Fusion Rule (OBFR) [6, 7].\n\nThe DST is attractive for the Data Fusion community because it gives a nice mathematical model for ignorance and it includes the Bayesian theory as a special case [18] (p. 4). Although very appealing, the DST\npresents some weaknesses and limitations because of its model itself, the theoretical justification of the Dempster's rule of combination but also because of our confidence to trust the result of Dempster's rule of combination\nwhen the conflit becomes important between sources (k12 ր 1).\nThe Dempster's rule of combination has however been a posteriori justified by the Smet's axiomatic of the\nTransferable Belief Model (TBM) in [23]. But we must also emphasize here that an infinite number of possible\nrules of combinations can be built from the Shafer's model following ideas initially proposed in [17] and corrected\nhere as follows:\n• one first has to compute m(∅) by\nm(∅) ,\n\nX\n\nm1 (A)m2 (B)\n\nA∩B=∅\n\n• P\nthen one redistributes m(∅) on all (A 6= ∅) ⊆ Θ with some given coefficients wm (A) ∈ [0, 1] such that\nA⊆Θ wm (A) = 1 according to\n(\n\nwm (∅)m(∅) → m(∅)\nm(A) + wm (A)m(∅) → m(A), ∀A 6= ∅\n\n(5)\n\nThe particular choice of the set of coefficients wm (.) provides a particular rule of combination. Actually there\nexists an infinite number of possible rules of combination. Some rules can be better justified than others\ndepending on their ability or not to preserve associativity and commutativity properties of the combination. It\ncan be easily shown in [17] that such general procedure provides all existing rules developed in the literature\nfrom the Shafer's model as alternative to the primeval Dempster's rule of combination depending on the choice\nof coefficients w(A). As example the Dempster's rule of combination can be obtained from (5) by choosing\nwm (∅) = 0 and wm (A) = m(A)/(1 − m(∅)) for all A 6= ∅. The Yager's rule of combination is obtained by\nchoosing wm (Θ) = 1 while the \"Smets' rule of combination\" is obtained by choosing wm (∅) = 1 and thus\naccepting the possibility to deal with bba such that m(∅) > 0.\n\n\f3\n\n3\n\nFoundations of the DSmT\n\nThe development of the Dezert-Smarandache theory of plausible and paradoxical reasoning (called DSmT\nfor short) comes from the necessity to overcome the two following inherent limitations of the DST which are\nclosely related with the acceptance of the third middle excluded principle, i.e.\n(C1) - the DST considers a discrete and finite frame of discernment Θ based on a set of exhaustive and exclusive\nelementary elements θi .\n(C2) - the bodies of evidence are assumed independent and provide their own belief function on the powerset\n2Θ but with same interpretation for Θ.\nThe foundation of the DSmT is based on the refutation of the principle of the third excluded middle for\na wide class of fusion problems due to the nature of the elements of Θ. By accepting the third middle, we\ncan easily handle the possibility to deal directly with paradoxes (partial vague overlapping elements/concepts)\nof the frame of discernment. This is the DSm model. In other words, we include the third exclude directly\ninto the formalism to develop the DSmT and relax the (C1) and (C2) constraints of the Shafer's model. By\ndoing this, a wider class of fusion problem can be attacked by the DSmT. The relaxation of the constraint\n(C1) can be justified since, in many problems (see example in [9]), the elements of Θ generally correspond only\nto imprecise/vague notions and concepts so that no refinement of Θ satisfying the first constraint is actually\npossible (specially if natural language is used to describe elements of Θ).\nThe DSmT refutes also the excessive requirement imposed by (C2) in the Shafer's model, since it seems\nclear to us that, the same frame Θ may be interpreted differently by the distinct bodies of evidence (experts).\nSome subjectivity on the information provided by a source of information is almost unavoidable, otherwise this\nwould assume, as within the DST, that all bodies of evidence have an objective/universal (possibly uncertain)\ninterpretation or measure of the phenomena under consideration which unfortunately rarely occurs in reality,\nbut when bba are based on some objective probabilities transformations. But in this last case, probability theory\ncan handle properly the information; and the DST, as well as the DSmT, becomes useless. If we now get\nout of the probabilistic background argumentation, we claim that in most of cases, the sources of evidence\nprovide their beliefs about some hypotheses only with respect to their own worlds of knowledge and experience\nwithout reference to the (inaccessible) absolute truth of the space of possibilities. The DSmT includes the\npossibility to deal with evidences arising from different sources of information which don't have access to\nabsolute interpretation of the elements Θ under consideration. The DSmT can be interpreted as a general and\ndirect extension of Bayesian theory and the Dempster-Shafer theory in the following sense. Let Θ = {θ1 , θ2 } be\nthe simpliest frame of discernment involving only two elementary hypotheses (with no additional assumptions\non θ1 and θ2 ), then\n• the probability theory deals with basic probability assignments (bpa) m(.) ∈ [0, 1] such that m(θ1 ) +\nm(θ2 ) = 1\n• the DST deals with bba m(.) ∈ [0, 1] such that m(θ1 ) + m(θ2 ) + m(θ1 ∪ θ2 ) = 1\n• the DSmT theory deals with generalized bba m(.) ∈ [0, 1] such that m(θ1 )+m(θ2 )+m(θ1 ∪θ2 )+m(θ1 ∩θ2 ) =\n1\n\n3.1\n\nNotion of hyper-powerset D Θ\n\nOne of the cornerstones of the DSmT is the notion of hyper-powerset which is now presented. Let Θ =\n{θ1 , . . . , θn } be a set of n elements which cannot be precisely defined and separated so that no refinement of\nΘ in a new larger set Θref of disjoint elementary hypotheses is possible (we abandon here the Shafer's model).\nThe hyper-powerset DΘ is defined as the set of all composite propositions built from elements of Θ with ∪ and\n∩ (Θ generates DΘ under operators ∪ and ∩) operators such that\n1. ∅, θ1 , . . . , θn ∈ DΘ .\n2. If A, B ∈ DΘ , then A ∩ B ∈ DΘ and A ∪ B ∈ DΘ .\n3. No other elements belong to DΘ , except those obtained by using rules 1 or 2.\n\n\f4\nThe dual (obtained by switching ∪ and ∩ in expressions) of DΘ is itself. There are elements in DΘ which are\nself-dual (dual to themselves), for example α8 for the case when n = 3 in the example below. The cardinality\nn\nof DΘ is majored by 22 when Card(Θ) = |Θ| = n. The generation of hyper-power set DΘ is closely related\nwith the famous Dedekind's problem [5, 3] on enumerating the set of monotone Boolean functions as it will be\npresented in the sequel with the generation of the elements of DΘ .\nExample of the first hyper-powersets DΘ\nIn the degenerate case (n = 0) where Θ = {}, one has DΘ = {α0 , ∅} and |DΘ | = 1. When Θ = {θ1 },\none has DΘ = {α0 , ∅, α1 , θ1 } and |DΘ | = 2. When Θ = {θ1 , θ2 }, one has DΘ = {α0 , α1 , . . . , α4 } and\n|DΘ | = 5 with α0 , ∅, α1 , θ1 ∩ θ2 , α2 , θ1 , α3 , θ2 and α4 , θ1 ∪ θ2 . When Θ = {θ1 , θ2 , θ3 }, one has\nDΘ = {α0 , α1 , . . . , α18 } and |DΘ | = 19 (see [9] for details) with\nαi\nα0 , ∅\nα1 , θ1 ∩ θ2 ∩ θ3\nα2 , θ1 ∩ θ2\nα3 , θ1 ∩ θ3\nα4 , θ2 ∩ θ3\nα5 , (θ1 ∪ θ2 ) ∩ θ3\nα6 , (θ1 ∪ θ3 ) ∩ θ2\nα7 , (θ2 ∪ θ3 ) ∩ θ1\nα8 , [(θ1 ∩ θ2 ) ∪ θ3 ] ∩ (θ1 ∪ θ2 )\nα9 , θ1\nα10 , θ2\nα11 , θ3\nα12 , (θ1 ∩ θ2 ) ∪ θ3\nα13 , (θ1 ∩ θ3 ) ∪ θ2\nα14 , (θ2 ∩ θ3 ) ∪ θ1\nα15 , (θ1 ∪ θ2 )\nα16 , (θ1 ∪ θ3 )\nα17 , (θ2 ∪ θ3 )\nα18 , (θ1 ∪ θ2 ∪ θ3 )\nNote that the classical complementary Ā of any proposition A (except for ∅ and Θ), is not involved within\nDSmT because of the refutation of the third excluded middle. |DΘ | for n ≥ 1 follows the sequence of Dedekind's\nnumbers1 1,2,5,19,167,7580,7828353,... [20].\nFrom a general frame of discernment Θ, we define a map m(.) : DΘ → [0, 1] associated to a given body of\nevidence B which can support paradoxical information, as follows\nX\nm(∅) = 0\nand\nm(A) = 1\nA∈DΘ\n\nThe quantity m(A) is called A's generalized basic belief assignment (gbba) or the generalized basic belief mass\nfor A. The belief and plausibility functions are defined in almost the same manner as within the DST, i.e.\nX\nX\nm(B)\nBel(A) =\nm(B)\nand\nPl(A) =\nB⊆A\n\nB∈DΘ\n\nB∩A6=∅\nB∈DΘ\n\nThese definitions are compatible with the DST definitions when the sources of information become uncertain\nbut rational (they do not support paradoxical information). We still have ∀A ∈ DΘ , Bel(A) ≤ Pl(A).\n1 Actually this sequence corresponds to the sequence of Dedekind minus one since we don't count the last degenerate isotone\nfunction f22n −1 (.) as element of D Θ (see section 4.2)\n\n\f5\n\n3.2\n\nThe DSm rule of combination\n\nThe DSm rule of combination m(.) , [m1 ⊕ m2 ](.) of two distinct (but potentially paradoxical) sources of\nevidences B1 and B2 over the same general frame of discernment Θ with belief functions Bel1 (.) and Bel2 (.)\nassociated with general information granules m1 (.) and m2 (.) is given by ∀C ∈ DΘ ,\nX\nm(C) =\nm1 (A)m2 (B)\n(6)\nA,B∈DΘ ,A∩B=C\n\nSince DΘ is closed under ∪ and ∩ operators, this new rule of combination guarantees that m(.) : DΘ → [0, 1] is\na proper general information granule. This rule of combination is commutative and associative and can always\nbe used for the fusion of paradoxical or rational sources of information (bodies of evidence). It is important to\nnote that any fusion of sources of information generates either uncertainties, paradoxes or more generally both.\nThis is intrinsic to the general fusion process itself. The theoretical justification of the DSm rule can be found\nin [9].\nThis DSm rule of combination seems at the first glance very expensive in terms of computations and memory\nsize due to the huge number of elements in DΘ . This is only true if the cores (the set of focal elements of gbba)\nK1 (m1 ) and K2 (m2 ) coincide with DΘ ; in other words when m1 (A) > 0 and m2 (A) > 0 for all A 6= ∅ ∈ DΘ .\nFortunately, it is important to note here that in most of practical applications the sizes of K1 (m1 ) and K2 (m2 )\nare much smaller than |DΘ | because bodies of evidence generally allocate their basic belief assignments only\nover a subset of hyper-powerset. This makes things easier for the implementation of the DSm rule (6). The\nDSm rule is actually very easy to implement. It suffices for each focal element of K1 (m1 ) to multiply it with\nthe focal elements of K2 (m2 ) and then to pool all combinations which are logically equivalent under the algebra\nof sets according to the following scheme\n\nFigure 1: Representation of the DSm rule\nThe figure above represents the DSm network architecture of the DSm rule of combination. The first layer\nof the network consists in all bba of focal elements Ai , i = 1, . . . , n of m1 (.). The second layer of the network\nconsists in all bba of focal elements Bj , j = 1, . . . , k of m2 (.). Each node of layer 2 is connected with each node\nof layer 1. The output layer (on the right) consists in the combined basic belief assignments of all possible\nintersections Ai ∩ Bj , i = 1, . . . , n and j = 1, . . . , k. The last step of DSm rule (not included on the figure due to\nspace limitation) consists in the compression of the output layer by regrouping (additioning) all the combined\nbelief assignments corresponding to the same focal elements (by example if X = A2 ∩ B3 = A4 ∩ B5 , then\nm(X) = m(A2 ∩ B3 ) + m(A4 ∩ B5 )). If a third body of evidence provides a new bba m3 (.), the one can combine\nit by connecting the output layer with the layer associated to m3 (.), and so on. Because of commutativity and\nassociativity properties of DSm rule, the DSm network can be designed with any order for the layers. The DSm\nrule of combination can be used for the fusion of any kind of information, whereas the Dempster's rule within\nShafer's model can not be used in cases where paradoxist information occurs, or degree of conflict is 1, or when\nelements of the frame of discernment are not refinable in exclusive finer atoms.\n\n\f6\n\n4\n4.1\n\nThe generation of DΘ\nMemory size requirements\n\nBefore going further on the generation of DΘ , it is important to estimate the memory size for storing the\nelements of DΘ for |Θ| = n. Since each element of DΘ can be stored as a 2n − 1-binary string, the memory size\nfor DΘ is given by the right column of the following table (we do not count the size for ∅ which is 0 and the\nminimum length is considered here as the byte (8 bits)):\n|Θ| = n\n2\n3\n4\n5\n6\n7\n8\n\nsize/elem.\n1 byte\n1 byte\n2 bytes\n4 bytes\n8 bytes\n16 bytes\n32 bytes\n\n# of elem.\n4\n18\n166\n7579\n7828352\n≈ 2.4 * 1012\n≈ 5.6 * 1022\n\nSize of DΘ\n4 bytes\n18 bytes\n0.32 Kb\n30 Kb\n59 Mb\n3.6 * 104 Gb\n1.7 * 1015 Gb\n\nThis table shows the extreme difficulties for our computers to store all the elements of DΘ when |Θ| > 6. This\ncomplexity must be however relativized with respect to the number of all Boolean functions built from the\nultimate refinement (if accessible) 2Θref of same initial frame Θ for applying DST. The comparison of |DΘ |\nwith respect to |2Θref | is given in the following table\n|Θ| = n\n2\n3\n4\n5\n\n4.2\n\nn\n\n|2Θref | = 22 −1\n23 = 8\n27 = 128\n215 = 32768\n231 = 2147483648\n\n|DΘ |\n5\n19\n167\n7580\n\nMonotone Boolean functions\n\nA simple Boolean function f (.) maps n-binary inputs (x1 , . . . , xn ) ∈ {0, 1}n , {0, 1} × . . .× {0, 1} to a single\nbinary output y = f (x1 , . . . , xn ) ∈ {0, 1}. Since there are 2n possible input states which can map to either 0 or\nn\n1 at the output y, the number of possible boolean functions is 22 . Each of these functions can be realized by\nthe logic operations ∧ (and), ∨ (or) and ¬ (not) [3, 28]. As simple example, let consider only a 2-binary input\n2\nvariable (x1 , x2 ) ∈ {0, 1} × {0, 1} then all the 22 = 16 possible Boolean functions fi (x1 , x2 ) built from (x1 , x2 )\nare summarized in the following tables\n(x1 , x2 )\n(0, 0)\n(0, 1)\n(1, 0)\n(1, 1)\nNotation\n\nf0\n0\n0\n0\n0\nFalse\n\n(x1 , x2 )\n(0, 0)\n(0, 1)\n(1, 0)\n(1, 1)\nNotation\n\nf8\n1\n0\n0\n0\n ̄ x2\nx1 ∨\n\nf1\n0\n0\n0\n1\nx1 ∧ x2\nf9\n1\n0\n0\n1\nx1 △x2\n\nf2\n0\n0\n1\n0\nx1 ∧ x̄2\nf10\n1\n0\n1\n0\nx̄2\n\nf3\n0\n0\n1\n1\nx1\n\nf11\n1\n0\n1\n1\nx1 ∨ x̄2\n\nf4\n0\n1\n0\n0\nx̄1 ∧ x2\n\nf5\n0\n1\n0\n1\nx2\n\nf12\n1\n1\n0\n0\nx̄1\n\nf13\n1\n1\n0\n1\nx̄1 ∨ x2\n\nf6\n0\n1\n1\n0\nx1 ⊻ x2\nf14\n1\n1\n1\n0\nx1 ⊼ x2\n\nf7\n0\n1\n1\n1\nx1 ∨ x2\nf15\n1\n1\n1\n1\nTrue\n\n ̄ x2 , ¬(x1 ∨x2 ) (nor), x1 △x2 , (x1 ∧x2 )∨(x̄1 ∧\nwith the notation x̄ , ¬x, x1 ⊻x2 , (x1 ∨x2 )∧(x̄1 ∨ x̄2 ) (xor), x1 ∨\nx̄2 ) (xnor) and x1 ⊼x2 , ¬(x1 ∧x2 ) (nand). We denote by Fn (∧, ∨, ¬) = {f0 (x1 , . . . , xn ), . . . , f22n −1 (x1 , . . . , xn )}\nthe set of all possible Boolean functions built from n-binary inputs. Let x , (x1 , . . . , xn ) and x′ , (x′ 1 , . . . , x′ n )\nbe two vectors in {0, 1}n. Then x precedes x′ and we denote x \u0016 x′ if and only if xi ≤ x′ i for 1 ≤ i ≤ n (≤ is\napplied componentwise). If xi < x′ i for 1 ≤ i ≤ n then x strictly precedes x′ which will be denoted as x ≺ x′ .\n\n\f7\nA Boolean function f is said to be a non-decreasing monotone (or isotone) Boolean function (or just monotone Boolean function for short) if and only if ∀x, x′ ∈ {0, 1}n such that x \u0016 x′ , then f (x) \u0016 f (x′ ) [26].\nSince any isotone Boolean function involves only ∧ and ∨ operators (no ¬ operations) [28] and there exists a\ncorrespondance between (∨, ∧) operators in logics with (+, *) in algebra of numbers and (∪, ∩) in algebra of\nsets, the generation of all elements of DΘ built from Θ with ∪ and ∩ operator is equivalent to the problem\nof generating isotone Boolean functions over the vertices of the unit n-cube. We denote by Mn (∧, ∨) the set\nof all possible monotone Boolean functions built from n-binary inputs. Mn (∧, ∨) is a subset of Fn (∧, ∨, ¬).\nIn the previous example, f1 (x1 , x2 ), f3 (x1 , x2 ), f5 (x1 , x2 ), f7 (x1 , x2 ) are isotone Boolean functions but special\nfunctions f0 (x1 , x2 ) and f22n −1 (x1 , . . . , xn ) must also be considered as monotone functions too. All the other\nfunctions belonging to F2 (∧, ∨, ¬) do not belong to M2 (∧, ∨) because they require the ¬ operator in their expressions and we can check easily that the monotonicity property x \u0016 x′ ⇒ f (x) \u0016 f (x′ ) does not hold for these\nfunctions. The Dedekind's problem [5] is to determine the number d(n) of distinct monotone Boolean functions\nof n-binary variables. Dedekind [5] computed d(0) = 2, d(1) = 3, d(2) = 6, d(3) = 20 and d(4) = 168. Church\n[1] computed d(5) = 7581 in 1940. Ward [27] computed d(6) = 7828354 in 1946. Church [2] then computed\nd(7) = 2414682040998 in 1965. Between sixties and eighties, important advances have been done to obtain upper\nand lower bounds for d(n) [12, 14, 16]. In 1991, Wiedemann [29] computed d(8) = 56130437228687557907788\n(200 hours of computing time with a Cray-2 processor) which has recently been validated by Fidytek and al. in\n[11]. Until now the computation of d(n) for n > 8 is still a challenge for mathematicians even if the following\ndirect exact explicit formula for d(n) has been obtained by Kisielewicz and Tombak (see [13, 25] for proof) :\n2n\n\nd(n) =\n\nn\n\n2\n2Y\n−1 j−1\nY\nX\n\nk=1 j=1 i=0\n\n(1 − bki (1 − bkj )\n\nl(i)\nY\n\n(1 − bim (1 − bjm )))\n\nm=0\n\nwhere l(0) = 0 and l(i) = [log2 i] for i > 0, bki , [k/2i ] − 2[k/2i+1 ] and [x] denotes the floor function (i.e. the\nnearest integer less or equal to x). The difficulty arises from the huge number of terms involved in the formula,\nthe memory size and the highspeed computation requirements. The last advances and state of art in counting\nalgorithms of Dedekind's numbers can be found in [25, 11, 26].\n\n4.3\n\nGeneration of MBF\n\nBefore describing the general algorithm for generating the monotone Boolean functions (MBF), let examine\ndeeper the example of section 4.1. From previous tables, one can easily find the set of (restricted) MBF\nM⋆2 (∧, ∨) = {f0 (x1 , x2 ) = False, f1 (x1 , x2 ) = x1 ∧ x2 , f5 (x1 , x2 ) = x2 , f7 (x1 , x2 ) = x1 ∨ x2 } which is equivalent,\nusing algebra of sets, to hyper-powerset DX = {∅, x1 ∩ x2 , x1 , x2 , x1 ∪ x2 } associated with frame of discernment\nX = {x1 , x2 }. Since the tautology f15 (x1 , x2 ) is not involved within DSmT, we do not include it as a proper\nelement of DX and we consider only M⋆2 (∧, ∨) , M2 (∧, ∨) \\ {f15 } rather than M2 (∧, ∨) itself. Let's now\nintroduce the Smarandache's codification for the enumeration of distinct parts of a Venn diagram X with n\npartially overlapping elements xi ,i = 1, 2, . . . , n. A such diagram has 2n − 1 disjoint parts. One notes with only\none digit (or symbol) those parts which belong to only one of the elements xi (one notes by < i > the part which\nbelongs to xi only, for 1 ≤ i ≤ n), with only two digits (or symbols) those parts which belong to exactly two\nelements (one notes by < ij >, with i < j, the part which belongs to xi and xj only, for 1 ≤ i < j ≤ n), then\nwith only three digits (or symbols) those parts which belong to exactly three elements (one notes by < ijk >\nconcatenated numbers, with i < j < k, the part which belongs to xi , xj , and xk only, for 1 ≤ i < j < k ≤ n),\nand so on up to < 12 . . . n > which represents the last part that belongs to all elements xi . For 1 ≤ n ≤ 9,\nthe Smarandache's encoding works normally as in base 10. But, for n ≥ 10, because there occur two (or more)\ndigits/symbols in notation of the elements starting from 10 on, one considers this codification in base n + 1,\ni.e. using one symbol to represent two (or more) digits, for example: A = 10, B = 11, C = 12, etc. For n = 1\none has only one part, coded < 1 >. For n = 2 one has three parts, coded < 1 >, < 2 >, < 12 >. Generally,\n< ijk > does not represent xi ∩ xj ∩ xk but only a part of it, the only exception is for < 12 . . . n >. For n = 3\none has 23 − 1 = 7 disjoint parts, coded < 1 >, < 2 >, < 3 >, < 12 >, < 13 >, < 23 >, < 123 >. < 23 >\nmeans the part which belongs to x2 and x3 only, but < 23 >6= x2 ∩ x3 because x2 ∩ x3 = {< 23 >, < 123 >} in\nthe Venn diagram of 3 elements x1 , x2 , and x3 .The generalization for n > 3 is straightforward. Smarandache's\ncodification can be organized in a numerical increasing order, in lexicographic order or any other orders. An\nuseful order for organizing the Smarandache's codification for the generation of DΘ is the Dezert-Smarandache\n\n\f8\norder un = [u1 , . . . , u2n −1 ]′ based on a recursive construction starting with u1 , [< 1 >]. Having constructed\nun−1 , then we can construct un for n > 1 recursively as follows:\n• include all elements of un−1 into un ;\n• afterwards, include element < n > as well in un ;\n• then at the end of each element of un−1 concatenate the element < n > and get a new set u′ n−1 which\nthen is also included in un .\nThis is un , which has (2n−1 − 1) + 1 + (2n−1 − 1) = 2n − 1 components. For n = 3, as example, one gets\nu3 , [< 1 > < 2 > < 12 > < 3 > < 13 > < 23 > < 123 >]′ . Because all elements in un are disjoint, we are\nable to write each element di of DX in a unique way as a linear combination of un elements, i.e.\ndn = [d1 , . . . , d2n −1 ]′ = Dn * un\n\n(7)\n\nThus un constitutes a basis for generating the elements of DX . Each row in the matrix Dn represents the\ncoefficients of an element of DX with respect to the basis un . The rows of Dn may also be regarded as binary\nnumbers in an increasing order. As example, for n = 2, one has:\n \n\n\n\nd1 = x1 ∩ x2\n0 0 1 \n<1>\n d2 = x2  0 1 1\n \n\n \n\n(8)\n d3 = x1  = 1 0 1 * < 2 >\n< 12 >\nd4 = x1 ∪ x2\n1 1 1 | {z }\n|\n{z\n} |\n{z\n}\nu2\nd2\n\nD2\n\nwhere the \"matrix product\" is done after identifying (+, *) with (∪, ∩), 0* < x > with ∅ and 1* < x > with\n< x >. The generation of DX is then strictly equivalent to generate un and matrix Dn which can be easily\nobtained by the following recursive procedure:\n• start with Dc0 = [0 1]′ corresponding to all Boolean functions with no input variable (n = 0).\n• build the Dc1 matrix from each row ri of Dc0 by adjoining it to any other row rj of Dc0 such that ri ∪rj = rj .\nThis is equivalent here to add either 0 or 1 in front (i.e. left side) of r1 ≡ 0 but only 1 in front of r2 ≡ 1.\nSince the tautology is not involved in hyper-powerset, then one has to remove the first column and the\nlast line of\n\n\n\u0014 \u0015\n0 0\n0\nDc1 = 0 1 to obtain finally D1 =\n1\n1 1\n\n• build Dc2 from Dc1 by adjoining to each row ri of Dc1 , any row rj of Dc1 such that ri ∪ rj = rj and then\nremove the first column and the last line of Dc2 to get D2 as in (8).\n• build Dc3 from Dc2 by adjoining to each row ri of Dc2 any row rj of Dc2 such that ri ∪ rj = rj and then\n\n\f9\nremove the first column and the last line of Dc3\n\n0\n0\n\n0\n\n0\n\n0\n\n0\n\n0\n\n0\n\n0\n\nD3 = \n0\n0\n\n0\n\n0\n\n0\n\n1\n\n1\n\n1\n\n1\n1\n\nto get D3 given by\n\n0 0 0 0 0 0\n0 0 0 0 0 1\n\n0 0 0 0 1 1\n\n0 0 0 1 0 1\n\n0 0 0 1 1 1\n\n0 0 1 1 1 1\n\n0 1 0 0 0 1\n\n0 1 0 0 1 1\n\n0 1 0 1 0 1\n\n0 1 0 1 1 1\n\n0 1 1 1 1 1\n\n1 1 0 0 1 1\n\n1 1 0 1 1 1\n\n1 1 1 1 1 1\n\n0 1 0 1 0 1\n\n0 1 0 1 1 1\n\n0 1 1 1 1 1\n\n1 1 0 1 1 1\n1 1 1 1 1 1\n\n• Likewise, Dcn is built from Dcn−1 by adjoining to each row ri of Dcn−1 any row rj of Dcn−1 such that\nri ∪ rj = rj . Then Dn is obtained by removing the first column and the last line of Dcn .\nFor convenience, we provide here the source code in Matlab language to generate DΘ . This code includes the\nidentification of elements of DΘ corresponding to each monotone Boolean function according to the Smarandache's codification.\n%∗ ∗ ∗ ∗ ∗ ∗ ∗ ∗ ∗ ∗ ∗ ∗ ∗ ∗ ∗ ∗∗ ∗∗ ∗ ∗∗ ∗∗ ∗ ∗∗ ∗∗ ∗∗ ∗ ∗∗ ∗∗ ∗ ∗∗ ∗∗ ∗ ∗∗ ∗∗ ∗ ∗\n% C o p yr ig h t ( c )\n2 0 0 3 J . De z e r t and F . Smarandache\n%\n% Purpose : G e ne r a t io n o f Dˆ Theta f o r t h e DSmT f o r\n% Theta={t h e t a 1 , . . , Theta n } . Due t o t h e huge\n% # o f e l e m e n t s o f Dˆ Theta o n l y c a s e s up t o n<7\n% a r e u s u a l l y t r a c t a b l e on computers .\n%∗ ∗ ∗ ∗ ∗ ∗ ∗ ∗ ∗ ∗ ∗ ∗ ∗ ∗ ∗ ∗∗ ∗∗ ∗ ∗∗ ∗∗ ∗ ∗∗ ∗∗ ∗∗ ∗ ∗∗ ∗∗ ∗ ∗∗ ∗∗ ∗ ∗∗ ∗∗ ∗ ∗\nn=input ( ' E n t e r c a r d i n a l i t y f o r Theta (0 <n <6) ? ' ) ;\n% G e ne r a t io n o f t h e Smarandache c o d i f i c a t i o n\n% Note : t h i s s h o u l d be implemented u s i n g\n% c h a r a c t e r s t r i n g s f o r n>9\nu n =[1];\nf o r nn =2:n\nu n =[ u n nn ( u n ∗10+nn∗ o n e s ( 1 , s i z e ( u n ∗ 1 0 , 2 ) ) ) ] ;\nend\n% G e ne r a t io n o f D n ( i s o t o n e b o o l e a n f u n c t i o n s )\nD n1 = [ 0 ; 1 ] ;\nf o r nn =1:n , D n = [ ] ;\nf o r i =1: s i z e ( D n1 , 1 ) , L i=D n1 ( i , : ) ;\nf o r j=i : s i z e ( D n1 , 1 )\nL j=D n1 ( j , : ) ; L i i n t e r L j=and ( Li , L j ) ;\nL i u n i o n L j=o r ( Li , L j ) ;\ni f ( ( L i i n t e r L j==L i )&( L i u n i o n L j==L j ) )\nD n=[D n ; L i L j ] ;\nend\nend\nend\nD n1=D n ;\nend\nDD=D n ;DD( : , 1 ) = [ ] ;DD( s i z e (DD, 1 ) , : ) = [ ] ; D n=DD;\n% Result d isp l a y\ndisp ( [ ' | Theta |=n= ' , num2str( n ) ] )\ndisp ( [ ' |Dˆ Theta |= ' , num2str( s i z e ( D n , 1 ) ) ] )\ndisp ( ' Elem . o f Dˆ Theta a r e o b t a i n e d by D n∗ u n ' )\ndisp ( [ ' wi t h u n =[ ' , num2str( u n ) , ' ] ' ' and ' ] )\nD n=D n\n\nMatlab2 source code for generating DΘ\n2 Matlab\n\nis a trademark of The MathWorks, Inc.\n\n\f10\n\n5\n\nConclusion\n\nThe DSmT proposes a new solution to combine conflicting sources of information in some problems where\nthe frame of discernment Θ = {θ1 , . . . , θn } cannot be considered as an exhaustive and exclusive finite set of\nhypotheses. The DSmT deals with elements θi which have possibly (but not necessarily) continuous and/or\nrelative interpretation to the corpus of evidences (like the notions of smallness/tallness, beauty/ugliness, pleasure/pain, heat/coldness, even the notion of colors - due to the continuous spectrum of the light, . . .); the\ninterpretation of θi through the bba mechanism given by each source being, in general, built only from its own\nlimited knowledge/experience and senses. This DSm model can be considered as the opposite of the Shafer's\nmodel on which is based the DST. The DSmT, based on the notion of hyper-powerset DΘ over Θ and the\nrefutation of the third middle excluded, requires in theory to manipulate the basic beliefs assigned of every\nelement of DΘ . A powerful method and a source code to generate recursively all the elements of DΘ has been\npresented in this paper to help the reader to solve a wide class of fusion problems with the DSmT.\n\nReferences\n[1] Church R., Numerical analysis of certain free distributive structures, Duke Math. J., Vol. 6, no. 3, pp.\n732-734, 1940.\n[2] Church R., Enumeration by rank of the elements of the free distributive lattice with seven generators, Not.\nAmer. Math. Soc., Vol. 12, p. 724, 1965.\n[3] Comtet L., Sperner Systems, sec.7.2 in Advanced Combinatorics: The Art of Finite and Infinite Expansions,\nD. Reidel Publ. Co., pp. 271-273, 1974.\n[4] Corgne S., Hubert-Moy L., Dezert J., Mercier G., Land cover change prediction with a new theory of\nplausible and paradoxical reasoning, Proc. of Fusion 2003 Conf., Cairns, Australia, July 8-11, 2003.\n[5] Dedekind R. Über Zerlegungen von Zahlen durch ihre grössten gemeinsammen Teiler, In Gesammelte\nWerke, Bd. 1. pp. 103-148, 1897.\n[6] Dezert J., Optimal Bayesian fusion of multiple unreliable classifiers, Proc. of Fusion 2001 Conf., Montréal,\nCanada, Aug. 8-11, 2001.\n[7] Dezert J., Combination of paradoxical sources of information within the Neutrosophic framework, in [22]\npp. 22–46.\n[8] Dezert J., Foundations for a new theory of plausible and paradoxical reasoning, Inform. & Secur. J., Semerdjiev Ed., Bulg. Acad. of Sci., Vol. 9, 2002.\n[9] Dezert J., Fondations pour une nouvelle théorie du raisonnement plausible et paradoxal, ONERA Tech.\nRep. RT 1/06769/DTIM, Jan. 2003.\n[10] Dezert J., Smarandache F., Daniel M., On the generalized pignistic transformation based on DSmT framework, (to be submitted), 2003.\n[11] Fidytek R., Mostowski A.W., Somla R., Szepietowski A., Algorithms counting monotone Boolean functions,\nInform. Proc. Letters, Vol. 79, pp. 203-209, 2001.\n[12] Hansel G., Sur le nombre des fonctions booléennes monotones de n variables, C.R. Acad. Sci. Paris, Serie\nA-B, p. 262, 1966.\n[13] Kisielewicz A., A solution of Dedekind's problem on the number of isotone Boolean functions, J. reine\nangew. math., Vol. 386, pp. 139-144, 1988.\n[14] Kleitman D., On Dedekind's problem: The number of Boolean functions, Proc. of the Amer. Math Society,\nVol. 21, pp. 677-682, 1969.\n[15] Kleitman D., Markowsky G., On Dedekind's problem: The number of isotone Boolean functions. II, Trans.\nof the Amer. Math. Soc., Vol. 213, 1976.\n\n\f11\n[16] Korshunov A., On the number of Boolean functions, Prob. kibernetiki, Vol. 38, pp. 5-108, 1981.\n[17] Lefevre E., Colot O., Vannoorenberghe P. \"Belief functions combination and conflict management\", Inform.\nFusion Journal, Elsevier, 2002.\n[18] Shafer G., A Mathematical Theory of Evidence, Princeton Univ. Press, Princeton, NJ, 1976.\n[19] Shapiro H.N. On the counting problem for monotone Boolean functions, Comm. on pure and applied math.,\nVol. XXIII, pp. 299-312, 1970.\n[20] Sloane N.J.A., The On-line Encyclopedia of Integer Sequences 2003, (Sequence No. A014466),\nhttp://www.research.att.com/~njas/sequences/.\n[21] Smarandache F., A Unifying Field in Logics: Neutrosophic Logic. Neutrosophy, Neutrosophic Set, Probability, and Statistics, (2nd Ed.), Amer. Research Press, Rehoboth, 2000.\n[22] Smarandache F. (Editor), Proceedings of the First International Conference on Neutrosophics, Univ. of\nNew Mexico, Gallup Campus, NM, USA, 1-3 Dec. 2001, Xiquan, Phoenix, 2002.\n[23] Smets Ph., Kennes R., The transferable belief model, Artif. Intel., 66(2), pp. 191-234, 1994.\n[24] Tchamova A., Semerdjiev T., Dezert J., Estimation of Target behavior tendencies using DSmT, Proc. of\nFusion 2003, Cairns, Australia, July 8-11, 2003.\n[25] Tombak M., Isotamm A., Tamme T., On logical method for counting Dedekind numbers, Lect. Notes on\nComp.Sci., 2138, p. 424-427, Springer-Verlag, 2001. www.cs.ut.ee/people/m_tombak/publ.html.\n[26] Triantaphyllou, E., Torvik V.I. , Inference of Monotone Boolean Functions, Encyclopedia of Optimization,\n(P.M. Pardalos and C. Floudas, Eds.), Kluwer Acad. Publi., Boston, Vol. 2, pp. 472-480., 2001.\n[27] Ward M., Note on the order of free distributive lattices , Bull. Amer. Math. Soc., Vol. 52, no. 5, p. 423,\n1946.\n[28] Weisstein E. W., CRC Concise Encyclopedia of Mathematics , CRC Press; 2nd edition, 3252 pages, Dec.\n2002. http://mathworld.wolfram.com/.\n[29] Wiedemann D., A computation of the eighth Dedekind number, Order, no. 8, pp. 5-6, 1991.\n\n\f"}