{"id": "http://arxiv.org/abs/math-ph/0702019v1", "guidislink": true, "updated": "2007-02-06T17:30:23Z", "updated_parsed": [2007, 2, 6, 17, 30, 23, 1, 37, 0], "published": "2007-02-06T17:30:23Z", "published_parsed": [2007, 2, 6, 17, 30, 23, 1, 37, 0], "title": "Specific features of differential equations of mathematical physics", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=math-ph%2F0702019%2Cmath-ph%2F0702026%2Cmath-ph%2F0702054%2Cmath-ph%2F0702034%2Cmath-ph%2F0702077%2Cmath-ph%2F0702048%2Cmath-ph%2F0702039%2Cmath-ph%2F0702090%2Cmath-ph%2F0702016%2Cmath-ph%2F0702025%2Cmath-ph%2F0702096%2Cmath-ph%2F0702028%2Cmath-ph%2F0702072%2Cmath-ph%2F0702012%2Cmath-ph%2F0702024%2Cmath-ph%2F0702027%2Cmath-ph%2F0702080%2Cmath-ph%2F0702083%2Cmath-ph%2F0702060%2Cmath-ph%2F0702056%2Cmath-ph%2F0702043%2Cmath-ph%2F0702015%2Cmath-ph%2F0702097%2Cmath-ph%2F0702062%2Cmath-ph%2F0702068%2Cmath-ph%2F0702065%2Cmath-ph%2F0702036%2Cmath-ph%2F0702049%2Cmath-ph%2F0702022%2Cmath-ph%2F0702059%2Cmath-ph%2F0702020%2Cmath-ph%2F0702087%2Cmath-ph%2F0702081%2Cmath-ph%2F0702091%2Cmath-ph%2F0702010%2Cmath-ph%2F0702085%2Cmath-ph%2F0702075%2Cmath-ph%2F0702032%2Cmath-ph%2F0702058%2Cmath-ph%2F0702040%2Cmath-ph%2F0702100%2Cmath-ph%2F0702073%2Cmath-ph%2F0702029%2Cmath-ph%2F0702045%2Cmath-ph%2F0702055%2Cmath-ph%2F0702079%2Cmath-ph%2F0702057%2Cmath-ph%2F0702007%2Cmath-ph%2F0702092%2Cmath-ph%2F0702035%2Cmath-ph%2F0702004%2Cmath-ph%2F0702002%2Cmath-ph%2F0702033%2Cmath-ph%2F0702014%2Cmath-ph%2F0110032%2Cmath-ph%2F0110005%2Cmath-ph%2F0110035%2Cmath-ph%2F0110001%2Cmath-ph%2F0110033%2Cmath-ph%2F0110028%2Cmath-ph%2F0110009%2Cmath-ph%2F0110023%2Cmath-ph%2F0110029%2Cmath-ph%2F0110015%2Cmath-ph%2F0110014%2Cmath-ph%2F0110018%2Cmath-ph%2F0110025%2Cmath-ph%2F0110038%2Cmath-ph%2F0110037%2Cmath-ph%2F0110030%2Cmath-ph%2F0110041%2Cmath-ph%2F0110010%2Cmath-ph%2F0110004%2Cmath-ph%2F0110002%2Cmath-ph%2F0110017%2Cmath-ph%2F0110020%2Cmath-ph%2F0110026%2Cmath-ph%2F0110042%2Cmath-ph%2F0110024%2Cmath-ph%2F0110022%2Cmath-ph%2F0110003%2Cmath-ph%2F0110031%2Cmath-ph%2F0110034%2Cmath-ph%2F0110027%2Cmath-ph%2F0110021%2Cmath-ph%2F0110040%2Cmath-ph%2F0110006%2Cmath-ph%2F0110011%2Cmath-ph%2F0110016%2Cmath-ph%2F0110008%2Cmath-ph%2F0110019%2Cmath-ph%2F0110012%2Cmath-ph%2F0110036%2Cmath-ph%2F0110013%2Cmath-ph%2F0110007%2Cmath-ph%2F0510050%2Cmath-ph%2F0510058%2Cmath-ph%2F0510095%2Cmath-ph%2F0510030%2Cmath-ph%2F0510053%2Cmath-ph%2F0510049&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Specific features of differential equations of mathematical physics"}, "summary": "Three types of equations of mathematical physics, namely, the equations,\nwhich describe any physical processes, the equations of mechanics and physics\nof continuous media, and field-theory equations are studied in this paper.\n  In the first and second case the investigation is reduced to the analysis of\nthe nonidentical relations of the skew-symmetric differential forms that are\nobtained from differential equations. It is shown that the integrability of\nequations and the properties of their solutions depend on the realization of\nthe conditions of degenerate transformations under which the identical\nrelations are obtained from the nonidentical relation.\n  The field-theory equations, in contrast to the equations of first two types,\nare the relations made up by skew-symmetric differential forms or their analogs\n(differential or integral ones). This is due to the fact that the field-theory\nequations have to describe physical structures (to which closed exterior forms\ncorrespond) rather than physical quantities. The equations that correspond to\nfield theories are obtained from the equations that describe the conservation\nlaws (of energy, linear momentum, angular momentum, and mass) of material\nsystems (of continuous media). This disclose a connection between field\ntheories and the equations for material systems (and points to that material\nmedia generate physical fields).", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=math-ph%2F0702019%2Cmath-ph%2F0702026%2Cmath-ph%2F0702054%2Cmath-ph%2F0702034%2Cmath-ph%2F0702077%2Cmath-ph%2F0702048%2Cmath-ph%2F0702039%2Cmath-ph%2F0702090%2Cmath-ph%2F0702016%2Cmath-ph%2F0702025%2Cmath-ph%2F0702096%2Cmath-ph%2F0702028%2Cmath-ph%2F0702072%2Cmath-ph%2F0702012%2Cmath-ph%2F0702024%2Cmath-ph%2F0702027%2Cmath-ph%2F0702080%2Cmath-ph%2F0702083%2Cmath-ph%2F0702060%2Cmath-ph%2F0702056%2Cmath-ph%2F0702043%2Cmath-ph%2F0702015%2Cmath-ph%2F0702097%2Cmath-ph%2F0702062%2Cmath-ph%2F0702068%2Cmath-ph%2F0702065%2Cmath-ph%2F0702036%2Cmath-ph%2F0702049%2Cmath-ph%2F0702022%2Cmath-ph%2F0702059%2Cmath-ph%2F0702020%2Cmath-ph%2F0702087%2Cmath-ph%2F0702081%2Cmath-ph%2F0702091%2Cmath-ph%2F0702010%2Cmath-ph%2F0702085%2Cmath-ph%2F0702075%2Cmath-ph%2F0702032%2Cmath-ph%2F0702058%2Cmath-ph%2F0702040%2Cmath-ph%2F0702100%2Cmath-ph%2F0702073%2Cmath-ph%2F0702029%2Cmath-ph%2F0702045%2Cmath-ph%2F0702055%2Cmath-ph%2F0702079%2Cmath-ph%2F0702057%2Cmath-ph%2F0702007%2Cmath-ph%2F0702092%2Cmath-ph%2F0702035%2Cmath-ph%2F0702004%2Cmath-ph%2F0702002%2Cmath-ph%2F0702033%2Cmath-ph%2F0702014%2Cmath-ph%2F0110032%2Cmath-ph%2F0110005%2Cmath-ph%2F0110035%2Cmath-ph%2F0110001%2Cmath-ph%2F0110033%2Cmath-ph%2F0110028%2Cmath-ph%2F0110009%2Cmath-ph%2F0110023%2Cmath-ph%2F0110029%2Cmath-ph%2F0110015%2Cmath-ph%2F0110014%2Cmath-ph%2F0110018%2Cmath-ph%2F0110025%2Cmath-ph%2F0110038%2Cmath-ph%2F0110037%2Cmath-ph%2F0110030%2Cmath-ph%2F0110041%2Cmath-ph%2F0110010%2Cmath-ph%2F0110004%2Cmath-ph%2F0110002%2Cmath-ph%2F0110017%2Cmath-ph%2F0110020%2Cmath-ph%2F0110026%2Cmath-ph%2F0110042%2Cmath-ph%2F0110024%2Cmath-ph%2F0110022%2Cmath-ph%2F0110003%2Cmath-ph%2F0110031%2Cmath-ph%2F0110034%2Cmath-ph%2F0110027%2Cmath-ph%2F0110021%2Cmath-ph%2F0110040%2Cmath-ph%2F0110006%2Cmath-ph%2F0110011%2Cmath-ph%2F0110016%2Cmath-ph%2F0110008%2Cmath-ph%2F0110019%2Cmath-ph%2F0110012%2Cmath-ph%2F0110036%2Cmath-ph%2F0110013%2Cmath-ph%2F0110007%2Cmath-ph%2F0510050%2Cmath-ph%2F0510058%2Cmath-ph%2F0510095%2Cmath-ph%2F0510030%2Cmath-ph%2F0510053%2Cmath-ph%2F0510049&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Three types of equations of mathematical physics, namely, the equations,\nwhich describe any physical processes, the equations of mechanics and physics\nof continuous media, and field-theory equations are studied in this paper.\n  In the first and second case the investigation is reduced to the analysis of\nthe nonidentical relations of the skew-symmetric differential forms that are\nobtained from differential equations. It is shown that the integrability of\nequations and the properties of their solutions depend on the realization of\nthe conditions of degenerate transformations under which the identical\nrelations are obtained from the nonidentical relation.\n  The field-theory equations, in contrast to the equations of first two types,\nare the relations made up by skew-symmetric differential forms or their analogs\n(differential or integral ones). This is due to the fact that the field-theory\nequations have to describe physical structures (to which closed exterior forms\ncorrespond) rather than physical quantities. The equations that correspond to\nfield theories are obtained from the equations that describe the conservation\nlaws (of energy, linear momentum, angular momentum, and mass) of material\nsystems (of continuous media). This disclose a connection between field\ntheories and the equations for material systems (and points to that material\nmedia generate physical fields)."}, "authors": ["L. I. Petrova"], "author_detail": {"name": "L. I. Petrova"}, "author": "L. I. Petrova", "arxiv_comment": "12pages", "links": [{"href": "http://arxiv.org/abs/math-ph/0702019v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/math-ph/0702019v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.DG", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.MP", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "LaTex 2e", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/math-ph/0702019v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/math-ph/0702019v1", "journal_reference": null, "doi": null, "fulltext": "Specific features of differential equations\nof mathematical physics\nL. I. Petrova\n\narXiv:math-ph/0702019v1 6 Feb 2007\n\nAbstract\nThree types of equations of mathematical physics, namely, the equations, which describe any physical processes, the equations of mechanics\nand physics of continuous media, and field-theory equations are studied\nin this paper.\nIn the first and second case the investigation is reduced to the analysis\nof the nonidentical relations of the skew-symmetric differential forms that\nare obtained from differential equations. It is shown that the integrability\nof equations and the properties of their solutions depend on the realization\nof the conditions of degenerate transformations under which the identical\nrelations are obtained from the nonidentical relation.\nThe field-theory equations, in contrast to the equations of first two\ntypes, are the relations made up by skew-symmetric differential forms or\ntheir analogs (differential or integral ones). This is due to the fact that\nthe field-theory equations have to describe physical structures (to which\nclosed exterior forms correspond) rather than physical quantities. The\nequations that correspond to field theories are obtained from the equations\nthat describe the conservation laws (of energy, linear momentum, angular\nmomentum, and mass) of material systems (of continuous media). This\ndisclose a connection between field theories and the equations for material\nsystems (and points to that material media generate physical fields).\n\n1. Specific features of equations descriptive of physical processes\nSpecific features of differential equations descriptive of physical processes and\nthe types of their solutions can be demonstrated by the example of first-order\npartial differential equation using the properties of skew-symmetric differential\nforms.\n[The method of investigating differential equations using skew-symmetric differential forms\nwas developed by Cartan [1] in his analysis of the integrability of differential equations. Here\nwe present this analysis to demonstrate specific features of differential equations and properties\nof solutions to these equations.]\n\nLet\nF (xi , u, pi ) = 0,\n\npi = ∂u/∂xi\n\n(1)\n\nbe a first-order partial differential equation.\nLet us consider the functional relation\ndu = θ\n\n(2)\n\nwhere θ = pi dxi (the summation over repeated indices is implied). Here θ =\npi dxi is a differential form of the first degree.\n\n1\n\n\fThe specific feature of functional relation (2) is that in the general case, when\ndifferential equation (1) describes any physical processes, this relation turns out\nto be nonidentical one.\nThe left-hand side of this relation involves a differential, and the right-hand\nside includes the differential form θ = pi dxi . For this relation be identical, the\ndifferential form θ = pi dxi must also be a differential (like the left-hand side of\nrelation (2)), that is, it has to be a closed exterior differential form. To do this,\nit requires the commutator Kij = ∂pj /∂xi − ∂pi /∂xj of the differential form θ\nhas to vanish.\nIn the general case from equation (1) it does not follow (explicitly) that the\nderivatives pi = ∂u/∂xi , which obey to the equation (and given boundary or\ninitial conditions of the problem), make up a differential. For equations descriptive of any processes (without any supplementary conditions), the commutator\nKij of the differential form θ is not equal to zero. The form θ = pi dxi turns\nout to be unclosed and is not a differential like the left-hand side of relation (2).\nFunctional relation (2) appears to be nonidentical.\nThe nonidentity of functional relation (2) points to a fact that without additional conditions the derivatives of original equation do not make up a differential. This means that the corresponding solution u of the differential equation\nwill not be a function of only variables xi . The solution will depend on the\ncommutator of the form θ, that is, it will be a functional.\nTo obtain a solution that is a function (i.e., the derivatives of this solution\nmake up a differential), it is necessary to add the closure condition for the form\nθ = pi dxi and for relevant dual form (in the present case the functional F plays\na role of a form dual to θ) [1]:\n\u001a\ndF (xi , u, pi ) = 0\n(3)\nd(pi dxi ) = 0\nIf we expand the differentials, we get a set of homogeneous equations with\nrespect to dxi and dpi (in the 2n-dimensional tangent space):\n\u0012\n\u0013\n∂F\n∂F\n ∂F\n+\ndpi = 0\npi dxi +\ni\n(4)\n∂x\n∂u\n∂pi\n\ndpi dxi − dxi dpi = 0\nIt is well-known that vanishing the determinant composed of coefficients at\ndxi , dpi is a solvability condition of the system of homogeneous differential\nequations. This leads to relations:\n−dpi\ndxi\n=\n∂F/∂pi\n∂F/∂xi + pi ∂F/∂u\n\n(5)\n\nRelations (5) specify the integrating direction. namely, a pseudostructure,\non which the form θ = pi dxi turns out to be closed one, i.e. it becomes a\ndifferential, and from relation (2) the identical relation is produced. One the\npseudostructure, which is defined by relation(5), the derivatives of differential\n2\n\n\fequation (1) constitute a differential δu = pi dxi = du (on the pseudostructure), and the means that the solution of equation (1) becomes a function.\nSolutions, namely, functions on the pseudostructures formed by the integrating directions, are the so-called generalized solutions.\n[If we find the characteristics of equation (1), it appears that relations (5) are characteristic\nrelations [2]. That is, the characteristics are examples of the pseudostructures on which the\nderivatives of the differential equation made up closed forms and the solutions prove to be\nfunctions (generalized solutions).]\n\nIf the requirements of closure of skew-symmetric form made up by the derivatives of differential equation and relevant dual form are not fulfilled, that is, the\nderivatives do not form a differential, the solution corresponding to such derivatives will depend on the differential form commutator formatted by derivatives.\nThat means that the solution is a functional rather than a function.\nThe first-order partial differential equation has been analyzed, and the functional relation with the form of the first degree has been considered.\nSimilar functional properties have the solutions to all differential equations\ndescribing physical processes. And, if the order of the differential equation is k,\nthe functional relation with the k-degree form corresponds to this equation.\nThus one can see that the differential equations describing any physical fields\ncan have solutions of two types, namely, generalized solutions which depend on\nvariables only, and the solutions which are functionals since they depend on the\ncommutator made up by mixed derivatives. A specific feature of generalized\nsolutions consists in the fact that they can be realized only under degenerate\ntransformations. The relations (5) corresponding to generalized solutions had\nbeen obtained the condition of vanishing the determinant composed of coefficients at dxi , dpi in the set of equations (4). This is a condition of degenerate\ntransformation. (They are connected with symmetries of commutators of skewsymmetric forms.)\n[It is clear that the degenerate transformation is a transition from tangent space to cotangent space (the Legendre transformations). The coordinates in relations (5) are not identical\nto the independent coordinates of the initial space on which equation (1) is defined.]\n\nSince generalized solutions are possible only under realization of the conditions of degenerate transforms, they are discrete solutions (defined only on pseudostructures) and have discontinuities in the direction normal to pseudostructures.\nThe solutions being functionals disclose the another peculiarity of the solutions of differential equations, namely, their instability. The dependence of the\nsolution on the commutator may lead to instability. The instability develops\nwhen the integrability conditions are not realized and exact (generalized) solutions are not formatted. (Thus, the solutions to the equations of the elliptic\ntype may be unstable.)\n[One can see that the qualitative theory of differential equations that solves the problem of\nunstable solutions and integrability bases on the properties nonidentical functional relation.]\n\n3\n\n\f2. Peculiarities of differential equations of mechanics and\nphysics of material media\nIn analysis of partial differential equations the conjugacy of derivatives in different directions was studied (using the nonidentical functional relation). Under\ndescription of physical processes in material (continuous) media one obtains not\none differential equation but a set of differential equations. And in this case\nit is necessary to investigate the conjugacy of not only derivatives in different\ndirections but also the conjugacy (consistency) of the equations of this set. In\nthis case from this set of equations one also obtains nonidentical relation that\nallows to study the conjugacy of equations and features of their solutions.\n[The material (continuous) medium - material system - is a variety (infinite) of elements\nthat have internal structure and interact among themselves. Thermodynamical, gasodynamical and cosmologic system, systems of elementary particles and others are examples of material\nsystem. (Physical vacuum can be considered as an analog of such material system.) Electrons, protons, neutrons, atoms, fluid particles and so on are examples of elements of material\nsystem.]\n\nEquations of mechanics and physics of continuous media are equations that\ndescribe the conservation laws for energy, linear momentum, angular momentum and mass. Such conservation laws can be named as balance ones since\nthey establish the balance between the variation of a physical quantity and\ncorresponding external action.\nThe equations of balance conservation laws are differential (or integral) equations that describe a variation of functions corresponding to physical quantities\n[3-5]. (The Navier-Stokes equations are an example [5].)\n(Mechanics and physics of continuous media treat the same equations. However an approach to solving these equations in mechanics and physics are different. Below it will be shown in what this difference manifest themselves.)\nIt appears that, even without a knowledge of the concrete form of these\nequations, one can see specific features of these equations and their solutions\nusing skew-symmetric differential forms.\nTo do so it is necessary to study the conjugacy (consistency) of these equations.\nThe functions for equations of material media sought are usually functions\nwhich relate to such physical quantities like a particle velocity (of elements),\ntemperature or energy, pressure and density. Since these functions relate to one\nmaterial system, it has to exist a connection between them. This connection is\ndescribed by the state-function. Below it will be shown that the analysis of integrability and consistency of equations of balance conservation laws for material\nmedia reduces to a study the nonidentical relation for the state-function.\nLet us analyze the equations that describe the balance conservation laws for\nenergy and linear momentum.\nWe introduce two frames of reference: the first is an inertial one (this frame\nof reference is not connected with the material system), and the second is an\naccompanying one (this system is connected with the manifold built by the\ntrajectories of the material system elements).\n4\n\n\fThe energy equation in the inertial frame of reference can be reduced to the\nform:\nDψ\n= A1\nDt\nwhere D/Dt is the total derivative with respect to time, ψ is the functional of\nthe state that specifies the material system, A1 is the quantity that depends on\nspecific features of the system and on external energy actions onto the system.\n{The action functional, entropy, wave function can be regarded as examples of the functional\nψ. Thus, the equation for energy presented in terms of the action functional S has a similar\nform: DS/Dt = L, where ψ = S, A1 = L is the Lagrange function. In mechanics of\ncontinuous media the equation for energy of an ideal gas can be presented in the form [5]:\nDs/Dt = 0, where s is entropy.}\n\nIn the accompanying frame of reference the total derivative with respect to\ntime is transformed into the derivative along the trajectory. Equation of energy\nis now written in the form\n∂ψ\n= A1\n(6)\n∂ξ 1\nHere ξ 1 is the coordinate along the trajectory.\nIn a similar manner, in the accompanying reference system the equation for\nlinear momentum appears to be reduced to the equation of the form\n∂ψ\n= Aν ,\n∂ξ ν\n\nν = 2, ...\n\n(7)\n\nwhere ξ ν are the coordinates in the direction normal to the trajectory, Aν are\nthe quantities that depend on the specific features of material system and on\nexternal force actions.\nEqs. (6) and (7) can be convoluted into the relation\ndψ = Aμ dξ μ ,\n\n(μ = 1, ν)\n\n(8)\n\nwhere dψ is the differential expression dψ = (∂ψ/∂ξ μ )dξ μ .\nRelation (8) can be written as\ndψ = ω\n\n(9)\n\nhere ω = Aμ dξ μ is the skew-symmetrical differential form of the first degree.\nRelation (9) has been obtained from the equation of the balance conservation\nlaws for energy and linear momentum. In this relation the form ω is that of\nthe first degree. If the equations of the balance conservation laws for angular\nmomentum be added to the equations for energy and linear momentum, this\nform will be a form of the second degree. And in combination with the equation\nof the balance conservation law for mass this form will be a form of degree 3.\nIn general case the evolutionary relation can be written as\ndψ = ω p\n\n5\n\n(10)\n\n\fwhere the form degree p takes the values p = 0, 1, 2, 3.\n\n(The relation for p = 0 is\n\nan analog to that in the differential forms, and it was obtained from the interaction of energy\nand time.)\n\nSince the balance conservation laws are evolutionary ones, the relations obtained are also evolutionary relations, and the skew-symmetric forms ω and ω p\nare evolutionary ones.\nRelations obtained from the equation of the balance conservation laws, as\nwell as functional relation (2), turn out to be nonidentical.\nTo justify this we shall analyze relation (9). This relation proves to be\nnonidentical since the left-hand side of the relation is a differential, which is a\nclosed skew-symmetric form, but the right-hand side of the relation involves the\nskew-symmetric differential form ω, which is unclosed form. The commutator\nmade up by the derivatives of coefficients Aμ the form ω itself is also nonzero,\nsince the coefficients Aμ are of different nature, that is, some coefficients have\nbeen obtained from the energy equation and depend on the energetic actions,\nwhereas the others have been obtained from the equation for linear momentum\nand depend on the force actions.\nIn a similar manner one can prove the nonidentity of relation (10).\nNonidentity of the evolutionary relation, as well as nonidentity on functional\nrelation (2), means that initial equations of balance conservation laws are not\nconjugated, and hence they are not integrable. The solutions of these equations\ncan be functional or generalized ones. In this case generalized solutions are\nobtained only under degenerated transformations.\nA type of solutions of the balance conservation law equations is essential\nto mechanics and physics of continuous media. And in physics and mechanics\nthe interest is expressed in different types of solutions. In physics the interest\nis expressed in only generalized solutions that are invariant ones, and noninvariant solutions are ignored (even they have a physical meaning). In contrast\nto this, in mechanics of continuous media, where typically the equations are\nsolved numerically, one searches for solutions that are functionals. In this case\nthe question of searching for invariant solutions that are realized only under\nadditional conditions is not posed.\nSuch limited approach to solving the equations of material media has some\nnegative points. The physical approach enables one to find possible invariant\nsolutions, however in this approach there is no way of telling in what instant\nof time of evolutionary process one or another solution is obtained. This does\nnot also discloses the causality of phenomenon described by these solutions.\nThe approach exploited in mechanics of continuous media leads to difficulties in\nexplaining such phenomena as origination any discrete formations (like a generation of waves or turbulent pulsations, birth of massless particles and so on), to\nwhich the invariant solutions are assigned. (The answer to the questions arisen\nin physics and mechanics while solving the equations describing material media\ncan be found by analysis of the nonidentical evolutionary relation obtained from\nthese equations.)\nThe evolutionary relation obtained from equations of balance conservation\nlaws for material systems (continuous media), in contrast to functional relation\n6\n\n\f(2), carries not only mathematical but also large physical loading [6,7]. This is\ndue to the fact that the evolutionary relation possesses the duality. On the one\nhand, this relation corresponds to material system, and on other, as it will be\nshown below, describes the mechanism of generating physical structures. This\ndiscloses the properties and peculiarities of the field-theory equations and their\nconnection with the equations of balance conservation laws.\nPhysical significance of nonidentical evolutionary relation.\nThe evolutionary relation describes the evolutionary process in material system since this relation includes the state differential, which specifies the material\nsystem state. However, since this relation turns out to be not identical, from this\nrelation one cannot get the differential dψ. The absence of differential means\nthat the system state is nonequilibrium.\nThe evolutionary relation possesses one more peculiarity, namely, this relation is a selfvarying relation. (The evolutionary form entering into this relation\nis defined on the deforming manifold made up by trajectories of the material\nsystem elements. This means that the evolutionary form basis varies. In turn,\nthis leads to variation of the evolutionary form, and the process of intervariation\nof the evolutionary form and the basis is repeated.)\nSelfvariation of the nonidentical evolutionary relation points to the fact that\nthe nonequilibrium state of material system turns out to be selfvarying. (It is\nevident that this selfvariation proceeds under the action of internal force whose quantity is\n\nState of material\nsystem changes but remains nonequilibrium during this process.\nSince the evolutionary form is unclosed, the evolutionary relation cannot be\nidentical. This means that the nonequilibrium state of material system holds.\nBut in this case it is possible a transition of material system to a locally equilibrium state.\nThis follows from one more property of nonidentical evolutionary relation.\nUnder selfvariation of the evolutionary relation it can be realized the conditions\nof degenerate transformation. And under degenerate transformation from the\nnonidentical relation it is obtained the identical relation.\nFrom identical relation one can define the state differential pointing to the\nequilibrium state of the system. However, such system state is realized only\nlocally due to the fact that the state differential obtained is an interior one\ndefined only on pseudostructure, that is specified by the conditions of degenerate transformation. And yet the total state of material system remains to be\nnonequilibrium because the evolutionary relation, which describes the material\nsystem state, remains nonidentical one.\nThe conditions of degenerate transformation are connected with symmetries\ncaused by degrees of freedom of material system. These are symmetries of the\nmetric forms commutators of the manifold. {To the degenerate transformation it\ndescribed by the commutator of the unclosed evolutionary form ω p .)\n\nmust correspond a vanishing of some functional expressions, such as Jacobians, determinants,\nthe Poisson brackets, residues and others. Vanishing of these functional expressions is the\nclosure condition for dual form. And it should be emphasize once more that the degenerate\ntransformation is realized as a transition from the accompanying noninertial frame of reference\n\n7\n\n\fto the locally inertial system. The evolutionary form and nonidentical evolutionary relation\nare defined in the noninertial frame of reference (deforming manifold). But the closed exterior\nform obtained and the identical relation are obtained with respect to the locally-inertial frame\nof reference (pseudostructure)}.\n\nRealization of the conditions of degenerate transformation is a vanishing of\nthe commutator of manifold metric form, that is, a vanishing of the dual form\ncommutator. And this leads to realization of pseudostructure and formatting\nthe closed inexact form, whose closure conditions have the form\ndπ ω p = 0, dπ ∗ ω p = 0\n\n(12)\n\nOn the pseudostructure π from evolutionary relation (10) it is obtained the\nrelation\n(13)\ndπ ψ = ωπp\nwhich proves to be an identical relation since the closed inexact form is a differential (interior on pseudostructure).\nThe realization of the conditions of degenerate transformation and obtaining identical relation from nonidentical one has both mathematical and physical\nmeaning. Firstly, this points to the fact that the solution of equations of balance conservation laws proves to be a generalized one. And secondly, from this\nrelation one obtains the differential dπ ψ and this points to the availability of\nthe state-function (potential) and that the state of material system is in local\nequilibrium.\nRelation (13) holds the duality. The left-hand side of relation (13) includes\nthe differential, which specifies material system and whose availability points\nto the locally-equilibrium state of material system. And the right-hand side\nincludes a closed inexact form, which is a characteristics of physical fields. The\nclosure conditions (12) for exterior inexact form correspond to the conservation law, i.e. to a conservative on pseudostructure quantity, and describe a\ndifferential-geometrical structure. These are such structures (pseudostructures\nwith conservative quantities) that are physical structures formatting physical\nfields[6].\nThe transition from nonidentical relation (10) obtained from the balance\nconservation laws to identical relation (13) means the following. Firstly, an\nemergency of the closed (on pseudostructure) inexact exterior form (right-hand\nside of relation (13)) points to an origination of the physical structure. And,\nsecondly, an existence of the state differential (left-hand side of relation (13))\npoints to a transition of the material system from nonequilibrium state to the\nlocally-equilibrium state.\nThus one can see that the transition of material system from nonequilibrium state to locally-equilibrium state is accompanied by originating differentialgeometrical structures, which are physical structures. Massless particles, charges,\nstructures made up by eikonal surfaces and wave fronts, and so on are examples\nof physical structures.\n\n8\n\n\fThe duality of identical relation also explains the duality of nonidentical\nevolutionary relation. On the one hand, evoltionary relation describes the evolutionary process in material systems, and on the other describes the process of\ngenerating physical fields.\nSuch duality, which establishes the connection between material systems\nand physical fields, discloses one more peculiarity of evolutionary processes in\nmaterial media.\nThe emergency of physical structures in the evolutionary process reveals in\nmaterial system as an emergency of certain observable formations, which develop spontaneously. Such formations and their manifestations are fluctuations,\nturbulent pulsations, waves, vortices, and others. It appears that structures of\nphysical fields and the formations of material systems observed are a manifestation of the same phenomena. The light is an example of such a duality. The\nlight manifests itself in the form of a massless particle (photon) and of a wave.\nThis duality also explains a distinction in studying the same phenomena in\nmaterial systems and physical fields. As it had already noted, in the physics\nof continuous media (material systems) the interest is expressed in generalized\nsolutions of equations of the balance conservation laws. These are solutions\nthat describe the formations in material media observed. The investigation of\nrelevant physical structures is carried out using the field-theory equations.\nThe unique properties of nonidentical evolutionary relation, which describes\nthe connection between physical fields and material systems, discloses the connection of evolutionary relation with the field-theory equations. In fact, all\nequations of existing field theories are the analog to such relation or its differential or tensor representation.\n\n3. Specific features of field-theory equations\nThe field-theory equations are equations that describe physical fields. Since\nphysical fields are formatted by physical structures, which are described by\nclosed exterior inexact forms and by closed dual forms (metric forms of manifold), is obvious that the field-theory equations or solutions to these equations\nhave to be connected with closed exterior forms. Nonidentical relations for\nfunctionals like wave-function, action functional, entropy, and others, which are\nobtained from the equations for material media (and from which identical relations with closed forms describing physical fields are obtained), just disclose\nthe specific features of the field-theory equations.\nThe equations of mechanics, as well as the equations of continuous media\nphysics, are partial differential equations for desired functions like a velocity\nof particles (elements), temperature, pressure and density, which correspond\nto physical quantities of material systems (continuous media). Such functions\ndescribe the character of varying physical quantities of material system. The\nfunctionals (and state-functions) like wave-function, action functional, entropy\nand others, which specify the state of material systems, and corresponding relations are used in mechanics and continuous media physics only for analysis\n9\n\n\fof integrability of these equations. And in field theories such relations play a\nrole of equations. Here it reveals the duality of these relations. In mechanics\nand continuous media physics these equations describe the state of material\nsystems, whereas in field-theory they describe physical structures from which\nphysical fields are formatted.\n{In differential equations of mathematical physics, which describe physical processes, the\nfunctions required are found by integrating derivatives obtained from the differential equation.\nAnd in field-theory equations the functions required follow not from derivatives, but from\ndifferentials of identical relations and they are exterior forms. That is, in mathematical\nphysics one has to distinguish two types of differential equations, namely, the differential\nequations, which describe the variations of physical quantities, and the field-theory equations,\nwhich describe physical structures.}\n\nIt can be shown that all equations of existing field theories are in essence\nrelations that connect skew-symmetric forms or their analogs (differential or\ntensor ones). And yet the nonidentical relations are treated as equations from\nwhich it can be found identical relation with include closed forms describing\nphysical structures desired.\nField equations (the equations of the Hamilton formalism) reduce to identical\nrelation with exterior form of first degree, namely, to the Poincare invariant\nds = − H dt + pj dqj\n\n(14)\n\n{The field equation has the form [2]\n∂s\n+H\n∂t\n\n\u0012\n\nt, qj ,\n\n∂s\n∂qj\n\n\u0013\n\n= 0,\n\n∂s\n= pj\n∂qj\n\n(15)\n\nR\n\nhere s is a field function for the action functional S =\nL dt. Here L is the Lagrangian\nfunction, H(t, qj , pj ) = pj q̇j − L is the Hamilton function pj = ∂L/∂ q̇j . These functions\nsatisfy the relations:\ndgj\ndpj\n∂H\n∂H\n=\n,\n= −\n(16)\ndt\n∂pj\ndt\n∂gj\nRelations (16), which present a set of the Hamilton equations, are the closure conditions for\nexterior and dual forms [7]. They are similar to relations (5).}\n\nThe Schrődinger equation in quantum mechanics is an analog to field equation, where the conjugated coordinates are replaced by operators. The Heisenberg equation corresponds to the closure condition of dual form of zero degree.\nDirac's bra- and cket- vectors made up a closed exterior form of zero degree.\nIt is evident that the relations with skew-symmetric differential forms of zero\ndegree correspond to quantum mechanics. The properties of skew-symmetric\ndifferential forms of the second degree lie at the basis of the electromagnetic\nfield equations. The Maxwell equations may be written as dθ2 = 0, d∗ θ2 = 0,\nwhere θ2 = 12 Fμν dxμ dxν (here Fμν is the strength tensor). The Einstein equation is a relation in differential forms. This equation relates the differential of\ndual form of first degree (Einstein's tensor) and a closed form of second degree\n–the energy-momentum tensor. (It can be noted that, even Einstein's equation connects the closed forms of second degree, this equation is obtained from\ndifferential forms of third degree).\n10\n\n\fThe connection the field theory equations with skew-symmetric forms of appropriate degrees shows that there exists a commonness between field theories\ndescribing physical fields of different types. This can serve as an approach to\nconstructing the unified field theory. This connection shows that it is possible\nto introduce a classification of physical fields according to the degree of skewsymmetric differential forms. From relations (10) and (13) one can see that\nrelevant degree of skew-symmetric differential forms, which can serve as a parameter of unified field theory, is connected with the degree p of evolutionary\nform in relation (10). It should be noted that the degree p is connected with\nthe number of interacting balance conservation laws. {The degree of closed forms\nalso reflects a type of interaction [6]. Zero degree is assigned to a strong interaction, the first\none does to a weak interaction, the second one does to electromagnetic interactions, and the\nthird degree is assigned to gravitational field.}\n\nThe connection of field-theory equations, which describe physical fields, with\nthe equations for material media discloses the foundations of the general field\ntheory. As an equation of general field theory it can serve the evolutionary\nrelation (10), which is obtained the balance conservation laws for material media\nand has a double meaning. On the one hand, that, being a relation, specifies\nthe type of solutions to equations of balance conservation laws and describes\nthe state of material system (since it includes the state differential), and, from\nother hand, that can play a role of equations for description of physical fields\n(for finding the closed inexact forms, which describe the physical structures from\nwhich physical fields are made up). It is just a double meaning that discloses\nthe connection of physical fields with material media (which is based on the\nconservation laws) and allows to understand on what the general field theory\nhas to be based.\nIn conclusion it should be emphasized that the study of equations of mathematical physics appears to be possible due to unique properties of skew-symmetric\ndifferential forms. In this case, beside the exterior skew-symmetric differential\nforms, which are defined on differentiable manifolds, the skew-symmetric differential forms, which, unlike to the exterior forms, are defined on deforming\n(nondifferentiable) manifolds [7], were used.\n\nReferences\n1. Cartan E., Les Systemes Differentials Exterieus ef Leurs Application\nGeometriques. -Paris, Hermann, 1945.\n2. Smirnov V. I., A course of higher mathematics. -Moscow, Tech. Theor. Lit.\n1957, V. 4 (in Russian).\n3. Tolman R. C., Relativity, Thermodynamics, and Cosmology. Clarendon\nPress, Oxford, UK, 1969.\n4. Fock V. A., Theory of space, time, and gravitation. -Moscow, Tech. Theor. Lit.,\n1955 (in Russian).\n\n11\n\n\f5. Clark J. F., Machesney M., The Dynamics of Real Gases. Butterworths,\nLondon, 1964.\n6. Petrova L. I. The quantum character of physical fields. Foundations of\nfield theories, Electronic Journal of Theoretical Physics, v.3, 10 (2006), 89-107p.\n7. Petrova L. I. Skew-symmetric differential forms: Conservation laws.\nFoundations of field theories. -Moscow, URSS, 2006, 158 p. (in Russian).\n\n12\n\n\f"}