{"id": "http://arxiv.org/abs/math/0702772v2", "guidislink": true, "updated": "2009-07-08T11:11:49Z", "updated_parsed": [2009, 7, 8, 11, 11, 49, 2, 189, 0], "published": "2007-02-26T13:05:43Z", "published_parsed": [2007, 2, 26, 13, 5, 43, 0, 57, 0], "title": "Higher vector bundles and multi-graded symplectic manifolds", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=math%2F0001116%2Cmath%2F0001152%2Cmath%2F0001065%2Cmath%2F0001022%2Cmath%2F0001169%2Cmath%2F0001123%2Cmath%2F0001013%2Cmath%2F0001046%2Cmath%2F0001023%2Cmath%2F0001068%2Cmath%2F0001045%2Cmath%2F0001088%2Cmath%2F0001188%2Cmath%2F0001010%2Cmath%2F0001094%2Cmath%2F0001141%2Cmath%2F0001137%2Cmath%2F0001093%2Cmath%2F0001171%2Cmath%2F0001142%2Cmath%2F0001055%2Cmath%2F0001105%2Cmath%2F0001067%2Cmath%2F0001085%2Cmath%2F0001117%2Cmath%2F0001089%2Cmath%2F0001097%2Cmath%2F0001086%2Cmath%2F0001145%2Cmath%2F0001170%2Cmath%2F0001031%2Cmath%2F0001020%2Cmath%2F0001130%2Cmath%2F0001121%2Cmath%2F0001080%2Cmath%2F0001037%2Cmath%2F0001179%2Cmath%2F0001144%2Cmath%2F0001011%2Cmath%2F0001125%2Cmath%2F0001146%2Cmath%2F0001050%2Cmath%2F0001028%2Cmath%2F0001017%2Cmath%2F0001019%2Cmath%2F0001087%2Cmath%2F0001036%2Cmath%2F0001069%2Cmath%2F0001175%2Cmath%2F0001126%2Cmath%2F0001038%2Cmath%2F0001071%2Cmath%2F0001024%2Cmath%2F0001066%2Cmath%2F0001005%2Cmath%2F0001129%2Cmath%2F0001118%2Cmath%2F0001015%2Cmath%2F0702772%2Cmath%2F0702595%2Cmath%2F0702423%2Cmath%2F0702820%2Cmath%2F0702219%2Cmath%2F0702873%2Cmath%2F0702670%2Cmath%2F0702530%2Cmath%2F0702476%2Cmath%2F0702526%2Cmath%2F0702882%2Cmath%2F0702446%2Cmath%2F0702687%2Cmath%2F0702642%2Cmath%2F0702844%2Cmath%2F0702499%2Cmath%2F0702051%2Cmath%2F0702786%2Cmath%2F0702373%2Cmath%2F0702124%2Cmath%2F0702517%2Cmath%2F0702784%2Cmath%2F0702521%2Cmath%2F0702262%2Cmath%2F0702883%2Cmath%2F0702566%2Cmath%2F0702030%2Cmath%2F0702052%2Cmath%2F0702631%2Cmath%2F0702082%2Cmath%2F0702239%2Cmath%2F0702652%2Cmath%2F0702893%2Cmath%2F0702807%2Cmath%2F0702199%2Cmath%2F0702101%2Cmath%2F0702761%2Cmath%2F0702161%2Cmath%2F0702027%2Cmath%2F0702087%2Cmath%2F0702335%2Cmath%2F0702599%2Cmath%2F0702655&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Higher vector bundles and multi-graded symplectic manifolds"}, "summary": "A natural explicit condition is given ensuring that an action of the\nmultiplicative monoid of non-negative reals on a manifold F comes from\nhomotheties of a vector bundle structure on F, or, equivalently, from an Euler\nvector field. This is used in showing that double (or higher) vector bundles\npresent in the literature can be equivalently defined as manifolds with a\nfamily of commuting Euler vector fields. Higher vector bundles can be therefore\ndefined as manifolds admitting certain $\\N^n$-grading in the structure sheaf.\nConsequently, multi-graded (super)manifolds are canonically associated with\nhigher vector bundles that is an equivalence of categories. Of particular\ninterest are symplectic multi-graded manifolds which are proven to be\nassociated with cotangent bundles. Duality for higher vector bundles is then\nexplained by means of the cotangent bundles as they contain the collection of\nall possible duals. This gives, moreover, higher generalizations of the known\n`universal Legendre transformation' T*E->T*E*, identifying the cotangent\nbundles of all higher vector bundles in duality. The symplectic multi-graded\nmanifolds, equipped with certain homological Hamiltonian vector fields, lead to\nan alternative to Roytenberg's picture generalization of Lie bialgebroids,\nCourant brackets, Drinfeld doubles and can be viewed as geometrical base for\nhigher BRST and Batalin-Vilkovisky formalisms. This is also a natural framework\nfor studying n-fold Lie algebroids and related structures.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=math%2F0001116%2Cmath%2F0001152%2Cmath%2F0001065%2Cmath%2F0001022%2Cmath%2F0001169%2Cmath%2F0001123%2Cmath%2F0001013%2Cmath%2F0001046%2Cmath%2F0001023%2Cmath%2F0001068%2Cmath%2F0001045%2Cmath%2F0001088%2Cmath%2F0001188%2Cmath%2F0001010%2Cmath%2F0001094%2Cmath%2F0001141%2Cmath%2F0001137%2Cmath%2F0001093%2Cmath%2F0001171%2Cmath%2F0001142%2Cmath%2F0001055%2Cmath%2F0001105%2Cmath%2F0001067%2Cmath%2F0001085%2Cmath%2F0001117%2Cmath%2F0001089%2Cmath%2F0001097%2Cmath%2F0001086%2Cmath%2F0001145%2Cmath%2F0001170%2Cmath%2F0001031%2Cmath%2F0001020%2Cmath%2F0001130%2Cmath%2F0001121%2Cmath%2F0001080%2Cmath%2F0001037%2Cmath%2F0001179%2Cmath%2F0001144%2Cmath%2F0001011%2Cmath%2F0001125%2Cmath%2F0001146%2Cmath%2F0001050%2Cmath%2F0001028%2Cmath%2F0001017%2Cmath%2F0001019%2Cmath%2F0001087%2Cmath%2F0001036%2Cmath%2F0001069%2Cmath%2F0001175%2Cmath%2F0001126%2Cmath%2F0001038%2Cmath%2F0001071%2Cmath%2F0001024%2Cmath%2F0001066%2Cmath%2F0001005%2Cmath%2F0001129%2Cmath%2F0001118%2Cmath%2F0001015%2Cmath%2F0702772%2Cmath%2F0702595%2Cmath%2F0702423%2Cmath%2F0702820%2Cmath%2F0702219%2Cmath%2F0702873%2Cmath%2F0702670%2Cmath%2F0702530%2Cmath%2F0702476%2Cmath%2F0702526%2Cmath%2F0702882%2Cmath%2F0702446%2Cmath%2F0702687%2Cmath%2F0702642%2Cmath%2F0702844%2Cmath%2F0702499%2Cmath%2F0702051%2Cmath%2F0702786%2Cmath%2F0702373%2Cmath%2F0702124%2Cmath%2F0702517%2Cmath%2F0702784%2Cmath%2F0702521%2Cmath%2F0702262%2Cmath%2F0702883%2Cmath%2F0702566%2Cmath%2F0702030%2Cmath%2F0702052%2Cmath%2F0702631%2Cmath%2F0702082%2Cmath%2F0702239%2Cmath%2F0702652%2Cmath%2F0702893%2Cmath%2F0702807%2Cmath%2F0702199%2Cmath%2F0702101%2Cmath%2F0702761%2Cmath%2F0702161%2Cmath%2F0702027%2Cmath%2F0702087%2Cmath%2F0702335%2Cmath%2F0702599%2Cmath%2F0702655&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A natural explicit condition is given ensuring that an action of the\nmultiplicative monoid of non-negative reals on a manifold F comes from\nhomotheties of a vector bundle structure on F, or, equivalently, from an Euler\nvector field. This is used in showing that double (or higher) vector bundles\npresent in the literature can be equivalently defined as manifolds with a\nfamily of commuting Euler vector fields. Higher vector bundles can be therefore\ndefined as manifolds admitting certain $\\N^n$-grading in the structure sheaf.\nConsequently, multi-graded (super)manifolds are canonically associated with\nhigher vector bundles that is an equivalence of categories. Of particular\ninterest are symplectic multi-graded manifolds which are proven to be\nassociated with cotangent bundles. Duality for higher vector bundles is then\nexplained by means of the cotangent bundles as they contain the collection of\nall possible duals. This gives, moreover, higher generalizations of the known\n`universal Legendre transformation' T*E->T*E*, identifying the cotangent\nbundles of all higher vector bundles in duality. The symplectic multi-graded\nmanifolds, equipped with certain homological Hamiltonian vector fields, lead to\nan alternative to Roytenberg's picture generalization of Lie bialgebroids,\nCourant brackets, Drinfeld doubles and can be viewed as geometrical base for\nhigher BRST and Batalin-Vilkovisky formalisms. This is also a natural framework\nfor studying n-fold Lie algebroids and related structures."}, "authors": ["Janusz Grabowski", "Mikolaj Rotkiewicz"], "author_detail": {"name": "Mikolaj Rotkiewicz"}, "author": "Mikolaj Rotkiewicz", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/j.geomphys.2009.06.009", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/math/0702772v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/math/0702772v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "27 pages, minor corrections, to appear in J. Geom. Phys", "arxiv_primary_category": {"term": "math.DG", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.DG", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "58A50, 53D05 (Primary), 53D17, 58C50, 17B62, 17B63, 18D05", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/math/0702772v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/math/0702772v2", "journal_reference": "J. Geom. Phys. 59 (2009), 1285-1305", "doi": "10.1016/j.geomphys.2009.06.009", "fulltext": "Higher ve tor bundles\n\narXiv:math/0702772v2 [math.DG] 8 Jul 2009\n\nand multi-graded symple ti\n\nmanifolds\n\n1\n\n∗\n\n2\n\nJanusz Grabowski , Mikoaaj Rotkiewi z\n\nInstitute of Mathemati s\nPolish A ademy of S ien es\n1\n\njagrab\bimpan.gov.pl\n\n2\n\nInstitute of Mathemati s\nUniversity of Warsaw\n\nmrotkiew\bmimuw.edu.pl\n\nAbstra t\nA natural expli it ondition is given ensuring that an a tion of the multipli ative monoid of\nnon-negative reals on a manifold F omes from homotheties of a ve tor bundle stru ture on F , or,\nequivalently, from an Euler ve tor \u001celd. This is used in showing that double (or higher) ve tor bundles present in the literature an be equivalently de\u001cned as manifolds with a family of ommuting\nEuler ve tor \u001celds. Higher ve tor bundles an be therefore de\u001cned as manifolds admitting ertain\nNn -grading in the stru ture sheaf. Consequently, multi-graded (super)manifolds are anoni ally\nasso iated with higher ve tor bundles that is an equivalen e of ategories. Of parti ular interest\nare symple ti multi-graded manifolds whi h are proven to be asso iated with otangent bundles.\nDuality for higher ve tor bundles is then explained by means of the otangent bundles as they\nontain the olle tion of all possible duals. This gives, moreover, higher generalizations of the\nknown `universal Legendre transformation' T∗ E ≃ T∗ E ∗ , identifying the otangent bundles of all\nhigher ve tor bundles in duality. The symple ti multi-graded manifolds, equipped with ertain\nhomologi al Hamiltonian ve tor \u001celds, lead to an alternative to Roytenberg's pi ture generalization\nof Lie bialgebroids, Courant bra kets, Drinfeld doubles and an be viewed as geometri al base for\nhigher BRST and Batalin-Vilkovisky formalisms. This is also a natural framework for studying\nn-fold Lie algebroids and related stru tures.\nMSC 2000: 58A50, 53D05 (Primary); 53D17, 58C50, 17B62, 17B63, 18D05 (Se ondary).\nKey words: double ve tor bundles, graded super-manifolds, Lie bialgebroids, Courant algebroids,\nDrinfeld doubles, BRST formalism.\n\n∗ Resear\n\nh \u001cnan ed by the Polish Ministry of S ien e and Higher Edu ation under the grant No. N201 005 31/0115.\n\n1\n\n\f1 Introdu tion\nThe language of super-geometry is nowadays ommonly used not only in some models of mathemati al\nphysi s (e.g. in Batalin-Vilkovisky formalism and topologi al Quantum Field Theory [1, 35℄) or homologi al algebra but also for some problems viewed earlier as purely geometri al, espe ially in Poisson\ngeometry and the theory of Lie algebroids. In this ontext it be ame evident that many anoni al\nsuper-manifolds are provided with an additional grading in the stru ture sheaf. In parti ular, the\nproblem of \u001cnding a proper analog of Drinfeld double Lie algebra for Lie bialgebroids [28℄ and \u001cnding\na ni e des ription of Courant algebroids [18℄ (with BRST omplex and the Weil algebra as parti ular examples) have been solved in the language of su h graded (super)manifolds by Th. Voronov and\nD. Roytenberg [33, 34, 40℄.\nOn the other hand, in the traditional language of di\u001berential geometry, double (or higher) stru tures\nhave been introdu ed in the ategori al sense. For example, double ve tor bundles have been understood\nas \"ve tor bundles in the ategory of ve tor bundles\" (see [30℄\u0015[32℄, [2, 15, 27℄) and re ognized as the\nstru tures of great importan e in the Lagrangian and Hamiltonian formalism of analyti al me hani s\n[38, 8℄. This has been extended for double a\u001ene bundles in [9℄. Double stru tures appeared also in\nsymple ti and Poisson geometry with A. Weinstein's and his ollaborators work on symple ti and\nPoisson groupoids [3, 42, 43℄ followed by numerous works of his students and systemati studies of\nK. C. H. Ma kenzie [19℄\u0015[26℄, Y. Kosmann-S hwarzba h [16, 17℄ and others.\nWe had, however, the feeling that, on one hand, the standard de\u001cnitions of a double (or higher)\nve tor bundle ( f. [15, 19, 27℄), although ategori ally ni e, are operatively too ompli ated, and, on\nthe other hand, that standard on epts of super-manifold, or even the on ept of N-manifold as de\u001cned\nand used in [36, 40, 34℄, are still too general for many purposes. We therefore develop a theory of\nhigher ve tor bundles in the spirit of algebrai ally des ribed ompatibility ondition for a number of\nve tor bundle stru tures and asso iate with them anoni ally derived multi-graded super-manifolds.\nOur starting point is the observation that a ve tor bundle an be hara terized only with the use\nof its homogeneous stru ture that leads to a mu h simpler de\u001cnition of an n-ve tor bundle (in lassi al\nterms). We prove namely that an n-ve tor bundle an be equivalently hara terized as a manifold\nwith n ommuting Euler ve tor \u001celds, i.e. as a manifold with ertain N-gradation in the algebra of\nsmooth fun tions. This implies that an n-ve tor bundle, as anoni ally multi-graded, admits its natural\nsuperized ounterpart \u0015 a multi-graded (super)manifold. Both on epts lead to a uni\u001ced and elegant\ndes ription of various phenomena of di\u001berential geometry. Of parti ular interest are symple ti multigraded manifolds whi h are proven to be asso iated with otangent bundles. Duality for higher ve tor\nbundles an be explained by means of these bundles as they ontain the olle tion of all possible duals.\nIn fa t, we have higher \"Legendre transformations\" identifying the otangent bundles of all these duals.\nThe symple ti multi-graded manifolds, equipped with ertain homologi al Hamiltonian ve tor \u001celds,\nlead to an alternative to D. Roytenberg's pi ture generalization of Lie bialgebroids, Courant bra kets,\nDrinfeld doubles and an be viewed as geometri al base for higher BRST and Batalin-Vilkovisky\nformalisms. This is also a natural framework for studying n-fold Lie algebroids and related stru tures.\nThe paper is organized as follows.\nWe start with \u001cnding a simple hara terization of those a tions of the multipli ative monoid R+\nof non-negative reals on a manifold F that ome from homotheties of a ve tor bundle stru ture on F .\nThis allows us to identify a ve tor bundle stru ture with its homogeneous stru ture (or, equivalently,\nits Euler ve tor \u001celd) that learly simpli\u001ces the whole theory, as dire t omparison of the additive\nstru tures is mu h more ompli ated. In parti ular, a ompatibility of two ve tor bundle stru tures\nan be des ribed easily as the ommutation of the orresponding Euler ve tor \u001celds. We show that this\nompatibility ondition is equivalent to the on ept of double ve tor bundle des ribed in ategori al\nterms. In this language, a ve tor bundle morphism is shown to be just a smooth map intertwining the\nhomotheties and a ve tor subbundle \u0015 as a submanifold whi h is homothety-invariant.\nThe n-ve tor bundles F , whose stru ture is des ribed in se tion 4, admit anoni al lifts of their\nEuler ve tor \u001celds to the tangent and to the otangent bundles TF and T∗ F , as we show in se tion\n5. In parti ular, the iterated tangent and otangent bundles are anoni al examples of higher ve tor\nbundles. The otangent bundle T∗ F is of parti ular interest, sin e it is anoni ally \u001cbered not only\n∗\nover F but also over all duals F(k)\nof F with respe t to all its ve tor bundle stru tures F → F[k] .\n\n2\n\n\fThe side bundles F[k] are anoni ally (n − 1)-ve tor bundles themselves. We prove the existen e of a\n∗\n∗\nanoni al identi\u001c ations T∗ F ≃ T∗ F(k)\n≃ T∗ F(l)\nwhi h are additionally symple tomorphisms. This an\nbe viewed as a generalization of the elebrated \"universal Legendre transformation\" T∗ TM ≃ T∗ T∗ M .\n∗\n∗\nMoreover, the set of higher ve tor bundles {F, F(1)\n, . . . , F(n)\n} is losed (under natural identi\u001c ations)\nwith respe t to duality. This is a phenomenon observed \u001crst for double and triple ve tor bundles by\nK. Konie zna, P. Urba«ski and K. C. H. Ma kenzie [15, 24, 26℄.\nIn Se tion 6 we prove that symple ti n-ve tor bundles, i.e. n-ve tor bundles equipped with a\nsymple ti form whi h is linear (1-homogeneous) with respe t to all ve tor bundle stru tures, always\ntake the form T∗ F for ertain (n − 1)-ve tor bundle F . This, in turn, generalizes the known result\nsaying that any ve tor bundle equipped with a linear symple ti form is, in fa t, T∗ M .\nThe next two paragraphes are devoted to a natural superization of the previous notions. In this\nway we get the on ept, already impli itly present in the literature, of a multi-graded manifold \u0015 a\nsuper-manifold M with an Nn -gradation in the stru ture sheaf, and the on ept of a multi-graded\nsymple ti manifold. The ru ial here is the equivalen e of ategories: we have a pre ise pres ription\nof passing from a (symple ti ) n-ve tor bundle to the orresponding n-graded (symple ti ) manifold\nand ba k.\nOn multi-graded symple ti manifolds one an onsider Master Equations, i.e. equations of the form\n{H, H} = 0 for Hamiltonians of parity di\u001berent from the parity of the symple ti Poisson bra ket {*, *}.\nThis leads to higher multi-graded analogs of Courant algebroid [18, 34℄ in the spirit of D. Roytenberg's\nexplanation of what a Courant algebroid is. This gives also a possibility of developing higher BRST\nand Batalin-Vilkovisky formalisms. The language of multi-graded manifolds is also useful in des ribing\nthe stru tures of n-fold Lie algebroids, as has been already observed by T. Voronov [41℄. Se tion 9 is\ndevoted to these questions together with the on ept of Drinfeld n-tuple \u0015 whi h generalizes the notion\nof Drinfeld double Lie algebra and double Lie algebroid. We end up with some results on Drinfeld\nn-tuples, their relations to n-fold Lie algebroids, and examples.\nTo limit the size of these notes, the questions on erning the higher Dira stru tures, higher generalized geometries, et ., we postpone to a separate paper. The authors wish to thank F. Przyty ki for\nhelpful dis ussions on dynami al systems.\n\n2 Ve tor bundles and homogeneous stru tures\nIt is a standard student exer ise to show that the additive stru ture in a real topologi al ve tor spa e\ndetermines the homogeneous stru ture \u0015 the multipli ation by reals. The onverse is also true. The\nEuler's Homogeneous Fun tion Theorem implies that any di\u001berentiable 1-homogeneous fun tion on Rn\nis automati ally linear. This suggests that the homogeneity, being mu h simpler notion, an be used\ninstead linearity in di\u001berential geometry. Let us remark that all geometri obje ts in this paper, like\nmanifolds, \u001cbrations, et ., are assumed to be \u001cnite-dimensional, para ompa t and smooth.\nIn this se tion, we will use this idea to develop a on ept of a ve tor bundle in terms of its\nhomogeneous stru ture. To explain how we will understood the latter, let us onsider a ve tor bundle\nπ : E → M . The homotheties in E de\u001cne a smooth a tion of the ommutative monoid (R+ , *) of\nnon-negative reals, R+ = {a ∈ R : a ≥ 0}, with multipli ation:\nh : R+ × E → E ,\n\nht (e) := h(t, e) = t * e .\n\nIt should be made lear that by smoothness on R+ we mean that the map an be extended to a smooth\nmap on a neighborhood of R+ in R, thus the whole R. In fa t, the above R+ -a tion an be extended to\na smooth a tion e\nh : R × E → E of the multipli ative monoid R by homotheties with possible negative\nfa tors.\nOf ourse, with any smooth a tion h : R+ × F → F , ht ◦ hs = hts , of the multipli ative monoid\n(R, *) on a smooth manifold F , one an asso iate a smooth proje tion h0 : F → F (as h20 = h0 ) onto\na losed subset N = h0 (F ) of F . In this generality we an de\u001cne also the verti al lift Vh : F → TF|N ,\nwhere Vh (x) ∈ Th0 (x) F is the tangent ve tor at t = 0 represented by the smooth urve R+ ∋ t 7→\nxh (t) := h(t, x) ∈ F . In other words,\nVh : F → TF ,\n\nVh (x) = ẋh (0) = Txh (0, ∂t ).\n\n3\n\n(1)\n\n\fOne an easily seen that Vh (x) = 0x for x ∈ N . For the a tion by homotheties on a ve tor bundle we\nhave also the onverse: Vh (em ) = 0 ⇒ em = 0m .\nFor the terminology, note only that by a ve tor subbundle we always mean a subbundle over a\nsubmanifold. An important example is the verti al subbundle VF|0M in the tangent bundle TF of a\nve tor bundle F over M over the zero-se tion 0M of F whi h is anoni ally isomorphi to F , as shows\nthe following.\n\nProposition 2.1. For a ve tor bundle F , the verti al lift gives a anoni al isomorphism of ve tor\nbundles Vh : F → VF|0 ⊂ TF .\nProof.- In lo al oordinates (xa , yi ) in F , where (xa ) are lo al oordinates in M and (yi ) are linear\nM\n\noordinates in the typi al \u001cber, we have h(t, x, y) = (x, ty). In the adapted oordinates (xa , yi , ẋb , ẏj )\nin TF , the verti al lift reads Vh (x, y) = (x, 0, 0, y).\n\u0003\nNote that VF|N an be de\u001cned for any manifold F equipped with a smooth proje tion onto a subset\nN as the subset of TF|N onsisting of ve tors whi h are verti al with respe t to the proje tion. Of\nourse, in su h generality VF|N need not be a ve tor subbundle in TF .\n\nDe\u001cnition 2.1. A homogeneous stru ture on a smooth manifold F will be understood as a smooth\na tion h : R+ ×F → F of the multipli ative monoid (R+ , *) on F whi h is non-singular in the sense that\nthe verti al lift Vh (x) vanishes only for points x ∈ N = h0 (F ), i.e. the urves xh (t) are non-singular\nfor x ∈\n/ N.\nThe following theorem shows that the above property of an R+ -a tion on F determines that this a tion\nomes from a tual homotheties.\n\nTheorem 2.1. If h : R+ × F → F is a homogeneous stru ture on the manifold F , then there is a\nunique ve tor bundle stru ture on F whose homotheties oin ide with h.\nProof.- Working separately in omponents, we an assume that F , thus N = h0 (F ), is onne ted. The\nnon-singularity of V = Vh (having \u001cxed h we will skip the subs ript) means that N is exa tly the\ninverse-image by V of the zero-se tion: N = V −1 (0F ). The fundamental property of the verti al lift is\nthat it intertwines the R+ -a tion on F with the a tual homotheties in TF :\nV(hs (x)) = s * V(x).\n\n(2)\n\nIndeed, we get (2) from the a tion identity ht (hs (x)) = hts (x) after di\u001berentiating both sides with\nrespe t to t at t = 0.\nThe monoid a tion h indu es a monoid representation in the tangent spa es Tx F with x ∈ N . To\nsee this, for x ∈ N , put Ht (x) : Tx F → Tx F to be the derivative Ht (x) = Dx ht . It is easy to see that\nR+ ∋ t 7→ Ht (x) is a representation of the monoid (R+ , *) in Tx F . Indeed, di\u001berentiating the identity\nht ◦ hs = hst we get Dx ht ◦ Dx hs = Dx hst , i.e.\nHt (x) ◦ Hs (x) = Hts (x).\n\n(3)\n\nd\nNow, put P (x) = dt\nH (x). Di\u001berentiating (3) with respe t to t at t = 0, we get that the linear\n|t=0 t\nmap P (x) : Tx F → Tx F ommutes with Hs (x) and\n\nP (x) ◦ Hs (x) = Hs (x) ◦ P (x) = s * P (x).\n\n(4)\n\nMoreover, after di\u001berentiating the latter with respe t to s at s = 0, we get P (x)2 = P (x). This means\nthat P (x) is a proje tion and that Hs (x) respe ts the de omposition Tx F = Kx ⊕ Ex of Tx F into the\ndire t sum of the kernel Kx and the image Ex of P (x).\nLet us observe that one an interpret P (x) also as the verti al part of the derivative Dx V : Tx F →\nTV(x) TF with respe t to the de omposition of the spa e tangent to the tangent bundle TF at the\npoint V(x) = 0x of the zero-se tion into the verti al subspa e tangent to the \u001cber and the horizontal\nsubspa e tangent to the zero-se tion:\nDx V : Tx F → TV(x) TF = Tvx F ⊕ Thx F.\n\n4\n\n(5)\n\n\fIndeed, if we trivialize lo ally the tangent bundle TF in a neighborhood U of x0 ∈ N in F , say\nt\nTU = U × V , V = Tx0 F , with oordinates (xa , ẋb ), then Ht (x0 ) : V → V reads Ht (x0 ) = ∂h\n∂x (x0 ) and\nP (x0 ) =\n\n∂2h\n(0, x0 ).\n∂t∂x\n\n(6)\n\ne\nOn the other hand, V(x) = (h(0, x), ∂h\n∂t (0, x)), so that the proje tion V : U → V of V on V has the\nderivative\n2\ne = Dxv V = ∂ h (0, x0 ) = P (x0 ).\nDx 0 V\n(7)\n0\n∂x∂t\nThe family of ve tor spa e proje tions Px = P (h0 (x)) : V → V, x ∈ U , in \u001cnite-dimensional ve tor\nspa e V is lo ally of onstant rank. Indeed, the rank of Px is the tra e of Px whi h takes integer values\nand ontinuously depends on x, thus it is lo ally onstant. In our situation it means that the rank of the\nproje tions Px is onstant, say k , on N . By Vx1 denote the image Px (V ). With our lo al identi\u001c ation,\ne\nVx1 = Eh0 (x) . The intertwining property (2) implies that V(x)\nlies in Vx1 . Indeed, di\u001berentiating (2)\nv\nwith respe t to s at s = 0, we get Dh0 (x) (V(x)) = P (x)(V(x)) = V(x), i.e.\nV(x) ∈ Eh0 (x) .\n\n(8)\n\nSin e U ∋ x 7→ Px ∈ gl(V ) is smooth, it is lear that P0 := Px0 maps Vx1 isomorphi ally onto\nV01 := Vx10 forSx su\u001e iently lose to x0 , say from U . This gives a smooth trivialization of the ve tor\nbundle VU1 = x∈U Vx1 ,\nΦU : VU1 → U × V01 , Φ(x, vx ) = (x, P0 (vx )) ,\nand a smooth map\n\ne\nΨU = P0 ◦ V.\n\nΨU : U → V01 ,\n\nIt is easy to see that N ∩ U = Ψ−1\nU {0} and that ΨU is of maximal rank at points of N as the derivative\nDx ΨU = P0 ◦ Px is `onto'.\nHen e, due to the Impli it Fun tion Theorem, NS∩ U is a submanifold in U , thus the whole N is\na submanifold in F . This implies in turn that E = x∈N Ex , lo ally isomorphi with (N ∩ U ) × V01 ,\nis a smooth ve tor subbundle in TF over N . Moreover, V : F → E is of maximal rank, thus a lo al\ndi\u001beomorphism along N . For, observe that any ve tor v ∈ Tx F with x ∈ N , whi h is annihilated by\ne , thus be tangent to N . But V embeds N as the zerothe derivative Dx V must be annihilated by Dx V\nse tion 0N , so Dx V is an inje tion on Tx N ⊂ Tx F . Sin e V|N is an embedding, we an even say that\nV is a global di\u001beomorphism on a neighborhood UN of N in F onto a neighborhood W0 of the zero−1\nWS\nse tion in E . Hen e, x 7→ s−1 * V(hs (x)) is a di\u001beomorphism of h−1\n0 . But, a ording\ns (UN ) onto s\nto (2),Sthe latter map oin ides with V whi h is therefore a di\u001beomorphism of F = s≥1 hs (VN ) onto\nE = s≥1 sV0 , intertwining hs with the homothety by s. The ve tor bundle stru ture on F an be\nnow taken as the pull-ba k of the ve tor bundle stru ture in E by this di\u001beomorphism.\nUniqueness follows from the fa t that homogeneous stru ture (homotheties) on a ve tor spa e ompletely determines the linear stru ture, as 1-homogeneous smooth fun tions, i.e. fun tions satisfying\nf (s * x) = s * f (x), are exa tly linear fun tions.\n\u0003\n\nRemark 2.1.\n\nThe monoid (R+ , *) ontains an open-dense subset of invertible elements (R∗+ , *) \u0015 the\nmultipli ative group of positive reals. It is lear that any a tion h of (R+, *) restri ts to a group a tion\nof (R∗+ , *) whi h has an in\u001cnitesimal generator \u0015 the Euler (Liouville) ve tor \u001celd ∆h , where ∆h (x) is\nthe ve tor tangent to the urve xh (t) at t = 1. In the ase of a homogeneous stru ture this is exa tly\nthe Euler (Liouville) ve tor \u001celd ∆E of the ve tor bundle E . Of ourse, this ve tor \u001celd is omplete\nand its global \u001dow Exp(t∆E ) determines the homogeneous stru ture: Exp(t∆E )(x) = et * x. The\nabove theorem an be reformulated in terms of this ve tor \u001celd as follows. Note only that the linear\npart of a ve tor \u001celd ∆ on F at its singular point (zero) x0 is a well-de\u001cned liner map Tx0 F → Tx0 F\nwhi h in lo al oordinates is represented by the Ja obian matrix of partial derivatives of oordinates\nof ∆ near x0 .\n\nTheorem 2.2. A ve tor \u001celd\nstru ture on F if and only if\n\n∆\n\non a smooth manifold F is the Euler ve tor \u001celd of a ve tor bundle\n5\n\n\f(a) ∆ is omplete and the orresponding \u001dow R 7→ φt = Exp(t∆) of di\u001beomorphisms has the limit\nh0 (x) = limt→−∞ φt whi h is a proje tion of F onto the set N of singular points of ∆;\n(b) For every x0 ∈ N , the linear part of ∆ at x0 is a proje tion.\nProof.- One an follow the idea of the above proof for R+ -a tion but we will sket h an alternative\n\nproof in terms of normal hyperboli ity of \u001dows and linearization of ve tor \u001celds. Sin e the linear part\nof the ve tor \u001celd at singular points has only eigenvalues 0, 1, a ording to Shoshitaishvili Theorem, at\nsingular points x0 of ∆ we have a lo al de ompositon of the manifold into the enter manifold W 0 (x0 )\nand the unstable manifold W + (x0 ). The manifold W 0 (x0 ) is invariant, so in our ase it is unique, as\nit has to oin ide lo ally with N . This proves that N is a submanifold and we have, at least lo ally, a\n\u001cbration of F into unstable submanifolds over N . But on ea h W + (x0 ) the linear part of ∆ at x0 is\nidentity, so there are no resonan es and ∆ is smoothly equivalent to its linear part, i.e. to the Euler\nve tor \u001celd on Tx0 W 0 (x0 ). These linearizations on \u001cbers of the \u001cbrations an be glued together to a\nlinearization of ∆ near N , so to a lo al R+ -a tion near N . We an pass to the global a tion thanks to\nthe assumption (a).\n\u0003\n\nRemark 2.2.\n\nOf ourse, there are singular (R+ , *)-a tions whi h therefore do not orrespond to ve tor\nbundle stru tures. Take for example F = R with the a tion h : R+ × R → R, (t, x) 7→ t2 * x. It is lear\nthat Vh is trivial: V(x) = (0, 0) ∈ TR for all x ∈ R.\nTheorem 2.1 easily implies the following.\n\nTheorem 2.3. Every submanifold of a ve tor bundle, whi h is invariant with respe t to homotheties,\nis a ve tor subbundle (over a submanifold of the base).\nProof.- Let E be a submanifold of a ve tor bundle F over M whi h is homothety-invariant. It is easy\n\nto see that the R+ -a tion h by homotheties, redu ed to E , is a homogeneous stru ture on E . This is\nbe ause, learly, Vh|E = (Vh )|E , sin e the ve tor tangent to a urve in a submanifold an be naturally\nviewed as the ve tor tangent to this urve in the total manifold. This implies that h|E is an a tion\nby homotheties with respe t to a unique ve tor bundle stru ture on E over the losed submanifold\nN = h0 (E) ⊂ M . This ve tor bundle stru ture is a ve tor subbundle of VE|0E ⊂ VF|0F ≃ F , thus\nanoni ally a subbundle of F .\n\u0003\n\nRemark 2.3. A slightly weaker result has been ommuni ated to us by P. Urba«ski who assumed that\nthe interse tion of E with every \u001cber of F is a ve tor subspa e.\nIt should be not surprising that the on ept of a morphism in the ategory of ve tor bundles an\nbe ompletely des ribed in terms of the orresponding homogeneous stru tures.\n\nTheorem 2.4. A smooth map φ : F 1 → F 2 between the total spa es of two ve tor bundle stru tures\nhi0 : F i → M i , i = 1, 2, is a morphism of the ve tor bundles if and only if it ommutes with homotheties\nφ ◦ h1t = h2t ◦ φ .\n\n(9)\n\nProof.- Note \u001crst, that (9) easily implies that φ maps M 1 = h10 (F 1 ) into M 2 = h20 (F 2 ) and \u001cbers into\n\u001cbers. We therefore an assume then that F i , i = 1, 2, are just ve tor spa es.\nDi\u001berentiating (9) with respe t to t at t = 0, we get\nD0 φ ◦ V 1 = V 2 ◦ φ.\n\nSin e V i : F i → T0 F i are linear isomorphisms,\nφ = (V 2 )−1 ◦ D0 φ ◦ V 1 : F 1 → F 2\n\nis linear. The onverse, i.e. that a ve tor bundle morphism ommutes with homotheties is obvious. \u0003\n\nCorollary 2.1. A smooth map φ : F 1 → F 2 between the total spa es of two ve tor bundle stru tures\nis a morphism of the ve tor bundles if and only if it relates the Euler ve tor \u001celds:\nDx φ(∆F 1 (x)) = ∆F 2 (φ(x)).\n\n6\n\n(10)\n\n\fProof.- Di\u001berentiating (9) with respe t to t at t = 1, we get (10). Conversely, (10) implies that φ\nintertwines the \u001dows indu ed by ∆F 1 and ∆F 2 , i.e. φ ◦ h1t = h2t ◦ φ for t > 0, thus for all t ∈ R+ by\nontinuity.\n\u0003\n\n3 Commuting Euler ve tor \u001celds and double ve tor bundles\nConsider now two ommuting homogeneous stru tures h1 , h2 : R+ × F → F , h1t ◦ h2s = h2s ◦ h1t for\nall s, t ∈ R+ (or, equivalently, two ommuting Euler ve tor \u001celds, [∆1 , ∆2 ] = 0). Let us denote the\norresponding bases with E i = hi0 (F ), i = 1, 2. We have, in parti ular,\n(11)\n\nh1t (h20 (x)) = h20 (h1t (x))\n\nwhi h implies that E 2 = h20 (F ) is invariant with respe t to h1 . A ording to Theorem 2.3, this means\nthat E 2 is a ve tor subbundle of h10 : F → E 1 over the submanifold\nM = h10 (E 2 ) = h10 ◦ h20 (F ) = h20 ◦ h10 (F ) = h20 (E 1 ) = E 1 ∩ E 2 .\n\n(12)\n\nAnalogously, E 1 is a ve tor subbundle of h20 : F → E 2 over M . We will all them\nwe get the following diagram of ve tor bundle proje tions\n\nside bundles. Thus\n\nF\n\nh20\n\nh10\n\nh10\n\n\u000f\nE1\n\n(13)\n\n/ E2\n\nh20\n\n\u000f\n/M\n\nwhere we write simply h10 also for its restri tion to E 2 , et . Note also that E 1 , E 2 , M are anoni ally\nlosed submanifolds in F as the zero-se tions of the orresponding ve tor bundle stru tures. Moreover,\na ording to Theorem 2.4, the verti al and the horizontal arrows des ribe morphisms of ve tor bundles.\nLet Fxi be the x-\u001cber in F of the proje tion hi0 . For x ∈ M , let Cx be the kernel of the linear\nmap h20 : Fx1 → Ex2 . This means that Cx is also the kernel of h10 : Fx2 → Ex1 and Cx = Fx1 ∩ Fx2 . The\nsubmanifold Cx of F arries therefore two stru tures of a ve tor spa e hereditary from Fx1 and Fx2\nwhi h, however, oin ide a ording to the following proposition.\n\nProposition 3.1. Two real ve tor spa e stru tures on a manifold\noin ide.\n\nV\n\nwith ommuting homotheties\n\nProof.- Commutation of the homotheties implies that the ve tor spa e stru tures share the same zero\n0. Di\u001berentiating the ommutation relation h1t (h2s (x)) = h2s (h1t (x)), with respe t to t and s at t = 0\nand s = 0, we get\nD0 V 1 (V 2 (x)) = D0 V 2 (V 1 (x)),\nwhere V i = Vhi . But, for a ve tor spa e stru ture, D0 V is identity on T0 V , so V 1 = V 2 . This in turn\nimplies h1 = h2 as the ve tor spa e stru ture omes from T0 V by the identi\u001c ation V : V → T0 V .\n\u0003\nLet us go ba k to the ommutative diagram of ve tor bundle morphisms (13). We an redu e\nthe whole pi ture by \u001cxing x0 ∈ M and onsidering the pull-ba ks of {x0 } with respe t to all the\nproje tions. This means that we onsider the situation when M is just one point whi h an be then\nidenti\u001ced as 0 \u0015 the only point of the interse tion of the ve tor spa es E 1 and E 2 as submanifolds of\nF . We know already that C = F01 ∩ F02 is a ommon ve tor subspa e of F01 and F02 . We will all C\nthe ore of (h1 , h2 ). Sin e h10 (E 2 ) = {0}, the ve tor spa e E 2 is a subset, thus ve tor subspa e, of F01 .\nAnalogously, E 1 is a subspa e of F02 . Sin e h20 maps the \u001cber F01 linearly onto E 2 , its kernel C is a\nsubspa e omplementary to E 2 ⊂ F01 , as h20 is identi al on E 2 . Thus F01 = E 2 ⊕ C and, analogously,\n7\n\n\fF02 = E 1 ⊕ C . Using trivializations of the ve tor bundles in question (whi h always exist when the\nbases are ontra tible), we get (13), with M = {0}, in the form\nh20\n\nE1 × E2 × C\n\n(14)\n\n/ E2\n\nh10\n\nh10\n\n\u000f\nE1\n\n\u000f\n/ {0}\n\nh20\n\nwith obvious proje tions whi h are linear maps. Note however that the identi\u001c ation F = E 1 × E 2 × C\nis not anoni al and depends on the hoi e of the trivializations. Indeed, if (ξi , φa , θr ) are linear\noordinates in E 1 × E 2 × C , then a hange of the bases in E 1 , E 2 results in a hange of oordinates,\n\n\nX j X\nτi ξj ,\n(ξi′ , φ′a ) = \nρba φb  .\n(15)\nj\n\nb\n\nFurther, a hange of the trivialization of h10 over E 1 whi h respe ts the proje tion on E 2 results in a\nhange of oordinates,\n\n\nX\nX\nX j X\nτi ξj ,\n(ξi′ , φ′a , θr′ ) = \nρba φb ,\n(16)\nαbr (ξ)φb +\nβrs (ξ)θs  .\nj\n\nb\n\nb\n\ns\n\nX\n\nX\n\nX\n\nX\n\nFor the other proje tion we have\n\n\n\n(ξi′ , φ′a , θr′ ) = \n\nτij ξj ,\n\nj\n\nρba φb ,\n\nγrj (φ)ξj +\n\ns\n\nj\n\nb\n\n\n\nδrs (φ)θs  .\n\nThe hanges of oordinates (15) and (16) oin ide if and only if they have the ommon form\n\n\nX\nX\nX j X\nτi ξj ,\nρba φb ,\n(ξi′ , φ′a , θr′ ) = \nAbj\nBrs θs \nr φb ξj +\nj\n\nb\n\n(17)\n\n(18)\n\ns\n\nb,j\n\ns\nwith τij , ρba , Abj\nr , and Br onstant. But this hange of oordinates, redu ed to C , is not linear but\na\u001ene whi h shows that the bundle ζ = (h10 , h20 ) : F → E 1 × E 2 is a\u001ene, modelled on the trivial bundle\nE1 × E2 × C.\nLet us go ba k to the whole generality. The olle tion of all Cx with x ∈ M de\u001cnes a ve tor bundle\nC over M \u0015 the ore of (h1 , h2 ). If we take x0 ∈ M and a lo al hart U ⊂ M near x0 , then, using\nlo al trivializations of all ve tor bundles over the pull-ba ks of U (whi h are ontra tible bases), we\nget from (14) the following lo al form of (13)\n\nU × Ex10 × Ex20 × Cx0\n\n/ U × Ex1\n0\n\n\u000f\nU × Ex10 × Ex20\n\n\u000f\n/U\n\n(19)\n\nwith obvious proje tions. One important remark is that, again, the de omposition\n(h20 ◦ h10 )−1 (U ) = (h10 ◦ h20 )−1 (U ) = U × Ex10 × Ex20 × Cx0\n\ndepends on the hoi e of the trivializations. A hange in trivializations results in a hange of lo al\nlinear oordinates like in (18) but with oe\u001e ients depending on x ∈ U :\n\n\nX\nX\nX\nX j\nτi (x)ξj ,\nρba (x)φb ,\nAbj\nBrs (x)θs  .\n(x′u , ξi′ , φ′a , θr′ ) = xu ,\n(20)\nr (x)φb ξj +\nj\n\nb\n\nb,j\n\n8\n\ns\n\n\fIn the oordinates (xu , ξi , φa , θr ) ∈ U × Ex10 × Ex20 × Cx0 the Euler ve tor \u001celds orresponding to the\nve tor bundle stru tures h1 and h2 read\nX\nX\nX\nX\n∆1 =\n(21)\nφa ∂φa +\nθr ∂θr , ∆2 =\nξk ∂ξk +\nθr ∂θr .\na\n\nr\n\nk\n\nr\n\nThey learly ommute. The spa es Ex10 , Ex20 , Cx0 an be des ribed in terms of the Euler ve tor \u001celds\nas submanifolds de\u001cned by equations ∆1 = 0, ∆2 = 0, ∆1 = ∆2 , respe tively. Note also that the\noordinate fun tions (xu , ξi , φa , θr ) are (∆1 , ∆2 )-homogeneous of bi-degrees (0, 0), (1, 0), (0, 1), (1, 1),\nrespe tively. Conversely, any hange of oordinates that respe ts this bi-degree must be of the form\n(20) and it preserves ∆1 and ∆2 . What we get lo ally is therefore a lo al form of a double ve tor\nbundle \u0015 the notion introdu ed by J. Pradines [30, 31, 32℄ and studied in [2, 15, 41℄. This easily implies\nthat also globally double ve tor bundles and ommuting homogeneous stru tures are the same obje ts.\nSummarizing our onsiderations, we get the following.\n\nTheorem 3.1. A double ve tor bundle an be equivalently de\u001cned as a smooth manifold equipped with\ntwo ve tor bundle stru tures whose Euler ve tor \u001celds ∆1 , ∆2 ommute.\nTheorem 3.2. Any double ve tor bundle admits an atlas with harts whi h are invariant with\nrespe t to both homogeneous stru tures and lo al oordinates whi h are (∆1 , ∆2 )-homogeneous of\nbi-degrees (0, 0), (1, 0), (0, 1), (1, 1). Conversely,\nevery manifold F equipped with an atlas whose\nQ\nharts identify some domains in F with i1 ,i2 =0,1 V (i1 , i2 ), where V (0, 0) is a domain in Rm , and\nV (1, 0), V (0, 1), V (1, 1) are R-ve tor spa es, and the hanges of oordinates respe t the bi-degrees\n(i1 , i2 ), arries a anoni al stru ture of a double ve tor bundle with the Euler ve tor \u001celds whi h are\nlo ally of the form ∆1 = ∆V (0,1) + ∆V (1,1) and ∆2 = ∆V (1,0) + ∆V (1,1) .\n\n4 Higher ve tor bundles\nA generalization of the on ept of ve tor bundle and double ve tor bundle suggested by previous\nonsiderations is now straightforward:\n\nDe\u001cnition 4.1. A smooth n-tuple ve tor bundle (shortly - n-ve tor bundle) is a smooth manifold F\nequipped with n stru tures of ve tor bundles whose orresponding Euler ve tor \u001celds ∆i , i = 1, . . . , n,\npairwise ommute. A morphism between n-ve tor bundles (F, ∆1 , . . . , ∆n ) and (F ′ , (∆′ )1 , . . . , (∆′ )n ) is\na smooth map φ : F → F ′ whi h relates ∆k with (∆′ )k , i.e. Dx φ(∆k (x)) = (∆′ )k (φ(x)), k = 1, . . . , n,\nx ∈ F.\nRemark 4.1.\n\nWith respe t to the above de\u001cnition, a non-trivial permutation of the Euler ve tor\n\u001celds leads to non-isomorphi n-ve tor bundles. Sometimes, however, it is onvenient to onsider weak\nisomorphisms, i.e. isomorphisms up to su h a permutation.\nAn indu tive reasoning, ompletely parallel to that proving Theorem 3.2, gives the following.\n\nTheorem 4.1. Any n-ve tor bundle admits an atlas with harts whi h are invariant with respe t to\nall the homogeneous stru tures and lo al oordinates whi h are (∆1 , . . . , ∆n )-homogeneous of n-degrees\ni = (i1 , . . . , in ), ik = 0, 1.\nConversely,\nQ every manifold F equipped with an atlas whose harts identify some domains in F\nwith W = i∈{0,1} V (i), where V (0), 0 = (0, . . . , 0), is a domain in Rm , and V (i), i 6= 0, are Rve tor spa es, and the hanges of oordinates respe t the n-degrees i = (i1 , . . . , in ), arries a anoni al\nstru ture of an n-ve tor bundle with the Euler ve tor \u001celds whi h are lo ally of the form\nn\n\n∆k =\n\nX\n\ni′k 6=0\n\nwhere i′k = (i1 , . . . , ik−1 , 0, ik+1 , . . . , in).\n\n9\n\n∆V (i) ,\n\n\fIt is also a straightforward indu tive observation that any smooth hange of oordinates in W\nrespe ting the n-degrees (i1 , . . . , in ) of homogeneity must be of the form\nX\nY j\nX\n(v ′ )ji =\n(22)\nT(ij 1 ,...,ir ;j1 ,...,jr )\nviaa ,\nP\n\na\n\nia =i (j1 ,...,jr )\n\nwhere vij , j = 1, . . . , dim(V (i)), are linear oordinates in V (i) and T∗∗ are smooth fun tions on V (0).\nThis shows that our n-bundles oin ide with the n-tuple ve tor bundles des ribed by T. Voronov [41℄\nand the triple ve tor bundles (for n = 3) studied by K. Ma kenzie [26℄.\nTo des ribe loser the\nP stru ture of n-ve tor bundles, let us introdu e some onventions. For i, j ∈\n{0, 1}n, we write |i| = k ik and i ≤ j , if ik ≤ jk for all k = 1, . . . , n. Denote also δ 1 = (1, 0, . . . , 0),\nδ 2 = (0, 1, 0, . . . , 0), et ., and p(i) = {i − δ k ∈ {0, 1}n : ik = 1}. Let us write also 1n = (1, . . . , 1) and,\nfor k = 1, . . . , n, [k] = 1n − δ k .\nT\nFor any i ∈ {0, 1}n the submanifold Fi = ik =0 {∆k = 0} is itself an |i|-ve tor bundle with respe t\nto the Euler ve tor \u001celds {∆k : ik = 1} and bases Fi′ with i′ ∈ p(i). Thus we get a generalization of the\ndiagram (13), the hara teristi diagram of the n-ve tor bundle F , whi h is a ommutative diagram\nwith 2n verti es Fi and ve tor bundle morphisms hk0 from Fi , with ik = 1, to Fi′k . In parti ular, F is\nthe total spa e of the n ve tor bundle stru tures hk0 : F → F[k] . The interse\ntion of their \u001cbers over the\nT\nzero-se tions gives rise to a ve tor bundle C over the \u001cnal base M = k F[k] \u0015 the ore of the n-ve tor\nbundle. The \u001cnal base M is lo ally represented by V (0) and \u001cbers of C are lo ally represented by\nV (1n ). The lo al oordinates of n-degrees ≤ i form lo al oordinates on Fi . Note that we an view\nformally any n-ve tor bundle as an (n + 1)-ve tor bundle by adding a trivial (zero) Euler ve tor \u001celd.\nIn this way, we an regard Fi as an n-ve tor bundle with trivial Euler ve tor \u001celds ∆k with ik = 0, i.e.\nwith the Euler ve tor \u001celds ∆1 , . . . , ∆n from F but restri ted to Fi . Then hk0 , viewed as a map from\nFi , with ik = 1, onto Fi′k , is a morphism of n-ve tor bundles. If we remove from the hara teristi\ndiagram the total spa e F (together with the maps from F ), then we get a smaller diagram of n-ve tor\nbundle morphisms \u0015 the base of our n-ve tor bundle whi h we denote by B = B(F ). It is easy to see\nthat the base does not determine F . There is however a \u001cnal obje t \u0015 the base produ t \u0015 denoted by\n×B su h that B(×B) = B and, for any n-ve tor bundle F with base B , there is a submersive n-ve tor\nbundle morphism ψF : F → ×B whi h is identi al on B . This morphisms an be viewed as \"removing\nthe ore\" operation. For example, the base produ t for a double ve tor bundle (13) is the produ t (or\ndire t sum) of the ve tor bundles E 1 ×M E 2 ≃ E 1 ⊕M E 2 . In general, ×B(F ) an be identi\u001ced with\nthe image of the map (h10 , . . . , hn0 ) : F → F[1] × . . . × F[n] , i.e., lo ally, ψF : F → ×B(F ) is just the\nproje tion modulo the ore:\nY\nV (i).\n×B(F ) =\ni∈{0,1}n , i6=1n\n\nThe oordinate hanges in ×B(F ) are proje tions of the orresponding oordinate hanges (22) for F .\nFor instan e, the hara teristi diagram for the triple ve tor bundle ( f. [26℄) looks like\nF011 o\nx\nx\nxx\nxx\nx\n|\nx\nF001 o\n\nF101\n\nF111\nxx\nx\nx\nxx\nx| x\n\n\u000f\nF110\nx\nxx\nxx\nx\n\u000f x| x\n\n\u000f\nF010 o\nx\nxx\nxx\nx\n\u000f x\n|x\nF000 o\n\nF100\n\n10\n\n(23)\n\n\fwhereas its base is:\n\n(24)\n\nF011\nxx\nx\nx\nxx\n|x\nx\nF001 o\n\nF101\n\n\u000f\nF010 o\nxx\nxx\nx\nx\n\u000f |xx\no\nF000\n\nF110\nxx\nx\nx\nxx\n\u000f x| x\n\nF100\n\nMore generally, for any i ∈ {0, 1} , one an also de\u001cne n-manifolds F<i = ×B(Fi ), whi h lo ally looks\nlike\nY\nV (j).\nF<i =\nn\n\nj∈{0,1}n , j<i\n\nDenote by Ai (F ) the spa e of fun tions on F with n-degree i. It is an A0 (F ) = C ∞ (M )-module whi h\nis learly lo ally free and \u001cnite-dimensional, so it an be viewed as the module of se tions of some\nve tor bundle V i (F ) over M . For instan e, for a double ve tor bundle F , the module A(1,1) (F ) is\nlo ally generated by produ ts of two oordinates of degrees (1, 0) and (0, 1), and oordinates of degree\n(1, 1), so that the symmetri tensor produ t V (1,0) (F ) ∨M V (0,1) (F ) is a subbundle in V (1,1) (F ) and\nwe have a short exa t sequen e\n0 → V (1,0) (F ) ∨M V (0,1) (F ) → V (1,1) (F ) → C → 0.\nL\nWe an onsider also the graded asso iative and ommutative algebra A(F ) = i∈Zn Ai (F ) of homoL\ngeneous fun tions (with the onvention Ai (F ) = {0} if i ∈\n/ Nn ). Every its part A(i) (F ) = j≤i Aj (F )\nis a prototype of a higher module: we have anoni al operations Aj (F ) × Ak (F ) → Aj+k (F ) (or\nV j (F ) ⊗M V k (F ) → V j+k (F )) for j + k ≤ i with obvious properties. We\nL an do the same with\nrespe t to the total degree and to de\u001cne, for m ∈ N, the spa es Am (F ) = |i|=m Ai (F ) of fun tions\nL\nof total degree m, and the orresponding higher modules A(m) (F ) = |i|≤m Ai (F ). They orrespond\nto ertain ve tor bundles V m (F ) and V (m) (F ) over M .\n\n5 The tangent lift, the phase lift, and duality\nIn this se tion we show how to lift Euler ve tor \u001celds to the tangent and the otangent bundle. For\nthe tangent and otangent lifts of ve tor \u001celds we refer to [44, 12, 13℄. Note only that both lifts respe t\nthe Lie bra ket.\nApplying the tangent fun tor to homotheties asso iated with a homogeneous stru ture h : R+ ×E →\nE we get a new homogeneous stru ture dT h, (dT h)t = T(ht ). Indeed, dT h : R+ × TE → TE is learly\na smooth a tion of (R+ , *) and the non-singularity assumption is preserved. In the adapted lo al\noordinates in TE we have\ndT h(t, x, y, ẋ, ẏ) = (x, ty, ẋ, tẏ).\n(25)\nThus the proje tion (dT h)0 maps TE onto TM and the orresponding Euler ve tor \u001celd is the\nplete) tangent lift of the Euler ve tor \u001celd of h,\nX\nX\ndT ∆E =\nyk ∂yk +\nẏk ∂ẏk .\nk\n\n( om(26)\n\nk\n\nNote that the tangent lift dT ∆E is linear, i.e. ommutes with the Euler ve tor \u001celd of the tangent\nbundle ∆TE , and on E it redu es to ∆E . Moreover, the tangent lifts of ommuting ve tor \u001celds\nommute, so we get the following.\n\n11\n\n\fTheorem 5.1. The tangent bundle of an n-ve tor bundle (F, ∆1 , . . . , ∆n ) is anoni ally an (n + 1)ve tor bundle with respe t to the Euler ve tor \u001celds dT ∆1 , * * * , dT ∆n , ∆TF . The orresponding side\nbundles are F and TF[k] , k = 1, . . . , n, respe tively. In parti ular, the iterated tangent bundle T(n) M =\nTT * * * TM is anoni ally an n-ve tor bundle with (T(n) M )i ≃ (T(|i|) M ).\nQ\nIf i∈{0,1}n V (i) are lo al harts in F as in Theorem 4.1, then we have VTF ((i, 0)) = VTF ((i, 1)) = V (i),\ni > 0, for fa tors of lo al harts in TF . In parti ular, (TF )(i,0) = Fi and (TF )(i,1) = TFi .\nThe \"phase fun tor\" has not as good properties as the tangent one, sin e, in general, it asso iates\nonly relations with smooth maps. Therefore the otangent lift d∗T ∆E of ∆E , whi h by de\u001cnition is the\nhamiltonian ve tor \u001celd of the linear fun tion ι∆E on T∗ E represented by ∆E , is not an Euler ve tor\n\u001celd. We get, however, an Euler ve tor \u001celd, denoted by T∗ ∆E and alled the phase lift of ∆E , if we\nadd the Euler ve tor \u001celd ∆T∗ E of the otangent bundle,\n\n(27)\n\nT∗ ∆E = d∗T ∆E + ∆T∗ E .\n\nIn the adapted lo al oordinates,\nd∗T ∆E (x, y, p, π) =\n\nX\n\nyk ∂yk −\n\nX\n\nπj ∂πj\n\nj\n\nk\n\nand\nT∗ ∆E (x, y, p, π) =\n\nX\nX\nX\nX\nπj ∂πj +\npa ∂pa )\nπj ∂πj ) + (\n(\nyk ∂yk −\n\n=\n\nX\n\nyk ∂yk +\n\nk\n\nX\n\n(28)\n\na\n\nj\n\nj\n\nk\n\npa ∂pa .\n\na\n\nThe Euler lift T∗ ∆E is linear, i.e. ommutes with ∆T∗ E , and on E it redu es to ∆E . The base of\nthe orresponding homogeneous stru ture T∗ h is anoni ally identi\u001ced with the dual bundle E ∗ whi h\nis anoni ally embedded in T∗ E . The homogeneous stru ture T∗ h will be alled the phase lift of h.\n∗\nIt ommutes with the standard homogeneous stru ture hT E on T∗ E . Thus the otangent bundle\nT∗ E is anoni ally a double ve tor bundle with respe t to the pair of ommuting Euler ve tor \u001celds\n(T∗ ∆E , ∆T∗ E ). It is well known that there is a anoni al isomorphism of double ve tor bundles ( f.\n[7, 15, 14℄) being simultaneously a symple tomorphism of the anoni al symple ti stru tures:\n\n(T∗ h)0\n\nT∗ ED\nDD hT∗ E\nDD 0\nDD\nD!\nE\n\nTE\n∗\nhE\n0\n\n−id\n\n/ T∗ E ∗\nEE ∗ E∗\nEE(T h )0\nEE\nEE\n\"\n/E\n\n(29)\n\nh0\n\n\u0005\nid\nE∗ E\nEE hE∗\nEE 0\nEE\nE\" \u0006\nM\n\nid\n\n\u0005\n/ E∗\nGG E∗\nGGh0\nGG\nGG\n# \u0005\n/M\n\nwhi h in lo al oordinates reads\nTE (x, y, p, π) = (x, π, p, −y)\n\nh0\n\n(30)\n\nand identi\u001ces (∆T∗ E , T∗ ∆E ) with (T∗ ∆E ∗ , ∆T∗ E ∗ ). This isomorphism, alled sometimes a Legendre\ntransform, has been \u001crst dis overed by W. M. Tul zyjew [37℄ for E = TM in the ontext of Legendre\ntransformation in analyti al me hani s. Sin e TE is a symple tomorphism, we get additionally that\nthe anoni al symple ti form ωE on T∗ E is 1-homogeneous not only with respe t to ∆T∗ E but also\nwith respe t to the phase lift T∗ ∆E . These properties ompletely determine the ve tor \u001celd T∗ ∆E if\nits restri tion to E is given. Namely, we have the following.\n\n12\n\n\fProposition 5.1. Any ve tor \u001celd X on T∗ M whi h ommutes with the Euler ve tor \u001celd ∆T M and\nsatis\u001ces LX ωM = a * ωM , where a ∈ R and ωM is the anoni al symple ti form on T∗ M , is tangent\nto M and ompletely determined by a and its restri tion to M . In parti ular, the otangent lift d∗T Y\nis the unique linear and hamiltonian extension to T∗ M of a ve tor \u001celd Y on M .\n\u0001\nP\nProof.- Write X = j fj (x, p)∂x + gj (x, p)∂p in lo al Darboux oordinates (xj , pk ). The property\n∗\n\nj\n\nj\n\n[X, ∆T∗ M ] = 0 implies easily that fj are ofP\n0-homogeneous and gj are 1-homogeneous with respe t to\n∆T∗ M , i.e. fj (x, p) = fj (x) and gj (x, p) = k gjk (x)pk . Now,\n\u0013\nX\u0012\nX\n∂fk\nj\nk\ndpj ∧ dx = LX ωM =\ngj (x) + j (x) dpk ∧ dxj ,\na*\n∂x\nj\nj,k\n\ni.e.\n\n∂fk\n(x).\n∂xj\nP\nThus, for a given a, the ve tor \u001celd X is ompletely determined by its restri tion j fj (x)∂xj to M .\n\u0003\ngjk (x) = a * δjk −\n\nSin e the phase lift of an Euler ve tor \u001celd is Euler, the otangent bundle of an n-ve tor bundle (F, ∆1 , . . . , ∆n ) is anoni ally an (n + 1)-ve tor bundle with respe t to the Euler ve tor \u001celds\nT∗ ∆1 , * * * , T∗ ∆n , ∆T∗ F due to the following proposition.\n\nProposition 5.2. The phase lifts T∗X and T∗ Y of ve tor \u001celds\nX and Y ommute.\nProof.- The linear fun tions ιX , ιY on T∗ M , orresponding to\n\nX, Y\n\non M ommute if and only if\n\nommuting ve tor \u001celds X and Y ,\nommute with respe t to the symple ti Poisson bra ket, so that they hamiltonian ve tor \u001celds d∗T X\nand d∗T Y ommute. The otangent lifts d∗T X and d∗T Y are linear ve tor \u001celds on T∗ M , so they ommute\nwith the Euler ve tor \u001celd ∆T∗ M . Hen e\n[T∗ X, T∗ Y ] = [d∗T X + ∆T∗ M , T∗ Y + ∆T∗ M ] = 0.\n\nConversely, if T∗ X and T∗ Y ommute, then [X, Y ] = [T∗ X, T∗ Y ]|M = 0.\n\n\u0003\n\nIn homogeneous lo al oordinates (xj ) on F , put gk (xj ) to be the degree of xj with respe t to ∆k ,\n∆ (xj ) = gk (xj )xj . Then, in the adapted lo al oordinates (xj , ps ) in T∗ F ,\nX\nX\nT∗ ∆k =\n(31)\ngk (xj )xj ∂xj +\n(1 − gk (xj ))pj ∂pj .\nk\n\nk\n\nIf\n\nQ\n\ni∈{0,1}n\n\nk\n\nV (i) are lo al harts in F as in Theorem 4.1, then we have VT∗ F (1n , 1) = T∗ V (0) and\nVT∗ F ((i, 0)) = V (i),\n\nVT∗ F ((i, 1)) = V (1n − i)∗ , i > 0,\n\nfor fa tors of lo al harts in T∗ F . In parti ular, (T∗ F )(i,0) = Fi . The side bundles of the (n + 1)-ve tor\n∗\n∗\nbundle T∗ F are F and F(k)\n, k = 1, . . . , n, where F(k)\n= (F, ∆1 , . . . , ∆n )∗∆k is the ve tor bundle dual to\nk\nthe ve tor bundle stru ture h0 : F → F[k] determined by the Euler ve tor \u001celd ∆k , respe tively. But,\n∗\n∗ , so up to all these identi\u001c ations we\na ording to (29), T∗ F ≃ T∗ F(k)\n, T∗ ∆k ≃ ∆T∗ F(k)\nan write\n∗\n∗ ,...,∆ ∗ ∗\n(T∗ F, T∗ ∆1 , . . . , T∗ ∆n , ∆T∗ F , ) ≃ (T∗ F(k)\n, ∆T∗ F(1)\nT F(n+1) ),\n\n(32)\n\n∗\n∗\n∗\nand ∆T∗ F(n+1)\n= ∆T∗ F . The dual bundle F(k)\nis anoni ally\nwhere we use the onvention F = F(n+1)\nan n-ve tor bundle (with respe t to the restri tions of the orresponding Euler ve tor \u001celds):\n∗\n∗ , . . . , ∆T∗ F ∗\n∗\n∗\n, ∆T∗ F(1)\n(F(k)\n, ∆T∗ F(k+1)\n, . . . , ∆T∗ F(n+1)\n).\n(k−1)\n\nOne an also easily derive the fa t that the set of n-ve tor bundles\n∗\n∗\n},\n, . . . , F(n)\n(F, ∆1 , . . . , ∆n )∗ = {F, F(1)\n\n13\n\n\fthe set of duals of the n-ve tor bundle (F, ∆1 , . . . , ∆n ), is losed with respe t to passing to the dual\nbundle with respe t to any of the ve tor bundle stru ture on them ( f. [15, 26℄). The orresponding\nisomorphisms respe t the n-bundle stru tures, if we a ept the weak isomorphisms related to reordering\n∗ , . . . , ∆T∗ F ∗\nof the Euler ve tor \u001celds (or, better to say, by \u001cxing the original order ∆T∗ F(1)\n). In fa t,\n(n+1)\nfor k, l = 1, . . . , n, l 6= k ,\n\u0001\nQ\nQ\n∗ ∗\n∗\n∗\n∗ , . . . , ∆T∗ F ∗\n∗F ∗\n∗F ∗\nV\n(i)\n(F(k)\n, ∆T∗ F(1)\n,\n∆\nV\n(i)\n×\n,\n.\n.\n.\n,\n∆\n=\n)\n=\nT\nT\n∆\n∗\ni\n=1\ni\n=0\n∗\nk\nk\n(k−1)\n(k+1)\n(n+1)\nT F\n∆ T∗ F ∗\n(l)\n(l)\n\u0010Q\n\u0011 \u0010Q\n\u0011\nQ\nQ\n∗\n∗\nV\n(i)\n×\n×\nV\n(i)\nV\n(i)\n×\nV\n(i)\n=\nn\nn\nik ,il =0\nik =1,(1 −i)l =0\nik =0,il =1\nik =1,(1 −i)l =1\nQ\nQ\n∗\n∗\n∗\n∗\n∗\n∗\n(33)\nil =1 V (i) = (F(l) , ∆T∗ F(1) , . . . , ∆T∗ F(l−1) , ∆T∗ F(l+1) , . . . , ∆T∗ F(n+1) ) .\nil =0 V (i) ×\nThis implies that the set of duals of an n-ve tor bundle ontains, in general, (n + 1)-elements up to\nisomorphisms, if we a ept weak isomorphisms, or (n + 1)! elements, if we ount permutations of the\nn-ve tor bundle stru tures. For example, if we start with a double ve tor bundle (13) with the ore\nC , then we get the following triple ve tor bundle:\n∗ o\nF(2)\n}}\n}}\n}\n}\n~}}\n∗ o\nC\n\nz\nzz\nz\nzz\n\u000f z\n}z\no\nM\n\n∗\nF(1)\n\n\u000f\nE2 o\n\nT ∗F\n{\n{\n{{\n{{\n{\n{} {\n\nxx\nxx\nx\nxx\n\u000f x| x\nE1\n\n\u000f\nF\n\nOur observation an be summarized as follows.\n\nTheorem 5.2. The otangent bundle T∗F of an n-ve tor bundle (F, ∆1 , . . . , ∆n ) is anoni ally an\n(n+1)-ve tor bundle with respe t to the Euler ve tor \u001celds T∗ ∆1 , * * * , T∗ ∆n , ∆T F and the side bundles\n∗\n∗\nF and F(1)\n, . . . , F(n)\n-the dual bundles of F with respe t to all the ve tor bundle stru tures on F . There\n∗\nare anoni al isomorphisms of the (n + 1)-ve tor bundles T∗ F ≃ T∗ F(k)\n. Moreover, the duals of the\n∗\n∗\n∗\n∗\n∗\nn-ve tor bundle F(k) are anoni ally isomorphi to F, F(1) , . . . , F(k−1) , F(k+1)\n, . . . , F(n)\n. In parti ular,\n∗ (n)\n∗ ∗\n∗\nthe iterated otangent bundles (T ) M = T T * * * T M are anoni ally n-ve tor bundles.\n∗\n\n6 Symple ti and Poisson n-ve tor bundles\nDe\u001cnition 6.1.\n\nA symple ti n-ve tor bundle is an n-ve tor bundle (F, ∆1 , . . . , ∆n ) equipped with a\nsymple ti form Ω whi h is 1-homogeneous with respe t to all ve tor bundle stru tures:\nL∆k Ω = Ω,\n\nk = 1, . . . , n ,\n\n(34)\n\nwhere L denotes the Lie derivative.\nAn example of a symple ti ve tor bundle is the otangent bundle T∗ M with the anoni al symple ti form ωM . Consequently, the otangent bundle of any (n − 1)-ve tor bundle (E, ∆1 , . . . , ∆n−1 )\nis a anoni al example of a symple ti n-ve tor bundle. Indeed, we know already that the anoni al\nsymple ti stru ture ωM is 1-homogeneous with respe t to ∆T∗ F and with respe t to any phase lift.\n\nTheorem 6.1. Any symple ti n-ve tor bundle (F, ∆1 , . . . , ∆n , Ω), n ≥ 1, is anoni ally isomorphi\nto the otangent bundle over ea h of its side bundles F[k] , equipped with the anoni al symple ti form:\nk−1\n∗\nn\n), ∆T∗ F[k] , T∗ (∆k+1\n(F, ∆1 , . . . , ∆n , Ω) ≃ (T∗ F[k] , T∗ (∆1|F[k] ), . . . , T∗ (∆|F\n|F[k] ), . . . , T (∆|F[k] ), ωF[k] ),\n[k]\n\n14\n\n\fk = 1, . . . , n.\n\nIn parti ular, all symple ti n-ve tor bundles\nk−1\n∗\nn\n), ∆T∗ F[k] , T∗ (∆k+1\n(T∗ F[k] , T∗ (∆1|F[k] ), . . . , T∗ (∆|F\n|F[k] ), . . . , T (∆|F[k] ), ωF[k] )\n[k]\n\nk = 1, . . . , n,\n\nare anoni ally isomorphi .\n\nProof.- Sin e Ω is a 1-homogeneous symple ti form on the ve tor bundle hk0 : F → F[k] , we have\n\na anoni al isomorphism φk : (F, Ω) → (T∗ F[k] , ωF[k] ) of symple ti ve tor bundles whi h identi\u001ces ∆k with ∆T∗ F[k] . But F[k] is an (n − 1)-ve tor bundle with respe t to the restri tions of\n∆1 , . . . , ∆k−1 , ∆k+1 , . . . , ∆n , so T∗ F[k] , thus F , is a symple ti n-ve tor bundle with respe t to the\nEuler ve tor \u001celds\nk−1\n∗\nn\n), ∆T∗ F[k] , T∗ (∆k+1\nT∗ (∆1|F[k] ), . . . , T∗ (∆|F\n|F[k] ), . . . , T (∆|F[k] ).\n[k]\n\nSin e φk is identity on F[k] , the ve tor \u001celd T∗ (∆j|F[k] ) oin ides with (φk )∗ (∆j ) on F[k] . But the linear\nve tor \u001celd X = (φk )∗ (∆j ) on the otangent bundle T∗ F[k] , whi h additionally satis\u001ces LX ωF[k] = ωF[k]\nis ompletely determined by its values on F[k] , so\nT∗ (∆j|F[k] ) = (φk )∗ (∆j ).\n\u0003\n\nDe\u001cnition 6.2.\n\nA Poisson n-ve tor bundle is an n-ve tor bundle (F, ∆1 , . . . , ∆n ) equipped with a\nPoisson tensor Λ whi h is linear, i.e. homogeneous of degree -1, with respe t to all ve tor bundle\nstru tures:\nL∆k Λ = −Λ, k = 1, . . . , n .\n(35)\nOf ourse, any symple ti n-ve tor bundle is automati ally a Poisson n-ve tor bundle. Sin e any linear\nPoisson stru ture on a ve tor bundle E orresponds to ertain de Rham derivative in the Grassmann\nalgebra A(E ∗ ) asso iated with the dual bundle, we an asso iate with any Poisson n-ve tor bundle\n∗\nF the de Rham derivatives dk in A(F(k)\n). For Poisson stru tures, homogeneity of degree -1 we all\nlinearity, sin e the orresponding Poisson bra ket is losed on linear (1-homogeneous) fun tions. This\nis exa tly the Lie algebroid bra ket on se tion of the dual bundle. Thus we an state the following.\n\nProposition 6.1. Any Poisson n-ve tor bundle F indu es Lie algebroid stru tures on all dual ve tor\n∗\nbundles F(k)\n→ F[k] .\nThe Lie algebroid stru tures on all duals of an n-ve tor bundle F we will all\nobtained in the above way \u0015 from a Poisson n-ve tor bundle stru ture on F .\n\non ordant, if they are\n\n7 Multi-graded manifolds\nA graded manifold is a super-manifold equipped with an additional grading in the stru ture sheaf. The\noordinate transformations are required to preserve this grading. The al ulus on graded manifolds\nhas been developed e.g. in [40, 34, 29℄. Our aim is to des ribe super-manifolds graded by n-tuples of\nnon-negative integers (i.e. by Nn ).\n\nDe\u001cnition 7.1. Let G be an abelian semigroup, G ∋ g 7→ pg ∈ N, g ∈ G, be any fun tion su h that\npg 6= 0 only for \u001cnitely many g ∈ G, and let g 7→ g̃ be a semigroup homomorphism G → Z2 . A\nG-graded manifold M of dimension (p) is a super-manifold whose lo al oordinates (xi ) an be hosen\nhomogeneous with respe t to a G-gradation in the stru ture sheaf whi h agrees with the Z2 -gradation,\ni.e. su h that the G-degrees oin ide with the parity:\nxi xj = (−1)eg(x\n\ni\n\n)e\ng(xj )\n\nand the hanges of oordinates respe t the gradation.\n15\n\nxj xi ,\n\n\fNote also that, if G is an abelian monoid (with additive notation) then the lo al oordinates of\ndegree 0 ∈ G give rise naturally to a graded submanifold M of M whi h is a standard (non-graded)\nsmooth manifold together with a proje tion M → M . For other on epts of graded di\u001berential\ngeometry we refer to [34, 40℄ or to [29℄. Espe ially, the on ept of degree-shifting fun tor [h] we borrow\nfrom the latter. Let h ∈ G. The degree-shifting fun tor [h] a ts on the ategory of G-graded ve tor\nspa es and assigns to a G-graded spa e V = ⊕g∈G Vg the spa e W = ⊕g∈G Wg+h , where Wg+h onsists\nof the same elements as Vg but has degree g + h. Any fun tor on G-graded ve tor spa es gives rise to\nan operation on G-graded ve tor bundles. Note that the shift operator [h] has the e\u001be t of de reasing\nthe degree of \u001cber oordinates of a G-graded ve tor bundle E → M by h ∈ G. In all our ases G will\nbe the group Zn (or its sub-semigroup) and g = (g1 , . . . , L\ngk ) 7→ g̃ = (g1 + . . . + gk ) mod 2.\nFor a G-graded manifold M we denote by A(M) = g∈G Ag (M) the G-graded algebra of polynomial fun tions on M.\n\nDe\u001cnition 7.2.\n\nAn n-graded manifold is an Nn -graded manifold M whi h admits an atlas with lo al\noordinates of degrees ≤ 1n = (1, . . . , 1) ∈ Nn .\nL\nSimilarly as in the ase of n-ve tor bundles, we have the algebra A(M) = i∈Nn Ai (M) of polynomial\nfun tions. The di\u001beren e is that this graded asso iative algebra is graded ommutative instead of being\njust ommutative. The A0 (M) = C ∞ (M )-modules Ai (M) and the higher modules A(i) (M), as well\nas the orresponding ve tor bundles V i (M) and V (i) (M) are de\u001cned ompletely analogously. We an\nalso pass to to the orresponding obje ts with respe t to the total degree.\nP\nRemark 7.1. Passing from Nn - or Zn -degree i to the total degree |i| = k ik allows us to asso iate\nwith every n-graded manifold an N -manifold of degree n, in the terminology introdu ed by P. \u0092evera\n[36℄ and exploited by D. Roytenberg [33, 34℄.\n\nA onvenient way to des ribe the Nn -gradation in an n-graded manifold M is to onsider the Euler\nve tor \u001celds ∆kM , k = 1, . . . , n, whose eigenvalues represent the degrees of homogeneous fun tions\ng(f ) = (g1 (f ), . . . , gn (f )). In lo al oordinates (xj ),\nX\ngk (xj )xj ∂xj ,\n∆kM =\n(36)\nj\n\nso f is of degree i ∈ Nn if ∆kM (f ) = ik f , k = 1, . . . , n. We have a fundamental orresponden e between\nn-ve tor bundles and n-graded manifolds.\n\nTheorem 7.1. With every n-ve tor bundle F = (F, ∆1 , . . . , ∆n ) one an anoni ally asso iate an\nn-graded manifold MF = gr(F, ∆1 , . . . , ∆n ) su h that lo al oordinates in F of n-degree i ≤ 1n orrespond to graded lo al oordinates in MF of degree i. This orresponden e gives an equivalen e of the\norresponding ategories.\nProof.- Assume that an n-ve tor bundle F is given by an atlas in whi h lo al oordinates vij 's transform\n\nas in (22). Passing from F to a super-manifold stru ture requires a slight aution be ause in general\nthe transformation formula (22) does not work in a super-manifold ontext.\nLet us introdu e oordinates θij , of degree i ∈ {0, 1}n on a domain V(0) ⊂ Rm , orresponding to the\noordinates vij . Let us \u001cx an order ≺ on the set {0, 1}n su h that δ 1 ≺ . . . ≺ δ n . Let J(i) = (j1 , . . . , j|i| )\nbe the growing sequen e of those k = 1, . . . , n, for whi h ik = 1. Let [i1 , . . . , ir ] ∈ {±1} be the sign of\nthe permutation (J 1 , . . . , J r ) of the set J(i) = J 1 ∪ . . . ∪ J r , where J a = J(ia ) and i = i1 + . . . + ir .\nWe laim that the following hange of oordinates\nX\nX\n(θ′ )ji =\n[i1 , . . . , ir ] T(ij 1 ,...,ir ;j1 ,...,jr ) θij11 . . . θijrr ,\n(37)\nP\n\na\n\nia =i (j1 ,...,jr )\n\nwhere 0<i1 ≺...≺ir , satis\u001ces the o y le ondition. This is so be ause of the following easy properties of\nthe introdu ed sign\nj\nj\n[iσ1 , . . . , iσr ]θiσσ11 . . . θiσσrr = [i1 , . . . , ir ]θij11 . . . θijrr\n(38)\n\n16\n\n\ffor any permutation σ and\n[i1,1 + . . . + i1,s , i2 , . . . , ir ][i1,1 , . . . , i1,s ] = [i1,1 , . . . , i1,s , i2 , . . . , ir ].\n\n(39)\n\nOne an obtain the orresponding n-graded manifold MF also by means of applying the degree-shifting\nfun tors ([29℄, Proposition 2.2.27).\nConversely, given a n-graded manifold one easily re overs the non-graded transformation fun tions\nT∗∗ , whi h produ e the n-ve tor bundle F . Also the morphisms in the onsidered ategories are in oneto-one orresponden e if we apply the rules analogous to the rules just des ribed for the oordinate\nhanges. In parti ular, the rule (37) des ribes graded di\u001beomorphisms.\n\u0003\nSimilarly like in the n-ve tor bundle ase, any n-graded manifold gives rise to a ommutative diagram\nof graded ve tor bundle proje tions τ(i,i′ ) : Mi → Mi′ , where i ∈ Nn , i′ ∈ p(i), and Mi is the graded\nsubmanifold of M with lo al oordinates redu ed to those whose degrees are ≤ i. Of ourse, Mi is\nanoni ally an |i|-graded manifold. In this way we get graded ve tor bundles τ k : M → M[k] and the\ndual bundles σ k : M∗(k) → M[k] .\nGiven an n-graded manifold M let us denote by dgr(M) the degradation of M, i.e. an n-ve tor\nbundle F su h that gr(F ) = MF . If A is a subset of {1, . . . , n}, #A = k , we an onsider F as\n(n − k)-ve tor bundle with respe t to the Euler ve tor \u001celds ∆s with s 6∈ A. We denote it by A F and\nde\u001cne A M := dgr(M, ∆A ) as (n − k)-graded manifold asso iated with A F , i.e. gr(A F, ∆A ) = A M.\nNote that the \u001cnal base of A F (and so the support of A M) has #A-ve tor bundle stru tures. If A, B\nare disjoint subsets of {1, . . . , n} then A∪B M = A (B M), sin e both sides are (n − #A − #B)-graded\nmanifolds asso iated with the (n − #A − #B)-ve tor bundle A∪B F .\n\nExample 7.1.\n\nWith a ve tor bundle E over M we asso iate the N-graded manifold ME . Lo al\noordinates (xa ) on M and a basis of lo al se tions of the dual bundle E ∗ give rise to lo al homogeneous\noordinates (xa , y i ) on E . The lo al oordinates on ME are (xa , ξ i ) of degrees, respe tively, 0 and 1,\nand the same hange of oordinates as des ribed by the de\u001cnition of the ve tor bundle E ∗ . Thus, with\nevery i-se tion ν from the Grassmann algebra A(E ∗ ) we asso iate a fun tion ιν of degree i on ME\nin an obvious way, so that A(ME ) ≃ A(E ∗ ). A Lie algebroid stru ture on E is the same as a linear\nPoisson stru ture on E ∗ , or the same as a homologi al ve tor \u001celd Q, [Q, Q] = 0 and Q of weight 1,\non ME .\nThe graded tangent bundle TM of an n-graded manifold M is by de\u001cnition the (n + 1)-graded\nmanifold asso iated with the tangent bundle T(dgr(M)) of the n-ve tor bundle dgr(M) being the\ndegradation of M, i.e. M = Mdgr(M) . The degree of ∂xj as a fun tion on T∗ M is −g(xj ) ∈ −Nn .\nSimilarly, to obtain an (n + 1)-ve tor bundle asso iated with T∗ dgr(M) \u0015 the graded otangent bundle\nT∗ M \u0015 we have to de\u001cne the degree of ∂xj as (1n − g(xj ), 1) ∈ Nn+1 . One an also say that the\nphase lifts T∗ (∆kM ) whi h, in the\ngrading in T∗ M is indu ed by the Euler ve tor \u001celds ∆T∗ M and theP\nj\n∗\nstandard adapted lo al oordinates (x , pj ) have the form ∆T M = j pj ∂pj and\nT∗ (∆kM ) =\n\nX\nj\n\n\u0001\ngk (xj )xj ∂xj + (1 − gk (xj )pj ∂pj .\n\nThe bases of the orresponding proje tions are M and M∗(k) , k = 1, . . . , n, and this set of n-graded\nmanifolds is losed with respe t to the orresponding dualities.\nWe say that an r-form (resp., an r-ve tor \u001celd) α is of weight i ∈ Zn , w(α) = i, if L∆kM (α) = ik α,\nk = 1, . . . , n. Note that with this onvention the weight of dxj is w(xj ) = g(xj ) ∈ Nn , but the degree\nof dxj as a fun tion in TM is (g(xj ), 1) ∈ Nn+1 . Similarly, the weight of ∂xj is −w(xj ) = −g(xj ) ∈ Zn ,\nbut the degree of ∂xj as a fun tion in T∗ M is (1n − g(xj ), 1) ∈ Nn+1 .\n\n8 Multi-graded symple ti and Poisson manifolds\nDe\u001cnition 8.1. A n-graded symple ti (resp. Poisson) manifold is an n-graded manifold equipped\nwith a symple ti form of weight 1n (resp., a Poisson tensor of weight −1n ).\n17\n\n\fRe all that a di\u001berential 2-form ω an be lo ally written in lo al oordinates (xi ) as\nω=\n\n1X i\ndx ωi,j dxj .\n2 i,j\n\n(40)\n\nA 2-from ω on M is alled symple ti , if dω = 0 and ω is non-degenerate. The latter means that the\nindu ed homomorphism of A(M)-modules\nω̃ : Γ(TM) → Γ(T∗ M),\n\nX 7→ iX ω,\n\nis invertible. For any (n − 1)-graded manifold M, the n-graded manifold T∗ M posses a anoni al\nsymple ti form ωM of weight 1n . Indeed, \u001cxing lo al oordinates (xj ) in M, one an easily see that\nthe 2-form ωM whi h in the adapted oordinates (xj , ps ) in T∗ M reads\nX\ndpj dxj\nωM =\nj\n\nis well de\u001cned, symple ti and, sin e w(dpj ) = 1n − w(dxj ), of weight 1n . Note that for any ve tor\n\u001celd X on M we an de\u001cne its phase lift T∗ X = d∗T X + ∆T∗M exa tly like in the standard ase. Here,\nd∗T X is the otangent lift of X \u0015 the hamiltonian ve tor \u001celd of the linear fun tion on T∗ M asso iated\nwith X . The phase lifts are linear, i.e. ommute with ∆T∗ M and satisfy LT∗ X ωM = ωM . We have\nalso full analogs of Propositions 5.1 and 5.2.\nIt is well known that any symple ti ve tor bundle (E, ∆E , Ω), i.e. a ve tor bundle (E, ∆E )\nequipped with a symple ti form whi h is 1-homogeneous with respe t to the Euler ve tor \u001celd, L∆E Ω =\nΩ, is anoni ally isomorphi to the otangent bundle over the base of E with the anoni al symple ti\nform: (E, ∆E , Ω) ≃ (T∗ M, ∆T∗ M , ωM ). A similar fa t holds for symple ti N-manifolds of degree 1 in\nthe terminology of D. Roytenberg or 1-graded symple ti manifolds in our terminology: every 1-graded\nmanifold M equipped with a symple ti form Ω of weight 1 (L∆M Ω = Ω) is di\u001beomorphi to T∗ M\nequipped with the anoni al symple ti form ( f. [34, Proposition 3.1℄). We an generalize this fa t,\ni.e. we have the following graded version of Theorem 6.1.\n\nTheorem 8.1. Any n-graded symple ti manifold is anoni ally isomorphi to the graded otangent\nbundle T∗ M of an (n − 1)-graded manifold M, equipped with the anoni al symple ti form ωM.\nMoreover, we have anoni al symple tomorphisms\n(T∗ M, ωM ) ≃ (T∗ M∗(k) , ωM∗(k) ).\n\nProof.- The proof is ompletely parallel to that of Theorem 6.1 and we omit it.\n\n(41)\n\u0003\n\nRe all ( f. [10, 11℄) that a graded Poisson bra ket of degree i on a Zn -graded asso iative ommutative algebra A = ⊕k∈Zn Ak is a graded bilinear map {*, *} : A × A → A of degree i ∈ Zn su h\nthat\n1. {a, b} = −(−1)(|a|+|i|)(|b|+|i|){b, a} (graded anti ommutativity),\n2. {a, bc} = {a, b}c + (−1)(|a|+|i|)|b| b{a, c} (graded Leibniz rule),\n3. {{a, b}, c} = {a, {b, c}} − (−1)(|a|+|i|)(|b|+|i|){b, {a, c}} (graded Ja obi identity), where |a| denotes\nthe total degree of a, et .\nA homogeneous element q of degree k with the parity opposite to the parity of i we all homologi al if\n{q, q} = 0. It indu es a ohomology operator dq = {q, *} of odd total degree |k + i| on A.\nThe bra ket {*, *} = {*, *}M on A(T∗ M) asso\nP iated with the anoni al symple ti form ωM and\nrepresented lo ally by the Poisson tensor ΛM = j ∂pj ∂xj is a graded Poisson bra ket of degree −1n .\nSin e the algebra A(T∗ M) is non-negatively graded, negative degrees mean simply 0. Re all also\n( f. [33, 34℄)that with any linear Poisson stru ture Λ on a ve tor bundle E , thus with any de Rham\ndi\u001berential DΛ on the Grassmann algebra A(E ∗ ) of multi-se tions of the dual bundle, one an asso iate\na fun tion HΛ = ιDΛ on T∗ ME , so that {HΛ , *} is the otangent lift d∗T DΛ . Here, we learly identify\n18\n\n\fA(ME ) = A(E ∗ ) with basi fun tions on T∗ ME . In lo al homogeneous oordinates (x, y) on E and\n(x, θ, p, ξ) on T∗ ME , every Λ of weight -1 is of the form\nX\n1X u\nΛ=\nρra (x)∂yr ∧ ∂xa +\nCr,s (x)y u ∂yr ∧ ∂ys ,\n2\na,r\nr,s\n\nso\n\nHΛ =\n\nX\n\nρra (x)ξ r pa −\n\na,r\n\n1X u\nC (x)θu ξ r ξ s .\n2 r,s r,s\n\nIn other words the fun tion HΛ is a homologi al Hamiltonian whose hamiltonian ve tor \u001celd QΛ =\n{HΛ , *} is the otangent lift of the de Rham derivative DΛ . As T∗ ME ≃ T∗ ME ∗ , this Hamiltonian an\nbe also viewed as the fun tion ιΛ on T∗ ME asso iated with the Poisson tensor Λ ∈ A(E). The Hamiltonian HΛ has not only total degree 3 but it is homogenous of bi-degree (1, 2). In some terminology\none says also that Λ determines a Lie algebroid stru ture on E and that (M, QΛ ) is a Q-manifold or\nLie antialgebroid in the language of [1, 39, 40, 41℄. To \u001cnd a generalization for Poisson n-bundles (F, Λ)\nlet us re all that in this ase the Poisson tensor Λ determines ( on ordant) Lie algebroid stru tures on\n∗\n→ F[k] , i.e. (by de\u001cnition on ordant) homologi al ve tor \u001celds q[k] of degree\nall ve tor bundles F(k)\nn\n∗ . We will say that a ve tor \u001celd on an n-graded manifold is unital if its homogeneous\nδ on MF(k)\nparts have weights δ 1 = (1, 0, . . . , 0), δ 2 = (0, 1, 0, . . . , 0), et . Observe that any unital ve tor \u001celds q[k]\non the side bundle N[k] of an (n + 1)-graded symple ti manifold N de\u001cnes the indu ed ve tor \u001celd\n(q[k] )[s] on N[s] , s = 1, . . . , n + 1, de\u001cned as the restri tion of the otangent lift d∗T q[k] to T∗ N[k] ≃ N .\n∗\n= N[k] . We have the\nIf we onsider the (n + 1)-graded symple ti manifold N = T∗ MF , then MF(k)\nfollowing.\n\nProposition 8.1. Homologi al ve tor \u001celds q[k] of degree δn on MF = N[k] , k = 1, . . . , n, are\non ordant if and only if their otangent lifts oin ide (up to the identi\u001c ation T∗ MF ≃ T∗ MF ),\ni.e., if and only if (q[k] )[s] = q[s] for all k, s = 1, . . . , n.\nProof.- The otangent lifts, uniquely determined by their restri tions to MF = N[k] , an be easily\n∗\n(k)\n\n∗\n(k)\n\n∗\n(s)\n\n∗\n(k)\n\nseen as represented by the Hamiltonian ve tor \u001celd with the Hamiltonian HΛ asso iated with Λ.\n\n\u0003\n\n9 Higher Courant stru tures, higher Lie algebroids, and Drinfeld n-tuples\nA Lie bialgebroid, as introdu ed in [28℄, is a pair of Lie algebroid stru tures Λ, Λ∗ on a ve tor bundle\nE and its dual E ∗ that satis\u001ces ertain ompatibility ondition. This ompatibility ondition has been\nre ognized in [33℄ as the ommutation of the orresponding homologi al Hamiltonians {HΛ , HΛ′ } = 0\non T∗ ME ≃ T∗ ME ∗ . This means exa tly that the Hamiltonian H = HΛ + HΛ′ of total degree 3 is\nhomologi al and on entrated in bi-degrees (1, 2) + (2, 1), i.e. the orresponding hamiltonian ve tor\n\u001celd Q is on entrated in weights (1, 0) + (0, 1). The total weight of Q is 1. Note that there are\nhomologi al ve tor \u001celds of total weight 1 and bi-degrees (−1, 2) or (2, −1). They lead to the on ept\nof quasi Lie bialgebroids. The derived bra ket (in the terminology of Y. Kosmann-S hwarzba h)\n{X, Y }Q = {{X, H}, Y } = −(−1)|x|+n{Q(X), Y },\n\nis losed on fun tions representing se tions of E ×M E ∗ and gives a standard model of a Courant\nbra ket [4, 5℄ in its non-symmetri version, or a Courant algebroid [4, 18, 33℄. Note however that the\non ept of Courant algebroid is more general and based on graded symple ti manifolds of degree 2\nwhi h are not bi-graded in general. The whole stru ture, i.e. T∗ ME with the anoni al symple ti\nPoisson bra ket and the homologi al hamiltonian and unital ve tor \u001celd Q \u0015 the Drinfeld double of the\noriginal Lie bialgebroid \u0015 is a natural generalization of the Drinfeld double Lie algebra [6℄.\nA natural generalization of the above on epts is as follows.\n\nDe\u001cnition 9.1.\n\nAn n-Courant stru ture is an n-graded symple ti manifold (N , Ω) equipped with a\nhomologi al Hamiltonian of total degree (n + 1). A Drinfeld n-tuple is an n-Courant stru ture whose\nhomologi al hamiltonian ve tor \u001celd is unital.\n19\n\n\fWe know already that (N , Ω) = (T∗ M, ωM ) for an (n − 1)-graded manifold M. Let {*, *} be the\nsymple ti Poisson bra ket on (N , Ω) = (T∗ M, ωM ). This Poisson bra ket is a graded Poisson bra ket\non A(N ) of degree −1n , i.e. of total degree −n. It is a general algebrai fa t that the derived bra ket\n{X, Y }H = {{X, H}, Y } of any homologi al Hamiltonian H ∈ An+1 (N ) of the total degree (n + 1) (or\nof any homologi al hamiltonian and ve tor \u001celd Q of total weight 1) is then a Leibniz bra ket of total\ndegree (1 − n). In lassi al terms, this bra ket an be interpreted as a n-Courant algebroid, i.e. as a\nbra ket on A(n−1) (N ) \u0015 the module of se tions of the ve tor bundle C = V (n−1) (N ) over M . Note that\nthe symple ti Poisson bra ket also gives rise to ertain operations on subbundles of C = V (n−1) (N ),\nnamely h*, *ij,k : V j (N ) ⊗M V k (N ) → V j+k−n (N ), or, globally, to a graded operation\nh*, *i : C(N ) ⊗M C(N ) → C(N )\n\nof degree −1n on the graded ve tor bundle\nC(N ) =\n\nM\n\nMV\n\ni\n\n(N ).\n\n|i|<n\n\nIf we do not insist on working with multi-graded symple ti manifolds, whi h means \u0015 otangent bundles\n\u0015 and we admit symple ti graded N-manifolds of degree n in the terminology of D. Roytenberg [34℄,\nthen, analogously, we get a notion of a Courant algebroid of degree n. In this ontext, however, the\non ept of Drinfeld n-tuple makes no sense.\nRe ently, the double Lie algebroids, as introdu ed by K. C. Ma kenzie [19℄ \u0015 [23℄, have been\nre ognized by T. Voronov [41℄ as double Q-manifolds and generalized to n-fold Q-manifolds, i.e. ngraded manifolds MF (asso iated with an n-ve tor bundle F ) and endowed with a homologi al unital\nve tor \u001celd Q. This means that Q = Q1 + * * * + Qn , where Q1 , . . . , Qn are ommuting homologi al\nve tor \u001celds of n-degrees, respe tively, δ 1 , . . . , δ n .\nMore pre isely, an n-fold Lie algebroid is an n-ve tor bundle F equipped with Lie algebroids stru tures on the ve tor bundles hk0 : F → F[k] , k = 1, . . . , n, and satisfying ertain ompatibility onditions.\nIn parti ular, all morphism in the hara teristi diagram should be Lie algebroid morphisms. An elegant way to des ribe these onditions is to pass to the orresponding n-graded manifold M = MF .\nThen, we an interpret these Lie algebroid stru tures as homologi al ve tor \u001celds Qk of weight 1 on the\norresponding 1-graded manifolds and \u001cnally, due to the ommutativity of Lie algebroid morphisms,\nas a homologi al and unital ve tor \u001celd on the n-graded total spa e M. The ompatibility onditions redu e now to the fa t that the ve tor \u001celds Qk ommute. Equivalently, the total ve tor \u001celd\nQ = Q1 + * * * + Qn is unital and homologi al, so we end up with the following (see [41℄).\n\nDe\u001cnition 9.2.\n\n\u001celd.\n\nAn n-fold\n\nLie algebroid is an n-graded manifold with a homologi al and unital ve tor\n\nObserve that n-fold Lie algebroid is a parti ular ase of a Drinfeld (n + 1)-tuple.\n\nProposition 9.1. There is a one-to-one orresponden e between n-fold Lie algebroids\ne has trivial summand of weight δ n+1 .\ne su h that Q\n(n + 1)-Drinfeld tuples (T∗ M, Q)\n\n(M, Q)\n\nand\n\nProof.- Let us put Qe = d∗T Q. Then, as easily seen, Qe is a Hamiltonian and homologi al ve tor \u001celd on\n\ne is a Hamiltonian and unital ve tor \u001celd on T∗ M with the\nT∗ M of weight (0, w(Q)). Conversely, if Q\ne = d∗ Q for some unital ve tor \u001celd Q on M. Moreover, sin e\ntrivial summand of weight δ n+1 , then Q\nT\n∗\ne\ne\ndT [Q, Q] = [Q, Q] = 0, then Q is homologi al.\n\u0003\n\nLet F , MF , Q be as above and let i, j ∈ {0, 1}n, i < j . We laim that the ve tor \u001celd Q indu es\na (|j| − |i|)-fold Lie algebroid stru ture on the (|j| − |i|)-ve tor bundle whose total spa e is Fj and\nthe \u001cnal base is Fi . Be ause Q is tangent to Mj it is enough to verify the laim for M = MF , i.e.\nfor j = 1n . Moreover, an indu tive reasoning shows that we may also assume that |i| = 1, sin e an\n(n − |i|)-ve tor bundle an be rea hed in |i| steps in whi h we simply forget about one Euler ve tor\n\u001celd. Note that the (n − 1)-graded manifold {k} M asso iated with the (n − 1)-ve tor bundle {k} F\nde\u001cned by Euler ve tor \u001celds {∆s }, s 6= k , an be obtained from MF by applying the parity hanging\nfun tor to the super ve tor bundle M → M[k] , i.e. {k} M = ΠM[k] M. The ve tor \u001celd Q̃ := Q − Qk is\n20\n\n\fa linear ve tor \u001celd with respe t to the ve tor bundle M → M[k] . The following general fa t implies\nthat we an pass from Q̃ to a ve tor \u001celd Q̄ on {k} M.\n\nLemma 9.1. Let E → M be a super ve tor bundle and V ect0 (E) denotes the Lie algebra of linear\nve tor \u001celds on E . There exist a anoni al A(M)-linear isomorphism of Lie algebras\n(42)\n\nφ : V ect0 (E) → V ect0 (ΠM E).\n\nProof.- Let {ηi } and {μi } be the orresponding lo al linear oordinates on E and ΠM E , respe tively,\nand let ĩ := η̃i , so μ̃i = ĩ + 1. The Lie algebra V ect0 (E) is lo ally spanned by the ve tor \u001celds ηi ∂ηj .\nThe following formula\nφ(ηi ∂ηj ) = (−1)ĩ+j̃ μi ∂μj\nP\n′\ndoes not depend on the hoi e of lo al oordinates. In fa t, if ηP\ni =\nj ηj Tji (x), Tji (x) ∈ A(M),\ndes ribes transformations of \u001cber oordinates of E , then also μ′i = j μj Tji (x) and\nηi′ ∂ηj′\n\n=\n\nX\nk\n\n=\n\nX\n\nηi′\n\nX\n∂ηk\n∂ηk =\nηl Tli (x)T jk (x)∂ηk\n′\n∂ηj\nl,k\n\nl̃(ĩ+l̃+k̃+j̃)\n\n(−1)\n\nTil (x)T jk ηl ∂ηk ,\n\nl,k\n\nbe ause the parity of Tij (x) is ĩ + j̃ . Hen e\nX\nφ(ηi′ ∂ηj′ ) =\n(−1)ĩ+j̃ μl Til (x)T jk (x)∂μk = (−1)ĩ+j̃ μ′i ∂μ′j .\nl,k\n\nIt is also easy to al ulate that φ preserves the Lie bra ket of ve tor \u001celds.\n\n\u0003\n\nIt follows from above lemma that Q̄ is a homologi al ve tor \u001celd on {k} M and so indu es a (n − 1)-fold\nLie algebroid stru ture on {k} F . Thus we get the following.\n\nProposition 9.2. An n-fold Lie algebroid stru ture on an n-ve tor bundle F indu es anoni ally, for\ni, j ∈ {0, 1}n, i < j , an (|j| − |i|)-fold Lie algebroid stru ture on the (|j| − |i|)-ve tor bundle whose total\nspa e is Fj and the \u001cnal base is Fi .\nA natural way of onstru ting n-fold Lie algebroids an be based on the following trivial observation.\n\nTheorem 9.1. If (M, Q) is an n-fold Lie algebroid, then\ndi\u001berential on TM, is an (n + 1)-fold Lie algebroid.\n\n(TM, dT Q + d),\n\nwhere d is the de Rham\n\nProof.- Sin e the tangent lift of ve tor \u001celds respe ts the S houten bra kets [12℄, dT Q is a homologi al\nve tor \u001celd with omponents of weights δ 1 , . . . , δ n . Moreover, any tangent lift, whi h lo ally reads\n!\nX ∂f a\nX\na\nb\nf (x)∂xa +\nẋ ∂ẋa ,\n∂xb\na\nb\n\nommutes with the de Rham ve tor \u001celd d =\nunital.\n\nP\n\na\n\nẋa ∂xa of weight δ n+1 , so Q + dT is homologi al and\n\u0003\n\nThe question now is: what is the higher analogue of a Lie bialgebroid? Our answer is obvious: it\norresponds to a Drinfeld n-tuple. Re all that a Drinfeld n-tuple is an n-graded symple ti manifold\nwith a homologi al Hamiltonian and unital ve tor \u001celd. Let us take an n-graded symple ti manifold\n(N , Ω). We know already that (N , Ω) = (T∗ M, ωM ) for an (n − 1)-graded manifold M. If Q =\nQ1 + * * * + Qn is the de omposition of the homologi al ve tor \u001celd of a Drinfeld n-tuple on (N , Ω) =\n(T∗ M, ωM ) into homogeneous parts of weights δ 1 , . . . , δ n . It is easy to see that [Q, Q] = 0 implies\n[Qr , Qs ] = 0 for all r, s = 1, . . . , n, i.e. all ve tor \u001celds Qk are homologi al and pair-wise ommuting.\nr\nMoreover, for any s 6= r, the ve tor \u001celd Qr is tangent to N[s] and proje table to the ve tor \u001celd q[s]\nwith respe t to the anoni al proje tion N → N[s] .\n21\n\n\fr\nTherefore, N[s] posses anoni ally n ommuting homologi al ve tor \u001celds q[s]\n, r, k = 1, . . . , n \u0015 the\nrestri tions of Q1 , . . . , Qn . Here, for te hni al onvenien e, we list n ve tor \u001celds for ea h base, but\nr\n= 0, i.e. N[s] is anoni ally an (n − 1)-fold Lie algebroid. But the olle tion of all N[s]\nlearly q[r]\nis a olle tion of (n − 1)-graded manifolds M, M∗(1) , . . . M∗(n−1) , losed with respe t to duality. As a\nmatter of fa t, a ording to the graded analog of Proposition 5.1, the ve tor \u001celd Qr is the otangent\nr\nfor s 6= r. The ompatibility ondition for all the (n − 1)-fold Lie algebroid stru tures on\nlift of q[s]\n∗\nM, M(1) , . . . M∗(n−1) is expressed by saying that they ome from proje tions of ertain homologi al\nhamiltonian and unital ve tor \u001celds on T∗ M, i.e. from Drinfeld n-tuples. We an say that n-tuple\nLie algebroid orresponds to a Drinfeld n-tuple, exa tly like a Lie bialgebra (or a Lie bialgebroid)\norresponds to a Drinfeld double Lie algebra (or Lie algebroid). In parti ular, these stru tures are\nr\nr\nompatible with the base stru ture BN , i.e. the proje tions of q[k]\nand q[s]\non N[k,s] oin ide, where\n[k, s] ∈ {0, 1}n has zeros exa tly at positions k, s = 1, . . . , n. The pair of homologi al ve tor \u001celds:\nk\ns\nq[s]\non N[s] , and q[k]\non N[k] , where E = N[s] and E ∗ = N[k] are regarded as dual ve tor bundles over\nN[k,s] \u0015 the degraded manifold N[k,s] , forms a Lie bialgebroid. Indeed, Qk and Qs are the otangent\nk\ns\nand q[k]\nto N ≃ T∗ N[s] ≃ T∗ N[k] , so in T∗ E ≃ T∗ E ∗ they are represented by ommuting\nlifts of q[s]\nand homologi al Hamiltonians Hk and Hs of degrees (2, 1) and (1, 2). A ording to the result of\nD. Roytenberg [33℄, this means exa tly that we deal with a Lie bialgebroid. It is not true, however,\nthat in general all these Lie bialgebroid stru tures produ e a Drinfeld n-tuple even under a natural\nr\nr\nondition saying that the ve tor \u001celds q[k]\nand q[l]\nindu ed from algebroid stru tures on N[k] → N[r,k]\nand N[l] → N[r,l] oin ide on N[k,l] , as shown in the following example.\n\nExample 9.1.\n\nConsider a trivial double ve tor bundle M = R × R2 × R × {∗} over a point {∗} with\n1-dimensional ore and trivial side bundles of rank 1 and 2. Then N := T∗ M arries a 3-ve tor bundle\n(1)\n(2)\nstru ture. Let us denote by v011 , v101 and v001 , v001 the \u001cber oordinates on the ore and the side\n(2)\n(1)\nve tor bundles N[1,3] and N[1,2] , respe tively. Let {e001 , e001 , e011 } be the orresponding dual basis of\nse tions of the bundle N[1] → N[1,3] . We endow this bundle with a stru ture of Lie algebroid by setting\nthe an hor to zero and A(N[1,3] )-linear Lie bra ket as follows:\n(1)\n\n(2)\n\n[e001 , e001 ] := v010 * e011 ,\n(k)\n\n[e001 , e011 ] := 0 for k = 1, 2. Obviously, this is a nilpotent Lie bra ket. The indu ed homologi al ve tor\n3\n\u001celd q[1]\non N[1] in the orresponding graded lo al oordinates {θia }, i ∈ {0, 1}3, has the form\n(1)\n\n(2)\n\n3\n= θ010 θ001 θ001 ∂θ011 .\nq[1]\n\nLet us assume that the other 5 ve tor bundles N[k] → N[k,l] arries the zero Lie algebroid stru ture.\nThen of ourse the 3 pairs of Lie algebroids (N[k] , N[l] ) over N[k,l] onstitute a Lie bialgebroid. Note\n3\nr\nthat the restri tion of q[1]\nto N[1,2] is zero, so the ve tor \u001celds q[k]\noin ide on interse tions, i.e.\nr\nr\nq[k]\n|N[k,l] = q[l]\n|N[k,l] = 0 for distin t r, k, l. However they do not ome from Drinfeld 3-tuple on N ,\n3\n3\n3\nbe ause the otangent lifts d∗T q[1]\n6= 0 and d∗T q[2]\n= 0 (as q[2]\n= 0) an not be equal to Q3 at the same\ntime.\nThe following theorem gives su\u001e ient onditions.\n\nTheorem 9.2. Let M be an (n − 1)-graded manifold. A Drinfeld n-tuple on N = T∗ M is equivalent\nto a olle tion of Lie bialgebroid stru tures on all the pairs of dual ve tor bundles N[k] and N[s] over\ns\nk\nand q[s]\n, respe tively,\nthe ommon base N[k,s] , k 6= s, related to homologi al unital ve tor \u001celds q[k]\nwhi h satisfy the ompatibility ondition\nr\nr\n)[s] = q[s]\n(q[k]\n\nfor r 6= k\n\n(43)\n\ns\n= 0.\nwith the onvention q[s]\nr\nProof.- The ve tor \u001celd q[k]\nis of degree 1 with respe t to the Euler ve tor \u001celd ∆r , so of degree 0\n\nwith respe t to ∆s , s 6= r. A similar statement is true for the ve tor \u001celd Qr[k] \u0015 the (unique) linear\n22\n\n\fr\nr\nHamiltonian extension of q[k]\nto N , i.e. Qr[k] = d∗T (q[k]\n). A ording to the graded version of Proposition\nr\nr\n5.1, the ve tor \u001celd Q[k] oin ides with Q[s] for k, s 6= r, so that Qr de\u001cned as Qr[s] for some (thus\nall) s 6= r is of degree δ r . Sin e Qr[s] and Qs[r] , r 6= s, ommute be ause they orrespond to the given\nbialgebroid stru ture on (N[s] , N[r] ), the ve tor \u001celds Qr pairwise ommute and Q = Q1 + * * * + Qn\ngives rise to a Drinfeld n-tuple on N = T∗ M whi h indu es pres ribed bialgebroid stru tures.\n\u0003\nr\nSin e, for a \u001cxed r, the ve tor \u001celds q[k]\n, k 6= r, are on ordant, we an also hara terize a Drinfeld\nn-tuple in terms of Poisson stru tures.\n\nTheorem 9.3. A Drinfeld n-tuple is a olle tion of Poisson (n − 1)-ve tor bundles in duality: (F, Λ)\n∗\nand (F(k)\n, Λk ), k = 1, . . . , n − 1, whi h are ompatible in the sense that the orresponding Hamiltonians\nHΛ and HΛ , k = 1, . . . , n − 1, interpreted as fun tions on T∗ MF ≃ T∗ MF , ommute with respe t\nto the symple ti Poisson bra ket.\n∗\n(k)\n\nk\n\nLet us end up with some words about redu tion. Sin e we deal, in fa t, with a homologi al Hamiltonian system (N , Ω, H) on a symple ti super-manifold (N , Ω), the redu tion should be understood\nas the Hamiltonian redu tion with respe t to a oisotropi and n-graded submanifold N0 . If we assume\nthat the Hamiltonian H is onstant on leaves of the hara teristi foliation F of N0 and the quotient\nN ′ = N0 /F is a well-de\u001cned multi-graded manifold, then the restri tion of Ω to N0 proje ts to a\nsymple ti form Ω′ on N ′ , the homologi al Hamiltonian H proje ts to a homologi al Hamiltonian H ′\non N ′ and we end up with a new homologi al Hamiltonian system (N ′ , Ω′ , H ′ ) \u0015 new n-Courant or new\nDrinfeld n-tuple stru ture. Of ourse, this pi ture overs the redu tion asso iated with the moment\nmap of a Hamiltonian group a tion: this is only the hoi e of the oisotropi submanifold whi h is\ndetermined by the moment map μ \u0015 the inverse-image μ−1 ({0}). Note only that this group a tion\nshould respe t the graded stru ture, i.e. it should ommute with the Euler ve tor \u001celds.\n\nExample 9.2.\n\nConsider the anoni al symple ti triple ve tor bundle\nT∗ TTM ≃ T∗ T∗ TM ≃ T∗ TT∗ M ≃ T∗ T∗ T∗ M\n\nwith the hara teristi diagram\nT∗ TM o\ntt\nt\ntt\ntt\nztt\nT∗ M o\n\nt\ntt\ntt\nt\nt\n\u000f t\nz t\nM o\n\nT∗ TTM\nr\nr\nr\nr\nr\nr\nr\nrx rr\n∗\nTT M\n\n\u000f\nTM o\n\u000f\nTM\n\n\u000f\nTTM\nrr\nrrr\nr\nr\nrx rr\n\nThe tangent bundle τM : TM → M is anoni ally a Lie algebroid. The orresponding homologi al\nve tor \u001celds on TM is the de Rham ve tor \u001celd DM whi h in lo al oordinates (x,\nP ẋ) (we do not\ndistinguish oordinates in TM and TM , et ., for simpli ity) hasP\nthe form DM = a ẋa ∂xa , so the\norresponding hamiltonian of degree (2, 1) on T∗ TM is H(2,1) = a ẋa pa . It is well known that Lie\nalgebroid stru tures\non T∗ M su h that, together with DM , give a Lie bialgebroid ome from Poisson\n1 P\nstru tures Λ = 2 a Λab (x)∂xa ∧ ∂xb on M . The orresponding Hamiltonian on T∗ T∗ M ≃ T∗ TM of\ndegree (1, 2) is asso iated with the tangent lift dT Λ of Λ by H(1,2) = ιdT Λ , i.e.\nH(1,2) =\n\nX\n\nΛab (x)pa ṗb +\n\n1 X ∂Λab\n(x)ẋc ṗb ṗa .\n2\n∂xc\na,b,c\n\na,b\n\nTake now a Lie group a tion G × M → M whi h is free and proper, so that the spa e of orbits M/G\nis a manifold, and whi h preserves Λ, so that Λ proje ts onto a Poisson stru ture Λ′ on M/G. Let\n23\n\n\fP\n(y s ) be a basis in the Lie algebra G of G and let Y s = a fas (x)∂xa be the orresponding fundamental\nve tor \u001celds of this a tion. Preserving Λ by the a tion means that the S houten bra kets [Y s , Λ]\nvanish. By means of the tangent fun tor, the a tion of G an be extended to an a tion of the group\nTG on TM . The Lie algebra of TG is TG and the fundamental ve tor \u001celds of this a tion are the\ntangent and verti al lifts, dT Y s and vT Y s , of the fundamental ve tor \u001celds of the a tion of G ( f.\n[12℄). Sin e dT respe ts the S houten bra ket and [vT Y, dT Λ] = vT [Y, Λ] (see [12℄), the extended a tion\npreserves dT Λ. Moreover, it is easy to see that TM/TG ≃ T(M/G) and that the anoni al proje tion\nTM → TM/TG ≃ T(M/G) is a Poisson map of dT Λ onto dT (Λ′ ).\nConsider now the phase prolongation of the TG a tion, TG × T∗ TM → T∗ TM . It is a Hamiltonian\na tion with a anoni al equivariant moment map μ : T∗ TM → (TG)∗ . The Hamiltonians asso iated\nwith dT Y s and vT Y s are, respe tively, ιdT Y s and ιvT Y s so that the submanifold N0 onsisting of ommon\nzeros of all fun tions ιdT Y s and ιvT Y s , is a oisotropi submanifold of T∗ TM . Sin e these fun tions\nare linear, it is a ve tor subbundle of T∗ TM → TM . But T∗ TM is anoni ally a symple ti double\nve tor bundle with the other proje tion onto T∗ M and N0 is a ve tor subbundle also with respe t to\nthe other bundle stru ture. This is be ause the tangent lifts of ve tor \u001celds are linear and the verti al\nlifts are homogeneous of degree -1, so d∗T ∆TM (ιdT Y s ) = 0 and d∗T ∆TM (ιvT Y s ) = −ιvT Y s , thus the\norresponding homotheties do not leave N0 . The manifold N0 has therefore its graded ounterpart N0\nbeing a bigraded oisotropi submanifold of T∗ TM . The hara teristi distribution on N0 is spanned\nby the (super) ve tor \u001celds d∗T dT Y s and d∗T vT Y s . They preserve the Hamiltonian H = H(2,1) + H(1,2)\nasso iated with the Lie bialgebroid stru ture (DM , DΛ ) and the Hamiltonian redu tion leads to the\nbi-graded symple ti manifold T∗ T(M/G) with the redu ed homologi al hamiltonian H ′ asso iated\nwith the Lie bialgebroid stru ture (DM/G , DΛ′ ).\nWe an go further to the iterated tangent bundle TTM whi h is a double ve tor bundle with respe t\nto proje tions τTM and TτM onto T M . It is also anoni ally a double Lie algebroid orresponding to\nthe homologi al ve tor \u001celd q = DTM + dT (DM ) on TTM whi h in lo al oordinates (x, ẋ, x̄, ẍ) takes\nthe form\nX\nX\nq=\n(x̄a ∂xa + ẍa ∂ẋa ) +\n(ẋa ∂xa + ẍa ∂x̄a ) .\na\n\na\n\nIt orresponds to the linear fun tion ιq on T TTM whi h in the adapted lo al oordinates (x, ẋ, x̄, ẍ, p, ṗ, p̄, p̈)\nof degrees, respe tively,\n∗\n\n(0, 0, 0), (1, 0, 0), (0, 1, 0), (1, 1, 0), (1, 1, 1), (0, 1, 1), (1, 0, 1), (0, 0, 1),\n\nreads\nιq = H(1,2,1) + H(2,1,1) =\n\nX\n\n(x̄a pa + ẍa ṗa ) +\n\na\n\nX\n\n(ẋa pa + ẍa p̄a ) .\n\na\n\nA homologi al Hamiltonian H(1,1,2) of degree (1, 1, 2) an be obtained from the iterated tangent lift\ndT dT Λ whi h is linear with respe t to both ve tor bundle stru tures:\n\u0013\nX\nX \u0012 ∂Λab\n∂Λab\nc\nc\nH(2,1,1) =\nΛab (x) (p̈b pa + ṗb p̄a ) +\n(x)ẋ ṗa p̈b +\n(x)x̄ p̄a p̈b +\n∂xc\n∂xc\na,b\na,b,c\n!\nX ∂ 2 Λab\nX 1 ∂Λab\n(x)ẍc +\n(x)x̄d ẋc p̈b p̈a .\n2 ∂xc\n∂xc ∂xd\na,b,c\n\nd\n\nIt learly ommutes with ιq , so H = H(2,1,1) + H(1,2,1) + H(1,1,2) represents a Drinfeld triple.\nThe orresponding double Lie algebroid stru tures on the side bundles are: (TTM, DTM + dT DM ),\n(TT∗ M, dT DΛ + DT∗ M ), and (T∗ TM, d∗T DM + DdT DΛ ).\nExtending the tangent lift a tion G× TM → TM to the iterated tangent lift a tion TTG× TTM →\nTTM and taking its phase prolongation TTG×T∗TTM → T∗ TTM (whi h is anoni ally Hamiltonian),\nwe get a momentum map μ1 : T∗ TTM → (TTG)∗ and the orresponding oisotropi submanifold\nN1 = μ−1\n1 ({0}). This submanifold is 3-homogeneous with respe t to the triple ve tor bundle stru ture\non T∗ TTM ≃ T∗ T∗ TM ≃ T∗ TT∗ M , so it has its graded ounterpart N1 in the 3-graded symple ti\nmanifold T∗ TTM ≃ T∗ T∗ TM ≃ T∗ TT∗ M . Like above, the homologi al Hamiltonian H is onstant on\nthe hara teristi distribution of the oisotropi manifold N1 and we get a redu tion to the 3-graded\n24\n\n\fsymple ti manifold T∗ TT(M/G) with the redu ed homologi al hamiltonian H ′ asso iated with the\nthree homologi al ve tor \u001celds dT dT DΛ′ , DT(M/G) , and dT DM/G on TT(M/G).\n\n10 A knowledgments\nThe authors wish to thank F. Przyty ki for helpful dis ussions on dynami al systems.\n\nReferen es\n[1℄ M. Alexandrov, M. Kontsevi h, A. S hwarz, and O. Zaboronsky: The geometry of the Master\nequation and topologi al quantum \u001celd theory, Int. J. Modern Phys. A 12(7) (1997), 1405\u00151429.\n[2℄ R. Brown and K. C. Ma kenzie: Determination of a double groupoid by its ore diagram, J. Pure\nAppl. Algebra 80 (1992), no. 3, 237\u0015272.\n[3℄ A. Coste, P. Dazord, and A. Weinstein: Groupoïdes symple tiques, In Publi ations du Département de Mathématiques de l'Université de Lyon, I, number 2/A-1987 (1987), 1\u001565.\n[4℄ T. J. Courant: Dira manifolds, Trans. Amer. Math. So . 319 (1990), 631\u0015661.\n[5℄ I. Ya. Dorfman: Dira stru tures of integrable evolution equations, Phys. Lett. A 125 (1987),\n240\u0015246.\n[6℄ V. I. Drinfeld: Hamiltonian stru tures on Lie groups, Lie bialgebras, and the geometri meaning\nof Yang-Baxter equations, Dokl. Akad. Nauk SSSR 268 (1983), 285\u0015287.\n[7℄ J.-P. Dufour: Introdu tion aux tissus, Séminaire GETODIM, (1991), 55\u001576 (preprint).\n[8℄ K. Grabowska, J. Grabowski and P. Urba«ski: Geometri al Me hani s on algebroids, Int. J.\nGeom. Meth. Mod. Phys. 3 (2006), 559-575.\n[9℄ K. Grabowska, J. Grabowski and P. Urba«ski: AV-di\u001berential geometry: Euler-Lagrange equations, J. Geom. Phys. 57 (2007), 1984\u00151998.\n[10℄ J. Grabowski and G. Marmo: Ja obi stru tures revisited, J. Phys. A: Math. Gen. 34 (2001),\n10975\u001510990.\n[11℄ J. Grabowski and G. Marmo: The graded Ja obi algebras and ( o)homology, J. Phys. A: Math.\nGen. 36 (2003), 161\u0015181.\n[12℄ J. Grabowski, P. Urba«ski: Tangent lifts of Poisson and related stru tures, J. Phys. A: Math.\nGen., 28 (1995), 6743\u00156777.\n[13℄ J. Grabowski and P. Urba«ski: Tangent and otangent lifts and graded Lie algebras asso iated\nwith Lie algebroids, Ann. Global Anal. Geom. 15 (1997), 447-486.\n[14℄ J. Grabowski and P. Urba«ski: Algebroids \u0015 general di\u001berential al uli on ve tor bundles, J.\nGeom. Phys. 31 (1999), 111\u0015141.\n[15℄ K. Konie zna and P. Urba«ski: Double ve tor bundles and duality, Ar h. Math. (Brno) 35, (1999),\n59\u001595.\n[16℄ Y. Kosmann-S hwarzba h: Ja obian quasi-bialgebras and quasi-Poisson Lie groups, In Mathemati al aspe ts of lassi al \u001celd theory, Contemp. Math. 132 (1992), pp. 459\u0015489.\n[17℄ Y. Kosmann-S hwarzba h: Quasi, twisted, and all that. . .in Poisson geometry and Lie algebroid\ntheory. In The breadth of symple ti and Poisson geometry, Fests hrift in Honor of Alan Weinstein,\nProgr. Math. 232, Birkhäuser Boston, Boston, MA, 2005, pp. 363\u0015389.\n[18℄ Zhang-Ju Liu, A. Weinstein, and Ping Xu: Manin triples for Lie bialgebroids, J. Di\u001b. Geom. 45\n(1997), 547\u0015574.\n[19℄ K. C. H. Ma kenzie: Double Lie algebroids and se ond-order geometry. I, Adv. Math. 94(2)\n(1992), 180\u0015239.\n[20℄ K. C. H. Ma kenzie: Double Lie algebroids and se ond-order geometry. II, Adv. Math. 154(1)\n(2000), 46\u001575.\n[21℄ K. C. H. Ma kenzie: Double Lie algebroids and the double of a Lie bialgebroid,\narXiv:math.DG/9808081.\n25\n\n\f[22℄ K. C. H. Ma kenzie: Double Lie algebroids, Lie bialgebroids and mat hed pairs, Preprint, 1998.\n[23℄ K. C. H. Ma kenzie: Drinfel'd doubles and Ehresmann doubles for Lie algebroids and Lie bialgebroids, Ele tron. Res. Announ . Amer. Math. So . (ele troni ) 4 (1998), 74\u001587.\n[24℄ K. C. H. Ma kenzie: On symple ti double groupoids and the duality of Poisson groupoids,\nInternat. J. Math. 10 (1999), 435\u0015456.\n[25℄ K. C. H. Ma kenzie: On ertain anoni al di\u001beomorphisms in symple ti and Poisson geometry,\nIn Quantization, Poisson bra kets and beyond (Man hester, 2001), volume 315 of Contemp. Math.\n315, Amer. Math. So ., Providen e, RI, 2002, pp. 187\u0015198.\n[26℄ K. C. H. Ma kenzie: Duality and triple stru tures, In The breadth of symple ti and Poisson\ngeometry, Fests hrift in Honor of Alan Weinstein, Progr. Math. 232, Birkhäuser Boston, Boston,\nMA, 2005, pp. 455\u0015481.\n[27℄ K. C. H. Ma kenzie: General theory of Lie groupoids and Lie algebroids, Cambridge University\nPress, 2005.\n[28℄ K. C. H. Ma kenzie and P. Xu: Lie bialgebroids and Poisson groupoids, Duke Math. J. 73(2)\n(1994), 415\u0015452.\n[29℄ R. A.Mehta: Supergroupods, double stru tures, and equivariant ohomology, PhD thesis (2006),\nUniversity of California, Berkeley, arXiv:math.DG/0605356.\n[30℄ J. Pradines: Fibrés ve toriels doubles et al ul des jets non holonomes (Fren h), Notes poly opiées,\nAmiens, 1974.\n[31℄ J. Pradines: Représentation des jets non holonomes par des morphismes ve toriels doubles soudés\n(Fren h), C. R. A ad. S i. Paris Sér. A 278 (1974), 1523\u00151526.\n[32℄ J. Pradines: Suites exa tes ve torielles doubles et onnexions (Fren h), C. R. A ad. S i. Paris\nSér. A 278 (1974), 1587\u00151590.\n[33℄ D. Roytenberg: Courant algebroids, derived bra kets and even symple ti supermanifolds, PhD\nthesis, UC Berkeley, 1999, arXiv:math.DG/9910078.\n[34℄ D. Roytenberg: On the stru ture of graded symple ti supermanifolds and Courant algebroids,\nIn Quantization, Poisson bra kets and beyond (Man hester, 2001),Contemp. Math. 315, Amer.\nMath. So ., Providen e, RI, 2002, pp. 169\u0015185.\n[35℄ D. Roytenberg: AKSZ-BV Formalism and Courant Algebroid-indu ed Topologi al Field Theories,\nLett. Math. Phys. 79 (2007), 143\u0015159.\n[36℄ P. \u0092evera: Some title ontaining the words \"homotopy\" and \"symple ti \", e.g. this one, Travaux\nmathématiques, Univ. Luxemb., 16 (2005), 121\u0015137.\n[37℄ W. M. Tul zyjew: The Legendre transformation, Ann. Inst. Henri Poin ar/'e 27 (1977), 101\u0015114.\n[38℄ W.M. Tul zyjew and P. Urba«ski: A slow and areful Legendre transformation for singular Lagrangians, The Infeld Centennial Meeting (Warsaw, 1998), A ta Phys. Polon. B 30, (1999), 2909\u0015\n2978.\n[39℄ A. Yu. Va\b\u0019ntrob: Lie algebroids and homologi al ve tor \u001celds, Uspekhi Matem. Nauk 52(2) (1997),\n428\u0015429.\n[40℄ T. T. Voronov, Graded manifolds and Drienfeld doubles for Lie bialgebroids, In Quantization,\nPoisson bra kets and beyond (Man hester, 2001), Contemp. Math. 315, Amer. Math. So ., Providen e, RI, 2002, pp. 131-168.\n[41℄ T. T. Voronov, Ma kenzie theory and Q-manifolds, arXiv:math.DG/0608111 .\n[42℄ A. Weinstein: Symple ti groupoids and Poisson manifolds, Bull. Amer. Math. So . (N.S.) 16\n(1987), 101\u0015104.\n[43℄ A. Weinstein: Coisotropi al ulus and Poisson groupoids, J. Math. So . Japan 40 (1988), 705\u0015\n727.\n[44℄ K. Yano and S. Ishihara, Tangent and Cotangent Bundles, Mar el Dekker, In ., New York 1973.\n\n26\n\n\fJanusz Grabowski\nInstitute of Mathemati s, Polish A ademy of S ien es\n\u0091niade ki h 8, P.O. Box 21, 00-956 Warszawa, Poland\njagrab\bimpan.gov.pl\nMikoaaj Rotkiewi z\nInstitute of Mathemati s, University of Warsaw\nBana ha 2, 02-097 Warszawa, Poland\nmrotkiew\bmimuw.edu.pl\n\n27\n\n\f"}