{"id": "http://arxiv.org/abs/math/0611799v2", "guidislink": true, "updated": "2006-12-22T22:33:40Z", "updated_parsed": [2006, 12, 22, 22, 33, 40, 4, 356, 0], "published": "2006-11-26T21:25:22Z", "published_parsed": [2006, 11, 26, 21, 25, 22, 6, 330, 0], "title": "Ehresmann doubles and Drinfel'd doubles for Lie algebroids and Lie\n  bialgebroids", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=math%2F0611510%2Cmath%2F0611444%2Cmath%2F0611403%2Cmath%2F0611746%2Cmath%2F0611185%2Cmath%2F0611343%2Cmath%2F0611797%2Cmath%2F0611647%2Cmath%2F0611315%2Cmath%2F0611570%2Cmath%2F0611656%2Cmath%2F0611278%2Cmath%2F0611002%2Cmath%2F0611440%2Cmath%2F0611227%2Cmath%2F0611410%2Cmath%2F0611200%2Cmath%2F0611588%2Cmath%2F0611801%2Cmath%2F0611232%2Cmath%2F0611398%2Cmath%2F0611555%2Cmath%2F0611322%2Cmath%2F0611782%2Cmath%2F0611878%2Cmath%2F0611032%2Cmath%2F0611328%2Cmath%2F0611812%2Cmath%2F0611851%2Cmath%2F0611897%2Cmath%2F0611679%2Cmath%2F0611845%2Cmath%2F0611802%2Cmath%2F0611461%2Cmath%2F0611694%2Cmath%2F0611580%2Cmath%2F0611486%2Cmath%2F0611944%2Cmath%2F0611158%2Cmath%2F0611225%2Cmath%2F0611162%2Cmath%2F0611865%2Cmath%2F0611568%2Cmath%2F0611329%2Cmath%2F0611817%2Cmath%2F0611753%2Cmath%2F0611799%2Cmath%2F0611095%2Cmath%2F0611600%2Cmath%2F0611751%2Cmath%2F0611589%2Cmath%2F0611692%2Cmath%2F0611930%2Cmath%2F0611515%2Cmath%2F0611796%2Cmath%2F0611100%2Cmath%2F0611434%2Cmath%2F0611380%2Cmath%2F0611738%2Cmath%2F0611769%2Cmath%2F0611147%2Cmath%2F0611785%2Cmath%2F0611274%2Cmath%2F0611804%2Cmath%2F0611735%2Cmath%2F0611098%2Cmath%2F0611672%2Cmath%2F0611050%2Cmath%2F0611196%2Cmath%2F0611150%2Cmath%2F0611723%2Cmath%2F0611946%2Cmath%2F0611325%2Cmath%2F0611831%2Cmath%2F0611298%2Cmath%2F0611850%2Cmath%2F0611226%2Cmath%2F0611691%2Cmath%2F0611921%2Cmath%2F0611184%2Cmath%2F0611498%2Cmath%2F0611736%2Cmath%2F0611774%2Cmath%2F0611887%2Cmath%2F0611015%2Cmath%2F0611849%2Cmath%2F0611236%2Cmath%2F0611356%2Cmath%2F0611348%2Cmath%2F0611771%2Cmath%2F0611701%2Cmath%2F0611346%2Cmath%2F0611275%2Cmath%2F0611119%2Cmath%2F0611542%2Cmath%2F0611462%2Cmath%2F0611342%2Cmath%2F0611733%2Cmath%2F0611682%2Cmath%2F0611113%2Cmath%2F0611129&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Ehresmann doubles and Drinfel'd doubles for Lie algebroids and Lie\n  bialgebroids"}, "summary": "The word `double' was used by Ehresmann to mean `an object X in the category\nof all X'. Double categories, double groupoids and double vector bundles are\ninstances, but the notion of Lie algebroid cannot readily be doubled in the\nEhresmann sense, since a Lie algebroid bracket cannot be defined\ndiagrammatically. In this paper we use the duality of double vector bundles to\ndefine a notion of double Lie algebroid, and we show that this abstracts the\ninfinitesimal structure (at second order) of a double Lie groupoid.\n  We further show that the cotangent of either Lie algebroid in a Lie\nbialgebroid has a double Lie algebroid structure, and that a pair of Lie\nalgebroid structures on dual vector bundles forms a Lie bialgebroid if and only\nif the structures which they canonically induce on their cotangents form a\ndouble Lie algebroid. In particular, the Drinfel'd double of a Lie bialgebra\nhas a double Lie algebroid structure.\n  We also show that matched pairs of Lie algebroids, as used by J.-H. Lu in the\nclassification of Poisson group actions, are in bijective correspondence with\nvacant double Lie algebroids.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=math%2F0611510%2Cmath%2F0611444%2Cmath%2F0611403%2Cmath%2F0611746%2Cmath%2F0611185%2Cmath%2F0611343%2Cmath%2F0611797%2Cmath%2F0611647%2Cmath%2F0611315%2Cmath%2F0611570%2Cmath%2F0611656%2Cmath%2F0611278%2Cmath%2F0611002%2Cmath%2F0611440%2Cmath%2F0611227%2Cmath%2F0611410%2Cmath%2F0611200%2Cmath%2F0611588%2Cmath%2F0611801%2Cmath%2F0611232%2Cmath%2F0611398%2Cmath%2F0611555%2Cmath%2F0611322%2Cmath%2F0611782%2Cmath%2F0611878%2Cmath%2F0611032%2Cmath%2F0611328%2Cmath%2F0611812%2Cmath%2F0611851%2Cmath%2F0611897%2Cmath%2F0611679%2Cmath%2F0611845%2Cmath%2F0611802%2Cmath%2F0611461%2Cmath%2F0611694%2Cmath%2F0611580%2Cmath%2F0611486%2Cmath%2F0611944%2Cmath%2F0611158%2Cmath%2F0611225%2Cmath%2F0611162%2Cmath%2F0611865%2Cmath%2F0611568%2Cmath%2F0611329%2Cmath%2F0611817%2Cmath%2F0611753%2Cmath%2F0611799%2Cmath%2F0611095%2Cmath%2F0611600%2Cmath%2F0611751%2Cmath%2F0611589%2Cmath%2F0611692%2Cmath%2F0611930%2Cmath%2F0611515%2Cmath%2F0611796%2Cmath%2F0611100%2Cmath%2F0611434%2Cmath%2F0611380%2Cmath%2F0611738%2Cmath%2F0611769%2Cmath%2F0611147%2Cmath%2F0611785%2Cmath%2F0611274%2Cmath%2F0611804%2Cmath%2F0611735%2Cmath%2F0611098%2Cmath%2F0611672%2Cmath%2F0611050%2Cmath%2F0611196%2Cmath%2F0611150%2Cmath%2F0611723%2Cmath%2F0611946%2Cmath%2F0611325%2Cmath%2F0611831%2Cmath%2F0611298%2Cmath%2F0611850%2Cmath%2F0611226%2Cmath%2F0611691%2Cmath%2F0611921%2Cmath%2F0611184%2Cmath%2F0611498%2Cmath%2F0611736%2Cmath%2F0611774%2Cmath%2F0611887%2Cmath%2F0611015%2Cmath%2F0611849%2Cmath%2F0611236%2Cmath%2F0611356%2Cmath%2F0611348%2Cmath%2F0611771%2Cmath%2F0611701%2Cmath%2F0611346%2Cmath%2F0611275%2Cmath%2F0611119%2Cmath%2F0611542%2Cmath%2F0611462%2Cmath%2F0611342%2Cmath%2F0611733%2Cmath%2F0611682%2Cmath%2F0611113%2Cmath%2F0611129&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The word `double' was used by Ehresmann to mean `an object X in the category\nof all X'. Double categories, double groupoids and double vector bundles are\ninstances, but the notion of Lie algebroid cannot readily be doubled in the\nEhresmann sense, since a Lie algebroid bracket cannot be defined\ndiagrammatically. In this paper we use the duality of double vector bundles to\ndefine a notion of double Lie algebroid, and we show that this abstracts the\ninfinitesimal structure (at second order) of a double Lie groupoid.\n  We further show that the cotangent of either Lie algebroid in a Lie\nbialgebroid has a double Lie algebroid structure, and that a pair of Lie\nalgebroid structures on dual vector bundles forms a Lie bialgebroid if and only\nif the structures which they canonically induce on their cotangents form a\ndouble Lie algebroid. In particular, the Drinfel'd double of a Lie bialgebra\nhas a double Lie algebroid structure.\n  We also show that matched pairs of Lie algebroids, as used by J.-H. Lu in the\nclassification of Poisson group actions, are in bijective correspondence with\nvacant double Lie algebroids."}, "authors": ["K. C. H. Mackenzie"], "author_detail": {"name": "K. C. H. Mackenzie"}, "author": "K. C. H. Mackenzie", "arxiv_comment": "Reference added. Some rewording in introduction. 34 pages. Uses\n  Xy-pic", "links": [{"href": "http://arxiv.org/abs/math/0611799v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/math/0611799v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.DG", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.DG", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.CT", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.SG", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "Primary 53D17. Secondary 17B62, 17B66, 18D05, 22A22, 58H05", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/math/0611799v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/math/0611799v2", "journal_reference": null, "doi": null, "fulltext": "arXiv:math/0611799v2 [math.DG] 22 Dec 2006\n\nEhresmann doubles and Drinfel'd doubles\nfor Lie algebroids and Lie bialgebroids\n\n∗\n\nK. C. H. Ma kenzie\nDepartment of Pure Mathemati s\nUniversity of She\u001eeld\nShe\u001eeld, S3 7RH\nUnited Kingdom\nK.Ma kenzie\bshe\u001eeld.a .uk\nDe ember 18, 2006\nAbstra t\nThe word `double' was used by Ehresmann to mean `an obje t X in the ategory of\nall X '. Double ategories, double groupoids and double ve tor bundles are instan es, but\nthe notion of Lie algebroid annot readily be doubled in the Ehresmann sense, sin e a Lie\nalgebroid bra ket annot be de\u001cned diagrammati ally. In this paper we use the duality\nof double ve tor bundles to de\u001cne a notion of double Lie algebroid, and we show that this\nabstra ts the in\u001cnitesimal stru ture (at se ond order) of a double Lie groupoid.\nWe further show that the otangent of either Lie algebroid in a Lie bialgebroid has a\ndouble Lie algebroid stru ture, and that a pair of Lie algebroid stru tures on dual ve tor\nbundles forms a Lie bialgebroid if and only if the stru tures whi h they anoni ally indu e\non their otangents form a double Lie algebroid. In parti ular, the Drinfel'd double of a\nLie bialgebra has a double Lie algebroid stru ture.\nWe also show that mat hed pairs of Lie algebroids, as used by J.\u0015H. Lu in the lassi\u001c ation of Poisson group a tions, are in bije tive orresponden e with va ant double Lie\nalgebroids.\n\n∗\n\n2000\n\nMathemati s Subje t Classi\u001c ation.\n\nPrimary 53D17. Se ondary 17B62, 17B66, 18D05, 22A22, 58H05.\n\n1\n\n\fK. C. H. Ma kenzie\n\nINTRODUCTION\nThe word `double' has two distin t usages. In [4℄ Drinfel'd introdu ed the lassi al double of a\nLie bialgebra (g, g∗ ), whi h ombines g and g∗ into a single Lie algebra g ⊲⊳ g∗ whi h en odes\nfully the relations between g and g∗ . (We do not onsider quantum doubles in this paper.)\nIn ategori al language the word `double' des ribes an obje t of type X in the ategory\nof all obje ts X . Thus a `double ve tor bundle' is a ve tor bundle D → A in whi h both\nthe total spa e and base spa e are obje ts in the ategory of ve tor bundles, say D → B and\nA → M ; the maps de\u001cning the stru ture of D → A must be morphisms in the ategory of\nve tor bundles. (More detail is given below and in \u009f1.) The notion of a double ategory, the\nfundamental prototype of this on ept of double, was introdu ed and developed by Ehresmann\n[6℄. Double ategories should be distinguished from the more re ent notions of 2\u0015 ategory and\nbi ategory.\nWe show in this paper that the Drinfel'd double of a Lie bialgebra may be regarded as a\ndouble in the Ehresmann sense. Further, we show that the otangent of (either bundle in) a\nLie bialgebroid is a double in the Ehresmann sense, and that this onstru tion redu es to the\nDrinfel'd double when the Lie bialgebroid is a Lie bialgebra.\nThe ru ial step is to de\u001cne a on ept of double in the Ehresmann sense for Lie algebroids.\nThe de\u001cnition annot be pre isely of the type des ribed above sin e the bra ket of a Lie\nalgebroid is not a map in the ategory of ve tor bundles. We use an indire t approa h\n(De\u001cnition 3.1) and show, in \u009f6, that this is an in\u001cnitesimal form of doubles of Ehresmann\ntype.\nA double Lie algebroid is \u001crst of all a double ve tor bundle as in Figure 1(a); that is, D\n\nD\n\n/B\n\nTA\n\n/ TM\n\nT ∗A\n\n/ A∗\n\n\u000f\n\n\u000f\n/M\n\nA\n\n\u000f\n\n\u000f\n/M\n\nA\n\n\u000f\n\n\u000f\n/M\n\nA\n(a)\n\n(b)\n\n( )\n\nFigure 1.\nhas two ve tor bundle stru tures, on bases A and B , ea h of whi h is itself a ve tor bundle on\nbase M , su h that for ea h stru ture on D , the stru ture maps (proje tion, addition, s alar\nmultipli ation) are ve tor bundle morphisms with respe t to the other stru ture, and the\nombination of the two proje tions, D → A ×M B , is a surje tive submersion (see \u009f1 for more\ndetail). Two examples to keep in mind are the tangent prolongation of an ordinary ve tor\nbundle as in Figure 1(b) (see [1℄ for a lassi al treatment), and the otangent double ve tor\nbundle as in Figure 1( ) (see [26℄).\nNow suppose that all four sides of Figure 1(a) have Lie algebroid stru tures. The problem is\nto de\u001cne ompatibility between the bra ket stru tures on D , bearing in mind that the bra kets\nare on di\u001berent modules of se tions. The key is the duality for double ve tor bundles des ribed\nin \u009f1. Although our ompatibility ondition annot (as far as we know) be interpreted as a\nondition of the form `either bra ket stru ture on (se tions of) D is a morphism with respe t\n2\n\n\fEhresmann doubles and Drinfel'd doubles\n\nto the other', we show in Theorem 6.2 that this on ept of double Lie algebroid in ludes the\nin\u001cnitesimal invariants of double Lie groupoids, whi h are de\u001cned by su h onditions. We\ntherefore feel justi\u001ced in referring to it as a double of Ehresmannian type, or a ategori al\ndouble.\nIn \u009f4 we de\u001cne a notion of double for Lie bialgebroids. A Lie bialgebroid (A, A∗ ) on\nbase M [26℄ onsists of Lie algebroid stru tures on a ve tor bundle and its dual, subje t to a\nompatibility ondition whi h an be most su in tly expressed by saying that the di\u001berential\nof ea h Lie algebroid a ts as a derivation on the S houten (or Gerstenhaber) algebra asso iated\nwith the other [9℄.\nGiven a Lie bialgebroid (A, A∗ ), the Lie algebroid stru ture on A indu es a Poisson stru ture on A∗ by an extension [3℄ of the duality between Lie algebras and linear Poisson stru tures on ve tor spa es. This Poisson stru ture in turn indu es a Lie algebroid stru ture on\nT ∗ A∗ → A∗ , de\u001cned in terms of the Poisson bra ket of 1\u0015forms. Likewise, the Lie algebroid\nstru ture on A∗ indu es a Lie algebroid stru ture on T ∗ A → A. Using the anoni al di\u001beomorphism T ∗ A∗ → T ∗ A [26℄ we now have Lie algebroid stru tures on ea h of the four sides of\nFigure 1( ). This is a double Lie algebroid as de\u001cned in \u009f3, the otangent double of (A, A∗ ).\nSuppose now that we have Lie algebroid stru tures on A and A∗ with no further assumption. As above, the Poisson stru tures on A∗ and A indu e Lie algebroid stru tures on\nT ∗ A∗ → A∗ and T ∗ A → A and we prove in \u009f4 that if these onstitute a double Lie algebroid\nstru ture on T ∗ A, then (A, A∗ ) is a Lie bialgebroid.\nWhen M is a point, so that A = g and A∗ are Lie algebras, the otangent manifold T ∗ g\nis g × g∗ . The Lie algebroid stru ture on g × g∗ → g is the a tion, or transformation, Lie\nalgebroid de\u001cned by the oadjoint a tion of g∗ on g; likewise the oadjoint a tion of g on g∗\nde\u001cnes the Lie algebroid stru ture on g × g∗ → g∗ . These stru tures have not been mu h used,\nsin e g × g∗ has the lassi al Drinfel'd double stru ture g ⊲⊳ g∗ , as a Lie algebra.\nFor an arbitrary Lie bialgebroid (A, A∗ ) there is no known Lie algebroid stru ture on\nT ∗ A → M (and indeed there is no natural ve tor bundle stru ture) whi h redu es to g ⊲⊳ g∗\nin the bialgebra ase. Consequently there is no dire t analogue for T ∗ A of the Manin triple\ntheorem (as in [14℄) whi h, for a pair of Lie algebra stru tures on dual ve tor spa es, gives a\nriterion for them to form a Lie bialgebra. Nonetheless Theorem 4.1 provides a riterion for\na pair of Lie algebroid stru tures on dual ve tor bundles to form a Lie bialgebroid.\nA Manin triple theorem for Lie bialgebroids whi h dire tly generalizes the Lie bialgebra\nresult, was given by Liu, Weinstein, and Xu [11℄, whose notion of double is a Courant algebroid\nstru ture on the dire t sum A ⊕ A∗ . Some omments on the di\u001beren es between the two\napproa hes are given at the end of \u009f4.\nThe la k of a stru ture on T ∗ A → M is an inherent feature of the otangent. A otangent\ndouble ve tor bundle T ∗ A is lo ally isomorphi to A ×M A∗ ×M T ∗ M and is of the form\nA ×M A∗ if and only if M is 0\u0015dimensional.\nWe all a double Lie algebroid (D; A, B; M ) va ant if D is isomorphi to A ×M B as a\ndouble ve tor bundle. We prove in \u009f5 that in this ase there are indu ed a tions ρ of A on B\nand σ of B on A, and these satisfy the equations\n\nρX ([Y1 , Y2 ]) = [ρX (Y1 ), Y2 ] + [Y1 , ρX (Y2 )] + ρσY2 (X) (Y1 ) − ρσY1 (X) (Y2 ),\nσY ([X1 , X2 ]) = [σY (X1 ), X2 ] + [X1 , σY (X2 )] + σρX2 (Y ) (X1 ) − σρX1 (Y ) (X2 ),\na(σY (X)) − b(ρX (Y )) = [b(Y ), a(X)],\n3\n\n(1)\n\n\fK. C. H. Ma kenzie\n\nfor X1 , X2 , X ∈ ΓA, Y1 , Y2 , Y ∈ ΓB , where a and b are the an hors. Conversely, given su h\na pair of a tions, A ×M B has a double Lie algebroid stru ture.\nA pair of a tions satisfying (1) is alled a mat hed pair stru ture for A and B [31℄. This notion of mat hed pair extends the on ept introdu ed into geometry by Kosmann\u0015S hwarzba h\nand Magri [10℄ under the name extension bi roisée or twilled extension, by Lu and Weinstein\n[14℄ as a double Lie algebra, and by Majid [28℄, with the term mat hed pair whi h we use. (In\nfa t, forms of the on ept had been found mu h earlier; see [37℄, [2℄ for referen es.) As in the\nase of Lie algebras, given a mat hed pair stru ture for Lie algebroids A and B , the dire t\nsum bundle A ⊕ B has a Lie algebroid stru ture A ⊲⊳ B for whi h A ⊕ 0 and 0 ⊕ B are Lie\nsubalgebroids, and the onverse is also true [31℄.\nWe note here that Lu [12℄ showed that any Poisson a tion of a Poisson Lie group G on\na Poisson manifold P gives rise to a mat hed pair of Lie algebroids, and the orresponding\ndiagonal stru ture T ∗ P ⊲⊳ (P × g∗ ) arries Drinfel'd's lassi\u001c ation of Poisson homogeneous\nspa es [5℄. In a future paper we will show that the orresponding onstru tion for an a tion\nof a general Poisson groupoid gives rise to a double Lie algebroid whi h is not va ant, and so\ndoes not orrespond to a mat hed pair.\n\n*\n\n*\n\n*\n\n*\n\n*\n\nThere are two further points to be made about the on ept of double Lie algebroid. Firstly,\na natural global analogue is provided by the on ept of double Lie groupoid [16℄: we show in\n\u009f6 that applying a se ond\u0015order version of the Lie fun tor to a double Lie groupoid yields a\ndouble Lie algebroid. This subsumes various known di\u001berentiation results and raises a general\nintegrability problem.\nIt is well known that Lie bialgebroids are the in\u001cnitesimal form of Poisson groupoids [36℄,\n[27℄. In the ase of Lie bialgebras a further step was a hieved by Lu and Weinstein [13℄ who\nproved the existen e of a symple ti double Lie groupoid integrating a Poisson Lie group.\nThe double Lie algebroid of this symple ti double Lie groupoid is the otangent double Lie\nalgebroid des ribed above.\nFor mat hed pairs of Lie algebras the global on ept of mat hed pair of Lie groups was\nintrodu ed into geometry at the same time [28℄, [14℄. The global on ept of a mat hed pair\nof Lie groupoids was given in [16℄. In the Lie algebra ase, various integrability results were\ngiven in the same papers, but little is known about the integrability of mat hed pairs of Lie\nalgebroids [24℄. As [13℄ shows, a mat hed pair of Lie algebras may fail to integrate to a\nmat hed pair of Lie groups, but nonetheless integrate to a double Lie groupoid.\nThe se ond point to be made is that the on ept of double Lie algebroid o\u001bers, at least\nin some situations, a means of bypassing the problems aused by the la k of pullba ks in\nthe Poisson ategory. It is well\u0015known that the a tion groupoid arising from the a tion of a\nPoisson Lie group G on a Poisson manifold P is not a Poisson groupoid. It was shown in [22℄\nthat the indu ed a tion of T ∗ G ⇒ g∗ on the dual p : T ∗ P → g∗ of the in\u001cnitesimal a tion,\nalled the pith in [22℄, gives rise to a groupoid obje t in the ategory of Lie algebroids whi h\ndi\u001berentiates to Lu's mat hed pair of Lie algebroids. In the group ase one may work dire tly\nwith the mat hed pair but, as mentioned above, for a Poisson a tion of a Poisson groupoid,\nthe orresponding stru ture is a double Lie algebroid whi h does not redu e to a mat hed\npair.\nSin e the mid 1990s several authors have worked to provide a hara terization of the\notangent double of a Lie bialgebroid in terms of super geometry [34℄, [33℄. This has now\n4\n\n\fEhresmann doubles and Drinfel'd doubles\n\nbeen a hieved by Ted Voronov [35℄ who further gives a formulation of the general on ept of\ndouble Lie algebroid presented here in terms of super geometry. Independently, Mehta [30℄\nhas found a super formulation of the related notion of L A \u0015groupoid.\nOn a spe ulative level, one may ask what relation, if any, exists between this theory and\nthe weak multiple ategory theory that is used in some approa hes to \u001celd theory. The di\u001beren es between double Lie groupoid theory [16℄, [20℄ and the various notions of weak 2\u0015 ategory\nor bi ategory, are very onsiderable and it may be that there is no simple relationship. The\nexpe tation that a link may exist is perhaps based on the fa t that the notion of ordinary\nLie groupoid in ludes both the frame groupoids of di\u001berential geometry and the fundamental\ngroupoid of a manifold, and thus has both a di\u001berential geometri and a topologi al signi\u001c an e. However, this may be misleading as regards multiple stru tures: the homotopy\nproperties of double Lie groupoids present onsiderable problems, and the notion of weak\n2\u0015 ategory does not seem to readily a ept a smooth stru ture. Perhaps these matters an\nbe resolved, but in any ase the results of this paper, parti ularly in the light of \u009f6, appear to\nshow that multiple Lie groupoid theory is well suited to \u001cnite\u0015dimensional smooth di\u001berential\ngeometry.\n\n*\n\n*\n\n*\n\n*\n\n*\n\nAn announ ement of some of the main results of this paper was published in [17℄, and an\nearly version was arXived in [21℄. Amongst the many hanges between [21℄ and the urrent\npaper, the most striking is perhaps the simpli\u001c ation of the de\u001cnition 3.1 of a double Lie\nalgebroid, following the observation of Ted Voronov that in his super formulation [35℄, the\nanalogue of Condition II in [21℄ follows from Conditions I and III. This has enabled many\narguments to be onsiderably shortened.\nWe do not in lude oordinate representations in this paper. The use of intrinsi formulations keeps lear the nature of ea h stru ture and makes the lifting of results and de\u001cnitions\nfrom one level to another mu h easier. For example, most of the anoni al isomorphisms used\nin the paper have been introdu ed for manifolds or ve tor bundles, and are then lifted to\nvarious multiple stru tures. The fun torial nature of these pro esses is less lear in oordinate\nformulations. However, a oordinate\u0015based approa h is in luded in [35℄.\nThe material of this paper has developed over a onsiderable number of years and I\nhave bene\u001cted greatly from many onversations with Yvette Kosmann\u0015S hwarzba h, Alan\nWeinstein, and Ping Xu over this time. Conversations with Ted Voronov at the XXVth\nWorkshop on Geometry and Mathemati al Physi s at Biaaowie»a in 2006 provided a ru ial\nstimulus for this revision and I am very grateful to him, and to the organizers of the Biaaowie»a\nworkshop for providing, inter alia, the opportunity for extended onversations. I also wish to\nthank the organizers of the programme on Gerbes, Groupoids and Quantum Field Theory at\nthe ESI in 2006, where important parts of this revision were written.\n\n5\n\n\fK. C. H. Ma kenzie\n\n\u009f 1 DOUBLE VECTOR BUNDLES AND THEIR DUALITY\nWe begin by re alling the duality of double ve tor bundles whi h was introdu ed in [18℄, [8℄\nusing the duality whi h Pradines [32℄ had introdu ed for ve tor bundle obje ts in the ategory\nof Lie groupoids. See [15℄ for a fuller a ount.\nThe de\u001cnition of double ve tor bundle given in the Introdu tion (see Figure 1(a)) is omD : D → A and\nplete but needs elaboration. We denote the proje tions in Figure 1(a) by qA\nD\nqB : D → B ; these are ve tor bundle morphisms over the proje tions qB : B → M and\nD (d) = a and q D (d) = b, and q (a) = m, then we\nqA : A → M respe tively. If d ∈ D has qA\nA\nB\nsay that d has outline (d; a, b; m).\nConsider four elements d1 , . . . , d4 of D with proje tions a1 , . . . , a4 in A and b1 , . . . , b4\nin B su h that a1 = a2 , a3 = a4 , b1 = b3 and b2 = b4 . Then the ondition that ea h\nbundle proje tion from D is a morphism of ve tor bundles with respe t to the other stru ture\nguarantees that both sides of\n\n(d1 +\nd2 ) +\n(d3 +\nd4 ) = (d1 +\nd3 ) +\n(d2 +\nd4 )\nA\nB\nA\nB\nA\nB\n\n(2)\n\nare de\u001cned. Here +\ndenotes the addition in D → A and +\nthe addition in D → B . The\nA\nB\nondition that ea h addition be a ve tor bundle morphism with respe t to the other stru ture\nthen implies equality in (2). There are orresponding equations involving s alar multipli ation.\nEquation (2) is the inter hange law for addition.\n0a . Similarly the zero of D → B\nGiven a ∈ A we denote the zero of D → A above a by e\nB\n0b . The zeros in A → M and B → M are denoted 0A\nabove b ∈ B is denoted e\nm and 0m . The\n00A\n00B\nfor D → A and the zero e\nfor D → B are equal;\ninter hange law implies that the zero e\nm\nm\nthis is denoted ⊙m .\nThe interse tion of the kernels of the two proje tions de\u001cned on D is alled the ore of the\ndouble ve tor bundle D and denoted C . The ve tor bundle stru tures on D indu e a ommon\nD : D → B is the pullba k q ! C of\nve tor bundle stru ture on C with base M . The kernel of qB\nA\nD : D → A is q ! C . In pra ti e ores are\nthis ve tor bundle C a ross qA , and the kernel of qA\nB\noften identi\u001ced with stru tures whi h are not stri tly subsets of D and in su h ases we write\nc for the element of D whi h orresponds to a c ∈ C .\nA morphism of double ve tor bundles from (D; A, B; M ) to (D ′ ; A′ , B ′ ; M ′ ) is a quadruple\nof maps φ : D → D ′ , φA : A → A′ , φB : B → B ′ and φM : M → M ′ su h that (φ, φA ),\n(φ, φB ), (φA , φM ) and (φB , φM ) are morphisms of ve tor bundles. A morphism of double\nve tor bundles indu es a morphism of the ores φC : C → C ′ by restri tion.\nRegarding D as an ordinary ve tor bundle over A, we denote the dual bundle by D B A.\n(This notation avoids problems with multiple subs ripts later.) In addition to its standard\nstru ture on base A, this has a ve tor bundle stru ture on base C ∗ , the proje tion of whi h,\nA , is de\u001cned by\ndenoted γC\n∗\nhγCA∗ (Φ), ci = hΦ, e\n(3)\n0a + ci\nB\n\nD )−1 (a) → R, a ∈ A , and c ∈ C . The addition in D B A → C ∗ , whi h we\nwhere Φ : (qA\nm\nm\ndenote by C+∗ , is de\u001cned by\n\nhΦ C+∗ Φ′ , d +\nd′ i = hΦ, di + hΦ′ , d′ i.\nB\n6\n\n(4)\n\n\fEhresmann doubles and Drinfel'd doubles\n\nThe ondition that Φ and Φ′ proje t to the same element of C ∗ guarantees that this is well\u0015\n∗ is denoted e\nA and is de\u001cned by\n0B\nde\u001cned. The zero of D B A → C ∗ above κ ∈ Cm\nκ\nA e +\nhe\n0B\nκ , 0b A ci = hκ, ci\n\n(5)\n\nwhere c ∈ Cm and b is any element of Bm . The s alar multipli ation is de\u001cned in a similar\nway. These two stru tures make D B A into a double ve tor bundle as in Figure 2(a), the\n\nD BA\n\nA\nγC\n∗\n\n/ C∗\n\nD BB\nB\nγC\n∗\n\nqC ∗\n\nA\nγA\n\n\u000f\n\nA\n\nqA\n\nB\nγB\n\nqB\n\n\u000f\n\n\u000f\n/M\n\n/B\n\nC∗\n\n(a)\n\nqC ∗\n\n\u000f\n/M\n\n(b)\nFigure 2.\n\nverti al dual of D . The ore of D BA identi\u001ces with B ∗ , with the ore element ψ orresponding\n∗ given by\nto ψ ∈ Bm\nhψ, e\n0b +\nci = hψ, bi.\n(6)\nA\n\nThere is also a horizontal dual D BB with sides B and C ∗ and ore A∗ , as in Figure 2(b).\nThere is now the following somewhat surprising result. A proof is in [15, Chap. 9℄.\n\nTheorem 1.1 ([18, 3.1℄, [8, Thm. 16℄) There is a natural (up to sign) nondegenerate pairing between D B A → C ∗ and D B B → C ∗ given by\nΦ, Ψ = hΦ, di − hd, Ψi\n\n(7)\n\nwhere Φ ∈ D B A, Ψ ∈ D B B have γCA∗ (Φ) = γCB∗ (Ψ) and d is any element of D with\nD (d) = γ A (Φ) and q D (d) = γ B (Ψ).\nqA\nA\nB\nB\nThe pairing on the LHS of (7) is over C ∗ , whereas the pairings on the RHS are over A\nand B respe tively. The pairing indu es isomorphisms of double ve tor bundles\n\nZA : D B A → D B B B C ∗ ,\nZB : D B B → D B A B C ∗ ,\n\nhZA (Φ), Ψi = Φ, Ψ ,\n\n(8)\n\nhZB (Ψ), Φi = Φ, Ψ\n\n(9)\n\nwith (ZA ) BC ∗ = ZB . Note that ZB indu es the identity on both side bundles C ∗ and B and\nis −id on the ores A∗ , whereas ZA indu es the identity on the side bundles C ∗ and the ores\nB ∗ but is −id on the side bundles A.\nThe example whi h follows is needed for \u009f4.\n\nExample 1.2\n\nGiven an ordinary ve tor bundle (A, q, M ) there is the tangent double ve tor\nbundle of Figure 1(b). This example was used as early as the 1960s to provide an e\u001e ient\nformalism for onne tion theory in A; see [1℄. The ore of T A onsists of the verti al ve tors\nalong the zero se tion and identi\u001ces anoni ally with A. Dualizing the standard stru ture\n7\n\n\fK. C. H. Ma kenzie\n\nT A → A gives the otangent double ve tor bundle of Figure 1( ) with ore T ∗ M . Dualizing the\nstru ture T A → T M gives a double ve tor bundle whi h we denote (T • A; A∗ , T M ; M ); this\nis anoni ally isomorphi to (T (A∗ ); A∗ , T M ; M ) under an isomorphism IA : T (A∗ ) → T • A\ngiven by\nhIA (X ), ξi = hhX , ξii\n(10)\nwhere X ∈ T (A∗ ) and ξ ∈ T A have T (q∗ )(X ) = T (q)(ξ), and hh , ii is the tangent pairing of\nT (A∗ ) and T A over T M de\u001cned by\n\nhhX , ξii =\n\nd\ndt hφt , at i 0 ,\n\nd\nd\nφt 0 and ξ = dt\nat 0 .\nfor X = dt\nApplying 1.1 to D = T A thus indu es a pairing of T ∗ A and T (A∗ ) over A∗ given by\n\nΦ, X = hhX , ξii − hΦ, ξi\nwhere Φ ∈ T ∗ A and X ∈ T (A∗ ) have r(Φ) = pA∗ (X ), and ξ ∈ T A is hosen so that T (q)(ξ) =\nT (q∗ )(X ) and pA (ξ) = cA (Φ). (Here cA is the proje tion of the standard otangent bundle\nand r : T ∗ A → A∗ is a parti ular ase of (3).) This pairing is nondegenerate and so de\u001cnes\nan isomorphism of double ve tor bundles R : T ∗ A∗ → T ∗ A by the ondition\n\nR(F), X = hF, X i\nwhere the pairing on the RHS is the standard one of T ∗ (A∗ ) and T (A∗ ) over A∗ . This R\npreserves the side bundles A and A∗ but indu es −id : T ∗ M → T ∗ M as the map of ores. It\nis an antisymple tomorphism with respe t to the exa t symple ti stru tures. In summary\nwe now have the very useful equation\n\nhF, X i + hR(F), ξi = hhX , ξii,\n\n(11)\n\nfor F ∈ T ∗ A∗ , X ∈ T (A∗ ), ξ ∈ T A, where the pairings are over A∗ , A and T M respe tively.\nThis equation was originally derived in [26, \u009f5℄ by using the symple ti stru tures.\nNow return to the general double ve tor bundle in Figure 1(a), denoting the ore by C .\nEa h ve tor bundle stru ture on D gives rise to a double otangent bundle. These two double\notangents \u001ct together into a triple stru ture as in Figure 3(a). This stru ture is a triple\nve tor bundle in an obvious sense: ea h fa e is a double ve tor bundle and for ea h ve tor\nbundle stru ture on T ∗ D , the maps de\u001cning the stru ture are morphisms of double ve tor\nbundles. The left and rear fa es of Figure 3(a) are the two otangent doubles of the two\nstru tures on D and the top fa e may be regarded as the otangent double of either of the\ntwo duals of D . (In all su h triple diagrams, we take the oblique arrows to be oming out of\nthe page.)\nFigure 3(a) is, in a sense made pre ise in [23℄, the verti al dual of the tangent prolongation\nof D as given in Figure 3(b). Five of the six fa es in 3(a) are double ve tor bundles of types\nonsidered already; it is only ne essary to verify that the top fa e is a double ve tor bundle.\nThe ores of the same \u001cve fa es are known, and we take the ore of the top fa e to be T ∗ C .\nTaking these ores in opposite pairs, together with a parallel edge, then gives three double\nve tor bundles: the left and the right ores form (T ∗ A; A, A∗ ; M ), the ba k and the front\nores form (T ∗ B; B, B ∗ ; M ) and the up and the down ores form (T ∗ C; C, C ∗ ; M ). Ea h of\nthese ore double ve tor bundles has ore T ∗ M .\n8\n\n\fEhresmann doubles and Drinfel'd doubles\n\nT ∗ DJJ\n\nJJJ\nJ%\n\nD BA\n\n\u000f\n\nD KK\n\nKKK\nKKK \u000f\n%\n\nA\n\n/ D BB\nHHH\nHHH\n$\n/ C∗\n\nFF\nFF\nF#\n\n/ TB\nGG\nGG\nGG\n#\n/ TM\n\nD FF\nFF\nFF\nF# \u000f\nA\n\n\u000f\n/B\nGG\nGG\nGG\nG# \u000f\n/M\n\nT DF\n\nTA\n\n\u000f\n/BJ\nJJ\nJJ\nJ$ \u000f\n/M\n\n\u000f\n\n(a)\n\n(b)\nFigure 3.\n\n\u009f 2 PRELIMINARY CASE\nConsider a double ve tor bundle as in Figure 1(a). Before onsidering bra ket stru tures, we\nneed to onsider two lasses of se tions of the bundle stru tures on D .\nA se tion ξ ∈ ΓA D is a (verti al) linear se tion if there exists X ∈ ΓB su h that (ξ, X) is\nD , B).\na ve tor bundle morphism from (A, qA , M ) to (D, qB\n\nProposition 2.1\n\nIf (ξ, X) is a linear se tion, then lξ : D B A → R de\u001cned by\nA\nΦ 7→ hΦ, ξ(γA\n(Φ))i\n\nis linear with respe t to C ∗ as well as A, and the restri tion of lξ to the ore of D B A is\nlX : B ∗ → R .\nTake elements (Φ1 ; a1 , κ; m) and (Φ2 ; a2 , κ; m) of D B A. Their sum over C ∗ has\noutline (Φ1 C+∗ Φ2 ; a1 + a2 , κ; m) and so, using \u001crst the linearity of ξ and then the de\u001cnition of\n+,\nC∗\nProof.\n\nlξ (Φ1 C+∗ Φ2 ) = hΦ1 C+∗ Φ2 , ξ(a1 + a2 )i = hΦ1 C+∗ Φ2 , ξ(a1 ) +\nξ(a2 )i\nB\n= hΦ1 , ξ(a1 )i + hΦ2 , ξ(a2 )i = lξ (Φ1 ) + lξ (Φ2 ).\n∗ the orresponding ore element ψ ∈ D B A is\nS alar multipli ation is similar. Given ψ ∈ Bm\ngiven by (6). Using this,\n\nlξ (ψ) = hψ, ξ(0A\nm )i = hψ, x(m)i = lx (ψ),\n\n(12)\n\nwhere lx : B ∗ → R denotes the linear map φ 7→ hφ, x(qB ∗ (φ))i, for any x ∈ ΓB .\n\n2\n∗\n∗\nB\nB\nthe se tion of D A C → C whi h is de\u001cned\n\nGiven a linear se tion (ξ, x), denote by\nby lξ . Thus\nhξ ⊓ (κ), ΦiC ∗ = lξ (Φ) = hΦ, ξ(a)iA\n\nξ⊓\n\n(13)\n\nfor (Φ; a, κ; m) ∈ D B A. It is easily seen that (ξ ⊓ , x) is a linear se tion of D B A B C ∗ → C ∗ .\n9\n\n\fK. C. H. Ma kenzie\n\nThere is thus a bije tive orresponden e between verti al linear se tions of D and horizontal linear se tions of D BA BC ∗ . In the ase where D is the tangent of an ordinary ve tor\nbundle A, as in Figure 1(b), this is the orresponden e between linear ve tor \u001celds on A and\nlinear ve tor \u001celds on A∗ (see [15, \u009f3.4℄).\nNext, for any c ∈ ΓC , de\u001cne a ore se tion c ∈ ΓA D by\n\nProposition 2.2\n\ne\nc(a) = c(m) +\n0a .\nB\n\nThe verti al linear se tions (ξ, X) and the ore se tions c for c ∈ ΓC ,\ngenerate ΓA D as a C ∞ (A)\u0015module.\nProof.\n\nFirstly, given any X ∈ ΓB , there is a linear se tion (ξ, X). To see this, let\n\nS : D → A ×M B ×M C\nbe a splitting of D ; that is, an isomorphism of double ve tor bundles to the double ve tor\n! (B ⊕ C) and the horizontal stru ture\nbundle for whi h the verti al stru ture is the pullba k qA\n! (A ⊕ C). Then the se tion\nis the pullba k qB\n\na 7→ S −1 (a, X(m), 0m ),\nwhere m = qA (a), is linear over X .\nD ◦ ξ: A → B\nNow onsider any se tion whatever ξ ∈ ΓA D . Then by para ompa tness qA\nis a \u001cnite sum\nX\nD\nqA\n◦ξ =\nFi Xi\n! B. For ea h X\nwhere Fi ∈ C ∞ (A) and Xi , for Xi ∈ ΓB , denotes the pullba k se tion of qA\ni\nP\nhoose a linear se tion (ξi , Xi ) and write η =\nFi ξi .\nD and is therefore c for some c ∈ ΓC.\nThen ξ − η proje ts to zero under qA\n2\n\nBefore addressing the general on ept of double Lie algebroid, it will be helpful to deal\nwith a very spe ial ase.\n\nDe\u001cnition 2.3\n\nAn L A \u0015ve tor bundle is a double ve tor bundle as in Figure 1(a) together\nwith Lie algebroid stru tures on a pair of parallel sides, su h that the stru ture maps of the\nother pair of ve tor bundle stru tures are Lie algebroid morphisms.\n\nFor de\u001cniteness, take the Lie algebroid stru tures to be on D → A and B → M . Write\n∆A : D → T A and b : B → T M for the an hors.\nSin e D → A is a Lie algebroid, the dual D B A has a dual Poisson stru ture, whi h is\nlinear with respe t to the bundle stru ture over A.\n\nTheorem 2.4\n\nThe Poisson stru ture πBA on D B A is also linear with respe t to the bundle\nstru ture over C ∗ .\nProof. Sin e it is dual to a Lie algebroid stru ture, πBA is hara terized by the following\nequations.\n\n{lξ , lη } = l[ξ,η] ,\n\nA\nA\n{lξ , F ◦ γA\n} = ∆A (ξ)(F ) ◦ γA\n,\n\n10\n\nA\nA\n{F1 ◦ γA\n, F2 ◦ γA\n} = 0,\n\n(14)\n\n\fEhresmann doubles and Drinfel'd doubles\n\nwhere ξ and η are arbitrary elements of ΓA D and F1 , F2 ∈ C ∞ (A). See [15, \u009f10.3℄. We need\nto prove orresponding equations with respe t to the bundle stru ture over C ∗ . The fun tions\nD B A → R whi h are linear with respe t to the bundle stru ture over C ∗ are determined by\narbitrary se tions of D B A B C ∗ → C ∗ . As in Proposition 2.2, these are of two types.\nFirstly, if X , Y ∈ ΓC ∗ (D B A B C ∗ ) are linear se tions, then X = ξ ⊓ and Y = η ⊓ for\nlinear se tions (ξ, x), (η, y) ∈ ΓA D.\n\nLemma 2.5\n\nIf (ξ, x) and (η, y) are linear se tions of D , then ([ξ, η], [x, y]) is also.\n\nD to a se tion x, de\u001cne a se tion ξ ⊕ ξ of\nFor a se tion ξ whi h proje ts under qB\nD ⊕B D → A ⊕M A by (ξ ⊕ ξ)(a1 ⊕ a2 ) = ξ(a1 ) ⊕ ξ(a2 ). Then (ξ, x) is linear if and only if\n: D ⊕B D → D , whi h is a Lie algebroid\nξ ⊕ ξ proje ts to ξ under the horizontal addition +\nB\nmorphism over + : A ⊕M A → A by hypothesis. Sin e the two omponents of a ξ ⊕ ξ depend\non ea h variable separately, we have [ξ ⊕ ξ, η ⊕ η] = [ξ, η] ⊕ [ξ, η] and the result follows. 2\n\nProof.\n\n∗\n\n∗\n\n∗\n\n∗\n\n∗\nC\nC\nC\nSo {lC\nX , lY } = {lξ , lη } = l[ξ,η] = l[ξ,η]⊓ is also linear over C . Here we wrote lX for\nlarity.\nSe ondly, any φ ∈ ΓA∗ indu es a ore se tion φ of D B A B C ∗ → C ∗ by\nB +\nφ(κ) = e\n0B\nφ(m),\nκ\nB\n\n∗\nκ ∈ Cm\n,\n\n∗\n\nB\nwhi h in turn indu es lC\nφ : D A → R. A simple al ulation shows that\n∗\n\nA\nlC\nφ = l φ ◦ γA .\n\nIt now follows from (14) that\n∗\n\n∗\n\nC\nA\nA\nC\n, lφ\n} = {lφ1 ◦ γA\n, l φ 2 ◦ γA\n} = 0.\n{lφ\n1\n2\n\n(15)\n\nNext onsider a linear se tion X = ξ ⊓ and φ ∈ ΓA∗ . We have\n∗\n\n∗\n\nC\nA\nA\n{lC\nX , lφ } = {lξ , lφ ◦ γA } = ∆A (ξ)(lφ ) ◦ γA .\n\n(16)\n\nSin e ∆A (ξ) is a linear ve tor \u001celd on A, it maps the linear fun tion lφ to a linear fun tion.\nTo make this expli it, re all the notion of derivation on a ve tor bundle. A derivation on\nE → M is a linear di\u001berential operator Λ of order 6 1 for whi h there is a ve tor \u001celd X ,\ndepending on Λ, su h that Λ(f μ) = f Λ(μ) + X(f )μ for all f ∈ C ∞ (M ) and all se tions μ\nof E . For any ve tor bundle E there is a ve tor bundle D(E) the se tions of whi h are the\nderivations, and with the an hor de\u001cned by Λ 7→ X and the usual bra ket, D(E) is a Lie\nalgebroid. See [15, \u009f3.3℄ and referen es given there.\nThere is a bije tive orresponden e between derivations on E and linear ve tor \u001celds on\nE ∗ , and in the present ase we an de\u001cne a derivation Λξ on A∗ su h that\n\n∆A (ξ)(lφ ) = lΛξ (φ)\n\n(17)\n\nfor all φ ∈ ΓA∗ .\n∗\n∗\nB B ∗\nFrom 2.2 we know that lC\nX , for X an arbitrary se tion of D A C → C , is of the form\nX\n∗\nC∗\nFi lC\nξ ⊓ + lφ\ni\n\n11\n\n\fK. C. H. Ma kenzie\n\nwhere Fi ∈ C ∞ (C ∗ ). It follows from (15), (16), and the argument following Lemma 2.5, that\nthe bra ket of two su h fun tions is another of the same type. This ompletes the proof that\nthe bra ket of any two fun tions D B A B C ∗ → R whi h are linear over C ∗ , is also linear over\nC ∗.\nA : D BA → C ∗ . Fun tions\nWe next need to onsider fun tions whi h are pullba ks a ross γC\n∗\n∗\n∗\nC → R are of two types. Firstly any c ∈ ΓC indu es lc : C → R. Se ondly, any f ∈ C ∞ (M )\npulls ba k to f ◦ qC ∗ : C ∗ → R. It is easily seen that\n\nlc ◦ γCA∗ = lc ,\n\nA\nf ◦ qC ∗ ◦ γCA∗ = f ◦ qA ◦ γA\n.\n\n(18)\n\nFor the bra ket of two fun tions of the \u001crst type, we have {lc1 , lc2 } = l[c1 ,c2 ] from (14).\nConsider the horizontal s alar multipli ation in D by some t 6= 0, 1. This de\u001cnes an automorphism D → D over A → A and therefore indu es a map of se tions tB : ΓA D → ΓA D ; the\nLie algebroid ondition then ensures that [tB (ξ), tB (η)] = tB ([ξ, η]) for all ξ, η ∈ ΓA D . Now\nfor c ∈ ΓC , tc = tB (c) and so we have\n\nt[c1 , c2 ] = [tB (c1 ), tB (c2 )] = [tc1 , tc2 ] = t2 [c1 , c2 ].\nThus the bra ket of two fun tions D B A → R arising from se tions of C must be zero.\nThat the bra ket of two fun tions of the se ond type in (18) is zero follows immediately\nfrom (14).\nAgain from (14), we have\n\n{lc ◦ γCA∗ , f ◦ qC ∗ ◦ γCA∗ } = {lc , f ◦ qC ∗ ◦ γCA∗ } = ∆A (c)(f ◦ qC ∗ ) ◦ γCA∗ .\nThe an hor ∆A : D → T A is a morphism of double ve tor bundles and therefore restri ts\nto a map of the ores, whi h we denote by ∂A : C → A. Then ∆A maps the ore se tion c\nto the ore se tion of T A orresponding to ∂A (c). The ore se tions of T A are the verti al\nve tor \u001celds on A and verti al ve tor \u001celds map pullba k fun tions to zero. (See [15, \u009f3.4℄.)\nA , f ◦ q ∗ ◦ γ A } = 0.\nSo {lc ◦ γC\n∗\nC\nC∗\n∗\nA\n∗\nB B ∗\nIt remains to show that bra kets {lC\nX , G ◦ γC ∗ }, where X is a se tion of D A C → C\n∞\n∗\n′\nA\nand G ∈ C (C ), are of the form G ◦ γC ∗ . As before, it su\u001e es to onsider the ases where\nX is ξ ⊓ or φ and G is lc or f ◦ qC ∗ .\n∗\nA\nD\nFirstly, we have {lC\nl⊓ , lc ◦ γC ∗ } = {lξ , lc } = l[ξ, c] . Now ξ proje ts to x under qB and c\nproje ts to 0, so [ξ, c] also proje ts to 0. It is therefore c′ for some c′ ∈ ΓC whi h we denote\nQξ (c); it is easily he ked that Qξ : ΓC → ΓC is a derivation on C .\nSe ondly,\n∗\n\nA\nA\nA\nA\nA\n{lC\nl⊓ , f ◦ qC ∗ ◦ γC ∗ } = {lξ , f ◦ qA ◦ γA } = ∆A (ξ)(f ◦ qA ) ◦ γA = x(f ) ◦ qA ◦ γA = x(f ) ◦ qC ∗ ◦ γC ∗\n\nwhi h is of the required form.\nIn the third ase we have\nA\nA\nA\n{lφ ◦ γA\n, lc } = −∆A (c)(lφ ) ◦ γA\n= −∂A (c)↑ (lφ ) ◦ γA\n,\n\nwhere ∂A (c)↑ is the verti al ve tor \u001celd on A orresponding to the se tion ∂A (c). Sin e the\n\u001dows of ∂A (c)↑ are by s alar multipli ation, we have ∂A (c)↑ (lφ ) = hφ, ∂A (c)i ◦ qA and the\nresult is of the required form.\n12\n\n\fEhresmann doubles and Drinfel'd doubles\n\nLastly, in the fourth ase the bra ket is zero, sin e both fun tions are pullba ks from A.\nThis ompletes the proof of Theorem 2.4.\n2\n∗\n∗\nB\nB\nIt follows that D A C → C has a Lie algebroid stru ture de\u001cned by\n∗\n\n∗\n\n∗\n\nC\nC\nlC\n[X ,Y ] = {lX , lY },\n\n∗\n\nA\ne(X )(G) ◦ γCA∗ = {lC\nX , G ◦ γC ∗ },\n\nwhere e denotes the an hor, X , Y ∈ ΓC ∗ (D B A B C ∗ ) and G ∈ C ∞ (C ∗ ).\nFrom the proof of 2.4 we have, in parti ular, that\n\n[ξ ⊓ , η ⊓ ] = [ξ, η]⊓ ,\ne(ξ ⊓ )(f ◦ qC ∗ ) = x(f ) ◦ qC ∗ ,\n\n[ξ ⊓ , φ] = Λξ (φ),\n\n[φ, ψ] = 0,\n\ne(ξ ⊓ )(lc ) = lQξ (c) ,\n\ne(φ)(lc ) = −hφ, ∂A (c)i ◦ qC ∗ ,\n\ne(φ)(f ◦ qC ∗ ) = 0,\n\n(19)\n\nwhere (ξ, x) and (η, y) are linear se tions of D → A, φ, ψ ∈ ΓA∗ , c ∈ ΓC and f ∈ C ∞ (M ).\nThe operators Λξ : ΓA∗ → ΓA∗ and Qξ : ΓC → ΓC are de\u001cned in the ourse of the proof.\nNoti e that, sin e the relationship between D and D B A B C ∗ is re ipro al, there is a\nsimilar set of equations for the bra ket on D → A.\nFor any ve tor bundle V → M with a linear Poisson stru ture π , the Poisson an hor\nπ # : T ∗ V → T V is a morphism of double ve tor bundles over V and the an hor a : V ∗ → T M\nof the dual Lie algebroid stru ture. Taking the dual of π # over V (that is, the usual dual)\nex hanges the side and ore stru tures with the other's duals, so that (π # )∗ has ore morphism\na∗ . Sin e (π # )∗ = −π # it follows that the ore morphism of π # is −a∗ . See [15, 9.2.1℄.\nThis argument applies to ea h ve tor bundle stru ture on D B A. Denote the Poisson\nan hor asso iated to πBA by π #A . Figure 4 shows the otangent and tangent triple ve tor\nbundles for D B A, whi h are the domain and target for π #A .\n\nT ∗ (D B A)\n\nLLL\nLLL\nL%\n\nD\n\nT (D B A)\n\n/ D BA BC∗\nMMM\nMMM\nMM&\n/B\n\n\u000f\n\nKKK\nKKK\nK%\n\n\u000f\n/ C∗\nMMM\nMMM\nMM& \u000f\n/M\n\nD B AMM\n\nMMM\nMM& \u000f\n\nA\n\nTA\n\n\u000f\n\nD B ALL\n\nLLL\nLLL \u000f\n&\n\nA\n\n(a)\n\n/ T C∗\nGG\nGG\nGG\nG#\n/ TM\n\u000f\n/ C∗\nHH\nHH\nHH\nH# \u000f\n/M\n\n(b)\nFigure 4.\n\nSin e πBA is linear over A, π #A : T ∗ (D B A) → T (D B A) is a morphism of the left hand\nfa es in Figure 4, and the map D → T A is the an hor ∆A .\nLikewise, π #A is a morphism of double ve tor bundles for the rear fa es of Figure 4 and\nthe orner map D BA BC ∗ → T C ∗ is the an hor e for the Lie algebroid stru ture on D BA BC ∗ .\nIt follows by a simple argument that π #A is a morphism of triple ve tor bundles. The\norner map B → T M is the an hor b and the other four orner maps are identities.\nIn e\u001be t, Theorem 2.4 shows that dualizing an L A \u0015ve tor bundle along its Lie algebroid\nstru ture gives rise to a Poisson double ve tor bundle ; that is, to a double ve tor bundle with\n13\n\n\fK. C. H. Ma kenzie\n\na Poisson stru ture for whi h the Poisson an hor is a morphism of triple ve tor bundles. The\nonverse may also be proved.\n\n\u009f 3 ABSTRACT DOUBLE LIE ALGEBROIDS\nWe now turn to the general notion of double Lie algebroid. Before giving the de\u001cnition, we\nneed some preliminaries.\nAgain onsider a double ve tor bundle as in Figure 1(a). We now assume that there are Lie\nalgebroid stru tures on all four sides and that ea h pair of parallel sides forms an L A \u0015ve tor\nbundle.\nDenote the four an hors by ∆A : D → T A, ∆B : D → T B, and b : B → T M, a : A →\nT M . As usual we denote all four bra kets by [ , ]; the notation for elements will make lear\nwhi h stru ture we are using.\nThe an hors thus give morphisms of double ve tor bundles\n\n(∆A ; id, b; id) : (D; A, B; M ) → (T A; A, T M ; M ),\n(∆B ; a, id; id) : (D; A, B; M ) → (T B; T M, B; M )\nand so de\u001cne morphisms of their ores; denote these by ∂A : C → A and ∂B : C → B .\nFrom \u009f2 we know that D B A B C ∗ is a Lie algebroid over C ∗ . Likewise, the Lie algebroid\nstru ture on D → B indu es a Poisson stru ture on D BB whi h is linear over C ∗ and therefore\nindu es a Lie algebroid stru ture on D B B B C ∗ with base C ∗ .\nThe bundles D B A B C ∗ and D B B B C ∗ are dual over C ∗ under the pairing:\n−1\n−1\n(X ), Y i.\n(Y )i = hZB\n8X , Y 8 = hX , ZA\n\nDe\u001cnition 3.1 A double Lie algebroid is a double ve tor bundle as in Figure 1(a), equipped\nwith Lie algebroid stru tures on all four sides su h that ea h pair of parallel sides forms an\nL A \u0015ve tor bundle, and su h that the Lie algebroid stru tures on D B A B C ∗ → C ∗ and\nD B B B C ∗ → C ∗ form a Lie bialgebroid.\nIn pra ti e we will use ZA or ZB to transfer the Lie algebroid stru ture from, for example,\nD B B B C ∗ to D B A.\nWe re all the notion of Lie bialgebroid, whi h was introdu ed in [26℄ as an abstra tion of\nthe in\u001cnitesimal stru ture of a Poisson groupoid [36℄. The onventions used here follow [15℄.\n\nDe\u001cnition 3.2\n\nLet A be a Lie algebroid on base M and suppose that A∗ is also equipped with\na stru ture of Lie algebroid. These stru tures onstitute a Lie bialgebroid if\nd∗ [X, Y ] = [d∗ X, Y ] + [X, d∗ Y ]\n\n(20)\n\nfor all X, Y ∈ ΓA.\nIn this de\u001cnition d∗ is the oboundary operator for A∗ and [ , ] is the S houten bra ket\nof multise tions of A. See [15℄, for example.\nA Lie bialgebra is a Lie bialgebroid for whi h M is a single point. For a Poisson manifold\nM , the otangent Lie algebroid stru ture on T ∗ M makes (T ∗ M, T M ) a Lie bialgebroid. The\nfollowing material, whi h is needed below, an be found in [26℄ and [15, Chapter 12℄.\n14\n\n\fEhresmann doubles and Drinfel'd doubles\n\nSuppose that (A, A∗ ) is a Lie bialgebroid on base M and denote the an hors by a and a∗ .\n#\nThen we take the Poisson stru ture on M to be πM = a∗ ◦ a∗ . It follows that a is a Poisson\nmap (to the tangent lift Poisson stru ture on T M ; see below) and a∗ is anti\u0015Poisson.\nThe on ept of Lie bialgebroid is self\u0015dual: if (A, A∗ ) is a Lie bialgebroid, then (A∗ , A) is\nalso ([26, 3.10℄, [9℄, or see [15℄). However (A∗ , A) will indu e on M the opposite of the Poisson\nstru ture indu ed by (A, A∗ ).\nIn this se tion we need the following morphism riterion for a Lie bialgebroid ([26, 6.2℄,\nor see [15, \u009f12.2℄).\n\nTheorem 3.3\n\nLet A be a Lie algebroid on M su h that its dual ve tor bundle A∗ also has a\nLie algebroid stru ture. Denote their an hors by a and a∗ . Then (A, A∗ ) is a Lie bialgebroid\nif and only if\nπ#\n\nR\n\nA\nT ∗ (A∗ ) −→ T ∗ (A) −→\nTA\n\n(21)\n\nis a Lie algebroid morphism over a∗ , where the domain T ∗ (A∗ ) → A∗ is the otangent Lie\nalgebroid indu ed by the Poisson stru ture on A∗ , and the target T A → T M is the tangent\nprolongation of A.\nThe tangent prolongation Lie algebroid stru ture on T A → T M is best thought of in terms\nof the dual stru ture. For any Poisson manifold P there is a tangent lift Poisson stru ture on\nT P for whi h the an hor is given by\n\nπT#P = JP ◦ T (πP# ) ◦ Θ−1\nP\n\n(22)\n\nwhere JP : T 2 P → T 2 P is the anoni al involution for the manifold P and ΘP : T (T ∗ P ) →\nT ∗ (T P ) was named the Tul zyjew di\u001beomorphism of P in [15, p.395℄ (Θ was denoted J ′ in\n[26℄). For any manifold P , either of the two formulas\n∗\nΘP = RT M ◦ (δν)♭ = JM\n◦ IT M\n\n(23)\n\nmay be taken as the de\u001cnition of ΘP . Here δν is the anoni al symple ti stru ture on T ∗ P .\nIf P = A∗ is the dual of a Lie algebroid then the tangent lift Poisson stru ture is linear\nwith respe t to the bundle T (A∗ ) → T M and therefore indu es a Lie algebroid stru ture on\nT A → T M via the tangent pairing hh , ii. The an hor is JM ◦T (a). See [26, 5.6℄ or [15, 10.3.14,\n9.7.1℄.\nWith these preliminaries established, onsider a double Lie algebroid (D; A, B; M ). We\nuse ZA to transfer the Lie algebroid stru ture from D BB BC ∗ to D BA. From the morphism\nriterion, we know that\n\nπ #A ◦ R : T ∗ (D B A B C ∗ ) → T (D B A)\nis a morphism of Lie algebroids over e : D B A B C ∗ → T C ∗ . As with any Lie bialgebroid, it\nis also a morphism of double ve tor bundles, with the other side morphism being the identity\nof D B A and the ore morphism being e∗ : T ∗ C ∗ → D B A.\nFrom \u009f2 we know that e is a morphism of double ve tor bundles, namely of the two\nright\u0015hand fa es in Figure 4, over C ∗ and b : B → T M .\n\nLemma 3.4\n\n∗ : A∗ → C ∗ .\nThe ore of e : D B A B C ∗ → T C ∗ is −∂A\n\n15\n\n\fK. C. H. Ma kenzie\n\nThe dual of π #A over D BA is −π #A . In the dualization pro ess, the two triple ve tor\nbundles in Figure 4 are inter hanged, but the positioning of the sides and ores is permuted.\nIn parti ular, the ores of the right\u0015hand fa es and of the front fa es are ex hanged. The map\nof the front ores indu ed by π #A is ∂A , by de\u001cnition.\n2\nProof.\n\nThe pro ess of dualizing a triple stru ture is overed in [23℄. Lemma 3.4 an also be proved\nby using (19).\nDualizing e over C ∗ it follows that e∗ is a morphism of double ve tor bundles over C ∗ and\n−∂A , with ore morphism b∗ : T ∗ M → B ∗ .\nThe Poisson stru ture indu ed on C ∗ by the Lie bialgebroid (D B A B C ∗ , D B A) has\nasso iated an hor\n#\n∗\n∗ ∗\nπC\n∗ = e∗ ◦ e : T C → T C,\nwhere e∗ : D BA → T C ∗ is the an hor of D BA → C ∗ . Denoting the an hor of D BB BC ∗ → C ∗\nby f , we have e∗ = f ◦ ZA . The arguments applied above to e apply equally to f and so\nf : D B B B C ∗ → T C ∗ is a morphism of double ve tor bundles over C ∗ and −a, with ore\n∗ . Thus π # is a morphism of double ve tor bundles and therefore indu es on\nmorphism −∂B\nC∗\nC the stru ture of a Lie algebroid, for whi h the an hor is the side morphism (−a) ◦ (−∂A ).\n#\n∗\n∗\nThe ore morphism for πC\n∗ is (−∂B ) ◦ b . The skew\u0015symmetry of a Poisson an hor implies\nthat its ore morphism is the negative dual of its non\u0015identity side morphism, and so we have\na ◦ ∂A = b ◦ ∂B .\n\nProposition 3.5\n\nThe maps ∂A : C → A and ∂B : C → B are Lie algebroid morphisms.\n\nWe need two preparatory lemmas. The \u001crst is from [15, 10.3.6℄ and is proved by the same\nmethod as the se ond.\n\nLemma 3.6\n\nFor any Lie algebroid V on M, the bundle proje tion T ∗ V ∗ → V is a morphism\nof Lie algebroids over the bundle proje tion V ∗ → M.\n\nLemma 3.7\n\nThe proje tions D B A B C ∗ → B and D B B B C ∗ → A are morphisms of Lie\nalgebroids over the bundle proje tion C ∗ → M .\nDenote the proje tions by Q : D B A B C ∗ → C ∗ and q : C ∗ → M . The an hor\nondition b ◦ Q = T (q) ◦ f follows from the fa t that the Poisson an hor for D B A, namely\nT ∗ (D B A) → T (D B A), is not only a morphism of double ve tor bundles, but a morphism of\ntriple ve tor bundles.\nSin e q is a surje tive submersion and Q is \u001cbrewise surje tive, it is su\u001e ient to he k that\nif X proje ts to x and Y proje ts to y , then [X , Y ] proje ts to [x, y]. By 2.2, it is su\u001e ient\nto onsider the ases of linear se tions and ore se tions.\nFor two linear se tions (ξ, x) and (η, y) of D → A we have from the proof of Theorem 2.4\nthat [ξ, η] is linear over [x, y] and [ξ ⊓ , η ⊓ ] = [ξ, η]⊓ . Likewise, for φ, ψ ∈ ΓA∗ , the ore se tions\nproje t to zero and [φ, ψ] = 0 does also.\nLastly, for a linear se tion (ξ, x) and φ ∈ ΓA∗ , we have from (19) that [ξ ⊓ , φ] is the ore\nse tion Λξ (φ), and this proje ts to zero.\nThe result for D B B B C ∗ → A is proved in the same way.\n2\n∗\n∗\n∗\nB\nProof of 3.5: As noted above, e : T C → D\nA is a morphism of double ve tor bundles\nProof.\n\nover C ∗ and −∂A : C → A. As for any Lie bialgebroid, e∗ is also a morphism of Lie algebroids\n16\n\n\fEhresmann doubles and Drinfel'd doubles\n\nover C ∗ . Now the proje tion T ∗ C ∗ → C is a morphism of Lie algebroids, and the proje tion\nD BA → A is an anti\u0015morphism of Lie algebroids (be ause ZA is −id on A). Both proje tions\nare surje tive submersions and so determine the Lie algebroid stru tures on their targets. It\nfollows that −∂A is an anti\u0015morphism of Lie algebroids.\n2\nThe general pro ess used here, of quotienting a known morphism of Lie algebroids, is\nbased on the following result. A \u001cbration of Lie algebroids is a morphism ν : A → A′ over\np : M → M ′ su h that p is a surje tive submersion and ν is \u001cbrewise surje tive.\n\nProposition 3.8\n\nConsider Lie algebroids A, A′ and B on bases M, M ′ and N , and let\nφ: A →\nψ : A′ → B and ν : A → A′ be morphisms of ve tor bundles over f, g and p,\nwith φ = ψ ◦ ν .\nIf φ is a morphism of Lie algebroids and ν is a \u001cbration of Lie algebroids, then ψ is a\nmorphism of Lie algebroids.\nA′ ,\n\nThis follows from the general theory of quotients of Lie algebroids [15, \u009f4.4℄, but is easy\nto prove dire tly.\nObserve that Proposition 3.5 annot be proved by mapping se tions of C to ore se tions\nof D → A. In the ase of an L A \u0015ve tor bundle there is a simple relation (equation (18)),\nbut this does not hold for a general double Lie algebroid. This may be seen by onsidering\nthe iterated tangent bundle T 2 M = T (T M ) of any manifold; the bra ket of two verti al lift\nve tor \u001celds (whi h are the ore se tions in this ase) is always zero.\nThe next result, that the an hors ∆A and ∆B are morphisms of Lie algebroids with respe t\nto both stru tures, was taken as part of the de\u001cnition of a double Lie algebroid in [21℄. I am\ngrateful to Ted Voronov for having shown [35℄, using super methods, that it is a onsequen e\nof the other onditions in the de\u001cnition. The proof whi h follows uses standard methods.\n\nTheorem 3.9\n\nThe an hor ∆A : D → T A is a Lie algebroid morphism over b : B → T M ,\nand the an hor ∆B : D → T B is a Lie algebroid morphism over a : A → T M .\n\n#A\n\nπ\n◦R\nT ∗ (D B A B C ∗ ) _ _ _ _ _/ T (D B A)\n\nOOO\nOOOν\nOO'\n\nMMM\nMMTM(ν ′ )\n&\n∆A\nD _ _ _ _ _ _ _ _ _/ T A\n\n\u000f\n\n\u000f\n\nD B A B CPP∗ _ _ _e _ _ _ _/ T C ∗ NN\n\nNNN\nPPP\nPPP \u000f\nNN& \u000f\nP(\n_\n_\n_\n_\n_\n_\n_\n_/ T M\nB\nb\n\nFigure 5.\nFigure 5 shows part of the outline of the map π #A ◦ R : T ∗ (D BA BC ∗ ) → T C ∗ . The\ndashed lines indi ate that this should be read as a morphism of double stru tures, from left\nto right, and emphasize that it is not a triple stru ture,\n\nProof.\n\n17\n\n\fK. C. H. Ma kenzie\n\nNote \u001crst that every verti al arrow is the bundle proje tion of a Lie algebroid. Next,\nπ #A ◦ R is a morphism of Lie algebroids over e, by the morphism riterion. Next, v and T (ν ′ )\nare \u001cbrations of Lie algebroids. That ν ′ : D BA → A is a morphism over q∗ : C ∗ → M follows\nfrom Lemma 3.7, and so its tangent prolongation is also. That ν is a \u001cbration follows from\n3.6 by using D B A B C ∗ ∼\n= D B B and taking V = D → B .\nThe result now follows by Proposition 3.8.\n2\nIn the se tions whi h follow we onsider three lasses of examples of double Lie algebroids.\n\n\u009f 4 THE COTANGENT DOUBLE OF A LIE BIALGEBROID\nThe notion of Lie bialgebroid is re alled in the previous se tion.\nConsider a Lie algebroid A on M together with a Lie algebroid stru ture on the dual, not\na priori related to that on A. The stru ture on A∗ indu es a Poisson stru ture on A, and this\ngives rise to a otangent Lie algebroid T ∗ A → A. Equally, the Lie algebroid stru ture on A\nindu es a Poisson stru ture on A∗ and this gives rise to a otangent Lie algebroid T ∗ A∗ → A∗ .\nWe transfer this latter stru ture to T ∗ A → A∗ via R. There are now Lie algebroid stru tures\non ea h of the four sides of the double ve tor bundle D = T ∗ A of Figure 6(a).\n\nTheorem 4.1\n\nLet A be a Lie algebroid on M su h that its dual ve tor bundle A∗ also has a\nLie algebroid stru ture. Then (A, A∗ ) is a Lie bialgebroid if and only if D = T ∗ A, with the\nstru tures just des ribed, is a double Lie algebroid.\nFirst assume merely that A∗ is a Lie algebroid. Consider Figure 1( ) with the\norresponding Lie algebroid stru tures on the horizontal sides.\n\nProof.\n\nLemma 4.2\nbundle.\n\nFigure 1( ) with the Lie algebroid stru tures just des ribed, is an L A \u0015ve tor\n\nIt must be proved that the ve tor bundle operations are Lie algebroid morphisms.\nThat the bundle proje tion T ∗ A → A∗ is a Lie algebroid morphism follows from Lemma 3.6.\nThat the addition map is a Lie algebroid morphism follows from the fa t that δlφ +\nδlψ =\nA\nδlφ+ψ for φ, ψ ∈ ΓA∗ . The other onditions are similar.\n2\nProof.\n\nNow assume that (A, A∗ ) is a Lie bialgebroid. The verti al stru ture on D is the otangent\nLie algebroid stru ture for the Poisson stru ture on A. Dualizing over A we have Figure 6(b)\nand the Poisson stru ture on T A is the tangent lift of the Poisson stru ture on A. By \u009f2 this\nPoisson stru ture is also linear over T M . The dual D BA BT M is shown in Figure 6( ). The\nmap IA : T (A∗ ) → T • A des ribed in Example 1.2 is an isomorphism of double ve tor bundles\nto (T (A∗ ); A∗ , T M ; M ) and by [15, 10.3.14℄ it is an isomorphism of Lie algebroids over T M\nto the tangent prolongation of A∗ → M .\nNow onsider the horizontal Lie algebroid stru ture in Figure 6(a). This was transported\nvia R from the otangent Lie algebroid of A∗ . By the same argument as in the verti al ase,\nthe indu ed Lie algebroid stru ture on D BA∗ BT M ∼\n= T A → T M is isomorphi to the tangent\nprolongation Lie algebroid of A → M .\nWe must now prove that :\n\nProposition 4.3\n\npair\n\n(T A, T • A)\n\nFor (A, A∗ ) a Lie bialgebroid on M , and the stru tures just des ribed, the\nis a Lie bialgebroid on T M .\n18\n\n\fEhresmann doubles and Drinfel'd doubles\n\nT ∗A\n\n/ A∗\n\nTA\n\n/ TM\n\nT •A\n\n/ TM\n\n\u000f\n\n\u000f\n/M\n\nA\n\n\u000f\n\n\u000f\n/M\n\nA∗\n\n\u000f\n\n\u000f\n/M\n\nA\n(a)\n\n(b)\n\n( )\n\nFigure 6.\nProof.\n\nWe use the morphism riterion 3.3. We must prove that\nπ#\n\nR\n\n•\nTA\nT ∗ (T • A) −→\nT ∗ (T A) −→\nT 2A\n\n(24)\n\n−1\n: T • A → T 2 M of T • A.\nis a morphism of Lie algebroids over the an hor JM ◦ T (a∗ ) ◦ IA\nHere R• is the anoni al map R for T A → T M . The domain of (24) is the otangent\nLie algebroid for the Poisson stru ture on T • A. The target of (24) is the iterated tangent\nprolongation of the Lie algebroid stru ture of A.\nWe need two lemmas. The \u001crst is easily proved (see [15, 9.6.4℄). The Θ is the Tul zyjew\ndi\u001beomorphism de\u001cned in (23).\n\nLemma 4.4\n\nLet M be any manifold and write p : T M → M and c : T ∗ M → M for the\nbundle proje tions. Then for X ∈ T (T ∗ M ) and ξ ∈ T (T M ) with T (c)(X ) = T (p)(ξ),\nhhX , ξii = hΘ(X ), J(ξ)ii.\n×\n: T ∗ (T • A) → T ∗ (T A∗ ) is the di\u001beomorphism of the\nIn the next lemma, the map IA\notangents indu ed by the di\u001beomorphism IA .\n\nLemma 4.5\n\n×\nR• = ΘA ◦ T (RA ) ◦ Θ−1\nA ∗ ◦ IA .\n\nWe begin by al ulating R• in terms of (11). Take F ∈ T ∗ (T • A) and ξ ∈ T 2 A\nproje ting to the same point of T A. Then\nProof.\n\n(25)\n\nhR• (F ), ξiT A = hhX , ξiiT 2 M − hF, X iT • A ,\n\n×\n∗ ∗\nwhere X ∈ T (T • A) has the requisite proje tions. Write Φ = Θ−1\nA∗ (IA (F )) ∈ T (T A ). Then\n× −1\n× −1\n) (ΘA∗ (Φ)), X iT • A ,\n) (ΘA∗ (Φ))), ξiT A = hhX , ξiiT 2 M − h(IA\nhR• ((IA\n\nDe\u001cne Ψ = T (IA )−1 (X ) ∈ T 2 (A∗ ). Then the \u001crst term on the RHS is\n\nhhT (IA )(Ψ), ξiiT 2 M =\n\nd\nhIA (Ψt ), ξt iT M\ndt\n\n=\n0\n\nd\nhhΨt , ξt iiT M\ndt\n\n.\n0\n\nwhere Ψt and ξt are urves in T A∗ and T A with tangents Ψ and ξ . Denote this expression\nby hhhΨ, ξiii; this is a pairing of T 2 (A∗ ) and T 2 (A) over T 2 M .\n19\n\n\fK. C. H. Ma kenzie\n\n−1\nThe se ond term on the RHS of (25) is equal to hΘA∗ (Φ), T (IA\n)(X )iT • A . By Lemma\n4.4, this is hhΦ, JA∗ (Ψ)iiT A∗ .\nNow onsider ΘA ◦ T (R). Using 4.4 again,\n\nhΘA (T (R)(Φ)), ξiT A = hhT (R)(Φ), JA (ξ)iiT A =\n\nd\nhR(Φt ), ηt i ,\ndt\n0\n\nwhere Φt is a urve in T ∗ A∗ with tangent Φ and ηt is a urve in T A with tangent JA (ξ). Now\n\nhR(Φt ), ηt i = hhWt , ηt iiT M − hΦt , Wt iA∗\nwhere Wt ∈ T A∗ is any element with the required outline. A areful he king of the outlines\nof the various elements shows that we an take Wt to be an integral urve of JA∗ (Ψ). It is\nthen lear that\nd\nhΦt , Wt iA∗ = hhΦ, JA∗ (Ψ)iiT A∗ .\ndt\n0\nThe result now follows from the next lemma.\n\n2\n\nLemma 4.6\n\nLet A → M and A∗ → M be any dual ve tor bundles and let hhh , iii denote the\npairing of T 2 (A∗ ) and T 2 (A) over T 2 M used in the proof above. Then, for Ψ ∈ T 2 (A∗ ) and\nξ ∈ T 2 (A) proje ting to the same element of T 2 M ,\nhhhJA∗ (Ψ), JA (ξ)iii = hhhΨ, ξiii.\nWrite ξ = ∂s ∂t a(0, 0) for a smooth a(s, t) ∈ A. The notation means that a is\nde\u001cned in a neighbourhood of the origin, and that ξ is the tangent ve tor at 0 to the urve\ns 7→ ∂t a(s, 0) = ∂a\n∂t (s, 0) in T M .\nThe proje tion ondition ensues that we an likewise write Ψ = ∂s ∂t b(0.0) for a smooth\npat h b(s, t) ∈ A∗ with q(a(s, t)) = q∗ (b(s, t)) for all (s, t) near (0, 0). Now\nProof.\n\nhhhΨ, ξiii =\n\nd\nhh∂t a(s, 0), ∂t b(s, 0)ii\nds\n\n=\ns=0\n\n∂2\nha(s, t), b(s, t)i\n∂s∂t\n\nand the result follows from the equality of mixed partials.\n\n(0,0)\n\n2\n\nWe now return to the proof of 4.3. From Lemma 4.5 and (22) we have\n#\n×\nπT#A ◦ R• = JA ◦ T (πA\n◦ RA ) ◦ Θ−1\nA ∗ ◦ IA .\n#\nSin e (A, A∗ ) is a Lie bialgebroid, πA\n◦ RA : T ∗ A∗ → T A is a morphism of Lie algebroids over\n#\na∗ , so T (πA ◦ RA ) is a morphism of the prolongation stru tures over T (a∗ ). Also, sin e IA is\n×\n−1\n.\nis an isomorphism of the otangent Lie algebroids over IA\na Poisson di\u001beomorphism, IA\n∗\n∗\nFor any Poisson manifold, ΘP : T (T P ) → T (T P ) is an isomorphism of Lie algebroids\nover T P from the tangent prolongation of the otangent Lie algebroid stru ture on T ∗ P to\nthe otangent Lie algebroid of the tangent Poisson stru ture [15, 10.3.13℄. We apply this to\nP = A∗ .\n#\nFinally we apply Lemma 4.7(i). Altogether, we have that πT A ◦ R• is a Lie algebroid\nmorphism and this ompletes the proof of Proposition 4.3.\n2\n\n20\n\n\fEhresmann doubles and Drinfel'd doubles\n\nLemma 4.7 (i)\n\nLet A be a Lie algebroid on M and let T 2 A → T 2 M be the iterated prolongation Lie algebroid. Then the anoni al involution JA : T 2 A → T 2 A is a Lie algebroid\nautomorphism over JM .\n(ii) For any Poisson manifold P , the anoni al involution JP is a Poisson di\u001beomorphism,\nwith respe t to the iterated tangent lift Poisson stru ture.\n\n(i) It is su\u001e\n\nient to show that the dual map JA BT 2 M is a Poisson di\u001beomorphism.\nThe dual of\n→\nis T • (T A) → T 2 M and this is isomorphi to T (T • A) → T 2 M under\nthe map I for T A → T M . Composing with T (IA ) we have that T • (T A) → T 2 M is isomorphi\nto T 2 (A∗ ) → T 2 M and with this identi\u001c ation, JA be omes JA∗ : T 2 (A∗ ) → T 2 (A∗ ). The\nresult now follows from (ii).\n(ii) Write J = JP and JT = JT P . We must show that T (J) ◦ πT#2 P = πT#2 P ◦ J × . Using\nthe de\u001cnition of πT#2 P , we have to show that\nProof.\n\nT 2A\n\nT 2M\n\n×\n2 #\n−1\n◦ Θ−1\nT (J) ◦ JT ◦ T (J) ◦ JT ◦ T (J) ◦ T 2 (π # ) ◦ T (Θ)−1 ◦ Θ−1\nT ◦J .\nT = T (π ) ◦ T (Θ)\n\nNow T (J) ◦ JT ◦ T (J) ◦ JT ◦ T (J) = JT . If the oordinates in R3 are t1 , t2 , t3 then T (J)\norresponds to the permutation (2 3) and JT to the permutation (1 2). Using this and the\nnaturality property JT ◦ T 2 (π # ) = T 2 (π # ) ◦ JT ∗ P , we are redu ed to showing that, for any\nmanifold P ,\nJP× ◦ ΘT P ◦ T (ΘP ) = ΘT P ◦ T (ΘP ) ◦ JT ∗ P .\n(26)\nTake ξ ∈ T 2 (T ∗ P ) and ζ ∈ T 3 P with T 2 (c)(ξ) = pY 2 (ζ). Then, using 4.4,\n\nhΘT ◦ T (Θ) ◦ JT ∗ P (ξ), ζi = hhT (Θ) ◦ JT ∗ P (ξ), JT (ζ)ii\nand\n\nhJ × ◦ ΘT ◦ T (Θ)(ξ), ζi = hhT (Θ)(ξ), JT ◦ T (J)(ζ)ii\n\nand equality follows as in Lemma 4.6.\n\n2\nReturning to the proof of 4.1, suppose that A is a Lie algebroid on M and that\nhas a\nLie algebroid stru ture, not a priori related to the stru ture on A. Consider D = T ∗ A with\nthe two otangent Lie algebroid stru tures arising from the Poisson stru tures on A∗ and A,\nand suppose that these stru tures make D a double Lie algebroid.\nThen in parti ular, by Theorem 3.9 the an hor T ∗ A → T A∗ of the horizontal stru ture\nmust be a Lie algebroid morphism over a : A → T M with respe t to the verti al stru tures.\nThe an hor is\nA∗\n\nR\n\nπ #∗\n\n∗\n\nA\nA\nT ∗ A∗ −→\nT A∗\nT ∗ A −→\n\nThat this be a Lie algebroid morphism over a is pre isely the dual form of 3.3.\nThis ompletes the proof of Theorem 4.1.\n\n2\nRe all the Manin triple hara terization of a Lie bialgebra, as given in [14℄: Given a Lie\nbialgebra (g, g∗ ) the ve tor spa e dire t sum d = g ⊕ g∗ has a Lie algebra bra ket de\u001cned\nin terms of the two oadjoint representations; this is the lassi al Drinfel'd double of (g, g∗ ).\nThis bra ket is invariant under the pairing hX + φ, Y + ψi = hψ, Xi + hφ, Y i and both g\nand g∗ are oisotropi subalgebras. Conversely, if a Lie algebra d is a ve tor spa e dire t sum\ng ⊕ h, both of whi h are oisotropi with respe t to an invariant pairing of d with itself, then\nh∼\n= g∗ and (g, h) is a Lie bialgebra, with d as the double.\n21\n\n\fK. C. H. Ma kenzie\n\nThis result provided a hara terization of the notion of Lie bialgebra in terms of a single\nLie algebra stru ture on d, the onditions being expressed in terms of the simple notion of\npairing. It also demonstrated, as a simple onsequen e, that the notion of Lie bialgebra is\nself\u0015dual: (g, g∗ ) is a Lie bialgebra if and only if (g∗ , g) is so.\nFor Lie bialgebroids, Kosmann\u0015S hwarzba h [9℄ gave an elegant proof of self\u0015duality, in\nterms of her riterion that (A, A∗ ) is a Lie bialgebroid if and only if the oboundary of one\nstru ture is a derivation of the S houten bra ket of the other.\nFor a Lie bialgebra (g, g∗ ), the stru ture of the otangent double Lie algebroid T ∗ g ∼\n= g×g∗\n∗\n∗\nequips T g with Lie algebroid stru tures on bases g and g . These are the a tion Lie algebroids\nde\u001cned by the oadjoint a tions of g and g∗ on ea h other. We show in \u009f5 that a double Lie\nalgebroid (D; A, B.M ) for whi h the ore is trivial \u0016 as is the ase for D = T ∗ g \u0016 has a\nthird Lie algebroid stru ture, on base M . In the ase of T ∗ g, M is a point and this third\nstru ture is the Drinfel'd double Lie algebra.\nDespite the di\u001beren es, it seems legitimate to regard Theorem 4.1 as a generalization of\nthe Manin triple theorem, sin e it provides a riterion, in terms of a notion of double, for Lie\nalgebroid stru tures on a pair of dual bundles to onstitute a Lie bialgebroid.\nIn [11℄, Liu, Weinstein and Xu pla e a bra ket stru ture on A ⊕ A∗ , where (A, A∗ ) is a\nLie bialgebroid, whi h is a dire t generalization of the Lie algebra stru ture of the Drinfel'd\ndouble, and they prove a dire t generalization of the Manin triple theorem. This is not a\nLie algebroid stru ture, but a Courant algebroid, a ve tor bundle with a bra ket stru ture in\nwhi h the Ja obi and Leibniz identities do not ne essarily hold. Whereas the otangent double\nhas two simple stru tures whi h intera t in a nontrivial way, the single bra ket stru ture on\nA ⊕ A∗ of [11℄ is less well\u0015behaved but embodies the whole stru ture.\nThe notion of Courant algebroid has been developed in work on Dira stru tures and\ngeneralized omplex geometry. On the other hand, the notion of double Lie algebroid abstra ts\niterated and se ond\u0015order onstru tions in di\u001berential geometry (see parti ularly \u009f6), and\nprovides a general setting for duality phenomena. In parti ular, there is a lear global form\nof the notion of double Lie algebroid.\nAnother important property of the lassi al Drinfel'd double is that g ⊲⊳ g∗ itself has a\nnatural stru ture of Lie bialgebra. A double form of this result will be given in [25℄.\n\n\u009f 5 MATCHED PAIRS AND VACANT DOUBLE LIE ALGEBROIDS\nA brief history of mat hed pairs of Lie algebras was given in the Introdu tion. The orresponding on ept of a mat hed pair of Lie groups [14℄, [28℄ was extended to Lie groupoids\nin [16℄. In [31℄, Mokri di\u001berentiated the twisted automorphism equations of [16℄ to obtain\nonditions on a pair of Lie algebroid representations, of A on B and of B on A, whi h ensure\nthat the dire t sum ve tor bundle A ⊕ B has a Lie algebroid stru ture with A and B as\nsubalgebroids. We quote the following.\n\nDe\u001cnition 5.1 [31, 4.2℄\n\nLet A and B be Lie algebroids on base M , with an hors a and b,\nD(B)\nand σ : B → D(A) be representations of A on the ve tor bundle B and\nand let ρ : A →\nof B on the ve tor bundle A. Then A and B together with ρ and σ form a mat hed pair of\nLie algebroids if equations (1) from the Introdu tion hold.\nThe Lie algebroid D(E) of derivations on E is de\u001cned in \u009f2. The proof of the following\npro eeds along the same lines as the proof for Lie algebras.\n22\n\n\fEhresmann doubles and Drinfel'd doubles\n\nProposition 5.2 [31, 4.3℄ Given a mat hed pair of Lie algebroids, there is a Lie algebroid\nstru ture A ⊲⊳ B on the dire t sum ve tor bundle A ⊕ B , with an hor c(X ⊕ Y ) = a(X) + b(Y )\nand bra ket\n[X1 ⊕ Y1 , X2 ⊕ Y2 ] = {[X1 , X2 ] + σY1 (X2 ) − σY2 (X1 )} ⊕ {[Y1 , Y2 ] + ρX1 (Y2 ) − ρX2 (Y1 )}.\n\nConversely, if A ⊕ B has a Lie algebroid stru ture for whi h A ⊕ 0 and 0 ⊕ B are Lie subalgebroids, then ρ and σ de\u001cned by [X ⊕ 0, 0 ⊕ Y ] = −σY (X) ⊕ ρX (Y ) form a mat hed pair.\nWe now show that mat hed pairs of Lie algebroids orrespond pre isely to double Lie\nalgebroids for whi h the ore is zero.\n\nDe\u001cnition 5.3\n\nA double Lie algebroid (D; A, B; M ) is va ant if the ore is the zero bundle.\n\nEquivalently, a double Lie algebroid is va ant if the ombination of the two proje tions,\nD , qD ) : D → A ×\n(qA\nM B is a di\u001beomorphism. This is a dire t analogue of the de\u001cnition of\nB\nva an y for double Lie groupoids and for L A \u0015groupoids [16, 2.11, 4.10℄.\nConsider a va ant double Lie algebroid (D; A, B; M ). Note that D → A and D → B are\n! B and q ! A. The dual D B A → C ∗ is the Whitney sum A ⊕ B ∗ . The\nthe pullba k bundles qA\nB\nduality between D B A and D B B is\n(27)\n\nhX + ψ, φ + Y i = hψ, Y i − hφ, Xi.\n\nD : D → B is a morphism of Lie algebroids over\nThe horizontal bundle proje tion qB\nqA : A → M and sin e it is a \u001cbrewise surje tion, it de\u001cnes an a tion of B on qA as in\n! B and this\n[15, \u009f4.1℄. Namely, ea h se tion Y of B indu es the pullba k se tion 1 ⊗ Y of qA\nindu es a ve tor \u001celd η(Y ) = ∆A (1 ⊗ Y ) on A, where ∆A : D → T A is the an hor of the\nverti al stru ture. Sin e the an hor is a morphism of double ve tor bundles, η(Y ) is linear\nover the ve tor \u001celd b(Y ) on M , in the sense of [15, \u009f3.4℄; that is, η(Y ) is a ve tor bundle\n(∗)\nmorphism A → T A over b(Y ) : M → T M . It follows that η(Y ) de\u001cnes derivations σY on\nA∗ and σY on A by\n\nη(Y )(lφ ) = lσ(∗) (φ) ,\nY\n\n(∗)\n\nhφ, σY (X)i = b(Y )hφ, Xi − hσY (φ), Xi\n\n(28)\n\nD\nwhere φ ∈ ΓA∗ , X ∈ ΓA, and lφ denotes the fun tion A → R, X 7→ hφ(qA X), Xi. Sin e qA\nis a Lie algebroid morphism, it follows that σ is a representation of B on the ve tor bundle\nA, with ontragredient representation σ (∗) . We will use both σ and σ (∗) in what follows.\nD is a morphism of Lie algebroids over q and for ea h X ∈ ΓA we obtain a\nLikewise, qA\nB\n(∗)\nlinear ve tor \u001celd ξ(X) ∈ X (B) over a(X). We de\u001cne derivations ρX on B ∗ and ρX on B by\n\nξ(X)(lψ ) = lρ(∗) (ψ) ,\nX\n\n(∗)\n\nhψ, ρX (Y )i = a(X)hψ, Y i − hρX (ψ), Y i.\n\n(29)\n\nAgain, ρ(∗) and ρ are representations of A.\nThe two Lie algebroid stru tures on D are a tion Lie algebroids determined by the a tions\nY 7→ η(Y ) and X 7→ ξ(X) [15, \u009f4.1℄. It therefore follows that the dual Poisson stru tures are\nsemi\u0015dire t, but we need to prove this dire tly. We \u001crst al ulate the Lie algebroid stru ture\non A∗ ⊕ B indu ed from that on D → A.\n23\n\n\fK. C. H. Ma kenzie\n\nLemma 5.4\n\nThe Lie algebroid stru ture on D B A B C ∗ = A∗ ⊕ B indu ed from the double\nLie algebroid stru ture has an hor e(φ ⊕ Y ) = b(Y ) and bra ket\n(∗)\n\n(∗)\n\n(30)\n\n[φ1 ⊕ Y1 , φ2 ⊕ Y2 ] = {σY1 (φ2 ) − σY2 (φ1 )} ⊕ [Y1 , Y2 ].\n\nThe Lie algebroid stru ture on D BA = A⊕ B ∗ indu ed from the double Lie algebroid stru ture\nhas an hor e∗ (X ⊕ ψ) = −a(X) and bra ket\n(∗)\n\n(∗)\n\n(31)\n\n[X1 ⊕ ψ1 , X2 ⊕ ψ2 ] = [X2 , X1 ] ⊕ {ρX2 (ψ1 ) − ρX1 (ψ2 )}.\n\nWe apply equations (19). Firstly, a linear se tion (ξ, Y ) of D → A is ne essarily a\npullba k se tion ξ(X) = X ⊕ Y (m) for X ∈ Am . From the de\u001cnition (13) of ξ ⊓ we \u001cnd that\nξ ⊓ ∈ Γ(A∗ ⊕ B) is\n∗\nξ ⊓ (m) = 0A\nm ⊕ Y (m).\nProof.\n\nIt follows from the \u001crst equation in (19) that [0 ⊕ Y1 , 0 ⊕ Y2 )] = 0 ⊕ [Y1 , Y2 ] for Y1 , Y2 ∈ ΓB.\nNext, φ ∈ ΓA∗ de\u001cnes φ ∈ Γ(A∗ ⊕ B) where φ(m) = φ(m) ⊕ 0B\nm . It follows from (19) that\n[φ1 ⊕ 0, φ2 ⊕ 0] = 0 ⊕ 0.\nThe se ond equation in (19) is [ξ ⊓ , φ] = Λξ (φ). Comparing (17) with (28), we have\n(∗)\nΛ = σ (∗) . So [0 ⊕ Y, φ ⊕ 0] = σY (φ) ⊕ 0 and this ompletes the proof of (30).\nFor (31) apply (19) to D BB BC ∗ = A ⊕ B ∗ and transport the stru ture to D BA = A ⊕ B ∗\nby ZA (X, ψ) = (−X, ψ).\n2\nThus A∗ ⊕ B is the semi\u0015dire t produ t A∗ ⋊ B of B with the ve tor bundle A∗ with\nrespe t to σ (∗) . (This is the simple semi\u0015dire t produ t of two Lie algebroids on the same\nbase, as in [15, p.270℄.) We denote the stru ture on A ⊕ B ∗ by Aop ⋉ B ∗ .\n\nTheorem 5.5 Let (D; A, B; M ) be a va ant double Lie algebroid. Then the two Lie algebroid\nstru tures on D are a tion Lie algebroids orresponding to a tions whi h de\u001cne representations\nρ, of A on B , and σ , of B on A, with respe t to whi h A and B form a mat hed pair.\nConversely, let A and B be a mat hed pair of Lie algebroids with respe t to representations\nρ and σ . Then the a tion of A on qB indu ed by ρ and the a tion of B on qA indu ed by σ\nde\u001cne Lie algebroid stru tures on D = A ×M B with respe t to whi h (D; A, B; M ) is a va ant\ndouble Lie algebroid.\nWe \u001crst need to prove the three equations (1). We start by applying the bialgebroid\nondition to E = A∗ ⋊ B and E ∗ = Aop ⋉ B ∗ . We use the dual form of (20), whi h in this\nase is :\n\nProof.\n\n∗\n\n∗\n\ndE [φ1 ⊕ Y1 , φ2 ⊕ Y2 ] = [dE (φ1 ⊕ Y1 ), φ2 ⊕ Y2 ] + [φ1 ⊕ Y1 , dE∗ (φ2 ⊕ Y2 )]\n\n(32)\n\nfor all φ1 ⊕ Y1 , φ2 ⊕ Y2 ∈ ΓE . By repla ing φ2 ⊕ Y2 by f φ2 ⊕ f Y2 , for f ∈ C ∞ (M ), and\nexpanding out, we \u001cnd, as in [15, p.449℄, that\n∗\n\n∗\n\ndE [φ ⊕ Y, f ] = [dE (φ ⊕ Y ), f ] + [φ ⊕ Y, dE∗ (f )].\n\n(33)\n(∗)\n\nNow dE∗ (f ) = −dA f ⊕ 0. So, for the last term, we have [φ ⊕ Y, dE∗ (f )] = −σY (dA f ) ⊕ 0,\nand pairing this with any X ⊕ ψ ∈ ΓE ∗ . we have\n\nh[φ ⊕ Y, dE∗ (f )], X ⊕ ψi = a(σY (X))(f ) − b(Y )(a(X)(f )).\n24\n\n\fEhresmann doubles and Drinfel'd doubles\n\nOn the LHS, [φ ⊕ Y, f ] = e(φ ⊕ Y )(f ) = b(Y )(f ) and so, pairing with X ⊕ ψ gives\n∗\n\nhdE (b(Y )(f )), X ⊕ ψi = e∗ (X ⊕ ψ)(b(Y )(f )) = −a(X)(b(Y )(f )).\nConsider the \u001crst term on the RHS of (33). For any ξ ∈ ΓΛ2 (E) we have [ξ, f ] = −ιdf (ξ),\n[15, 12.1.4℄, so pairing with X ⊕ ψ gives\n\nh[ξ, f ], X ⊕ ψi = −ξ(df, X ⊕ ψ).\nWe need the following lemma, whi h is a straightforward al ulation.\n\nLemma 5.6\n∗\n\ndE (φ ⊕ Y )(X1 ⊕ ψ1 , X2 ⊕ ψ2 ) = −(dA φ)(X1 , X2 ) + hψ1 , ρX2 (Y )i − hψ2 , ρX1 (Y )i.\n2\nFor the \u001crst term on the RHS of (33). we therefore have\n∗\n\n∗\n\nh[dE (φ ⊕ Y ), f ], X ⊕ ψi = −dE (φ ⊕ Y )(dE f, X ⊕ ψ) =\n− hdB f, ρX (Y )i = −b(ρX (Y ))(f ).\nusing dE f = 0 ⊕ dB f. Putting these together, (33) be omes\n\n−a(X)(b(Y )(f )) = −b(ρX (Y ))(f ) + a(σY (X))(f ) − b(Y )(a(X)(f )),\nwhi h proves the third equation in (1).\nNow return to the bialgebroid equation (32). Set φ1 = φ2 = 0, so that we have\n∗\n\n∗\n\ndE [0 ⊕ Y1 , 0 ⊕ Y2 ] = [dE (0 ⊕ Y1 ), 0 ⊕ Y2 ] + [0 ⊕ Y1 , dE∗ (0 ⊕ Y2 )]\n\n(34)\n\nand evaluate this at (0 ⊕ ψ) ∧ (X ⊕ 0). The LHS of (34) is easily seen to be hψ, ρX [Y2 , Y1 ]i.\nOn the RHS, onsider the se ond term \u001crst. Writing the bra ket as the Lie derivative of\n∗\nthe multise tion dE (0 ⊕ Y2 ) with respe t to 0 ⊕ Y1 , we have\n∗\n\nhL0⊕Y1 (dE (0 ⊕ Y2 )), (0 ⊕ ψ) ∧ (X ⊕ 0)i\n∗\n\n∗\n\n= L0⊕Y1 hdE (0 ⊕ Y2 ), (0 ⊕ ψ) ∧ (X ⊕ 0)i − hdE (0 ⊕ Y2 ), L0⊕Y1 ((0 ⊕ ψ) ∧ (X ⊕ 0))i\n\n(35)\n\n∗\n\nIn the \u001crst term, dE (0 ⊕ Y2 )(0 ⊕ ψ, X ⊕ 0) = hψ, ρX (Y2 )i, and e(0 ⊕ Y1 ) = b(Y1 ), so we have\nb(Y1 )hψ, ρX (Y2 )i.\nFor the se ond term, note \u001crst that L0⊕Y (0⊕ψ) = 0⊕LY (ψ) and L0⊕Y (X⊕0) = σY (X)⊕0.\nUsing these, the se ond term on the RHS of (35) is\n\nhLY1 (ψ), ρX (Y2 )i + hψ, ρσY1 (X) (Y2 )i.\nCal ulating the \u001crst term on the RHS of (34) in the same way, we have\n\nhψ, ρX [Y2 , Y1 ]i = −b(Y2 )hψ, ρX (Y1 )i + hLY2 (ψ), ρX (Y1 )i + hψ, ρσY2 (X) (Y1 )i\n+ b(Y1 )hψ, ρX (Y2 )i − hLY1 (ψ), ρX (Y2 )i − hψ, ρσY1 (X) (Y2 )i.\n25\n\n\fK. C. H. Ma kenzie\n\nFinally, b(Y1 )hψ, ρX (Y2 )i − hLY1 (ψ), ρX (Y2 )i = hψ, [Y1 , ρX (Y2 )]i and we have the \u001crst equation of (1). The se ond equation is proved in the same way.\nNow onsider the se ond part of 5.5. It is straightforward to prove that (A×M B; A, B; M ),\nwith the a tion Lie algebroid stru tures on A×M B , is an L A \u0015ve tor bundle both horizontally\nand verti ally. We must verify the bialgebroid ondition (32).\nFirstly, (34) at (0 ⊕ ψ) ∧ (X ⊕ 0) an be proved by reversing the argument above. The ase\nof any (X1 ⊕ψ1 , X2 ⊕ψ2 ) = (X1 ⊕0, 0⊕ψ2 )+(0⊕ψ1 , X2 ⊕0) follows from the skew\u0015symmetry\nof all the terms. Thus (34) holds.\nFor (32) with Y1 = Y2 = 0 and any arguments, it is straightforward to see that all terms\nare identi ally zero. It remains to onsider (32) with φ1 = 0, Y2 = 0. For the LHS we have\n(∗)\n\n∗\n\ndE [0 ⊕ Y, φ ⊕ 0] = −dA (σY (φ)) ⊕ 0.\n(∗)\n\nExpanding out −dA (σY (φ))(X1 , X2 ) we have\n\n− a(X1 )b(Y )hφ, X2 i + a(X1 )hφ, σY (X2 )i + a(X2 )b(Y )hφ, X1 i\n− a(X2 )hφ, σY (X1 )i + b(Y )hφ, [X1 , X2 ]i − hφ, σY ([X1 , X2 ])i. (36)\n(∗)\n\n∗\n\nOn the RHS the se ond term is [0⊕Y, dE (φ⊕0)] = [0⊕Y, −dA φ⊕0] = −σY (dA φ)⊕0, using\n(∗)\n(∗)\n5.6 and (30), and extending σY to the exterior square. Expanding out h−σY (dA φ), X1 ∧X2 i,\nwe have\n\n− b(Y )a(X1 )hφ, X2 i + b(Y )a(X2 )hφ, X1 i + b(Y )hφ, [X1 , X2 ]i\n+ a(σY (X1 ))hφ, X2 i − a(X2 )hφ, σY (X1 )i − hφ, [σY (X1 ), X2 ]i\n+ a(X1 )hφ, σY (X2 )i − a(σY (X2 ))hφ, X1 i − hφ, [X1 , σY (X2 )]i. (37)\nThe \u001crst term on the RHS, evaluated at F1 ∧ F2 ∈ ΓΛ2 (E ∗ ), is\n∗\n\n∗\n\nh[dE (0 ⊕ Y ), φ ⊕ 0], F1 ∧ F2 i = h−Lφ⊕0 (dE (0 ⊕ Y )), F1 ∧ F2 i\n∗\n\n= hdE (0 ⊕ Y ), Lφ⊕0 (F1 ∧ F2 )i,\n\n(38)\n\nsin e e(φ ⊕ 0) = 0. Now Lφ⊕0 (X ⊕ ψ) = 0 ⊕ θφ,X where θφ,X ∈ B ∗ is the element su h that\n(∗)\n\nhZ, θφ,X i = hσZ (φ), Xi\nfor all Z ∈ B. Put Fi = Xi ⊕ ψi in (38) and write θi = θφ,Xi . Then (38) be omes\n∗\n\n∗\n\nhdE (0 ⊕ Y ), (0 ⊕ θ1 ) ∧ (X2 ⊕ ψ2 )i + hdE (0 ⊕ Y ), (X1 ⊕ ψ1 ) ∧ (0 ⊕ θ2 )i\n(∗)\n\n(∗)\n\n= a(X2 )hY, θ1 i − h0 ⊕ Y, 0 ⊕ ρX2 (θ1 )i − a(X1 )hY, θ2 i + h0 ⊕ Y, 0 ⊕ ρX1 (θ2 )i\n= b(ρX2 (Y ))hφ, X1 i − hφ, σρX2 (Y ) (X1 )i − b(ρX1 (Y ))hφ, X2 i + hφ, σρX1 (Y ) (X2 )i.\nAdding this to (37) gives (36), using the \u001crst and last equations of (1). The proof of\nTheorem 5.5 is omplete.\n2\nIn the pro ess we have also proved the following result.\n26\n\n\fEhresmann doubles and Drinfel'd doubles\n\nCorollary 5.7\n\nLet A and B be Lie algebroids on the same base M , and let ρ : A → D(B)\nand σ : B → D(A) be representations on the ve tor bundles underlying B and A.\nThen A, B , ρ, σ form a mat hed pair if and only if (A∗ ⋊ B, Aop ⋉ B ∗ ), with the Lie\nalgebroid stru tures des ribed in 5.4, is a Lie bialgebroid.\nThus the three mat hed pair equations in (1) are embodied in the bialgebroid equation\n(32). Theorem 5.5 a tually shows the equivalen e of three formulations: a va ant double Lie\nalgebroid stru ture with sides A and B is equivalent to a mat hed pair stru ture on (A, B),\nwhi h in turn is equivalent to a Lie bialgebroid stru ture on (A∗ ⋊ B, Aop ⋉ B ∗ ) of the type\nin 5.4. We thus have a diagrammati hara terization of mat hed pairs of Lie algebroids:\nre all that the hara terization 3.3 of a Lie bialgebroid is formulated entirely in terms of the\nPoisson tensor and the anoni al isomorphism R. Thus 5.5 provides a de\u001cnition of mat hed\npair whi h an be formulated more generally in a ategory possessing pullba ks and suitable\nadditive stru ture. The orresponding hara terization of mat hed pairs of Lie groupoids in\nterms of va ant double Lie groupoids is in [16, \u009f2℄.\nGiven a va ant double Lie algebroid (D; A, B; M ) the Lie algebroid stru ture A ⊲⊳ B on\nD → M may be alled a diagonal stru ture by analogy with the groupoid ase.\nForms of Corollary 5.7 in the Lie algebra ase have been found by Majid [29, \u009f8.3℄ and in\nthe setting of Lie\u0015Rinehart algebras by Huebs hmann [7℄.\nIn the ase of a Lie bialgebra (g, g∗ ), the Lie bialgebroid asso iated to the va ant double\nLie algebroid is (g ⊕ g0 , g∗ ⊕ g∗0 ) where the subs ripts denote the abelianizations. This is of\nourse onsistent with 4.1 in the bialgebra ase \u0016 whi h is both a bialgebroid and a mat hed\npair.\n\n\u009f 6 THE DOUBLE LIE ALGEBROID OF A DOUBLE LIE GROUPOID\nDe\u001cnition 3.1 of a double Lie algebroid arose from work on the double Lie algebroid of a\ndouble Lie groupoid, as onstru ted in [16℄, [20℄. Some of what is required in order to verify\nthat the double Lie algebroid of a double Lie groupoid does satisfy 3.1 has been given in [18℄,\nand we re all the details brie\u001dy.\nFirst we re all the notion of double Lie groupoid (see [16℄ and referen es given there).\nA double Lie groupoid onsists of a manifold S equipped with two Lie groupoid stru tures\non bases H and V , ea h of whi h is a Lie groupoid on base M , su h that the stru ture\nmaps (sour e, target, multipli ation, identity, inversion) of ea h groupoid stru ture on S\nare morphisms with respe t to the other, and su h that the double sour e map α2 : S →\nH ×M V, s 7→ (e\nαV (s), α\neH (s)) is a surje tive submersion; see Figure 7(a). One should think\nof elements of S as squares, the horizontal edges of whi h ome from H , the verti al edges\nfrom V , and the orner points from M .\nConsider a double Lie groupoid (S; H, V ; M ) as in Figure 7(a). Applying the Lie fun tor\nto the verti al stru ture S ⇒ H gives a Lie algebroid AV S → H whi h also has a groupoid\nstru ture over AV obtained by applying the Lie fun tor to the stru ture maps of S ⇒ V ;\nthis is the verti al L A \u0015groupoid of S [16, \u009f4℄, as in Figure 7(b). We re all the notion of\nL A \u0015groupoid from [16℄.\n\nDe\u001cnition 6.1\n\nAn L A \u0015groupoid is a manifold Ω equipped with a Lie groupoid stru ture on\na base A, whi h is a Lie algebroid on a base M , and a Lie algebroid stru ture on a base G,\n27\n\n\fK. C. H. Ma kenzie\n\nα\neH , βeH\n\nS\n\nA(e\nαH ), A(βeH )\n\n// V\n\nα\neV , βeV\n\nαV , βV\n\n\u000f \u000f\n\nH\n\nαH , βH\n\n(a)\n\n\u000f \u000f\n// M\n\n// AV\n\nAV S\n\nqV\n\nqeV\n\nA2 S\n\n/ AV\n\nA(e\nqV )\n\n\u000f\n// M\n\n\u000f\n\nH\n\nq̇H\n\n(b)\n\n\u000f\n\nAH\n\nqH\n\n\u000f\n/M\n\n( )\n\nFigure 7.\n\nwhi h is a Lie groupoid on M , su h that the groupoid stru ture maps (sour e, target, identity,\ndivision) are morphisms of Lie algebroids, and the map Ω → G ×M A whi h ombines the\nbundle proje tion and the Lie groupoid sour e, is a surje tive submersion.\nThe Lie algebroid of AV S ⇒ AV is denoted A2 S ; there is a double ve tor bundle stru ture (A2 S; AH, AV ; M ) obtained by applying A to the ve tor bundle stru ture of AV S → H\n[20℄; see Figure 7( ). Reversing the order of these operations, one de\u001cnes \u001crst the horizontal\nL A \u0015groupoid (AH S; AH, V ; M ) and then takes the Lie algebroid A2 S = A(AH S). The\nanoni al involution JS : T 2 S → T 2 S then restri ts to an isomorphism of double ve tor bundles JeS : A2 S → A2 S and allows the Lie algebroid stru ture on A2 S → AV to be transported\nto A2 S → AV . Thus A2 S is a double ve tor bundle equipped with four Lie algebroid stru tures; in [20℄ we alled this the double Lie algebroid of S . The ore of both double ve tor\nbundles A2 S and A2 S is AK , the Lie algebroid of the ore groupoid K ⇒ M of S [20, 1.6℄.\n\nTheorem 6.2\n\nWith the stru tures just de\u001cned, (A2 S; AH, AV ; M ) is a double Lie algebroid.\n\nProof. Write D = A2 S . The stru ture maps for the horizontal ve tor bundle A2 S → AV are\nobtained by applying the Lie fun tor to the stru ture maps of AH S → V and are therefore Lie\nalgebroid morphisms with respe t to the verti al Lie algebroid stru tures. The orresponding\nstatement is true for the verti al ve tor bundle A2 S → AH and this is transported by JeS to\nA2 S → AH . Thus the \u001crst ondition of 3.1 is satis\u001ced.\nNow onsider the bialgebroid ondition. We \u001crst need to identify the Lie algebroid stru tures on A2 S B AH B A∗ K and A2 S B AV B A∗ K . From [18℄ we know that A∗V S ⇒ A∗ K is\na Poisson groupoid, and therefore (A(A∗V S), A∗ (A∗V S)) is a Lie bialgebroid. To relate these\nstru tures, we need to re all the duality of V B \u0015groupoids.\nConsider any V B \u0015groupoid as in Figure 8(a), with ore ve tor bundle L → M . Taking the\ndual in the sense of V B \u0015groupoids [32℄, [15, \u009f11.2℄, we have the V B \u0015groupoid (Ω∗ ; G, L∗ ; M )\nas in Figure 8(b).\nThe pairing of Ω and Ω∗ is a Lie groupoid morphism Ω×G Ω∗ → R and the indu ed pairing\nhh , ii = A(h , i) of the Lie algebroids is also non\u0015degenerate and respe ts the double ve tor\nbundle stru tures [15, \u009f11.5℄. It therefore indu es an isomorphism of double ve tor bundles\n\nIΩ : A(Ω∗ ) → AΩ B AG\nwhi h preserves both side bundles and the ore. Write IeV and IeH for this map when Ω = AV S\nand Ω = AH S. Composing the inverse of JeS B AH with IeV gives an isomorphism\n\ne H = (JeS B AH)−1 ◦ IeV : A(A∗V S) → A2 S B AH.\nΘ\n28\n\n(39)\n\n\fEhresmann doubles and Drinfel'd doubles\n\nΩ\n\n// A\n\nΩ∗\n\n// L ∗\n\nA(Ω∗ )\n\n/ L∗\n\n\u000f\n\n\u000f\n// M\n\nG\n\n\u000f\n\n\u000f\n// M\n\nAG\n\n\u000f\n\n\u000f\n/M\n\nG\n(a)\n\n(b)\n\n( )\n\nFigure 8.\n\ne H BA∗ K : A2 S BAH BA∗ K → A∗ (A∗ S) and to prove that\nDualizing this over A∗ K we get Θ\nV\ne H is a Poisson map.\nthis is an isomorphism of Lie algebroids it it su\u001e ient to prove that Θ\nOn the other hand, onsider IeH : A(A∗H S) → A2 S B AV . Dualizing this over A∗ K we\nobtain\nIeH B A∗ K : A2 S B AV B A∗ K → A∗ (A∗H S).\n\nAgain, to show that this is an isomorphism of Lie algebroids, it is su\u001e ient to show that IeH\nis a Poisson map. However the Poisson stru ture on A2 S BAV is the dual of the Lie algebroid\nstru ture on A2 S → AH and this is obtained from the Lie algebroid stru ture on A2 S → AH ,\ne V , de\u001cned by\ntransported by JeS . So we a tually need to show that Θ\n\ne V = (JeS B AV ) ◦ IeH : A(A∗ S) → A2 S B AV\nΘ\nH\n\n(40)\n\nis a Poisson map. The proof is therefore redu ed to the following.\n\nProposition 6.3\n\ne H : A(A∗ S) → A2 S B AH is a Poisson map with respe t to the\nThe map Θ\nV\n∗\nPoisson stru ture on A(AV S) indu ed from the Poisson stru ture on A∗V S whi h is dual to\nthe Lie algebroid AV S → H , and the Poisson stru ture on A2 S BAH dual to the Lie algebroid\nA2 S → AH .\ne V : A(A∗ S) → A2 S BAV is a Poisson map with respe t to the Poisson stru ture\nThe map Θ\nH\non A(A∗H S) indu ed from the Poisson stru ture on A∗H S whi h is dual to the Lie algebroid\nAH S → V , and the Poisson stru ture on A2 S B AV dual to the Lie algebroid A2 S → AV.\nProof.\n\nWe will dedu e these from the ommutativity of Figures 9(a) and (b).\n\nA∗ (A∗H S)\n\neH\nR\n\nA∗ (A∗V S)\n\n/ A S B AH\n2\ns9\ns\ns\ns\nss\nss\ns\nΛH\ns\nJeS BAH\ns e\nss Θ\nH\ns\ns\n\u000f ss\n\u000f\n∗\n/ A2 S B AH\nA(A S)\nV\n\neV\nR\n\n/ A2 S B AV\n9 O\nss\nss\ns\ns\nss\nΛV\nss\nJeS BAV\ns\neV\nss Θ\ns\ns\n\u000f ss\n∗\n/ A S B AV\nA(A S)\nH\n\nIeV\n\n(a)\n\nIeH\n\n2\n\n(b)\nFigure 9.\n\nIn turn we will dedu e these diagrams from the ommutative diagram in Figure 10(a),\nwhi h is valid for any manifold S [15, p.442℄. Here (δν)# is the map from forms to \u001celds\n29\n\n\fK. C. H. Ma kenzie\n\nindu ed by the anoni al symple ti stru ture δν on T ∗ S . The lower right triangle is the\nde\u001cnition of ΘS and the ommutativity of the upper triangle is proved in [15, 9.6.7℄.\n\nT ∗T ∗S\n\nRT S\n\n/ T ∗T S\nv:\nv\nvv\nv\nvv\nJS∗\n(δν)#\nvvΘ\nv\nS\nv\nv\nv\n\u000f vv\n\u000f\n∗\n/ T •T S\nTT S\n\n(δν)#\n\nT ∗T ∗S\n\n\u000f \u000f\n\nA∗V T ∗ S\n\nIT S\n\na∗\n\n(a)\n\n/ T T ∗S\n\n\u000f \u000f\n/ T A∗ S\nV\n\n(b)\nFigure 10.\n\nFor any V B \u0015groupoid (Ω; G, A; M ) there is a anoni al isomorphism of double ve tor\nbundles RΩ : A∗ Ω∗ → A∗ Ω whi h preserves the side bundles A and L∗ and indu es −id on\neV and R\neH in Figure 9 are RΩ for Ω = A∗ S and\nthe ores A∗ G [15, 11.5.13℄. The maps R\nV\n∗\nΩ = AH S .\nThe maps ΛH and ΛV are the maps denoted DH and DV in [18, \u009f3℄. We re all the\nde\u001cnition.\nThe otangent groupoid of the groupoid S ⇒ H is T ∗ S ⇒ A∗V S . This is a symple ti\ngroupoid and so the indu ed map (δν)# : T ∗ T ∗ S → T T ∗ S is an isomorphism of Lie groupoids\nas shown in Figure 10(b), where a∗ denotes the an hor for the Lie algebroid stru ture on\nA∗V T ∗ S → A∗V S.\n\nA∗V T ∗ S\n\n\u000f\n\n// A∗ T ∗ K\n\nT A∗V S\n\n\u000f\n\nA∗V S\n\n//\n\nA∗V S\n\nA∗ K\n\n\u000f\n\n// T A∗ K\n\nA∗V T S\n\n\u000f\n\nA∗V S\n\n//\n\n(a)\n\nA∗ K\n\n(b)\n\n//\n\n\u000f\n\nA∗ T K\n\n//\n\n\u000f\n\nA∗ K\n\n( )\n\nFigure 11.\nThis a∗ is itself a morphism of double stru tures (indeed, of triple stru tures); the domain\nand target are shown in Figures 11(a) and (b). The V B \u0015groupoid (a) arises by taking the\nverti al Lie algebroid of the double Lie groupoid (T ∗ S; A∗V S, A∗H S; A∗ K) and then dualizing;\nit has ore A∗ (A∗H S). The V B \u0015groupoid (b) is the tangent of A∗V S ⇒ A∗ K and so has ore\nA(A∗V S). We de\u001cne ΛH to be the ore map of a∗ . The de\u001cnition of ΛV is similar.\nBoth RT S and ΘS are also groupoid morphisms. For any V B \u0015groupoid (Ω; G, A; M ), RΩ\nis a groupoid morphism over RΩ : A∗ Ω∗ → A∗ Ω [15, 11.5.14℄. In parti ular, RT S is a Lie\ngroupoid morphism over RT S/T H : A∗V T ∗ S → A∗V T S where the subs ript indi ates that R\nrefers to the V B \u0015groupoid (T S; T H, S; H).\nSimilarly, ΘS is a groupoid morphism over θS/H : T A∗V S → A∗V T S [15, 11.5.11℄. From\nthe ommutativity of Figure 10(a), it follows that\n\nθS/H ◦ a∗ = RT S/T H .\n30\n\n\fEhresmann doubles and Drinfel'd doubles\n\nIt further follows that the ore maps of θS/H , a∗ and RT S/T H ommute. The ore map of a∗\nis ΛH by de\u001cnition. To see the ore of Figure 11( ), onsider the triple stru ture in Figure\n12(a). The ore of the top fa e here is AV AH S = A2 S and the ore of the bottom fa e is AH .\nTaking the dual of AV T S over T H produ es the triple stru ture shown in Figure 12(b). The\nbundle A2 S → AH of the top and bottom ores of (a) is parallel to the axis of dualization and\nso the bundle of top and bottom ores of (b) is A2 S B AH → AH . The pro ess of dualizing\na triple ve tor bundle is des ribed in detail in [23℄ and the modi\u001c ations to take a ount of\ngroupoid stru tures are straightforward.\n\nAV T SK\n\nKKK\nKK%\n\n//\n\n\u000f\n\nT H LL\nLLL\nLL& \u000f\nH\n\nIII\nIII\nI$\n\nHH\nHH\nH$\n//\nAV\n\nAV S\n\n//\n\nA∗V T S\n\nAT VH\n\n\u000f\n// T M J\nJJJ\nJJ \u000f\n$\n// M\n\nIII\nIII\nI$\n// A∗ K\n\nA∗V S\n\n\u000f\n\n//\n\nT H KK\n\nKKK\nKKK\n% \u000f\n\nH\n\n(a)\n\nA∗ T KI\n\n\u000f\n\nT M KK\n\nKKK\nKKK\n% \u000f\n// M\n\n(b)\nFigure 12.\n\neH and the ore map of θS/H is\nIt is routine to verify that the ore map of RT S/T H is R\ne H . This proves the ommutativity of the upper triangle in Figure 9(a). The proof for (b) is\nΘ\nsimilar.\nNow RT S : T ∗ T ∗ S → T ∗ T S is an antisymple tomorphism and so RT S/T H is anti\u0015Poisson\n[15, 11.5.16℄. Likewise (δν)# : T ∗ T ∗ S → T T ∗ S is an antisymple tomorphism and so θS/H\nis anti\u0015Poisson. It follows that the ore maps are also anti\u0015Poisson, and so ΘH is a Poisson\nmap. The ase of ΘV follows in the same way. This on ludes the proof of Proposition 6.3\nand with it the proof of Theorem 6.2.\n2\nIt is also possible to prove that for any L A \u0015groupoid (Ω; G, A; M ) applying the Lie\nfun tor yields a double Lie algebroid (AΩ; AG, A; M ). In this ase there is no version of the\nanoni al involution J and it is ne essary to work with prolonged Lie algebroid stru tures;\nsee [20, 3.3℄.\nSeveral examples of the double Lie algebroid of spe i\u001c double Lie groupoids are given in\n[20, \u009f4℄. We on lude by noting three other examples.\n\nExample 6.4\n\nTake S to be the double groupoid (M 4 ; M ×M, M ×M ; M ) in whi h a quadruple of points is regarded as de\u001cning a square by its four verti es. Then A2 S is the double tane H redu es to ΘM . The asso iated Lie bialgebroid is (T ∗ T ∗ M, T T ∗ M )\ngent bundle T 2 M and Θ\n∗\non base T M with its standard symple ti stru ture.\n\nExample 6.5\n\nAn a\u001enoid W [37℄ on a manifold M may be regarded as a va ant double Lie\nsubgroupoid of M 4 in the previous example, su h that both side groupoids H and V are the\ngraphs of simple foliations de\u001cned by surje tive submersions π1 : M → Q1 and π2 : M → Q2\n31\n\n\fK. C. H. Ma kenzie\n\n[16, \u009f3℄. The orresponding double Lie algebroid was al ulated dire tly in [19℄ to be a double\nLie subalgebroid (A2 W ; T π1 M, T π2 M ; M ) of T 2 M with bra kets de\u001cned by a pair of onjugate\n\u001dat partial onne tions on M adapted to the two foliations. The Lie bialgebroid in this ase\nis (T π1 M ⋉ (T π2 M )∗ , (T π1 M )∗ ⋊ T π2 M ) where the semi\u0015dire t stru tures are also de\u001cned by\nthe onne tions.\n\nExample 6.6\n\nLet (S; H, V ; M ) be a double Lie groupoid and write D = A2 S . Consider the\notangent double groupoid (T ∗ S; A∗V S, A∗H S; A∗ K). The double Lie algebroid of T ∗ S an be\nidenti\u001ced anoni ally with (T ∗ D; D B A(A∗V S), D B A(A∗H S); A∗ K), the otangent double of\nD as shown in the top fa e of Figure 3(a).\n\nReferen es\n[1℄ A. L. Besse. Manifolds all of whose Geodesi s are Closed, volume 93 of Ergebnisse des\nMathematik und ihrer Grenzgebiete. Springer\u0015Verlag, 1978.\n[2℄ V. Chari and A. Pressley. A Guide to Quantum Groups. Cambridge University Press,\nCambridge, 1994.\n[3℄ T. J. Courant. Tangent Dira stru tures. J. Phys. A, 23:5153\u00155160, 1990.\n[4℄ V. G. Drinfel'd. Quantum groups. In A. M. Gleason, editor, Pro eedings of the International Congress of Mathemati ians, Berkeley, 1986, pages 798\u0015820. Ameri an Mathemati al So iety, Providen e, R. I., 1987.\n[5℄ V. G. Drinfel'd. On Poisson homogeneous spa es of Poisson\u0015Lie groups. Theo. Math.\nPhys., 95(2):226\u0015227, 1993.\n[6℄ C. Ehresmann. Catégories et Stru tures. Dunod, 1965.\n[7℄ J. Huebs hmann. Di\u001berential Batalin\u0015Vilkovisky algebras arising from twilled Lie\u0015\nRinehart algebras. In Poisson geometry (Warsaw, 1998), pages 87\u0015102. Polish A ad.\nS i., Warsaw, 2000.\n[8℄ K. Konie zna and P. Urba«ski. Double ve tor bundles and duality. Ar h. Math. (Brno),\n35(1):59\u001595, 1999.\n[9℄ Y. Kosmann−S hwarzba h. Exa t Gerstenhaber algebras and Lie bialgebroids. A ta Appl.\nMath., 41:153\u0015165, 1995.\n[10℄ Y. Kosmann−S hwarzba h and F. Magri. Poisson\u0015Lie groups and omplete integrability.\nI. Drinfel′ d bialgebras, dual extensions and their anoni al representations. Ann. Inst.\nH. Poin aré Phys. Théor., 49(4):433\u0015460, 1988.\n[11℄ Z.\u0015J. Liu, A. Weinstein, and Ping Xu. Manin triples for Lie bialgebroids. J. Di\u001berential\nGeom., 45:547\u0015574, 1997.\n[12℄ J.\u0015H. Lu. Poisson homogeneous spa es and Lie algebroids asso iated to Poisson a tions.\nDuke Math. J., 86:261\u0015304, 1997.\n32\n\n\fEhresmann doubles and Drinfel'd doubles\n\n[13℄ J.\u0015H. Lu and A. Weinstein. Groupoïdes symple tiques doubles des groupes de Lie\u0015\nPoisson. C. R. A ad. S i. Paris Sér. I Math., 309:951\u0015954, 1989.\n[14℄ J.\u0015H. Lu and A. Weinstein. Poisson Lie groups, dressing transformations, and Bruhat\nde ompositions. J. Di\u001berential Geom., 31:501\u0015526, 1990.\n[15℄ K. Ma kenzie. General Theory of Lie Groupoids and Lie Algebroids. London Mathemati al So iety Le ture Note Series, no. 213. Cambridge University Press, Cambridge,\n2005.\n[16℄ K. C. H. Ma kenzie. Double Lie algebroids and se ond\u0015order geometry, I. Adv. Math.,\n94(2):180\u0015239, 1992.\n[17℄ K. C. H. Ma kenzie. Drinfel'd doubles and Ehresmann doubles for Lie algebroids and\nLie bialgebroids. Ele tron. Res. Announ . Amer. Math. So ., 4:74\u001587, 1998.\n[18℄ K. C. H. Ma kenzie. On symple ti double groupoids and the duality of Poisson\ngroupoids. Internat. J. Math., 10:435\u0015456, 1999.\n[19℄ K. C. H. Ma kenzie. A\u001enoid stru tures and onne tions. In J. Grabowski and P. Urba«ski, editors, Poisson Geometry: Stanisaaw Zakrzewski In Memoriam, number 51 in\nBana h Center Publi ations, pages 175\u0015186, Warsaw, 2000.\n[20℄ K. C. H. Ma kenzie. Double Lie algebroids and se ond\u0015order geometry, II. Adv. Math.,\n154:46\u001575, 2000.\n[21℄ K. C. H. Ma kenzie. Notions of double for Lie algebroids, .\n\narXiv:math.DG/0011212\n\n.\n\n[22℄ K. C. H. Ma kenzie. A uni\u001ced approa h to Poisson redu tion. Lett. Math. Phys., 53:215\u0015\n232, 2000.\n[23℄ K. C. H. Ma kenzie. Duality and triple stru tures. In The breadth of symple ti and Poisson geometry, volume 232 of Progr. Math., pages 455\u0015481. Birkhäuser Boston, Boston,\nMA, 2005.\n[24℄ K. C. H. Ma kenzie and T. Mokri. Lo ally va ant double Lie groupoids and the integration of mat hed pairs of Lie groupoids. Geom. Dedi ata, 77:317\u0015330, 1999.\n[25℄ K. C. H. Ma kenzie and Th. Th. Voronov. The double of a Lie bialgebroid is a double\nLie bialgebroid. In preparation.\n[26℄ K. C. H. Ma kenzie and Ping Xu. Lie bialgebroids and Poisson groupoids. Duke Math. J.,\n73(2):415\u0015452, 1994.\n[27℄ K. C. H. Ma kenzie and Ping Xu. Integrability of Lie bialgebroids. Topology, 39:445\u0015467,\n2000.\n[28℄ S. Majid. Mat hed pairs of Lie groups asso iated to solutions of the Yang\u0015Baxter equations. Pa i\u001c J. Math., 141:311\u0015332, 1990.\n[29℄ S. Majid. Foundations of Quantum Group Theory. Cambridge University Press, 1995.\n33\n\n\fK. C. H. Ma kenzie\n\n[30℄ R. A. Mehta. Supergroupoids, double stru tures, and equivariant ohomology, Thesis,\nUniv. California, Berkeley, 2006. arXiv:math.DG/0605356\n[31℄ T. Mokri. Mat hed pairs of Lie algebroids. Glasgow Math. J., 39:167\u0015181, 1997.\n[32℄ J. Pradines. Remarque sur le groupoïde otangent de Weinstein\u0015Dazord. C. R. A ad.\nS i. Paris Sér. I Math., 306:557\u0015560, 1988.\n[33℄ D. Roytenberg. Courant algebroids, derived bra kets and even symple ti supermanifolds.\nThesis, Univ. California, Berkeley, 1999. arXiv:math.DG/9910078.\n[34℄ D. Roytenberg and A. Weinstein. Courant algebroids and strongly homotopy Lie algebras.\nLett. Math. Phys., 46(1):81\u001593, 1998.\n[35℄ Th. Th. Voronov. Ma kenzie theory and Q\u0015manifolds.\n[36℄ A. Weinstein. Coisotropi\n727, 1988.\n\narXiv:math.DG/0608111\n\n.\n\nal ulus and Poisson groupoids. J. Math. So . Japan, 40:705\u0015\n\n[37℄ A. Weinstein. A\u001ene Poisson stru tures. Internat. J. Math., 1:343\u0015360, 1990.\n\n34\n\n\f"}