{"id": "http://arxiv.org/abs/math/0606425v1", "guidislink": true, "updated": "2006-06-17T21:28:08Z", "updated_parsed": [2006, 6, 17, 21, 28, 8, 5, 168, 0], "published": "2006-06-17T21:28:08Z", "published_parsed": [2006, 6, 17, 21, 28, 8, 5, 168, 0], "title": "The diagonal lemma as the formalized Grelling paradox", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=math%2F0203175%2Cmath%2F0203165%2Cmath%2F0203113%2Cmath%2F0203211%2Cmath%2F0203158%2Cmath%2F0203079%2Cmath%2F0203130%2Cmath%2F0203089%2Cmath%2F0203049%2Cmath%2F0203203%2Cmath%2F0203005%2Cmath%2F0203050%2Cmath%2F0203135%2Cmath%2F0203159%2Cmath%2F0203172%2Cmath%2F0606043%2Cmath%2F0606235%2Cmath%2F0606580%2Cmath%2F0606450%2Cmath%2F0606525%2Cmath%2F0606694%2Cmath%2F0606087%2Cmath%2F0606655%2Cmath%2F0606175%2Cmath%2F0606526%2Cmath%2F0606640%2Cmath%2F0606060%2Cmath%2F0606309%2Cmath%2F0606374%2Cmath%2F0606154%2Cmath%2F0606035%2Cmath%2F0606646%2Cmath%2F0606767%2Cmath%2F0606558%2Cmath%2F0606783%2Cmath%2F0606424%2Cmath%2F0606218%2Cmath%2F0606263%2Cmath%2F0606367%2Cmath%2F0606566%2Cmath%2F0606114%2Cmath%2F0606503%2Cmath%2F0606654%2Cmath%2F0606347%2Cmath%2F0606647%2Cmath%2F0606040%2Cmath%2F0606006%2Cmath%2F0606379%2Cmath%2F0606621%2Cmath%2F0606729%2Cmath%2F0606316%2Cmath%2F0606299%2Cmath%2F0606597%2Cmath%2F0606013%2Cmath%2F0606587%2Cmath%2F0606080%2Cmath%2F0606179%2Cmath%2F0606228%2Cmath%2F0606556%2Cmath%2F0606390%2Cmath%2F0606343%2Cmath%2F0606108%2Cmath%2F0606785%2Cmath%2F0606342%2Cmath%2F0606739%2Cmath%2F0606089%2Cmath%2F0606596%2Cmath%2F0606383%2Cmath%2F0606111%2Cmath%2F0606637%2Cmath%2F0606568%2Cmath%2F0606700%2Cmath%2F0606533%2Cmath%2F0606430%2Cmath%2F0606510%2Cmath%2F0606723%2Cmath%2F0606405%2Cmath%2F0606187%2Cmath%2F0606245%2Cmath%2F0606593%2Cmath%2F0606613%2Cmath%2F0606283%2Cmath%2F0606030%2Cmath%2F0606659%2Cmath%2F0606286%2Cmath%2F0606171%2Cmath%2F0606149%2Cmath%2F0606077%2Cmath%2F0606411%2Cmath%2F0606425%2Cmath%2F0606670%2Cmath%2F0606262%2Cmath%2F0606760%2Cmath%2F0606284%2Cmath%2F0606407%2Cmath%2F0606041%2Cmath%2F0606050%2Cmath%2F0606665%2Cmath%2F0606123%2Cmath%2F0606298%2Cmath%2F0606557&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The diagonal lemma as the formalized Grelling paradox"}, "summary": "Since the diagonal lemma plays a key role in the proof of the main limitative\ntheorems of logic, its proof could shed light on the very essence of these\nfundamental theorems. Yet the lemma is often characterized as one of those\nimportant logical results that lack an insightful explanatory proof. By making\nexplicit that the well-known proof of the lemma is just a straightforward\ntranslation of the Grelling paradox into first-order arithmetic, the proof can\nbe made completely transparent.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=math%2F0203175%2Cmath%2F0203165%2Cmath%2F0203113%2Cmath%2F0203211%2Cmath%2F0203158%2Cmath%2F0203079%2Cmath%2F0203130%2Cmath%2F0203089%2Cmath%2F0203049%2Cmath%2F0203203%2Cmath%2F0203005%2Cmath%2F0203050%2Cmath%2F0203135%2Cmath%2F0203159%2Cmath%2F0203172%2Cmath%2F0606043%2Cmath%2F0606235%2Cmath%2F0606580%2Cmath%2F0606450%2Cmath%2F0606525%2Cmath%2F0606694%2Cmath%2F0606087%2Cmath%2F0606655%2Cmath%2F0606175%2Cmath%2F0606526%2Cmath%2F0606640%2Cmath%2F0606060%2Cmath%2F0606309%2Cmath%2F0606374%2Cmath%2F0606154%2Cmath%2F0606035%2Cmath%2F0606646%2Cmath%2F0606767%2Cmath%2F0606558%2Cmath%2F0606783%2Cmath%2F0606424%2Cmath%2F0606218%2Cmath%2F0606263%2Cmath%2F0606367%2Cmath%2F0606566%2Cmath%2F0606114%2Cmath%2F0606503%2Cmath%2F0606654%2Cmath%2F0606347%2Cmath%2F0606647%2Cmath%2F0606040%2Cmath%2F0606006%2Cmath%2F0606379%2Cmath%2F0606621%2Cmath%2F0606729%2Cmath%2F0606316%2Cmath%2F0606299%2Cmath%2F0606597%2Cmath%2F0606013%2Cmath%2F0606587%2Cmath%2F0606080%2Cmath%2F0606179%2Cmath%2F0606228%2Cmath%2F0606556%2Cmath%2F0606390%2Cmath%2F0606343%2Cmath%2F0606108%2Cmath%2F0606785%2Cmath%2F0606342%2Cmath%2F0606739%2Cmath%2F0606089%2Cmath%2F0606596%2Cmath%2F0606383%2Cmath%2F0606111%2Cmath%2F0606637%2Cmath%2F0606568%2Cmath%2F0606700%2Cmath%2F0606533%2Cmath%2F0606430%2Cmath%2F0606510%2Cmath%2F0606723%2Cmath%2F0606405%2Cmath%2F0606187%2Cmath%2F0606245%2Cmath%2F0606593%2Cmath%2F0606613%2Cmath%2F0606283%2Cmath%2F0606030%2Cmath%2F0606659%2Cmath%2F0606286%2Cmath%2F0606171%2Cmath%2F0606149%2Cmath%2F0606077%2Cmath%2F0606411%2Cmath%2F0606425%2Cmath%2F0606670%2Cmath%2F0606262%2Cmath%2F0606760%2Cmath%2F0606284%2Cmath%2F0606407%2Cmath%2F0606041%2Cmath%2F0606050%2Cmath%2F0606665%2Cmath%2F0606123%2Cmath%2F0606298%2Cmath%2F0606557&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Since the diagonal lemma plays a key role in the proof of the main limitative\ntheorems of logic, its proof could shed light on the very essence of these\nfundamental theorems. Yet the lemma is often characterized as one of those\nimportant logical results that lack an insightful explanatory proof. By making\nexplicit that the well-known proof of the lemma is just a straightforward\ntranslation of the Grelling paradox into first-order arithmetic, the proof can\nbe made completely transparent."}, "authors": ["Gyorgy Sereny"], "author_detail": {"name": "Gyorgy Sereny"}, "author": "Gyorgy Sereny", "arxiv_comment": "3 pages", "links": [{"href": "http://arxiv.org/abs/math/0606425v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/math/0606425v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.LO", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.LO", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "03F30", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/math/0606425v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/math/0606425v1", "journal_reference": null, "doi": null, "fulltext": "The diagonal lemma as the formalized Grelling paradox 1\n\narXiv:math/0606425v1 [math.LO] 17 Jun 2006\n\nGyörgy Serény\nGödel's diagonal lemma (which is often referred to as fix-point or self-referential lemma) summarizes very succinctly the ability of first-order arithmetic to 'talk about itself', a crucial property of this system that plays a key role in the proof of Gödel's incompleteness theorem and in\nthose of the theorems of Tarski and Church on the undefinability of truth and undecidability\nof provability respectively. In fact, with the representability of provability at hand, these three\nmain limitative theorems of logic can be considered to be simple applications of the lemma\n(cf. e.g. [2] pp. 227–231). Due to this central role, the proof of the lemma could shed light on the\nvery essence of these fundamental theorems. In spite of the fact that it is common knowledge\nthat Gödel's proof of the incompleteness theorem is closely related to the Liar paradox, the proof\nof the lemma as it is presented in textbooks on logic is not self–evident to say the least. Indeed,\nin the Handbook of Proof Theory, the proof of the lemma is introduced by the following remark\n(see [1], p.119): 'This proof [is] quite simple but rather tricky and difficult to conceptualize.' Or\nto quote another opinion, 'The brevity of the proof does not make for transparency; it has the\naura of a magician's trick' (cf. [4], p. 1). It seems, therefore, that the words of a respected logician\nreflect a widespread attitude to the proof of the lemma (see [5]): '[This] result is a cornerstone\nof modern logic. [...] You would hope that such a deep theorem would have an insightful proof.\nNo such luck. [...] I don't know anyone who thinks he has a fully satisfying understanding of\nwhy the Self-referential Lemma works. It has a rabbit-out-of-a-hat quality for everyone.'\nIn view of these remarks, we think that it is worth drawing attention to a possibility of making\nthe proof of the lemma completely transparent by showing that it is simply a straightforward\ntranslation of the Grelling paradox into first-order arithmetic.2\nNotation\nOur formal language is that of first-order arithmetic. Q stands for Robinson arithmetic while ω\nis the set of natural numbers. g is any one of the standard Gödel numberings and F mn is the\nset of formulas with all free variables among the first n ones. For the sake of simplicity, we shall\ndenote the closed terms corresponding to natural numbers by the numbers themselves. Further,\nN denotes the set of Gödel numbers of formulas in F m1 . Finally, the result of substituting a\nterm t for the only free variable of a formula φ ∈ F m1 is denoted by φ(t).\nDiagonal lemma\nFor any formula φ ∈ F m1 , there is a sentence λ such that\nQ ⊢ λ ←→ φ(g(λ)) .\nProof idea\nFirst we show how to construct, out of Grelling's paradox, an ordinary language sentence that, on\nthe one hand, says of itself that it has a given property, on the other hand, consists of components\nwith easily identifiable formal first-order counterparts. The straightforward formalization of this\nordinary language sentence leads to the desired formal sentence (as can be expected since the\nlemma is just about the existence of a first-order sentence that, informally speaking, says of\nitself that it has a given property).\nAs is well known, the Grelling paradox consists in the fact that the sentence\n(1)\n'heterological' is heterological3\nshares with the Liar sentence the remarkable property that its truth implies its own falsity and\nvice versa, i.e., in effect, says of itself that it is false. What is truly important is that, contrary\nto the Liar, this paradoxical sentence achieves self-reference without using an indexical.4\n1\n\nTo appear in the series Collegium Logicum of the Kurt Gödel Society in 2006.\nThe train of thought below is an application of the ideas given in [6] to first-order arithmetic.\n3\nAn adjective is called heterological if the property denoted by the adjective does not hold for the adjective\nitself; e.g. 'long', 'German', 'monosyllabic' are heterological.\n4\nAs to the notion of heterologicality itself (which actually involves self-reference), its slightly modified version\ncan also be expressed without using an indexical: replace 'it' by 'x' in (3) below.\n2\n\n\fSince our aim is to construct a sentence that (a) is not about an adjective but about a sentence\nand (b) instead of asserting its own falsehood, says of itself that it has an arbitrary (but fixed)\nproperty, we have to slightly modify (1) accordingly. In order to satisfy the first requirement,\nin place of an adjective A, we consider the open sentence 'x is A'. Obviously, in this case, the\ntransformation corresponding to the application of an adjective A to a linguistic object O will\nbe the substitution of the name of O 5 for the variable x in the open sentence corresponding\nto A. Consequently, the sentence associated with the self-application of any adjective A in this\nway is \" 'x is A' is A\". In particular, the counterpart of (1) is:\n(2)\n'x is heterological' is heterological.\nNote that the notion of heterologicality occurring here is already a property of open sentences\nwith single variables. Since, on the one hand, to be heterological is to have the property that\nits application to itself yields a false sentence, on the other, as we noted above, in the case of\nsentences, 'applied to itself' means 'its name is substituted for the variable in it', for any open\nsentence x with a single variable, we have\n(3)\n\nx is heterological just in case the sentence obtained by substituting the name of x for\nthe variable in it is false.\n\nFinally, if we replace 'being false' by 'having property p', (2) and (3) together yield:\n(4)\nthe sentence obtained by substituting the name of 'the sentence obtained by substituting the name of x for the variable in it has property p' for the variable in it has\nproperty p.\n\nIt can directly be checked that this sentence indeed says of itself that it has property p (and\nsays nothing else) since it is built up in such a way that if we perform the substitution described\nin it, then we obtain the sentence itself, which is stated to have property p.6 Now, let s denote\nthe open sentence between the quotation marks in (4):\nthe sentence obtained by substituting the name of x for the variable in it has property p.\n\nThen, clearly, the whole sentence (4) is s('s').7 That is, the formalization process should consist\nof two steps. In the first step we have to find the formal version η ∈ F m1 of s, and then the\nsecond step is obvious: the desired sentence λ will simply be η(g(η)).8\nProof\nLet φ ∈ F m1 be arbitrary and let its informal counterpart be the open sentence 'x has property\np'.9 Certainly, x(g(x)) is the formal version of the phrase\nthe sentence obtained by substituting the name of x for the variable in it,\n\n\u0001\n\u0001\nand hence φ g[x(g(x))] is the formal version of s. Clearly, φ g[x(g(x))] with a variable x\nrunning over formulas in F m1 10 is not a formula itself, it becomes a formula only if we replace\nthe variable x by a formula. Therefore, we cannot continue\nthe formalization process unless\n\u0001\nwe find a formula that can play the role of φ g[x(g(x))]\u0001 , that is, a formula η ∈ F m1 such\nthat η(g(ψ)) is provably equivalent in Q to φ g[ψ(g( ψ ))] for every ψ ∈ F m1 , or equivalently\n(denoting the inverse of g by g−1 ), for any n ∈ N ,\n\u0001\nQ ⊢ η(n) ←→ φ g[g−1 (n)(n)] .\nIn order to find the appropriate formula η, let us consider the expression substituted into the\nformula φ, and define the function f : ω −→ ω accordingly:\nf (n) = g[g −1 (n)(n)] if n ∈ N and f (n) = 0 otherwise.\n5\n\nFollowing the common practice, we define the name of a linguistic object to be the object itself between\nquotation marks.\n6\nJ.N. Findlay used sentences of the same structure to examine informally the incompleteness theorem (cf. [3]).\n7\nMimicking the formal notation, in the case of any common language open sentence o having a single variable,\nwe abbreviate the result of substituting a linguistic phrase q for the variable in o by o(q).\n8\nGödel numbering is, of course, the formal counterpart of naming.\n9\nIt is obvious that the formulas in F m1 are formal versions of open sentences with single variables asserting the\npossession of a property, and, taking into consideration only those informal concepts that have formal counterparts,\nthe formalization of attributing a property to an object is the substitution of the formal name (i.e. the Gödel\nnumber) of the corresponding formal object for the only free variable of the formula that formalizes the open\nsentence asserting the possession of the property concerned.\n10\nRecall that, in s, the variable x runs over the set of open sentences with single variables.\n\n\fSince this function is obviously recursive and hence representable in Q, and, up to provable\nequivalence in Q, the result of substituting a representable function into a formula can also be\nexpressed by a formula,11 there is a formula η ∈ F m1 such that, for any n ∈ N ,\n(5)\nQ ⊢ η(n) ←→ φ(f (n)) .\nThus we have obtained what we need, we have shown that there exists an η ∈ F m1 that can\nbe considered to be the formal version of s. Now, all that remains to do is straightforward: it\nfollows from (5) that, for every ψ ∈ F m1 ,\n\u0001\nQ ⊢ η(g(ψ)) ←→ φ g[ψ(g( ψ ))] ,\nwhich, in turn, choosing ψ to be η, yields\n\u0001\nQ ⊢ η(g(η)) ←→ φ g[η(g(η ))] ,\nshowing that the sentence λ = η(g(η)) indeed has the desired property.12\nAcknowledgments\nThis work was supported by Hungarian NSF grant No. T43242.\nReferences\n[1] S. R. Buss (ed.), Handbook of Proof theory, Elsevier, Amsterdam, 1998.\n[2] H. B. Enderton, A Mathematical Introduction to Logic, Academic Press, New York, 1972.\n[3] J. N. Findlay, Goedelian Sentences: A Non-numerical Approach, Mind, Vol. 51, 1942, pp. 259-65.\n[4] H. Gaifman, Naming and Diagonalization, To appear in the Logic Journal of the IGPL, 22 pp.,\nhttp://www.columbia.edu/∼hg17/naming-diag.pdf\n[5] V. McGee, Gödel's First Incompleteness Theorem, Handout for the course 24.242 Logic II, Spring\n2002, http://web.mit.edu/24.242/www/1stincompleteness.pdf\n[6] G. Serény, Gödel, Tarski, Church, and the Liar, The Bulletin of Symbolic Logic, Vol 9, 2003, pp. 3-25.\nDepartment of Algebra\nBudapest University of Technology and Economics\n1111 Stoczek u. 2. H ép. 5. em., Budapest, Hungary\ne-mail: sereny@math.bme.hu\n\n11\n\nBy elementary first-order logic, it follows from the definition of representability that if a function f : ω −→ ω\nis represented in Q by a formula μ ∈ F m2 , then, for any φ ∈ F m1 and n ∈ ω,\nQ ⊢ (∃y)(μ(n, y) ∧ φ(y)) ←→ φ(f (n)).\n12\nPerhaps it is worth noting that the informal version of the last step in the formal proof explains the reasons\nwhy s (the informal counterpart of η) is suitable for constructing the appropriate self-referring sentence (4).\nActually, by definition, for any open sentence o with a single variable, s('o') says that o('o') has property p. In\nthe particular case when o is just s, we obtain: s('s') says that s('s') has property p.\n\n\f"}