{"id": "http://arxiv.org/abs/math/0611730v1", "guidislink": true, "updated": "2006-11-23T15:37:19Z", "updated_parsed": [2006, 11, 23, 15, 37, 19, 3, 327, 0], "published": "2006-11-23T15:37:19Z", "published_parsed": [2006, 11, 23, 15, 37, 19, 3, 327, 0], "title": "Spreading of infectious diseases on complex networks with non-symmetric\n  transmission probabilities", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=math%2F0611012%2Cmath%2F0611352%2Cmath%2F0611204%2Cmath%2F0611728%2Cmath%2F0611529%2Cmath%2F0611876%2Cmath%2F0611729%2Cmath%2F0611244%2Cmath%2F0611633%2Cmath%2F0611514%2Cmath%2F0611551%2Cmath%2F0611627%2Cmath%2F0611832%2Cmath%2F0611761%2Cmath%2F0611632%2Cmath%2F0611920%2Cmath%2F0611363%2Cmath%2F0611512%2Cmath%2F0611183%2Cmath%2F0611658%2Cmath%2F0611471%2Cmath%2F0611233%2Cmath%2F0611063%2Cmath%2F0611052%2Cmath%2F0611504%2Cmath%2F0611605%2Cmath%2F0611046%2Cmath%2F0611390%2Cmath%2F0611172%2Cmath%2F0611712%2Cmath%2F0611014%2Cmath%2F0611528%2Cmath%2F0611096%2Cmath%2F0611078%2Cmath%2F0611309%2Cmath%2F0611290%2Cmath%2F0611458%2Cmath%2F0611697%2Cmath%2F0611285%2Cmath%2F0611310%2Cmath%2F0611913%2Cmath%2F0611586%2Cmath%2F0611293%2Cmath%2F0611706%2Cmath%2F0611094%2Cmath%2F0611351%2Cmath%2F0611164%2Cmath%2F0611392%2Cmath%2F0611803%2Cmath%2F0611160%2Cmath%2F0611336%2Cmath%2F0611866%2Cmath%2F0611707%2Cmath%2F0611730%2Cmath%2F0611083%2Cmath%2F0611744%2Cmath%2F0611530%2Cmath%2F0611548%2Cmath%2F0611223%2Cmath%2F0611299%2Cmath%2F0611041%2Cmath%2F0611376%2Cmath%2F0611507%2Cmath%2F0611252%2Cmath%2F0611748%2Cmath%2F0611882%2Cmath%2F0611494%2Cmath%2F0611013%2Cmath%2F0611828%2Cmath%2F0611867%2Cmath%2F0611604%2Cmath%2F0611372%2Cmath%2F0611425%2Cmath%2F0611634%2Cmath%2F0611279%2Cmath%2F0611864%2Cmath%2F0611888%2Cmath%2F0611197%2Cmath%2F0611132%2Cmath%2F0611742%2Cmath%2F0611149%2Cmath%2F0611222%2Cmath%2F0611670%2Cmath%2F0611790%2Cmath%2F0611745%2Cmath%2F0611780%2Cmath%2F0611280%2Cmath%2F0611591%2Cmath%2F0611499%2Cmath%2F0611835%2Cmath%2F0611660%2Cmath%2F0611133%2Cmath%2F0611468%2Cmath%2F0611492%2Cmath%2F0611240%2Cmath%2F0611909%2Cmath%2F0611574%2Cmath%2F0611914%2Cmath%2F0611121%2Cmath%2F0611099%2Cmath%2F0611201&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Spreading of infectious diseases on complex networks with non-symmetric\n  transmission probabilities"}, "summary": "We model the spread of a SIS infection on Small World and random networks\nusing weighted graphs. The entry $w_{ij}$ in the weight matrix W holds\ninformation about the transmission probability along the edge joining node\n$v_i$ and node $v_j$. We use the analogy between the spread of a disease on a\nnetwork and a random walk performed on this network to derive a master equation\ndescribing the dynamics of the process. We find conditions under which an\nepidemic does not break out and investigate numerically the effect of a\nnon-symmetric weight distribution of the initially infected individual on the\ndynamics of the disease spread.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=math%2F0611012%2Cmath%2F0611352%2Cmath%2F0611204%2Cmath%2F0611728%2Cmath%2F0611529%2Cmath%2F0611876%2Cmath%2F0611729%2Cmath%2F0611244%2Cmath%2F0611633%2Cmath%2F0611514%2Cmath%2F0611551%2Cmath%2F0611627%2Cmath%2F0611832%2Cmath%2F0611761%2Cmath%2F0611632%2Cmath%2F0611920%2Cmath%2F0611363%2Cmath%2F0611512%2Cmath%2F0611183%2Cmath%2F0611658%2Cmath%2F0611471%2Cmath%2F0611233%2Cmath%2F0611063%2Cmath%2F0611052%2Cmath%2F0611504%2Cmath%2F0611605%2Cmath%2F0611046%2Cmath%2F0611390%2Cmath%2F0611172%2Cmath%2F0611712%2Cmath%2F0611014%2Cmath%2F0611528%2Cmath%2F0611096%2Cmath%2F0611078%2Cmath%2F0611309%2Cmath%2F0611290%2Cmath%2F0611458%2Cmath%2F0611697%2Cmath%2F0611285%2Cmath%2F0611310%2Cmath%2F0611913%2Cmath%2F0611586%2Cmath%2F0611293%2Cmath%2F0611706%2Cmath%2F0611094%2Cmath%2F0611351%2Cmath%2F0611164%2Cmath%2F0611392%2Cmath%2F0611803%2Cmath%2F0611160%2Cmath%2F0611336%2Cmath%2F0611866%2Cmath%2F0611707%2Cmath%2F0611730%2Cmath%2F0611083%2Cmath%2F0611744%2Cmath%2F0611530%2Cmath%2F0611548%2Cmath%2F0611223%2Cmath%2F0611299%2Cmath%2F0611041%2Cmath%2F0611376%2Cmath%2F0611507%2Cmath%2F0611252%2Cmath%2F0611748%2Cmath%2F0611882%2Cmath%2F0611494%2Cmath%2F0611013%2Cmath%2F0611828%2Cmath%2F0611867%2Cmath%2F0611604%2Cmath%2F0611372%2Cmath%2F0611425%2Cmath%2F0611634%2Cmath%2F0611279%2Cmath%2F0611864%2Cmath%2F0611888%2Cmath%2F0611197%2Cmath%2F0611132%2Cmath%2F0611742%2Cmath%2F0611149%2Cmath%2F0611222%2Cmath%2F0611670%2Cmath%2F0611790%2Cmath%2F0611745%2Cmath%2F0611780%2Cmath%2F0611280%2Cmath%2F0611591%2Cmath%2F0611499%2Cmath%2F0611835%2Cmath%2F0611660%2Cmath%2F0611133%2Cmath%2F0611468%2Cmath%2F0611492%2Cmath%2F0611240%2Cmath%2F0611909%2Cmath%2F0611574%2Cmath%2F0611914%2Cmath%2F0611121%2Cmath%2F0611099%2Cmath%2F0611201&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We model the spread of a SIS infection on Small World and random networks\nusing weighted graphs. The entry $w_{ij}$ in the weight matrix W holds\ninformation about the transmission probability along the edge joining node\n$v_i$ and node $v_j$. We use the analogy between the spread of a disease on a\nnetwork and a random walk performed on this network to derive a master equation\ndescribing the dynamics of the process. We find conditions under which an\nepidemic does not break out and investigate numerically the effect of a\nnon-symmetric weight distribution of the initially infected individual on the\ndynamics of the disease spread."}, "authors": ["Britta Daudert", "Bai-Lian Li"], "author_detail": {"name": "Bai-Lian Li"}, "author": "Bai-Lian Li", "arxiv_comment": "32 pages, 1 figure", "links": [{"href": "http://arxiv.org/abs/math/0611730v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/math/0611730v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.GM", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.GM", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.NA", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "14J60", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/math/0611730v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/math/0611730v1", "journal_reference": null, "doi": null, "fulltext": "arXiv:math/0611730v1 [math.GM] 23 Nov 2006\n\nSpreading of infe tious diseases on omplex networks with\nnon-symmetri transmission probabilities\n\nBritta Dauderta, Bai\u0015Lian Lia,b\n\nDepartment of Mathemati s\nUniversity of California of Riverside\nRiverside, CA 92521\u00150135, USA, britta\bmath.u r.edu\nb\nDepartment of Botany & Plant S ien es\nUniversity of California of Riverside\nRiverside, CA 92521\u00150124, USA, bai-lian.li\bu r.edu\na\n\nAbstra t\nWe model the spread of a SIS infe tion on Small World and random networks using weighted graphs.\nThe entry wij in the weight matrix W holds information about the transmission probability along the\nedge joining node vi and node vj . We use the analogy between the spread of a disease on a network and\na random walk performed on this network to derive a master equation des ribing the dynami s of the\npro ess. We \u001cnd onditions under whi h an epidemi does not break out and investigate numeri ally the\ne\u001be t of a non-symmetri weight distribution of the initially infe ted individual on the dynami s of the\ndisease spread.\n\nKeywords: epidemi models, random walks, Small World networks, SIS model,\nomplex networks\n\n\f1 Introdu tion\nThe study of epidemiologi al models has been a subje t of great interest for\nmany years. The aim is to model the spread of a parti ular infe tious disease, reprodu ing the a tual dynami s of the disease and designing strategies\nto ontrol and possibly eradi ate the infe tion. Several approa hes to ta kle this\nproblem have been undertaken. The majority of epidemi models are based on\na ompartmental model in whi h the individuals are grouped a ording to their\ndisease status [1℄, [2℄. The basi models des ribe the number of individuals\nthat are sus eptible to (S(t)), infe ted with (I(t)) and re overed from (R(t))\na parti ular disease at time t. The di\u001beren e in responses between individuals,\nthe in\u001duen e of the topologi al stru ture of the system and many other omplex aspe ts of the progression of the disease are negle ted in this approa h.\nAlthough the simpli ity of the model means a loss of information and reality,\nit enables us to get a \u001crst glimpse of the inner workings of the dynami s of the\ndisease spread and makes al ulations of threshold values and equilibria possible. The assumptions of this model lead to two standard sets of di\u001berential\nequations that have provided the foundation of the majority of mathemati al\nepidemiology:\n\n\f1) The Sus eptible-Infe tious-Removed (SIR) model:\n\ndS\n= βN − λS − ρS\ndt\ndI\n= λS − δI − ρI\ndt\ndR\n= δI − ρR\ndt\n(1)\n2) The Sus eptible-Infe tious-Sus eptible (SIS) model:\n\ndS\n= δI − λS\ndt\ndI\n= λS − δI,\ndt\n(2)\nwhere N is the population size, β is the birth rate, ρ is the natural death rate,\n\nδ is the re overy rate and λ is the infe tion rate. The SIR model is a suitable\nmodel for infe tious diseases that onfer lifelong immunity, for example measles\nor whooping ough. The SIS model is mainly used to model the spread of sexually transmitted diseases, su h as hlamydia or gonorrhoea, where repeated\ninfe tions are ommon. In these models a random mixing assumption is made:\nea h individual has a small and equal han e of oming into onta t with any\nother individual. Many modi\u001c ations to this basi approa h have been made to\na ount for more heterogeneities. One approa h is to further subdivide the population into subpopulations, with di\u001berent mixing rates in these groups. This\nmeans that the parameter β in the above equations is repla ed by a matrix,\ndes ribing the transmission of infe tion between di\u001berent groups. Nevertheless,\n\n\fthe random mixing assumption, at least within the subgroups, remains unhanged. In reality, however, it is usually the ase that the number of onta ts\nof an individual is mu h smaller than the population size and random mixing\ndoes not o ur so that the above model an only serve as a relatively rude\napproximation. Models that in orporate network stru ture avoid the need to\nrely on the random mixing assumption. They do so by assigning ea h person\na \u001cxed amount of onta ts. Networks thus apture the permanen e of intera tions. A network (or graph) is omprised of a set of nodes and a set of edges.\nAn edge is a onne tion (or bond) that links two nodes. Not all nodes in a\nnetwork are onne ted dire tly by one edge. Nodes that are onne ted by one\nedge are alled neighbors. We introdu e following network quantities:\n\n• V = {vi}, the set of nodes.\n• E = {eij }, the set of edges. eij is the edge running from node vi to node\nvj .\n• ki, the degree of node vi , i.e., the number of neighbors of node vi.\n• < k >, the average degree of the nodes.\n• kmax , the maximum degree found in the network.\n• P (k), the degree distribution, i.e., P (k) is the per entage of nodes in the\nnetwork that have degree k .\nIn a network used to model the spread of a SIS infe tion, the nodes represent\nindividuals that are either infe ted by or sus eptible to the disease under on-\n\n\fsideration. Edges represent intera tions between individuals: The disease an\nonly spread from one node to the next if there is an edge onne ting them. If\nwe assign a weight ̺ij , representing the probability of node vi to infe t node vj ,\nto ea h edge eij , we obtain a weighted graph. The weight matrix W = {wij }\nis de\u001cned as follows:\n\nwij =\n\n(\n\n̺ij , if node vi is a neighbor of\n0,\n\nnode vj\n\nelse.\n\nThis matrix gives information about the network topology, the relations between individuals in it and the hara teristi of the disease under onsideration.\nThe use of networks in Mathemati al Epidemiology has grown exponentially\nsin e the middle of the 20th entury. In re ent times, starting with the work\nof Pastor-Satorras and Vespignani , there has been a burst of a tivity on understanding the e\u001be ts of the network topology on the rate and pattern of the\ndisease spread [[3℄\u0015[7℄℄. Amongst others the main network types studied are the\nfollowing:\n\n1) Regular latti es\nIn regular latti es ea h vertex is onne ted to its k nearest neighbors, to form\neither rings (one-dimensional) or grids (two-dimensional) [8℄.\n\n2) Random graphs\nThe term random graph refers to the disordered nature of the arrangements\n\n\fof links between di\u001berent nodes . Erdös and Réyni (ER), in their \u001crst paper,\nproposed a model to generate random graphs with N nodes and K links [9℄.\nStarting with N dis onne t nodes, these random graphs are generated by onne ting ouples of randomly sele ted nodes, prohibiting multiple onne tions,\nuntil the number of edges is K.\nAn alternative model for ER graphs is reated by onne ting ea h pair of nodes\nwith probability 0 < p < 1. This pro edure results in graphs having di\u001berent amount of edges present but the two models show strong similarities and\noin ide in the limit of large N. random graphs have degree distribution approximately Poisson with parameter < k >.\n\n3) Small World networks\nThe study of dynami al pro esses over real networks has pointed out the existen e of short uts, i.e. links that onne t di\u001berent areas of the graph, thus\nspeeding up the ommuni ation between otherwise distant nodes. This is known\nas the Small World property . It is mathemati ally hara terized by a relatively\nshort average path length that depends at most logarithmi ally on the network\nsize. This property is observed in a variety of real networks in luding random\ngraphs. To distinguish between random and Small World networks, the Small\nWorld property is often asso iated with the presen e of lustering. Watts and\nStrogatz have proposed to de\u001cne Small World networks as networks having\nboth, a short average path length (like random graphs) and a high lustering\n\n\foe\u001e ient [10℄.\n\n4) S ale free networks\nNetworks that have a power law degree distribution: P (k) ∼ k −γ , 2 < γ < 3\nare alled s ale free [11℄. In omparison, in a random graph, P (k) de ays faster\nthan exponentially. In s ale free networks we often \u001cnd a signi\u001c ant amount\nof nodes with very high degree. In the ontext of disease spread on a graph,\nthese nodes are aptly alled super spreaders. In s ale free networks the average\ndegree < k > is no longer a relevant variable and one expe ts \u001du tuations in\n\n< k 2 > to play an important role.\nIn their work, Shirley and Rushton investigated how the speed of the disease\nspread is in\u001duen ed by ertain topologi al hara teristi s of the graph [12℄.\nThey found that an epidemi spreads fastest on a s ale free network, followed\nby random graphs and is slowest on regular latti es. Small World graphs lay\nin between random and regular graphs. In their model, the transmission probability between nodes is homogeneous throughout the network, i.e., wij = w .\nHowever, when modelling the spread of a disease on a network one should, along\nwith omplex topologi al features, take into a ount heterogeneity in the intensity strength between nodes: not every individual is sus eptible to infe tion\nor apable to infe t its neighbors to the same degree. The omplexity in the\napa ity and intensity of the onne tions also plays an important role in other\nreal networks like s ienti\u001c\n\nollaboration networks, air-transportation networks,\n\n\finternet lusters and other large infrastru ture systems. Newman showed that\nweighted networks an in many ases be analyzed by using a simple mapping\nfrom the weighted graph to an unweighted multi graph and then applying standard te hniques for unweighted networks [13℄. Simonsen et al. studied di\u001busion\non unweighted and weighted networks and dis overed that the eigenvalues of\nthe transfer matrix des ribing the pro ess an be used to re over large s ale\ntopologi al features of the system [14℄\u0015[15℄. Most re ently, Vasquez introdu ed\na type-network representation of a Small World weighted graph to take into\na ount the population heterogeneity in a very general approa h [16℄. He obtained a re ursive equation for the probability distribution of the outbreak size\nas a fun tion of time and demonstrated that the expe ted outbreak size and\nits progression in time are determined by the largest eigenvalue of a ertain\nmatrix (reprodu tive number matrix) and the hara teristi distan e between\nindividuals.\nIn this work, we fo us on the e\u001be t of heterogeneities in the transmission probabilities on the dynami s of the disease spread. We use the strong analogy\nbetween the spread of a disease on the network and a random walk performed\non that network to derive a master equation des ribing the dynami s of the\npro ess. We \u001cnd onditions under whi h an epidemi does not break out and\ninvestigate numeri ally the e\u001be t of a non-symmetri weight distribution on the\ndynami s of the disease spread.\nThis paper is organized as follows: In se tion 2, the epidemi models (SIS) is\n\n\fdes ribed. Se tion 3 ontains the derivation of the master equation des ribing\nthe dynami pro ess. Se tion 4 is on erned with identifying onditions that\nprevent the outbreak of an epidemi . In se tion 5, we dis uss our numeri al\nsimulations and their results. We lose with an overview of the main results\nand a dis ussion in se tion 6.\n\n2 The model\nIn this paper we will onsider the standard SIS epidemi models without birth\nand death on a Small World graph.\n2.1\n\nThe epidemi\n\nmodel\n\nAt ea h time t, the population is divided into two ategories: sus eptibles,\n\nS(t) ≥ 0, and infe tious, I(t) ≥ 0. We normalize so that S(t) + I(t) = 1\nfor all times t. Sus eptible members are virgin territory for the disease, whilst\ninfe tious members are both infe ted and apable of infe ting others with whom\nthey are in dire t onta t, i.e., their neighbors. After being infe ted for time\n\nτInf , an individual returns to the sus eptible lass. In this paper we take\nτInf = 1.\n2.2\n\nThe Network\n\nIn our networks, the verti es of the graph represent the individuals of the population under onsideration, the edges des ribe the onta t patterns between\nindividuals. The adja en y matrix A of this network is de\u001cned by\n\n\faij =\n\n(\n\n1, if node vi and vj\n\nare joined by an edge\n\n0,\n\nelse\n\nand gives information about neighbor relations in the network. Assigning a\nweight wij to the edge onne ting node vi and node vj , representing the probabilities for the disease to spread from node vi to node vj , will result in a weighted\ngraph giving information about\n1. The network topology des ribing the population and the relations between\nindividuals in it and\n2. The hara teristi s of the disease under onsideration.\nThis information is en oded in the weight matrix W, de\u001cned in the previous\nse tion.\nThe weights play the important role of onveying sus eptibility and transmissibility levels of individuals. For example, onsider nodes vi and vj with wij\nbeing relatively large in omparison to wji . This ould either mean that node\n\nvi′ s apability to transmit the disease is very large and vj′ s very low or that node\nvi is not very sus eptible to transmission of the disease from node vj while vj\nan easily at h the disease from vi .\n\n\f3 Random Walks and Epidemi s\nIn this se tion we will des ribe the model implemented to simulate the spread\nof an infe tious disease throughout a population and derive a master equation\ngoverning the dynami s of the system. The design of the model was inspired by\nthe work of Alves et al [17℄. There is an strong analogy between the model of\nan epidemi on a network and a random walk performed on this network that\nan be des ribed as follows:\nSuppose we want to follow the spread of an SIS epidemi on a so ial network.\nThe individuals of the network are represented as nodes. At ea h node we\npla e a ertain amount of random walkers. Ea h random walker represents\nthe possibility of an infe tion to happen: If a walker moves along the edge eij\nfrom the infe ted node vi to the sus eptible node vj , node vj has been infe ted\nwith the disease. If no walker moves to vj , the node remains sus eptible. The\nprobability of the walker moving from vi to vj is given by the entry wij of the\nweight matrix W. There is an arti\u001c ial omponent to this model: The number of\nwalkers pla ed at ea h node at time t0 depends on the length of our experiment\nand the infe tion time τinf . Sin e ea h walker represents the possibility of one\ninfe tion, we need to have a su\u001e ient amount of walkers at ea h node at time\n\nt0 so that we do not 'run out' of walkers (the ability to infe t) at some time\nt before the end of our experiment. If we want to model the spread of a SIS\ninfe tion for Tmax time steps, we need to pla e at least ⌈ τTinfmax\n+1 ⌉kj walkers at\nnode vj . This is to ensure that, when the node is infe ted, an infe tion an\n\n\fhappen along ea h bond eminating from our node throughout the duration of\nthe experiment.\nLet us de\u001cne following quantities:\n\n• Let N = Tmax\n\nP\n\nj\n\nkj be the total number of random walkers parti ipating.\n\n(Here, the sum is taken over all nodes.)\n\n• Let W = {wij } be the matrix of transmission probabilities des ribed earlier: wij is the probability of infe ted individual vi to infe t sus eptible\nindividual vj .\n\n• Let I(t) = {Ii(t)}, where\n\nIi(t) =\n\n(\n\n1 if vi is inf ected\n0\n\nelse.\n\nI(t) is alled the infe tion matrix. The number of non-zero elements of I(t)\nis the total number of infe ted individuals at time t.\nWe model the spread of the infe tion through the population via a random walk\nperformed on the network:\nAt t = t0 , we pla e Tmax ki walkers at ea h node vi . Ea h walker represents\nthe possibility of an infe tion to happen. Choosing Tmax ki walkers (and hen e\nP\nN = Tmax j kj ) ensures that no node looses the ability to infe t its neighbors\n(provided the node is infe ted) before the maximum number of time steps Tmax\n(i.e., the end of the experiment) is rea hed. At ea h time step t, at a generi\nnode vi , one of two things may happen:\n\n\f1. If node vi is infe ted: ki walkers may ea h make one move: The walkers\nare allowed to move between adja ent verti es. What edge, out of the\npossible outgoing ones, a walker hooses to move along is pi ked at random\nwith probability equal to the weight assigned to this dire ted edge. If the\nwalker moves to a sus eptible neighboring node, that node will be infe ted\nwith the disease. Walkers from infe ted neighboring nodes may enter. After\none time step the status of vi is reset to sus eptible (Ii (t−1) = 1, Ii (t) = 0).\n2. If node vi is sus eptible: No walkers leave vi but walkers from neighboring infe ted nodes may enter. As soon as a walker enters the sus eptible\nnode vi , it is onsidered infe ted (Ii (t − 1) = 0, Ii (t) = 1). At the next\ntime step ki walkers of node vi may move to infe t any of the sus eptible\nneighbors of node vi .\n\nLet us denote by ηi (t) the per entage of walkers at node vi at time t. This is\nthe quantity that will give us information about the dynami s of the disease\nspread. We note following properties of ηi (t):\n\n• If node vi is sus eptible at time t, ηi(t + 1) − ηi (t) >= 0 and the larger this\ndi\u001beren e is, the more sus eptible to infe tion is the node.\n\n• If node vi is infe ted at time t, walkers are leaving but may also enter from\nneighboring nodes so ηi (t + 1) − ηi (t) does not give any useful information.\n\n• The hange in walker density from time t to time t + 1 for the sus eptible\n\n\fnode vi satis\u001ces:\n\nX\n\nm∈N eighi\n\nk\nPm .\nj kj\n\nX\n\nk\nPm ,\nj kj\n\n0 ≤ |ηi (t + 1) − ηi (t)| ≤\nIf\n\n0 ≤ |ηi (t + 1) − ηi(t)| =\n\nm∈N eighi\n\nall neighboring nodes are infe ted and all walkers from those nodes move\nto vi .\n\n• The hange in walker density from time t to time t + 1 for the infe ted node\nvi satis\u001ces:\n\nIf\n\nki\n0 ≤ |ηi(t + 1) − ηi(t)| ≤ P .\nj kj\nki\n0 ≤ |ηi(t + 1) − ηi(t)| = P ,\nj kj\n\nall ki walkers leave node vi and no walkers enter.\n\n• Hen e, for a generi node vi, we have\n0 ≤ |ηi (t + 1) − ηi(t)| ≤\n\nX\n\nm∈N eighi\n\n1\n= P\nj\n\nkj\n\nk\nk\nPmax + Pmax\nj kj\nj kj\n\n[kmax 2 + kmax ]\n\n(3)\n\n• Nodes that are extremely sus eptible to infe tion at time t have large |ηi (t+\n1)−ηi(t)| values (>>\nPki ,\nj kj\n\nPki ).\nj kj\n\nInfe ted nodes that satisfy |ηi (t+1)−ηi (t)| ≈\n\nare very infe tuous. Hen e |ηi (t + 1) − ηi(t)| quanti\u001ces the extend to\n\nwhi h node vi parti ipates in the spread of the disease under onsideration.\n\n\f• Sin e the infe tion time τinf is one and |ηi (t + 1) − ηi (t)| ≤\nPki ,\nj kj\n\nfor Tmax ≥ 3, we have 1:\n\nηi (Tmax) ≤ P\n\n1\n\nm km\n\nand for Tmax ≥ 1:\n\nh\n\nP\n\nm∈Ni\n\nPkm\nj kj\n\n+\n\ni\n(Tmax − 2)\n(Tmax − 3)\n2\n⌉)kmax + ⌈\n⌉(kmax )\n(Tmax − ⌈\n2\n2\n\n1\n\nh\nTmax i\nTmax\n⌉)kmax + ⌊\n⌋ ≤ ηi (Tmax)\n(Tmax − ⌈\n2\n2\nm km\n\nP\n\n• From the derivation of these bounds, we an on lude that a generi node\nvi satis\u001ces:\ni\nh\nt i\n1 h\n(t − 2)\nt\n(t − 3)\n2\nP\n⌉)kmax +⌈\n⌉(kmax )\n(t−⌈ ⌉)kmax +⌊ ⌋ ≤ ηi(t) ≤ P\n(t−⌈\n2\n2\n2\n2\nk\nk\nm\nm\nm\nm\n1\n\n• Nodes with large ηi (Tmax) values have been infe ted with great intensity\nbut have transmitted the disease with low frequen y.\n\n• Nodes with small ηi (Tmax) values have rarely been infe ted themselves but\nif infe ted have ontra ted the disease to many of their neighbors.\n\n•\n3.1\n\nP\n\ni ηi (t)\n\n= 1 for all t.\n\nThe Master Equation\n\nWe now derive the equation governing the dynami s of the disease spread. This\nequation is alled the master equation. The hange in the walker density is the\ndi\u001beren e between the relative number of walkers entering, Ji− (t), and leaving,\n\nJi+(t), the same vertex over the time interval t −→ t + 1. Hen e,\n1\n\nSee appendix A and B\n\n\fηi(t + 1) = ηi(t) + Ji−(t) − Ji+(t).\n\n(4)\n\nFor the moment, let us presume that node vi is infe ted. Then the edge urrent\non the dire ted edge from vertex vi to a neighboring vertex vj is given by:\n\nki\nCij (t) = P\n\nwij\nP\n\nkj m∈N eighi wim\nηi(t0)\nwij\nP\n=\n.\nTmax m∈N eighi wim\nj\n\n(5)\n\nThe edge urrent is the fra tion of walkers moving along this edge a ording\nto the weight distribution emanating from that node. Note that\n\nwij\nP\n\nm∈N eighi\n\nwim\n\nis the probability of a walker de iding on the edge from vertex vi to vertex vj .\nSin e no walkers are leaving if the node is sus eptible, we must have:\n\nJi−(t)\n\n=\n\nX\n\nIj (t)Cji\n\n(6)\n\nX\n\nIi (t)Cij .\n\n(7)\n\nj∈N eighi\n\nand\n\nJi+(t) =\n\nj∈N eighi\n\nand upon substitution into equation (4), we obtain\n\n\fηi(t + 1) = ηi (t) +\n\nX\n\nIj (t)Cji −\n\nX\n\nIj (t)\n\nj∈N eighi\n\nWith the matrix T de\u001cned as follow:\n\nTij =\n\n(\n\nwji\nP\n\nm∈N eighj\n\nwjm\n\nIi (t)Cij\n\nj∈N eighi\n\nj∈N eighi\n\n= ηi (t) +\n\nX\n\nwji\nηj (t0 )\nηi(t0)\nP\n. (8)\n− Ii(t)\nTmax m∈N eighj wjm\nTmax\n\nif vj\n\nis a neighbor of\n\nvi\n\nelse,\n\n0\n\nwe an rewrite equation (8) in matrix notation.\n\nη(t0)\nη(t0 )\n− I(t) *\nTmax\nTmax\nt\nt\nX\n1 X\nI(τ )) * η(t0)\nI(τ )) * Tη(t0) − (\n(\n\nη(t + 1) = η(t) + I(t) * T\n= η(t0) +\n= η(t0) +\n\nTmax\n1\n\nTmax\n\n(\n\nτ =t0\nt\nX\n\nτ =t0\n\nI(τ )) * (Tη(t0) − η(t0)).\n\n(9)\n\nτ =t0\n\nEquation (9) is the desired master equation. This equation governs the dynami s of the disease spread. We an see that η(t + 1) depends on the initial walker\ndistribution, the sum of the infe tion matri es from time t0 to t, whi h tells us\nwhi h nodes have not been infe ted yet and the matrix T, whi h is alled the\ntransfer matrix.\n\n\f4 Conditions for non-outbreak\nIf η(t + 1) ≈ η(t0 ) for all t, an outbreak of the epidemi does not take pla e.\nFrom equation (9) we an see that this is the ase if either\n1.\n\nPt\n\nτ =t0\n\nI(τ ) ≈ 0\n\nor\n\n2. Tη(t0 ) ≈ η(t0 ).\nIn this paper we will on entrate on the \u001crst ondition. We investigate how\nthe distribution of in oming and outgoing weights of the initial node e\u001be ts\nthe dynami s of the disease spread. We de\u001cne a weighted di\u001beren e Di and\na nodal entropy Si to quantify the di\u001beren e between in oming and outgoing\ntransmission probabilities of a generi node vi . There are two ways in whi h\nondition 1 an be realized:\n1) The epidemi does not break out: either non or relatively few neighbors of\nthe initially infe ted node get infe ted by it and they, in turn, do not infe t a\nsigni\u001c ant number of their neighbors until, after a short number of time steps,\nthere are no infe ted individuals in the population. This happens if the majority\nof the transmission probabilities stay below the threshold value of the network.\n2) Infe tion of sus eptible individuals takes pla e over a long period of time but\ninfe ted individuals stay lo alized around the initially infe ted node.\nTo investigate when this may happen, we introdu e the following di\u001beren e\nmeasure: For node vi , we de\u001cne\n\n\fDi =\n\nP\n\nj∈N eighi (wij\n\nki\n\n− wji )\n\n;\n\ni.e., Di des ribes the di\u001beren e between outgoing (wij ) and in oming (wji )\ntransmission probabilities of node vi . If Di < 0, the sum of the outgoing\nweights is smaller than the sum of in oming weights and vi e versa if Di > 0.\nNodes with Di < 0 are more likely to be infe ted often but infe t their neighbors\nwith low intensity. Nodes with Di > 0 are more infe tious but less sus eptible\nto infe tion. We expe t some sort of lo alization of the disease spread around\nthe initial node v1 to o ur if D1 ≪ 0 and the average of the weights of the\nother nodes are su\u001e iently small. Let us also de\u001cne an entropy des ribing the\ndiversity of the di\u001beren es of in oming and outgoing weights of a node:\nLet\n\nPi (d) =\n\n% of\n\nedges eij\n\nof\n\nnode vi with wij − wji = d\n\n.\nThen Pi (d) is a probability distribution on the di\u001beren es of in oming and\nP\noutgoing weights of node vi (i.e.,\nd Pi (d) = 1 for all i) and we utilize this\ndistribution by de\u001cning the following nodal entropy in the standard way: At\n\nnode vi , we let\n\nSiD = −\n\nX\nd\n\nPi (d)log(Pi(d)).\n\n\fSiD gives information about the disorder of these di\u001beren es: The larger the\nvalue of SiD , the large the variety of di\u001beren es in in oming and outgoing\nweights.\n\n5 Numeri al investigation on a Small World Graph\n5.1\n\nThe network\n\nWe reate a Small World graph in the following way: N points lying in the\nsquare [0, 1] × [0, 1] are randomly sele ted. These points represent our population. We hoose the following network de\u001cning quantities:\n\n• r: The short distan e radius\n• pr : The probability of short distan e bond formation\n• R: The long distan e radius\n• pR : The probability of long distan e bond formation\n• wr : The transmission probability along short distan e bonds.\n• wR : The transmission probability along short distan e bonds.\nPoints lying a distan e less than r away from ea h other are onne ted with\nprobability pr . Points lying a distan e more than R away from ea h other are\nonne ted with probability pR . Transmission of the disease along short distan e\nbonds o urs with probability pr , transmission along long distan e bonds o urs\nwith probability pR .\n\n\f5.2\n\nSensitivity to initial\n\nTo see when\n\nPt\n\nτ =t0\n\nonditions\n\nI(τ ) ≈ 0, let us set up our Small World graph as follows:\n\nThe population size N is 2000. All transmission probabilities a ross bonds,\nregardless of the nature of the bond, ex ept for node one, are held \u001cxed at\n\n3% (i.e., pr = pR ). This value is hosen be ause our numeri al simulations\nwith homogeneous transmission probabilities showed that an epidemi does\nrarely break out for values around 3% We will look at two di\u001berent s enarios\nto evaluate the in\u001duen e of long distan e onne tions in the network:\n1. pR is hosen small enough so that the average long distan e degree of a\nnode lies at 0.09 (Small world graph).\n2. pR = 0, no long distan e onne tions are permitted (random graph).\n\npr is hosen so that the average short distan e degree is 25. Node one, the\ninitially infe ted, has degree k1 = 20 with 19 short distan e onne tions and\none long distan e onne tion in ase one and 20 onne tions in ase 2. We de\u001cne\nthe parti ipation ratio P R(t) at time t as the per entage of the population that\nhas been infe ted at least on e during the time interval [0, t] and the diameter\n\nDiam(t) as the maximum distan e from the initially infe ted node where an\ninfe ted individual an be found during the time interval [0, t]. We investigate\nhow the diameter and the parti ipation ratio hange with varying D1 and S1D\nvalues, i.e. how the non-symmetry of the transmission probabilities of the initial\nnode and the extend to whi h it is not symmetri e\u001be t the dynami s of the\nepidemi . The diameter and parti ipation ratio are measured at the last time\n\n\fstep Tmax . Tmax is hosen large enough so that either the epidemi has spread\nthrough all the population, resulting in a maximal diameter and parti ipation\nratio, an equilibrium is rea hed (parti ipation ratio and diameter approa h\nsome limit) or the epidemi has died out for some t < Tmax . Our numeri al\nsimulations resulted in \u001cgure number 1.\nWe an see that the plots look very similar for graphs without long distan e\nonne tions and Small World graphs. As expe ted, the introdu tion of long\ndistan e onne tions between nodes drives up the diameter and parti ipation\nratio.\nWe note that the plots of the diameter and parti ipation ratio in both ases\nare almost symmetri about the line D1 = 0. For small values of S1D we\nobserve a basin around D1 = 0: diameter and parti ipation ratio stay low\nas we hoped. But note that, as S1D in reases, the behavior around D1 ≈ 0\nbe omes in reasingly errati and unpredi table. As we move away from D1 ≈ 0\nregions but stay in areas where S1D is relatively low, the diameter in reases.\nWe an see that the infe tion rea hes the outskirts of our domain [0, 1] × [0, 1].\nparti ipation ratios limb as high as 40%. Again, as S1D in reases we noti e the\nsmoothness of the plots breaking and see disorder taking over. Looking at the\nparti ipation ratio plots we noti e an oddity: At D1 ≈ 0.4 and S1D ≈ 0.65 we\nsee a sharp spike mu h higher than any surrounding parti ipation ratio values.\nThis behavior is surprising and needs further investigation.\n\n\f6 Results and Dis ussion\nWe have used the analogy between the spread of a disease on a network and a\nrandom walk performed on this network to derive a master equation des ribing\nthe dynami s of the pro ess. We found two onditions under whi h an epidemi does not break out. One of these onditions strongly depends on the\ntransmission probabilities of the initial node. This lead to the onsideration\nof a non-symmetri weight matrix W. The majority of resear h on erning\nepidemi modeling on networks assumes that the transmission probability matrix W is symmetri . This means that node vi infe ts neighboring node vj\nwith the same probability as node vj infe ts node vi . We have fo used on a\nmore realisti setting where we take into a ount the heterogeneity in the intensity strength between nodes, i.e., a non-symmetri weight matrix W. In\nparti ular, we fo us on the initially infe ted individual showing these heterogeneities, leaving all other nodes with homogeneous transmission probabilities.\nWe hose these small enough so that in ase of a fully homogeneous network\nan epidemi would not break out. We numeri ally investigated the e\u001be t of\nthe non-homogeneous weight distribution of the initial node. To quantify the\nheterogeneity in transmission probabilities, we de\u001cned two nodal quantities:\n1. The di\u001beren e Di =\n\nP\n\nj∈N eighi (wij −wji )\n\nki\n\n, des ribes the di\u001beren e between out-\n\ngoing (wij ) and in oming (wji ) transmission probabilities of node vi .\n2. The entropy SiD = −\n\nPi (d) =\n\n% of\n\nd Pi (d)log(Pi(d)),\n\nP\n\nedges eij\n\nof\n\nwhere\n\nnode vi with wij − wji = d,\n\n\fdes ribing the disorder in the di\u001beren es d.\nThrough our numeri al simulations we obtained surfa e pro\u001cles of diameter\nand parti ipation ratio for a variety of D1 and S1D values for graphs with long\ndistan e onne tions and without. Graphs without long distan e onne tions\nare just random graphs. Introdu tion of long distan e onne tions reates Small\nWorld graphs. We obtained the following results:\n\n• The quasi-symmetry around D1 ≈ 0 for low S1D values shows that regardless\nof whether in oming weights of node 1 are larger than outgoing or vi e versa,\nthe dynami s of the disease spread is very similar.\n\n• An in rease in S1D values leads to a breakdown of symmetry and unpredi table dynami s. This breakdown of symmetry o urs at S1D values about\n\n0.5.\nIn summary, we have shown that the introdu tion of even very few non-symmetri\ntransmission probabilities along edges of an otherwise homogeneous network\nhanges the dynami of the disease spread. For a larger disorder in the differen es between in oming and outgoing weights of the initially infe ted, the\ndynami s be omes unpredi table. The threshold value of this disorder measured\nby the entropy S1D lies at about 0.5. It is quite apparent that a realisti model\nof the spread of an infe tious disease throughout a population should take into\nonsideration the heterogeneities in transmission probabilities between individuals. We have taken a step towards this dire tion by investigating the e\u001be t of\nthe introdu tion of a single node with heterogeneous transmission probabilities.\n\n\fFurther resear h opportunities present themselves. One should investigate the\ne\u001be t of heterogeneities in more than one node. One should try and \u001cnd a measure quantifying the extend of anti-symmetry in the network as a whole and\ninvestigate if there exist ertain threshold values determining if an epidemi\nbreaks out or not. We also plan to analyze the se ond ondition for a nonoutbreak found in this paper. This will involve a thorough investigation of the\nproperties of the transfer matrix T . Another dire tion of resear h would be to\nrun the simulation on s ale\u0015free networks to see if we \u001cnd the same symmetry\nabout D1 = 0, if a breakdown of this symmetry o urs and if so, what the S1D\nthreshold value is.\nNetwork analysis in the ontext of epidemi modelling has helped us reate more\nrealisti settings to investigate the spread of infe tious diseases throughout a\npopulation. The study of non-symmetri weight matri es may prove useful\nin reating even more realisti models taking into a ount the variability of\ntransmission probability between individuals of the population and ould lead\nto more a urate threshold values predi ting the outbreak of an epidemi , hen e\nenabling us to develop better methods to prevent or eradi ate the disease at\nhand.\n\nA knowledgements\nThe authors would like to thank Dr. Mi hel L. Lapidus for his input and\nproof reading of the do ument and Dr. Erin Pearse for many fruitful\nonversations. We would also like to thank Tanya Vassilevska and Amit\n\n\fChakraborty for their suggestions and omments.\n\n\f7 Appendix\n7.1\n\nA\n\nDerivation of lower bound\n1\nP\n\nm km\n\nh\n\nTmax i\nTmax\n⌉)kmax + ⌊\n⌋ ≤ ηi (Tmax)\n(Tmax − ⌈\n2\n2\n\nFirst, we make some observations:\n\nτinf = 1 means that a generi node vi an be infe ted by its neighbor at most\nevery se ond time step. Sin e a node an only loose walkers when it is infe ted\nand node vin is the only infe ted individual at time t0 , we on lude that vin is\nthe node that potentially has the least number of walkers at time Tmax . We\nalso need to assume that node vin is of maximum degree kmax . The following\nhain of events will result in node vin having the smallest number of walkers at\nthe end of the experiment:\n\n• Time t0 : vin is infe ted, vj is sus eptible.\nkmax\n.\nηin(t0 ) = Tmax P\nm km\n\n• Time t1 : All kin = kmax walkers leave vin.\n\nvinturns sus eptible.\n\nkmax\nηin (t1) = (Tmax − 1) P\nm km ,\n\n• Time t2 : To keep loosing walkers at the largest rate, the node needs to\nbe infe ted at every se ond time step. We assume that only one walker\n\n\fauses the infe tion at ea h time, keeping the amount of walkers entering\nat a minimum.\n\nηin(t2) = (Tmax − 1) Pkmaxkm +\n\nP1\n\n.\n\nηin(t3) = (Tmax − 2) Pkmaxkm +\n\nP1\n\n.\n\nm\n\nm km\n\n• When infe ted, the node looses all kin walkers in the next time interval.\nm\n\nm km\n\n• When sus eptible, one walker enters, ausing infe tion.\nηin(t4) = (Tmax − 2) Pkmaxkm + 2 P 1 km ...\nm\n\nm\n\n• Hen e, for t = Tmax , we obtain:\n1\n\n7.2\n\nB\n\nh\nTmax i\nTmax\nηin(Tmax ) = P\n⌉)kmax + ⌊\n⌋ .\n(Tmax − ⌈\n2\n2\nk\nm\nm\n\nDerivation of upper bound\n\nηi (Tmax) ≤ P\n\n1\nm km\n\nh\n\ni\n(Tmax − 2)\n(Tmax − 3)\n2\n⌉)kmax + ⌈\n⌉(kmax )\n(Tmax − ⌈\n2\n2\n\nLet vj be a neighbor of the initially infe ted individual vin. If we assume that vj\nand all its neighbors are of maximum degree kmax and noti e that only walkers\nsitting at infe ted nodes an move, we on lude that the most walkers an\na umulate at a node vj , neighbor to vin. The following hain of events will\nresult in vj obtaining the largest number of walkers over the time span of the\nexperiment:\n\n\f• Time t0 : vin is infe ted, vj is sus eptible.\nkmax\nηj (t0) = Tmax P\n.\nm km\n\n• Time t1 : All walkers leave node vin and move to node vj . Node vj gets\ninfe ted. Node vin turns sus eptible.\n\nkmax\nηj (t1) = (Tmax + 1) P\n.\nm km\n\n• Time t2 : All kmax walkers leave node vj :\n\nkmax\nηj (t2 ) = (Tmax) P\n,\nm km\n\ninfe ting ea h neighbor. The node returns to the state of sus eptibility .\n\n• Time t3 : Assuming that all walkers of all infe ted neighboring nodes will\nmove to vj , we obtain:\n\nX ki\nkmax\nP\nP\n+\nηj (t3 ) = (Tmax )\nk\nm m\nm km\ni∈Nj\n\nkmax\n(kmax)2\n= (Tmax ) P\n+P\n,\nm km\nm km\n\nsin e we assumed all neighbors of vj to be of maximum degree.\n\n• We now assume that step 2 and 3 repeat until the end of the experiment.\n• Time t4 :\n\n• Time t5 :\n\n(kmax )2\nkmax\n+P\n.\n(Tmax − 1) P\nk\nk\nm\nm\nm\nm\n(kmax)2\nkmax\n+ 2P\n...\n(Tmax − 1) P\nk\nk\nm\nm\nm\nm\n\n\f•\nηj (Tmax) = P\n\n1\n\nm km\n\nh\n\ni\n(Tmax − 2)\n(Tmax − 3)\n2\n⌉)kmax + ⌈\n⌉(kmax ) .\n(Tmax − ⌈\n2\n2\n\n\fReferen es\n[1℄\n\nN. T. J. Bailey, The mathemati al theory of epidemi s, London: Gri\u001ben,\n1957\n\n[2℄\n\nR. M. Anderson and R. M. May, Infe tious diseases of humans, Oxford:\nOxford University Press, 1992\n\n[3℄\n\nR. Pastor-Satorras and A. Vespignani, Phys. Rev. Lett. 86 (2001) 3200\n\n[4℄\n\nR. Pastor-Satorras and A. Vespignani, Phys. Rev. E 63 (2001) 066117\n\n[5℄\n\nM. Barthelemy, A. Barrat, R. Pastor-Satorras and A. Vespignani,\n\nDy-\n\nnami al patterns of epidemi outbreaks in omplex heterogenous networks,\nJournal of theoreti al Biology 235 (2005), 275-288\n[6℄\n\nS. Bo aletti, V. Latora, Y. Moreno, M. Chavez and D. U. Hwang,\n\nCom-\n\nplex Networks: Stru ture and dynami s, Physi s Reports 424 (2006), 175308\n[7℄\n\nM. J. Keeling, K. T. D. Eames,\n\nNetworks and epidemi models, Journal\n\nof the Royal So iety Interfa e 2, 295-307\n[8℄\n\nD. J. Watts, Small Worlds: The dynami s of Networks between Order\nand Randomness, Prin eton University Press , New Jersey, 1999\n\n[9℄\n\nP. Erdös and A. Réyni, On the evolution of random graphs, Magy. Tud.\nAkad. Mat.Kut. Intéz. kozl. 5 17-61\n\n\f[10℄ D. J. Watts, S. H. Strogatz, Colle\n\ntive dynami s of 'small world' networks,\n\nNature 393(1998), 440-442\n[11℄ A. L. Barabási and R. Albert,\n\nEmergen e of s aling in random networks,\n\nS ien e 286 (1999), 509-512\n[12℄ M. D. F. Shirley and S. P. Rushton,\n\nThe impa ts of network topology on\n\ndisease spread, E ologi al Complexity 2(2005), 287-299\n[13℄ M. E. J. Newman,\n\nAnalysis of weighted networks, Physi al Review E 70\n\n(2004), 056131\n[14℄ I. Simonsen, K. A.Eriksen, S. Maslov, K. Sneppen,\n\nDi\u001busion on ompex\n\nnetworks: A way to probe their large-s ale topologial stru ture, Physi a A\n336 (2004), 163-173\n[15℄ I. Simonsen, Di\u001busion\n\nand networks: A powerful ombination, Physi a A\n\n357 (2005), 317-330\n[16℄ A. Vazquez, Spreading of infe\n\ntious diseases on heterogeneous populations:\n\nmulti-type network approa h,\nhttp://www. itebase.org/abstra t?id=oai:arXiv.org:qbio/0605001,(2006)\n[17℄ O. S. Alves, F. P. Ma hado and S. Yu. Popov,\n\nPhase Transition For The\n\nFrog Model, Ele troni Journal of Probability, vol.7 (2002), 1-21\n\n\f"}