{"id": "http://arxiv.org/abs/math/0607600v1", "guidislink": true, "updated": "2006-07-24T15:52:54Z", "updated_parsed": [2006, 7, 24, 15, 52, 54, 0, 205, 0], "published": "2006-07-24T15:52:54Z", "published_parsed": [2006, 7, 24, 15, 52, 54, 0, 205, 0], "title": "Measure equivalence rigidity of the mapping class group", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=math%2F0607786%2Cmath%2F0607563%2Cmath%2F0607487%2Cmath%2F0607783%2Cmath%2F0607433%2Cmath%2F0607364%2Cmath%2F0607099%2Cmath%2F0607335%2Cmath%2F0607048%2Cmath%2F0607536%2Cmath%2F0607238%2Cmath%2F0607214%2Cmath%2F0607608%2Cmath%2F0607759%2Cmath%2F0607560%2Cmath%2F0607180%2Cmath%2F0607244%2Cmath%2F0607213%2Cmath%2F0607502%2Cmath%2F0607362%2Cmath%2F0607056%2Cmath%2F0607550%2Cmath%2F0607318%2Cmath%2F0607640%2Cmath%2F0607653%2Cmath%2F0607805%2Cmath%2F0607743%2Cmath%2F0607779%2Cmath%2F0607755%2Cmath%2F0607057%2Cmath%2F0607546%2Cmath%2F0607333%2Cmath%2F0607416%2Cmath%2F0607511%2Cmath%2F0607196%2Cmath%2F0607756%2Cmath%2F0607701%2Cmath%2F0607142%2Cmath%2F0607594%2Cmath%2F0607443%2Cmath%2F0607770%2Cmath%2F0607413%2Cmath%2F0607025%2Cmath%2F0607764%2Cmath%2F0607508%2Cmath%2F0607661%2Cmath%2F0607078%2Cmath%2F0607707%2Cmath%2F0607286%2Cmath%2F0607232%2Cmath%2F0607215%2Cmath%2F0607781%2Cmath%2F0607776%2Cmath%2F0607697%2Cmath%2F0607681%2Cmath%2F0607278%2Cmath%2F0607483%2Cmath%2F0607494%2Cmath%2F0607404%2Cmath%2F0607807%2Cmath%2F0607754%2Cmath%2F0607561%2Cmath%2F0607304%2Cmath%2F0607449%2Cmath%2F0607394%2Cmath%2F0607600%2Cmath%2F0607448%2Cmath%2F0607695%2Cmath%2F0607310%2Cmath%2F0607149%2Cmath%2F0607220%2Cmath%2F0607091%2Cmath%2F0607444%2Cmath%2F0607176%2Cmath%2F0607734%2Cmath%2F0607463%2Cmath%2F0607042%2Cmath%2F0607523%2Cmath%2F0607328%2Cmath%2F0607341%2Cmath%2F0607332%2Cmath%2F0607037%2Cmath%2F0607366%2Cmath%2F0607104%2Cmath%2F0607465%2Cmath%2F0607660%2Cmath%2F0607299%2Cmath%2F0607822%2Cmath%2F0607726%2Cmath%2F0607380%2Cmath%2F0607538%2Cmath%2F0607646%2Cmath%2F0607656%2Cmath%2F0607294%2Cmath%2F0607313%2Cmath%2F0607504%2Cmath%2F0607752%2Cmath%2F0607657%2Cmath%2F0607031%2Cmath%2F0607135%2Cmath%2F0607177&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Measure equivalence rigidity of the mapping class group"}, "summary": "We show that the mapping class group of a compact orientable surface with\nhigher complexity has the following extreme rigidity in the sense of measure\nequivalence: if the mapping class group is measure equivalent to a discrete\ngroup, then they are commensurable up to finite kernel. Moreover, we describe\nall lattice embeddings of the mapping class group into a locally compact second\ncountable group. We also obtain similar results for finite direct products of\nmapping class groups.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=math%2F0607786%2Cmath%2F0607563%2Cmath%2F0607487%2Cmath%2F0607783%2Cmath%2F0607433%2Cmath%2F0607364%2Cmath%2F0607099%2Cmath%2F0607335%2Cmath%2F0607048%2Cmath%2F0607536%2Cmath%2F0607238%2Cmath%2F0607214%2Cmath%2F0607608%2Cmath%2F0607759%2Cmath%2F0607560%2Cmath%2F0607180%2Cmath%2F0607244%2Cmath%2F0607213%2Cmath%2F0607502%2Cmath%2F0607362%2Cmath%2F0607056%2Cmath%2F0607550%2Cmath%2F0607318%2Cmath%2F0607640%2Cmath%2F0607653%2Cmath%2F0607805%2Cmath%2F0607743%2Cmath%2F0607779%2Cmath%2F0607755%2Cmath%2F0607057%2Cmath%2F0607546%2Cmath%2F0607333%2Cmath%2F0607416%2Cmath%2F0607511%2Cmath%2F0607196%2Cmath%2F0607756%2Cmath%2F0607701%2Cmath%2F0607142%2Cmath%2F0607594%2Cmath%2F0607443%2Cmath%2F0607770%2Cmath%2F0607413%2Cmath%2F0607025%2Cmath%2F0607764%2Cmath%2F0607508%2Cmath%2F0607661%2Cmath%2F0607078%2Cmath%2F0607707%2Cmath%2F0607286%2Cmath%2F0607232%2Cmath%2F0607215%2Cmath%2F0607781%2Cmath%2F0607776%2Cmath%2F0607697%2Cmath%2F0607681%2Cmath%2F0607278%2Cmath%2F0607483%2Cmath%2F0607494%2Cmath%2F0607404%2Cmath%2F0607807%2Cmath%2F0607754%2Cmath%2F0607561%2Cmath%2F0607304%2Cmath%2F0607449%2Cmath%2F0607394%2Cmath%2F0607600%2Cmath%2F0607448%2Cmath%2F0607695%2Cmath%2F0607310%2Cmath%2F0607149%2Cmath%2F0607220%2Cmath%2F0607091%2Cmath%2F0607444%2Cmath%2F0607176%2Cmath%2F0607734%2Cmath%2F0607463%2Cmath%2F0607042%2Cmath%2F0607523%2Cmath%2F0607328%2Cmath%2F0607341%2Cmath%2F0607332%2Cmath%2F0607037%2Cmath%2F0607366%2Cmath%2F0607104%2Cmath%2F0607465%2Cmath%2F0607660%2Cmath%2F0607299%2Cmath%2F0607822%2Cmath%2F0607726%2Cmath%2F0607380%2Cmath%2F0607538%2Cmath%2F0607646%2Cmath%2F0607656%2Cmath%2F0607294%2Cmath%2F0607313%2Cmath%2F0607504%2Cmath%2F0607752%2Cmath%2F0607657%2Cmath%2F0607031%2Cmath%2F0607135%2Cmath%2F0607177&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We show that the mapping class group of a compact orientable surface with\nhigher complexity has the following extreme rigidity in the sense of measure\nequivalence: if the mapping class group is measure equivalent to a discrete\ngroup, then they are commensurable up to finite kernel. Moreover, we describe\nall lattice embeddings of the mapping class group into a locally compact second\ncountable group. We also obtain similar results for finite direct products of\nmapping class groups."}, "authors": ["Yoshikata Kida"], "author_detail": {"name": "Yoshikata Kida"}, "author": "Yoshikata Kida", "links": [{"title": "doi", "href": "http://dx.doi.org/10.4007/annals.2010.171.1851", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/math/0607600v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/math/0607600v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "39 pages", "arxiv_primary_category": {"term": "math.GR", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.GR", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.GT", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "20F38, 37A20", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/math/0607600v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/math/0607600v1", "journal_reference": "Ann. of Math. (2) 171 (2010) 1851-1901", "doi": "10.4007/annals.2010.171.1851", "fulltext": "arXiv:math/0607600v1 [math.GR] 24 Jul 2006\n\nMEASURE EQUIVALENCE RIGIDITY\nOF THE MAPPING CLASS GROUP\nYOSHIKATA KIDA\nAbstract. We show that the mapping class group of a compact orientable\nsurface with higher complexity has the following extreme rigidity in the sense\nof measure equivalence: if the mapping class group is measure equivalent to\na discrete group, then they are commensurable up to finite kernel. Moreover,\nwe describe all lattice embeddings of the mapping class group into a locally\ncompact second countable group. We also obtain similar results for finite direct\nproducts of mapping class groups.\n\n1. Introduction\nThe purpose of this paper is to establish a new rigidity theorem for the mapping\nclass group in terms of measure equivalence among discrete groups. In this paper,\nby a discrete group we mean a discrete and countable one. Measure equivalence\nwas introduced by Gromov [16] as follows:\nDefinition 1.1. We say that two discrete groups Γ and Λ are measure equivalent if\nthere exists a measure-preserving action of Γ × Λ on a standard Borel space (Σ, m)\nwith a σ-finite positive measure such that both restricted actions to Γ and Λ are\nessentially free and have a fundamental domain of finite measure. The space (Σ, m)\n(equipped with the Γ × Λ-action) is then called a ME coupling of Γ and Λ.\nIt is easy to see that measure equivalence defines an equivalence relation among\ndiscrete groups. One typical example of two measure equivalent groups is given by\nany two lattices in the same locally compact second countable (lcsc) group, which\nis the main geometric motivation for the introduction of this notion. Commensurability up to finite kernel is the equivalence relation for discrete groups defined\nby declaring two groups in an exact sequence 1 → A → B → C → 1 of discrete\ngroups to be equivalent if the third group is finite. Any two discrete groups which\nare commensurable up to finite kernel are measure equivalent.\nMeasure equivalence between two groups has another equivalent formulation in\nterms of orbit equivalence (see Subsection 2.3), which has been studied for a long\ntime and is closely related to ergodic theory and the theory of von Neumann algebras. The first magnificent result about orbit equivalence is due to Ornstein-Weiss\n[33] following Dye [5], [6] and it can be stated in terms of measure equivalence as\nfollows: a discrete group is measure equivalent to Z if and only if it is an infinite amenable group. (This result was generalized for amenable discrete measured\nDate: July 19, 2006.\n2000 Mathematics Subject Classification. Primary 20F38, 37A20.\nKey words and phrases. The mapping class group, the curve complex, measure equivalence\nrigidity, lattice embeddings.\n1\n\n\f2\n\nYOSHIKATA KIDA\n\nequivalence relations by Connes-Feldman-Weiss [4].) Note that Zimmer [40] extended the superrigidity theorem for semisimple Lie groups of non-compact type\ndue to Mostow-Margulis to one in the context of orbit equivalence, which is called\nhis cocycle superrigidity theorem, and he classified lattices in simple Lie groups of\nreal rank at least 2 up to measure equivalence. In addition to this classification, his\ncocycle superrigidity theorem has many applications to various rigidity phenomena\nof higher rank lattices.\nRecently, the study of measure equivalence and orbit equivalence is very rapidly\ndeveloping. Furman's beautiful rigidity result in [11] completely determines the\nclass of discrete groups measure equivalent to some higher rank lattices. Namely, if\na discrete group Λ is measure equivalent to a lattice in a connected simple Lie group\nG with finite center and real rank at least 2, then there exists a homomorphism from\nΛ onto a lattice in AdG whose kernel is finite. Gaboriau's discovery in [14] that\nl2 -Betti numbers for discrete groups are invariant under measure equivalence in a\ncertain sense leads to surprising progress in the classification problem of measure\nequivalence because these numerical invariants are defined for all discrete groups\nand are computable for various discrete groups arising geometrically. Popa showed\nin [34], [35] that the Bernoulli shifts of Kazhdan groups have various strong rigidity\nproperties in terms of orbit equivalence. It is remarkable that he treated all Kazhdan\ngroups, which is a very large class of groups. The reader should be referred to [15],\n[37], [38] for more details of recent development of measure equivalence and orbit\nequivalence.\nLet M = Mg,p be a connected compact orientable surface of type (g, p), that\nis, of genus g and with p boundary components. Throughout the paper, a surface\nis assumed to be connected, compact and orientable unless otherwise stated. The\nmapping class group Γ(M ) of M is defined as the group of isotopy classes of all\norientation-preserving diffeomorphisms of M . The extended mapping class group\nΓ(M )⋄ of M is the group of isotopy classes of all diffeomorphisms of M , which\ncontains Γ(M ) as a subgroup of index 2. Let κ(M ) = 3g + p − 4 be the complexity\nof M . If κ(M ) > 0, we say that M has higher complexity. Let C = C(M ) be\nthe curve complex for a surface M . In [25], we obtain some classification result\nof Γ(M ) in terms of measure equivalence and give various examples of discrete\ngroups not measure equivalent to Γ(M ). In the proof, we established fundamental\nmethods to study subrelations in a discrete measured equivalence relation arising\nfrom a standard action of Γ(M ), where a standard action means an essentially free,\nmeasure-preserving action on a standard Borel space with a finite positive measure.\nThe curve complex played one of the most important roles in the study of them.\nUsing these methods, we show the following rigidity theorem for Γ(M ), which can\nbe viewed as an analogue of Furman's rigidity theorem and is the main result of this\npaper. Let Aut(C) denote the automorphism group of the simplicial complex C.\nNote that Aut(C) and Γ(M ) are commensurable up to finite kernel (see Theorem\n2.5).\nTheorem 1.1. If a discrete group Λ is measure equivalent to the mapping class\ngroup Γ(M ) with κ(M ) > 0, then there exists a homomorphism ρ : Λ → Aut(C)\nwhose kernel and cokernel are both finite.\nThis theorem completely determines the class of discrete groups measure equivalent to Γ(M ) and provides the first example of infinite discrete groups with such\nan extreme rigidity in the theory of measure equivalence. Remark that uniform\n\n\fMEASURE EQUIVALENCE RIGIDITY OF THE MAPPING CLASS GROUP\n\n3\n\nand non-uniform lattices in Lie groups treated in Furman's rigidity result are not\ncommensurable up to finite kernel because they are not quasi-isometric [7]. Hence,\nif Γ is a lattice as in Furman's rigidity theorem, then there exists a discrete group\nwhich is measure equivalent to Γ and is not commensurable up to finite kernel with\nΓ.\nRemark 1.1. Although both Furman's and Popa's rigidity theorems are concerned\nwith discrete groups satisfying (or related to) Kazhdan's property, the mapping\nclass group for a surface of genus at most 2 does not have Kazhdan's property\nor more strongly, it contains a subgroup of finite index which admits a quotient\nisomorphic to a non-abelian free group of finite rank (see [32]). It is unknown\nwhether the mapping class groups for other surfaces have Kazhdan's property or\nnot.\nTheorem 1.1 completes the classification of mapping class groups up to measure\nequivalence.\nTheorem 1.2. Suppose that M 1 , M 2 are distinct surfaces of type (g1 , p1 ), (g2 , p2 ),\nrespectively with κ(M 1 ), κ(M 2 ) > 0 and g1 ≤ g2 . Moreover, assume that Γ(M 1 ) and\nΓ(M 2 ) are measure equivalent. Then we only have the following two possibilities:\n((g1 , p1 ), (g2 , p2 )) = ((0, 5), (1, 2)), ((0, 6), (2, 0)).\nRemark 1.2. Note that if κ(M ) < 0 and M 6= M1,0 , then Γ(M ) is finite. Both\nΓ(M1,0 ) and Γ(M1,1 ) are isomorphic to SL(2, Z) and Γ(M0,4 ) is commensurable up\nto finite kernel with SL(2, Z). It is known that Γ(M0,5 ) and Γ(M1,2 ) (resp. Γ(M0,6 )\nand Γ(M2,0 )) are commensurable up to finite kernel (see Theorem 2.5).\nLet Γ be a lattice in a connected simple Lie group G with finite center and\nreal rank at least 2. In the proof of Furman's rigidity theorem in [11], the main\ningredient is to prove the following (see [11, Theorem 4.1]): let (Ω, ω) be a self ME\ncoupling of Γ (i.e., a ME coupling of Γ and Γ). Then there exists an essentially\nunique almost Γ × Γ-equivariant Borel map Ψ : Ω → Aut(AdG), which means that\nΨ((γ, γ ′ )x) = Ad(γ)Ψ(x)Ad(γ ′ )−1\nfor any γ, γ ′ ∈ Γ and a.e. x ∈ Ω. Furman substantially used Zimmer's cocycle\nsuperrigidity theorem for the construction of Ψ. On the other hand, we can show\nthat for a self ME coupling (Σ, m) of Γ(M ), there exists an essentially unique almost\nΓ(M ) × Γ(M )-equivariant Borel map Φ : Σ → Aut(C), which means that\nΦ((γ, γ ′ )x) = π(γ)Φ(x)π(γ ′ )−1\nfor any γ, γ ′ ∈ Γ(M ) and a.e. x ∈ Σ. Here, π : Γ(M )⋄ → Aut(C) is the natural\nhomomorphism. This construction of Φ is the heart of the proof of Theorem 1.1.\nIn Section 3, we give an outline of the construction of Φ.\nAfter the construction of the map Φ, we apply Furman's and Monod-Shalom's\ntechniques in [11], [31] for higher rank lattices and non-trivial direct products of\nfinitely many groups with special properties (e.g., word-hyperbolic ones), which are\napplicable to a more general situation. More precisely, given a ME coupling (Σ′ , m′ )\nof Γ(M ) and a discrete group Λ, we construct the self ME coupling Σ′ ×Λ Λ ×Λ Σ̌′ .\nUsing their techniques for the equivariant Borel map from this self ME coupling\ninto Aut(C), one can find a homomorphism ρ as in Theorem 1.1.\nMoreover, we consider the same problem as above for a finite direct product\nΓ(M1 ) × * * * × Γ(Mn ) of mapping class groups Γ(Mi ) with κ(Mi ) > 0 for all i.\n\n\f4\n\nYOSHIKATA KIDA\n\nMonod-Shalom introduced in [31] the class C consisting of discrete groups Γ which\nadmit a mixing unitary representation π on a Hilbert space such that the second\nbounded cohomology Hb2 (Γ, π) of Γ with coefficient π does not vanish. They showed\nin that paper that a non-trivial finite direct product of discrete groups in C satisfies\nvarious measurable rigidity properties. The class C contains a large number of\ndiscrete groups arising geometrically (e.g., word-hyperbolic ones) and whether a\ndiscrete group is in C or not is invariant under measure equivalence. Hamenstädt\nproved in [19] that the mapping class group of a surface with higher complexity is\ncontained in C, so we can obtain various measurable rigidity theorems as in [31] for\ndirect products of mapping class groups.\nFollowing Monod-Shalom's ingenious technique treating fundamental domains\nfor actions on ME couplings, we can find an essentially unique almost equivariant\nBorel map from a self ME coupling of a direct product of Γ(Mi ) into the direct\nproduct of Aut(C(Mi )). In the same way as above, we can show the following\ntheorem similar to Theorem 1.1 for a direct product of Γ(Mi ):\nTheorem 1.3. Let n be a positive integer and let Mi be a surface with κ(Mi ) > 0\nfor i ∈ {1, . . . , n}. If a discrete group Λ is measure equivalent to the direct product\nΓ(M1 ) × * * * × Γ(Mn ), then there exists a homomorphism Λ → Aut(C(M1 )) × * * * ×\nAut(C(Mn )) whose kernel and cokernel are both finite.\nIn [13], Furman gave another application of the map Ψ mentioned above. He\ngave an explicit description of a lcsc group containing a lattice isomorphic to a\nlattice in a simple Lie group of higher rank. Roughly speaking, he showed that\nsuch a lcsc group can be built only from the ambient Lie group or from the lattice\nitself and their actions on a compact group. Following Furman, we describe a lcsc\ngroup containing a lattice isomorphic to the mapping class group as follows. We\nfix notations as follows: let n ∈ N and let Mi be a surface with κ(Mi ) > 0 for\ni ∈ {1, . . . , n}. Put\nG = Aut(C(M1 )) × * * * × Aut(C(Mn ))\nand let Gi be equal to Γ(Mi )⋄ or Aut(C(Mi )). Put G0 = G1 × * * * × Gn and let\nπ : G0 → G be the natural homomorphism.\nTheorem 1.4. Suppose that Γ is a subgroup of finite index in G0 and there is a\nlattice embedding σ : Γ → H into a lcsc group H, that is, σ is an injective homomorphism such that σ(Γ) is a lattice in H. Then we have a subgroup H0 of finite\nindex in H containing σ(Γ) and a compact normal subgroup K of H0 satisfying the\nfollowing:\n(i) [H : H0 ] ≤ [G : π(Γ)];\n(ii) The action of H on K by conjugation induces via σ an action of Γ on\nK and hence a semi-direct product Γ ⋉ K. Let p : Γ ⋉ K → H0 be the\nhomomorphism defined by Γ ∋ γ 7→ σ(γ) and K ∋ k 7→ k. Then p is\nsurjective;\n(iii) For γ ∈ Γ and k ∈ K, we have (γ, k) ∈ ker(p) if and only if π(γ) = e\nand k = σ(γ)−1 . In particular, if the kernel of the restriction of π to Γ is\ntrivial, then p is an isomorphism.\nThis theorem says that there exist no interesting lattice embeddings of the mapping class group. The following corollary can easily be shown:\n\n\fMEASURE EQUIVALENCE RIGIDITY OF THE MAPPING CLASS GROUP\n\n5\n\nCorollary 1.5. Let Γ be a subgroup of finite index in G0 and suppose that we have\na lattice embedding of Γ into a lcsc group H. Then the image of Γ is cocompact in\nH and H has infinitely many connected components.\nIt follows from this corollary that any subgroup of finite index of the mapping\nclass group for a surface with higher complexity can not be isomorphic to a lattice in\na semisimple Lie group, which was proved first by Kaimanovich-Masur [24]. They\nshowed more generally that any sufficiently large subgroup of the mapping class\ngroup can not be isomorphic to a lattice in a semisimple Lie group. In this direction,\nFarb-Masur [8], Bestvina-Fujiwara [2] and Yeung [39] studied homomorphisms from\na lattice in some semisimple Lie group into the mapping class group and concluded\nthat their images are finite.\nIn a subsequent paper [26], we give an application of the existence of an equivariant Borel map from a self ME coupling of the mapping class group, following\nFurman's idea in [12]. In [26], we establish orbit equivalence rigidity of ergodic\nstandard actions of the mapping class group and give a new example of a discrete\nmeasured equivalence relation which can not arise from any standard action of a\ndiscrete group. Moreover, we give uncountably many explicit examples of ergodic\nstandard actions of the mapping class group which are mutually non-orbit equivalent, using certain generalized Bernoulli shifts of the mapping class group.\nAcknowledgement. The author is grateful to Professor Ursula Hamenstädt for\nreading the first draft of this paper very carefully and giving many valuable suggestions. The author also thanks the Max Planck Institute for Mathematics at Bonn\nfor its warm hospitality.\n2. Preliminaries\n2.1. The mapping class group. In this subsection, we recall fundamental facts\nabout the mapping class group and several geometric objects related to it. We refer\nthe reader to [9], [21], [23] or Sections 3.1, 3.2, 4.3 and 4.5 in [25] and the references\ntherein for the material of this subsection.\nLet M = Mg,p be a surface of genus g and with p boundary components. Let\nΓ(M ), Γ(M )⋄ be the mapping class group and the extended one of M , respectively,\ndefined as in Section 1. Let κ(M ) = 3g + p − 4 be the complexity of M . When\nκ(M ) > 0, we say that M has higher complexity.\nFor a surface M , let V (C) = V (C(M )) be the set of all non-trivial isotopy classes\nof non-peripheral simple closed curves on M . Let S(M ) denote the set of all nonempty finite subsets of V (C) which can be realized disjointly on M at the same\ntime. If κ(M ) > 0, we can define the curve complex C = C(M ) as a simplicial\ncomplex whose vertex set is V (C) and simplex set is S(M ). Remark that when\nκ(M ) = 0, we can define the curve complex of M in a slightly different way so that\nits vertex set V (C) is given in the same way as above. If κ(M ) ≥ 0, then Γ(M )⋄\nhas the natural and simplicial action on C and C is connected and has infinite\ndiameter. Moreover, when C is equipped with a natural combinatorial metric, it is\nhyperbolic in the sense of Gromov (see [29]).\nLet M be a surface with κ(M ) ≥ 0 and let i : V (C)×V (C) → N be the geometric\nintersection number. Let MF = MF (M ) be the space of measured foliations on\nM . Let PMF = PMF(M ) be the space of projective measured foliations on M ,\nwhich is also called the Thurston boundary and is homeomorphic to the sphere of\n\n\f6\n\nYOSHIKATA KIDA\n\ndimension 6g − 7 + 2p. Note that S(M ) can naturally be embedded into PMF.\nThe geometric intersection number i can continuously and R>0 -homogeneously be\nextended to a function MF × MF → R≥0 in the following sense:\ni(r1 F1 , r2 F2 ) = r1 r2 i(F1 , F2 )\nfor any r1 , r2 ∈ R>0 and F1 , F2 ∈ MF . Hence, for two elements F1 , F2 ∈ PMF,\nwhether i(F1 , F2 ) = 0 or 6= 0 makes sense. It is clear that Γ(M )⋄ acts continuously\non both MF and PMF and\ni(gF1 , gF2 ) = i(F1 , F2 )\nfor any g ∈ Γ(M )⋄ and F1 , F2 ∈ MF (or PMF). Let\nMIN = {F ∈ PMF : i(F, α) 6= 0 for any α ∈ V (C)}\nbe the set of all minimal measured foliations on M , which is a Γ(M )⋄ -invariant\nBorel subset of PMF.\nThe Thurston boundary PMF is an ideal boundary of the Teichmüller space of\nT = T (M ) for M . The union T = T ∪ PMF is called the Thurston compactification of the Teichmüller space, which is homeomorphic to the closed Euclidean ball\nof dimension 6g − 6 + 2p whose boundary corresponds to PMF.\nFor g ∈ Γ(M ), let us denote by\nFix(g) = {x ∈ T : gx = x}\nthe fixed point set of g. Each element g ∈ Γ(M ) is classified as follows in terms of\nits fixed points on T (see Expóse 9, §V, Théorème and Expóse 11, §4, Théorème in\n[9]):\n(i) g has finite order and has a fixed point on T ;\n(ii) g is pseudo-Anosov, which means that Fix(g) consists of exactly two points\nin MIN ;\n(iii) g has infinite order and is reducible, which means that there exists σ ∈\nS(M ) such that gσ = σ.\nThese three types are mutually exclusive. We say that F ∈ PMF is a pseudoAnosov foliation if F is a fixed point for some pseudo-Anosov element. The set of\nall pseudo-Anosov elements is dense in PMF.\nSince the curve complex C is hyperbolic, we can consider its boundary ∂C at\ninfinity, which is not compact. There exists a natural Γ(M )-equivariant continuous\nmap MIN → ∂C, which is injective on the set of all uniquely ergodic measured\nfoliations. This set contains all pseudo-Anosov foliations (see [18], [27] or [25,\nSection 3.2]).\nA pseudo-Anosov element g ∈ Γ(M ) has the following remarkable dynamics on\nT (see [23, Theorem 7.3.A]): the two fixed points F± (g) ∈ MIN of g satisfy that\nif U is any neighborhood of F+ (g) in T and K is any compact set in T \\ {F− (g)},\nthen g n (K) ⊂ U for all sufficiently large n ∈ N.\nUsing the above classification of elements of Γ(M ), McCarthy-Papadopoulos [30]\nclassified subgroups Γ of Γ(M ) as follows:\n(i) Γ is finite;\n(ii) there exists a pseudo-Anosov element g ∈ Γ such that h{F± (g)} = {F± (g)}\nfor any h ∈ Γ. In this case, Γ is virtually cyclic;\n(iii) there exists σ ∈ S(M ) such that gσ = σ for any g ∈ Γ. In this case, Γ is\nsaid to be reducible;\n\n\fMEASURE EQUIVALENCE RIGIDITY OF THE MAPPING CLASS GROUP\n\n7\n\n(iv) Γ contains an independent pair {g1 , g2 } of pseudo-Anosov elements, which\nmeans {F± (g1 )} ∩ {F± (g2 )} = ∅. In this case, Γ contains a non-abelian free\nsubgroup and is said to be sufficiently large.\nWe recall the canonical reduction system (CRS) for a subgroup of Γ(M ), which\nplays an important role in the study of reducible subgroups. We refer the reader to\n[21, Chapter 7] for more details about CRS's. For σ ∈ S(M ), we denote by Mσ for\nsimplicity the surface obtained by cutting along a realization of curves in σ. For\nan integer m ≥ 3, let Γ(M ; m) be the subgroup of Γ(M ) consisting of all elements\nwhich act on the homology group H1 (M ; Z/mZ) trivially. This subgroup has the\nfollowing notable properties (see Theorem 1.2 and Corollaries 1.5, 1.8, 3.6 in [21]\nor [25, Section 4.3]):\nTheorem 2.1. In the above notation, the following assertions hold:\n(i) Γ(M ; m) is a torsion-free subgroup of finite index in Γ(M ).\n(ii) If g ∈ Γ(M ; m) and F ∈ PMF satisfy g n F = F for some n ∈ Z \\ {0}, then\ngF = F .\n(iii) If g ∈ Γ(M ; m) and σ ∈ S(M ) satisfy g n σ = σ for some n ∈ Z \\ {0}, then\ngα = α for any α ∈ S(M ) and g preserves each component of Mσ and of\nthe boundary of M .\nWhen we consider the problem of measure equivalence in subsequent sections,\nwe study actions of (a finite index subgroup of) Γ(M ; m) instead of Γ(M ).\nLet Γ be a subgroup of Γ(M ; m). A curve α ∈ V (C) is called an essential\nreduction class for Γ if the following two conditions are satisfied:\n(i) gα = α for any g ∈ Γ;\n(ii) if β ∈ V (C) satisfies i(α, β) 6= 0, then there exists g ∈ Γ such that gβ 6= β.\nThe canonical reduction system (CRS) σ(Γ) for Γ is defined to be the set of all\nessential reduction classes for Γ, which is either an element in S(M ) or empty. We\ncan define the CRS for a general subgroup Γ of Γ(M ) as the CRS for Γ ∩ Γ(M ; m),\nwhich is independent of m. It is known that an infinite subgroup Γ of Γ(M ) is\nreducible if and only if σ(Γ) is non-empty (see [21, Corollary 7.17]).\nGiven a subgroup Γ of Γ(M ; m) and σ ∈ S(M ) with gσ = σ for any g ∈ Γ,\nthanks to Theorem 2.1 (iii), we can define a natural homomorphism\nY\npσ : Γ →\nΓ(Q),\nQ\n\nwhere Q runs through all components of Mσ .\n\nLemma 2.2 ([3, Lemma 2.1 (1)], [23, Corollary 4.1.B]). The kernel of pσ is contained in the subgroup of Γ(M ) generated by Dehn twists about all curves in σ.\nFor each component Q of Mσ , let pQ : Γ → Γ(Q) be the composition of pσ with\nthe projection onto Γ(Q). It is known that if a subgroup Γ of Γ(M ; m) is reducible\nand Q is a component of Mσ(Γ) , then the image pQ (Γ) either is trivial or contains\na pseudo-Anosov element in Γ(Q) (see [21, Corollary 7.18]). If pQ (Γ) is trivial,\ninfinite amenable or non-amenable, then Q is said to be T, IA or IN, respectively.\nLemma 2.3. Let Γ be a finite index subgroup of Γ(M ) and define a subgroup\nΓσ = {g ∈ Γ : gσ = σ}\nfor σ ∈ S(M ). Then the CRS for Γσ is equal to σ.\n\n\f8\n\nYOSHIKATA KIDA\n\nThis lemma follows easily from [21, Theorem 7.16] because any component of\nMσ which is not a pair of pants is IN for Γσ if Γ is a finite index subgroup of\nΓ(M ; m) with an integer m ≥ 3.\nLemma 2.4. Let Γ be an infinite subgroup of Γ(M ; m) and let α ∈ V (C(M )).\nAssume that gα = α for all g ∈ Γ. If for each component Q of Mα , we have gβ = β\nfor any β ∈ V (C(Q)) and g ∈ Γ, then the CRS for Γ is {α}.\nProof. Since Γ is infinite and reducible, the CRS σ(Γ) for Γ is non-empty. Let\nδ ∈ σ(Γ). We show that δ = α. Let Q be a component of Mα . If δ ∈ V (C(Q)),\nthen there exists β ∈ V (C(Q)) with i(β, δ) 6= 0. By assumption, β is invariant for\nΓ, which contradicts the assumption that δ is an essential reduction class for Γ.\nThus, either i(δ, α) 6= 0 or δ = α. The former case can not happen because α is\ninvariant for Γ and δ ∈ σ(Γ).\n\u0003\n2.2. The automorphism group of the curve complex. Let M be a surface\nwith κ(M ) > 0. Then we have the natural homomorphism π : Γ(M )⋄ → Aut(C).\nTheorem 2.5 ([22], [28]). Let M be a surface with κ(M ) > 0.\n(i) If M is neither M1,2 nor M2,0 , then π is an isomorphism.\n(ii) If M = M1,2 , then the image of π is a subgroup of Aut(C) with index 5\nand ker(π) is the subgroup generated by a hyperelliptic involution, which is\nisomorphic to Z/2Z.\n(iii) If M = M2,0 , then π is surjective and ker(π) is the subgroup generated by\na hyperelliptic involution, which is isomorphic to Z/2Z.\n(iv) The two curve complexes C(M0,5 ), C(M1,2 ) (resp. C(M0,6 ), C(M2,0 )) are\nisomorphic as simplicial complexes.\nTheorem 2.6. Let Γ be a subgroup of finite index in Aut(C). For each g0 ∈\nAut(C) \\ {e}, the set {gg0 g −1 : g ∈ Γ} consists of infinitely many elements.\nProof. We may assume that M 6= M1,2 , M2,0 by Theorem 2.5 (iv). By Theorem\n2.5 (i), we identify Aut(C) with Γ(M )⋄ . Let g0 ∈ Γ(M )⋄ and assume that the set\n{gg0 g −1 : g ∈ Γ} consists of only finitely many elements. Then note that for any\ninfinite subset {hn }n∈N of Γ, there exists an infinite subsequence {ni }i∈N of N such\n−1\nthat hni g0 h−1\nni = hnj g0 hnj for each i, j. Put\nFix(g0 ) = {x ∈ T : g0 x = x},\nwhich is a non-empty closed subset of T .\nAssume Fix(g0 ) 6⊃ PMF. If we deduce a contradiction, then the inclusion\nFix(g0 ) ⊃ PMF holds, which implies g0 = e and completes the proof. Since the\nset of pseudo-Anosov foliations is dense in PMF , we can find an independent pair\n{g1 , g2 } ⊂ Γ(M ) of pseudo-Anosov elements such that F+ (g1 ), F+ (g2 ) ∈ PMF \\\nFix(g0 ). Using the assumption that Γ is a subgroup of finite index in Γ(M )⋄ , we\nmay assume that g1 , g2 ∈ Γ.\nLet s ∈ Fix(g0 ). It follows from the above remark that there exists an infinite\nincreasing subsequence {ni } of N such that g1−ni g0 g1ni = g0 for each i. Then we\nhave s = g0 s = g1−ni g0 g1ni s, which implies g1ni s ∈ Fix(g0 ) for each i. If s 6= F− (g1 ),\nthen g1ni s → F+ (g1 ) ∈ PMF \\ Fix(g0 ) as i → ∞, which is a contradiction. Thus,\ns = F− (g1 ). Similarly, we can show that if s ∈ Fix(g0 ), then s = F− (g2 ), which is\na contradiction because the pair {g1 , g2 } is independent.\n\u0003\n\n\fMEASURE EQUIVALENCE RIGIDITY OF THE MAPPING CLASS GROUP\n\n9\n\n2.3. Measure equivalence and orbit equivalence. In this subsection, we recall\nthe construction of weakly orbit equivalent actions from a ME coupling given in [12,\nSection 3]. We refer the reader to [1] for the terminology of an r-discrete measured\ngroupoid and its amenability. We fix notations as follows: given an r-discrete\nmeasured groupoid G on a standard finite measure space (X, μ) (i.e., a standard\nBorel space with a finite positive measure) and a Borel subset A ⊂ X with positive\nmeasure, we denote by\n(G)A = {γ ∈ G : r(γ), s(γ) ∈ A}\nthe restricted groupoid to A, where r, s : G → X are the range, source maps, respectively. For x, y ∈ X, let\nGyx = {γ ∈ G : r(γ) = x, s(γ) = y}\nand let ex ∈ Gxx denote the unit. If A is a Borel subset of X, then GA denotes the\nsaturation defined by\nGA = {r(γ) ∈ X : γ ∈ G, s(γ) ∈ A},\nwhich is a Borel subset of X.\nLet (Σ, m) be a ME coupling of discrete groups Γ and Λ, and choose fundamental\ndomains Y, X ⊂ Σ for the Γ-, Λ-actions. Remark that we have a natural Γ-action\non X equipped with the restricted measure of m because X can be identified with\nthe quotient space Σ/Λ as Borel spaces. Similarly, we have a natural Λ-action on\nY . In order to distinguish from the original Γ-, Λ-actions on Σ, we denote the Γ-,\nΛ-actions on X, Y by γ * x, λ * y, respectively, using a dot. Note that we can choose\nX and Y so that A = X ∩ Y satisfies Γ * A = X and Λ * A = Y up to null sets. In\nwhat follows, suppose that X and Y satisfy this condition.\nLet G = Γ ⋉ X (resp. H = Λ ⋉ Y ) be the r-discrete measured groupoid on (X, μ)\n(resp. (Y, ν)) constructed from the above action. We can define cocycles\nα : Γ × X → Λ, β : Λ × Y → Γ\nso that γ * x = α(γ, x)γx ∈ X and λ * y = β(λ, y)λy ∈ Y for any γ ∈ Γ, λ ∈ Λ and\na.e. x ∈ X, y ∈ Y . Let\np : X → Y, q : Y → X\nbe the Borel maps defined by\np(x) = Γx ∩ Y, q(y) = Λy ∩ X\nfor x ∈ X and y ∈ Y . Note that both p and q are the identity on A = X ∩ Y and\np(γ * x) = α(γ, x) * p(x), q(λ * y) = β(λ, y) * q(y)\nfor any γ ∈ Γ, λ ∈ Λ and a.e. x ∈ X, y ∈ Y . Define groupoid homomorphisms\nf : G ∋ (γ, x) 7→ (α(γ, x), p(x)) ∈ H\ng : H ∋ (λ, y) 7→ (β(λ, y), q(y)) ∈ G.\nNote that β(α(γ, x), x) = γ for any γ ∈ Γ and a.e. x ∈ A with γ * x ∈ A, and\nα(β(λ, y), y) = λ for any λ ∈ Λ and a.e. y ∈ A with λ * y ∈ A. Therefore, we obtain\nthe following:\nProposition 2.7. The groupoid homomorphisms\nf : (G)A → (H)A , g : (H)A → (G)A\nsatisfy g ◦ f = id and f ◦ g = id.\n\n\f10\n\nYOSHIKATA KIDA\n\nThis proposition implies that the two actions of Γ on X and Λ on Y are weakly\norbit equivalent.\nConsider the Γ × Λ-action on X × Λ defined by\nγλ(x, λ′ ) = (γ * x, α(γ, x)λ′ λ−1 ).\nIt is easy to check the following lemma:\nLemma 2.8. The Borel map Σ → X × Λ defined by λx 7→ (x, λ−1 ) for x ∈ X and\nλ ∈ Λ is Borel isomorphic and Γ × Λ-equivariant.\nConversely, we know the following theorem. For simplicity, a standard action of\na discrete group means an essentially free, measure-preserving Borel action of it on\na standard finite measure space.\nTheorem 2.9 ([12, Theorem 3.3]). If two discrete groups Γ and Λ have ergodic\nstandard actions on (X, μ) and (Y, ν) which are weakly orbit equivalent, then we\ncan construct a ME coupling (Σ, m) of Γ and Λ such that the Γ-actions on X and\nΛ\\Σ (resp. the Λ-actions on Y and Γ\\Σ) are isomorphic.\n2.4. Normal subgroupoids. In this subsection, we introduce the notion of normal\nsubgroupoids of an r-discrete measured groupoid, based on [10], [25, Subsection\n4.6.1]. This notion is a generalization of normal subrelations of a discrete measured\nequivalence relation and also a generalization of normal subgroups of a discrete\ngroup.\nLet G be an r-discrete measured groupoid on a standard finite measure space\n(X, μ) and r, s : G → X be the range, source maps, respectively. Let S be a subgroupoid of G. In this paper, a subgroupoid of G means a Borel subgroupoid of G\nwhose unit space is the same as the one for G. Let us denote by EndS (G) the set\nof all Borel maps φ : dom(φ) → G from a Borel subset of X such that\n(i) s(φ(x)) = x for a.e. x ∈ dom(φ);\n(ii) γ ∈ S if and only if φ(r(γ))γφ(s(γ))−1 ∈ S for a.e. γ ∈ (G)dom(φ) .\nLet [[G]]S be the subset of EndS (G) consisting of all φ such that the map dom(φ) ∋\nx 7→ r(φ(x)) ∈ X is injective a.e. on the domain. When S is trivial, we write [[G]]\ninstead of [[G]]S .\nWe define the composition ψ◦φ : dom(ψ◦φ) → G of two elements φ, ψ ∈ EndS (G)\nby\ndom(ψ ◦ φ) = {x ∈ dom(φ) : r(φ(x)) ∈ dom(ψ)},\nψ ◦ φ(x) = ψ(r(φ(x)))φ(x)\nfor x ∈ dom(ψ ◦ φ). It is easy to check that ψ ◦ φ ∈ EndS (G).\nDefinition 2.1. A subgroupoid S of an r-discrete measured groupoid G on a standard finite measure space (X, μ) is said to be normal in G if the following condition is\nsatisfied: there exists a countable family {φn } of maps in EndS (G) such that for a.e.\nγ ∈ G, we can find φn in the family satisfying r(γ) ∈ dom(φn ) and φn (r(γ))γ ∈ S.\nIn this case, we write S ⊳ G and we call {φn } a family of normal choice functions\nfor the pair (G, S).\nThe following two lemmas give natural examples of normal subgroupoids:\nLemma 2.10. Suppose that a discrete group G has a non-singular action on (X, μ)\nand H is a normal subgroup of G. Let GG and GH be the groupoids generated by\nthe actions of G and H, respectively. Then the subgroupoid GH is normal in GG .\n\n\fMEASURE EQUIVALENCE RIGIDITY OF THE MAPPING CLASS GROUP\n\n11\n\nThe following two lemmas can be proved by using [25, Theorem 3.9]:\nLemma 2.11. Let G be an r-discrete measured groupoid on (X, μ). Then the\nisotropy groupoid\nG0 = {γ ∈ G : r(γ) = s(γ)}\nis normal in G.\nLemma 2.12. Let G be an r-discrete measured groupoid on (X, μ) and let A be a\nBorel subset of X. Then we can find a Borel map f : GA → G such that\n(i) s(f (x)) = x and r(f (x)) ∈ A for a.e. x ∈ GA;\n(ii) f (x) = ex ∈ Gxx for a.e. x ∈ A, where Gxx = {γ ∈ G : r(γ) = s(γ) = x} and\nex is the identity element of the isotropy group Gxx .\nLemma 2.13. Let G be an r-discrete measured groupoid on (X, μ) and let S be a\nnormal subgroupoid of G. If A is a Borel subset of X with positive measure, then\n(S)A is normal in (G)A .\nProof. Let {φn } be a family of normal choice functions for the pair (G, S). We\nwrite B = SA and\nDn = {x ∈ A ∩ dom(φn ) : r(φn (x)) ∈ B}.\nDefine a Borel map φ′n : Dn → (G)A by φ′n (x) = f (r(φn (x)))φn (x) for x ∈ Dn ,\nwhere f : B → S is a Borel map given by Lemma 2.12 such that\n• s(f (x)) = x and r(f (x)) ∈ A for a.e. x ∈ B = SA;\n• f (x) = ex ∈ Sxx for a.e. x ∈ A.\nWe show that {φ′n } is a family of normal choice functions for ((G)A , (S)A ). Since\n′\nφn is the composition of φn and f , we see that φ′n ∈ EndS (G). Let γ ∈ (G)A .\nThen there exists φn such that r(γ) ∈ dom(φn ) and φn (r(γ))γ ∈ S. Note that\nr(γ) ∈ A ∩ dom(φn ) and r(φn (r(γ))) = r(φn (r(γ))γ) ∈ SA. Therefore, r(γ) ∈ Dn\nand\nφ′n (r(γ))γ = f (r(φn (r(γ))))φn (r(γ))γ ∈ (S)A ,\nwhich completes the proof.\n\n\u0003\n\nLemma 2.14. Let G be a discrete group generated by two subgroups G1 , G2 so\nthat G1 is normal in G and assume that we have a non-singular action of G on\na standard finite measure space (X, μ). We denote by G, G1 and G2 the groupoids\narising from the actions of G, G1 and G2 , respectively. Let A ⊂ X be a Borel subset\nwith positive measure. Then (G1 )A is normal in the subgroupoid H = (G1 )A ∨ (G2 )A\nof (G)A generated by the two subgroupoids (G1 )A and (G2 )A .\nProof. For each i = 1, 2 and g ∈ Gi , define Ag = A ∩ g −1 A and ψg : Ag → (G)A\nby ψg (x) = (g, x) for x ∈ Ag . It is easy to check that ψg ∈ End(G1 )A (H). For\neach word ω of elements in G1 and G2 , we can naturally define the composition\nψω ∈ End(G1 )A (H) of ψg . It is clear that {ψω }ω forms a family of normal choice\nfunctions for (H, (G1 )A ).\n\u0003\n3. Actions of some discrete groups\n3.1. Actions of the mapping class group. In Sections 4 and 5, we consider\nmainly the groupoid generated by an action of the mapping class group and its\nsubgroupoids. In this subsection, we collect some results about them. Most of the\n\n\f12\n\nYOSHIKATA KIDA\n\nfollowing results can be shown in the same way as in [25], where we assume that\nthe action is essentially free.\nDefinition 3.1. An r-discrete measured groupoid G on (X, μ) is said to be of\ninfinite type if there exists a Borel partition X = A1 ⊔ A2 such that\n(i) for a.e. x ∈ A1 , the isotropy group Gxx is infinite;\n(ii) the associated principal groupoid of (G)A2 defined by\n{(r(γ), s(γ)) ∈ A2 × A2 : γ ∈ (G)A2 }\nis recurrent.\nNote that for any n ∈ N ∪ {∞}, the subset\nXn = {x ∈ X : |Gxx | = n}\nis measurable and satisfies GXn = Xn .\nLet G be an r-discrete measured groupoid on (X, μ) and let ρ : G → G be a\ngroupoid homomorphism into a standard Borel group G. Let S be a Borel Gspace. Recall that a Borel map φ : A → S from a Borel subset A ⊂ X is said to\nbe ρ-invariant (or invariant for simplicity) for G if ρ(γ)φ(s(γ)) = φ(r(γ)) for a.e.\nγ ∈ (G)A .\nLemma 3.1. In the above situation, let us define a Borel map φ′ : GA → S by\nφ′ (x) = ρ(f (x)−1 )φ(r(f (x))) for x ∈ GA, where f : GA → G is a Borel map constructed in Lemma 2.12. Then φ′ is also ρ-invariant for G.\nProof. Let γ ∈ (G)GA and put y = r(γ), x = s(γ) ∈ GA. Then\nρ(γ)φ′ (x) = ρ(f (y)−1 )ρ(f (y)γf (x)−1 )φ(r(f (x)))\n= ρ(f (y)−1 )φ(r(f (y))) = φ′ (y)\nsince f (y)γf (x)−1 ∈ (G)A and r(f (y)γf (x)−1 ) = r(f (y)).\n\n\u0003\n\nAssumption 3.1. We call the following assumption (⋆): let Γ be a subgroup of\nΓ(M ; m), where M is a surface with κ(M ) > 0 and m ≥ 3 is an integer. Let (X, μ)\nbe a standard finite measure space. We assume that there exists a non-singular\naction of Γ on (X, μ) generating the groupoid\nG = GΓ = {(γ, x) ∈ Γ × X : γ ∈ Γ, x ∈ X}.\nand the induced cocycle\nρ : G → Γ, (γ, x) 7→ γ\nfor γ ∈ Γ and a.e. x ∈ X.\nUnder the above assumption, we often use the following notation:\n• For a subgroup Γ′ of Γ, let GΓ′ denote the subgroupoid of G generated by\nthe action of Γ′ .\n• For σ ∈ S(M ), we denote by Dσ the intersection of Γ and the subgroup\ngenerated by Dehn twists about all curves in σ. We write Gσ instead of\nGDσ for simplicity. If σ consists of one element α ∈ V (C), then we write\nDα (resp. Gα ) instead of Dσ (resp. Gσ ).\nAs in [25], we can consider two types of subgroupoids of infinite type, following\nthe classification of subgroups of Γ(M ) mentioned in Subsection 2.1. We denote by\nM (PMF) the space of all probability measures on PMF.\n\n\fMEASURE EQUIVALENCE RIGIDITY OF THE MAPPING CLASS GROUP\n\n13\n\nTheorem 3.2 ([25, Theorem 4.41]). Under the assumption (⋆), let Y ⊂ X be a\nBorel subset with positive measure and let S be a subgroupoid of (G)Y of infinite\ntype. If we have an invariant Borel map φ : Y → M (PMF) for S, then there exists\na Borel partition Y = Y1 ⊔ Y2 satisfying the following:\n(i) φ(x)(MIN ) = 1 for a.e. x ∈ Y1 ;\n(ii) φ(x)(PMF \\ MIN ) = 1 for a.e. x ∈ Y2 .\nIn the above theorem, remark that both Y1 and Y2 are invariant for S and if Y ′\nis a Borel subset of Y with positive measure and ψ : Y ′ → M (PMF) is another\ninvariant Borel map for S, then ψ satisfies\n(i) ψ(x)(MIN ) = 1 for a.e. x ∈ Y1 ∩ Y ′ ;\n(ii) ψ(x)(PMF \\ MIN ) = 1 for a.e. x ∈ Y2 ∩ Y ′ ,\nwhere Y1 , Y2 are Borel subsets as in the above theorem. Hence, it is natural to give\nthe following definition:\nDefinition 3.2. Under the assumption (⋆), let Y ⊂ X be a Borel subset with\npositive measure and let S be a subgroupoid of (G)Y of infinite type.\n(i) If we have an invariant Borel map φ : Y → M (PMF) for S such that\nφ(x)(MIN ) = 1 for a.e. x ∈ Y , then S is said to be irreducible and\namenable (or IA in short).\n(ii) If we have an invariant Borel map φ : Y → M (PMF) for S such that\nφ(x)(PMF \\ MIN ) = 1 for a.e. x ∈ Y , then S is said to be reducible.\nWe have explained in Section 1 that the key ingredient of the proof of Theorem\n1.1 is to construct an essentially unique almost Γ(M ) × Γ(M )-equivariant Borel\nmap Φ : Σ → Aut(C) for a self ME coupling (Σ, m) of Γ(M ). We give a rough\noutline of the construction of the map Φ. In [25], we developed the theory of\nrecurrent subrelations of an equivalence relation arising from a standard action of\nthe mapping class group. Thanks to it, we can divide such subrelations into two\ntypes, irreducible and amenable (IA) ones and reducible ones as in Theorem 3.2\nand Definition 3.2. The notion of normal subrelations also played an important role\nin the classification theorem of [25]. In what follows in this section, we generalize\nvarious central results in [25] about the above subrelations to the case where the\naction of the mapping class group is not necessarily essentially free. In this case,\nalthough we need to consider r-discrete measured groupoids arising from group\nactions, the proof can be proceeded along the same line.\nIn Section 4, using various results in this section, we characterize a reducible subgroupoid in terms of amenability, non-amenability and normality (see Propositions\n4.1, 4.2). Note that these three properties are preserved under an isomorphism\nbetween two groupoids, and that as mentioned in Subsection 2.3, considering a\nself ME coupling of Γ(M ) is almost equivalent to considering an isomorphism f\nbetween two groupoids G1 , G2 arising from measure-preserving actions of Γ(M ).\nThanks to the characterization of a reducible subgroupoid, we see that the image\nof a reducible subgroupoid of G1 via f is also reducible. Moreover, maximal reducible subgroupoids are mapped to maximal ones by f (see Corollary 4.5, Lemma\n4.6 and Corollary 4.7).\nLet G be the groupoid associated with a measure-preserving action of Γ(M ) on\na standard finite measure space (X, μ). As a next stage, in Section 5, we study an\namenable normal subgroupoid S of infinite type of a maximal reducible subgroupoid\n\n\f14\n\nYOSHIKATA KIDA\n\nof G. We can show that S is contained in the groupoid generated by the action of a\nDehn twist about some simple closed curve on M up to a countable Borel partition\nof X (see Lemma 5.1). Conversely, the subgroupoid generated by the action of\na Dehn twist about a simple closed curve is normal in some maximal reducible\nsubgroupoid of G. It follows that roughly speaking, the subgroupoid generated\nby a Dehn twist about a simple closed curve can be characterized in terms of\namenability, non-amenability and normality, and in the situation of the previous\nparagraph, we see that such subgroupoids are preserved by f . This means that\nf induces a bijection of the set V (C) of all isotopy classes of simple closed curves\non M , which is shown to be an automorphism of the curve complex. Translating\nthis fact into structural information on a self ME coupling (Σ, m) of Γ(M ), we can\nconstruct an almost Γ(M ) × Γ(M )-equivariant Borel map Φ from Σ into Aut(C)\nas mentioned in Section 1.\nRemark 3.1. When κ(M ) > 0 and M 6= M1,2 , M2,0 , Ivanov [23, Section 8.5] showed\nthat any isomorphism from a finite index subgroup of Γ(M )⋄ into a finite index\nsubgroup of Γ(M )⋄ is the restriction of a unique inner automorphism of Γ(M )⋄ . A\nkey ingredient of his proof is to show that such an isomorphism f maps sufficiently\nhigh powers of Dehn twists into powers of Dehn twists by characterizing a (power\nof) Dehn twist algebraically (see [23, Theorem 7.5.B]). It follows that f yields a\nbijection on the set V (C), which is, in fact, an automorphism of the curve complex.\nThis automorphism comes from an element g in Γ(M )⋄ by Ivanov's theorem (see\nTheorem 2.5). After an easy computation shown in the proof of Theorem 8.5.A in\n[23], we can prove that f is the restriction of the inner automorphism of Γ(M ) by\nconjugation with g. Our construction of the map Φ mentioned above relies heavily\non this idea due to Ivanov.\nRemark 3.2. Note that if we only want to prove Theorem 1.1, then it is not necessary\nto generalize the results in [25] to the case where the standard action of the mapping\nclass group is not necessarily essentially free because in general, when two discrete\ngroups Λ1 , Λ2 are measure equivalent, there exists a ME coupling of Λ1 and Λ2\nsuch that the Λ1 × Λ2 -action on it is essentially free, which induces weakly orbit\nequivalence between standard actions of Λ1 and Λ2 . However, in Theorem 1.4,\nwe need to consider a ME coupling of Γ(M ) such that the Γ(M ) × Γ(M )-action\nis not necessarily essentially free. Moreover, thanks to the generalization, we can\nobtain some information about stabilizers of measure-preserving actions of Γ(M )\n(see Corollaries 3.9 and 3.17).\nIn the following theorems, we collect basic properties of the two types of subgroupoids of a groupoid generated by an action of the mapping class group, which\nare called IA and reducible subgroupoids, respectively. First, we consider IA subgroupoids.\nSince the curve complex C is a hyperbolic metric space [29], we can construct\nthe boundary ∂C at infinity, which is non-empty (see [18], [27] or [25, Section 3.2]).\nLet ∂2 C be the quotient space of ∂C × ∂C by the coordinate exchanging action of\nthe symmetric group of two letters and let M (∂C) be the space of all probability\nmeasures on ∂C, which has the Borel structure introduced in the comment before\nProposition 4.30 in [25]. Each element in ∂2 C can naturally be viewed as an atomic\nmeasure in M (∂C) so that each atom has measure 1 or 1/2. Then ∂2 C is a Borel\nsubset of M (∂C).\n\n\fMEASURE EQUIVALENCE RIGIDITY OF THE MAPPING CLASS GROUP\n\n15\n\nUnder the assumption (⋆), let Y ⊂ X be a Borel subset with positive measure\nand let S be a subgroupoid of (G)Y of infinite type. Note that if S is IA, then we can\nconstruct an invariant Borel map Y → M (∂C) for S by using the Γ(M )-equivariant\nmap MIN → ∂C, which is constructed in [27] (see also [18]).\nProposition 3.3 ([25, Proposition 4.32 (ii), Corollary 4.43]). Under the assumption (⋆), let Y ⊂ X be a Borel subset with positive measure and let S be a subgroupoid of (G)Y of infinite type. Suppose that S admits a ρ-invariant Borel map\nφ : Y → M (∂C). Then the cardinality of supp(φ(x)) is at most 2 for a.e. x ∈ Y\nand S is IA.\nTheorem 3.4 ([25, Section 4.4.1, Lemma 4.58]). Under the assumption (⋆), let\nY ⊂ X be a Borel subset with positive measure and let S be a subgroupoid of (G)Y\nof infinite type. Suppose that S is IA. Then\n(i) there exists an essentially unique invariant Borel map φ0 : Y → ∂2 C for S\nsatisfying the following: if Y ′ is a Borel subset of Y with positive measure\nand φ : Y ′ → M (∂C) is an invariant Borel map for S, then\nsupp(φ(x)) ⊂ supp(φ0 (x))\nfor a.e. x ∈ Y ′ , where supp(ν) denotes the support of a measure ν.\n(ii) if T is a subgroupoid of (G)Y with S ⊳ T , then φ0 is invariant also for T .\n(iii) the groupoid S is amenable.\nIf X is a point and G is isomorphic to Γ, then the above facts follow from the\nclassification of subgroups of Γ(M ) described in Subsection 2.1. In this case, using\nproperties of pseudo-Anosov elements, we can prove that S is virtually cyclic, which\nimplies Theorem 3.4 (iii). To prove Theorem 3.4 (iii) in a general case, we need to\nuse the amenability in a measurable sense of the action of Γ(M ) on ∂C (or ∂2 C).\nRemark 3.3. Under the assumption (⋆), let Y ⊂ X be a Borel subset with positive\nmeasure and let S be a subgroupoid of (G)Y of infinite type. It follows from Theorem\n3.2 that there exists an essentially unique Borel partition Y = Y1 ⊔Y2 ⊔Y3 satisfying\nthe following:\n• if Y1 has positive measure, then (S)Y1 is IA;\n• if Y2 has positive measure, then (S)Y2 is reducible;\n• if Y3 has positive measure, then (S)Y3′ admits no invariant Borel maps\nY3′ → M (PMF) for any Borel subset Y3′ of Y3 with positive measure.\nIf S is amenable and any restriction of S to a Borel subset of Y with positive\nmeasure is not reducible, then S is IA, and the converse also holds by Theorem 3.4.\nNext, we recall basic properties of reducible subgroupoids. We can define the\ncanonical reduction system for a reducible subgroupoid as in the case of a reducible\nsubgroup.\nDefinition 3.3. Under the assumption (⋆), let Y ⊂ X be a Borel subset with\npositive measure and let S be a subgroupoid of (G)Y of infinite type. Let A be a\nBorel subset of Y with positive measure and let α ∈ V (C).\n(i) We say that the pairF(α, A) is ρ-invariant for S if there exists a countable\nBorel partition A = An of A such that the constant map An → {α} is\ninvariant for S for each n.\n\n\f16\n\nYOSHIKATA KIDA\n\n(ii) Suppose that (α, A) is ρ-invariant for S. The pair (α, A) is said to be purely\nρ-invariant if (β, B) is not ρ-invariant for S for any Borel subset B of A\nwith positive measure and any β ∈ V (C) with i(α, β) 6= 0. (In [25], we call\nthis pair an essential ρ-invariant one for S.)\nSince we consider a countable Borel partition in the definition of a ρ-invariant\npair, we can easily show that if there are α ∈ V (C) and a Borel subset An ⊂ Y for\nn ∈ N with\nS (α, An ) ρ-invariant for S (or purely ρ-invariant, respectively), then the\npair (α, An ) is also ρ-invariant for S (or purely ρ-invariant, respectively) by [25,\nLemma 4.47]. It follows that for each α ∈ V (C), we can find an essentially maximal\nBorel subset Aα ⊂ Y such that (α, Aα ) is ρ-invariant for S (or purely ρ-invariant,\nrespectively) unless there exist no ρ-invariant pairs for S (or purely ρ-invariant,\nrespectively).\nTheorem 3.5 ([25, Section 4.5, Lemma 4.60]). Under the assumption (⋆), let\nY ⊂ X be a Borel subset with positive measure and let S be a subgroupoid of (G)Y\nof infinite type. Suppose that S is reducible. Then\n(i) there exists a purely ρ-invariant pair for S.\n(ii) we can define an essentially unique invariant Borel map φ : Y → S(M ) for\nS so that\n(a) if σ ∈ S(M ) satisfies μ(φ−1 (σ)) > 0 and α ∈ σ, then (α, φ−1 (σ)) is a\npurely ρ-invariant pair for S;\n(b) if (α, A) is a purely ρ-invariant pair for S, then\nμ(A \\ φ−1 ({σ ∈ S(M ) : α ∈ σ})) = 0.\n(iii) if T is a subgroupoid of (G)Y with S ⊳ T , then φ is invariant also for T .\nNote that we can construct φ in Theorem 3.5 (ii) from (i) by the observation\nright before Theorem 3.5. We call φ in the above theorem the canonical reduction\nsystem (CRS) for S. It is easy to see that if A is a Borel subset of Y with positive\nmeasure, then the CRS for (S)A is the restriction of φ to A (see [25, Lemma 4.53\n(iii)]). If X is a point and G is isomorphic to Γ, then the above definition of the\nCRS for S coincides with the one mentioned in Subsection 2.1.\nIn the following two lemmas, we study the CRS's for certain reducible subgroupoids arising from the actions of reducible subgroups.\nLemma 3.6. Under the assumption (⋆), suppose that the Γ-action on (X, μ) is\nmeasure-preserving. Let G be an infinite reducible subgroup of Γ and let σ ∈ S(M )\nbe the CRS for G. Then GG is reducible and its CRS φ : X → S(M ) is constant\nwith value σ.\nProof. It is clear that GG is reducible and for any α ∈ σ, the pair (α, X) is ρinvariant for GG . Assume that there exists α ∈ σ such that the pair (α, X) is not\npurely ρ-invariant for GG . Then we would have a Borel subset B of X with positive\nmeasure and β ∈ V (C) with i(α, β) 6= 0 such that (β, B) is a ρ-invariant pair\nfor GG . It follows that there exists a Borel subset B ′ of B with positive measure\nsuch that ρ(γ)β = β for a.e. γ ∈ (GG )B ′ . We can find g ∈ G of infinite order\nwith gβ 6= β since α ∈ σ. Since g has infinite order and the Γ-action on (X, μ)\npreserves the finite positive measure μ, the subgroupoid (Ghgi )B ′ is of infinite type,\nwhere hgi denotes the cyclic subgroup generated by g. We can find a Borel subset\nB1′ ⊂ B ′ with positive measure and n ∈ Z \\ {0} such that (g n , x) ∈ (Ghgi )B ′ for any\n\n\fMEASURE EQUIVALENCE RIGIDITY OF THE MAPPING CLASS GROUP\n\n17\n\nx ∈ B1′ . Thus, g n β = ρ(g n , x)β = β holds for any x ∈ B1′ . Since G is a subgroup\nof Γ(M ; m), it follows from Theorem 2.1 that g k β = β for any k ∈ Z \\ {0}, which\nis a contradiction. Thus, (α, X) is a purely ρ-invariant pair for GG and we see that\nσ is contained in φ(x) for a.e. x ∈ X.\nNext, assume that we have a Borel subset A of X with positive measure and\nβ ∈ φ(x) \\ σ for any x ∈ A. For each g ∈ G, there is a Borel subset A1 ⊂ A\nwith positive measure and n ∈ Z \\ {0} such that (g n , x) ∈ (GG )A1 and the equation\ng n β = ρ(g n , x)β = β holds for any x ∈ A1 because (β, A) is a ρ-invariant pair for\nGG . Thus, gβ = β for any g ∈ G by Theorem 2.1. It follows from β 6∈ σ that there\nexists γ ∈ V (C) such that i(β, γ) 6= 0 and hγ = γ for any h ∈ G. Thus, (γ, X) is\na ρ-invariant pair for GG , which contradicts the assumption that β ∈ φ(x) for any\nx ∈ A, that is, the pair (β, A) is pure.\n\u0003\nLemma 3.7. Under the assumption (⋆), suppose that the Γ-action on (X, μ) is\nmeasure-preserving. Let α ∈ V (C) and assume that the subgroup Dα is infinite.\nLet Y be a Borel subset of X with positive measure and let S be a subgroupoid of\n(Gα )Y of infinite type. Then S is reducible and its CRS for S is constant with value\n{α}.\nProof. It is clear that S is reducible and the pair (α, Y ) is ρ-invariant for S. Let\nA be a Borel subset of Y with positive measure and β ∈ V (C) with i(α, β) 6= 0.\nAssume that the pair (β, A) is ρ-invariant for S. Then there exists a Borel subset\nB of A with positive measure such that ρ(γ)β = β for a.e. γ ∈ (S)B . Since S is a\nsubgroupoid of (Gα )Y of infinite type, there exist infinitely many n ∈ Z and a Borel\nsubset Bn of B with positive measure such that tn ∈ Γ and (tn , x) ∈ (S)B for any\nx ∈ Bn , where t ∈ Γ(M ) denotes a Dehn twist about α. Hence, tn β = ρ(tn , x)β = β\nfor a.e. x ∈ Bn . In particular, tn β = β for infinitely many n ∈ Z. It follows from\n[21, Lemma 4.2] (or [25, Corollary 4.26]) that i(α, β) = 0, which is a contradiction.\nThus, the pair (α, Y ) is a pure ρ-invariant one for S.\nIf γ ∈ V (C) satisfies i(α, γ) = 0 and α 6= γ, then there exists δ ∈ V (C) such\nthat i(α, δ) = 0 and i(γ, δ) 6= 0. Since the pair (δ, Y ) is ρ-invariant for S, the pair\n(γ, A′ ) can not be a pure ρ-invariant one for S for any Borel subset A′ of Y .\n\u0003\nThe following proposition can also be proved along the same line as in [25]:\nProposition 3.8 ([25, Proposition 4.61]). Under the assumption (⋆), suppose that\nthe Γ-action on (X, μ) is measure-preserving and that Γ is sufficiently large. Then\n(G)Y is neither IA nor reducible for any Borel subset Y ⊂ X with positive measure.\nAs an application of the above generalization of the results in [25], we obtain\nsome information on stabilizers for a measure-preserving action of the mapping\nclass group on a standard finite measure space.\nCorollary 3.9. Under the assumption (⋆), suppose that the Γ-action on (X, μ) is\nmeasure-preserving and that Γ is sufficiently large. Then the isotropy group\nGxx = {γ ∈ G : r(γ) = s(γ) = x}\nis either trivial or sufficiently large for a.e. x ∈ X.\nWe can show this corollary by using Lemma 2.11, Theorem 3.4 (ii), Theorem 3.5\n(iii) and Proposition 3.8. Note that Γ is torsion-free and that\n\n\f18\n\nYOSHIKATA KIDA\n\n• for each pseudo-Anosov element g ∈ Γ, the subset of X consisting of x ∈ X\nsuch that Gxx is IA and fixes the pair {F± (g)} of pseudo-Anosov foliations\nis measurable;\n• for each σ ∈ S(M ), the subset of X consisting of x ∈ X such that Gxx is\nreducible and its CRS is σ is measurable.\nIt follows from these remarks that for a Borel subset Y of X with positive measure,\nboth subsets\nY1 = {x ∈ Y : Gxx is IA}, Y2 = {x ∈ Y : Gxx is reducible}\nare measurable, and (G0 )Y1 is IA and (G0 )Y2 is reducible, where\nG0 = {γ ∈ G : r(γ) = s(γ)}\nis the isotropy groupoid of G.\nIn order to analyze reducible subgroupoids furthermore, in Theorems 3.11, 3.13,\nwe consider components of the surface obtained by cutting along the CRS for S.\nThere are three types of components as in the case of subgroups of Γ(M ; m) mentioned in the comment right before Lemma 2.3. These theorems will be used when\nwe characterize reducible subgroupoids in terms of amenability, non-amenability\nand normality (see Section 4).\nIf Γ is an infinite reducible subgroup of Γ(M ; m) with an integer m ≥ 3 and\nσ ∈ S(M ) is the CRS for Γ, then we can classify each component Q of Mσ in\nterms of properties of the quotients pQ (Γ) (i.e., triviality and amenability), where\npQ : Γ → Γ(Q) is the natural homomorphism (see the comment right before Lemma\n2.3). On the other hand, when we consider a reducible subgroupoid, we cannot\nconstruct such a quotient. However, fortunately, the properties of the quotient\npQ (Γ) used in the classification of Q can be characterized in terms of fixed points\nfor the action of pQ (Γ) on the space M (PMF(Q)) of all probability measures on\nPMF(Q) as follows:\n(a) Q is T for Γ if and only if either Q is a pair of pants or pQ (g)α = α for any\ng ∈ Γ and any (or some) α ∈ V (C(Q)).\n(b) Q is IA for Γ if and only if the following three conditions are satisfied:\n• Q is not a pair of pants;\n• pQ (g)α 6= α for any non-trivial g ∈ Γ and any (or some) α ∈ V (C(Q));\n• there exists μ ∈ M (PMF(Q)) such that pQ (g)μ = μ for any g ∈ Γ\nand μ(MIN (Q)) = 1.\n(c) Q is IN for Γ if and only if the following two conditions are satisfied:\n• Q is not a pair of pants;\n• there exist no fixed points for the action of pQ (Γ) on M (PMF(Q)).\nBy this observation, we can similarly consider three types of components of the\nsurface obtained by cutting along the CRS for a reducible subgroupoid. Before\nstating the definition of the three types of components, we recall some notation.\nLet L be a submanifold of the surface M which is a realization of some element\nin S(M ). Let Q be a component of ML , where ML denotes the surface obtained by\ncutting M along L. Let pL : ML → M denote the canonical map. For δ ∈ V (C(M )),\nwe define a finite subset r(δ, Q) of V (C(Q)).\nLet δ ∈ V (C(M )) and represent the isotopy class δ by a circle D that intersects\neach of the components of L in the least possible number of points. Put DL =\np−1\nL (D). The manifold DL consists of some intervals or it is a circle (if D ∩ L = ∅).\n\n\fMEASURE EQUIVALENCE RIGIDITY OF THE MAPPING CLASS GROUP\n\n19\n\nIf either DL ∩ Q = ∅ or DL is a circle which lies in Q and is peripheral for Q,\nthen put r(δ, Q) = ∅. If DL is a non-peripheral circle lying in Q, put r(δ, Q) = {δ}.\nIn the remaining cases, the intersection DL ∩ Q consists of some intervals. For\neach such interval I, consider a regular neighborhood in Q of the union of the\ninterval I and those components of ∂Q on which the ends of I lie. Let NI denote\nthe regular neighborhood. Then NI is a disk with two holes. Let r′ (δ, Q) be the set\nof isotopy classes of components of the manifolds ∂NI \\ ∂Q, where I runs through\nthe set of all components of DL ∩Q. Define r(δ, Q) as the resulting set of discarding\nfrom r′ (δ, Q) the isotopy classes of trivial or peripheral circles of Q. We will regard\nr(δ, Q) as a subset of V (C(M )) using the embedding V (C(Q)) ֒→ V (C(M )). It is\nclear that this definition depends only on δ and the isotopy class of Q.\nLet F : M → M be a diffeomorphism such that F (L) = L and the induced\ndiffeomorphism ML → ML takes Q to Q. If f ∈ Γ(M ) denotes the isotopy class of\nF , then we have the equality\nf (r(δ, Q)) = r(f δ, Q)\nby definition.\nLemma 3.10 ([21, Lemma 7.9]). Let L and Q be the same as above and let δ ∈\nV (C(M )). If r(δ, Q) = ∅, then one of the following three cases occurs:\n(i) there is a circle in the class δ that does not intersect Q;\n(ii) δ is the isotopy class of one of the components of L;\n(iii) Q is a disk with two holes.\nWe denote by D = D(M ) the set of all isotopy classes of subsurfaces in M and\ndenote by F0 (D) the set of all finite subsets F of D (including the empty set) such\nthat if Q1 , Q2 ∈ F and Q1 6= Q2 , then Q1 and Q2 can be realized disjointly on M .\nTheorem 3.11 ([25, Theorem 5.6]). Under the assumption (⋆), let Y ⊂ X be a\nBorel subset with positive measure and let S be a subgroupoid of (G)Y of infinite\ntype. Suppose that S is reducible and let φ : Y → S(M ) be its CRS. Then there exist\ntwo essentially unique invariant Borel maps φt , φi : Y → F0 (D) for S satisfying the\nfollowing:\n(i) any element in φt (x) ∪ φi (x) is a component of Mφ(x) for a.e. x ∈ Y ;\n(ii) each component of Mφ(x) belongs to φt (x) ∪ φi (x) and φt (x) ∩ φi (x) = ∅\nfor a.e. x ∈ Y ;\n(iii) if Q is in F ∈ F0 (D) with μ(φ−1\nt (F )) > 0, then either Q is a pair of pants\nor the pair (α, φ−1\n(F\n))\nis\nρ-invariant\nfor S for any α ∈ V (C(Q));\nt\n(iv) if Q is in F ∈ F0 (D) with μ(φ−1\n(F\n))\n> 0, then Q is not a pair of pants\ni\nand (α, A) is not ρ-invariant for S for any α ∈ V (C(M )) with r(α, Q) 6= ∅\nand any Borel subset A ⊂ φ−1\ni (F ) with positive measure.\nWe call φt (resp. φi ) the system of trivial (resp. irreducible) subsurfaces for\nS or in short, a T (resp. IA) system for S. We often call an element in φt (x)\n(resp. φi (x)) a trivial or T (resp. irreducible or I) subsurface for x ∈ Y . When we\nidentify a subsurface with a component of the surface obtained by cutting along\nsome curves, we call T and I subsurfaces also T and I components, respectively. It\nis easy to see that if A is a Borel subset of Y with positive measure, then the T, I\nsystems for (S)A are the restrictions of φt , φi to A, respectively (see [25, Lemma\n5.7]). We can show that T components have the following stronger property:\n\n\f20\n\nYOSHIKATA KIDA\n\nLemma 3.12 ([25, Lemma 5.4]). Under the assumption (⋆), let Y ⊂ X be a Borel\nsubset with positive measure and let S be a subgroupoid of (G)Y of infinite type.\nSuppose that S is reducible and let φ : Y → S(M ) be its CRS. We assume the\nfollowing:\n• φ is constant with value σ ∈ S(M ) and Q is a component of Mσ ;\n• we have α ∈ V (C(M )) with r(α, Q) 6= ∅ and a Borel subset A ⊂ Y with\npositive measure such that (α, A) is ρ-invariant for S.\nF\nThen there exists a countable Borel partition A = An such that ρ(γ)β = β for\nany β ∈ V (C(Q)) and a.e. γ ∈ (S)An . In particular, the pair (β, A) is ρ-invariant\nfor S for any curve β ∈ V (C(Q)).\nIf the cocycle ρ : S → Γ is essentially valued in Γσ = {g ∈ Γ : gσ = σ} for\nsome σ and Q is a component of Mσ , then ρQ denotes the cocycle defined by the\ncomposition of ρ with pQ : Γσ → Γ(Q). In the next theorem, we further divide I\nsubsurfaces into two types, IA and IN ones.\nTheorem 3.13 ([25, Theorem 5.9, Section 5.2]). In Theorem 3.11, there exist two\nessentially unique invariant Borel maps φia , φin : Y → F0 (D) for S satisfying the\nfollowing:\n(i) φi (x) = φia (x) ∪ φin (x) and φia (x) ∩ φin (x) = ∅ for a.e. x ∈ Y ;\n(ii) if Q is in F ∈ F0 (D) with μ(φ−1\nia (F )) > 0, then\n(a) if A is a Borel subset of φ−1\nia (F ) with positive measure and ψ : A →\nM (PMF(Q)) is a ρQ -invariant Borel map for S, then we see that\nψ(x)(MIN (Q)) = 1 for a.e. x ∈ A;\n(b) we have an essentially unique ρQ -invariant Borel map ψ0 : φ−1\nia (F ) →\n∂2 C(Q) for S such that if A is a Borel subset of φ−1\n(F\n)\nwith\npositive\nia\nmeasure and ψ : A → M (∂C(Q)) is a ρQ -invariant Borel map for S,\nthen\nsupp(ψ(x)) ⊂ supp(ψ0 (x))\nfor a.e. x ∈ A;\n(iii) if Q is in F ∈ F0 (D) with μ(φ−1\nin (F )) > 0, then S admits neither ρQ invariant Borel maps A → M (PMF(Q)) nor A → ∂2 C(Q) for any Borel\nsubset A ⊂ φ−1\nin (F ) with positive measure.\nWe call φia (resp. φin ) the system of irreducible and amenable or IA (resp.\nirreducible and non-amenable or IN) subsurfaces for S. We often call an element\nin φia (x) (resp. φin (x)) an irreducible and amenable (resp. irreducible and nonamenable) subsurface for x ∈ Y and in short, an IA (resp. IN) subsurface (or\ncomponent). It is easy to see that if A is a Borel subset of Y with positive measure,\nthen the IA, IN systems for (S)A are the restrictions of φia , φin to A, respectively\n(see [25, Lemma 5.10]).\nWe recall some properties of IA components in the following lemma:\nLemma 3.14 ([25, Lemma 5.13]). Under the assumption (⋆), let Y ⊂ X be a Borel\nsubset with positive measure and let S be a subgroupoid of (G)Y of infinite type. Let\nH be a subgroupoid of (G)Y with S ⊳ H. Suppose that S is reducible (thus, so is H)\nand all the CRS, T, IA, IN systems for S are constant. Let Q be an IA component\nfor S and ψ0 : Y → ∂2 C(Q) be the ρQ -invariant Borel map for S as in Theorem\n3.13 (ii) (b). Then\n(i) ψ0 is ρQ -invariant for H.\n\n\fMEASURE EQUIVALENCE RIGIDITY OF THE MAPPING CLASS GROUP\n\n21\n\n(ii) if we denote by ψ : Y → S(M ) the CRS for H, then σ ⊂ ψ(x) for a.e.\nx ∈ Y , where σ ∈ S(M ) is the CRS for S.\n(iii) if we denote by ψia : Y → F0 (D) the IA system for H, then Q ∈ ψia (x) for\na.e. x ∈ Y .\nThe following proposition implies that if a reducible subgroupoid has no IN\ncomponents, then it is amenable as a groupoid:\nProposition 3.15 ([25, Proposition 5.18]). Under the assumption (⋆), let Y ⊂ X\nbe a Borel subset with positive measure and let S be a subgroupoid of (G)Y of infinite\ntype. Suppose that S is reducible and there exists σ ∈ S(M ) such that ρ(γ)σ = σ\nfor a.e. γ ∈ S. Let {Q\nQ i }i be the set of all componentsQof Mσ which are not pairs of\npants and ρσ : S → i Γ(Qi ) be the induced cocycle i ρQi . Moreover, we assume\nthat there exists a ρσ -invariant Borel map\nY\n∂2 C(Qi ).\nψ: Y →\ni\n\nThen the groupoid S is amenable.\n\nSuppose that Γ is a subgroup of Γ(M ; m) with an integer\nm ≥ 3 and that\nQ\nσ ∈ S(M ) is fixed by each element of Γ. Let pσ : Γ → Q Γ(Q) be the product\nQ\nQ pQ , where Q runs through all components in Mσ . Note that the kernel of pσ is\ncontained in the amenable subgroup of Γ(M ) generated by Dehn twists about all\ncurves in σ by Lemma 2.2. Thus, it is easily shown that if every component of Mσ\nis either T or IA, then Γ is amenable, which implies Proposition 3.15 in the case\nwhere X is a point.\n3.2. Actions of hyperbolic groups. In this subsection, we consider subgroupoids\nof a groupoid defined by a non-singular action of a hyperbolic group. In subsequent\nsections, we only use Lemma 3.18, in which we consider a groupoid arising from an\naction of a free group of rank 2.\nAssumption 3.2. We call the following assumption (⋆)h : let Γ be an infinite\nsubgroup of a hyperbolic group Γ0 . Let (X, μ) be a standard finite measure space\nand assume that we have a non-singular Γ-action on (X, μ). We denote by G = Γ⋉X\nand ρ : G → Γ the associated groupoid and cocycle, respectively.\nFor a hyperbolic group Γ0 , let ∂Γ0 be the boundary at infinity and let M (∂Γ0 )\nbe the space of all probability measures on ∂Γ0 . We denote by ∂2 Γ0 the quotient\nspace of ∂Γ0 × ∂Γ0 by the coordinate exchanging action of the symmetric group of\ntwo letters, which can naturally be viewed as a Borel subset of M (∂Γ0 ) as in the\ncase of the boundary of the curve complex. We can show the following proposition\nwith the methods from the proof of Theorem 3.4:\nProposition 3.16. Under the assumption (⋆)h , let Y be a Borel subset of X with\npositive measure and let S be a subgroupoid of (G)Y of infinite type. Assume that\nthere is a ρ-invariant Borel map Y → M (∂Γ0 ) for S. Then\n(i) there exists an essentially unique ρ-invariant Borel map φ0 : Y → ∂2 Γ0 for\nS satisfying the following: if Y ′ is a Borel subset of Y with positive measure\nand φ : Y ′ → M (∂Γ0 ) is a ρ-invariant Borel map for S, then\nsupp(φ(x)) ⊂ supp(φ0 (x))\n′\n\nfor a.e. x ∈ Y .\n\n\f22\n\nYOSHIKATA KIDA\n\n(ii) if T is a subgroupoid of (G)Y with S ⊳ T , then φ0 is invariant also for T .\n(iii) S is amenable as a groupoid.\nUsing Lemma 2.11 and Proposition 3.16 (ii), (iii), we can show the following as\nin Corollary 3.9. Note that the set consisting of all points in ∂2 Γ0 fixed by some\ninfinite subgroup of Γ0 is countable (see [17, Chapitre 8] or the comment about the\ndynamics of a hyperbolic group on its boundary right after [25, Theorem 3.3]).\nCorollary 3.17. Under the assumption (⋆)h , suppose that Γ is non-amenable and\nthat the Γ-action on (X, μ) is measure-preserving. Then the isotropy group\nGxx = {γ ∈ G : r(γ) = s(γ) = x}\nis either finite or non-amenable for a.e. x ∈ X.\nLemma 3.18. Let G1 , G2 be two infinite cyclic groups and suppose that we have\na measure-preserving action of the free product G = G1 ∗ G2 on a standard finite\nmeasure space (X, μ). Let G, G1 and G2 be the groupoids arising from the actions of\nG, G1 and G2 , respectively. Then the subgroupoid (G1 )A ∨ (G2 )A of (G)A generated\nby (G1 )A and (G2 )A is non-amenable for any Borel subset A ⊂ X with positive\nmeasure.\nProof. Suppose that (G1 )A ∨(G2 )A is amenable. We have the natural cocycle ρ : G →\nG. It follows that we can find a ρ-invariant Borel map φ0 : A → ∂2 G for (G1 )A ∨\n(G2 )A as in Proposition 3.16 (i). Let a±\ni ∈ ∂G be the two fixed points on the\nboundary ∂G of G for the action of the group Gi for i = 1, 2. Then the constant\nmap φi : A → ∂2 G with value {a±\ni } is ρ-invariant for the subgroupoid (Gi )A of\ninfinite type. It follows that φi has to satisfy the property in Proposition 3.16\n(i). Thus, we have supp(φ(x)) ⊂ supp(φi (x)) = {a±\ni } for i = 1, 2, which is a\n±\ncontradiction because {a±\n}\n∩\n{a\n}\n=\n∅.\n\u0003\n1\n2\n4. Characterizations of reducible subgroupoids\nThe next two propositions characterize an amenable and a non-amenable reducible subgroupoid, respectively, in terms of amenability, non-amenability and\nnormality. As in the previous section, we use the following notation under the\nassumption (⋆):\n• For a subgroup Γ′ of Γ, let GΓ′ denote the subgroupoid of G generated by\nthe action of Γ′ .\n• For σ ∈ S(M ), we denote by Dσ the intersection of Γ and the subgroup\ngenerated by Dehn twists about all curves in σ. We write Gσ instead of\nGDσ for simplicity. If σ consists of one element α ∈ V (C), then we write\nDα (resp. Gα ) instead of Dσ (resp. Gσ ).\n• For σ ∈ S(M ), we write\nΓσ = {g ∈ Γ : gσ = σ}.\nProposition 4.1. Under the assumption (⋆), let Y ⊂ X be a Borel subset with\npositive measure and let S be a subgroupoid of (G)Y of infinite type. Suppose that\nS is amenable. Consider the following two assertions:\n(i) S is reducible.\n(ii) For any Borel subset A of Y with positive measure, we have a Borel subset\nB of A with positive measure and the following three subgroupoids S ′ , S ′′\nand T of (G)B :\n\n\fMEASURE EQUIVALENCE RIGIDITY OF THE MAPPING CLASS GROUP\n\n23\n\n(a) an amenable subgroupoid S ′ with (S)B < S ′ ;\n(b) a subgroupoid S ′′ of infinite type with S ′′ < S ′ ;\n(c) a non-amenable subgroupoid T with S ′′ ⊳ T .\nThen the assertion (ii) implies the assertion (i). If Γ is a subgroup of finite index in\nΓ(M ; m) and the Γ-action on (X, μ) is measure-preserving, then the converse also\nholds.\nProof. First, we show that the assertion (ii) implies the assertion (i). If S were\nnot reducible, then since S is of infinite type and amenable, there would exist an\ninvariant Borel subset A of Y for S with positive measure such that (S)A is IA (see\nTheorem 3.2). It follows from the assumption (ii) that we have a Borel subset B of\nA with positive measure and subgroupoids S ′ , S ′′ and T satisfying the conditions\nin (ii). Since (S)A is IA and S ′ is amenable, it follows from Theorem 3.2 that S ′ is\nIA. Moreover, S ′′ is also IA. Thus, T is also IA and amenable by Theorem 3.4 (ii)\nand Proposition 3.3, which is a contradiction.\nNext, we assume that Γ is a subgroup of finite index in Γ(M ; m) and show that\nthe assertion (i) implies the assertion (ii). Let A be a Borel subset of Y with positive\nmeasure. Then there exists a Borel subset B of A with positive measure satisfying\nthe following conditions (see Lemma 3.12 for the second condition):\n• all of the CRS, T and IA systems for S are constant on B. Let σ ∈ S(M ),\nφt , φia ∈ F0 (M ) be their values on B, respectively. Note that the IN system\nfor S is empty since S is amenable;\n• for a.e. γ ∈ (S)B and any component Q in φt and α ∈ V (C(Q)), we have\nρQ (γ)α = α, where ρQ : (S)B → Γ(Q) is the composition of ρ and the\nnatural projection Γσ → Γ(Q).\nFor each Q ∈ φia , we have the canonical invariant Borel map ψQ : B → ∂2 C(Q)\nfor (S)B as in Theorem 3.13 (ii) (b). Let S ′ be a subgroupoid of (G)B consisting\nof all γ ∈ (G)B satisfying\nρ(γ)σ = σ, ρQ (γ)ψQ (s(γ)) = ψQ (r(γ)), ρ(γ)α = α\nfor any Q ∈ φia , any α ∈ V (C(R)) and any R ∈ φt which is not a pair of pants.\nNote that (S)B < S ′ . It follows from Proposition 3.15 that S ′ is amenable.\nIf |σ| < κ(M ) + 1, then let S ′′ = (Gσ )B . Then S ′′ < S ′ . Since Γ is a subgroup\nof finite index in Γ(M ; m) and there exists a component of Mσ which is not a pair\nof pants, we see that S ′′ is of infinite type and Γσ is non-amenable. Thus, the\nsubgroupoid T = (GΓσ )B is non-amenable. Moreover, S ′′ ⊳ T since Dσ is a normal\nsubgroup of Γσ by Lemma 2.2. This completes the construction of subgroupoids in\nthe assertion (ii) in the case of |σ| < κ(M ) + 1.\nIf |σ| = κ(M ) + 1, then S ′ = (Gσ )B and it is amenable. Choose α0 ∈ σ. Let\n′\nσ = σ \\ {α0 }, which is an element in S(M ) since κ(M ) > 0. Then S ′′ = (Gσ′ )B\nis a subgroupoid of infinite type with S ′′ < S ′ . Define T = (GΓσ′ )B . Then T is\nnon-amenable and S ′′ ⊳ T since Dσ′ is a normal subgroup of Γσ′ by Lemma 2.2.\nThis completes the construction of subgroupoids in the assertion (ii) in the case of\n|σ| = κ(M ) + 1.\n\u0003\nProposition 4.2. Under the assumption (⋆), let Y ⊂ X be a Borel subset with\npositive measure and let S be a subgroupoid of (G)Y of infinite type. Suppose that\n(S)Y ′ is not amenable for any Borel subset Y ′ of Y with positive measure. Consider\nthe following two assertions:\n\n\f24\n\nYOSHIKATA KIDA\n\n(i) S is reducible.\n(ii) For any Borel subset A of Y with positive measure, we have a Borel subset\nB of A with positive measure and the following two subgroupoids S ′ and S ′′\nof (G)B :\n(a) a subgroupoid S ′ with (S)B < S ′ ;\n(b) an amenable subgroupoid S ′′ of infinite type with S ′′ ⊳ S ′ .\nThen the assertion (ii) implies the assertion (i). If Γ is a subgroup of finite index in\nΓ(M ; m) and the Γ-action on (X, μ) is measure-preserving, then the converse also\nholds.\nProof. First, we show that the assertion (ii) implies the assertion (i). Suppose that\nS is not reducible. Then there exists a Borel subset A of Y with positive measure\nsuch that for any Borel subset B of A with positive measure, there is no invariant\nBorel map B → M (PMF) for S (see Remark 3.3). By the assumption (ii), we\nhave a Borel subset B of A with positive measure and two subgroupoids S ′ and S ′′\nsatisfying the conditions in (ii). Since S ′′ is amenable, by Theorem 3.2, we have a\nBorel partition B = B1 ⊔ B2 (up to null sets) such that (S ′′ )B1 is IA and (S ′′ )B2 is\nreducible. It follows from Theorem 3.4 (ii) and Theorem 3.5 (iii) that (S ′ )B1 is IA\nand (S ′ )B2 is reducible. If B1 has positive measure, then (S)B1 is non-amenable by\nthe assumption of S. Since (S)B < S ′ , the relation (S ′ )B1 is non-amenable, which\ncontradicts to Theorem 3.4 (iii). On the other hand, if B2 has positive measure,\nthen (S)B2 has an invariant Borel map B2 → S(M ) ⊂ M (PMF), which is also a\ncontradiction.\nNext, we assume that Γ is a subgroup of finite index in Γ(M ; m) and show that\nthe converse also holds. Let A be a Borel subset of Y with positive measure. Then\nthere exists a Borel subset B of A with positive measure such that the CRS for S\nis constant on B. We denote by σ ∈ S(M ) its value on B. Define a subgroupoid\nS ′ = {γ ∈ (G)B : ρ(γ)σ = σ} = (GΓσ )B ,\nwhich satisfies (S)B < S ′ . Let S ′′ = (Gσ )B . Then S ′′ is of infinite type since Γ\nis a subgroup of finite index in Γ(M ; m) and the Γ-action on (X, μ) is measurepreserving. Since Dσ is a normal subgroup of Γσ and it is amenable by Lemma 2.2,\nwe see that S ′′ ⊳ S ′ and S ′′ is amenable.\n\u0003\nAssumption 4.1. We call the following assumption (•): for i = 1, 2, let Γi be\na finite index subgroup of Γ(Mi ; mi ), where Mi is a surface with κ(Mi ) > 0 and\nmi ≥ 3 is an integer. Consider a measure-preserving action of Γi on a standard\nfinite measure space (Xi , μi ) and let\nG i = GΓi , ρi : G i → Γi\nbe the induced groupoid, cocycle, respectively. Suppose that we have a groupoid\nisomorphism\nf : (G 1 )Y1 → (G 2 )Y2 ,\nwhere Yi ⊂ Xi is a Borel subset satisfying G i Yi = Xi up to null sets.\nThe following corollary is a consequence of Propositions 4.1 and 4.2 which characterize reducible subrelations:\nCorollary 4.3. Under the assumption (•), let A1 be a Borel subset of Y1 with\npositive measure and let S 1 be a subgroupoid of (G 1 )A1 of infinite type. Then S 1 is\nreducible if and only if the image f (S 1 ) is reducible.\n\n\fMEASURE EQUIVALENCE RIGIDITY OF THE MAPPING CLASS GROUP\n\n25\n\nNext, we characterize maximal reducible subgroupoids. In the assumption (⋆),\nlet Y be a Borel subset of X with positive measure and let φ : Y → S(M ) be a\nBorel map. Then we define a reducible subgroupoid\nSφ = {γ ∈ (G)Y : ρ(γ)φ(s(γ)) = φ(r(γ))}.\nProposition 4.4. Under the assumption (⋆), let Y be a Borel subset of X with\npositive measure and let φ : Y → S(M ) be a Borel map. Assume that Γ is a subgroup\nof finite index in Γ(M ; m) and that the Γ-action on (X, μ) is measure-preserving.\nThen the CRS for Sφ is φ and for a.e. x ∈ Y , each component of Mφ(x) either is\na pair of pants or is IN for Sφ .\nProof. We may assume that all of the CRS, T, IA and IN systems for Sφ and φ are\nconstant by [25, Lemmas 5.7, 5.10]. We denote the value of φ by the same symbol.\nNote that Sφ is equal to (GΓφ )Y . It follows from Lemmas 2.3, 3.6 that the CRS for\nSφ is φ.\nLet Q be a component of Mφ which is not a pair of pants. Let g1 , g2 ∈ Γφ\nbe elements such that {pQ (g1 ), pQ (g2 )} is an independent pair of pseudo-Anosov\nelements in Γ(Q), where pQ : Γφ → Γ(Q) is the natural homomorphism. Let G be\nthe subgroup of Γφ generated by g1 and g2 . Note that (GG )Y < Sφ .\nIf Q were T for Sφ , then it follows from Lemma 3.12 that there would exist a Borel\nsubset A of Y with positive measure such that ρQ (γ)α = α for any α ∈ V (C(Q))\nand for a.e. γ ∈ (Sφ )A , where ρQ is the composition of ρ and pQ . This contradicts\nthe fact that pQ (g1n )α 6= α for any α ∈ V (C(Q)) and all n ∈ Z \\ {0}.\nIf Q were IA for Sφ , then we would have the canonical invariant Borel map\nφ : Y → ∂2 C(Q) for Sφ as in Theorem 3.13 (ii) (b). For i = 1, 2, define a Borel map\nφi : Y → ∂2 C(Q) to be the constant map whose value is the image of {F± (pQ (gi ))}\nin ∂C(Q). Recall that the natural map MIN → ∂C is injective on the set of all\npseudo-Anosov foliations. It follows that φi is the canonical invariant Borel map\nfor (GGi )Y for i = 1, 2, where Gi is the cyclic subgroup generated by gi . Since φ is\ninvariant for (GGi )Y , we have the inclusion\nsupp(φ(x)) ⊂ supp(φi (x))\nfor a.e. x ∈ Y and any i = 1, 2. This is a contradiction because {F± (pQ (g1 ))} ∩\n{F± (pQ (g2 ))} = ∅.\n\u0003\nIn what follows, we regard V (C) as a subset of S(M ) naturally.\nCorollary 4.5. Under the assumption (⋆), let Y be a Borel subset of X with positive\nmeasure and let φ : Y → V (C) be a Borel map. Assume that Γ is a finite index\nsubgroup of Γ(M ; m) and that the Γ-action on (X, μ) is measure-preserving. If S\nis a reducible subgroupoid of (G)Y with Sφ < S, then S = Sφ .\nProof. Let ψ : Y → S(M ) be the CRS for S. It is enough to show φ = ψ up to null\nsets. Choose α ∈ V (C) and σ ∈ S(M ) such that μ(φ−1 (α) ∩ ψ −1 (σ)) > 0 and put\nA = φ−1 (α) ∩ ψ −1 (σ). It suffices to prove φ = ψ a.e. on A, that is, σ = {α}. We\nmay assume that all the T, IA and IN systems for Sφ on A are constant.\nChoose β ∈ σ. Since β is in the CRS for (S)A , the pair (β, A) is ρ-invariant for Sφ .\nIf we had a component Q of Mα which is not a pair of pants and satisfies r(β, Q) 6= ∅,\nthen Q would be T for Sφ by Theorem 3.11, which contradicts Proposition 4.4.\nThus, r(β, Q) = ∅ for each component Q of Mα which is not a pair of pants. It\n\n\f26\n\nYOSHIKATA KIDA\n\nfollows from Lemma 3.10 that β is a boundary component of Q, that is, α = β.\nTherefore, σ = {α} and φ = ψ a.e. on A.\n\u0003\nLemma 4.6. Under the assumption (⋆), let Y ⊂ X be a Borel subset with positive\nmeasure and let S be a subgroupoid of (G)Y of infinite type. Suppose that S is\nreducible. Then there exists a Borel map ψ : Y → V (C) such that S < Sψ .\nProof.F Let φ : Y → S(M ) be the CRS for S. Choose a countable Borel partition\nY = Yn of Y such that φ is constant on each Yn . Let αn ∈ V (C) be an element\nsuch that αn ∈ φ(x) for a.e. x ∈ Yn . Then the constant map Yn ∋ x 7→ αn ∈ V (C)\nis invariant for (S)Yn . It follows from the proof of Lemma 3.1 that we can construct\nan invariant Borel map ψ : Y → V (C) for S.\n\u0003\nThe following corollary is a consequence of Corollaries 4.3, 4.5 and Lemma 4.6:\nCorollary 4.7. Under the assumption (•), let A1 be a Borel subset of Y1 with\npositive measure and let φ1 : A1 → V (C(M1 )) be a Borel map. Put A2 = f (A1 )\nand\nSφ1 1 = {γ ∈ (G 1 )Y1 : ρ1 (γ)φ1 (s(γ)) = φ1 (r(γ))}.\nThen there exists a Borel map φ2 : A2 → V (C(M2 )) such that f (Sφ1 1 ) = Sφ2 2 , where\nSφ2 2 = {γ ∈ (G 2 )Y2 : ρ2 (γ)φ2 (s(γ)) = φ2 (r(γ))}.\n5. An equivariant Borel map from a self ME coupling\nIn the next lemma, we study a normal amenable subgroupoid of a maximal\nreducible subgroupoid. As in the previous section, we regard the vertex set V (C)\nas a subset of the simplex set S(M ) naturally.\nLemma 5.1. Under the assumption (⋆), let Y be a Borel subset of X with positive\nmeasure and let φ : Y → V (C) be a Borel map. Assume that Γ is a finite index\nsubgroup of Γ(M ; m) and that the Γ-action on (X, μ) is measure-preserving. If S\nis an amenable subgroupoid of F\nSφ of infinite type with S ⊳ Sφ , then there exists a\ncountable Borel partition Y = Yn of Y satisfying the following conditions:\n(i) the map φ is constant a.e. on Yn . Let αn ∈ V (C) be its value;\n(ii) for each n, we have (S)Yn < (Gαn )Yn < (Sφ )Yn .\nProof. Recall that Sφ is reducible and its CRS is given by φ (see Proposition 4.4).\nSince S is a subgroupoid of Sφ , it is also reducible. Let ψ : Y → S(M ) be the CRS\nfor S. Since S is normal in Sφ , the map ψ is invariant also for Sφ by Theorem 3.5\n(iii). By the definition of essential ρ-invariant pairs, we see that ψ(x) ⊂ φ(x) for\na.e. x ∈ Y . It follows that ψ(x) = φ(x) for a.e. x ∈ Y .\nLet A be a Borel subset of Y with positive measure such that all of the CRS\nφ = ψ and T, IA and IN systems for S and Sφ are constant on A. We denote\nby α ∈ V (C) the value of φ = ψ on A. If Q is a component of Mα , then Q is\nnot IN for (S)A since S is amenable. If Q were IA for (S)A , then Q would be IA\nalso for (Sφ )A by Lemma 3.14 (iii), which contradicts Proposition 4.4. Thus, each\ncomponent of Mα is T for (S)A .\nF\nIt follows from Lemma 3.12 that we have a countable Borel partition A = An\nof A such that ρ(γ)β = β for each component Q of Mα and β ∈ V (C(Q)) and for\na.e. γ ∈ (S)An for any n. For a.e. γ ∈ (S)An , consider the subgroup of Γ generated\nby ρ(γ). If ρ(γ) is non-trivial, then the CRS for the subgroup is {α} by Lemma 2.4.\n\n\fMEASURE EQUIVALENCE RIGIDITY OF THE MAPPING CLASS GROUP\n\n27\n\nIt follows from [21, Corollary 7.18] (see the comment right before Lemma\n2.3) that\nQ\nρ(γ) lies in the kernel of the natural homomorphism from Γα into Q Γ(Q), where\nQ is taken over all components of Mα . Thus, ρ(γ) ∈ Dα by Lemma 2.2. Since A is\nany Borel subset of Y with positive measure such that all of φ = ψ and T, IA and\nIN systems for S and Sφ are constant on A, we complete the proof.\n\u0003\nUnder the assumption (•), let α ∈ V (C(M1 )). Define the constant map φα : Y1 ∋\nx 7→ α ∈ V (C(M1 )). It follows from Corollary 4.7 that we have a Borel map\nφ2 : Y2 → V (C(M2 )) such that f (Sφ1 α ) = Sφ2 2 , where we use the same notation as\nin the corollary. Since the intersection of Γ1 and the subgroup of Γ(M1 ) generated\nby a Dehn twist along α is normal in\nΓ1,α = {g ∈ Γ1 : gα = α}\n= (GΓ1 1,α )Y1 , we see that (Gα1 )Y1 ⊳ Sφ1 α . Thus, f ((Gα1 )Y1 ) ⊳\nby Lemma 2.2 and\nF\nSφ2 2 . By Lemma 5.1, we have a countable Borel partition Y2 = An such that\n(i) the map φ2 is constant on An for each n. Let us denote the value by\nβn ∈ V (C(M2 ));\n(ii) for each n, we have (f ((Gα1 )Y1 ))An < (Gβ2n )An < (Sφ2 2 )An .\nTherefore, for each α ∈ V (C(M1 )), we can define a Borel map\nSφ1 α\n\nΨ(*, α) : Y1 → V (C(M2 ))\n−1\n\nby Ψ(x, α) = βn if x ∈ f (An ) (up\nF to null sets). Note that this map does not\ndepend on the decomposition Y2 = An .\n\nLemma 5.2. If α, α′ ∈ V (C(M1 )) satisfy i(α, α′ ) = 0, then i(Ψ(x, α), Ψ(x, α′ )) = 0\nfor a.e. x ∈ Y1 .\nProof. Since i(α, α′ ) = 0, we see that\n(Gα1 )A ⊳ (Gα1 )A ∨ (Gα1 ′ )A\nfor any Borel subset A of Y1 with positive measure (see Lemma 2.14). It follows\nfrom F\nthe construction of Ψ(*, α), Ψ(*, α′ ) that we have a countable Borel partition\nY2 = An and βn , βn′ ∈ V (C(M2 )) such that\n(f ((Gα1 )Y1 ))An < (Gβ2n )An ,\n\n(f ((Gα1 ′ )Y1 ))An < (Gβ2n′ )An\n\nfor each n. Using Lemma 3.7, we see that (f ((Gα1 )Y1 ))An (resp. (f ((Gα1 ′ )Y1 ))An )\nis a reducible subrelation of (G 2 )An and its CRS is given by the constant map\nAn ∋ x 7→ βn (resp. βn′ ) ∈ V (C(M2 )). It follows from the above normality that\nthe constant map An ∋ x 7→ βn is invariant also for (f ((Gα1 ′ )Y1 ))An , which implies\ni(βn , βn′ ) = 0 by the pureness of the pair (βn′ , An ) for (f ((Gα1 ′ )Y1 ))An .\n\u0003\nLemma 5.3. Let M be a surface with κ(M ) ≥ 0 and let α, α′ ∈ V (C(M )) with\ni(α, α′ ) 6= 0. Then tnα and tm\nα′ generate a free group of rank 2 for all sufficiently large\nn, m ∈ N, where tα , tα′ ∈ Γ(M ) denote the Dehn twists about α, α′ , respectively.\nProof. We regard α and α′ as elements in PMF. Choose an open neighborhood\nU of α such that\nU ⊂ {F ∈ PMF : i(F, α′ ) 6= 0},\nwhere K denotes the closure of a subset K of PMF. Choose an open neighborhood\nU ′ of α′ such that\nU ′ ⊂ {F ∈ PMF : i(F, α) 6= 0}\n\n\f28\n\nYOSHIKATA KIDA\n\nand U ∩ U ′ = ∅. It follows from [21, Theorem 4.3] that there exist n, m ∈ N such\nthat\ntkα (U ′ ) ⊂ U ⊂ U , tlα′ (U ) ⊂ U ′ ⊂ U ′\nfor any k, l ∈ Z with |k| ≥ n, |l| ≥ m.\nThe lemma follows from the above inclusions and the following ping-pong argument: we show that a = tnα and b = tm\nα′ generate a free group of rank 2. Let w be a\nnon-empty reduced word consisting of a±1 , b±1 . We prove that w is non-trivial in\nΓ(M ). It follows from the above inclusion that both ak and bl are non-trivial for\nany k, l ∈ Z \\ {0}. Therefore, by possibly replacing w by an appropriate conjugate\nand an inverse, it is enough to prove that w = ak w′ bl is non-trivial in Γ(M ), where\nk, l ∈ Z \\ {0} and w′ is a reduced word such that if w′ is non-empty, then the first\nletter of w′ is b or b−1 and the last letter of w′ is a or a−1 . Then w(x) ∈ U for any\nx ∈ U \\ U by the above inclusion, and in particular, w(x) 6= x, which implies that\nw is non-trivial in Γ(M ).\n\u0003\nLemma 5.4. If α, α′ ∈ V (C(M1 )) satisfy i(α, α′ ) 6= 0, then i(Ψ(x, α), Ψ(x, α′ )) 6= 0\nfor a.e. x ∈ Y1 .\nProof. Let α, α′ ∈ V (C(M1 )) with i(α, α′ ) 6= 0. Assume that there exists a Borel\nsubset A of Y1 with positive measure satisfying the following conditions:\n(i) Ψ(*, α) and Ψ(*, α′ ) are constant on A. Let β, β ′ ∈ V (C(M2 )) be their\nvalues, respectively;\n(ii) i(β, β ′ ) = 0 and\nf ((Gα1 )A ) < (Gβ2 )f (A) , f ((Gα1 ′ )A ) < (Gβ2 ′ )f (A) .\nSince i(β, β ′ ) = 0, we see that (Gβ2 )f (A) ∨ (Gβ2 ′ )f (A) is amenable. On the other\nhand, (Gα1 )A ∨ (Gα1 ′ )A is non-amenable by Lemma 5.3 and Lemma 3.18, which is a\ncontradiction.\n\u0003\nFor each α ∈ V (C(M1 )), we have a Borel subset Aα of Y1 with full measure such\nthat Ψ(*, α) is defined on Aα . Put\n\\\nAα .\nA1 =\nα∈V (C(M1 ))\n\nBy Lemmas 5.2 and 5.4, for each pair {α, α′ } of elements in V (C(M1 )), we can take\na Borel subset Aα,α′ of A1 with full measure so that for any x ∈ Aα,α′ , we have\ni(Ψ(x, α), Ψ(x, α′ )) = 0 if i(α, α′ ) = 0 and i(Ψ(x, α), Ψ(x, α′ )) 6= 0 if i(α, α′ ) 6= 0.\nPut\n\\\nAα,α′ .\nA=\nα,α′ ∈V (C(M1 ))\n\nThen Ψ(x, α) is defined for any x ∈ A and α ∈ V (C), and both Lemmas 5.2 and\n5.4 are satisfied for any x ∈ A.\nUnder the assumption (•), suppose that the two surfaces M1 , M2 are equal and\nwe denote the surface by M . Applying the above process to f and f −1 , we see that\nthere exist a Borel subset A of Y1 with full measure and a Borel map\nΨ : A × V (C) → V (C)\n\nsuch that for each x ∈ A, the map Ψ(x, *) : V (C) → V (C) defines an element of\nthe automorphism group Aut(C) of the curve complex. We can define a Borel map\nΨ : A → Aut(C) by Ψ(x) = Ψ(x, *) for x ∈ A.\n\n\fMEASURE EQUIVALENCE RIGIDITY OF THE MAPPING CLASS GROUP\n\n29\n\nFor simplicity, we denote π ◦ ρi by ρi for i = 1, 2, where π : Γ → Aut(C) is the\nnatural homomorphism.\nLemma 5.5. We have the equality\nΨ(r(γ)) = ρ2 (f (γ))Ψ(s(γ))ρ1 (γ −1 )\nfor a.e. γ ∈ (G 1 )Y1 .\nProof. Let A be a Borel subset of Y1 and let g1 ∈ Γ1 , g2 ∈ Γ2 be elements satisfying\nthe following conditions:\n(a) (g1 , x) ∈ (G 1 )Y1 and (g2 , f (x)) = f (g1 , x) ∈ (G 2 )Y2 for any x ∈ A;\n(b) the map Ψ is constant on A and g1 A, respectively. Let ψ, ψ ′ ∈ Aut(C) be\nthe values on A and g1 A, respectively.\nFor each α ∈ V (C), there exists a Borel subset B of A with positive measure such\n2\nthat f ((Gα1 )B ) < (Gψ(α)\n)f (B) . Note that for α ∈ V (C) and g ∈ Γ(M ), we have\ngtα g −1 = tgα\nby [23, Lemma 4.1.C], where tβ ∈ Γ(M ) denotes the Dehn twist about β ∈ V (C).\nIt follows that\n(g1 , r(γ))γ(g1−1 , g1 s(γ)) ∈ (Gg11 α )g1 B , (g2 , r(δ))δ(g2−1 , g2 s(δ)) ∈ (Gg22 ψ(α) )f (g1 B)\nfor γ ∈ (Gα1 )B and δ ∈ (Gψ(α) )f (B) . Therefore, f ((Gg11 α )g1 B ) < (Gg22 ψ(α) )f (g1 B) .\nThus, ψ ′ (g1 α) = g2 ψ(α). Since this equality holds for any α ∈ V (C), we have\nψ ′ = g2 ψg1−1 . This means that\nΨ(r(γ)) = ρ2 (f (γ))Ψ(s(γ))ρ1 (γ)−1\nfor a.e. γ = (g1 , x) ∈ (G 1 )Y1 with x ∈ A.\n\n\u0003\n\nDefinition 5.1. Let S be a Borel space and let m be a measure on S.\n(i) Suppose that we are given a Borel space T , a Borel action of a discrete\ngroup G on S, T and a Borel map f : S → T . We say that the map f is\nalmost G-equivariant if the equality\nf (gx) = gf (x)\nholds for any g ∈ G and a.e. x ∈ S.\n(ii) Suppose that we have discrete groups Γ, Λ, G and homomorphisms π : Γ →\nG, τ : Λ → G. Then we denote by (G, π, τ ) the Borel space G equipped\nwith the Γ × Λ-action given by\n(γ, λ)g = π(γ)gτ (λ)−1\nfor γ ∈ Γ, λ ∈ Λ and g ∈ G.\nTheorem 5.6. For i = 1, 2, let Γi be a finite index subgroup of Γ(M ; mi ), where\nM is a surface with κ(M ) > 0 and mi ≥ 3 is an integer. Suppose that we have a\nME coupling (Ω, m) of Γ1 and Γ2 . Then there exists an essentially unique almost\nΓ1 × Γ2 -equivariant Borel map Φ : Ω → (Aut(C), π, π), where π : Γ(M )⋄ → Aut(C)\nis the natural homomorphism.\n\n\f30\n\nYOSHIKATA KIDA\n\nProof. As in Subsection 2.3, we can construct a measure-preserving Γi -action on\na standard finite measure space (Xi , μi ) for i = 1, 2 such that they satisfy the\nassumption (•). In this proof, we use the notation as in (•). For the existence of\nΦ, it is enough to show that there exists a Borel map Φ : Ω → Aut(C) such that\nΦ(g1 g2 ω) = π(g2 )Φ(ω)π(g1 )−1\nfor any g1 ∈ Γ1 , g2 ∈ Γ2 and a.e. ω ∈ Ω. By Lemma 2.8, the space Ω is isomorphic\nto X1 × Γ2 as Γ1 × Γ2 -spaces. Here, the Γ1 × Γ2 -action on X1 × Γ2 is given by the\nformula\ng1 g2 (x, γ) = (g1 x, α(g1 , x)γg2−1 )\nfor g1 ∈ Γ1 , g2 , γ ∈ Γ2 and x ∈ X1 , where α : Γ1 × X1 → Γ2 is the associated\ncocycle. We identify Ω with X1 × Γ2 . For the proof of the theorem, it is enough to\nshow that if we define Φ : Ω → Aut(C) by the formula\nΦ(g1 g2 (x, e)) = π(g2 )Ψ(x)π(g1 )−1\nfor g1 ∈ Γ1 , g2 ∈ Γ2 and x ∈ Y1 , then it is well-defined. In other words, it is enough\nto show that\nπ(g2 )Ψ(x)π(g1 )−1 = π(g2′ )Ψ(x′ )π(g1′ )−1\nfor any g1 , g1′ ∈ Γ1 , g2 , g2′ ∈ Γ2 and a.e. x, x′ ∈ Y1 satisfying\ng1 g2 (x, e) = g1′ g2′ (x′ , e).\nIn what follows, we omit π for simplicity. Since\n(x′ , e) = (g1′ )−1 g1 (g2′ )−1 g2 (x, e) = ((g1′ )−1 g1 x, α((g1′ )−1 g1 , x)g2−1 g2′ ),\nwe see that x′ = (g1′ )−1 g1 x ∈ Y1 . Since α(g, y) = ρ2 (f (g, y)) for g ∈ Γ1 , y ∈ Y1\nwith gy ∈ Y1 , we have\nΨ(x′ ) = Ψ((g1′ )−1 g1 x) = ρ2 (f ((g1′ )−1 g1 , x))Ψ(x)ρ1 ((g1′ )−1 g1 , x)−1\n= (g2′ )−1 g2 Ψ(x)g1−1 g1′\nby Lemma 5.5, which shows the claim.\nThe uniqueness of Φ is a consequence of Theorem 2.6 and the following Lemma\n5.7.\n\u0003\nDefinition 5.2. Let π : Γ → G be a homomorphism between discrete groups.\nThen π is said to be ICC (infinite conjugacy class) if the set {π(γ)gπ(γ)−1 : γ ∈ Γ}\nconsists of infinitely many elements for any g ∈ G \\ {e}.\nLemma 5.7. Let Γ, Λ and G be discrete groups and assume that\nπ : Γ → G, τ : Λ → G\nare homomorphisms and that either π or τ is ICC. Suppose the following two conditions:\n(i) we have a ME coupling (Σ, m) of Γ and Λ;\n(ii) there exist two almost Γ × Λ-equivariant Borel maps Φ, Φ′ : Σ → (G, π, τ ).\nThen Φ and Φ′ are essentially equal.\n\n\fMEASURE EQUIVALENCE RIGIDITY OF THE MAPPING CLASS GROUP\n\n31\n\nProof. We may assume that π is ICC. Let us define a Borel map Φ0 : Σ → G by\nΦ0 (x) = Φ′ (x)Φ(x)−1 for x ∈ Σ. Then Φ0 satisfies the equality\nΦ0 (γλx) = π(γ)Φ0 (x)π(γ)−1\nfor any γ ∈ Γ, λ ∈ Λ and a.e. x ∈ Σ. Therefore, Φ0 is Λ-invariant and induces an\nalmost Γ-equivariant Borel map Λ\\Σ → G, where the Γ-action on G is given by\nconjugation via π. By projecting the finite Γ-invariant measure on Λ\\Σ to G, we\nobtain a finite measure on G which is invariant under the conjugation via π of each\nelement of Γ. Since π is ICC, the support of this measure is equal to {e}, which\nmeans that Φ0 = e a.e. on Σ.\n\u0003\nLemma 5.8. Let Γ, Λ and G be discrete groups and assume that\nπ : Γ → G, τ : Λ → G\nare homomorphisms. Suppose the following three conditions:\n(i) we have a normal subgroup Γ′ of Γ (resp. Λ′ of Λ) of finite index and a\nME coupling (Σ, m) of Γ and Λ;\n(ii) either the restrictions π : Γ′ → G or τ : Λ′ → G is ICC;\n(iii) there exists an almost Γ′ × Λ′ -equivariant Borel map Φ : Σ → (G, π, τ ).\nThen the map Φ is almost Γ × Λ-equivariant.\nProof. We may assume that the restriction τ : Λ′ → G is ICC. For fixed γ ∈ Γ and\nλ ∈ Λ, define a Borel map Φ0 : Σ → G by the formula\nΦ0 (x) = Φ(γλx)−1 π(γ)Φ(x)τ (λ)−1\nfor x ∈ Σ.\nLet g ∈ Γ′ , h ∈ Λ′ . Since Γ′ is normal in Γ and Λ′ is normal in Λ, we have g ′ ∈ Γ′\nand h′ ∈ Λ′ such that γg = g ′ γ and λh′ = hλ. Then\nΦ0 (gh′ x) = Φ(γgλh′ x)−1 π(γ)π(g)Φ(x)τ (h′ )−1 τ (λ)−1\n= Φ(g ′ γhλx)−1 π(g ′ )π(γ)Φ(x)τ (λ)−1 τ (h)−1\n= τ (h)Φ(γλx)−1 π(γ)Φ(x)τ (λ)−1 τ (h)−1\n= τ (h)Φ0 (x)τ (h)−1 .\nSince g ∈ Γ′ is arbitrary, the map Φ0 induces a Borel map Γ′ \\Σ → G. The\nprojectivized finite measure on G is invariant under the conjugation via τ of each\nelement of Λ′ . As in the proof of Lemma 5.7, we can show that Φ0 = e a.e. on\nΣ.\n\u0003\nCorollary 5.9. Let M be a surface with κ(M ) > 0 and let Γ, Λ be finite index\nsubgroups of Γ(M )⋄ or Aut(C), respectively. Suppose that we have a ME coupling\n(Ω, m) of Γ and Λ. Then there exists an essentially unique almost Γ×Λ-equivariant\nBorel map Ω → (Aut(C), π, π).\n6. Measure equivalence rigidity\nGiven a ME coupling (Σ, m) of discrete groups Γ and Λ, we can define the\nopposite coupling Σ̌ of Λ and Γ as the Λ × Γ-space obtained by the canonical\nisomorphism between Γ × Λ and Λ × Γ. When Γ = Λ, we distinguish the Γ-actions\non Σ by writing (γ, x) 7→ A1γ x and A2γ x, respectively, for γ ∈ Γ and x ∈ Σ.\n\n\f32\n\nYOSHIKATA KIDA\n\nIf (Σ, m) is a ME coupling of discrete groups Γ and Λ and (Ω, n) is a ME coupling\nof discrete groups Λ and ∆, then we can define the composed coupling Σ ×Λ Ω of\nΓ and ∆ as the quotient space of Σ × Ω by the diagonal Λ-action.\nDefinition 6.1. Let π : Γ → G be a homomorphism between discrete groups. We\nsay that π is almost an isomorphism if both ker(π) and coker(π) are finite.\nTheorem 6.1. Let Γ, Λ, G be discrete groups and let π, τ : Γ → G be homomorphisms. Suppose that π is ICC and τ is almost an isomorphism and we have a\nME coupling (Σ, m) of Γ and Λ and let Ω = Σ ×Λ Λ ×Λ Σ̌ be the self ME coupling\nof Γ. Moreover, assume that there exists an almost Γ × Γ-equivariant Borel map\nΦ : Ω → (G, π, τ ). Then we can find the following two maps:\n(a) a homomorphism ρ : Λ → G which is almost an isomorphism;\n(b) an almost Γ × Λ-equivariant Borel map Φ0 : Σ → (G, τ, ρ).\nBefore the proof, we give the following lemma:\nLemma 6.2. Let Γ, Λ, G be discrete groups and let (Σ, m) be a ME coupling\nof Γ and Λ. Let Y ⊂ Σ be a fundamental domain of the Γ-action on Σ and let\nθ : Λ × Y → Γ be the associated cocycle. Suppose the following two conditions:\n(i) we have a homomorphism π : Γ → G which is almost an isomorphism;\n(ii) there exists a subgroup G0 of G such that the cocycle π ◦ θ : Λ × Y → G is\ncohomologous to a cocycle which is essentially valued in G0 .\nThen G0 is a subgroup of finite index in G.\nProof. Take a standard Λ-action on a standard probability space X0 . Define a\nΓ-action and a G × Λ-action on Σ × G × X0 by\nγ(z, g, x) = (γz, π(γ)g, x)\n(g1 , λ)(z, g, x) = (λz, gg1−1 , λx)\nfor g, g1 ∈ G, γ ∈ Γ, λ ∈ Λ, z ∈ Σ and x ∈ X0 . Consider the quotient G×Λ-space Σ̃\nof Σ×G×X0 by the Γ-action. Since ker(π) is finite, the Λ-action has a fundamental\ndomain. Since coker(π) is finite, the Λ-action has a fundamental domain of finite\nmeasure. Thus, the G × Λ-space Σ̃ is a ME coupling of G and Λ.\nLet p : Σ × G × X0 → Σ̃ be the natural projection. Then p(Y × {e} × X0 )\nis a fundamental domain of the G-action on Σ̃. Remark that p is injective on\nY × {e} × X0. The cocycle θ̃ : Λ × p(Y × {e} × X0) → G associated to it is given by\nθ̃(λ, p(y, e, x)) = π ◦ θ(λ, y)\nfor λ ∈ Λ, y ∈ Y and x ∈ X0 . By assumption, we can find a Borel map φ : Y → G\nsuch that\nθ′ (λ, y) = φ(λ * y)π ◦ θ(λ, y)φ(y)−1 ∈ G0\nfor any λ ∈ Λ and a.e. y ∈ Y . Define a Borel map φ̃ : p(Y × {e} × X0 ) → G by\nφ̃(p(y, e, x)) = φ(y) for y ∈ Y . Then\nφ̃(λ * p(y, e, x))θ̃(λ, p(y, e, x))φ̃(p(y, e, x))−1\n= φ(λ * y)π ◦ θ(λ, y)φ(y)−1 ∈ G0 ,\nwhich means that θ̃ is cohomologous to a cocycle which is essentially valued in G0 .\nThe lemma now follows from [31, Lemma 6.1].\n\u0003\n\n\fMEASURE EQUIVALENCE RIGIDITY OF THE MAPPING CLASS GROUP\n\n33\n\nProof of Theorem 6.1. This proof is almost the same as in [31, Section 6.2]. One\ndenotes the element corresponding to (x, λ, y) ∈ Σ×Λ× Σ̌ by [x, λ, y] ∈ Σ×Λ Λ×Λ Σ̌.\nAs in [31, Lemma 6.6], we can prove the following lemma by using the assumption\nthat π is ICC:\nLemma 6.3. If one defines a Borel map Ψ : Σ3 → G by\nΨ(x, y, z) = Φ([x, e, z])Φ([y, e, z])−1\nfor (x, y, z) ∈ Σ3 , then\nΨ(x, y, z1 ) = Ψ(x, y, z2 )\n4\n\n4\n\nfor m -a.e. (x, y, z1 , z2 ) ∈ Σ .\nDefine a Borel map F : Σ2 → G by F (x, y) = Ψ(x, y, z). It follows from [31,\nLemma 6.2] that for m-a.e. x ∈ Σ, the Borel map ρx : Λ → Γ given by\nρx (λ) = F (λ−1 x, y)F (x, y)−1\nis the same for m-a.e. y ∈ Σ and defines a homomorphism. Moreover, the equality\nρy (λ) = F (x, y)−1 ρx (λ)F (x, y)\nholds for any λ ∈ Λ and m2 -a.e. (x, y) ∈ Σ2 . Note that we have the equality\nρx (λ) = Φ([x, λ, z])Φ([x, e, z])−1\nfor any λ ∈ Λ and m2 -a.e. (x, z) ∈ Σ2 . Let N be the normal subgroup of Λ which\nis the common kernel of ρx for m-a.e. x ∈ Σ.\nLet D ⊂ Σ be a fundamental domain of the Λ-action on Σ and put Ω̃ = D ×\nΛ × D ⊂ Σ × Λ × Σ. This inclusion induces a Borel isomorphism between Ω̃ and\nΩ. Let us give a Γ-action on Ω̃ induced by the second Γ-action A2 on Ω and give a\nΛ-action on Ω̃ by the left multiplication on the second coordinate:\n(γ, λ)(x, λ1 , y) = (x, λλ1 α(γ, y)−1 , γ * y)\nfor γ ∈ Γ, λ, λ1 ∈ Λ and x, y ∈ D, where α : Γ × D → Λ is the associated cocycle\nto D.\nLet Φ̃ : Ω̃ → G be the Borel map induced by Φ and the isomorphism between Ω̃\nand Ω. Note that Φ̃ is almost Γ-equivariant in the following sense:\nΦ̃(γω) = Φ̃(ω)τ (γ)−1\nfor any γ ∈ Γ and a.e. ω ∈ Ω̃. Put E0 = Φ̃−1 ({gn }), where {gn } ⊂ G is a finite set\nof all representatives of G/τ (Γ). Remark that E0 is invariant under the action of\nker(τ ). If E ⊂ E0 is a fundamental domain of the ker(τ )-action on E0 , then it is\nalso a fundamental domain of the Γ-action on Ω̃. Since ker(τ ) is finite, the measure\nof E0 is finite. The homomorphism ρx is given by\nρx (λ) = Φ̃(x, λ, z)Φ̃(x, e, z)−1\nfor any λ ∈ Λ and m2 -a.e. (x, z) ∈ D2 .\nFor λ0 ∈ Λ, it is easy to see that λ0 ∈ N if and only if\nΦ̃(x, λ0 λ1 , y) = Φ̃(x, λ1 , y)\n\n\f34\n\nYOSHIKATA KIDA\n\nfor any λ1 ∈ Λ and m2 -a.e. (x, y) ∈ D2 . It follows that any element in N preserves\nE0 . Since the measure of E0 is finite, we see that N is finite. Note that for any\nλ ∈ Λ and a.e. t = (x, λ1 , z) ∈ Ω̃, we have\nρx (λ) = ρx (λλ1 )ρx (λ1 )−1\n= Φ̃(x, λλ1 , z)Φ̃(x, e, z)−1 (Φ̃(x, λ1 , z)Φ̃(x, e, z)−1 )−1\n= Φ̃(λt)Φ̃(t)−1 .\nLet θ : Λ × E → Γ be the associated cocycle to E. It follows from Fubini's theorem\nthat there exists x0 ∈ D such that ρ = ρx0 : Λ → G is a homomorphism with kernel\nN and for any λ ∈ Λ, γ ∈ Γ, a.e. x ∈ D and a.e. (λ1 , z) ∈ Λ × D, we have\nρx (λ) = F (x0 , x)−1 ρ(x)F (x0 , x)\nand\nΦ̃((γ, λ)(x0 , λ1 , z)) = ρ(λ)Φ̃(x0 , λ1 , z)τ (γ)−1 .\nWe show that ρ(Λ) is a subgroup of finite index in G. Define a Borel map\nφ : E → G by\nφ(t) = F (x0 , x)Φ̃(t)\nfor t = (x, λ1 , z) ∈ E. Put\nθ′ (λ, t) = φ(λ * t)τ ◦ θ(λ, t)φ(t)−1\nfor λ ∈ Λ and t ∈ E. Since λ * t = λθ(λ, t)t, we see that\nΦ̃(λ * t) = Φ̃(λθ(λ, t)t) = Φ̃(λt)τ ◦ θ(λ, t)−1\nand\nθ′ (λ, t) = F (x0 , x)Φ̃(λ * t)τ ◦ θ(λ, t)Φ̃(t)−1 F (x0 , x)−1\n= F (x0 , x)Φ̃(λt)Φ̃(t)−1 F (x0 , x)−1\n= F (x0 , x)ρx (λ)F (x0 , x)−1 = ρ(λ) ∈ ρ(Λ).\nIt follows from Lemma 6.2 that ρ(Λ) is a subgroup of finite index in G.\nFinally, we construct a Borel map Φ0 : Σ → G. Note that {x0 } × Λ × D ⊂ Ω̃ is a\nΓ × Λ-invariant Borel subset isomorphic to Σ as Γ × Λ-spaces. It follows from the\nchoice of x0 that the composition of the restriction of Φ̃ to {x0 } × Λ × D and the\nmap G ∋ g 7→ g −1 ∈ G is a desired map.\n\u0003\nCombining Corollary 5.9 and Theorem 6.1, we obtain Theorem 1.1.\nProof of Theorem 1.2. First, suppose that κ(M 1 ) ≥ κ(M 2 ). We may assume that\nκ(M 1 ) ≥ 2. By Theorem 1.1, we can find an injective homomorphism Γ(M 1 ; 3) →\nAut(C(M 2 )) with finite cokernel. By using Theorem 2.5 and restricting the homomorphism to some subgroup Γ1 of finite index in Γ(M 1 ; 3), we can construct an\ninjective homomorphism from Γ1 into Γ(M 2 ) with finite cokernel. It follows from\n[36, Theorem 2] that M 1 = M0,6 and M 2 = M2,0 . Similarly, if we assume that\nκ(M 1 ) ≤ κ(M 2 ), then it can be shown that M 1 = M0,6 and M 2 = M2,0 .\n\u0003\n\n\fMEASURE EQUIVALENCE RIGIDITY OF THE MAPPING CLASS GROUP\n\n35\n\n7. Rigidity for a direct product of mapping class groups\nWe need to review Monod-Shalom's technique in [31, Section 5.1].\nLet Γ1 , . . . , Γn be torsion-free discrete groups in the class C, mentioned in Section\n1, and let Λ1 , . . . , Λn be torsion-free discrete groups. Put Γ = Γ1 × * * * × Γn and\nΛ = Λ1 × * * * × Λn . Let us denote\nY\nY\nΓ′i =\nΓj , Λ′i =\nΛj\nj6=i\n\nj6=i\n\nfor i ∈ {1, . . . , n}. Suppose that we have a ME coupling (Σ, m) of Γ and Λ.\nIn the above situation, we can find a bijection t : {1, . . . , n} → {1, . . . , n} and\nfundamental domains Y, X ⊂ Σ of the Γ-, Λ-actions on Σ, respectively, satisfying\nΛt(i) Y ⊂ Γi Y, Γi X ⊂ Λt(i) X\n\nfor any i ∈ {1, . . . , n}. Let Σi be the space of ergodic components of the Γ′i × Λ′t(i) action on (Σ, m) for i ∈ {1, . . . , n}, which is naturally a Γi × Λt(i) -space. Define\na measure μi (resp. νi ) on Σi by projecting the restricted measure on Γi Y (resp.\nΛt(i) X) through the natural map Γi Y → Σi (resp. Λt(i) X → Σi ). Then\n(a) μi and νi are absolutely continuous with respect to each other.\n(b) both μi and νi are invariant for the Γi × Λt(i) -action on Σi .\n(c) if Y (resp. X) is the image of Y (resp. X) in Σi , then it is a fundamental\ndomain of the Γi -action on (Σi , μi ) (resp. the Λt(i) -action on (Σi , νi )).\nMoreover, both μi (Y ) and νi (X) are finite.\nThese claims are shown in the proof of [31, Theorem 1.16], where the ergodicity\nof (Σ, m) is assumed. However, we can show the above claims along the same line\nwithout this assumption.\nLet\ndμi\nci (x) =\n(x), x ∈ Σi\ndνi\nbe the Radon-Nikodym derivative, which is positive and finite a.e. on Σi . It follows\nfrom the condition (b) that the function ci is invariant for the Γi × Λt(i) -action.\nPut\nΣi,n = {x ∈ Σi : n < ci (x) ≤ n + 1}\nF\nfor n ∈ N. Then Σi = n∈N Σi,n up to null sets. It follows from the condition (c)\nthat Σi,n is a ME coupling of Γi and Λt(i) with respect to μi for each n ∈ N (if Σi,n\nhas non-zero measure).\nIn this situation, we suppose the following condition: for i ∈ {1, . . . , n} and\nj ∈ {1, 2}, let Mij be a surface with κ(Mij ) > 0 and Mij 6= M1,2 , M2,0 . Assume that\nΓi (resp. Λi ) is a torsion-free subgroup of finite index in Γ(Mi1 )⋄ (resp. Γ(Mi2 )⋄ )\nfor each i.\nRemark that the mapping class group Γ(M ) is in C for a surface M with κ(M ) ≥\n0 ([19, Corollary B]) and this property is preserved under measure equivalence and\nin particular, commensurability up to finite kernel ([31, Corollary 7.6]). Note that\n2\nMi1 and Mt(i)\nare diffeomorphic for any i by Theorem 1.2 and let gi be an isotopy\n2\nclass of a diffeomorphism Mt(i)\n→ Mi1 . Let\nπg :\n\nn\nY\n\ni=1\n\nΓ(Mi2 )⋄ →\n\nn\nY\n\ni=1\n\nAut(C(Mi1 ))\n\n\f36\n\nYOSHIKATA KIDA\n\nbe the isomorphism defined by\nπg (γ1 , . . . , γn ) = (π(g1 γt(1) g1−1 ), . . . , π(gn γt(n) gn−1 ))\nfor γi ∈ Γ(Mi2 )⋄ , where we denote by the same symbol π the natural homomorphism\nΓ(M )⋄ → Aut(C(M )) for a surface M . By applying Corollary 5.9 to each ME\ncoupling Σi,n of Γi and Λt(i) , we can find an almost Γi ×Λt(i) -equivariant Borel map\n2\n)⋄ → Aut(C(Mi1 )) is defined by\nΦi : Σi → (Aut(C(Mi )), π, πgi ), where πgi : Γ(Mt(i)\nQn\nusing gi . Then we can define a Borel map Φ : Σ → i=1 Aut(C(Mi1 )) by\nΦ(x) = (Φ1 (p1 (x)), . . . , Φn (pn (x)))\n\nfor x ∈ Σ, where pi : Σ → Σi denotes the natural projection. It is easy to see that\nΦ((γ, λ)x) = π(γ)Φ(x)πg (λ)−1\nfor any γ ∈ Γ, λ ∈ Λ and a.e. x ∈ Σ.\nHence, we have shown the following:\nTheorem 7.1. For i ∈ {1, . . . , n} and j ∈ {1, 2}, let Mij be a surface with κ(Mij ) >\n0 and Mij 6= M1,2 , M2,0 . Assume that Γi (resp. Λi ) is a torsion-free subgroup of\nfinite index in Γ(Mi1 )⋄ (resp. Γ(Mi2 )⋄ ). Put Γ = Γ1 × * * * × Γn , Λ = Λ1 × * * * × Λn .\nSuppose that we have a ME coupling (Σ, m) of Γ and Λ. Then we can find the\nfollowing:\n(a) a bijection t on the set {1, . . . , n};\n2\n(b) an isotopy class gi of a diffeomorphism Mt(i)\n→ Mi1 for each i;\n(c) an almost Γ × Λ-equivariant Borel map\n!\nn\nY\nAut(C(Mi1 )), π, πg .\nΦ: Σ →\ni=1\n\nCorollary 7.2. The conclusion of Theorem 7.1 holds even if Γ (resp. Λ) is a\nsubgroup of finite index in Γ(M11 )⋄ × * * * × Γ(Mn1 )⋄ (resp. Γ(M12 )⋄ × * * * × Γ(Mn2 )⋄ ).\nProof. It is easy to check that if κ(Mi ) > 0 and Γi is a finite index subgroup of\nΓ(Mi )⋄ , then the natural homomorphism\nΓ1 × * * * × Γn → Aut(C(M1 )) × * * * × Aut(C(Mn ))\nis almost an isomorphism and ICC. By Lemma 5.8 and Theorem 7.1, we obtain the\ncorollary.\n\u0003\nCombining Theorem 6.1 and the above corollary, we can obtain Theorem 1.3.\nThe following corollary determines all isomorphisms between finite index subgroups\nof a direct product of mapping class groups (see also [23, Section 8.5]).\nCorollary 7.3. For i ∈ {1, . . . , n}, let Mi be a surface with κ(Mi ) > 0 and Mi 6=\nM1,2 , M2,0 , and let Γ be a finite index subgroup of G = Γ(M1 )⋄ × * * * × Γ(Mn )⋄ .\nSuppose that we have an injective homomorphism τ : Γ → G with finite cokernel.\nThen we can find a bijection t on the set {1, . . . , n} and an isotopy class gi of a\ndiffeomorphism Mt(i) → Mi for each i such that for any γ = (γ1 , . . . , γn ) ∈ Γ, we\nhave\nτ (γ) = (g1 γt(1) g1−1 , . . . , gn γt(n) gn−1 ).\n\n\fMEASURE EQUIVALENCE RIGIDITY OF THE MAPPING CLASS GROUP\n\n37\n\nProof. We identify Γ(Mi )⋄ and Aut(C(Mi )) via the natural isomorphism. Consider\nthe self ME coupling (G, π, τ ) of Γ. It follows from Corollary 7.2 that we can find\nthe following:\n(a) a bijection t on {1, . . . , n};\n2\n(b) an isotopy class gi of a diffeomorphism Mt(i)\n→ Mi1 for each i;\n(c) an almost Γ × Γ-equivariant Borel map\nΦ : (G, π, τ ) → (G, π, πg ).\nPut h = (h1 , . . . , hn ) = Φ(e) and define an automorphism πhg of G by\nπhg (s) = (h1 g1 st(1) g1−1 h1−1 , . . . , hn gn st(n) gn−1 h−1\nn )\nfor s = (s1 , . . . , sn ) ∈ G. Define a G × G-equivariant map\nΨ : (G, π, πg ) → (G, π, πhg )\n−1\n\nby Ψ(s) = sh for s ∈ G. Since (G, π, τ ) is also a ME coupling of G and Γ, we see\nthat Φ is G × Γ-equivariant by Lemma 5.8. It is easy to see that Ψ ◦ Φ(e) = e and\nthus, Ψ ◦ Φ = id. Therefore, τ is the restriction of πhg .\n\u0003\n8. Lattice embeddings of the mapping class group\nIn this final section, we give another application of Corollaries 5.9 and 7.2,\nfollowing [13]. We describe all lattice embeddings of a finite direct product of\nmapping class groups into a locally compact second countable (lcsc) group. We\nfix notations as follows: let n be a positive integer and Mi be a surface with\nκ(Mi ) > 0 for i ∈ {1, . . . , n}. Put G0 = Γ(M1 )⋄ × * * * × Γ(Mn )⋄ and G =\nAut(C(M1 )) × * * * × Aut(C(Mn )). Let π : G0 → G be the natural homomorphism.\nTheorem 8.1. Let Γ be a finite index subgroup of G0 . Suppose that we have a\nlattice embedding σ : Γ → H into a lcsc group H. Then there exist the following\ntwo maps:\n(i) an almost Γ × Γ-equivariant Borel map Φ : (H, σ, σ) → (G, π, π), which\nsatisfies Φ(h1 h2 ) = Φ(h1 )Φ(h2 ) for a.e. (h1 , h2 ) ∈ H × H;\n(ii) a continuous homomorphism Φ0 : H → G such that Φ0 (h) = Φ(h) for a.e.\nh ∈ H and Φ0 (σ(γ)) = π(γ) for any γ ∈ Γ. Moreover, ker(Φ0 ) is compact.\nProof. First, we show the assertion (i). To prove this, we may assume that Mi 6=\nM1,2 , M2,0 for all i by using Lemma 5.8. We identify Γ(Mi )⋄ and Aut(C(Mi )) via\nthe natural isomorphism. Applying Corollary 7.2 to the self ME coupling H of Γ\nwith the Haar measure, we can find a bijection t on the set {1, . . . , n}, an isotopy\nclass gi of a diffeomorphism Mt(i) → Mi and an almost Γ × Γ-equivariant Borel\nmap\nΦ′ : (H, σ, σ) → (G, π, πg ).\nDefine a Borel map F : H × H → G by\n−1 ′ −1\nF (h1 , h2 ) = Φ′ (h−1\nΦ (h1 h2 )Φ′ (h2 )−1\n1 )\n\nfor h1 , h2 ∈ H. Then for any γ ∈ Γ and a.e. (h1 , h2 ) ∈ H × H, we have\nF (h1 σ(γ), h2 ) = F (h1 , h2 ) = F (h1 , h2 σ(γ)−1 ),\nF (σ(γ)h1 , σ(γ)h2 ) = πg (γ)F (h1 , h2 )π(γ)−1 .\nThus, F induces a Borel map f from X = (H/σ(Γ)) × (H/σ(Γ)) to G such that\nf (γx) = πg (γ)f (x)π(γ)−1\n\n\f38\n\nYOSHIKATA KIDA\n\nfor any γ ∈ Γ and a.e. x ∈ X, where the Γ-action on X is induced from the diagonal\none on H × H through σ. By projecting the finite Γ-invariant measure on X to\nG through f , we obtain a finite measure μ on G invariant under the action of the\ndiagonal subgroup of Γ × Γ on (G, πg , π). It follows that t = id and gi ∈ Γ(Mi )⋄ .\nPut g = (g1 , . . . , gn ) ∈ G. The support of μ is {g} and F (h1 , h2 ) = g, that is,\n′ −1\n′\nΦ′ (h−1\n1 h2 ) = Φ (h1 )gΦ (h2 ) for a.e. (h1 , h2 ) ∈ H × H.\nDefine a G × G-equivariant map Φ′′ : (G, π, πg ) → (G, π, π) by Φ′′ (γ) = γg for\nγ ∈ G. Then the composition Φ = Φ′′ ◦ Φ′ is a Γ × Γ-equivariant Borel map from\n−1\n(H, σ, σ) to (G, π, π) and it satisfies Φ(h−1\n1 h2 ) = Φ(h1 )Φ(h2 ) for a.e. (h1 , h2 ) ∈\nH × H.\nNext, we show the assertion (ii). It follows from [40, Theorems B.2, B.3] that\nthere exists a continuous homomorphism Φ0 : H → G such that Φ0 (h) = Φ(h) for\na.e. h ∈ H. For any γ ∈ Γ and a.e. h ∈ H, we have\nπ(γ)Φ(h) = Φ(σ(γ)h) = Φ0 (σ(γ)h) = Φ0 (σ(γ))Φ0 (h) = Φ0 (σ(γ))Φ(h),\nwhich implies π(γ) = Φ0 (σ(γ)) for any γ ∈ Γ.\nSince ker(Φ0 ) is essentially equal to Φ−1 (e), which has finite measure, we see\nthat ker(Φ0 ) is compact.\n\u0003\nProof of Theorem 1.4. It follows from Theorem 8.1 that there exists a continuous homomorphism Φ0 : H → G such that K = ker(Φ0 ) is compact. Let H0 = Φ−1\n0 (π(Γ)).\nThese groups satisfy the conditions in the theorem.\n\u0003\nReferences\n[1] C. Anantharaman-Delaroche and J. Renault, Amenable groupoids, Monogr. Enseign. Math.,\n36. Enseignement Math., Geneva, 2000.\n[2] M. Bestvina and K. Fujiwara, Bounded cohomology of subgroups of mapping class groups,\nGeom. Topol. 6 (2002), 69–89.\n[3] J. S. Birman, A. Lubotzky and J. McCarthy, Abelian and solvable subgroups of the mapping\nclass groups, Duke Math. J. 50 (1983), 1107–1120.\n[4] A. Connes, J. Feldman and B. Weiss, An amenable equivalence relation is generated by a\nsingle transformation, Ergodic Theory Dynam. Systems 1 (1981), 431–450 (1982).\n[5] H. A. Dye, On groups of measure preserving transformation. I, Amer. J. Math. 81 (1959),\n119–159.\n[6] H. A. Dye, On groups of measure preserving transformations. II, Amer. J. Math. 85 (1963),\n551–576.\n[7] B. Farb, The quasi-isometry classification of lattices in semisimple Lie groups, Math. Res.\nLett. 4 (1997), 705–717.\n[8] B. Farb and H. Masur, Superrigidity and mapping class groups, Topology 37 (1998), 1169–\n1176.\n[9] A. Fathi, F. Laudenbach and V. Poénaru, Travaux de Thurston sur les surfaces. Séminaire\nOrsay, Astérisque, 66–67. Soc. Math. France, Paris, 1979.\n[10] J. Feldman, C. E. Sutherland and R. J. Zimmer, Subrelations of ergodic equivalence relations,\nErgodic Theory Dynam. Systems 9 (1989), 239–269.\n[11] A. Furman, Gromov's measure equivalence and rigidity of higher rank lattices, Ann. of Math.\n(2) 150 (1999), 1059–1081.\n[12] A. Furman, Orbit equivalence rigidity, Ann. of Math. (2) 150 (1999), 1083–1108.\n[13] A. Furman, Mostow-Margulis rigidity with locally compact targets, Geom. Funct. Anal. 11\n(2001), 30–59.\n[14] D. Gaboriau, Invariants l2 de relations d'équivalence et de groupes, Publ. Math. Inst. Hautes\nÉtudes Sci. No. 95 (2002), 93–150.\n[15] D. Gaboriau, Examples of groups that are measure equivalent to the free group, Ergodic\nTheory Dynam. Systems 25 (2005), 1809–1827.\n\n\fMEASURE EQUIVALENCE RIGIDITY OF THE MAPPING CLASS GROUP\n\n39\n\n[16] M. Gromov, Asymptotic invariants of infinite groups, in Geometric group theory, Vol. 2\n(Sussex, 1991), 1–295, London Math. Soc. Lecture Note Ser., 182, Cambridge Univ. Press,\nCambridge, 1993.\n[17] É. Ghys and P. de la Harpe, Sur les groupes hyperboliques d'après Mikhael Gromov, Progr.\nin Math., 83. Birkhäuser Boston, Inc., Boston, MA, 1990.\n[18] U. Hamenstädt, Train tracks and the Gromov boundary of the complex of curves, preprint,\nmath.GT/0409611.\n[19] U. Hamenstädt, Bounded cohomology and isometry groups of hyperbolic spaces, preprint,\nmath.GR/0507097.\n[20] W. J. Harvey, Boundary structure of the modular group, in Riemann surfaces and related\ntopics: Proceedings of the 1978 Stony Brook Conference, 245–251, Ann. of Math. Stud., 97,\nPrinceton Univ. Press, Princeton, N.J., 1981.\n[21] N. V. Ivanov, Subgroups of Teichmüller modular groups, Transl. of Math. Monogr., 115.\nAmer. Math. Soc., Providence, RI, 1992.\n[22] N. V. Ivanov, Automorphism of complexes of curves and of Teichmüller spaces, Internat.\nMath. Res. Notices 1997, no. 14, 651–666.\n[23] N. V. Ivanov, Mapping class groups, in Handbook of geometric topology, 523–633, NorthHolland, Amsterdam, 2002.\n[24] V. A. Kaimanovich and H. Masur, The Poisson boundary of the mapping class group, Invent.\nMath. 125 (1996), 221–264.\n[25] Y. Kida, The mapping class group from the viewpoint of measure equivalence theory, preprint,\nmath.GR/0512230, to appear in Mem. Amer. Math. Soc.\n[26] Y. Kida, Orbit equivalence rigidity and certain generalized Bernoulli shifts of the mapping\nclass group, preprint, math.GR/0607601.\n[27] E. Klarreich, The boundary at infinity of the curve complex and the relative Teichmüller\nspace, preprint, available at http://nasw.org/users/klarreich.\n[28] F. Luo, Automorphisms of the complex of curves, Topology 39 (2000), 283–298.\n[29] H. A. Masur and Y. N. Minsky, Geometry of the complex of curves. I. Hyperbolicity, Invent.\nMath. 138 (1999), 103–149.\n[30] J. McCarthy and A. Papadopoulos, Dynamics on Thurston's sphere of projective measured\nfoliations, Comment. Math. Helv. 64 (1989), 133–166.\n[31] N. Monod and Y. Shalom, Orbit equivalence rigidity and bounded cohomology, preprint, to\nappear in Ann. of Math., available at http://www.unige.ch/math/folks/monod .\n[32] M. Korkmaz, On cofinite subgroups of mapping class groups, Turkish J. Math. 27 (2003),\n115–123.\n[33] D. S. Ornstein and B. Weiss, Ergodic theory of amenable group actions. I. The Rohlin lemma,\nBull. Amer. Math. Soc. (N.S.) 2 (1980), 161–164.\n[34] S. Popa, Strong rigidity of II1 factors arising from malleable actions of w-rigid groups, II,\npreprint, math.OA/0407103, to appear in Invent. Math.\n[35] S. Popa, Cocycle and orbit equivalence superrigidity for Bernoulli actions of Kazhdan groups,\npreprint, math.GR/0512646.\n[36] K. J. Shackleton, Combinatorial rigidity in curve complexes and mapping class groups,\npreprint, math.GT/0503199.\n[37] M. Shalom, Measurable group theory, in European Congress of Mathematics, 391–423, Eur.\nMath. Soc., Zürich, 2005.\n[38] S. Vaes, Rigidity results for Bernoulli actions and their von Neumann algebras (after Sorin\nPopa), preprint, math.OA/0603434.\n[39] S.-K. Yeung, Representations of semisimple lattices in mapping class groups, Int. Math. Res.\nNot. 2003, no. 31, 1677–1686.\n[40] R. J. Zimmer, Ergodic theory and semisimple groups, Monogr. Math., 81. Birkhäuser Verlag,\nBasel, 1984.\nMax-Planck-Institut für Mathematik, Vivatsgasse 7, Bonn 53111, Germany\nE-mail address: kida@mpim-bonn.mpg.de\n\n\f"}