{"id": "http://arxiv.org/abs/math-ph/0003015v1", "guidislink": true, "updated": "2000-03-16T20:35:13Z", "updated_parsed": [2000, 3, 16, 20, 35, 13, 3, 76, 0], "published": "2000-03-16T20:35:13Z", "published_parsed": [2000, 3, 16, 20, 35, 13, 3, 76, 0], "title": "Singularity structure of the two point function of the free Dirac field\n  on a globally hyperbolic spacetime", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=math-ph%2F0003024%2Cmath-ph%2F0003044%2Cmath-ph%2F0003013%2Cmath-ph%2F0003010%2Cmath-ph%2F0003035%2Cmath-ph%2F0003001%2Cmath-ph%2F0003021%2Cmath-ph%2F0003030%2Cmath-ph%2F0003027%2Cmath-ph%2F0003038%2Cmath-ph%2F0003043%2Cmath-ph%2F0003026%2Cmath-ph%2F0003008%2Cmath-ph%2F0003011%2Cmath-ph%2F0003007%2Cmath-ph%2F0003033%2Cmath-ph%2F0003014%2Cmath-ph%2F0003031%2Cmath-ph%2F0003018%2Cmath-ph%2F0003023%2Cmath-ph%2F0003015%2Cmath-ph%2F0003022%2Cmath-ph%2F0003016%2Cmath-ph%2F0003002%2Cmath-ph%2F0003037%2Cmath-ph%2F0003020%2Cmath-ph%2F0003045%2Cmath-ph%2F0011022%2Cmath-ph%2F0011016%2Cmath-ph%2F0011032%2Cmath-ph%2F0011027%2Cmath-ph%2F0011011%2Cmath-ph%2F0011002%2Cmath-ph%2F0011036%2Cmath-ph%2F0011048%2Cmath-ph%2F0011012%2Cmath-ph%2F0011006%2Cmath-ph%2F0011040%2Cmath-ph%2F0011010%2Cmath-ph%2F0011050%2Cmath-ph%2F0011046%2Cmath-ph%2F0011038%2Cmath-ph%2F0011017%2Cmath-ph%2F0011026%2Cmath-ph%2F0011005%2Cmath-ph%2F0011051%2Cmath-ph%2F0011025%2Cmath-ph%2F0011020%2Cmath-ph%2F0011021%2Cmath-ph%2F0011029%2Cmath-ph%2F0011041%2Cmath-ph%2F0011037%2Cmath-ph%2F0011043%2Cmath-ph%2F0011013%2Cmath-ph%2F0011008%2Cmath-ph%2F0011044%2Cmath-ph%2F0011053%2Cmath-ph%2F0011039%2Cmath-ph%2F0011034%2Cmath-ph%2F0011019%2Cmath-ph%2F0011030%2Cmath-ph%2F0011007%2Cmath-ph%2F0011018%2Cmath-ph%2F0011049%2Cmath-ph%2F0011031%2Cmath-ph%2F0011033%2Cmath-ph%2F0011035%2Cmath-ph%2F0011003%2Cmath-ph%2F0011024%2Cmath-ph%2F0011014%2Cmath-ph%2F0011004%2Cmath-ph%2F0011052%2Cmath-ph%2F0011028%2Cmath-ph%2F0011009%2Cmath-ph%2F0011001%2Cmath-ph%2F0011023%2Cmath-ph%2F0011042%2Cmath-ph%2F0011047%2Cmath-ph%2F0011045%2Cmath-ph%2F0011015%2Cmath-ph%2F0308037%2Cmath-ph%2F0308009%2Cmath-ph%2F0308034%2Cmath-ph%2F0308032%2Cmath-ph%2F0308022%2Cmath-ph%2F0308028%2Cmath-ph%2F0308031%2Cmath-ph%2F0308029%2Cmath-ph%2F0308026%2Cmath-ph%2F0308045%2Cmath-ph%2F0308043%2Cmath-ph%2F0308012%2Cmath-ph%2F0308035%2Cmath-ph%2F0308013%2Cmath-ph%2F0308041%2Cmath-ph%2F0308008%2Cmath-ph%2F0308002%2Cmath-ph%2F0308040%2Cmath-ph%2F0308020%2Cmath-ph%2F0308036%2Cmath-ph%2F0308004&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Singularity structure of the two point function of the free Dirac field\n  on a globally hyperbolic spacetime"}, "summary": "We give an introduction to the techniques from microlocal analysis that have\nsuccessfully been applied in the investigation of Hadamard states of free\nquantum field theories on curved spacetimes. The calculation of the wave front\nset of the two point function of the free Klein-Gordon field in a Hadamard\nstate is reviewed, and the polarization set of a Hadamard two point function of\nthe free Dirac field on a curved spacetime is calculated.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=math-ph%2F0003024%2Cmath-ph%2F0003044%2Cmath-ph%2F0003013%2Cmath-ph%2F0003010%2Cmath-ph%2F0003035%2Cmath-ph%2F0003001%2Cmath-ph%2F0003021%2Cmath-ph%2F0003030%2Cmath-ph%2F0003027%2Cmath-ph%2F0003038%2Cmath-ph%2F0003043%2Cmath-ph%2F0003026%2Cmath-ph%2F0003008%2Cmath-ph%2F0003011%2Cmath-ph%2F0003007%2Cmath-ph%2F0003033%2Cmath-ph%2F0003014%2Cmath-ph%2F0003031%2Cmath-ph%2F0003018%2Cmath-ph%2F0003023%2Cmath-ph%2F0003015%2Cmath-ph%2F0003022%2Cmath-ph%2F0003016%2Cmath-ph%2F0003002%2Cmath-ph%2F0003037%2Cmath-ph%2F0003020%2Cmath-ph%2F0003045%2Cmath-ph%2F0011022%2Cmath-ph%2F0011016%2Cmath-ph%2F0011032%2Cmath-ph%2F0011027%2Cmath-ph%2F0011011%2Cmath-ph%2F0011002%2Cmath-ph%2F0011036%2Cmath-ph%2F0011048%2Cmath-ph%2F0011012%2Cmath-ph%2F0011006%2Cmath-ph%2F0011040%2Cmath-ph%2F0011010%2Cmath-ph%2F0011050%2Cmath-ph%2F0011046%2Cmath-ph%2F0011038%2Cmath-ph%2F0011017%2Cmath-ph%2F0011026%2Cmath-ph%2F0011005%2Cmath-ph%2F0011051%2Cmath-ph%2F0011025%2Cmath-ph%2F0011020%2Cmath-ph%2F0011021%2Cmath-ph%2F0011029%2Cmath-ph%2F0011041%2Cmath-ph%2F0011037%2Cmath-ph%2F0011043%2Cmath-ph%2F0011013%2Cmath-ph%2F0011008%2Cmath-ph%2F0011044%2Cmath-ph%2F0011053%2Cmath-ph%2F0011039%2Cmath-ph%2F0011034%2Cmath-ph%2F0011019%2Cmath-ph%2F0011030%2Cmath-ph%2F0011007%2Cmath-ph%2F0011018%2Cmath-ph%2F0011049%2Cmath-ph%2F0011031%2Cmath-ph%2F0011033%2Cmath-ph%2F0011035%2Cmath-ph%2F0011003%2Cmath-ph%2F0011024%2Cmath-ph%2F0011014%2Cmath-ph%2F0011004%2Cmath-ph%2F0011052%2Cmath-ph%2F0011028%2Cmath-ph%2F0011009%2Cmath-ph%2F0011001%2Cmath-ph%2F0011023%2Cmath-ph%2F0011042%2Cmath-ph%2F0011047%2Cmath-ph%2F0011045%2Cmath-ph%2F0011015%2Cmath-ph%2F0308037%2Cmath-ph%2F0308009%2Cmath-ph%2F0308034%2Cmath-ph%2F0308032%2Cmath-ph%2F0308022%2Cmath-ph%2F0308028%2Cmath-ph%2F0308031%2Cmath-ph%2F0308029%2Cmath-ph%2F0308026%2Cmath-ph%2F0308045%2Cmath-ph%2F0308043%2Cmath-ph%2F0308012%2Cmath-ph%2F0308035%2Cmath-ph%2F0308013%2Cmath-ph%2F0308041%2Cmath-ph%2F0308008%2Cmath-ph%2F0308002%2Cmath-ph%2F0308040%2Cmath-ph%2F0308020%2Cmath-ph%2F0308036%2Cmath-ph%2F0308004&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We give an introduction to the techniques from microlocal analysis that have\nsuccessfully been applied in the investigation of Hadamard states of free\nquantum field theories on curved spacetimes. The calculation of the wave front\nset of the two point function of the free Klein-Gordon field in a Hadamard\nstate is reviewed, and the polarization set of a Hadamard two point function of\nthe free Dirac field on a curved spacetime is calculated."}, "authors": ["Kai Kratzert"], "author_detail": {"name": "Kai Kratzert"}, "author": "Kai Kratzert", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1002/1521-3889(200006)9:6<475::AID-ANDP475>3.0.CO;2-S", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/math-ph/0003015v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/math-ph/0003015v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "28 pages, LaTeX, to be published in Annalen der Physik", "arxiv_primary_category": {"term": "math-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.MP", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/math-ph/0003015v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/math-ph/0003015v1", "journal_reference": "Annalen Phys. 9 (2000) 475-498", "doi": "10.1002/1521-3889(200006)9:6<475::AID-ANDP475>3.0.CO;2-S", "fulltext": "arXiv:math-ph/0003015v1 16 Mar 2000\n\nMarch 2000\n\nDESY 00–043\nmath-ph/0003015\n\nSingularity structure of the\ntwo point function of the free Dirac field\non a globally hyperbolic spacetime\nKai Kratzert\nDeutsches Elektronen-Synchrotron DESY\nNotkestrasse 85, D–22603 Hamburg, Germany\nkai.kratzert@desy.de\n\nMarch 10, 2000\n\nAbstract\nWe give an introduction to the techniques from microlocal analysis that\nhave successfully been applied in the investigation of Hadamard states of free\nquantum field theories on curved spacetimes. The calculation of the wave front\nset of the two point function of the free Klein-Gordon field in a Hadamard state\nis reviewed, and the polarization set of a Hadamard two point function of the\nfree Dirac field on a curved spacetime is calculated.\n\n1\n\n\f1\n\nIntroduction\n\nThe general framework of this work is that of quantum field theory on curved spacetime. Since we still do not have a full theory of quantum gravity, as a first step we\ntry to include gravitational effects into the quantum field theoretical description of\nour world by a semi-classical approximation. The gravitational field is considered as\na fixed classical background spacetime on which matter is described by a quantum\nfield theory. Since the Planck length, at which effects from quantum gravity are\nexpected to become important, is very small, this approximation should have a wide\nrange of validity and should be appropriate to predict quantum effects near black\nholes or in the early universe. One famous result in this framework is the Hawking\nradiation of black holes.\nThe main problem in the quantization of a field theory on a curved background\nis that one cannot make use of Poincaré invariance like on Minkowski spacetime,\nwhere this symmetry fixes a unique vacuum state. On a curved spacetime, however,\nthere is no such natural choice of a state, and the central task is to single out the\nphysically acceptable ones.\nFor free, linear models it has turned out that these acceptable states are the\nquasi-free Hadamard states. They are determined by their two point function which\nhas got a prescribed singularity structure fixed by geometry. For the free KleinGordon field it was recently discovered by Radzikowski that this Hadamard condition,\nwhich at first sight is a global condition, can be reformulated as a local condition\nin terms of wave front sets. This allows one to apply the elegant and powerful\nmathematical techniques from microlocal analysis. In this way it could be proved\nthat certain states known for a long time are indeed Hadamard states. A microlocal\nspectrum condition for interacting quantum field theories was formulated and used\nto define Wick polynomials and to prove the renormalizability of interacting scalar\nfield theories on globally hyperbolic spacetimes.\nFor more realistic quantum field theories, however, first of all the Dirac field,\nmore or less nothing was done, not because of conceptual problems, but because of\nthe greater complexity due to the multi-component nature of the Dirac field. In this\nwork the singularity structure of the two point function of the free Dirac field will\nbe investigated. We will make use of the polarization set which was introduced by\nDencker in order to analyze the singularities of vector-valued distributions. Applying\nDencker's results, we will show that the singularities of solutions of the Dirac equation\npropagate in a simple way. This will be used to calculate the polarization set of the\ntwo point function for Hadamard states of the Dirac field. Our analysis makes use\nof unpublished results by Radzikowski [18], and our results are in agreement with\nthose independently obtained by Hollands [23] using a slightly different approach.\nThis paper is organized as follows: The first chapter after the introduction gives\nan overview of the physical problems we are interested in and fixes the notation used\nthroughout this work. We introduce the Klein-Gordon and Dirac fields on a curved\n2\n\n\fspacetime and give a definition of Hadamard states. After that, we come to the\nmathematics and review the methods from microlocal analysis on which our analysis\nis based. The central definitions are the wave front and polarization sets, and the\nmain results are the theorems on the propagation of singularities. As a side result, we\nwill rederive the well-known properties of light propagation in a curved spacetime in\na mathematically very elegant way. In the fourth chapter these methods are applied\nto our physical objects, and we state our main results. Finally we give an outlook\nand an overview about possible applications of our results.\n\n2\n2.1\n\nQuantum field theory on curved spacetime\nNotions from general relativity\n\nIn the general theory of relativity, for an introduction see [1], spacetime is represented by a differentiable manifold (M, g) equipped with a Lorentzian metric g, i.e.\na differentiable, symmetric, and non-degenerate type (0, 2) tensor field of signature\n(+ − −−). For simplicity, we restrict ourselves to the physical four dimensions.\nAs usual, the tangent bundle will be denoted T M, and the cotangent bundle\nis T ∗M. For the set {(x, ξ) ∈ T ∗M | ξ 6= 0} we will shortly write T ∗M \\ 0. The\ncanonical projection will always be denoted π : T ∗M → M. Any vector bundle E\nover M can be pulled back to a vector bundle π ∗ E over T ∗M. The set of smooth\nsections of a vector bundle E over M will be denoted Γ(M, E), sections having\ncompact support form the set Γ0 (M, E).\nThe Levi-Civitá connection is the unique connection on T M that is symmetric\nand compatible with the metric. The associated covariant derivative is denoted ∇.\nThe Riemann tensor is the curvature tensor of this connection which is contracted\nto the Ricci tensor and finally to the scalar curvature R.\nWe will restrict ourselves to globally hyperbolic spacetimes. These are spacetimes\nthat admit a Cauchy surface, that is a spacelike hypersurface Σ ⊂ M which is\nintersected by any nonextendable causal curve in M exactly once. In other words,\nM = D(Σ), where we have introduced the domain of causal dependence D(Σ)\nwhich is the set of all points x ∈ M such that any causal curve through x intersects\nΣ. In the globally hyperbolic case the manifold is topologically of the simple form\nM = R × Σ. Many physically interesting spacetimes like flat Minkowski spacetime,\nSchwarzschild spacetime as a black hole model, or Robertson-Walker spacetimes as\ncosmological models fall into this class.\nIn order to include more general models like anti-de Sitter spacetime, this restriction can be somewhat weakened. Crucial for the following is mainly the existence\nof unique propagators as well as the existence of a spinor bundle. Since our constructions are purely local, they immediately carry over to all globally hyperbolic\nsubmanifolds of any spacetime.\n3\n\n\fGlobally hyperbolic spacetimes are time orientable, such that the light cone, i.e.\nthe set of all nonvanishing timelike covectors in Tx∗ M, can be separated into a forward\n±\nand backward light cone, Vx+ and Vx− , continuously in x. The closed light cones V x\ninclude the lightlike covectors. The time orientation induces the separation of the\ncausal future J + (x) and past J − (x) of a point x ∈ M which are the sets of all points\nthat can be reached from x by a future (past) directed causal curve.\nWhile the tangent bundle T M and the cotangent bundle T ∗M naturally exist for\nany spacetime M, the existence of spinors is less trivial. In order to define spinors,\nthe bundle of orthonormal frames, which is a principal fibre bundle whose structure\ngroup is the proper orthochronous Lorentz group, has to be lifted to a principal fibre\nbundle with the universal covering group SL(2, C) as structure group, called the\nspin structure. The Dirac spinor bundle is then defined as the associated C4 -vector\nbundle. It can be shown that for any globally hyperbolic spacetime there exists\nsuch a spinor bundle DM which in this case is just a trivial bundle over M. The\nconstruction of the spinor bundle leads naturally to a covariant derivative on DM\nand the dual bundle D ∗M which will also be denoted ∇. In local coordinates one\nhas ∇μ = ∂μ + σμ , where the 4 × 4 matrices σμ can be expressed in terms of the\nChristoffel symbols and the Dirac matrices. For details see [9].\n\n2.2\n\nThe free Klein-Gordon field\n\nThe simplest example of a quantum field theory is the free scalar field, satisfying the\nKlein-Gordon equation\n(\u0003g + m2 )φ(x) = 0.\n\n(1)\n\nThis is already the covariant field equation on a generic spacetime (M, g) if \u0003g is the\ncovariant wave operator \u0003g = g μν ∇μ ∇ν of the metric g. The positive real constant\nm plays the role of a mass.\nBecause of the global hyperbolicity of our spacetime, the Cauchy problem for the\nKlein-Gordon operator has a unique solution, and there exist unique retarded and\nadvanced propagators, ∆ret and ∆adv , such that\n(\u0003g + m2 )∆ret,adv = ∆ret,adv (\u0003g + m2 ) = 1\n\n(2)\n\nand supp(∆ret,adv f ) ⊂ J ± (suppf ). We define the commutator function ∆ = ∆ret −\n∆adv and identify the operator ∆ with the distribution\nZ\n∆ : (f, g) 7→ ∆(f, g) = f (x)(∆g)(x)dμ(x),\n(3)\nwhere dμ is the volume element on M.\nIn the quantum theory the field φ is represented as an operator valued distribution such that we have smeared field operators φ(f ), f ∈ C0∞ (M), acting on some\n4\n\n\fHilbert space with a vacuum vector Ω. They are required to satisfy the Klein-Gordon\nequation and the canonical commutation relations\n[φ(f ), φ(g)] = i∆(f, g) * 1.\n\n(4)\n\nSince we investigate a free theory, we expect that all vacuum expectation values\nof products of field operators are determined by the two point function\nΛ(x, y) =< Ω, φ(x)φ(y)Ω >\n\n(5)\n\nwhich is assumed to be a distribution Λ ∈ D ′ (M × M).\nCanonical quantization of the free Klein-Gordon field can be carried through in\nclose analogy to quantization on Minkowski spacetime (see for example [2]), and one\nends up with a Fock space representation of the field φ in terms of creation and\nannihilation operators. However, the problem is that there is no preferred mode\nexpansion in terms of plain waves, because the Fourier transform is not invariant under general coordinate transformations. The crucial point is the ambiguous division\ninto positive- and negative-frequency modes. Therefore this construction is highly\nnon-unique, and there is a large amount of unitarily inequivalent representations, as\nwas first observed by Fulling [3]. A priori we do not know the 'real' vacuum state\nΩ, and as a consequence there is no preferred interpretation of the theory in terms\nof particles. If the spacetime is asymptotically flat, one can carry over the particle\ninterpretation from the flat part to the whole spacetime, but on a generic spacetime\none has to face the fact that quantum field theory is primarily a theory of fields, and\nno unique particle interpretation can be expected.\nFrom an axiomatic viewpoint, the vacuum state on Minkowski spacetime is singled out by the requirement of its Poincaré invariance and the spectrum condition which is the requirement that the energy-momentum operator (the generator\nof translations) takes its spectrum in the closed forward light cone. In the absence\nof Poincaré invariance on a generic spacetime these conditions no longer make any\nsense. While one will still demand invariance under the symmetries of the spacetime\n(if there are any), there is no simple analogue to the spectrum condition since there\nare no generators of translations. Thus one central task of quantum field theory on\ncurved spacetime is to characterize physical states by finding a generalized spectrum\ncondition for generic spacetimes.\nUsually the construction sketched above is performed in the algebraic approach\nto quantum field theory. There the local net of observable algebras can be defined\nin a unique way, but one still has to fix a state on the algebra (which corresponds to\nthe preparation of the system). Again one restricts oneself to quasifree states that\nare fixed once a two point distribution is specified, and via the GNS construction the\nstate induces a Hilbert space representation of the observable algebra. For details\non this approach we refer to [4].\n5\n\n\f2.3\n\nHadamard states\n\nIn order to single out a class of acceptable quantum states, one physical requirement\nis that we should be able to formulate the semi-classical Einstein equations in order\nto describe the back reaction of the quantum field on the spacetime geometry:\n1\n(6)\nRμν − gμν R = 8πhTμν i.\n2\nHere, hTμν i is the expectation value of the energy momentum tensor of the quantum\nfield. Thus physical states have to allow a unique definition of this expectation value.\nIt could be shown [5] that this requirement is fulfilled if we demand that the two\npoint function takes the following form which was first given in [6] and since then\nintensively studied (see [7] and the references therein):\n\u0012\n\u0013\n1\nu(x, y)\nΛ(x, y) = 2\n+ v(x, y) ln |σ(x, y)| + w(x, y) ,\n(7)\n4π\nσ(x, y)\nwhere σ(x, y) denotes the quadratic geodesic distance, and u, v, and w are some\nsmooth functions.\nA state whose two point function is of this form is called a Hadamard state. The\nfield equation and the commutation relations fix u and v, and the remaining freedom\nin the definition of a Hadamard state lies in the choice of the smooth function w.\nIn order to properly define a distribution, one has to modify (7) by an iǫprescription in the denominator. Also, since σ is not defined globally, one must\nspecify some neighbourhood in which (7) is supposed to hold, and it is also understood that no further singularities exist for spacelike separated points. To this end,\none demands the convergence of a series of distributions to Λ in a causal normal\nneighbourhood (which is basically a sufficiently small neighbourhood of a Cauchy\nsurface). Thereby the Hadamard condition becomes a global condition. Although\nthe choice of a Cauchy surface enters into the definition, it can be shown that the\nHadamard condition is independent of this choice. All these details were worked out\nin [8], but most of them are not essential for this work. What should be kept in\nmind is that the vacuum state on Minkowski spacetime is Hadamard, that Cauchy\nevolution respects the Hadamard singularity structure, and that two Hadamard distributions differ only by a smooth part.\nThe main lesson of this rather sketchy definition is that the Hadamard condition\nprescribes the singular short distance behaviour of the two point distribution, and it\nis obvious that it would be very useful to have at hand some powerful mathematical\nmethods to characterize this singularity structure.\n\n2.4\n\nThe free Dirac field\n\nWe will now briefly outline the construction of the free Dirac field on a curved\nspacetime. For details see [9].\n6\n\n\fJust like the Klein-Gordon equation, we can generalize the Dirac equation to a\nspinor bundle over an arbitrary curved spacetime by replacing the derivatives and the\nDirac matrices by their covariant counterparts. For a spinor field ψ ∈ Γ(M, DM)\nand a cospinor field ψ ∈ Γ(M, D ∗M) it reads\n6 ∇ψ = γ μ ∇μ ψ;\n6 ∇ψ = (∇μ ψ)γ μ .\n\n(−i6 ∇ + m)ψ = 0,\n(i6 ∇ + m)ψ = 0,\n\n(8)\n(9)\n\nHere, γ μ are the generalized Dirac matrices which satisfy the anticommutation relations\n{γ μ , γ ν } = 2g μν * 1.\n\n(10)\n\nIt can be shown that they form a covariant section γ ∈ Γ(M, T M ⊗ DM ⊗ D ∗M).\nLike in (10), we will always choose a local frame and suppress the spinor indices\nreferring to Dx M ⊗ Dx∗ M such that γ(x) is treated like a vector of 4 × 4 matrices.\nWe can then define matrices σ μν , γ 5 , γ μ γ 5 and 1 in the usual way, which together\nwith γ μ give a basis for DM ⊗ D ∗M. A further important property of γ is that it\nis covariantly constant: ∇γ = 0. For any covector field ξ ∈ Γ(M, T ∗M) we define 6 ξ\nas contraction with γ, 6 ξ ≡ ξμ γ μ .\nFor the quantization of the theory we again need propagators Sret and Sadv . For\nglobally hyperbolic spacetimes it can be shown that these propagators exist and are\nunique [9]. Their difference defines the anticommutator function S = Sret − Sadv .\nIn the quantized theory the spinor field operator now has to be smeared with a\nsmooth cospinor field of compact support in order to give an operator on the Hilbert\nspace,\nψ(v),\nψ(u),\n\nv ∈ Γ0 (M, D ∗M);\nu ∈ Γ0 (M, DM).\n\n(11)\n\nThe field operators are required to solve the Dirac equation and obey the canonical\nanticommutation relations,\n{ψ(v), ψ(u)} = iS(v, u).\n\n(12)\n\nAgain, quasi-free states are completely characterized by their two point distribution\nω + (x, y) =< Ω, ψ(x)ψ(y)Ω >\n\n(13)\n\nwhich is now a vector-valued distribution ω + ∈ D ′ (M × M, DM ⊠ D ∗M) taking\nvalues in the bispinor bundle DM ⊠ D ∗M. This denotes the outer tensor product:\nthe fibre over (x, y) ∈ M × M is Dx M ⊗ Dy∗ M, and the first factor in the tensor\n7\n\n\fproduct transforms like a spinor in the point x, while the second factor transforms\nlike a cospinor in y.\nIn the quantization procedure on Minkowski spacetime one often makes use of\nthe fact that the squared Dirac operator gives back the Klein-Gordon operator. On\na curved spacetime this is expressed by Lichnerowicz's identity:\n1\n(−i6 ∇ + m)(i6 ∇ + m)ψ = (\u0003 − R + m2 )ψ.\n4\n\n(14)\n\nHere, R is the curvature scalar, and \u0003 = g μν ∇μ ∇ν is the spinorial wave operator\nacting on sections of DM. Note that only the principal part of \u0003 gives the scalar\nwave operator, and in general it contains non-diagonal terms. Nevertheless, one\nobtains the propagators Si for the Dirac equation by applying the Dirac operator to\nthe propagators ∆i for this spinorial wave operator,\nSi = (i6 ∇ + m)∆i .\n\n(15)\n\nAnalogously, one demands that the two point function ω + can be extracted from an\nauxiliary two point function ω̃,\nω + (x, y) = (i6 ∇x + m) ω̃(x, y).\nThen ω̃ is a solution of the spinorial Klein-Gordon equation,\n\u0012\n\u0013\n1\n2\n\u0003x,y − R + m ω̃(x, y) = 0,\n4\n\n(16)\n\n(17)\n\nand in order to define Hadamard states for the Dirac field one can make the same\nansatz as in the scalar case,\n\u0012\n\u0013\n1\nũ\nω̃ = 2\n+ ṽ ln |σ| + w̃ ,\n(18)\n4π\nσ\nbut now ũ, ṽ, and w̃ are smooth bispinor-valued functions. The rigorous definition\nwas given by Köhler [10]. Again, the singular part of the two point function is fixed\nby geometry, and the freedom in the choice of a Hadamard state lies in the choice of\na smooth function w̃.\n\n3\n\nMicrolocal analysis\n\nLet us now introduce the mathematical tools we need to investigate the singularities\nof distributions. This theory of 'microlocal analysis' was developed by Hörmander\nand Duistermaat in the seventies for their analysis of partial differential equations,\nsee their original papers [11, 12] or the monographs [13, 14]. For physical applications\n8\n\n\fsee for example [15, 21]. It should be noted that similar tools where independently\ndeveloped by Bros and Iagolnitzer [16] in the context of analyticity properties of the\nS-matrix.\nThe generalization to vector-valued distributions and the definition of the polarization set was accomplished by Dencker in the eighties [17], but it seems that is has\nnot found its way into the physical literature yet.\n\n3.1\n\nScalar distributions – the wave front set\n\nAs test function space we will take D(X) = C0∞ (X), the space of infinitely differentiable functions on an open subset X ⊂ Rn , equipped with the usual topology. Its\ndual is the space of distributions, D ′ (X).\nThe roughest characterization of the singularities of a distribution u ∈ D ′(X) is\nthe singular support, sing supp u. It is the set of all points x ∈ X such that u does\nnot correspond to a smooth function in any neighbourhood of x.\nBut this definition can be very much refined. The following statements show that\nmuch information about the singularities is contained in the Fourier transform:\n1. If u is of compact support, then there exists a Fourier transform u\nb which\nfurthermore is a smooth function.\n2. A distribution u of compact support corresponds to a smooth function if and\nonly if u\nb decays faster than any power, that is if for every m ∈ N there is a\nconstant Cm ∈ R such that\n|b\nu(ξ)| ≤ Cm (1 + |ξ|)−m\n\n∀ξ ∈ Rn .\n\n(19)\n\nThus in order to investigate the singularities of a distribution u ∈ D ′ (X) locally\nc for test functions\nat the point x ∈ X, we are led to analyze the Fourier transform φu\n∞\nφ ∈ C0 (X) with φ(x) 6= 0 which cut off the singularities far away from x. Then\nc falls off rapidly in all directions.\nx ∈ sing supp u iff there is no φ such that φu\nThis immediately suggests two refinements of the singular support: we may ask\nc does not decay rapidly in all directions, which are those directions in\n• If φu\nFourier space which are responsible for the singularity?\nc does not fall off rapidly, how fast does it decay?\n• If φu\n\nThe first question leads directly to the notion of the wave front set, while the second\nquestion motivates the definition of local Sobolev spaces H s (x). In combination one\ncan define H s -wave front sets, but in the following we will only be interested in the\nC ∞ -case:\n9\n\n\fDefinition 1. Let u ∈ D ′ (X), X ⊂ Rn . A point (x, ξ) ∈ X × (Rn \\ {0}) is called\na regular directed point of u if there is a function φ ∈ C0∞ (X), not vanishing at x,\nsuch that for any m ∈ N there is a constant Cm ∈ R with\nc ′ )| ≤ Cm (1 + |ξ ′|)−m\n|φu(ξ\n\n(20)\n\nfor all ξ ′ in a conic neighbourhood Γ ⊂ Rn \\ {0} of ξ. (A neighbourhood Γ is called\nconic if with ξ ∈ Γ all points t * ξ, t ∈ R+ , are contained in Γ.)\nThe wave front set of u, denoted WF (u), is the complement in X × (Rn \\ {0}) of\nthe set of regular directed points of u.\nExample. The wave front set of the δ-distribution δ ∈ D ′ (Rn ) is\n\b\nWF (δ) = (0, ξ) | ξ ∈ Rn \\ {0} .\n\n(21)\n\nThis can directly be seen from its Fourier transform\n\nc\nφδ(ξ)\n= δ(e−i<ξ,*> φ) = φ(0)\n\n(22)\n\nwhich does not decay rapidly in any direction.\n\nOur second example shows that the wave front set does not always contain the\nwhole Fourier space for all points of the singular support:\nExample. The distribution u ∈ D ′(R), u(x) =\n\n1\n,\nx+iǫ\n\nhas got the wave front set\n\n\b\nWF (u) = (0, ξ) | ξ ∈ R+ \\ {0}\n\nwhich can be seen from its Fourier transform\n√\nu\nb(ξ) = −i 2πθ(ξ).\n\n(23)\n\n(24)\n\nWe will now collect some basic properties of the wave front set [11]:\n\nTheorem 1.\n\n1. WF (u) is a closed conic subset of X × (Rn \\ {0}).\n\n2. The wave front set is a refinement of the singular support:\nπ(WF (u)) = sing supp u.\n\n(25)\n\nIn particular, the wave front set of a smooth function is empty.\n3. For any partial differential (or more generally any pseudo-differential) operator\nP we have the pseudolocal property\nWF (P u) ⊆ WF (u).\n10\n\n(26)\n\n\f4. Let U, V ⊂ Rn , u ∈ D ′ (V ), and χ : U → V a diffeomorphism such that\nχ∗ u ∈ D ′ (U) is the distribution pulled back by χ: χ∗ u(f ) = u(f ◦ χ−1 ). Then\n\b\n\u0001\nWF (χ∗ u) = χ∗ WF (u) ≡ χ−1 (x), tχ′ (χ−1 (x))ξ | (x, ξ) ∈ WF (u) . (27)\nIn particular, under coordinate transformations the elements of the wave front\nset transform like covectors. Thus the wave front set can be defined for distributions on differentiable manifolds by gluing together wave front sets over the\ncoordinate patches, and for u ∈ D ′ (M) we have WF (u) ⊂ T ∗M \\ 0.\n\nThe wave front set can be defined in a second way which will be important\nfor the investigation of solutions of partial differential equations as well as for the\ngeneralization to vector-valued distributions. But first we need some notions from\nthe theory of partial differential operators (PDOs):\nA PDO A is a polynomial of partial derivatives, A = P (x, ∂). In momentum space\nit acts like multiplication by the same polynomial of momenta P (x, iξ) = σA (x, ξ)\nwhich is called the symbol of A. The leading order a(x, ξ) of σA is called the principal\nsymbol σP (A). The generalization to a manifold M via local charts is obvious, and\nit should be noted that the principal symbol is then a well-defined function on T ∗M.\nUsually this is generalized to pseudo-differential operators (ΨDOs), where\nσA (x, ξ) may be a more general but still well-behaved function, not necessarily a\npolynomial (for details see [14]). In this work we will only deal with classical ΨDOs\nwhose symbol is an asymptotic sum of homogeneous terms. The set of classical\nΨDOs on M of order m will be denoted Lm (M).\nThe characteristic set of a ΨDO A ∈ Lm (M) with principal symbol a = σP (A)\nis defined as\n\b\nchar(A) = (x, ξ) ∈ T ∗M \\ 0 | a(x, ξ) = 0\n(28)\nand can be interpreted as the set of all directions ξ suppressed by A to leading order,\nat a point x.\nNow the following theorem makes precise the intuitive statement that the singular directions of a distribution (which make up the wave front set) are just those\ndirections that have to be suppressed to leading order by any operator that maps\nthe distribution to a smooth function.\nTheorem 2. For the wave front set of a distribution u ∈ D ′ (M) we have\n\\\nWF (u) =\nchar(A),\n\n(29)\n\nAu∈C ∞ (M)\n\nwhere the intersection is taken over all pseudo-differential operators A ∈ L0 (M) with\nAu ∈ C ∞ (M).\n11\n\n\fThis property of the wave front set is particularly useful if we know such an\noperator A with Au ∈ C ∞ , especially if u is a solution of a partial differential equation.\nThe first part of the following theorem is then obvious, but for certain operators one\ncan make an even stronger statement which goes under the name 'propagation of\nsingularities theorem' and was first proved by Duistermaat and Hörmander [12]:\nTheorem 3. Let P ∈ Lm (M) be a ΨDO on M with principal symbol p. If u ∈\nD ′ (M) such that P u ∈ C ∞ (M), then\nWF (u) ⊂ char(P ).\n\n(30)\n\nIf furthermore P is of real principal type, then WF (u) is invariant under the flow\ngenerated by the Hamiltonian vector field of p.\nHere we have imposed a natural restriction on P in order to obtain a real Hamiltonian and a non-degenerate Hamiltonian flow:\nDefinition 2. A pseudo-differential operator P ∈ Lm (M) is said to be of real principal type if its principal symbol p(x, ξ) is real and for p = 0 the Hamiltonian vector\nfield Hp ,\nX\nX\n(31)\n∂xμ p(x, ξ)∂ξμ ,\nHp (x, ξ) =\n∂ξμ p(x, ξ)∂xμ −\nμ\n\nμ\n\n∂p ∂\ndoes not vanish nor does it have the radial direction, that is Hp 6= − ∂x\nμ ∂ξ .\nμ\n\nThus the wave front set of a distribution u with P u = 0 is made up of integral\ncurves of Hp in char(P ) which are also called the null bicharacteristics of P . Their\nprojections onto M are called the bicharacteristic curves of P and constitute the\nsingular support of u.\nTo illustrate this theorem, let us take a look at a physical example, the wave\noperator on a curved spacetime:\nExample. Let (M, g) be a spacetime, f, b ∈ C ∞ (M), such that 0 6= f (x) ∈ R ∀x ∈\nM, and a ∈ Γ(M, T M). The operator\nP = f \u0003 + aμ ∇μ + b,\n\n\u0003 = g μν ∇μ ∇ν ,\n\n(32)\n\nhas got the principal symbol p(x, ξ) = −f (x)g μν (x)ξμ ξν = −f * ξ 2 . Hence, P is of\nreal principal type.\nFor (x, ξ) ∈ char(P ) we see that the covector ξ has to be lightlike. Furthermore,\nfor ξ 2 = 0 the function p(x, ξ) = −ξ 2 is a well-known Hamiltonian that generates\nthe null geodesics which is not affected by the nonvanishing factor f . Therefore the\nbicharacteristic curves of P are null geodesics x(τ ).\n12\n\n\fFrom Hamilton's equations we obtain\ndp(x, ξ)\ndxμ\n= −2f (x(τ ))g μν ξν\n=\ndτ\ndξμ\n\n(33)\n\nwhich means that ξ is tangent to the geodesic. By reparameterization of the geodesic\none can achieve ξ(τ ) = dx\n(τ ) for all values of the curve parameter τ . The factor,\ndτ\nhowever, is irrelevant in what follows since the wave front set is conic in ξ.\nThus the null bicharacteristics of P are curves (x, ξ)(τ ) ∈ T ∗M \\ 0 such that x(τ )\ndescribes a lightlike geodesic and ξ(τ ) is tangent to x(τ ) for all values of τ .\nApplying theorem 3, we conclude that the singular support of a distribution u\nwhich solves the wave equation, i.e. P u = 0, is a union of null geodesics, while the\nwave front set additionally indicates the covectors tangent to the geodesics in the\nsingular support. Note that the geodesics are directed and that the wave front set\nmay contain only the future or past directed covectors.\nIf we take light rays as distributional solutions of the wave equation, this result can\nbe interpreted as the well-known fact that light propagates along lightlike geodesics.\n\n3.2\n\nVector-valued distributions – the polarization set\n\nWe will now go over to vector-valued distributions u ∈ D ′ (M, CN ), i.e. vectors\nu = (ui )i=1...N of distributions ui ∈ D ′ (M). This section is mainly a review of [17].\nThe wave front set of a vector-valued distribution u = (ui ) ∈ D ′ (M, CN ) is just\ndefined as the union of the wave front sets of all its components:\nWF (u) =\n\nN\n[\n\nWF (ui ).\n\n(34)\n\ni=1\n\nBecause of theorem 2, this is nothing but\nWF (u) =\n\nN\n[\n\ni=1 Aui\n\n\\\n\nchar(A).\n\n(35)\n\n∈C ∞ (M)\n\nThe wave front set does not contain any information about the components of\nthe distribution that are singular. In order to specify the singular directions in the\nvector space CN , one could consider vector-valued operators that map the vectorvalued distribution to a smooth scalar function, instead of just looking at scalar\noperators mapping the individual components to smooth functions. This approach\nleads to the definition of the polarization set:\nDefinition 3. The polarization set of a distribution u ∈ D ′ (M, CN ) is defined as\n\\\nWFpol (u) =\nNA ,\n(36)\nAu∈C ∞ (M)\n\n13\n\n\f\b\nNA = (x, ξ; w) ∈ (T ∗M \\ 0) × CN | w ∈ ker a(x, ξ) ,\n\n(37)\n\nwhere the intersection is taken over all 1×N systems A ∈ L0 (M)N of classical ΨDOs\nwith principal symbol a, and ker a(x, ξ) is the kernel of the matrix a(x, ξ).\nObviously, (T ∗M \\ 0) × {0} ⊂ WFpol (u) for any u ∈ D ′ (M, CN ). Furthermore,\nthe polarization set is closed, linear in the fibre and conic in the ξ-variable.\nFor scalar distributions (N = 1) the polarization set contains the same information as the wave front set. For arbitrary N, we get back the wave front set by\nprojecting the nontrivial points onto the cotangent bundle:\nTheorem 4. Let u ∈ D ′ (M, CN ) and π1,2 : T ∗M × CN → T ∗M be the projection\nonto the cotangent bundle: π1,2 (x, ξ; w) = (x, ξ). Then\nπ1,2 (WFpol (u) \\ (T ∗M × {0})) = WF (u).\n\n(38)\n\nIn this way the polarization set is a refinement of the wave front set. In addition,\nit contains information about the directions in the additional vector space in which\nthe distribution is singular.\nExample. Let u = (u1, u2 ) ∈ D ′ (M, C2) and (y, η) ∈\n/ WF (u1). Then\n\b\nWFpol (u) ⊆ (x, ξ; (0, z)) ∈ (T ∗M \\ 0) × C2 , z ∈ C\n\n(39)\n\nover a conic neighbourhood of (y, η).\n\nThe polarization set indicates only the most singular directions, even if the projection of the distribution on other directions is also singular, as the following example\nshows:\nExample. Let u = (v, ∆v) ∈ D ′ (Rn , C2 ), where v ∈ D ′ (Rn ) and ∆ is the Laplacian\non Rn . Then\n\b\nWFpol (u) ⊆ (x, ξ; (0, z)) ∈ (T ∗ Rn \\ 0) × C2 , z ∈ C ,\n(40)\n\nbecause ∆u1 − u2 = 0 and ker σP (∆, −1)(x, ξ) = ker(−ξ 2 , 0) = {(0, z), z ∈ C}.\n\nOur third example shows that the direction of the strongest singularities in CN\ncan depend on the singular direction in the cotangent bundle:\n\u0001\nExample. Let u = ∇δ (2) = ∂x1 δ (2) , ∂x2 δ (2) ∈ D ′ (R2 , C2 ). Then\n\b\nWFpol (u) ⊆ (0, ξ; λ * ξ) ∈ (T ∗ R2 \\ 0) × C2 , λ ∈ C ,\n(41)\nsince u solves the equation (−∂x2 , ∂x1 ) * u = 0, and ker(−iξ2 , iξ1 ) = C * (ξ1 , ξ2) for\nξ 6= 0.\n\nThe polarization set has got an interesting transformation property under the\naction of a system of partial differential operators:\n14\n\n\fTheorem 5. Let A be an M × N system of pseudo-differential operators on M with\nprincipal symbol a(x, ξ), and u ∈ D ′ (M, CN ). Then\na(WFpol (u)) ⊆ WFpol (Au),\n\n(42)\n\nwhere a acts on the fibre: a(x, ξ; w) = (x, ξ; a(x, ξ)w).\nIf E is an N × N system of pseudo-differential operators on M and its principal\nsymbol e(x, ξ) is not characteristic at (y, η) ∈ T ∗M \\ 0, i.e. det e(y, η) 6= 0, then\ne(WFpol (u)) = WFpol (Eu)\n\n(43)\n\nover a conic neighbourhood of (y, η).\nNote the different order of the inclusion in (42) compared to (26). Since the polarization set only indicates the most singular directions, the projection on orthogonal\ndirections can change the polarization set substantially.\nFrom (43) we learn that the polarization set behaves covariantly under a change\nof basis in the vector space CN . Thus the polarization set of a distribution u ∈\nD ′ (M, E) taking values in a vector bundle E → M can be defined by gluing together the polarization sets of local trivializations. This gives a well-defined subset\nWFpol (u) ⊂ π ∗ E of the vector bundle E lifted over the cotangent bundle.\nLike in the scalar case, we are interested in the propagation of singularities for a\nsolution of a system of partial differential equations. Again it turns out that there\nis a powerful theorem for a restricted class of operators.\nDefinition 4. An N × N system P of pseudo-differential operators on M with\nprincipal symbol p(x, ξ) is said to be of real principal type at (y, η) ∈ T ∗M \\ 0 if\nthere is an N × N symbol p̃(x, ξ) such that\np̃(x, ξ)p(x, ξ) = q(x, ξ) * 1\n\n(44)\n\nin a neighbourhood of (y, η), with a scalar symbol q(x, ξ) of real principal type. We\nsay that P is of real principal type in O ⊆ T ∗M \\ 0 if it is at all points (y, η) ∈ O.\nThe choice of p̃ and q is not unique, but it can be shown that the only freedom\nis the multiplication by a smooth non-vanishing function on T ∗M \\ 0.\nFrom now on let P be an N × N system of classical pseudo-differential operators\nP of real principal type of order m, u a solution of P u = 0, and locally p̃(x, ξ) and\nq(x, ξ) are chosen as above such that\np̃p = q * 1.\n\n(45)\n\n\b\nΩP = (x, ξ) ∈ T ∗M \\ 0 | det p(x, ξ) = 0 .\n\n(46)\n\nWe define the set\n\n15\n\n\fBecause of (45), we have ΩP = q −1 (0) locally. If P u ∈ C ∞ , for the existence of\nnontrivial elements (x, ξ; w) ∈ NP in the polarization set over a point (x, ξ), by\ndefinition it is necessary that w ∈ ker p(x, ξ), that is, ker p(x, ξ) 6= {0}. This means\nthat (x, ξ) and thus the whole set WF (u) has to be a subset of ΩP .\nIt can now easily be shown that the wave front set is a union of null bicharacteristics of q in ΩP . Though the bicharacteristics are not independent of the choice\nof q, we will just call them the bicharacteristics in ΩP without referring to a special\nchoice of q. A different choice of q only leads to a multiplication of the ξ-variable by\na scalar factor which is irrelevant since the wave front set is conic in ξ. In fact, in\ngeneral it is not even possible to choose q globally, and several coordinate patches\nmust be glued together anyhow.\nOnce we know the wave front set of the distribution u, the remaining task is to\ncalculate the polarization vectors over the points in the wave front set. It turns out\nthat these vectors follow a simple parallel transport law along the bicharacteristics\nthat form the wave front set.\nThis parallel transport, which we will introduce in a second, does not only depend\non the principal symbol as in the scalar case, but also the subprincipal symbol\ncontributes. The symbol of P is a sum of homogeneous terms,\nσ(P )(x, ξ) = p(x, ξ) + pm−1 (x, ξ) + pm−2 (x, ξ) + . . . ,\n\n(47)\n\nwhere p = σP (P ) is the principal symbol, and pj is homogeneous of order j. The\nsubprincipal symbol is now defined as\nps (x, ξ) = pm−1 (x, ξ) −\n\n1 X ∂ 2 p(x, ξ)\n.\n2i μ ∂xμ ∂ξμ\n\n(48)\n\nFurthermore let\n{p̃, p} =\n\nX ∂ p̃(x, ξ) ∂p(x, ξ)\nμ\n\n∂ξμ\n\n∂xμ\n\n−\n\nX ∂ p̃(x, ξ) ∂p(x, ξ)\nμ\n\n∂xμ\n\n∂ξμ\n\n(49)\n\nbe the Poisson bracket and\n\u0013\nX \u0012 ∂q(x, ξ) ∂\n∂q(x, ξ) ∂\nHq (x, ξ) =\n−\n∂ξμ ∂xμ\n∂xμ ∂ξμ\nμ\n\n(50)\n\nthe Hamiltonian vector field of q.\nDefinition 5. For a smooth section w of the vector bundle (T ∗M \\ 0) × CN , we\ndefine Dencker's connection as\n1\nDP w = Hq w + {p̃, p}w + ip̃ps w.\n2\n16\n\n(51)\n\n\fThis is a partial connection along the bicharacteristics in ΩP , that is a connection\non all CN -vector bundles over these bicharacteristics. Furthermore, it can be shown\nthat (51) defines a partial connection in NP , this means that for every vector field w\nalong a bicharacteristic γ in ΩP we have DP w ∈ ker p along γ if and only if w ∈ ker p\nalong γ. The equation DP w = 0 can then be solved with (x, ξ; w) ∈ NP , which is a\nnecessary condition for elements of the polarization set.\nAgain, the definition of the connection depends on the choice of p̃ and q, but it\ncan be shown that a different choice changes a solution of the equation DP w = 0 in\nNP only by a scalar factor. Therefore, we define a Hamilton orbit of a system P of\nreal principal type as a line bundle L ⊆ NP |γ over a bicharacteristic γ in ΩP which\nis spanned by a section w satisfying the equation DP w = 0, i.e., that is parallel with\nrespect to Dencker's connection. These Hamilton orbits are then independent of the\nchoice of p̃.\nNow we are prepared to state the main result of [17], the theorem on the propagation of singularities for vector-valued distributions:\nTheorem 6. Let P be an N × N system of classical pseudo-differential operators\nover a manifold M, and u ∈ D ′ (M, CN ). Furthermore, let P be of real principal\ntype at (y, η) ∈ ΩP , and (y, η) ∈\n/ WF (P u). Then, over a neighbourhood of (y, η) in\nΩP , WFpol (u) is a union of Hamilton orbits of P .\nThough it is not obvious from the definition (51), in interesting cases Dencker's\nconnection takes on a very simple form. We will illustrate this by a physical example\nthat was already discussed by Radzikowski [18] in a slightly modified way.\nExample. We investigate Maxwell's equations on a spacetime (M, g). For a vector\nfield A ∈ Γ(M, T M) in Lorentz gauge (∇μ Aμ = 0), in a local coordinate frame they\nread\n\u0003g Aν − Rν μ Aμ = 0,\n\n\u0003g = g ρσ ∇ρ ∇σ .\n\n(52)\n\nWe want to calculate Dencker's connection for the operator\nP ν μ = \u0003g ν μ − Rν μ = g ρσ (δμν ∂ρ ∂σ + Γν ρμ ∂σ − δμν Γλ ρσ ∂λ + Γν σμ ∂ρ ) + . . . ,\n\n(53)\n\nwhere the dots stand for lower order terms that do not contribute to Dencker's\nconnection.\nThe principal symbol of P is\np(x, ξ)ν μ = −g ρσ (x)ξρ ξσ δμν ,\n\n(54)\n\nso that we can choose\np̃λ ν =\n\n√\n\n−gδνλ ,\n\n√\nq(x, ξ) = − −gg ρσ ξρ ξσ\n17\n\n(55)\n\n\f√\nto get p̃p = q*1. The factor −g is introduced for no obvious reason, but it turns out\nthat it simplifies the calculation. We see that q is a scalar symbol of real principal\ntype, therefore P is of real principal type.\nThe bicharacteristic curves of q are again the null geodesics, and the space ΩP =\nq −1 (0) consists of all lightlike vectors in T ∗M \\ 0. Since p ∝ 1, the space ker p(x, ξ)\non which Dencker's connection acts is the whole tangent space.\nPutting together the different terms in (51) and using well-known identities for\nthe Christoffel symbols and Hamilton's equations, we arrive at\n\u0013ν\n\u0012\n1\ns\nν\n(DP w) =\nHq w + {p̃, p}w + ip̃p w\n2\nν\ndw\n=\n+ Γν ρμ ẋρ w μ\ndτ\n= ((π ∗ ∇τ )w)ν ,\n(56)\nfor a vector field w(x(τ ), ξ(τ )) along the null bicharacteristics. That is, Dencker's\nconnection for P (with respect to our choice of p̃) is just the usual Levi-Civitá connection, lifted over the cotangent bundle and restricted to the bicharacteristics. Thus\na vector field over one of the bicharacteristics is parallel with respect to Dencker's\nconnection (and thereby generates a Hamilton orbit) iff the projected vector field\nover the characteristic curve is parallel with respect to the Levi-Civitá connection.\nThus, following the theorem on the propagation of singularities, the polarization\nset of a solution of Maxwell's equations is a union of such Hamilton orbits, that is it\nconsists of curves (x, ξ; w)(τ ) ∈ π ∗ T M such that\n• x(τ ) describes a null geodesic,\n• ξ(τ ) is tangent to the geodesic and\n• w(τ ) is parallel transported along the geodesic.\nIn physical language, we have reproduced the well-known result on the propagation of light in a curved spacetime: light travels along lightlike geodesics, while the\npolarization vector is parallel transported along the path.\nIn particular this means that spacetime curvature cannot lead to double refraction\nwhich is only possible if matter effects are introduced into Maxwell's equations.\nDouble refraction may then occur at points where the operator P is no longer of real\nprincipal type. This was also investigated by Dencker [19].\n\n4\n\nSingularity structure of the two point function\n\nWe are now going to investigate the singularity structure of the two point function\nof Hadamard states using the microlocal techniques that were introduced in the\nprevious section.\n18\n\n\fThe wave front set of a scalar Hadamard distribution was first calculated by\nRadzikowski [20]. After we have reviewed his results, we will derive an analogous\nresult for the wave front set of the two point function of the free Dirac field and\nfurthermore calculate its polarization set.\n\n4.1\n\nKlein-Gordon field\n\nLet us first state the main result by Radzikowski [20]:\nTheorem 7. A quasi-free state of the Klein-Gordon field on a globally hyperbolic\nspacetime M is a Hadamard state if and only if its two point distribution Λ has got\nthe following wave front set:\n\b\n+\n(57)\nWF (Λ) = (x, y; ξ, −η) ∈ T ∗(M × M) \\ 0 | (x, ξ) ∼ (y, η), ξ ∈ V x .\n\nThe equivalence relation (x, ξ) ∼ (y, η) means that there is a lightlike geodesic γ\nconnecting x and y, such that at the point x the covector ξ is tangent to γ and η is\nthe vector parallel transported along the curve γ at y which is again tangent to γ.\nOn the diagonal (x, ξ) ∼ (x, η) if ξ is lightlike and ξ = η.\n\nThus the two point distribution of a Hadamard state is singular only for pairs\nof points that can be connected by a lightlike geodesic. In addition, the condition\n+\nξ ∈ V x expresses the fact that only positive frequencies contribute and can be viewed\nas the microlocal remnant of the spectrum condition. The obvious advantage of our\nformalism from microlocal analysis is that the spectrum condition (for the free scalar\nfield) is now formulated also for curved spacetimes.\nThis microlocal characterization of the Hadamard condition opens the door for\nfurther investigations of Hadamard states using the powerful tools from microlocal\nanalysis. As a first example, in [21] it was shown that certain states that were known\nlong before, the ground- and KMS-states on static spacetimes and adiabatic states\nof infinite order on Robertson-Walker spacetimes, are indeed Hadamard states.\nWe will now briefly review Köhler's proof [10] that the two point function of\na Hadamard state has got the given wave front set, since it will lead us in the\ngeneralization to the Dirac field.\nFirst we take a look at the two point function on flat spacetime:\nTheorem 8. On Minkowski spacetime the two point function of the free KleinGordon field in the vacuum state has got the wave front set\n\b\nWF (Λ) = (x, y; ξ, −ξ) ∈ T ∗ (R1,3 × R1,3 ) | x 6= y, (x − y)2 = 0,\nξ||(x − y), ξ0 > 0\n\b\n∗\n1,3\n1,3\n∪ (x, x; ξ, −ξ) ∈ T (R × R ) | ξ 2 = 0, ξ0 > 0 ,\n(58)\n\ni.e. it is of the form (57).\n\n19\n\n\fA complete proof can be found in [15], or the wave front set can be read off from\nthe well-known Fourier transform\nb η) = (2π)−1 δ(ξ + η)θ(ξ0 )δ(ξ 2 − m2 ).\nΛ(ξ,\n\n(59)\n\nThe extension of this theorem to arbitrary spacetimes is done by deforming the\nspacetime such that the metric is flat in one part of the spacetime. The known singularity structure in the flat part can then be shifted to the curved part by applying\nHörmander's theorem on the propagation of singularities.\nThe proof makes use of the following theorem which was proved in [10] based on\nideas from [22]:\nTheorem 9. Let (M, g) be a globally hyperbolic spacetime and x a point on a Cauchy\nsurface Σ ⊂ M. Then there is a neighbourhood U of x and a globally hyperbolic\nspacetime (M̃, g̃) with the following properties:\n1. A causal normal neighbourhood N of Σ with U ⊂ N is isometric to a neighbourhood Ñ in M̃, and the isometry ρ : N → Ñ maps Σ to a Cauchy surface\nΣ̃ ⊂ Ñ .\n2. There is a spacelike hypersurface Σ̂ together with a neighbourhood Û in M̃ such\nthat g̃, restricted to Û, is the Minkowski metric and ρ(U) ≡ Ũ ⊂ D(Σ̂).\nThe two point function Λ which is given on the neighbourhood N of the Cauchy\nsurface Σ and thereby also on Ñ = ρ(N ) now induces a Hadamard two point distribution Λ̃ on the whole deformed spacetime M̃ such that Λ|N ×N = ρ∗ (Λ̃|Ñ ×Ñ ).\nIn the flat part of M̃ we already know the wave front set of the distribution Λ̃.\nSince only local properties of the spacetime in a neighbourhood of a Cauchy surface\nenter into the Hadamard condition and the metric on Û is flat, on Û × Û we have\nbecause of theorem 8:\n+\n\nˆ ∼ (ŷ, η̂), ξ̂ ∈ V .\n(x̂, ŷ; ξ̂, −η̂) ∈ WF (Λ̃|Û×Û ) ⇔ (x̂, ξ)\nx̂\n\n(60)\n\nΛ̃ solves the Klein-Gordon equation in the second variable, therefore we can apply\ntheorem 3 on the propagation of singularities for the operator 1 ⊗ (\u0003 + m2 ) to get\nthe singular directions of Λ̃ for points in Û × Ũ . From our investigation of the wave\noperator in the previous section, we learned that two points (x, ξ) and (y, η) lie on\nthe same null bicharacteristic for the operator \u0003 + m2 iff (x, ξ) ∼ (y, η). Because of\nŨ ⊂ D(Û), every null geodesic through Ũ intersects Û, and theorem 3 tells us that\nˆ −η̂) ∈ WF (Λ̃|\n(x̂, y; ξ̂, −η) ∈ WF (Λ̃|Û×Ũ ) ⇔ (x̂, ŷ; ξ,\nÛ ×Û ), (y, η) ∼ (ŷ, η̂)\n+\nˆ ξ̂ ∈ V .\n⇔ (y, η) ∼ (x̂, ξ),\n(61)\nx̂\n20\n\n\fThe same argument for the operator (\u0003 + m2 ) ⊗ 1 gives us the wave front set for\npoints in Ũ × Ũ :\nˆ (y, η) ∼ (x̂, ξ),\nˆ ξˆ ∈ V + ,\n(x, y; ξ, −η) ∈ WF (Λ̃|Ũ×Ũ ) ⇔ (x, ξ) ∼ (x̂, ξ),\nx̂\n\n(62)\n\nand therefore\n\n\b\n+\nWF (Λ̃|Ũ ×Ũ ) = (x, y; ξ, −η) ∈ T ∗ (Ũ × Ũ ) \\ 0 | (x, ξ) ∼ (y, η), ξ ∈ V x .\n\n(63)\n\nNow Λ is the distribution pulled back by the isometry ρ, and because of theorem 1.4 also the wave front set of Λ in U × U is of this form.\nUsing the same line of arguments again in the undeformed spacetime M, we\nfinally obtain the wave front set of Λ for arbitrary pairs of points (x, y) ∈ M × M:\n\b\n+\nWF (Λ) = (x, y; ξ, −η) ∈ T ∗(M × M) \\ 0 | (x, ξ) ∼ (y, η), ξ ∈ V x ,\n(64)\n\nand we have finished the proof.\n\n4.2\n\nDirac field\n\nLet us now turn to Hadamard states of the free Dirac field. We first state our main\nresult:\nTheorem 10. Let ω be a Hadamard state of the free Dirac field on a globally hyperbolic spacetime M. Then its two point function ω + has got the following wave front\nand polarization sets:\n\b\n+\nWF (ω + ) = (x, y; ξ, −η) ∈ T ∗(M × M) \\ 0 | (x, ξ) ∼ (y, η), ξ ∈ V x , (65)\nWFpol (ω + ) =\n\n\b\n(x, y; ξ, η; w) ∈ π ∗ (DM ⊠ D ∗M) |\n(x, y; ξ, η) ∈ WF (ω + ); (1 ⊗ Jγ (x, y))w = λ * 6 ξ, λ ∈ C .\n\n(66)\n\nHere, Jγ (x, y) : Dy∗ M → Dx∗ M denotes the parallel transport in D ∗M along the\ngeodesic γ connecting x and y, such that ξ is tangent to γ in the point x.\nThe proof is similar to that for the scalar case: We will first calculate the polarization set on Minkowski spacetime and afterwards shift the result to our spacetime\nM by making use of Dencker's theorem on the propagation of singularities.\n\nTheorem 11. The two point function ω + of a Hadamard state of the free Dirac field\non Minkowski spacetime M = R1,3 is (up to a smooth part) of the form\nω + = [(i6 ∂ + m) ⊗ 1] (Λ * 1),\n\n(67)\n\nwhere Λ is the two point function of a Hadamard state of the free Klein-Gordon field.\nIts polarization set is\nWFpol (ω + ) =\n\b\n(x, y; ξ, η; λ *6 ξ) ∈ π ∗ (DM ⊠ D ∗M) | (x, y; ξ, η) ∈ WF (Λ), λ ∈ C .\n21\n\n(68)\n\n\fProof. The bundle DM ⊠ D ∗M over Minkowski spacetime M = R1,3 is the trivial\nbundle (M × M) × C4×4 . Thus we can simplify our notation by identifying the\nspinor spaces over all points. Also, the covariant derivative coincides with the partial\nderivative of the individual components, and the curvature scalar vanishes. Therefore\nthe functions ũ and ṽ in the definition (18) of a Hadamard distribution have the\nform ũ = u * 1, ṽ = v * 1 with the corresponding scalar functions u and v. That\nis, the auxiliary two point function of any Hadamard state of the free Dirac field on\nMinkowski spacetime is (up to a smooth part) a multiple of the unit matrix, and the\nnonvanishing components are two point functions of scalar Hadamard states. Since\nthese are fixed up to a smooth part, the auxiliary two point function is of the form\nω̃ = Λ * 1 with a scalar Hadamard distribution Λ (up to a smooth part), and we have\nω + = [(i6 ∂ + m) ⊗ 1](Λ * 1).\n\n(69)\n\nFrom theorem 7 we know that the wave front set of Λ * 1 has the form (57), and\nits polarization set is obviously\n\b\nWFpol (Λ * 1) = (x, y; ξ, η; λ * 1) | (x, y; ξ, η) ∈ WF (Λ), λ ∈ C .\n(70)\nWe obtain ω + from Λ * 1 by application of the operator\nA = [(i6 ∂ + m) ⊗ 1]\n\n(71)\n\nwith principal symbol a(x, y; ξ, η) = −6 ξ ⊗ 1. Following theorem 1, this does not enlarge the wave front set. In addition, from theorem 5 we have the following restriction\non the polarization set of ω + = A(Λ * 1):\n\b\nWFpol (ω + ) ⊇ (x, y; ξ, η; a(x, y; ξ, η)w) | (x, y; ξ, η; w) ∈ WFpol (Λ * 1)\n\b\n= (x, y; ξ, η; λ *6 ξ) | (x, y; ξ, η) ∈ WF (Λ), λ ∈ C .\n(72)\nNow 6 ξ 6= 0 if (x, y; ξ, η) ∈ WF (Λ), and since the projection of the nontrivial part of\nthe polarization set onto the cotangent bundle gives back the wave front set, we see\nthat by the action of A the wave front set does not become smaller. Thus ω + has\ngot the same wave front set as the scalar Hadamard distribution Λ.\nThe equality for the polarization set in (72), however, does not follow from theorem 5, since the operator A is characteristic just in the interesting points: we have\ndet a(x, y; ξ, η) = −(ξ 2 )2 = 0 for (x, y; ξ, η) ∈ WF (Λ).\nInstead, we can give a direct calculation of the polarization vectors w over a point\n(x, y; ξ, η) in the wave front set. Because of (69), such vectors have to be a linear\ncombination of the unit and gamma matrices, and we can set w = α1 + βν γ ν .\nBy definition, if a is the principal symbol of an operator A with Aω + = 0, a point\n(x, y; ξ, η; w) can only be contained in the polarization set of ω + if a(x, y; ξ, η)w = 0.\n\n22\n\n\fWe know such an operator, since the two point distribution is a solution of the Dirac\nequation\n(−i6 ∂ x + m)ω + (x, y) = 0,\n\n(73)\n\nand we obtain\n0 = 6 ξ * w = ξμ γ μ (α1 + βν γ ν ) = αξμ γ μ + ξμ β μ 1 − i\n\nX\nμ>ν\n\n(ξμ βν − ξν βμ )σ μν ,\n\n(74)\n\nwhere σ μν = 2i [γ μ , γ ν ]. Hence, since ξ 6= 0, we must have α = 0 and β = λ * ξ with\nλ ∈ C. This means that the polarization vectors over points (x, y; ξ, η) ∈ WF (ω + )\nare indeed only the vectors of the form w = λ *6 ξ.\nThis completes the proof.\nWe are now going to give a generalization to arbitrary globally hyperbolic spacetimes by using Dencker's theorem on the propagation of singularities of vector-valued\ndistributions. First we calculate Dencker's connection for the Dirac equation:\nTheorem 12. Dencker's connection DP for the Dirac operator P = (−i6 ∇ + m)\nacting on the Dirac bundle DM over an arbitrary spacetime M can be chosen to\ncoincide with the spin connection lifted to π ∗ DM and restricted to the null geodesics.\nThe analogous statement holds for the Dirac operator on the dual bundle. In particular, the connection is independent of the mass m.\nProof. A first (rather involved) proof for the Dirac equation for spinor half densities\nwas given by Radzikowski [18]. Here we give a simple proof that holds for the Dirac\nequation on DM.\nOnce we haven chosen coordinate frames for the tangent and cotangent bundle,\nthe operator\n−i6 ∇ + m = −iγ μ (∂μ + σμ ) + m1\n\n(75)\n\nhas principal and subprincipal symbols\np(x, ξ) = ξμ γ μ (x),\n\nps (x, ξ) = −iγ μ (x)σμ (x) + m1 −\n\n1\n∂μ γ μ (x).\n2i\n\n(76)\n\nWe choose\np̃(x, ξ) =\nand see that p̃p =\nteristic curves of q\nfields w along the\n(x, ξ), that is they\n\np\n\n−g(x)ξμ γ μ (x),\n\nq(x, ξ) =\n\np\n\n−g(x)g μν (x)ξμ ξν ,\n\n(77)\n\nq * 1, thereby the operator is of real principal type. The characare again the null geodesics. Dencker's connection acts on spinor\nbicharacteristics that lie in the kernel of p(x, ξ) for every point\nsatisfy 6 ξw(x, ξ) = 0.\n23\n\n\fPutting together the different terms in Dencker's connection and using 6 ξw = 0,\nHamilton's equations and the properties of the Christoffel symbols and the Dirac\nmatrices, yields\n1\nDP w = Hq w + {p̃, p} + ip̃ps\n2\n\u0013\n\u0012\n1\n1\n1 μ\ndw √\nν\nν\nμ\nν μ\n+ −gξν\nγ (∂μ γ ) − (∂μ γ )γ − (∂μ g)γ γ w\n=\ndτ\n2\n2\n4g\n\u0013\n\u0012\n√\n1\n+ −gξν γ ν γ μ σμ + imγ ν − γ ν (∂μ γ μ ) w\n2\n\u0012\n\u0013\nd\n=\n+ ẋμ σμ w = (π ∗ ∇τ )w,\ndτ\n\n(78)\n\nwhich is just the covariant derivative of w (as a vector field along the geodesic) along\nthe geodesic line with respect to the spin connection.\nThe proof for the adjoint operator is done in the same way.\nThe proof of theorem 10 now proceeds like in the scalar case. The spacetime is\ndeformed such that one part Û carries the Minkowski metric. By the isometry ρ, the\nundeformed part of the deformed spacetime inherits a spin structure which can be\nextended to the whole spacetime, since in the globally hyperbolic case all spin structures are trivial bundles. Because the metric stays unchanged in a neighbourhood of\na Cauchy surface, the two point function of the Hadamard state on the undeformed\nspacetime induces a Hadamard two point function on the whole deformed spacetime.\nThe polarization set in the flat part Û was calculated above. On the diagonal we\nhave\n+ 2\nˆ\nˆ η̂; w) ∈ WFpol (ω + |\nˆ\nˆ\n(x̂, x̂; ξ,\nÛ×Û ) ⇔ −η̂ = ξ ∈ V x̂ , ξ = 0; w = λ * 6 ξ, λ ∈ C.\n\n(79)\n\nIn order to calculate the polarization vectors w over a point (x, x) ∈ Ũ × Ũ in the\ncurved part of the spacetime, we make use of the fact that the two point distribution\nsolves the equation\n\u0001\nP ω + = (−i6 ∇ + m) ⊗ 1 + 1 ⊗ (i6 ∇ + m) ω + = 0.\n(80)\n\nThe curves (x, x; ξ, −ξ)(τ ) such that x(τ ) is a null geodesic and ξ(τ ) is tangent to\nthe curve x(τ ) for any τ are null bicharacteristics of this operator. As a corollary to\ntheorem 12, one can easily see that Dencker's connection for P is DP = π ∗ (∇τ ⊗ ∇τ )\nalong these curves.\nAccording to theorem 6, the polarization set of ω + consists of Hamilton orbits for\nthe operator P . These are sections w of the bundle π ∗ (DM ⊠ D ∗M) along the null\nbicharacteristics that are parallel with respect to the connection DP . In our case,\nfor the bicharacteristics (x, x, ξ, −ξ) this just means that the polarization vectors\n24\n\n\fw = λ * 6 ξ are parallel transported along the geodesic curves (x, x)(τ ). Now we have\n∇ * 6 ξ = 0 along the geodesics, since ξ is covariantly constant (the tangent vector of a\ngeodesic is parallel transported along the curve) as well as the Dirac matrices. Thus\nthe polarization vectors retain their form w = λ * 6 ξ, and the polarization set over the\ndiagonal in the curved part is of the same form as in the flat part of the spacetime\nand consists of points (x, x; ξ, −ξ; λ * 6 ξ) such that ξ is lightlike and in the forward\nlight cone, with arbitrary λ ∈ C.\nBecause of theorem 5, this form of the polarization set is conserved when the two\npoint distribution is pulled back to the undeformed spacetime via the isometry ρ.\nFinally, we obtain the polarization vectors away from the diagonal by shifting\nthe second spinor to the second point: for the operator P = 1 ⊗ (i6 ∇ + m) Dencker's\nconnection is simply DP = 1 ⊗ ∇. Thus a point (x, y; ξ, −η; w) is contained in the\npolarization set of ω + if and only if the parallel transport along the null geodesic\nconnecting x and y, such that ξ and η are tangent to the geodesic, shifts a polarization\nvector λ * 6 ξ over the point (x, x, ξ, −ξ) to w.\nThis is just the statement of theorem 10.\nTo summarize, we have proved that, like the wave front set, the polarization set\nof the two point function of a Hadamard state is uniquely fixed by the underlying\ngeometry, and that the fibre over each point of the wave front set is one-dimensional.\nThus the polarization set takes on the minimal possible form.\nIt seems now natural to define a Hadamard state by the polarization set of its\ntwo point distribution. A first step in this direction was undertaken by Hollands [23]\nwho takes equation (65) for the wave front set, which is a result in our approach, as\nthe definition of a Hadamard state for the free Dirac field. It is then shown that this\ncondition on the wave front set already fixes the polarization set.\n\n5\n\nOutlook and conclusion\n\nIn this paper we have demonstrated the usefulness of a microlocal characterization\nof the distributions that are of interest in quantum field theory on curved spacetime.\nHowever, this is not confined to the investigation of quasifree Hadamard states.\nIn the naive perturbative construction of interacting quantum field theories one\nencounters formal products of distributions that are a priori not well-defined. Over\nthe years, one has learned how to deal with the divergencies in these formal expressions by different renormalization techniques, but the understanding of the singularity structure of the distributions which are involved can lead to some further insight\nwhere these divergencies originate.\nFor example, in scalar φ4 -theory the perturbative construction of the S-matrix\ninvolves the time-ordered two point distribution, whose formal expansion in terms\n\n25\n\n\fof Wick products of free fields contains terms like\nT2 (x, y) = c1 (i∆F (x, y))3 : φ(x)φ(y) : +c2 (i∆F (x, y))2 : φ2 (x)φ2 (y) : + . . . ,\n\n(81)\n\nwhere\n∆F = iΛ + ∆+\n\n(82)\n\nis the Feynman propagator.\nBecause of the singularities of distributions, it is impossible to define a reasonable\nproduct on the whole space of distributions, especially the products of Feynman\npropagators in (81) do not exist as well-defined distributions. This is the reason for\nthe well-known ultraviolet divergencies in these expressions.\nFor certain well-behaved distributions, however, it is possible to define a product,\nand it can be shown that a simple condition on the wave front sets of the factors is\nsufficient for its existence [11]: If the singular directions in the wave front sets of the\ntwo factors over the same point do not add up to zero, the product can be defined.\nThe wave front set of the Feynman propagator ∆F of a Hadamard state has also\nbeen calculated by Radzikowski [20],\n\b\nWF (∆F ) = (x, y; ξ, −η) ∈ T ∗(M × M) \\ 0 | (x, ξ) ∼ (y, η), x 6= y,\n±\nξ ∈ V x if x ∈ J ± (y)\n∪ {(x, x; ξ, −ξ) ∈ T ∗(M × M) \\ 0}.\n(83)\n±\n\nThe condition ξ ∈ V x if x ∈ J ± (y) now ensures the existence of the products in (81)\nat all points away from the diagonal, while over the points of the diagonal the wave\nfront sets of the factors are too large. Therefore the only ambiguity in the definition\nof the product lies in the extension of the resulting distribution to the diagonal,\nand renormalization can be viewed as the process of extending the time-ordered\ndistributions to the whole spacetime.\nThis approach to renormalization theory has not only the advantage of being\nmathematically elegant and rigorous, but it also works entirely in configuration space.\nThus it can be extended to a generic spacetime, where all the powerful renormalization techniques in momentum space cannot be applied because of the lack of a\nglobal momentum space. Indeed, in [24] it could be shown that scalar field theories on\ncurved spacetimes can be renormalized under the same conditions as on Minkowski\nspacetime.\nAs the main new result of this work, we have calculated the polarization set for\nthe two point function of a Hadamard state of the free Dirac field. The Feynman\npropagator can be investigated in the same way, and on Minkowski spacetime it can\neasily be shown that the polarization vectors are of the same form as for the two point\nfunction. The generalization to a curved spacetime, however, is complicated by the\nfact that the Feynman propagator does not solve the homogeneous Dirac equation.\n26\n\n\fTherefore Dencker's theorem on the propagation of singularities can only be used to\ndetermine the polarization vectors away from the diagonal. Nevertheless, we expect\nthat the Feynman propagator for physical states does not have a larger polarization\nset than on Minkowski spacetime. The knowledge of the singularity structure of the\nFeynman propagator should then contribute to a better understanding of interacting\nquantum field theories containing fermions.\n\nAcknowledgements\nI would like to thank Prof. Klaus Fredenhagen for his guidance in this work. I am also\nthankful to Marek Radzikowski who stimulated this research by helpful discussions\nand making available his unpublished results. The opportunity to complete this work\nunder financial support by DESY is gratefully acknowledged.\n\nReferences\n[1] R. M. Wald, General Relativity, The University of Chicago Press, Chicago 1984\n[2] N. D. Birrell and P. C. W. Davies, Quantum fields in curved space, Cambridge\nUniversity Press, Cambridge 1982\n[3] S. A. Fulling, Phys. Rev. D7 (1973) 2850\n[4] R. M. Wald, Quantum field theory in curved spacetime and black hole thermodynamics, The University of Chicago Press, Chicago 1994\n[5] R. M. Wald, Commun. Math. Phys. 54 (1977) 1\n[6] B. S. DeWitt and R. W. Brehme, Annals Phys. 9 (1960) 220\n[7] S. A. Fulling, Aspects of Quantum Field Theory in Curved Space-Time, Cambridge University Press, Cambridge 1989\n[8] B. S. Kay and R. M. Wald, Phys. Rept. 207 (1991) 49\n[9] J. Dimock, Trans. Amer. Math. Soc. 269 (1982) 133\n[10] M. Köhler, gr-qc/9505014\n[11] L. Hörmander, Acta Math. 127 (1971) 79\n[12] J. J. Duistermaat and L. Hörmander, Acta Math. 128 (1972) 183\n[13] L. Hörmander, The analysis of linear partial differential operators I, SpringerVerlag, Berlin 1990\n27\n\n\f[14] M. E. Taylor, Pseudodifferential Operators, Princeton University Press, Princeton 1981\n[15] M. Reed and B. Simon, Methods of Modern Mathematical Physics II, Academic\nPress, New York 1975\n[16] D. Iagolnitzer, Lett. Math. Phys. 21 (1991) 323, and the references therein\n[17] N. Dencker, J. Funct. Anal. 46 (1982) 351\n[18] M. Radzikowski, unpublished manuscript, 1997\n[19] N. Dencker, J. Funct. Anal. 104 (1992) 414\n[20] M. Radzikowski, PhD thesis, Princeton University, 1992\n[21] W. Junker, Rev. Math. Phys. 8 (1996) 1091, erratum in preparation\n[22] S. A. Fulling, F. J. Narcowich, and R. M. Wald, Annals Phys. 136 (1981) 243\n[23] S. Hollands, gr-qc/9906076\n[24] R. Brunetti and K. Fredenhagen, math-ph/9903028\n\n28\n\n\f"}