{"id": "http://arxiv.org/abs/math/0406388v2", "guidislink": true, "updated": "2009-04-28T15:25:00Z", "updated_parsed": [2009, 4, 28, 15, 25, 0, 1, 118, 0], "published": "2004-06-19T15:18:07Z", "published_parsed": [2004, 6, 19, 15, 18, 7, 5, 171, 0], "title": "Power series expansions of modular forms and their interpolation\n  properties", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=math%2F0309407%2Cmath%2F0309468%2Cmath%2F0309238%2Cmath%2F0309249%2Cmath%2F0309191%2Cmath%2F0309377%2Cmath%2F0309297%2Cmath%2F0309004%2Cmath%2F0309116%2Cmath%2F0309027%2Cmath%2F0309086%2Cmath%2F0309296%2Cmath%2F0309318%2Cmath%2F0309230%2Cmath%2F0309361%2Cmath%2F0309363%2Cmath%2F0309347%2Cmath%2F0309207%2Cmath%2F0309448%2Cmath%2F0309092%2Cmath%2F0309400%2Cmath%2F0309463%2Cmath%2F0406061%2Cmath%2F0406377%2Cmath%2F0406560%2Cmath%2F0406008%2Cmath%2F0406185%2Cmath%2F0406220%2Cmath%2F0406215%2Cmath%2F0406581%2Cmath%2F0406345%2Cmath%2F0406195%2Cmath%2F0406615%2Cmath%2F0406449%2Cmath%2F0406578%2Cmath%2F0406047%2Cmath%2F0406029%2Cmath%2F0406340%2Cmath%2F0406018%2Cmath%2F0406601%2Cmath%2F0406573%2Cmath%2F0406476%2Cmath%2F0406335%2Cmath%2F0406324%2Cmath%2F0406542%2Cmath%2F0406250%2Cmath%2F0406367%2Cmath%2F0406334%2Cmath%2F0406086%2Cmath%2F0406044%2Cmath%2F0406349%2Cmath%2F0406122%2Cmath%2F0406194%2Cmath%2F0406051%2Cmath%2F0406175%2Cmath%2F0406541%2Cmath%2F0406311%2Cmath%2F0406588%2Cmath%2F0406285%2Cmath%2F0406305%2Cmath%2F0406033%2Cmath%2F0406400%2Cmath%2F0406486%2Cmath%2F0406475%2Cmath%2F0406401%2Cmath%2F0406089%2Cmath%2F0406537%2Cmath%2F0406111%2Cmath%2F0406555%2Cmath%2F0406500%2Cmath%2F0406490%2Cmath%2F0406388%2Cmath%2F0406042%2Cmath%2F0406275%2Cmath%2F0406456%2Cmath%2F0406595%2Cmath%2F0406440%2Cmath%2F0406611%2Cmath%2F0406213%2Cmath%2F0406052%2Cmath%2F0406199%2Cmath%2F0406415%2Cmath%2F0406495%2Cmath%2F0406331%2Cmath%2F0406384%2Cmath%2F0406357%2Cmath%2F0406621%2Cmath%2F0406597%2Cmath%2F0406263%2Cmath%2F0406592%2Cmath%2F0406267%2Cmath%2F0406546%2Cmath%2F0406166%2Cmath%2F0406580%2Cmath%2F0406109%2Cmath%2F0406107%2Cmath%2F0406547%2Cmath%2F0406129%2Cmath%2F0406272%2Cmath%2F0406365%2Cmath%2F0406625&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Power series expansions of modular forms and their interpolation\n  properties"}, "summary": "Let x be a CM point on a modular or Shimura curve and p a prime of good\nreduction, split in the CM field K. We define an expansion of an holomorphic\nmodular form f in the p-adic neighborhood of x and show that the expansion\ncoefficients give information on the p-adic ring of definition of f. Also, we\nshow that letting x vary in its Galois orbit, the expansions coefficients allow\nto construct a p-adic measure whose moments squared are essentially the values\nat the centre of symmetry of L-functions of the automorphic representation\nattached to f based-changed to K and twisted by a suitable family of\nGrossencharakters for K.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=math%2F0309407%2Cmath%2F0309468%2Cmath%2F0309238%2Cmath%2F0309249%2Cmath%2F0309191%2Cmath%2F0309377%2Cmath%2F0309297%2Cmath%2F0309004%2Cmath%2F0309116%2Cmath%2F0309027%2Cmath%2F0309086%2Cmath%2F0309296%2Cmath%2F0309318%2Cmath%2F0309230%2Cmath%2F0309361%2Cmath%2F0309363%2Cmath%2F0309347%2Cmath%2F0309207%2Cmath%2F0309448%2Cmath%2F0309092%2Cmath%2F0309400%2Cmath%2F0309463%2Cmath%2F0406061%2Cmath%2F0406377%2Cmath%2F0406560%2Cmath%2F0406008%2Cmath%2F0406185%2Cmath%2F0406220%2Cmath%2F0406215%2Cmath%2F0406581%2Cmath%2F0406345%2Cmath%2F0406195%2Cmath%2F0406615%2Cmath%2F0406449%2Cmath%2F0406578%2Cmath%2F0406047%2Cmath%2F0406029%2Cmath%2F0406340%2Cmath%2F0406018%2Cmath%2F0406601%2Cmath%2F0406573%2Cmath%2F0406476%2Cmath%2F0406335%2Cmath%2F0406324%2Cmath%2F0406542%2Cmath%2F0406250%2Cmath%2F0406367%2Cmath%2F0406334%2Cmath%2F0406086%2Cmath%2F0406044%2Cmath%2F0406349%2Cmath%2F0406122%2Cmath%2F0406194%2Cmath%2F0406051%2Cmath%2F0406175%2Cmath%2F0406541%2Cmath%2F0406311%2Cmath%2F0406588%2Cmath%2F0406285%2Cmath%2F0406305%2Cmath%2F0406033%2Cmath%2F0406400%2Cmath%2F0406486%2Cmath%2F0406475%2Cmath%2F0406401%2Cmath%2F0406089%2Cmath%2F0406537%2Cmath%2F0406111%2Cmath%2F0406555%2Cmath%2F0406500%2Cmath%2F0406490%2Cmath%2F0406388%2Cmath%2F0406042%2Cmath%2F0406275%2Cmath%2F0406456%2Cmath%2F0406595%2Cmath%2F0406440%2Cmath%2F0406611%2Cmath%2F0406213%2Cmath%2F0406052%2Cmath%2F0406199%2Cmath%2F0406415%2Cmath%2F0406495%2Cmath%2F0406331%2Cmath%2F0406384%2Cmath%2F0406357%2Cmath%2F0406621%2Cmath%2F0406597%2Cmath%2F0406263%2Cmath%2F0406592%2Cmath%2F0406267%2Cmath%2F0406546%2Cmath%2F0406166%2Cmath%2F0406580%2Cmath%2F0406109%2Cmath%2F0406107%2Cmath%2F0406547%2Cmath%2F0406129%2Cmath%2F0406272%2Cmath%2F0406365%2Cmath%2F0406625&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Let x be a CM point on a modular or Shimura curve and p a prime of good\nreduction, split in the CM field K. We define an expansion of an holomorphic\nmodular form f in the p-adic neighborhood of x and show that the expansion\ncoefficients give information on the p-adic ring of definition of f. Also, we\nshow that letting x vary in its Galois orbit, the expansions coefficients allow\nto construct a p-adic measure whose moments squared are essentially the values\nat the centre of symmetry of L-functions of the automorphic representation\nattached to f based-changed to K and twisted by a suitable family of\nGrossencharakters for K."}, "authors": ["Andrea Mori"], "author_detail": {"name": "Andrea Mori"}, "author": "Andrea Mori", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1142/9789812709653_0006", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/math/0406388v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/math/0406388v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "45 pages. In this new version of the paper the restriction on the\n  weight in the expansion principle in the quaternionic case has been removed.\n  Also, the formula linking the square of the moment to the special value of\n  the L-function has been greatly simplified and made much more explicit", "arxiv_primary_category": {"term": "math.NT", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.NT", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "11F67", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/math/0406388v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/math/0406388v2", "journal_reference": null, "doi": "10.1142/9789812709653_0006", "fulltext": "arXiv:math/0406388v2 [math.NT] 28 Apr 2009\n\nPower Series Expansions of Modular Forms\nand Their Interpolation Properties\nAndrea Mori\nDipartimento di Matematica\nUniversità di Torino\nAbstract\nWe define a power series expansion of a holomorphic modular form f in the\np-adic neighborhood of a CM point x of type K for a split good prime p. The\nmodularity group can be either a classical conguence group or a group of norm\n1 elements in an order of an indefinite quaternion algebra. The expansion coefficients are shown to be closely related to the classical Maass operators and give\np-adic information on the ring of definition of f . By letting the CM point x vary\nin its Galois orbit, the r-th coefficients define a p-adic K × -modular form in the\nsense of Hida. By coupling this form with the p-adic avatars of algebraic Hecke\ncharacters belonging to a suitable family and using a Rankin-Selberg type formula\ndue to Harris and Kudla along with some explicit computations of Watson and of\nPrasanna, we obtain in the even weight case a p-adic interpolation for the square\nroots of a family of twisted special values of the automorphic L-function associated\nwith the base change of f to K.\n2000 Mathematics Subject Classification 11F67\n\nIntroduction\nThe idea that the power series expansion of a modular form at a CM point with respect\nto a well-chosen local parameter should have an arithmetic significance goes back to the\nauthor's thesis, [33]. The goal of the thesis was to prove an expansion principle, namely a\ncharacterization of the ring of algebraic p-adic integers of definition of an elliptic modular\nform in terms of the coefficients of the expansion. Such a result would be analogous to\nthe classical q-expansion principle based on the Fourier expansion (e.g. [24]), with the\nadvantage of being generalizable in principle to groups of modularity without parabolic\nelements where Fourier series are not available. The simplest such situation is that\nof a Shimura curve attached to an indefinite non-split quaternion algebra D over Q\n(quaternionic modular forms).\nThe basic idea in [33] was to consider a prime p of good reduction for the modular\ncurve that is split in the quadratic field of complex multiplications K and use the\nSerre-Tate deformation parameter to construct a local parameter at the CM point x\ncorresponding to a fixed embedding of K in the split quaternion algebra. The coefficients\nof the resulting power series are related to the values obtained evaluating the C ∞ (r)\nmodular forms δk f at a lift τ of x in the complex upper half-plane, where k is the weight\n(r)\nof f and δk is the r-th iterate, in the automorphic sense, of the basic Maass operator\n\n\fA. Mori\n\u0010\n\u0011\n1\nd\nδk = − 4π\n2i dz\n+ ky . Our first goal in this paper is to prove a version of the expansion\nprinciple valid also for quaternionic modular forms without making use of the local\ncomplex geometry and completely p-adic in nature. The realization of modular forms\nas global sections of a line bundle L suitable for the Serre-Tate theory is subtler in the\nnon-split case because for Shimura curves the Kodaira-Spencer map KS : Sym2 ω → Ω1X\nis not an isomorphism (for a trivial reason: the push-forward ω = π∗ Ω1A/X for the\nuniversal family of \"false elliptic curves\" has rank 2). This motivates the introduction\nof p-ordinary test triples (definition 1.8) that require moving to an auxiliary quadratic\nextension. The abelian variety of dimension ≤ 2 corresponding to the CM point x\ndefined over the ring of p-adic algebraic integers O(v) is either a CM curve E with\nEnd0 (E) = K or an abelian surface isogenous to a twofold product E × E of such a CM\n×\ncurve. To it we associate a complex period Ω∞ ∈ CP\nand a p-adic period Ωp ∈ Ovnr,× .\n∞\nIf also the modular form is defined over O(v) and r=0 (br (x)/r!)Txr is its expansion\nobtained form the Serre-Tate theory, we establish in theorem 3.6 an equality\n(r)\n\n−k−2r\nc(r)\n= br (x)Ωp−k−2r\nv (x) = δk (f )(τ )Ω∞\n\n(1)\n\nof elements in O(v) . The expansion principle, theorem 3.8, asserts that if f is a holo(r)\n\nmorphic modular form such that the numbers cv (x) defined by the complex side of\n(r)\nthe equality (1) are in Ov and the p-adic integers Ω2r\np cv (x) satisfy the Kummer-Serre\ncongruences, then f is defined over the integral closure of O(v) in the compositum of all\nfinite extensions of the quotient field of O(v) in which v splits completely.\nSuppose again that the holomorphic modular form f is defined over a ring O(v)\n(r)\nof p-adic integers. The numbers cv (x) are related to the coefficients of a p-integral\npower series, i.e. to a p-adic measure on Zp , naturally attached to f . One may wonder\nabout the interpolation properties of this measure. In the introduction of [15] Harris\nand Tilouine suggest that in the case of an eigenform f the author's techniques may be\nused in conjunction with the results of Waldspurger [46] to p-adically interpolate the\nsquare roots of the special values of the automorphic L-functions L(πK ⊗ ξ, s), where\nπK is the base change to K of the GL2 -automorphic representation π associated to f\n(possibly up to Jacquet-Langlands correspondence) and ξ belongs to a suitable family\nof Grössencharakters for K.\nOur second goal for this paper is to partially fulfill this expectation when f has even\n(r)\nweight 2κ. A key observation (proposition 4.10) is that the set of values cv (x) for x\nranging in a full set of representatives of the copy of the generalized ideal class group\nbc× embedded in the modular (or Shimura) curve extends to a Hida [17] pKA× /K × C× O\nadic GL1 (K)-modular form ĉr , which is essentially the r-th moment of a p-adic measure\non Zp with values in the unit ball of the p-adic Banach space of such p-adic forms. The\nscalar obtained by coupling the form ĉr with the p-adic avatar of a Grössencharakter\nb× and of suitable weight twisted by a power of the idelic norm is\nξr for K trivial on O\nc\nproportional to the integral\nZ\nφr (td∞ )ξr (t) dt\n(2)\nJr (f, ξr , τ ) =\nKA× /K × R×\n\n(r)\n\nwhere φr is the adelic lift of δ2κ (f ), τ ∈ H represents x and d∞ ∈ SL2 (R) is the standard\nparabolic matrix such that d∞ i = τ . When ξr is of the form ξr = χξ r and satisfies some\ntechnical conditions the value so obtained is essentialy the r-th moment of a p-adic\nmeasure μ(f, x; χ, ξ) on Zp .\n2\n\n\fPower series expansions of modular forms\n\nOn the other hand, the square of the integral (2) is a special case of the generalized\nFourier coefficients Lξ (Φ) studied by Harris and Kudla in [13]. Building on results of\nShimizu [42] and refining the techniques of Waldspurger [46], Harris and Kudla use the\nseesaw identity associated with the theta correspondence between the similitude groups\nGL2 and GO(D) and the splitting D = K ⊕ K ⊥ to express the generalized Fourier\ncoefficients Lξ (θφ (F )) where F ∈ π and φ is a split primitive Schwartz-Bruhat function\non DA as a Rankin-Selberg Euler product. Thus, we can use the explicit version of\nShimizu's theory worked out by Watson [47], the local non-archimedean computations\nof Prasanna [38] together with some local archimedean computations to obtain a formula\nrelating the square of the r-th moment of μ(f, x; χ, ξ) to the values L(πK ⊗χξ r , 21 ) whose\nlocal correcting terms are explicit outside the primes dividing the conductor of the\nGrössencharakter and the primes dividing the non square-free part of the level (theorem\n4.21).\nSome natural questions arise. First of all, one would like to compute the special\nvalues of the p-adic L-function attached to the measure μ(f, x; χ, ξ). Secondly, one\nmay ask if the methods can be extended to treat different or more general families of\nGrössencharakters, in particular if one can control the interpolation as the ramification\nat p increases. Proposition 4.15 implies that, if anything, this cannot be achieved without moving the CM point. Thus, some kind of geometric construction in the modular\ncurve may be in order, with a possible link to the question of the determination of the\naction of the Hecke operators on the Serre-Tate expansions. Another question is whether\nthe reinterpretation of the integral (2) as inner product in the space of p-adic GL1 (K)modular forms can be used to obtain an estimate of the number of non-vanishing special\nvalues L(πK ⊗ ξ, 21 ). We hope to be able to attack these problems in a future paper.\nAcknowledgements. The idea that the power series coefficients may be used to padically interpolate the special values L(πK ⊗ξ, 12 ) arose a long time ago in conversations\nwith Michael Harris. I wish to thank Michael Harris for sharing his intuitions and for\nmany useful suggestions.\nAlso, I wish to thank the anonymous referee of a previous version of the manuscript,\nwhose suggestions helped greatly to remove some unnecessary hypotheses.\nNotations and Conventions. The symbols Z, Q, R, C and Fq denote, as usual,\nthe integer, the rational, the real, the complex numbers and the field with q elements\nrespectively. We fix once for all an embedding ı : Q → C and by a number field we mean\na finite subextension of the field Q of algebraic numbers. If L√is a number field, we\ndenote OL its ring of integers and δL its discriminant. If L = Q( d) is a quadratic field,\nfor each positive\ninteger c we denote OL,c = Z √\n+ cOL = Z[cωd ] its order of conductor c,\n√\nwith ωd = d if d ≡ 2, 3 mod 4 or ωd = (1 + d)/2 if d ≡ 1 mod 4. If [L : Q] = n we\ndenote IL = {σ1 , . . . , σn } the set of embeddings σi : L → C and we assume σ1 = ı|L .\nIf p is a rational prime we denote Zp and Qp the p-adic integers and the p-adic\nnumbers respectively. By analogy, Q∞ = R. If v|p is a place of the number field\nL corresponding to the maximal ideal pv ⊂ OL , we denote O(v) , Lv , Ov , k(v) the\nlocalization of OL at pv , the v-adic completion of L, the ring of v-adic integers in Lv\nand the residue field respectively. The maximal ideal in Ov is still denoted pv . Also, we\nnr\ndenote Lnr\nv the maximal unramified extension of Lv and Ov its ring of integers.\nb the profinite completion of Z and for each Z-module M we let M\nc=\nWe denote Z\nb\nM ⊗ Z. We denote A the ring of rational adeles and Af the finite adeles, so that\nb For a number field L we denote AL = A ⊗ L and L× the\nA = R × Af = QRZ.\nA\n3\n\n\fA. Mori\n\ncorresponding ring of adeles and group of ı̀deles respectively. If n ⊆ OK is an ideal,\n×\nwe let L×\nn = {λ ∈ L such that λ ≡ 1 mod n} and denote In the group of fractional\nideals of L prime with n, Pn the subgroup of principal fractional ideals generated by the\nelements in L×\nn and Un the subgroup of finite ı̀deles product of local units congruent to\n1 modn.\nWe fix an additive character ψ of A/Q, by asking that ψ∞ (x) = e2πix and ψp is\n2πix\ntrivial on Zp with\nfor x ∈ Z[p−1 ] and finite p. On A we fix the Haar\nQ ψp (x) = e\nmeasure dx = p≤∞ dxp where the local Haar measures dxp are normalized so that the\nψp -Fourier transform is autodual. For\nQ a quaternion algebra D with reduced norm ν, we\nfix on DA the Haar measure dx = p≤∞ dxp where the local Haar measures dxp are\nnormalized so that the Fourier transform with respect to the norm form is autodual.\nLet\nN\n(V, h , i) be a quadratic space of dimension d over Q. We denote SA (V ) = p≤∞ Sp the\nadelic Schwartz-Bruhat space, where for p finite, Sp is the space of Bruhat functions on\nV ⊗ Qp and S∞ is the space of Schwartz functions on V ⊗ R which are finite under the\nnatural action of a (fixed) maximal compact subgroup of the similitude group GO(V ).\nThe Weil representation rψ is the representation of SL2 (A) on SA (V ) which is explicitely\ndescribed locally at p ≤ ∞ by\n\u0012\n\u0013\n\u0012\n\u0013\n1\n1 b\nhbx, xi φ(x),\n(3a)\nφ(x) = ψp\nrψ\n0 1\n2\n\u0012\n\u0013\na\n0\nd/2\nrψ\nφ(x) = χV (a) |a|p φ(ax)\n(3b)\n0 a−1\n\u0012\n\u0013\n0 1\nφ(x) = γV φ̂(x)\n(3c)\nrψ\n−1 0\nwhere γV is an eighth root of 1 and χV is a quadratic character that are computed in\nour cases of interest\nin [21] (see also the table in [38, §3.4]), while the Fourier transR\nform φ̂(x) = V ⊗Qp φ(y)ψp (hx, yi) dy is computed with respect to a h , i-self dual Haar\nmeasure on V ⊗ Qp .\nIf R is a ring and M a R-module we denote M ∨ = Hom(M, R) the dual of M . The\nsame notation applies to a sheaf of modules over a scheme. If G is a subgroup of units\nin R we say that non-zero elements x, y ∈ M are G-equivalent and write x ∼G y if there\nexists r ∈ G such that rx = y.\nThe group SL2 (R)\n\u0010 acts\n\u0011 on the complex upper half-plane H by linear fractional transformations, if g =\n\nab\nc d\n\nthen g * z =\n\naz+b\ncz+d .\n\nThe automorphy factor is defined to be\n\nj(g, z) = cz + d. The action extends to an action of the group GL+\n2 (R). If Γ < SL2 (R)\nis a Fuchsian group of the first kind we shall denote Mk (Γ) the space of modular forms\nof weight k ∈ Z with respect to Γ i.e. the holomorphic functions f on H such that\nf (γz) = f (z)j(γ, z)k for all z ∈ H and γ ∈ Γ\n\nand extend holomorphically to a neighborhood of each cusp (when cusps exist). The\nsubspace of cuspforms, i.e. those modular forms that vanish at the cusps, will be denoted\nSk (Γ). The request that a holomorphic function on H extends holomorphically to a\nneighborhood of a cusp s is equivalent to a certain growth condition as z → s. Relaxing\nholomorphicity but mantaining the growth condition yields the much bigger spaces of\nC ∞ -modular and -cuspforms, which will be denoted Mk∞ (Γ) and Sk∞ (Γ) respectively.\nWe will denote\nMk,ε (∆, N ),\n\n∞\nMk,ε\n(∆, N ),\n\nSk,ε (∆, N ),\n4\n\n∞\nSk,ε\n(∆, N )\n\n\fPower series expansions of modular forms\n\nthe above spaces of modular or cuspforms with respect to the groups Γ = Γε (∆, N ),\nε ∈ {0, 1}, defined in section 1.2. It is a well-known fact that Mk,ε (∆, N ) is always\nfinite-dimensional and trivial for k < 0.\n\n1\n1.1\n\nModular and Shimura curves\nQuaternion algebras.\n\nLet D be a quaternion algebra over Q with reduced norm ν and reduced trace tr. For\neach place l of Q let Dl = D ⊗Q Ql . Let ΣD be the set of places at which D is ramified,\ni. e. Dl is the unique, up to isomorphism, quaternion division algebra over Ql . If\nl∈\n/ ΣD the algebra D is split at l, i. e. Dl ≃ M2 (Ql ). The set ΣD is finite and even\nand determines completely the isomorphism class of D. Moreover, every finite and even\nsubset of places of Q is the set of ramified places of some quaternion algebra over Q\n(for these and the other basic results on quaternion algebras the standard reference is\n[45]). In particular, M2 (Q) is the only quaternion algebra up to isomorphism which is\nsplit, i. e. split at all places. The discriminant ∆ = ∆D of D is the product of the finite\nprimes in ΣD if ΣD 6= ∅, or ∆ = 1 otherwise. We shall henceforth assume that D is\n∼\nindefinite, i. e. split at ∞, and fix an isomorphism Φ∞ : D∞ → M2 (R) which will be\noften left implicit. There is a unique conjugacy class of maximal orders in D. Once for\n∼\n/ ΣD so\nall, choose a maximal order R1 and fix isomorphisms Φl : Dl → M2 (Ql ) for l ∈\nthat Φl (R1 ) = M2 (Zl ). For an integer N prime to ∆ let RN be the level N Eichler\norder of D such that\n\u0012\u001a\u0012\n\u0013\n\u001b\u0013\na b\n∈ M2 (Zl ) such that c ≡ 0 mod N\nRN ⊗Z Zl = Φl −1\nc d\nfor l ∈\n/ ΣD , and RN ⊗ Zl is the unique\nIf D = M2 (Q)\nn\u0010 \u0011maximal order in Dl for l ∈ ΣD . o\nab\nwe take R1 = M2 (Z) and RN =\nc d ∈ M2 (Z) such that c ≡ 0 mod N .\n\nThere are exactly two homomorphisms or1l , or2l : RN ⊗ Fl −→ Fl2 for each prime\nl|∆, and two homomorphisms or1l , or2l : RN ⊗ Fl −→ Fl 2 for each prime l|N . These\nmaps are called l-orientations and the two l-orientations are switched by the nontrivial automorphism of either Fl2 or Fl 2 . An orientation for RN is the choice of an\nl-orientation orl for all primes l|N ∆.\nAn involution d 7→ d† in D is positive if tr(dd† ) > 0 for all d ∈ D. By the SkolemNoether theorem\n ̄\n(4)\nd† = t−1 dt\n\nwhere t ∈ D is some element such that t2 ∈ Q<0 and d 7→ d ̄ denotes quaternionic\nconjugation, d + d ̄ = tr(d). If t ∈ D is such an element, let Bt be the bilinear form on\nD defined by\nBt (a, b) = tr(ab̄t) = tr(atb† )\nfor all a, b ∈ D.\n(5)\nIf R ⊂ D is an order, the involution d 7→ d† is called R-principal if R† = R and\nthe bilinear form Bt is skew-symmetric, non-degenerate and Z-valued on R × R with\npfaffian equal to 1. When ∆ > 1 an explicit model for the triple (D, RN , d 7→ d† ) can be\nconstructed as follows. The condition (n, −N ∆)l = −1 for all l ∈ ΣD on Hilbert symbols\ndefines for n a certain subset of non-zero congruence classes modulo N ∆. Passing to\nclasses modulo 8N ∆ and taking n > 0 we may assume that (n, −N ∆)∞ = (n, −N ∆)p =\n1 for all primes p dividing N and also (n, −N ∆)2 = 1 if ∆ is odd. By Dirichlet's theorem\n5\n\n\fA. Mori\n\nof primes in arithmetic progressions there exists a prime po satisfying these conditions\nand the product formula easily implies that\n(p0 , −N ∆)l = −1\n\nif and only if l ∈ ΣD .\n\n(6)\n\nLet a ∈ Z such that a2 N ∆ ≡ −1 mod po .\nTheorem 1.1 (Hashimoto, [16]). Let D be a quaternion algebra over Q of discriminant\n∆ and let t ∈ D such that t2 ∈ Q<0 . Then:\n1. D is isomorphic to the quaternion algebra DH = Q ⊕ Qi ⊕ Qj ⊕ Qij, where\ni2 = −N ∆, j 2 = po and ij = −ji;\n2. the order RH,N = Zǫ1 ⊕Zǫ2 ⊕Zǫ3 ⊕Zǫ4 , where ǫ1 = 1, ǫ2 = (1+j)/2, ǫ3 = (i+ij)/2\nand ǫ4 = (aN ∆j + ij)/po is an Eichler order of level N in DH ;\n3. the skew symmetric form Bt on DH is Z-valued on RH,N if and only if ti ∈ RH,N .\nMoreover, it defines a non-degenerate pairing on RH,N × RH,N if and only if\nti ∈ R×\nH,N ;\n4. let t = i−1 . Then the elements η1 = ǫ3 − 12 (po − 1)ǫ4 , η2 = −aN ∆ − ǫ4 , η3 = 1\nand η4 = ǫ2 are a symplectic Z-basis of RH,N .\nWe call Hashimoto model of a quaternion algebra endowed with an Eichler order R of\nlevel N and a R-principal positive involution the triple (DH , RH,N , i−1 ) given in the\nabove theorem. We can fix the isomorphism Φ∞ for the Hashimoto model by declaring\nthat\n\u0012\n\u0013\n\u0012 √\n\u0013\npo\n0\n−1\n0\n√\nΦ∞ (i) =\n,\nΦ∞ (j) =\n.\nN∆ 0\n0\n− po\n\n1.2\n\nModuli spaces.\n\nFix a R1 -principal positive involution d 7→ d† as in (4). We shall consider the groups\nΓ0 (∆, N ) = R1N = {γ ∈ RN such that ν(γ) = 1}\nand\nΓ1 (∆, N ) = {γ ∈ Γ0 (∆, N ) such that orǫl (γr) = orǫl (r) for all r ∈ RN , l|N, ǫ = 1, 2} .\nWhen ∆ = 1, Γ0 (1, N ) and Γ1 (1, N ) are the classical congruence subgroup\n\u001a\u0012\n\u001b\n\u0013\na b\nΓ0 (N ) =\n∈ SL2 (Z) such that c ≡ 0 mod N\nc d\nand\nΓ1 (N ) =\n\n\u001a\u0012\n\na\nc\n\nb\nd\n\n\u0013\n\n∈ SL2 (Z) such that a, d ≡ 1 e c ≡ 0 mod N\n\n\u001b\n\nrespectively. Since D is indefinite Γε (∆, N ) for ε ∈ {0, 1} is, via Φ∞ , a discrete subgroup of SL2 (R) acting on the complex upper half plane H. When ∆ > 1 the quotient\nXε (∆, N ) = Γε (∆, N )\\H is a compact Riemann surface, [43, proposition 9.2]. When\n∆ = 1 let Xε (N ) be the standard cuspidal compactification of Yε (N ) = Γε (N )\\H.\nEach of these complete curves X has a canonical model over Q, [43]. In fact, each\nX can be reinterpreted as the set of complex points of a scheme X which is the solution\n6\n\n\fPower series expansions of modular forms\n\nof a moduli problem, defined over Z[1/N ∆], e.g. [1, 6, 7, 32, 39]. When D = M2 (Q)\nand N > 3, the functor F1 (N ) : Z[1/N ]-Schemes → Sets defined by\n\u001a\n\u001b\nIsomorphism classes of generalized elliptic curves E = E|S\nF1 (N )(S) =\n,\nwith a section P : S → E of exact order N\nis represented by a proper and smooth Z[ N1 ]-scheme X1 (N ) such that X1 (N )(C) =\nX1 (N ). The complex elliptic curve with point P of exact order N corresponding to\nz ∈ H is the torus Ez = C/Z ⊕ Zz with P = 1/N mod Z. Denote\nπN : EN −→ X1 (N )\n\n(7)\n\nthe universal generalized elliptic curve attached to the representable functor F1 (N ).\nThe scheme X0 (N ) quotient of X1 (N ) by the action of the group of diamond operators\nhai : X1 (N ) → X1 (N ), hai(E, P ) = (E, aP ) for all a ∈ (Z/N Z)× , is the coarse moduli\nscheme attached to the functor\n\u001a\n\u001b\nIsomorphism classes of generalized elliptic curves E = E|S\nF0 (N )(S) =\nwith a cyclic subgroup C ⊂ E of exact order N\nand a smooth Z[1/N ]-model for the curve X0 (N ).\nWhen ∆ > 1 and N > 3, X1 (∆, N ) = X1 (∆, N )(C) for the proper and smooth\nZ[1/N ∆]-scheme X1 (∆, N ) representing the functor F1 (∆, N ) : Z[1/N ∆]-Schemes →\nSets defined by\n\n\nIsomorphism classes of compatibly principally polarized \n\n\n\nabelian surfaces A = A|S with a ring embedding\nF1 (∆, N )(S) =\n.\nR1 ֒→ End(A) and an equivalence class of\n\n\n\n\nRN -orientation preserving level N structures\n\nA level N structure on an abelian surface A with R1 ⊂ End(A) is an isomorphism of\n(left) R1 -modules A[N ] ≃ R1 ⊗ (Z/N Z). Two such structures are declared equivalent\nif they coincide on RN ⊗ (Z/N Z) and induce the same l-orientations on RN for all\nl|N . The principal polarization is compatible with the embedding R1 ⊂ End(A) if\nthe involution d 7→ d† is the Rosati involution. The abelian surfaces in F1 (∆, N )(S)\nare called abelian surfaces with quaternionic multiplications (QM-abelian surfaces, for\nshort) or false elliptice curves. The complex QM-abelian surface corresponding to z ∈ H\nis\nz\nAz = D∞\n/R1 ,\n(8)\n\nz\nwhere D∞\nis the real vector space\n\u0001 D∞ endowed with the \u0001C-structure defined by the\nidentification C2 = Φ∞ (D∞ ) z1 , i.e. Az = C2 /Φ∞ (R1 ) z1 . The complex uniformiza∼\ntion (8) defines a level structure\nN −1 R\u00011 /R1 = (D/R1 )[N ] → (Az )[N ] and the skew\u0001\nz\nz\nsymmetric form Φ∞ (a) 1 , Φ∞ (b) 1\n= Bt (a, b) for all a, b ∈ D, where Bt is as\nin (5), extended to C2 by R-linearity is the unique Riemann form on Az with Rosati\ninvolution d 7→ d† , [32, lemma 1. 1]. Denote\n\nπ∆,N : A∆,N −→ X1 (∆, N )\n\n(9)\n\nthe universal QM abelian surface attached to the representable functor F1 (∆, N ).\nAs with the split case, a smooth Z[1/N ∆]-model X0 (∆, N ) of X1 (∆, N ) can be\n)\n×\nobtained as quotient of X1 (∆, N ) by a suitable action of ΓΓ01 (∆,N\n(∆,N ) ≃ (Z/N Z) . It is the\n7\n\n\fA. Mori\n\ncoarse moduli space for the functor\n\n\nIsomorphism classes of compatibly principally polarized\n\n\nF0 (∆, N )(S) = abelian surfaces A = A|S with a ring embedding R1 ֒→ End(A)\n\n\nand an RN -equivalence class of level N structures\n\nwhere two level N structures are RN -equivalent if they coincide on RN ⊗ (Z/N Z).\n\nRemark 1.2. In order to study the reduction of the modular and Shimura curves at\nprimes dividing N ∆ one has to extend the moduli problems described above to moduli\nproblems defined over Z, see [2, 28]. The Z-schemes thus obtained are proper but not\nsmooth. We shall not deal with primes of bad reduction and for the purposes of this\npaper the above descriptions will suffice.\n\n1.3\n\nSubfields and CM points.\n\nLet Q ⊆ L′ ⊂ L be a tower of fields with [L : L′ ] = 2 and assume that L splits D,\ni. e. D ⊗Q L ≃ M2 (L) or, equivalently, that L admits an embedding in D ⊗Q L′ . An\nembedding  : L ֒→ D ⊗Q L′ endows D ⊗Q L′ with a structure of L-vector space. Scalar\nmultiplication by λ ∈ L is left multiplication by (λ). The opposite algebra Dop acts\nL-linearly on D by right multiplication, providing a direct identification\n∼\n\nDop ⊗ L −→ EndL (D ⊗ L′ ).\n\n(10)\n\nLet σ be the non-trivial element in Gal(L/L′ ) and σ (λ) = (λσ ) for all λ ∈ L. By the\nSkolem-Noether theorem there exists u ∈ (D ⊗Q L′ )× , well defined up to a L× -multiple,\nsuch that u(λ) = σ (λ)u for all λ ∈ L and u2 ∈ L′ . Thus, with a slight abuse of\nnotation, the embedding  defines a splitting\nD ⊗ L′ = L ⊕ Lu\n\n(11)\n\nwhich can be more intrinsically seen as the eigenspace decomposition under right multiplication by (L× ). Also, there is an isomorphism\n∼\n\nD −→ Dop ,\n\nλ1 + λ2 u 7→ λ1 + λσ2 u.\n\nLet L = L′ (α) with α2 = A ∈ L′ . The element\n\u0012\n\u0013\n1\n1\n1 ⊗ 1 + (α) ⊗ α ∈ D ⊗ L′\ne =\n2\nA\n\n(12)\n\n(13)\n\nis an idempotent which is easily seen to be, under (10), (11) and (12), the projection\nz\nonto L with kernel Lu. If L ⊆ C the idempotent e defines a projector in D∞\nfor all\nz ∈ H by scalar extension.\nAn involution d 7→ d† in D extends by linearity to D ⊗ L′ . If † is the embedding † (λ) = (λ)† , the explicit description (13) implies at once that e† = e † and in\nparticular\n†\ne † = e if and only if (L) = (L) pointwise.\nWhen the involution is positive a fixed idempotent can be constructed as follows. As an\nelement of End(D) the involution (4) has determinant −1. Since 1† = 1 and tr(d† ) =\ntr(d) for all d ∈ D its (−1)-eigenspace is a subspace of trace 0 elements of dimension\neither 1 or 3. If the dimension is 3 then the involution is the quaternionic conjugation,\n8\n\n\fPower series expansions of modular forms\n\ncontradicting the positivity assumption. Therefore there exist a non-zero element d of\ntrace 0 fixed by the involution. The subalgebra F = Q(d) ⊂ D is a quadratic field fixed\nby the involution and the corresponding idempotent e ∈ D⊗Q F has the desired property.\nNote that the positivity of the involution implies further that F is real quadratic.\nThe conductor of an embedding  : L → D of the quadratic field L relative to the\norder RN is the integer c = cN > 0 such that (OL,c ) = (L) ∩ RN . Denote c̄ the\nminimal conductor, i.e. the conductor relative to the maximal order R1 . It is clear\nthat c is a multiple of c̄, in fact c/c̄ is a divisor of N because OL,c /OL,c̄ injects into\nR1 /RN ≃ Z/N Z. In the following result the embedding is left implicit to simplify the\nnotation.\nProposition 1.3. Let L ⊂ D be a quadratic subfield with associated decomposition\nD = L ⊕ Lu. Let Λ = L ∩ RN and Λ′ = Lu ∩ RN . Then:\n1. D is split at the prime p if and only if (u2 , δL )p = 1;\n2. if p is unramified in L and gcd(p, c) = 1 then RN ⊗Zp = Λ⊗Zp ⊕Λ′ ⊗Zp . Moreover,\nΛ′ ⊗ Zp = J u for some fractional ideal J ⊂ L ⊗ Qp such that N(J )ν(u) = (q ǫ )\nwith ǫ = 1 if q|N ∆ and ǫ = 0 otherwise.\n√\n√\n√\nProof. Let L = Q( d). Then {1, d, u, du} is a Q-basis of D and the local invariants\nof the norm form are det = 1 and ǫp = (−1, −1)p (u2 , d)p = (−1, −1)p (u2 , δL )p , thus\nproving the first part.\nFor the second part, choose u so that u2 ∈ Z. Then there is an inclusion of orders\n′\nR = OL,c ⊕ OL,c u ⊆ Λ ⊕ Λ′ ⊆ RN . The elements {1, cωd, u, cωdu} are a Z-basis of R′ ,\nso that R′ has reduced discriminant δL cu2 . We are thus reduced to check that when\np|u2 and gcd(p, cδL ) = 1 then there is no element x ∈ RN of the form x = (r + r′ u)/p\nwith r, r′ ∈ OL,c − pOL,c . For such an element x one must have p|tr(r) and p|N(r) from\nwhich one derives quickly a contradiction.\nThe last claim follows from the very same discriminant computation since RN has\nreduced discriminant N ∆.\nFix a quadratic imaginary field K that splits D. Exactly one of the two embeddings\n, σ is normalized in the sense of [43, (4. 4. 5)]. The normalized embeddings correspond\nbijectively to a special subset of points τ ∈ H. More precisely, there is a bijection\n\u001a\n\u001b\nn\no\nτ ∈ H such that Φ∞ ((K × )) =\nnormalized embeddings\n←→ CM∆,K =\n.\n : K ֒→ D\n{γ ∈ Φ∞ (D× ) ∩ GL+\n2 (R) | γ * τ = τ }\nThe bijection is Γ0 (∆, N )-equivariant where Γ0 (∆, N ) acts by conjugation on the left\nset and on CM∆,K via its action on H. Also, the correspondence  ↔ τ is characterized\nby the fact that the complex structure on D∞ induced by the embedding  coincides\nτ\nwith that of D∞\n. In the split case CM1,K = K ∩ H.\nWe shall denote cτ = cτ,N the conductor relative to the order RN of the embedding\nassociated to the point τ ∈ CM∆,K and c̄τ its minimal conductor.\nProposition 1.4. Let τ and τ ′ ∈ CM∆,K such that τ ′ = γ * τ for some γ ∈ Γ0 (∆, N ).\nThen cτ ′ ,N = cτ,N .\nProof. Let  and ′ be the embeddings corresponding to τ and τ ′ respectively. Then\n′ = γγ −1 and so ′ (Ocτ ′ ,N ) = ′ (K) ∩ RN = γ(K)γ −1 ∩ RN = γ((K) ∩ RN )γ −1 =\nγ(Ocτ,N )γ −1 = ′ (Ocτ,N ).\n\n9\n\n\fA. Mori\n\nDefinition 1.5. A point x ∈ X0 (∆, N ) is a CM point of type K and conductor c = cx\nif it is represented by a τ ∈ CM∆,K with cτ,N = c. Denote\nCM(∆, N ; OK,c ) = {CM points of X0 (∆, N ) of type K and conductor c}.\nThe following result is [4, Lemma 4.17]\nProposition 1.6. Let c > 0 be an integer such that gcd(c, N ∆) = 1. Then the set\nCM(∆, N ; OK,c ) is non-empty if and only if\n• all primes l|∆ are inert in K, and\n• all primes l|N are split in K.\nFor τ ∈ CM1,K the elliptic curve Eτ has complex multiplications in the field K.\nWhen ∆ > 1 and τ ∈ CM∆,K the QM abelian surface A = Aτ = A(C) contains\nthe elliptic curve E = K ⊗ R/OK,c̄ and in fact is isogenous to the product E × E.\nIn particular there is an identification Endo (A) ≃ D ⊗ K. Consider the left ideal\ne = End(A)∩Endo (A)(1−e ) where e is the idempotent (13) attached to the embedding\n : K ֒→ D associated to τ and let E = A[e]o be the connected component of the\nsubgroup scheme of A killed by e. Note that since (OK,c̄ ) and e commute, the order\nOK,c̄ acts on E.\nProposition 1.7. A = E ⊗OK,c̄ R1 as group schemes.\nProof. Let S be any scheme of definition for A. Over any S-scheme T there is an\nobvious map (E ⊗OK,c̄ R1 )(T ) → A(T ) which is surjective because E ⊗OK,c̄ R1 contains\ntwo independent abelian schemes of dimension 1, E and any translate of it by an r ∈\nR1 − OK,c̄ . To show that the map is injective, it is enough to do so over an algebraically\nclosed field. Over C we have E(C) = E and thus (E ⊗Rc̄ R1 )(C) = E ⊗OK,c̄ R1 =\n(K ⊗ R ⊗OK,c̄ R1 )/R1 = A.\nDefinition 1.8. Let p be an odd prime number, gcd(p, N ∆) = 1. A p-ordinary test\ntriple for Γε (∆, N ) is a triple (τ, v, e), where τ ∈ CM∆,K , v is a finite place dividing\np in a finite extension L ⊇ Q and e ∈ D ⊗ F is the idempotent associated to a real\nquadratic subfield F ⊂ D pointwise fixed by the positive involution, such that\n1. F K ⊆ L;\n2. the CM curve Eτ or QM-abelian surface Aτ has ordinary good reduction modulo\npv ;\n3. if w is the restriction of v to F then e ∈ R1 ⊗Z O(w) .\nFurthermore, a p-ordinary test triple (τ, v, e) is said split if p splits in F .\nLet us observe that:\n1. the ordinarity hypothesis implies that p splits in K;\n2. the idempotent e plays no role in the split case and can be omitted in that case;\n3. the explicit description (13) of e shows that the third condition above is equivalent\nto gcd(p, c̄δF ) = 1 where c̄ is the minimal conductor of F ;\n10\n\n\fPower series expansions of modular forms\n\n4. for a p-ordinary triple (τ, v, e) for Γ1 (∆, N ) the point x ∈ X1 (∆, N ) represented by\nτ is a smooth point in X1 (O(v) ). This is clear for D split and follows for instance\nfrom [22, T heorem 1.1] in the non-split case.\nProposition 1.9. Let p be an odd prime number, gcd(p, N ∆) = 1. There exist split\np-ordinary triples for Γε (∆, N ).\nProof. Since any two positive involutions (4) are conjugated in D, up to a different\nchoice of maximal order we are reduced to the Hashimoto model. Up\n\u0010 to\u0011 replacing po in\n(6) in its congruence class modulo 8N ∆p, we may assume also that ppo = 1. Thus the\nsubfield F = Q ⊕ Qj ⊂ DH is pointwise fixed by the involution, has discriminant prime\n√\nto p and p splits in it. Finally, the minimal conductor of the embedding po 7→ j ∈ F\nis prime to p since j ∈ RH,N .\nThe decomposition D = K ⊕ Ku associated to a choice of τ ∈ CM∆,K is also an\northogonal decomposition under the non-degenerate pairing (x, y)D = tr(xȳ). Note that\nhere u2 > 0 since the norm is indefinite. We shall be concerned with the algebraic group\nof similitudes of (*, *)D , i.e.\nGO(D) = {g ∈ GL(D) such that (gx, gy)D = ν0 (g)(x, y)D for all x, y ∈ D} .\nThe structure of the group GO(D) is well understood, e.g. [12, §1.1], [13, §7]. Let\n ̄ Then GO(D) = GOo (D)⋉ < t >, where\nt ∈ GO(D) be the involution t(d) = d.\no\nGO (D) is the Zariski connected component described by the short exact sequence of\nalgebraic groups\n̺\n1 −→ Gm −→ D× × D× −→ GOo (D) −→ 1\n(14)\n\nwhere Gm is embedded diagonally and ̺(d1 , d2 )(x) = d1 xd−1\n2 . The norm ν restricts to\nNK/Q and −u2 NK/Q on K and Ku respectively, and GO(K)o ≃ GOo (Ku) ≃ RK/Q Gm,K\nwhere the isomorphism is given by left multiplication. Thus, the subgroup of GOo (D)\nthat preserves the splitting D = K ⊕ Ku can be identified with the group\n\b\nG(O(K) × O(Ku))o = (k1 , k2 ) ∈ (RK/Q Gm,K )2 such that NK/Q (k1 k2−1 ) = 1\nand there is a commutative diagram\n\nα\n\nK × × K × −−−−→ G(O(K) × O(Ku))o\n\n\n\n\n×y\ny\n̺\n\n(15)\n\nGOo (D)\n\nD× × D× −−−−→\n\nwhere α(k1 , k2 ) = (k1 k2−1 , k1 k̄2−1 ).\nτ\nWe will normalize the complex coordinates\n√ in D∞ = (K ⊕ Ku) ⊗ R as follows.\nst\nThe standard normalized embedding  : Q( −1) ֒→\n\u0001 fixed point i ∈\u0001 H\n\u0001 M2 (Q) with\ndefines a splitting M2 (R)i = C ⊕ C⊥ with C = R 1 1 ⊕ R 1 −1 and C⊥ = C 1 1 =\n\u0001\n\u0001\nR 1 1 ⊕ R −1 1 . Define standard complex coordinates z1st , z2st in D∞ by the identity\n\u0001\n(16)\nΦ∞ (d) = z1st + z2st 1 1 .\n\nThe R-linear extensions of the embeddings\u0010 st and Φ\u0011∞ ◦  are conjugated in M2 (R),\ny 1/2 sy 1/2\nnamely Φ∞ ◦  = d∞ st d−1\nand τ = s + iy. So we define\n∞ where d∞ =\ny −1/2\nτ\nnormalized coordinates z1 and z2 in D∞ by the identity\n−1\n−1\nzi (d) = zist (Φ−1\n∞ (d∞ )dΦ∞ (d∞ )),\n\n11\n\nfor all d ∈ D∞ , i = 1,2.\n\n\fA. Mori\n\n2\n2.1\n\nSome differential operators\nPreliminaries.\n\nWe briefly review some basic facts about the Kodaira-Spencer map and the Gauss-Manin\nconnection. For more details see [23, 29]. The Kodaira-Spencer class of a composition of\nπ\n∨\nsmooth morphisms of schemes X → S → T is the element in H 1 (X, (Ω1X/S ) ⊗ π ∗ Ω1S/T )\narising from the canonical exact sequence.\n0 −→ π ∗ Ω1S/T −→ Ω1X/T −→ Ω1X/S −→ 0\n\n(17)\n\nby local freeness of the sheaves Ω1 . The Kodaira-Spencer map is the boundary map\nKS : π∗ Ω1X/S −→ R1 π∗ (π ∗ Ω1S/T ) ≃ Ω1S/T ⊗ R1 π∗ OX\nin the long exact sequence of derived functors obtained from (17) by pushing down. Un∨\n∨\nder the natural maps H 1 (X, (Ω1X/S ) ⊗ π ∗ Ω1S/T ) → H 0 (S, R1 π∗ ((Ω1X/S ) ⊗ π ∗ Ω1S/T )) →\n∨\n\nH 0 (S, Ω1S/T ⊗ R1 π∗ OX ⊗ (π∗ Ω1X/S ) ) the Kodaira-Spencer class maps to the KodairaSpencer map.\nq\nThe q-th relative de Rham cohomology sheaf of X/S is defined as HdR\n(X/S) =\nq\n•\nR π∗ (ΩX/S ) (hypercohomology). Following [29], the Gauss-Manin connection\nq\nq\n(X/S).\n∇ : HdR\n(X/S) −→ Ω1S/T ⊗OS HdR\n\n0,q\n1,q\ncan be seen as the differential d0,q\nin the spectral sequence defined by the\n1 : E1 → E1\n•−i\n∗ i\ni •\nfinite filtration F ΩX/T = Im(ΩX/T ⊗OX π ΩS/T −→ Ω•X/T ), with associated graded\n\n∗ i\nobjects gri (Ω•X/T ) = Ω•−i\nX/T ⊗OX π ΩS/T .\nIf X/S = A/S is an abelian scheme with 0-section e0 and dual At /S , denote\nω = ωA/S = π∗ Ω1A/S = e0 ∗ Ω1A/S the sheaf on S of translation invariant relative 1-forms\n1\n1\non A. The first de Rham sheaf HdR\n= HdR\n(A/S) is the central term in a short exact\nsequence\n1\n0 −→ ω −→ HdR\n−→ R1 π∗ OA −→ 0\n(18)\n\n(called the Hodge sequence). By Serre duality\nHomOS (π∗ Ω1A/S , R1 π∗ (π ∗ Ω1S/T )) ≃ HomOS (ω A/S ⊗ ω At /S , Ω1S/T )\n\n(19)\n\nand the Kodaira-Spencer map can be seen as an element of the latter group. It can be\nreconstructed from the Gauss-Manin connection as the composition\n∇\n\n1\n1\nω A/S ֒→ HdR\n−→ HdR\n⊗ Ω1S/T −→ ω At /S ∨ ⊗ Ω1S/T .\n\n(20)\n\nIn fact, when A/S ≃ At /S is principally polarized, the Kodaira-Spencer map becomes\na symmetric map KS : Sym2 (ω) → Ω1S/T , [9, Section III. 9].\nLet (S ′ , io ) be a smooth closed reduced subscheme of S and consider the commutative\npull-back diagram of T -schemes\ni\n\nX ′ −−−−→\n\n ′\nyπ\ni\n\nX\n\nπ.\ny\n\nS ′ −−−o−→ S\n12\n\n\fPower series expansions of modular forms\n\nSince also π ′ is smooth, we can consider the Kodaira-Spencer class, or map, KS′ attached\nπ′\n\nto the morphisms X ′ → S ′ → T . When X = A is a principally polarized abelian scheme,\n⊗2\n∗\nKS′ ∈ HomOS′ (ω ′ , Ω1S ′ /T ) as in (19), where ω ′ = ω A′ /S ′ = π∗ Ω1A′ /S ′ = e′0 Ω1A′ /S ′ .\nSince i∗ π ∗ Ω1S/T = π ′ ∗ i∗0 Ω1S/T and i∗ ΩX/S ≃ ΩX ′ /S ′ canonically, applying i∗ to (17)\nyields an exact sequence\n∗\n\n0 −→ π ′ i∗0 Ω1S/T −→ i∗ Ω1X/T −→ Ω1X ′ /S ′ −→ 0,\ni\n\n∗\n\n0\nS → T\nhence an element KS∗ ∈ Ext1OX ′ (Ω1X ′ /S ′ , π ′ i∗0 Ω1S/T ). The composition S ′ →\n∗\n∗\ndefines a canonical surjective map π ′ i∗0 Ω1S/T → π ′ Ω1S ′ /T . In the same way, we get a\nsurjective map i∗ Ω1X/T → Ω1X ′ /T . These data define a commutative diagram of OX ′ modules\n\n∗\n\n0 −−−−→ π ′ i∗0 Ω1S/T −−−−→ i∗ Ω1X/T −−−−→ Ω1X ′ /S ′ −−−−→ 0\n\n\n\n\ny\ny\n∗\n\n0 −−−−→ π ′ Ω1S ′ /T −−−−→ Ω1X ′ /T −−−−→ Ω1X ′ /S ′ −−−−→ 0\n\nStandard diagram-chasing shows that KS∗ 7→ KS′ under the canonical map of Ext1\ngroups. The following result follows easily from the definitions.\nProposition 2.1. Let A/S be an abelian scheme with S smooth over T , (S ′ , i0 ) a\nclosed T -smooth subscheme of S and A′ = A ×S S ′ . Let KS : ω ⊗2 → Ω1S/T and\n⊗2\n\nKS′ : ω′ → Ω1S ′ /T be the corresponding Kodaira-Spencer maps. Then KS′ = ι0 ◦ i∗0 KS,\nwhere ι0 : i∗0 Ω1S/T → Ω1S ′ /T is the canonical pull-back map.\n\nLet again X = A be an abelian scheme, and let φ : A → A be an S-isogeny (i. e., a\nsurjective endomorphism such that πφ = π). The pull-back φ∗ Ω•A/T → Ω•A/T respects\nfiltrations. Thus we have maps φ∗ (F i /F j ) → F i /F j for all i ≤ j because the sheaves\nF i are locally free. In particular, there is a map of short exact sequences\n0 −−−−→ φ∗ grp+1 −−−−→ φ∗ (F p /F p+2 ) −−−−→ φ∗ grp −−−−→ 0\n\n\n\n\n\n\ny\ny\ny\n\n0 −−−−→\n\ngrp+1\n\n−−−−→\n\nF p /F p+2\n\n−−−−→\n\ngrp\n\n−−−−→ 0\n\nwhere the bottom row is the tautological exact sequence of graded objects and the top\nrow is obtained applying φ∗ to it (again, it remains exact because the sheaves are locally\nfree). Since φ is surjective, π∗ φ∗ = π∗ as functors and the previous diagram yields a\nmap of derived functors long exact sequences\n. . . −−−−→ Rp+q π∗ grp −−−−→ Rp+q+1 π∗ grp+1 −−−−→ . . .\n\n\n[φ]\n[φ]\ny p,q\ny p+1,q\n\n(21)\n\n. . . −−−−→ Rp+q π∗ grp −−−−→ Rp+q+1 π∗ grp+1 −−−−→ . . .\n\nProposition 2.2. Let A/S be an abelian scheme with S smooth over T . The algebra\nq\nEndS (A) acts linearly on the sheaves HdR\n(A/S). If φ ∈ EndS (A) acts as [φ], then\n∇ ◦ [φ] = (1 ⊗ [φ])∇.\n13\n\n\fA. Mori\n\nq\nProof. Let φ ∈ EndS (A) be an isogeny. The endomorphism [φ] of HdR\n(A/S) attached to φ is the vertical map [φ]0,q in diagram (21) at Rq π∗ gr0 . Under the idenq+1\n1\nπ∗ (Ω•−1\ntification Rq+1 π∗ gr1 = Rq+1 π∗ (π ∗ Ω1S/T ⊗OA Ω•−1\nA/T ) =\nA/T ) = ΩS/T ⊗OS R\nq\n1\nΩS/T ⊗OS HdR (A/S) the Gauss-Manin connection is the connecting homomorphism\nfor the tautological exact sequence of graded objects, i.e. either horizontal connecting\nhomomorphism in (21) at p = 0 and also [φ]1,q = 1 ⊗ [φ]0,q since φ acts trivially on S.\nThe formula follows.\nLet s ∈ S be a geometric point and As the fiber at s. Without loss of generality we\nmay assume that S is connected and Grothendieck's rigidity lemma [35] implies that\nthe canonical map EndS (A) → End(As ) is injective. It follows that there exist division\nalgebras D1 , . . . , Dt such that EndS (A) is identified to a subring of Mn1 (D1 ) × * * * ×\nMnt (Dt ). The latter algebra is spanned over Q by the invertible elements, so the result\nfollows by linearity.\n\n2.2\n\nComputations over C\n\nIn order to compute explicitely the Kodaira-Spencer map for a complex family, i.e. when\nT = Spec(C), it is more convenient to appeal to GAGA principles, work in the analytic\ncategory and follow [25, 11]. If A/S is a principally polarized family of abelian varieties\nover the smooth complex variety S and U ⊂ S is an open set, the choice of a section\n∨\nσ ∈ H 0 (U, (Ω1S ) ) defines a map ̺σ : H 0 (U, ω) → H 0 (U, ω∨ ) by the composition\n∇\n\n1⊗σ\n\n̺\n\n1\n1\n1\n) → H 0 (U, ω∨ ),\n) → H 0 (U, HdR\n⊗ Ω1S/T ) → H 0 (U, HdR\nH 0 (U, ω) ֒→ H 0 (U, HdR\n1\n1\nwhere ̺ is induced by the polarization pairing h*, *idR : HdR\n⊗ HdR\n→ OS . The associa∨\n1\n∨\ntion σ 7→ ̺σ defines a map (ΩS/T ) → Hom(ω, ω ) whose dual is the Kodaira-Spencer\nmap KS. By étale-ness, the actual computation of the map KS can be obtained applying\nthe above procedure to the pullback of the family A/S on the universal cover of S. For\ninstance, for the universal family (7)\n\nKS(dζ ⊗2 ) =\n\n1\ndz.\n2πi\n\n(22)\n\nwhere ζ is the standard complex coordinate in the elliptic curve Ez = C/Z ⊕ Zz, z ∈ H.\nWe follow this approach to compute the Kodaira-Spencer map for the universal\ncomplex family of QM abelian surfaces over XΓ using the Shimura family ASh /H of (8)\nin terms of the arithmetic of the maximal order R1 . Let r = {r1 , . . . , r4 } be a symplectic\nbasis of R1 . By linear extension, the real dual basis {r1 ∨ , . . . , r4 ∨ } of D∞ ∨ is a basis\n1\nz\nof Hom(R1 ⊗Z C, C) ≃ HdR\n(D∞\n/R1 ). Thus, the elements r1 ∨ , . . . , r4 ∨ define global\n1\nC ∞ -sections of HdR\n(ASh /H) with constant periods, hence ∇-horizontal. If H denotes\n1\nthe C-span of these sections, there is an isomorphism HdR\n(ASh /H) = H ⊗C OH . In\nterms of this trivialization, ∇ = 1 ⊗ d, where d is the exterior differentiation. Also,\nhri ∨ , rj ∨ idR =\n\n1\nBt (rj , ri ),\n2πi\n\ni, j = 1, . . . , 4,\n\n(23)\n\nwhere the 2πi factor accounts for the difference of Tate twists between singular and algebraic de Rham cohomology, e. g. [5, §1]. Let ζ1 and ζ2 denote the standard coordinates\nin C2 .\n\u0001\n1 0\n1\nProposition 2.3. (KS(dζi ⊗ dζj ))i,j=1,2 = 2πi\n0 ∆ dz.\n14\n\n\fPower series expansions of modular forms\n\nProof. Write\n\u0012\n\ndζ1\ndζ2\n\n\u0013\n\n\nr1 ∨\n\n\n= Πr (z)  ... \nr4 ∨\n\n\nwhere Πr (z) is the period matrix computed in terms of the basis r. Using (23) and the\ndefinitions we first obtain\n\n\nr1\n\u0013\n\u0012\n\u0013\n\u0012\n1 dΠr (z)\n0\nI2  . \ndζ1\n=\n̺σ\n ..  σ(dz),\n−I\n0\ndζ2\n2πi dz\n2\nr4\n\nand finally\n\n(KS(dζi ⊗ dζj ))i,j=1,2 =\n\n1 dΠr (z)\n2πi dz\n\n\u0012\n\n0\n−I2\n\nI2\n0\n\n\u0013\n\nt\n\nΠr (z) dz.\n\nTo obtain the final formula, we make use of the Hashimoto model with N = 1. In terms\nof the symplectic basis η = {η1 , . . . , η4 } of theorem 1.1\n\n ̟−\n1 +\n+\n+\n√1\n√\n2 po (α a∆z + 1) − po (α a∆z + 1) z\n2α z\n\n\n(24)\nΠη (z) = \n\n+\nα\n1 −\n√ a∆(z − α− )\n√1 ∆(−z + α− a)\n1 2α\n2 po\npo\nwhere α± = 1 ±\n\n2.3\n\n√\npo . Plugging these values into the previous formula yields the result.\n\nMaass operators.\n\nWhen D is split. the universal family (7) defines the line bundle ω = ωEN /Y1 (N ) on\nthe Zariski open set Y1 (N ) complement of the cusp divisor C in X1 (N ). The Kodaira∼\nSpencer map KS : ω⊗2 → Ω1Y1 (N ) is an isomorphism.\nTheorem 2.4. The line bundle ω extends uniquely to a line bundle, still denoted ω, on\nthe complete curve X1 (N ) and the Kodaira-Spencer isomorphism extends to an isomorphism\n∼\nKS : ω ⊗2 −→ Ω1X1 (N ) (log C).\nProof. See [24] and also [28, section 10. 13] where the extension property is discussed\nfor a general representable moduli problem.\nIf D is not split, the universal family (9) of QM-abelian surfaces defines the sheaf\nω = ωA∆,N /X1 (∆,N ) and the Kodaira-Spencer map is a surjective map KS: Sym2 ω →\nΩ1X1 (∆,N ) .\nLet p be a prime such that (p, N ∆) = 1 and let v be a place of a number field\nL dividing p. The algebra R1 ⊗Z Ov acts contravariantly and Ov -linearly on ωv =\nω ⊗ Ov by pull-back. For any geometric point s ∈ X1 (∆, N ) ⊗ Ov and any non-trivial\nidempotent e ∈ R1 ⊗Z Ov there is a non-trivial decomposition H 0 (As , Ω1As /k(s) ) =\neH 0 (As , Ω1As /k(s) ) ⊕ (1 − e)H 0 (As , Ω1As /k(s) ). Therefore the subsheaf eωv is a line subbundle. Let eωv ◦ e† ω v ⊆ Sym2 ω v be the line bundle image of eωv ⊗ e† ω v under the\n2\nnatural map ω ⊗2\nv → Sym ω v .\n15\n\n\fA. Mori\n\nTheorem 2.5. If p, v and e are as above, then the Kodaira-Spencer map defines an\nisomorphism\nKS : eωv ⊗ e† ω v −→ Ω1X1 (∆,N )/Ov\n\nof line bundles on X1 (∆, N ) defined over Ov .\n\nProof. We claim that the action of r ⊗ λ ∈ R1 ⊗ Ov on the universal family (9)\nbase-changed to Ov gives rise to a commutative diagram\nωv −−−−→ Ω1X1 (∆,N )/Ov ⊗ ωv ∨\n\n\n\n †\nyr⊗λ\ny1⊗r ⊗λ\n\n(25)\n\nωv −−−−→ Ω1X1 (∆,N )/Ov ⊗ ωv ∨\nIndeed, under the Serre duality identification R1 π∗ OA ≃ ω A/S ∨ for a principally polarized abelian scheme A/S the actions of EndS (A) correspond up to Rosati involution.\nThe commutativity of the diagram (25) follows from proposition 2.2 and (20).\nFor an idempotent e ∈ R1 ⊗Z Ov , diagram (25) defines a map eω v → Ω1 ⊗ e† (ω v ∨ )\nwhich can be shown to be an isomorphism by the same deformation theory argument\nin [8, Lemma 6]. This is enough to conclude, because the sheaves e† (ω v ∨ ) and e† ω v are\ndual of each other.\nRemarks 2.6.\n1. We proved theorem 2.5 for p-adically complete rings of scalars. In\nfact the projectors onto the quadratic subfields of D are defined over the p-adic\nlocalizations of their rings of integers for almost all p. Thus, in these cases, eω\nand the Kodaira-Spencer isomorphism are defined over the subrings O(v) ⊂ C.\n2. If the e′ = ded−1 are conjugated in R1 ⊗ B for some ring B, then the action of d\non ω ⊗ B defines an isomorphism of eω with e′ ω over B.\n3. In the complex case the isomorphism of theorem 2.5 can be checked by a straightforward application of the computation in section 2.2. For instance, in the Hashi2\nmoto model for N = 1 of theorem 1.1 let d = ai\n√+ bj + cij ∈ DH with δ = d =\n2\n2\n2\n−a ∆ + b po + c ∆po ∈ Q and let e ∈ D ⊗Q Q( δ) be the idempotent giving the\nprojection onto Q(d). Then\n\u0012 √\n√\n√ \u0013\n1\nδ + b po √\n−a + c po\ne= √\n√\n√\nδ − b po\n(a + c po )∆\n2 δ\nand\n\n1\ne = √\n2 δ\n†\n\n\u0012\n\n√\n\n\u0013\n√\n√\nδ + b po\na + c po\n√\n.\n√\n√\nδ − b po\n(−a + c po )∆\n\nTherefore eω ◦ e† ω is generated over H by the global section\n√\n√\n√\n√\n√\n( δ + b po )2 dζ1 ◦ dζ1 + (c2 po − a2 )dζ2 ◦ dζ2 + 2( δ + b po )c po dζ1 ◦ dζ2\nwhose image under the Kodaira-Spencer map KS is, by proposition 2.3,\n1 √\n√\n( δ + b po )dz ∈ Γ(H, Ω1H ).\nπi\n\n(26)\n\nSince δ 6= po b2 (else po = (a/c)2 ∈ Q which is impossible) the section (26) does\nnot vanish and the Kodaira-Spencer map is an isomorphism.\n16\n\n\fPower series expansions of modular forms\n\nNotation 2.7. We will denote L either the line bundle ω v on Y1 (N ) or the line bundle\neωv on X1 (∆, N ) for some choice of idempotent e satisfying the hypotheses of theorem\n2.5 and such that e† = e. In either case the Kodaira-Spencer map gives an isomorphism\n∼\n\nKS : L⊗2 −→ Ω1 .\nWith an abuse of notation we will denote also L the pullback of the complexified bundle\nto H under the natural quotient maps.\n\u0001\n\u0001\n\u0001\n−1\nIf γ ∈ Γ1 (∆, N ) the identities Z2 γ*z\n= j(γ, z) Z2 z1 and Φ∞ (R1 ) γ*z\n=\n1\n1\n\u0001\nj(γ, z)−1 Φ∞ (R1 ) z1 as subsets of C (in the split case) and of C2 (in the non-split\ncase) respectively, show that the natural action of Γ1 (∆, N ) on ω over H is scalar multiplication by the automorphy factor. Thus the Γ1 (∆, N )-action extends to a SL2 (R)homogeneous structure on ω, and on Sym2 (ω) as well. Also, in the non-split case the\nfiber identifications induced by the action are D ⊗ C-contravariant and since the line\nbundle L is defined using the D action on ω, it is an homogeneous line subbundle of\nSym2 (ω).\nLet n ∈ Z and let Vn be the 1-dimensional representation of C× given by the character\nχn (z) = z n . Let Vn = Vn × H the homogeneous line bundle on H with action g * (v, z) =\n(χn (j(g, z))v, g * z). Since −1 ∈\n/ Γ1 (∆, N ) and Γ1 (∆, N ) has no elliptic elements, the\nquotient Γ1 (∆, N )\\Vn is a line bundle on X1 (∆, N ) which we shall denote Vn again.\nPick vn ∈ Vn , vn 6= 0, and let ṽn = (vn , z) be the corresponding global constant section\nof Vn over H. Also, let s(z) be the global section of L over H, defined up to a sign,\nnormalized so that\nKS(s(z)⊗2 ) = 2πi dz.\n(27)\nThen L⊗k = OH s(z)⊗k for all k ≥ 1 and there are identifications of homogeneous\ncomplex line bundles over both H and X1 (∆, N )\n∼\n\nV2 −→ Ω1 , ṽ2 7→ 2πi dz\n\nand\n\n∼\n\n⊗k\n\nVk −→ L⊗k , ṽk 7→ s(z)\n\n.\n\n(28)\n\nThese identifications preserve holomorphy and are compatible with tensor products and\nthe Kodaira-Spencer isomorphisms. Note that s(z) = ±2πi dζ in the split case by (22),\nand see remark 2.6.3 for the non-split case.\nFollowing [25], we shall define differential operators associated to splittings of the\nHodge seguence (18) where A/S is either the universal elliptic curve EN /Y1 (N ) or the\nuniversal QM-abelian surface A∆,N /X1 (∆, N ).\nOver the associated differentiable manifold, which amounts to tensoring with the\nsheaf of OS -algebras OS∞ = C ∞ (S an ) and which will be denoted with an ∞ subscript,\n1\nthe Hodge decomposition H∞\n= ω ∞ ⊕ ω ∞ is a splitting of the Hodge sequence with\n1\nprojection Pr∞ : H∞ → ω∞ . For each k ≥ 1, let Θok,∞ be the operator defined by the\ncomposition\n1⊗KS−1\n\n∇\n\n1\n1\n1\n)∞ ⊗ Ω1 −−−−−→ Symk (HdR\n)∞ ⊗ L∞\nSymk (ω ∞ ) ⊂ Symk (HdR\n)∞ −−−−→ Symk (HdR\n\n ⊗k\nyPr∞ ⊗1\n\nSymk (ω)∞ ⊗ L∞\n(29)\nwhere the Gauss-Manin connection ∇ extends to Symk by the product rule. The composition L⊗k ⊂ ω ⊗k → Symk (ω) is injective and let Θk,∞ be the restriction of Θok,∞ to\nL⊗k\n∞ .\n17\n\n\fA. Mori\n\n⊗k+2\nProposition 2.8. Θk,∞ is an operator L⊗k\n∞ → L∞\n\nProof. If D is split then L⊗k = ωk = Symk (ω) and there is nothing to prove. If\nD is non-split, the element e⊗k ∈ (R1 ⊗Z O(v) )⊗k acting componentwise defines a\nprojection ω ⊗k → L⊗k which factors through Symk (ω). By proposition 2.2 the GaussManin connection ∇ commutes with e⊗k and also the Hodge projection Pr∞ is the\nidentity on L∞ (in fact on ω∞ ). The result follows.\nThe operators Θk,∞ can be computed in terms of the complex coordinate z = x+iy ∈\nH and the identifications (28). For any (say C ∞ ) function φ on H let\n\u0012\n\u0013\nd\nk\n1\nφ.\n+\nδk (φ) =\n2πi dz\n2iy\nThe operator δk was introduced, together with its higher dimensional analogues by\nMaass [31] and later extensively studied by Shimura (see [18, Ch. 10] and the references\ncited therein).\nProposition 2.9. There are commutative diagrams of C ∞ -bundles and differential operators\n∼\nVk −−−−→ L⊗k\n\n\nΘ\ne\ny k,∞\nyδk\n∼\n\nwhere δen (φṽn ) = δn (φ)ṽn+2 .\n\nVk+2 −−−−→ L⊗k+2\n\nProof. The diagram for D split is but the simplest case (dimension 1) of [11, theorem 6.5]. The computation in the non-split case is very similar. Let s be the KSnormalized section of L as in (27), η = {η1 , . . . , η4 } be Hashimoto's symplectic basis of\ntheorem 1.1 and Π = Πη (z) the period matrix as in (24). Since the sections η1 ∨ , . . . , η4 ∨\nare ∇-horizontal,\n\n\n\n\n ∨ \n\n−1\n\n\ndζ1\ndζ1\nη1\nΠ\ndζ1\n\n\n\n\n. \n  dζ2  = (I2 , −I2 )  dζ2  ⊗ dz.\n = dΠ \n∇\n ..  = dΠ\n dζ̄1 \n\ndζ̄1 \nz − z̄\ndζ2\nΠ\nη4 ∨\ndζ̄2\ndζ̄2\n\n\u0011\n+ s0 ⊗ dz with Pr∞ (s0 ) = 0.\n\u0011\n\u0010\n⊗k\n⊗k−1\ns\n⊗\ndz\n+\nkφs\n∇(s)\nyields\nPlugging this into Θk,∞ (φs⊗k ) = Pr∞ (1 ⊗ KS−1 ) dφ\ndz\nthe result.\nSince s is in the C-span of dζ1 and dζ2 , ∇(s) =\n\n\u0010\n\n1\nz−z̄ s\n\nLet B be a p-adic algebra with (p, ∆N ) = 1 and such that the e is defined over\nB and the isomorphism of theorem 2.5 holds for the sheaves base-changed to B. Let\nO(p) be the structure sheaf of the formal scheme S (p) = lim (S ⊗ B/pn B)p−ord obtained\n←n\n\ntaking out the non-ordinary points in characteristic p. Denote M(p) the tensorization\nwith O(p) of the restriction to S (p) of a sheaf M.\nIn the split case the Dwork-Katz construction [24, §A2.3] of the unique Frobenius1\n1\nstable ∇-horizontal submodule U ⊂ HdR\n⊗ B defines a splitting (HdR\n)(p) = ω(p) ⊕ U\n1 (p)\n(p)\nwith projection Prp : (HdR ) → ω . The construction can be carried out in the non\nsplit case as well. If B ′ is a B-algebra and AB ′ is is a QM-abelian surface with ordinary\n18\n\n\fPower series expansions of modular forms\n\nreduction and canonical subgroup H (which, by ordinarity, is simply the Cartier dual of\nthe lift of the kernel of Verschiebung–an ètale group), then H ⊂ A[p] with A[p]/H lifting\nan ètale group and for every φ ∈ End(A), φ(H) ⊆ H by connectedness. Thus A/H is a\nQM-abelian surface with a canonical embedding R1 ֒→ End(A/H) and the construction\n1 (p)\nof the Frobenius endomorphism of (HdR\n) and its splitting follows. Assuming that the\nline bundle L is defined over B and following the same procedure as in (29) with the\nprojection Pr∞ replaced by Prp yields a differential operator\nΘok,p : Symk (ω (p) ) −→ Symk (ω (p) ) ⊗ L(p) .\nLet Θk,p be its restriction to (L⊗k )(p) .\nProposition 2.10. Θk,p is an operator (L⊗k )(p) → (L⊗k+2 )(p) .\nProof. The argument is the same as in the proof of proposition 2.8. The action of the\nendomorphisms commutes with the pullback of forms in the quotient A → A/H and\nso with the Frobenius endomorphism. Since U is Frobenius-stable, the endomorphisms\ncommute with the projection Prp .\nLet ∗ ∈ {∞, p}. The operators Θk,∗ can be iterated. For all r ≥ 1 let\n(r)\n\nΘk,∗ = Θk+2r−2,∗ ◦ * * * ◦ Θk,∗ .\nSince the kernel of the projecton Pr∗ is ∇-horizontal one has in fact\n\u0001r\n(r)\nΘk,∗ = Pr∗ (1 ⊗ KS−1 )∇ .\n\n(r)\n\n(30)\n\nThe operators Θk,∞ do not preserve holomorphy because the Hodge projection Pr∞ is\n(r)\n\nnot holomorphic. Similarly, the operators Θk,p are only defined over p-adically complete\n(r)\n\nring of integers. Nonetheless, the operators Θk,∗ are algebraic over the CM locus, in\nthe following sense. Let x ∈ X1 (∆, N )(O(v) ) be represented by a τ ∈ H belonging to a\np-ordinary test triple (τ, v, e). Let L(x) = x∗ L be the algebraic fiber at x. The choice\nof an invariant form ωo on Ax which generates either H 0 (Ax , Ω1 ⊗ O(v) ) (in the split\ncase) or eH 0 (Ax , Ω1 ⊗ O(v) ) (in the non-split case) over O(v) identifies L(x) with a copy\nof O(v) .\nProposition 2.11. Let x ∈ X1 (∆, N )(O(v) ) be a point represented by a p-ordinary test\ntriple and let ωo be an invariant form on Ax as above. Then, for all r ≥ 1, the operators\n(r)\nΘk,∗ define maps\n(r)\n\nΘk,∗ (x) : H 0 (X1 (∆, N ) ⊗ O(v) , L⊗k ) −→ L⊗k+2r (x) ≃ O(v) ωo ⊗k+2r .\n(r)\n\n(r)\n\nMoreover Θk,∞ (x) = Θk,p (x).\nProof. The result follows, as in [26, theorem 2.4.5], from the following observation. Let\nA be an abelian variety isogenous over O(v) to the g-fold product of elliptic curves with\ncomplex multiplications in the field K and ordinary good reduction modulo v. The CM\n1\nsplitting of the first de Rham group of A is the splitting HdR\n(A/O(v)) = Hσ1 ⊕Hσ2 where\nHσi is the σi -eigenspace under the action of complex multiplications, IK = {σ1 , σ2 }. The\n1\nHodge decomposition HdR\n(A) ⊗ C = H 1,0 ⊕ H 0,1 and the Dwork-Katz decomposition\n0\n1\nHdR (A) ⊗ B = H (A ⊗ B, Ω1 ) ⊕ U for some p-adic O(v)-algebra B are both obtained\n19\n\n\fA. Mori\n\nfrom the CM splitting by a suitable tensoring. The result follows from the algebraicity of\nthe Gauss-Manin connection and the Kodaira-Spencer map, using the expression (30).\nFor all r ≥ 1 write\n(r)\nδk\n\n= δk+2r−2 ◦ * * * ◦ δk =\n\n\u0012\n\n1\n2πi\n\n\u0013r \u0012\n\nd\nk + 2r − 2\n+\ndz\n2iy\n\n\u0013\n\n◦ ***◦\n\n\u0012\n\nd\nk\n+\ndz\n2iy\n\n\u0013\n\n(0)\n\nand set δk (φ) = φ.\n\n3\n3.1\n\nExpansions of modular forms\nSerre-Tate theory.\n\nLet k be any field, (Λ, m) a complete local noetherian ring with residue field k and C the\ne be an abelian variety\ncategory of artinian local Λ-algebras with residue field k. Let A\nover k of dimension g. By a fundamental result of Grothendieck [37, 2.2.1], the local\nmoduli functor M : C → Sets which associates to each B ∈ Ob C the set of deformations\ne to B, is pro-represented by Λ[[t1 , . . . , tg2 ]]. When k is perfect of characteristic p > 0\nof A\ne is equivalent to deforming its\nand Λ = Wk is the ring of Witt vectors of k, deforming A\nformal group, as precised by the Serre-Tate theory [27, §2]. If k is algebraically closed\ne is ordinary, an important consequence of the Serre-Tate theory is that there is a\nand A\ncanonical isomorphism of functors\n∼\n\nb m ),\net , G\ne ⊗ Tp A\nM −→ Hom(Tp A\n\n[27, theorem 2.1]. Write M = Spf(Ru ) with universal formal deformation Au over Ru .\nThe isomorphism endows M with a canonical structure of formal torus and identifies its\net . Denote\ne ⊗ Tp A\nb m ) ⊂ Ru with the group Tp A\ngroup of characters X(M) = Hom(M, G\net . For a deformation A/B of A\ne with\ne ⊗ Tp A\nqS the character corresponding to S ∈ Tp A\nb let\n(B, mB ) ∈ Ob C,\nb m (B) = 1 + mB\net −→ G\ne × Tp A\nq(A/B ; *, *) : Tp A\n\nbe the corresponding bilinear form. When k is not algebraically closed, the group\nstructure on M ⊗ k descends to a group structure on M, for the details see [36, 1.1.14].\nLet N ⊂ M be a formal subgroup and ρ : X(M) → X(N ) the restriction map. The\nZp -module N = ker(ρ) is called the dual of N . Via Serre-Tate theory, N ⊆ Tp A ⊗ Tp At .\nThen\n!\ne ⊗ Tp A\net\nTp A\n∼\nbm\nN −→ Hom\n,G\nN\nand\n\nN is a subtorus of M\n\n⇐⇒ X(N ) ≃ X(M)/N is torsion-free\net .\ne ⊗ Tp A\n⇐⇒ N is a direct summand of Tp A\n\nTo simplify some of the next statements, we shall henceforth assume that p > 2.\n20\n\n\fPower series expansions of modular forms\n\ne→B\ne be a morphism of ordinary abelian varieties over k.\nProposition 3.1. Let fe: A\nThe morphism fe lifts to a morphism f : A → B of deformations over B if and only if\nq(A/B ; P, fet (Q)) = q(B/B ; fe(P ), Q)\n\ne\ne and Q ∈ Tp B.\nfor all P ∈ Tp A\n\ne is principally polarized, the formal subscheme Mpp that classifies\ne λ)\nIn particular, if (A,\ne with a lifting λ of the principal polarization is a subtorus whose group\ndeformations of A\nof characters is\ne\nX(Mpp ) = Sym2 (Tp A).\n\nProof. The first part of the statement is [27, 2.1.4]. For the second part, the principal\ne identifies Tp A\net . For a deformation A/B let q ′ (A/B ; P, P ′ ) =\ne ≃ Tp A\npolarization λ\n′\ne\ne\nq(A/B ; P, λ(P )). Then λ lifts to A if and only if q ′ is symmetric, and the submodule\nof symmetric maps is a direct summand.\nThe last part of the proposition can be rephrased by saying that there is a commutative diagram\n∼\net −−−\ne ⊗ Tp A\n−→ X(M)\nTp A\n\n\n\npolarization \ny\nyrestriction\n+ quotient\n∼\ne −−−\n−→ X(Mpp )\nSym2 (Tp A)\n\net respece and of Tp A\nConcretely, if {P1 , . . . , Pg } and {P1t , . . . , Pgt } are Zp -bases of Tp A\n2\nu\nt\nu\ntively, the g elements qi,j = q(A/Ru ; Pi , Pj ) − 1 define an isomorphism R ≃ Wk [[qi,j ]].\ne is principally polarized we may take Pi = P t under the identification Tp (A)\ne ≃\nIf A\ni\nt\npp\npp\ne\nTp (A ). Then qi,j = qj,i on M = Spf(R ) and\npp\n]],\nRpp ≃ Wk [[qi,j\n\npp\n= qi,j |Mpp , 1 ≤ i ≤ j ≤ g.\nwith qi,j\n\nMore generally, if N = Spf(RN ) is a subtorus with n = rkZp (N ), a Zp -basis {S1 , . . . , Sn }\net . If qi =\ne ⊗ Tp A\nof N can be completed to a basis {S1 , . . . , Sn , Sn+1 , . . . , Sg2 } of Tp A\nN\nN\nN\nu\nqSi (A/Ru ) − 1 and qi = qi |N , then q1 = . . . = qn = 0 by construction and RN =\nN\nWk [[qn+1\n, . . . , qgN2 ]].\n∼\net →\nbG\nb m ) for\ne is ordinary, there is a canonical isomorphism Tp A\nHomB (A,\nSince A\ne\nany deformation A/B of A. Composition with the pulling back the standard invariant\net → ω\nb m yields a functorial Zp -linear homomorphism ω : Tp A\nform dT /T on G\nA/B which\nis compatible with morphisms of abelian schemes, in the sense that if the morphism\ne→B\ne of abelian varieties over k then, [27, lemma\nf : A → B lifts the morphism fe: A\n3.5.1],\net.\n(31)\nf ∗ (ω(P t )) = ω(fet (P t )),\nfor all P t ∈ Tp B\nBy functoriality, the maps ω extend to a well-defined Zp -linear homomorphism\net → ωAu /M .\nω u : Tp A\n∼\n\net ⊗ OM → ω u\nwhose Ru -linear extension Tp A\nA /M is an isomorphism. Thus, a choice of\nL\nsh\nt\nt\nt\ne yields an identification ω u\na Zp -basis {P , . . . , P } of Tp A\n= ( g Ru ωi ) where\n1\n\nA /M\n\ng\n\ni=1\n\nωi = ω u (Pit ), i = 1, . . . , g and the superscript ( )sh denotes the sheafified module.\ne is principally polarized. Let N ⊂ Mpp be a subtorus with dual\nSuppose that A\nN and let AN be the restriction over N of the universal deformation Au /M. Let\n21\n\n\fA. Mori\n\ne such that N =\net ) = Sym2 (Tp A)\n{S1 , . . . , S g(g+1) } be a Zp -basis of Sym2 (Tp A\n(2)\n\n2\n\nLn\n\nj=1\n\nZp Sj .\n\nLet ωi the pullback to AN of Sym2 (ω u )(Si ), qipp and qiN be the restriction of the local\nparameters qSi constructed above, i = 1, . . . , g(g + 1)/2.\nProposition 3.2.\n(2)\n\nKSN (ωi ) =\n\n\u001a\n\n0\nd log(qipp + 1)|N\n\nfor i = 1, . . . , n\nfor i = n + 1, . . . , g(g + 1)/2\n\nProof. It is an immediate application of proposition 2.1 to Katz's computations [27, the\u0011sh\n\u0010L\n(2)\ng(g+1)/2\norem 3.7.1], because there are identifications Sym2 (ω AN /N ) =\n,\nRN ω i\ni=1\n\u0010L\n\u0011sh\n\u0011sh\n\u0010L\ng(g+1)/2\ng(g+1)/2\nΩ1Mpp /W =\nRpp dqipp , Ω1N /W =\nand dqiN = 0 for\nRN dqiN\ni=1\ni=n+1\ni = 1, ..., n.\nElliptic curves and false elliptic curves. Let (τ, v, e) be a split p-ordinary test\ntriple and denote A the corresponding CM curve (if D is split) or principally polarized\ne its reduction modulo p. Of the two\nQM-abelian surface (if D is non split) with A\ne ⊗ Qp coincide with\nembeddings K ֒→ Qp , fix the one that makes the K action on Tp A\nits natural Qp -vector space structure.\ne If D is split, everything\nLet M be the local moduli functor corresponding to A.\npp\nhas been already implicitely described: M = M is a 1-dimensional torus and Rpp =\ne Also, if ωu = ω u (P ) then\nRu = W [[q − 1]] with q = qP ⊗P for a Zp -generator P of Tp A.\n2\n⊗2\nu\n⊗2\nωu = Sym (ω )(P ◦ P ) and KS(ωu ) = d log(q).\nIf D is non-split, let N = ND be the subfunctor\n)\n(\ne with a lift of\nprincipally polarized deformations A/B of A\nND (B) =\nthe endomorphisms given by elements of the maximal order R1\ne and since e ∈ R1 ⊗ Zp we can find a\nThe maximal order R1 acts naturally on Tp A\ne\nZp -basis {P, Q} of Tp A such that eP = P and eQ = 0.\nProposition 3.3.\n\n1. N = Spf(RN ) is a 1-dimensional subtorus of Mpp ;\n\n2. RN = Wk [[q − 1]], where q = qPN◦P ;\n3. if ωu denotes the pullback of ω u (P ) to AN , then KS(ωu⊗2 ) = d log(q).\nProof. It follows from proposition 3.1 that N (B) is identified with the set of the\ne→G\nb m (B) such that q(P, r† Q) = q(rP, Q) for all\ne × Tp A\nsymmetric bilinear forms q : Tp A\nr ∈ R1 . This makes clear that N is a subgroup, and that its dual N is the Zp -submodule\ngenerated by the elements\n\u001a\nP1 ⊗ P2 − P2 ⊗ P1\ne and r ∈ R1 .\nfor all P1 , P2 ∈ Tp (A)\nrP1 ⊗ P2 − P1 ⊗ r† P2\n\nChoose u in the decomposition (11) for the subfield F ⊂ D so that u ∈ R1 , u† = −u\nand |ν(u)| is minimal. In particular u2 = −ν(u) is a square-free integer. Pick a basis\nof D in R1 of the form {1, r, u, ru} with r2 ∈ Z. From our choice of test triple we can\nassume that Z[r] is an order in F of conductor prime to p, in particular p does not\n22\n\n\fPower series expansions of modular forms\n\ndivide r2 . The submodule R = Z ⊕ Zr ⊕ Zu ⊕ Zru is actually an order of discriminant\n−16r4 u4 such that R† = R.\nSuppose that p|u2 and let y = p1 (a + br + cu + dru) with a, b, c and d ∈ Z be an\nelement in R1 −R such that ȳ = y+R generates the unique subgroup of order p in R/R1 .\nThe conditions tr(y) ∈ Z, ν(y) ∈ Z, and ȳ † = ±ȳ easily imply that the coefficients a, b,\nc and d are all divisible by p and this is a contradiction. Thus R ⊗ Zp = R1 ⊗ Zp and\nthis reduces the set of generators for N to\nP ⊗Q−Q⊗P\nrP ⊗ Q − P ⊗ rQ\nuP ⊗ P + P ⊗ uP\n.\nuP ⊗ Q + P ⊗ uQ uQ ⊗ Q + Q ⊗ uQ ruP ⊗ Q − P ⊗ ruQ\nFrom the relations re = er and ue = (1 − e)u\u0010 in R1\u0011 ⊗ Zp \u0010we get\n\u0011 that the elements r\nα 0\n0β\nand u act on the basis {P, Q} as the matrices 0 −α and γ 0 respectively. Since α,\nβ and γ are p-units, finally N turns out to be the Zp -module generated by\nP ⊗ Q − Q ⊗ P,\n\nγP ⊗ P + βQ ⊗ Q,\n\nP ⊗Q+Q⊗P\n\nand\ne = N ⊕ Zp (P ⊗ P ).\ne ⊗ Tp A\nTp A\n\nThis proves points 1 and 2, and the last part follows at once from proposition 3.2.\nRemark 3.4. The fact that N is actually a subtorus can be reinterpreted, as in [36],\nin the more general context of Hodge and Tate classes.\n\n3.2\n\nPower series expansion\n\nWe shall now use the Serre-Tate theory to write a power series expansion around an\nordinary CM point of a modular form f ∈ Mk,1 (∆, N ) and compute the coefficients of\nthis expansion in terms of the Maass operators studied in section 2.3. We assume that\nN > 3.\nLet SpD the full subcategory of the category of rings consisting of the rings B such\nthat R1 ⊗B ≃ M2 (B). Note that if (τ, v, e) is a p-ordinary test triple, then Ov ∈ ObSpD .\nFor a KS-normalized section s(z) in (27) the assignment\nf (z) 7→ f ∗ (z) = f (z)s(z)⊗k\n\n(32)\n\nsets up an identification\nMk,1 (∆, N ) ≃ H 0 (X1 (∆, N ), L⊗k )\ndefined up to a sign (the ambiguity obviously disappears for k even). The identification\n∞\nextends naturally to an identification of the bigger space Mk,ε\n(∆, N ) of C ∞ -modular\n∞\nforms with the global sections of the associated C -bundle L⊗k\n∞ . This \"geometric\"\ninterpretation of modular forms can be used to endow the space Mk,1 (∆, N ) with a\ncanonical B-structure for any subring B ⊂ C of definition for L in SpD . In fact for any\nring B in SpD such that L is defined over B the space of modular forms defined over\nB may be defined as\nMk,1 (∆, N ; B) = H 0 (X1 (∆, N ) ⊗ B, L⊗k ).\n23\n\n\fA. Mori\n\nRemark 2.6.2 shows that this B-structure does not depend on the choice of L, i.e. on the\nchoice of idempotent e. If B ′ is a flat B-algebra, the identification Mk,1 (∆, N ; B)⊗ B ′ =\nMk,1 (∆, N ; B ′ ) follows from the usual properties of flat base change. By smoothness,\nif 1/N ∆ ∈ B ⊂ C then Mk,1 (∆, N ; B) ⊗ C = Mk,1 (∆, N ; C) = Mk,1 (∆, N ). In fact\nthe assignment (32) is normalized so that f ∈ Mk,1 (N ; B) if and only if its Fourier\ncoefficients belong to B (q-expansion principle, e.g. [24, Ch. 1] [11, theorem 4.8]).\nLet A/X be either universal family (7) or (9). Let x ∈ X (O(v) ) be represented by\na point τ ∈ CM∆,K in a split p-ordinary test triple (τ, v, e). Denote Ax the fiber of\nA/X over x and Aτ the corresponding complex torus. We will implicitely identify the\nring Wk(v) of Witt vectors for the algebraic closure of k(v) with Ovnr . For each n ≥ 0,\nbX ,x. By smoothness, there is a nonlet Jx,n = OX ,x /mn+1\nand Jx,∞ = lim Jx,n = O\nx\n←n\n\ncanonical isomorphism Jx,∞ ≃ O(v) [[u]]. For n ∈ N ∪ {∞} the family A/X restricts to\nabelian schemes Ax,n/Jx,n . Tautologically Ax = Ax,0 , and Ax,n = Ax,∞ ⊗ Jx,n with\nnr\nb vnr and\nrespect to the canonical quotient map Jx,∞ → Jx,n . Also, let Jx,n\n= Jx,n ⊗O\nnr\nnr\nAx,n = Ax,n ⊗ Jx,n .\nLet M = Spf(R) be either the full local moduli functor (in the split case) or\nits subtorus described in proposition 3.3 (in the non-split case) associated with the\nex = Ax ⊗ k v with universal formal deformation Ax /M. In either case\nreduction A\nb m ) where T is a free Zp -module of rank 1. Since the rings J nr are\nM ≃ Hom(T, G\nx,n\npro-p-Artinian, there are classifying maps\nnr\nφx,n : R −→ Jx,n\n,\n\nfor all n ∈ N ∪ {∞}\n\nnr\nsuch that Anr\nx,n = Ax ⊗φx,n Jx,n . Since the abelian schemes Ax,n are the restriction\nof the universal (global) family, the map φx,∞ is an isomorphism. We will use it to\ntransport the Serre-Tate parameter qS − 1 ∈ R and the formal sections ωu constructed\nin section 3.1 out of a choice of a Zp -generator S of T to the p-adic disc of points in X\nthat reduce modulo pv to the same geometric point in X ⊗ k v . Also, we can pull back\nthe parameter along the translation by x−1 in M to obtain a local parameter ux at x\n(depending on S), namely\nnr\nJx,∞\n= Ovnr [[ux ]],\n\nwith ux = qS (x)\n\n−1\n\nqS − 1.\n\nThe complex uniformization of Ax associated with the choice of τ can be used to define\ntranscendental periods. For any ωo ∈ H 0 (Ax (C), L(x)) write\nωo = p(ωo , τ )s(τ )\n\np(ωo , τ ) ∈ C,\n\nunder the isomorphism Ax (C) ≃ Aτ . For f ∈ Mk,1 (∆, N ) define complex numbers\n(r)\n\nc(r) (f, x, ωo ) =\n\nδk (f )(τ )\np(ωo , τ )k+2r\n\nr = 0, 1, 2, . . . .\n\n(33)\n\nThe use of x in the definition (33) is justified by the following fact.\nProposition 3.5. Suppose that f ∈ Mk (Γ) for some Fuchsian group of the first kind\nR11 ≥ Γ ≥ Γ1 (∆, N ). Then the numbers c(r) (f, x, ωo ) ∈ C do not depend on the choice\nof τ in its Γ-orbit.\nProof. For any γ ∈ Γ, multiplication by j(γ, τ )−1 induces an isomorphism of complex\n∼\ntori Aτ → Aγτ . Since s is a global constant section of L over H, under the standard\nidentifications of invariant forms, s(γτ ) = s(τ )j(γ, τ )−1 . The assertion follows at once.\n\n24\n\n\fPower series expansions of modular forms\n\nThe periods p(ωo , τ ) (and conseguently the numbers c(r) (f, x, ωo )) can be normalized\nby choosing ωo as in proposition 2.11. For such a choice, defined up to a v-unit, set\n(r)\nc(r)\n(f, x, ωo ).\nv (f, x) = c\n\nΩ∞ = Ω∞ (τ ) = p(ωo , τ ),\n\nAlso, define the p-adic period Ωp = Ωp (x) ∈ Ovnr,× (again defined up to a v-unit) as\nωo = Ωp ωu (x).\nnr\nLet f ∈ Mk,1 (∆, N ; Ovnr ). Over Spf(Jx,∞\n) write f ∗ = fx ωu⊗k and\n!\n∞\nX\nbn (f, x) n\n∗\n∗\n⊗k\nUx ωu (x)⊗k\njetx (f ) = x jet(fx ) ⊗ ωu (x) =\nn!\nn=0\n\nwhere fx is expanded at x in terms of the formal local parameter Ux = log(1 + ux ).\nTheorem 3.6. Let x ∈ X∆,N (O(v) ) be represented by a split p-ordinary test triple\n(τ, v, e) and f ∈ Mk (∆, N ; O(v) ). Then, for all r ≥ 0,\nbr (f, x)\n= c(r)\nv (f, x) ∈ O(v) .\nΩk+2r\np\nProof. The case r = 0 is clear, so let us assume that r ≥ 1.\nWe have ∇(f ∗ ) = ∇(fx ωu⊗k ) = dfx ⊗ ωu⊗k + kfx ωu⊗k−1 ∇(ωu ). Since ∇(ω u (P )) ∈\n0\ne [27, theorem 4.3.1], the term containing ∇(ωu ) is killed\nH (M, U) for each P ∈ Tp (A),\nby the projection Prp . Also, dUx = d log(ux + 1) = d log(q + 1) doesn't depend on x\nand we obtain Θk,p (f ∗ ) = (dfx /dUx )ωu⊗k+2 . Iterating the latter computation r times\nand evaluating the result at x yields\n(r)\n\nΘk,p (f ∗ )(x) =\n\ndr fx\nbr (f, x)\nk+2r\n(x) = k+2r ωok+2r .\nr (x)ωu\ndUx\nΩp\n\nOn the other hand, applying r times the proposition 2.9 and evaluating at τ yields\n(r)\n\n(r)\n\nΘk,∞ (f ∗ )(x) = δk (f )(τ )s(τ )⊗k+2r = c(r) (f, x, ωo )ωok+2r .\nThe result follows from proposition 2.11.\nThis result has a converse. For, we need the following preliminary discussion. Let\nD be any domain of characteristic 0 and field of quotients K. The formal substitution\n1 3\n1 2\nU + 3!\nU + * * * defines a bijection between the rings of formal\nu = eU − 1 = U + 2!\npower series K[[u]] and K[[U ]]. Under this bijection the ring D[[u]] is identified with a\nsubring of the ring of Hurwitz series, namely power series of the form\n∞\nX\nβn n\nU ,\nn!\nn=0\n\nwith βn ∈ D for all n = 0, 1, 2, ....\n\nWe say that a power series Φ(U ) ∈ K[[U ]] is u-integral if Φ(U ) = F (eU − 1) for some\nF (u) ∈ D[[u]]. Denote cn,r the coefficients defined by the polynomial identity\nn!\n\n\u0010 \u0011\nX\nn\n\n= X(X − 1) * * * (X − n + 1) =\n\nn\nX\n\ncn,r X r .\n\nr=0\n\nThe following possibly well known result is closely related to [41, Théorème 13].\n25\n\n\fA. Mori\nP∞ βn n\nis u-integral if and only if\nTheorem 3.7. A Hurwitz series Φ(U ) =\nn=0 n! Z\n1\n(c\nβ\n+\nc\nβ\n+\n*\n*\n*\n+\nc\nβ\n)\n∈\nD\nfor\nall\nd\n=\n1,\n2,\n....\nd,2 2\nd,d d\nd! d,1 1\nProof. Let F (u) = Φ(log(1 + u)) ∈ K[[u]]. For any polynomial P (X) = p0 + p1 X +\n* * * + pd X d ∈ K[X] of degree d, an immediate chain rule computation yields\n\u0012\n\u0013\nd\nP (u + 1)\nF (u)\n= p0 β0 + p1 β1 + ... + pd βd .\ndu\nu=0\n\u0001\n\u0001\nd\nd\nF (u) u=0 = P (u + 1) du\nFd (u) u=0 where Fd (u) is the degree d\nAlso P (u + 1) du\nd+1\ntruncation of F (u), i.e. F (u) = Fd (u) + U\nH(u). On the space of polynomials\nof\n\u0001\nd\ndegree ≤ d the substituition u = v − 1 is defined over D and P (u + 1) du\nFd (u) u=0 =\n\u0001\n\u0001 k\nd\nd\nP v dv\nFd (v − 1) v=1 . Since P v dv\nv v=1 = P (k)v k , the argument shows that if\nΦ(U ) is u-integral, then the expression p0 β0 + p1 β1 + ... + pdβd is a D-linear combination\nof the values P (0), P (1), ..., P (d).\nOn the other hand, the argument also shows that\n\u0010\n\u0011\n1\n(cd,1 β1 + cd,2 β2 + * * * + cd,d βd ) = v d/dv\nFd (u − 1)\nd\nd!\nv=1\nis the coefficient of U d in F .\nTherefore, we obtain that Φ(U ) is u-integral if and only p0 β0 +p1 β1 +...+pd βd ∈ D for\nevery polynomial P (X) = p0 +p1 X +* * *+pd X d ∈ K[X] such that P (0), P (1), ..., P (d) ∈\nD. We conclude observing that a degree d polynomial P (X) ∈ K[X] such that P (0),\nP (1), ..., P (d) ∈ D is necessarily numeric, i.e. P (N) ⊂ D and that the D-module of\nnumeric polynomials is free, generated by the binomial coefficients.\n\nNote that when D is a ring of algebraic integers, or one of its non-archimedean completions, the conditions of the theorem can be readily rephrased in terms of congruences,\nknown as Kummer-Serre congruences.\nDenote Lv,sc the compositum of all finite extensions L ⊆ F such that v splits comsc\npletely in F and let O(v)\nbe the integral closure of O(v) in Lv,sc .\nTheorem 3.8 (Expansion principle). Let f ∈ Mk,1 (∆, N ) and x ∈ X (∆, N )(O(v) ) be\n(r)\nrepresented by a split p-ordinary test triple (τ, v, e) such that the numbers cv (f, x) ∈\n(r)\nO(v) for all r ≥ 0 and the p-adic numbers Ω2r\np cv (f, x) satisfy the Kummer-Serre consc\ngruences. Then f is defined over O(v) .\nProof. Choose a field embedding ı : C → Cp to view f ∈ Mk,1 (∆, N ; Cp ). For all\n(r)\nr ≥ 0 set cr = cv (f, x) and βr = cr ΩǫpD k+2r ∈ Cp . Unwinding the computations\n\u0011\n\u0010P\nβr r\n⊗k\n∈\nU\nthat led to the equality in theorem 3.6 shows that jetx (f ∗ ) =\nr≥0 r! x ωu (x)\nnr\n(Jx,∞\n⊗ Cp )ωu (x)⊗k . We claim that jetx (f ∗ ) is defined over Ov . Write\n\n\n\n\nX βr\nX cr\njetx (f ∗ ) = \nU r  ωu (x)⊗k = \n(Ω2 Ux )r  ωo⊗k .\nr! x\nr! p\nr≥0\n\nr≥0\n\nSince the βr are v-integral and satisfy the Kummer-Serre congruences, the first equality\nshows that jetx (f ∗ ) is v-integral. Since the formal substitution u = eU − 1 preserves\nthe field of definition, the claim follows from the second equality if we check that the\nformal local parameter Ω2p Ux is defined over Lv . The group Aut(Cp /Lv ) acts on the\n26\n\n\fPower series expansions of modular forms\n\ne\nsection ωu via the action of its quotient Gal(Lnr\nv /Lv ) ≃ Gal(k v /kv ) on Tp (Ax ) which is\ne\nscalar because Ax is either an elliptic curve or isogenous to a product of elliptic curves.\nThus, the section Ωp ωu , whose restriction at x is defined over Lv , is itself defined over\nLv . Therefore Ω2p dUx = KS(Ω2p ωu⊗2 ) is defined over Lv , and so is Ω2p Ux because it is a\npriori defined over Lnr\nv and its value at the point x, defined over Lv , is 0.\nWe can now use the very same arguments of Katz's proof [24] of the q-expansion\nprinciple to conclude that the section f ∗ is defined over Ov . For, observe that the\nq-expansion of a modular form f at the cusp s multiplied by the right power of the\ncanonical Tate form is jets (f ∗ ). The specific nature of a cusp in the modular curve\nplays no role in Katz's proof, which works as well when the former are replaced by any\npoint in a smooth curve.\nSince f ∗ is defined over C and over Ov , the modular form f is defined over the integral\nclosure of O(v) in the largest subfield F ⊂ C such that ı(F ) ⊆ Lv . The assertion follows\nfrom the arbitrariness of the choice of ı, since Lsc\n(v) can be characterized as the largest\nsubfield of C whose image under all the embeddings C → Cp is contained in Lv .\n\n4\n4.1\n\np-adic interpolation\np-adic K × -modular forms\n\nA weight for the quadratic imaginary field K is a formal linear combination w = w1 σ1 +\nw2 σ2 ∈ Z[IK ], which will be also written w = (w1 , w2 ). Following our conventions,\nwrite z w = z w1 z̄ w2 for all z ∈ C. Also, let w̄ = (w2 , w1 ) and |w| = w1 + w2 , so that\nw + w̄ = |w| 1 with 1 = (1, 1).\nDefinition 4.1 (Hida [17]). Let E ⊇ K be a subfield of C. The space Sew (n; E) of\nK × -modular form of weight w and level n with values in E is the space of functions\nf ̃: In → E such that\nf ̃((λ)I) = λw f ̃(I)\nfor all λ ∈ Kn× .\nA remarkable subset of Sew (n) = Sew (n; C) is the set of algebraic Hecke characters of type\nA0 ,\ne w (n) = Sew (n) ∩ Hom(In , C× ).\nΞ\n\ne w (n) there exists a\nA well-known property noted by Weil [48] is that for every ξ ̃ ∈ Ξ\nnumber field Eξ̃ such that ξ ̃ ∈ Sew (n; Eξ̃ ). A classical construction identifies the space\nSew (n) with the space Sw (n) of functions f : K × → C× such that\nA\n\nf (sλzu) = z −w f (s) for all λ ∈ K × , z ∈ C× and u ∈ Un .\n\n(34)\n\nIf f ̃ ↔ f under this identification, then\nf ̃(I) = f (s) whenever I = [s] and sv = 1 for v = ∞ and v|n.\n\n(35)\n\nb× , the funcThis relation can be used to recognize Sew (n; E) in Sw (n). Since UcOK < O\nK,c\nb×\ntions f : KA× → C× satisfying the relation in (34) for all λ ∈ K × , z ∈ C× and u ∈ O\nK,c\nform a linear subspace Sw (OK,c ) ⊂ Sw (cOK ). The subspace Sw (OK,c ) includes the\n27\n\n\fA. Mori\n\nb× , namely Ξw (OK,c ) = Sw (OK,c )∩Hom(K × /K × O\nb× , C× ).\nHecke characters trivial on O\nK,c\nA\nK,c\nDenote\nb× .\nCn = KA× /K × C× Un ≃ In /Pn ,\nC♯c = KA× /K × C× O\nK,c\nand let hn = |Cn | and h♯c = C♯c . Clearly h♯c |hc .\n\nLemma 4.2.\n\n× w\n1. Ξw (OK ) 6= ∅ if and only if (OK\n) = 1.\n\n2. Ξw (OK,2 ) = Ξw (2OK ) and they are non-trivial if and only if |w| is even.\n3. If c > 2 then Ξw (cOK ) 6= ∅ and Ξw (OK,c ) 6= ∅ if and only if |w| is even.\n4. Ξw (OK,c ) and Ξw (cOK ) are bases for Sw (OK,c ) and Sw (cOK ) respectively.\nProof. Let U < U1 and CU = KA× /K × C× U . Then there is a short exact sequence\n1 −→\nwhere HU = C× ∩ K × U . The\n\n×\n\nOK\nHUc = {±1}\n\n\n{1}\n\nK×\nC×\n−→ ×A −→ CU −→ 1\nHU\nK U\n\nfirst three points follow from the observation that\nif c = 1,\nif c = 2,\nif c > 2,\n\nHOb× =\nK,c\n\n(\n\n×\nOK\nif c = 1,\n{±1} if c ≥ 2.\n\nFor the last part, observe that multiplication by any ξ ∈ Ξw (cOK ) defines, for every\n∼\nweight w ′ , an isomorphism Sw′ (cOK ) → Sw+w′ (cOK ) which identifies the respective\nsets of Hecke characters. When ξ ∈ Ξw (OK,c ) 6= ∅, the isomorphism restricts to an\n∼\nisomorphism of the subspaces Sw′ (OK,c ) → Sw+w′ (OK,c ). So, we are reduced to check\nthe assertion in the case of the null weight 0 = (0, 0), which is clear because S0 (cOK )\nand Ξ0 (cOK ) (respectively S0 (OK,c ) and Ξ0 (OK,c )) are the set of functions on the finite\nabelian group Cc (respectively C♯c ) and its Pontryagin dual.\nIf m|n the inclusion In < Im defines a natural restriction map\nSew (m) → Sew (n).\n\n(36)\n\nLemma 4.3. The restriction maps (36) are injective.\nProof. We can assume that n = mp with p prime and (p, m) = 1. Let f ̃ ∈ Sew (m) and\n×\nsuppose that f ̃(I) = 0 for all ideals I ∈ In . Let λ ∈ Km\nsuch that λOp = pOp . Then\n−1\n−1\n−w  ̃\n ̃\n ̃\np[λ ] ∈ In and 0 = f (p[λ ]) = λ f (p), i.e. f (p) = 0 proving that f ̃ = 0 identically.\nFor f ∈ Sw (n) and g ∈ Sw′ (n) let\n\nP\nP\n′\n−1\n ̃\n h−1\nn\nσ∈Cn f (Iσ )g̃(Iσ ) if w = −w\nσ∈Cn f (sσ )g(sσ ) = hn\nhf, gi =\n,\n\n0\nif w′ 6= −w\n\n(37)\n\nwhere {sσ } and {Iσ } are full set of representatives of Cn in KA× and inL\nIn respectively.\nThe bilinear form h*, *i extends by linearity to a pairing on S(n) =\nw∈Z[IK ] Sw (n),\nL\ne\ne\nor on the corresponding space S(n) =\nSw (n), compatible with the restriction\nw∈Z[IK ]\n\n28\n\n\fPower series expansions of modular forms\n\nmaps (36). Note that for Hecke characters ξ ∈ Ξw (n) and ξ ′ ∈ Ξ−w (n) one has the\northogonality relation\n\u001a\n1 if ξ ′ = ξ −1\n′\nhξ, ξ i =\n.\n0 otherwise\nRemark 4.4. It follows at once from the definition (37) that the pairing h*, *i takes\nvalues in E on E-valued forms.\nLet p be a prime number and let F be a p-adic local field with ring of integers OF .\nFollowing [17, 44], the space of p-adic K × -modular forms of level n with coefficients in F\nis the space S(n; F ) = C 0 (Cn , F ) of F -valued continuous functions on Cn =lim r≥0 Cnpr .\n\nIt is a p-adic Banach space under the sup norm ||φ|| = supx∈Cn |φ(x)|\nS(n; OF ) its unit ball. Assume that E is a subfield of F (e.g. F is\nof E at a prime dividing p) and write Sew (n; F ) = Sew (n; E) ⊗ F and\nSew (OK,c ; E) ⊗ F .\n\n←\n\nand we denote\nthe completion\nSew (OK,c ; F ) =\n\nProposition 4.5 ([44]). For every ideal m|n and for every ideal q with support included\nin the set of primes dividing p there is a natural embedding\nM\ne\nSew (mq; F ) ֒→ S(n; F ).\nS(mq;\nF) =\nw∈Z[IK ]\n\nProof.\nWe may use Lemma 4.3 to assume that mq = npa for some a ≥ 1. Since\nT\nr≥0 Pnpr = {1} the group Inp embeds as a dense subset in Cn . The restriction of\n ̃\nf ∈ Sew (npa ; F ) to a coset I * Pnpa is the function I(λ) 7→ f ̃(I)λw . Since w ∈ Z[IK ] the\ncharacter λw is continuous for the p-adic topology on K × and so extends to a character\nχw of (K ⊗ Qp )× . Therefore f ̃ extends locally to cosets of 1 + pa (RK ⊗ Zp ) and globally\nto the whole of Cn . The injectivity of the direct sum space S(npa ; F ) follows from the\nlinear independence of characters.\nWe shall denote fb the p-adic modular form associated to the K × -modular form f ̃.\nIf f ̃ = ξ ̃ is an Hecke character, the p-adic form ξb is again a character which is sometimes\ncalled the p-adic avatar of ξ ̃ (or of ξ). The density of Inp in Cn implies also that the image\nof Sew (npa ; F ) in S(n; F ) is characterized by the functional relations f ̃(λs) = λw f ̃(s) for\nall λ ≡ 1 mod npa . Thus, the association f ̃ 7→ fb identifies Sew (npa ; F ) with the closed\nlinear subspace\n\u001b\n\u001a\nφ ∈ S(n; F ) such that φ(sx) = φ(s)χw (x)\n(38)\nSw,a (n; F ) =\nfor all x ∈ 1 + pa (OK ⊗ Zp )\n\nL\n(when a = 0 the domain for x is (OK ⊗ Zp )× ). Let S(npa ; F ) = c w Sw,a (n; F ) be the\ne a ; F ) in S(n; F ). Since Sw,a (n; F ) is closed the projection onto the w-th\nclosure of S(np\nsummand extends to a projection πw,a : S(npa ; F ) → Sw,a (n; F ). Define a pairing\n[*, *] : S(npa ; F ) × S(npa ; F ) −→ F\n\nas the composition\nπ0,a\n\nm\n\nμH\n\nS(npa ; F ) × S(npa ; F ) −→ S(npa ; F ) −→ S0,a (n; F ) −→ F\nwhere m is multiplication and μH is the Haar distribution which is bounded on the space\nS0,a (n; F ).\n29\n\n\fA. Mori\n\nProposition 4.6. The pairing h*, *i extends to a continuous pairing on S(mq; F ) which\ncoincides with [*, *].\nProof. The pairing [*, *] is continuous\nD\nE as composition of continuous mappings. Thus it is\nenough to check the identity f ̃, g̃ = [fb, gb] for f ̃ ∈ Sew (npa ; F ) and g̃ ∈ Sew′ (npa ; F ). It\n\nfollows from the definition (37) and the density of Inp in Cn , since on Inp the restrictions\nof f ̃ and fb and of g̃ and gb coincide.\n\nRecall that a p-adic distribution on Zp with values in the p-adic Banach space W\nover F is a linear operator C 0 (Zp , F ) → W . Given two p-adic distributions on Zp with\nvalues in S(npa ; F ) we construct a new distribution μ[μ1 ,μ2 ] with values in F as the\ncomposition\nπ0,a\nμ1 ∗μ2\nμH\nC 0 (Zp , F ) −→ S(npa ; F ) −→ S0,a (n; F ) −→ F,\n\nwhere μ1 ∗ μ2 is the convolution product of μ1 and μ2 . If μ1 and μ2 are measures\n(bounded distributions) μ[μR1 ,μ2 ] is not a measure in general since the map π0,a is not\nbounded. Denote mk (μ) = Zp xk dμ(x), k ≥ 0 the k-th moment of the distribution μ.\nLemma 4.7. Let M ∈ N ∪ {∞} and suppose that there exist pairwise distinct weights\n{wk } for 0 ≤ k < M such that mk (μ1 ) ∈ Sewk (npa ; F ) and mk (μ2 ) ∈ Se−wk (npa ; F ) for\nall 0 ≤ k < M . Then\n\u001a\n0 \u0001\nif 0 ≤ k < M is odd,\nmk (μ[μ1 ,μ2 ] ) =\n2l\nl [ml (μ1 ), ml (μ2 )] if 0 ≤ k = 2l < M is even.\n\nIf M = ∞ the latter formulae characterize the distribution μ completely.\n\u0010RR\n\u0011\nk\n(x\n+\ny)\ndμ\n(x)dμ\n(y)\n=\nProof. By direct computation mk (μ[μ1 ,μ2 ] ) = μH ◦ π0,a\n1\n2\n2\nZp\nPk \u0010 k \u0011\nPk \u0010 k \u0011\ni=0 i μH ◦ π0,a (mi (μ1 )mk−i (μ2 )) =\ni=0 i [mi (μ1 ), mk−i (μ2 )] . The formula\nfollows at once from the orthogonality relations in (37) since wi = w k−i only if k = 2l\nis even and i = l. The final assertion is also clear.\n\nLet μ be a p-adic distribution on Zp with values in a p-adic space S of continuous\nF -valued functions on a profinite space T . For every t ∈ T , evaluation at t defines an\nF -valued distribution μ(t) on Zp , μ(t)(φ) = μ(φ)(t). Conversely, a family {μt }t∈T of F valued distributions such that the function μ(φ)(t) = μt (φ) is in S for all φ ∈ C 0 (Zp , F )\ndefines a p-adic distribution μ on Zp with values in S and μ(t) = μt for all t ∈ T , which\nis obviously unique for this property.\nLemma 4.8. Let T be a profinite space, S a p-adic space of continuous F -valued functions and μ a p-adic distribution on Zp with values in S. Then μ is a p-adic measure if\nand only if μ(t) is a p-adic measure for all t ∈ T .\nProof. If μ is bounded, the distributions μ(t) are obviously bounded.\nSuppose that μ(t) is bounded for all t ∈ T . Let {φk } k = 0, 1, 2, ... be functions in\nC 0 (Zp , F ) with ||φk || = 1 and let φk = μ(φk ). If ||φk (t)|| = prk choose tk ∈ T such that\n|φk (tk )|p = prk . If the set of values {prk } is not bounded we may assume without loss\nof generality that r1 < r2 < r3 < * * * and since each μ(tk ) is bounded also that {tk } is\nan infinite set. By compactness of T , there exists t̄ ∈ T , t̄ 6= tk for all k, such that every\nneighborhood of t̄ meets {tk }. This contradicts the boundedness of μ(t̄) since |φ(t)|p is\nlocally constant for all φ ∈ S.\n30\n\n\fPower series expansions of modular forms\n\nIn particular, the sequence μ\n\n\u0001\u0001\n\nx\nk\n\nis bounded and μ is a measure.\n\ne w (npa ) and ξ ̃ ∈ Ξ\ne w′ (npa ) be Hecke characters taking\nAs an application, let χ̃ ∈ Ξ\n×\n×\n′\nvalues respectively in OF and OF ′ where Qp ⊆ F is a totally ramified subextension of\nF . For every x ∈ Cn the series\n∞\nX\n1 bk\nb\nχ\nbξ (x)Z k = χ\nb(x)(1 + T )ξ(x) ,\nk!\n\n1\n1\nT = eZ − 1 = Z + Z 2 + Z 3 + * * * ,\n2\n3!\n\nk=0\n\nhas integral coefficients in the variable T (the corresponding measure is χ\nb(x)∂ξ(x)\nb , where\n∂t denotes the Dirac measure concentrated at t). Thus, there exists a unique measure\nμχ,ξ on Zp with values in S(n; OF ) such that mk (μχ,ξ ) = χ\nbξbk . When w ′ 6= 0 the\nmoments' weights are pairwise distinct.\n\n4.2\n\nExpansions as distributions\n\nLet  : K ֒→ D a normalized embedding of conductor c = cτ,N with corresponding\nτ ∈ CM∆,K and x ∈ CM(∆, N ; OK,c ). Let y = Im(τ ). The embedding  defines by\nscalar extension a diagram\nKA× /K × R×\n↓\nb×\nK × /K × R× O\nA\n\nC♯c\n\n≃\n\nK,c\n\n↓\n×\n× × b×\nKA /K C OK,c\n\n−→\n−→\n\nD× \\DA× /Z∞\n↓\nb×\nD× \\D× /Z∞ R\nA\n\n(39)\n\nN\n\n↓\n×\n×\nb×\n−→ D \\DA /(C× )R\nN\n\n≃\n\nΓ0 (∆, N )\\H\n\n×\nwhere the vertical maps are the natural quotient maps and Z∞ is the center of D∞\n.\nUnder the decomposition\n×\nb×\nDA× = DQ\nGL+\n(40)\n2 (R)RN\n\nthe idele d = do g∞ u corresponds to the point represented by g∞ τ . Classfield theory\nprovides an identification C♯c ≃ Gal(Hc /K) where Hc is the ray classfield of conductor\nc. It is also well-known that the points in the image of the bottom map in (39) are\ndefined over Hc , so that Gal(Hc /K) acts naturally on them, and that the two actions\nare compatible (Shimura reciprocity law, [43]). In particular, if sσ ∈ KA× represents σ ∈\n(σ−1 )\n\nσ\n. Write Ax (C) = Aτ = Cǫ /Λτ with\nGal(Hc /K),\nAxσ = Ax\n\u0001 then sσ maps to x and\nτ\n2\nΛτ = Λ 1 where ǫ = 1 and Λ = Z ⊂ C if D is split and ǫ = 2 and Λ = Φ∞ (R1 ) ⊂ C2\nif D is non-split. The theory\nof complex multiplication implies that Axσ (C) ≃ Cǫ /sσ Λτ\n\u0001\n−1\n−1 τ\nwhere sσ Λτ = Λdσ 1 if sσ = dσ gσ uσ under (40). For a fixed prime p one can choose\nrepresentatives {sσ } ⊂ KA× normalized as follows:\n\u001a\nsσ,∞ = 1,\nsσ,v is v-integral at all finite places v and a v-unit at the places v|pc.\n\nFor each such representative s there is a diagram of complex tori\nj(g,τ )\n\nπ\n\nAgτ = Cǫ /Λgτ −−−−→ Cǫ /sΛτ −−−s−→ Cǫ /Λτ\nAxσ (C)\n31\n\nAx (C)\n\n\fA. Mori\n\nwhere s = dgu under (40) and πs is the natural quotient map arising from the inclusion\nsΛτ ⊂ Λτ . The element g ∈ GL+\n2 (R) is defined by gτ ∈ H only up to an element in\n×\nOK,c\n. Choose p and a place v over p in a number field L large enough so that for each s\nthe triple (gτ, v, e) is a p-ordinary test triple and that the isogenies πs are defined over\nL.\nLemma 4.9. With the above notations, it is possible to choose for every σ ∈ Gal(Hc /K)\nan invariant 1-form on Axσ that generates L(xσ ) ⊗ O(v) and for which\n1. Ω∞ (gτ ) ∼O× j(g, τ )Ω∞ (τ );\n(v)\n\n2. Ωp (xσ ) ∼O× Ωp (x).\n(v)\n\nProof. Take ωo ∈ H 0 (Ax (C), L(x) ⊗ C). The quotient map πs is the identity on\n(co)tangent spaces and commutes with the action of the endomorphisms. Thus ωs =\nπs∗ (ωo ) ∈ H 0 (Axσ (C), L(xσ )) and p(ωs , gτ ) = j(g, τ )p(ωo , τ ). Furthermore, p doesn't\ndivide the degree of πs and so πs∗ is an isomorphism between the natural p-adic structures\non the spaces of invariant forms. This proves part 1.\nFor part 2 observe that the reduction mod p of the dual map πst gives an isomorphism\nof the rank 1 tate module quotient T of §3.2. Thus πs∗ (ωu (P )) is a universal form on\nexσ by formula (31) and the equality follows.\nthe deformations of A\nb× are two normalized\nIf s and s′ = sλzu with λ ∈ K × , z ∈ C× and u ∈ O\nK,c\nrepresentants of the same σ ∈ C♯c a comparison of the relations in lemma 4.9 for the\ndecompositions s = dgr and s′ = (λd)(gz)(ru) shows that ωs′ ∼O× zωs . Therefore the\nK,c\n\n×\nconstruction of ωs can be extended modulo OK,c\n-equivalence to all s ∈ KA× by setting\n\nωsλzu ∼O× zωs\nK,c\n\nb× and s normalized.\nfor all λ ∈ K × , z ∈ C× , u ∈ O\nK,c\n\n(41)\n\nLet f ∈ M2κ,0 (∆, N ) and normalize the invariant form as in proposition 2.11. For all\n×\nintegers r ≥ 0 such that (OK,c\n)2(κ+r) = 1 define a function c(r) (f, x) : KA× → C as\n(r)\n\nc(r) (f, x)(s) =\n\nδ2κ f (gτ )\np(ωs , gτ )2(κ+r)\n\nwhere s = dgu as above.\n×\nProposition 4.10. Suppose that f is defined over O(v) and assume that (OK,c\n)2(κ+r) =\n1. Then c(r) (f, x) ∈ S(2(κ+r),0) (OK,c ) ∩ S(cRK , Ov ).\n\nProof. The modular relation for c(r) (f, x) follows at once from (41) and the definition\nsince gzτ = gτ . For an idele s satisfying the conditions (35) for n = (pc) the invariant\nform ωs satisfies proposition 2.11 and then theorem 3.6 together with lemma 4.9 shows\nthat as a p-adic K × -modular form c(r) (f, x) has coefficients in Lv and in fact belongs\nto the unit ball.\n×\nAssume that OK,c\n= {±1}. Let μf,x be the p-adic distribution on Zp with values in\nS(cOK ; Lv ) such that mr (μf,x ) = b\nc(r) (f, x) and let μχ,ξ be the p-adic measure associated to a choice of Grössencharakters χ ∈ Ξ(−2κ,0) (OK,c ), ξ ∈ Ξ(−2,0) (OK,c ) as in the\ndiscussion after lemma 4.8.\n\n32\n\n\fPower series expansions of modular forms\n\nTheorem 4.11. There exist a p-adic field F and a p-adic measure μ(f, x; χ, ξ) on Zp\nwith values in OF such that\n\u001a\n\u0001\n0\nif 0 ≤ r is odd,\nmr μ[μf,x ,μχ,ξ ] =\n−2(κ+l) 2l\u0001\n(h♯c )−1 Ωp\nm\n(μ(f,\nx;\nχ,\nξ))\nif\n0 ≤ r = 2l is even,\nl\nl\n\nProof. Let F be large enough to contain Lv , the field of values of χ and ξ and the padic period Ωp . The expression follows from Lemma 4.7 and the fact that for a suitable\nchoice of representants for C♯c we have,\ncombining\nwith theorem\nh\ni the definition (37)\nP\n−2(κ+l)\nl\n♯\n−1\n3.6, proposition 4.6 and lemma 4.9, χ\nbξb , b\nc(l) (f, x) = (h ) Ωp\nχ\nbξbl (s)bl (xσ ).\nc\n\nσ\n\nFinally, each term ξbl (s)blP\n(xσ ) is the l-th moment\nof a suitable p-adic measure on Zp\nP∞\nσ\nn\nn\nbecause the identification ∞\nthrough the\nn=0 (bn (x )/n!)T = Pn=0 an U with an ∈ OF P\n∞\n∞\nT\nsubstituition U = e − 1 yields an identification n=0 (bn (xσ )/n!)z n T n = n=0 an V n\nwhere V = (U + 1)z − 1 and this substitution preserves OF -integrality when z is a unit\nin a field with residue field Fp . Conclude using the linearity of measures.\n\n4.3\n\nSpecial L-values\n\n×\n∞\nb × -invariant C ∞ lift of\nFor f ∈ M2κ,0\n(∆, N ), let φf ∈ L2 (DQ\n\\DA× ) be the usual R\nN\nf to DA× . Namely, φf (d) = f (g∞ * i)j(g∞ , i)−2κ det(g∞ )κ if d = dQ g∞ u under (40).\n×\nThe Lie algebra g = gl2 ≃ Lie(D∞\n) acts on the C-valued C ∞ functions on DA× by\nd\nφ(detA ) t=0 . By linearity and composition the action extends to the\n(A * φ)(d) = dt\ncomplexified universal enveloping algebra A(g)C . Let\n\u0012\n\u0012\n\u0013\n\u0013\n\u0012\n\u0013\n1\n1 ±i\n1 0\n0 −i\n±\nI=\n,\nH=\n,\nX =\n±i −1\n0 1\ni 0\n2\n\nbe the usual eigenbasis of gC for the adjoint action of the maximal compact subgroup\n\u001a\n\u0012\n\u0013\n\u001b\ncos θ − sin θ\nSO(2) = r(θ) =\nsuch that θ ∈ R .\nsin θ cos θ\n∞\nSince Ad(r(θ))X ± = e∓2iθ X ± , we have X ± * φf ∈ M2κ±2,0\n(∆, N ). A standard computation (e.g. [3, §§2.1–2]) links the Lie action to the Maass operators of §2.3, namely\n\nX + * φf = −4πφδ2κ f .\nFor r ≥ 0 let\n\n\u0013r\n\u0012\n1 +\nr f.\n* φf = φδ2κ\nφr = − X\n4π\n\n(42)\n\nDefinition 4.12. Let f ∈ M2κ,0 (∆, N ), ξ ∈ Ξw (cOK ) for a weight w such that |w| = 0\nand τ = t + iy ∈ CM∆,K with cτ,N = c and associated normalized embedding . For\neach r ≥ 0, let\nZ\nJr (f, ξ, τ ) =\n\nwhere d∞ =\n\n\u0010\n\ny 1/2 ty 1/2\n0 y −1/2\n\n\u0011\n\nKA× /K × R×\n\nφr ((t)d∞ )ξ(t) dt\n\nand dt is the Haar measure on KA× whose archimedean com-\n\nponent is normalized so that vol(C× /R× ) = π and such that the local grups of units\nb× ) = [(OK /cOK )× : (Z/cZ)× ]−1 ).\nhave volume 1 (hence mc = vol(O\nK,c\n33\n\n\fA. Mori\n\nWe show that Jr (f, ξ, τ ) can be expressed in terms of the pairing introduced in §4.1.\n\n×\nWrite wK,c = OK,c\n.\n\n×\nTheorem 4.13. Let f ∈ M2κ,0 (∆, N ) and ξ ∈ Ξ(w,−w) (OK,c ). Assume that (OK,c\n)2w =\n1. Then\nE\nD\nπmc ♯ −w\n−w\nJr (f, ξ, τ ) =\n.\nhc y Ω∞ (τ )−2w c(r) (f, x), ξ NK/Q\nwK,c\n\nb× -invariant, we have Jr (f, ξ, τ ) =\nProof. Since the integrand function is right O\nK,c\nR\nmc K × /K × R× Ob× φr ((t)d∞ )ξ(t) dt. For a chosen set of representatives {sσ } of C♯c\nA\nK,c\nthere is a decomposition\n[\n×\nb× =\nC× sσ /R× OK,c\n(disjoint union).\nKA× /K × R× O\nK,c\nσ∈C0c\n\nTherefore, Jr (f, ξ, τ ) = mc\n\nP\n\nσ∈C♯c\n\nξ(sσ )\n\nR\n\n×\nC× /R× OK,c\n\nφr ((sσ z)d∞ )ξ∞ (z) d× z.\n\nSince the standard normalized embedding ofR C in M2 (R) is ρeiθ 7→ ρr(θ), we can\n×\nφr ((sσ z)d∞ )ξ∞ (z) d× z =\nwrite D∞\n∋ (z) = ρd∞ r(θ)d−1\n×\n∞ . Therefore C× /R× OK,c\nR\nR\nπ\nπ\n−1\n−1\nwK,c\nφr ((sσ d∞ )r(θ))ξ∞ (eiθ ) dθ = wK,c\nφr ((sσ d∞ )) 0 e−2i(κ+r)θ e−2iwθ dθ and\n0\nJr (f, ξ, τ ) =\n\n\u001a\n\n−1\nπmc wK,c\n0\n\nP\n\nσ∈C♯c\n\nξ(sσ )φr ((sσ d∞ ))\n\nif w = −κ − r\n.\notherwise\n\n(43)\n\nNote that this proves the claimed formula when w 6= −κ − r since the inner product in\nits right hand side vanishes in this case. Thus, we may now assume that w = −κ − r.\nPut Iσ = ξ(sσ )φr (sσ d∞ ) and write s = sσ = ds gs us under (40) and τs = gs τ . Note that\n×\nNK/Q (s) = det(gs ). Under the hypothesis (OK,c\n)2(κ+r) = 1 we have\nIσ\n\n=\n\n(r)\n\nξ(s)δ2κ f (gs d∞ * i)j(gs d∞ , i)−2(κ+r) det(gs )κ+r\n(r)\n\nκ+r\n\n=\n\ny κ+r ξ(s)δ2κ f (τs )j(gs , τ )−2(κ+r) NK/Q (s)\n\n=\n\ny κ+r ξ(s)c(r) (f, x)(s)p(ωs , τs )2(κ+r) j(gs , τ )−2(κ+r) NK/Q (s)\n\n=\n\ny κ+r ξ(s)c(r) (f, x)(s)p(ωso , τso )2(κ+r) j(gso , τ )−2(κ+r) NK/Q (s)\n\n=\n\ny κ+r Ω∞ (τ )2(κ+r) ξ(s)c(r) (f, x)(s) NK/Q (s)\n\nκ+r\nκ+r\n\nκ+r\n\nwhere so is a normalized representant. It is now clear that the formula follows.\nDefinition 4.14. Let M be a proper divisor of N , x ∈ CM(∆, N ; OK,c ) and x′ ∈\nCM(∆, M ; OK,c′ ) the image of x under the natural quotient map. A character ξ ∈\nb× ′ .\nΞw (OK,c ) is called (x, M )-primitive if it is not trivial on O\nK,c\n\nFor a divisor d of N/M there is an embedding ι∆,d : M2κ,0 (∆, M ) −→ M2κ,0 (∆, N ).\nWhen ∆ = 1 the embedding is simply f (z) 7→ f (dz). When ∆ > 1 the explicit description of ι∆,d is less immediate, e.g. [34, §3]. We denote M2κ,0 (∆, N )M−old the span of\nthe images of the embeddings ι∆,d for all d. After theorem 4.13 the following result can\nbe read as an orthogonality statement between primitive characters and K × -modular\nforms arising from oldforms.\n34\n\n\fPower series expansions of modular forms\n\nProposition 4.15. Let τ ∈ CM∆,K and x ∈ CM(∆, N ; OK,c ) be the point represented\nby τ . Let f ∈ M2κ,0 (∆, N )M−old and suppose that ξ ∈ Ξ(−κ−r,κ+r) (OK,c ) is (x, M )primitive. Then Jr (f, ξ, τ ) = 0.\nProof. Consider again the first expression in (43). Let x′ ∈ CM(∆, M ; OK,c′ ) the point\nimage of x and choose a system of representants {sσ′ } of C♯c′ and a system of represenb × ′ /O\nb × . Then the set of products {sσ ri } is a system of representatives\ntants {ri } of O\nK,c\nK,c\nof C♯c and since d∞ commutes with each ri and f is M -old we obtain the expression\n\n\n\nπm  X\n X\n\nξ(ri ) \nJr (f, ξ, τ ) =\nξ(sσ′ )φr (sσ′ d∞ )\n\nwK,c\n♯\n×\n×\nb\nb\nO\n/O\nK,c\nK,c′\n\nσ′ ∈Cc′\n\nb × ′ /O\nb× .\nwhich vanishes because ξ is non trivial on O\nK,c\nK,c\n\nWe shall assume from now on that the modular form f is a holomorphic newform\nwith associated automorphic representation π D = πf . Let π be the automorphic representation of GL2 (A) corresponding to π D under the Jacquet-Langlands correspondence.\nOther N\nthan the Weil representation rψ of SL2 (A), the adelic Schwartz-Bruhat space\nSA (D) = p≤∞ Sp supports the unitary representation of GO(D)(A) given by\n−1\n\nL(h)φ(x) = ||ν0 (h)||A φ(h−1 x),\n\nx ∈ DA .\n\nWe assume that the archimedean space S∞ consists only of the Schwartz functions on\n1\n1\nD∞ which are K∞\n× K∞\n-finite under the action of D× × D× via the group GO(D)\n1\n×\n(§1.3). Here K∞ is the maximal compact subgroup of (K × ⊗ R) ⊂ D∞\n≃ GL2 (R). As\nexplained in [14, §5], the two representations mingle into one single representation, still\ndenoted rψ , of the group R(D) = {(g, h) ∈ GL2 × GO(D) such that det(g) = ν0 (h)}\n\u0010\n\u0011−1\ngiven by rψ (g, h)φ = rψ (g1 )L(h)φ where g1 = g 1 ν0 (h)\n. Note that\n∼\n\n• the assignment (g, h) 7→ (g1 , h) sets up an isomorphism R(D) → SL2 ⋉ GO(D);\n\n• the group R(D) is naturally a subgroup of the symplectic group Sp(W ), where\nW = P ⊗ D with P the standard hyperbolic plane, via (g, h)x ⊗ y = gx ⊗ h−1 y.\n\nThe groups (SL2 , O(D)) form a dual reductive pair in Sp(W ) and the extended Weil\nrepresentation rψ allows to realize the theta correspondence between the similitude\ngroups. TheP\ntheta kernel associated to a choice of (g, h) ∈ R(D) and φ ∈ SA (D) is\nθ(g, h; φ) = d∈D rψ (g, h)φ(d). The theta lift to GO(D) of a cuspidal automorphic\nform F on GL2 (A) is the automorphic form on GO(D)(A) given by\nZ\nθ(gg ′ , h; φ)F (gg ′ ) dg ′\n(44)\nθφ (F )(h) =\nSL2 (Q)\\SL2 (A)\n\nwhere det(g) = ν0 (h) and dg ′ is induced by a choice of a Haar measure dg =\nGL2 (A). A straightforward substitution yields\nθrψ (g1 ,h1 )φ (F )(h) = θφ (π(g1−1 )F )(hh1 ),\n\n∀(g1 , h1 ) ∈ R(D).\n\nQ\n\ndgp on\n(45)\n\nAn automorphic form Φ on GO(D)(A) pulls back via the map ̺ of (15) to an automore on the product group D× × D× . Let Θ(π)\ne\nphic form Φ\nbe the space of automorphic\n×\n×\nforms on D × D which are pull-backs of theta lifts (44) with F ∈ π. If π̌ D denotes the\ncontragredient representation of π D the crucial result is, with a slight abuse of notation,\nthe following, [42].\n35\n\n\fA. Mori\n\ne\nTheorem 4.16 (Shimizu). Θ(π)\n= π D ⊗ π̌ D .\n\nRemarks 4.17.\n\n1. In our case of interest π D = π̌ D .\n\n1\n1\n2. The Schwartz functions, hence the theta lifts θeφ (F ), are K∞\n×K∞\n-finite. Thus, in\nD\n1\nShimizu's theorem the representation space π consists of K∞ -finite automorphic\n1\nforms. Note that the functions π(d∞ )φr are K∞\n-finite.\n\n3. An explicit version of Shimizu's theorem has been worked out by Watson [47], see\nalso [38, §3.2] and [14, §12]. Namely, if φ = ⊗p≤∞ φp is chosen as\nφ∞ (z1 , z2 ) =\n\n(−1)κ 2κ −2π(z1 z̄1 +z2 z̄2 )\nz2 e\n,\nπ\n\nφp =\n\nchRN ⊗Zp\nvol((RN ⊗ Zp )× )\n\n(46)\n\nwhere z1 and z2 are the complex coordinates in D∞ of §1.3, then\nπ(d∞ )φf ⊗ π(d∞ )φf = θeφ (F )\n\nwhere F ∈ π is the adelic lift of an eigenform normalized so to have an equality\nof Petersson norms hπ(d∞ )φf , π(d∞ )φf i = hF, F i.\n\nLet ξ = (ξ, ξ ′ ) ∈ Ξw (cOK ) × Ξw′ (cOK ) thought of as a character of the torus\n× KA× . Let H̃(t) be any function on KA× × KA× such that H̃(t)ξ(t) is (K × R× )2 invariant. Following [13, §14] [12, §1.4] we let\nZ\nH̃(t)ξ(t) dt.\nLξ (H̃) =\n\nKA×\n\n(K × R× \\KA× )2\n\nIn particular, for ξ as in definition 4.12,\nL(ξ,ξ) (π(d∞ )φr ⊗ π(d∞ )φr ) = Jr (f, ξ, τ )2 .\nWhen ξ = ξ ′ is unitary, |w| = |w ′ | = 0, the integral Lξ (θeφ (F )) can also be read,\nvia the map α of (15), as the Petersson scalar product of two automorphic forms on\nthe similitude group T = G(O(K) × O(K ⊥ )) associated with the decomposition D =\nR\nK ⊕ K ⊥ , namely L(ξ,ξ) (θeφ (F )) = T (Q)T (R)\\T (A) θeφ (F )((a, b))ξ(b) d× ad× b, where α(t) =\n(a, b). Thus the seesaw identity [30] associated with the seesaw dual pair\nGL2 × GL2\n↑\nGL2\n\n×\n\nGO(D)\n\n↑\nG(O(K) × O(K ⊥ ))\n\nidentifies, up to a renormalization of the Haar measures, the value L(ξ,ξ) (θeφ (F )) with a\nscalar product on GL2 ,\nZ\nt\nLξ (θeφ (F )) =\nF (g)θφ\n(1, ξ)(g, g) dg,\n(47)\nGL2 (Q)A× \\GL2 (A)\n\nt\nwhere θφ\ndenotes the theta lift to GL2 × GL2 . If φ is split and primitive, i.e. admits a\ndecomposition φ = φ1 ⊗φ2 under N\nD∞ = (K ⊕K ⊥ )⊗R and each component decomposes\nt\n(1, ξ) splits as a product\nin a product of local factors, φi = p≤∞ φi,p for i = 1, 2, then θφ\nof two separate lifts. In fact\nt\n ̃ 2)\nθφ\n(1, ξ)(g1 , g2 ) = E(0, Φ, g1 )θφ2 (ξ)(g\n\nwhere:\n36\n\n\fPower series expansions of modular forms\n\n• E(0, Φ, g) is the value at s = 0 of the holomorphic Eisenstein series attached to the\nunique flat section ([3, §3.7]) extending the function Φ(g) = rψ (g, k)φ1 (0) where\nk ∈ KA× is such that N (k) = det(g) and rψ denotes here the extended adelic Weil\nrepresentation attached to K as a normed space (Siegel-Weil formula),\n• θφ2 (ξ)(g) is a binary form in the automorphic representation π(ξ) of GL2 attached\nto ξ.\nThis expression yields a relation between the right hand side of (47) and the value at the\ncentre of symmetry of a Rankin-Selberg convolution integral. If the Whittaker function\nWF of F decomposes as a product of local Whittaker functions, the Rankin-Selberg\nintegral admits an Euler decomposition [20] and L(ξ,ξ) (θeφ (F )) is equal to the value at\ns = 12 of the analytic continuation of\n1 Y\nLq (φq , ξq , s),\nhK\nq≤∞\n\nwhere\nLq (φq , ξq , s) =\n\nZ\n\nKq\n\nZ\n\nQ×\nq\n\nψ\n\nWF,qq\n\n\u0012\u0012\n\na 0\n0 1\n\n\u0012\u0012\n\u0013 \u0013\n\u0013 \u0013\n−a 0\nψ\nk *\nk Wθφq ,q\n2\n0 1\n\u0012\u0012\n\u0013 \u0013\na 0\n−1\nΦsφ1 ,q\nk |a| d× a dkq . (48)\n0 1\n\nThe local measures are normalized so that K∞ = SO2 (R) has volume 2π and Kq =\nGL2 (Zq ) has volume 1 for finite q. Also Wθφ2 is the Whittaker function and Φs (g) =\n\u0001\ns− 1\n||a|| 2 Φ(g) if g = nak under the N AK-decomposition where a b = |a/b|. Since\nthe local term (48) does not vanish and for almost all q is the local Euler factor of some\nautomorphic L-function, one obtains, as in [12, 13], a version of Waldspurger's result\n[46]. Namely,\ns\nLξ (θeφ (F )) = Λ(φ, ξ, s)L(πK ⊗ ξ, )L(ηK , 2s)−1\n2\n\ns=1/2\n\n,\n\nwhere Λ(φ, ξ, s) is a finite product of local integrals, πK is the base change to K of the\nautomorphic representation π and L(ηK , 2s) is the Dirichlet L-function attached to ηK ,\nthe quadratic character\nassociated to K\nN\nWhen φf = p<∞ φp and F are chosen as in Remark 4.17.3 the local non-archimedean terms in the Rankin-Selberg integral have been explicitely computed by Prasanna [38,\n§3] under the simplifying assumptions that N is squarefree, c = 1 and ξ is unramified.\nThe effect of these assumptions is that\n1. the local component of ξ can be written either as ξq = (ξqsp , (ξqsp )−1 ) for some\nunramified character ξqsp of Q×\nq at a prime q split in K under the isomorphism\nin\n×\nin\n(K ⊗ Qq )× ≃ Q×\nq × Qq , or as ξq = ξq ◦ NKq /Qq for an unramified character ξq of\n×\nrm\nQq at a prime q inert in K, or as ξq = ξq ◦ NKq /Qq at a ramified prime q where\nξqrm is the unramified character of Q×\nq obtained by a trivial extension;\n2. at a prime q|N ∆ the local component πq is equivalent to the special representation\n1\n+it\n− 1 +it\nσ(|*| 2 q , |*| 2 q ) with q 2itq = 1.\n37\n\n\fA. Mori\n\nNote that the former condition remains true for a split prime q that does not divide c\nand ξ ∈ Ξw (RK,c ) with |w| = 0. Thus we can apply Prasanna's computations to this\nmore general case to write down a formula in which only the local factors at primes in\nΣ = {q|cN ′ } are left implicit, where N = Nsf (N ′ )2 and Nsf is square-free. Namely,\n\n\nY\nV\ns\nN\nLξ (θeφ∞ ⊗φf (F )) =\nλ∞ (φ∞ , ξ∞ , s) \nνq (ξq ) L(πK ⊗ ξ, )L(ηK , 2s)−1\nhK\n2\nq≤∞\n\ns=1/2\n\n(49)\n1\nQ\n2\nξ∞ (zu )−1 L∞ (φ∞ , ξ∞ , 2s ) (zu\nwhere VN = q vol((RN ⊗ Zq )× ), λ∞ (φ∞ , ξ∞ , s) = |Nu|∞\ndenotes the complex coordinate of u in the chosen identification (Ku) ⊗ R ≃ C) and\n\n\nif q splits, q ∈\n/ Σ, (q, Nsf ) = 1 ,\nνq (ξq ) = ξqsp (q)n1 −n2\n\n\n1\n\n1\n+t\n+s\nsp\nn\n−n\n−\n\nq\n1\n2\n\nif q|Nsf ,\nξq (q)\nνq (ξq ) = − q+1 q 2\nin\n−2n\nνq (ξq ) = ξq (q)\nif q is inert, q ∈\n/ Σ,\n\n\nrm\n−1\n\nν\n(ξ\n)\n=\nξ\n(−Nu\n)\nif\nq\nramifies,\n\nq q\nq\n\n\nν (ξ ) = ξ (z )\n∞ ∞\n∞ u\n\nwhere the ideal J of proposition 1.3 in K ⊗ Qq is generated by q −n when q is inert and\ndecomposes as q −nq,1 Zq × q −nq,2 Zq under K ⊗ Qq ≃ Qq × Qq when q is split.\nRemark 4.18. It is clear that νq (ξq ) = 1 for almost all q. The local terms λq (νq ) do\ndepend on the choice of u in (11) (replacing u with xu the local Whittaker function\n1\nψ\nWθφq ,q gets modified by the factor |Nx|q− 2 ξq (x)−1 ), but the quantity\n2\n\nν(ξ, τ, s) =\n\nY\n\nνq (ξq )\n\nq≤∞\n\ndepends only on ξ and the chosen embedding  : K → D.\nFor a pair of non-negative integers (m, q) consider the function of two complex variables φ(l,q) (z1 , z2 ) = (z1 z̄1 )l z2q e−2π(z1 z̄1 +z2 z̄2 ) .\nLemma 4.19. Let φ(z) = (z z̄)l e−2πzz̄ . Then the Fourier transform of φ is\n2\n\n2\n\nφ̂(w1 + w2 i) = e−2π(w1 +w2 )\n\nX\n\nγ(α, β; l)w12α w22β ,\n\n0≤α+β≤l\n\nwhere\nγ(α, β; l) =\n\nX\n\nj+k=l\nα≤j,β≤k\n\n(−4π)α+β−l\n\n\u0012 \u0013\u0012 \u0013\u0012 \u0013\nl\n2j\n2k\n(2j − 2α − 1)!!(2k − 2β − 1)!!\nj\n2α 2β\n\nR\n2\n2\nProof. One has φ̂(w1 + w2 i) = 2 R2 e4πi(w1 x1 +w2 x2 ) (x21 + x22 )l e−2π(x1 +x2 ) dx1 dx2 =\n\u0010R\n\u0011\n\u0010\n\u0011\n\u0001\nR\nP\n2πiw1 x1 2j −2πx21\n2πiw2 x2 2k −2πx22\nx1 e\n2 j+k=l jl\nx2 e\ndx1\ndx2 and the result folRe\nRe\n\u0001\nR 4πitx−2πx2 2v\n2 Pv\n−i 2v\n2(v−i)\n.\nx dx = √12 e−2πt\nlows from R e\ni=0 (−4π)\n2i (2i − 1)!! t\n38\n\n\fPower series expansions of modular forms\n\nLemma 4.20. Let r ≥ l ≥ 0 be integers, F the lift of a weight 2κ eigenform and ξ∞\nthe character ξ∞ (z) = (z/z̄)κ+r of C× . Then\n\n0\nif l < r,\nL∞ (φ(l,2(κ+r)) , ξ∞ , s) = (−1)r 2π(−Nu−1 ) 21 ξ∞ (zu )r!\n\nΓ(s + 2κ + r − 21 ) if l = r.\ns+2(κ+r)− 1\n(4π)\n\n2\n\n\u0001\na0\n\n\u0001\nProof. It is well known that WFψ∞ 0 1 r(θ) = aκ chR+ (a)e−2πa−2κiθ . We compute\nthe other two terms in the integrand of (48) separately with φ1 (z1 ) = (z1 z̄1 )l e−2πz1 z̄1\n2(κ+r) −2πz2 z̄2\nand φ2 (z2 ) = z̄2\ne\n.\n\u0001\n\u0001\na0\ns\n1. To compute Φφ1 0 1 r(θ) = |a|s rψ∞ (r(−θ))φ1 (0) we use the definitions (3)\ntogether with the decomposition\n\u0010\n\u0011\n\u0001 \u0010 1 − sin θ cos θ \u0011 \u0010 0 1 \u0011 \u0010 1/ cos θ 0 \u0011\nθ\n0 −1\nr(θ) = 10 − tan\n(50)\n1\n1 0\n0\n1\n−1 0\n0\ncos θ .\nSome straightforward passages yield rψ∞ (r(θ))φ1 (0) = (− cos θ)φ♯1 (0) where φ♯1 (z)\n2\nis the Fourier transform of e−2πi cos θ sin θ|z| φ̂1 ((cos θ)z). Since\nZ\n2\ne−2πi sin θ cos θ|z| φ̂1 ((cos θ)z) dz\nφ♯1 (0) =\nC\n\n(for z = x + yi and from the previous lemma)\nZ\nX\n2\n2\n2\n2(α+β)\n=2\nγ(α, β; l)(cosθ)\ne−2π(i sin θ cos +(cos θ) )(x +y ) x2α y 2β dxdy\nR2\n\n0≤α+β≤l\n\n=−\n\nX\n\nγ(α, β; l)\n\n0≤α+β≤l\n\n(cos θ)2(α+β)\n(2α − 1)!! (2β − 1)!!\n,\nα+β\n(4π)\n(− sin θ cos θ − (cos θ)2 )α+β+1\n\neventually\nΦsφ1\n\na0\n01\n\n\u0001\n\n\u0001\nr(θ) =\n− |a|\n\ns\n\nX\n\n0≤α+β≤l\n\nγ(α, β; l)(2α − 1)!!(2β − 1)!!\n(cos θ)α+β e−(α+β+1)iθ .\n(−4π)α+β\n\n\u0001\n\u0001\n0\n2. To compute Wθψφ∞,∞ −a\n0 1 r(θ) we need to use again (3) together with the de2\ncomposition (50). For, it should be noted that this time the norm in (Ku)⊗R ≃ C\nis −NC/R (in particular, definite negative) and the main involution is z 7→ −z.\n\u0001\n\u0001\n\u0001\u0001\n0\n0\ni(2κ+2r+1)θ\nThus, we get Wθψφ∞,∞ −a\nWθψφ∞,∞ −a\n0 1 r(θ) = e\n0 1 . On the other\n2\n2\nhand, for a choice of h ∈ C× such that Nh = −aNu−1 > 0,\nZ\n\u0010\u0010\n\u0011\n\u0011\n\u0001\u0001\n1\n−aNu−1 0\n0\n,\nhθ\nφ2 (u)ξ∞ (hθ) dθ\nr\nWθψφ∞,∞ −a\n=\nψ\n0\n1\n0 1\n2\n2π S 1 ∞\n1 Z\n(−aNu−1 ) 2\n−1\nφ2 (−aNu−1 (hθ) u))ξ∞ (hθ) dθ\n=\n2π\n1\nS\n1 Z\n(−aNu−1 ) 2\n=\nφ2 (h̄θ−1 u)ξ∞ (hθ) dθ\n2π\nS1\n1 Z\n(−aNu−1 ) 2\n=\n(h̄θ−1 zu )2(κ+r) e−2πa (hθ)κ+r (h̄θ−1 )−κ−r dθ\n2π\n1\nS\n1\n\n1\n\n= (−Nu−1 ) 2 ξ∞ (zu )aκ+r+ 2 e−2πa\n39\n\n\fA. Mori\n\nPutting all the ingredients together\nL∞ (φ(l,2(κ+r)) , ξ∞ , s) =\n1\n2\n\nZ\n\nZ\n\n1\n\n) ξ∞ (zu )\nas+2κ+r− 2 e−4πa ei(2κ+2r+1)θ\nR>0 S 1\n\n\nX γ(α, β; l)(2α − 1)!!(2β − 1)!!\n(cos θ)α+β e−(α+β+1)iθ  d× adθ\n×\n(−4π)α+β\n0≤α+β≤l\nZ\n1\n1\nas+2κ+r− 2 e−4πa d× a\n= −(−Nu−1 ) 2 ξ∞ (zu )\n>0\nR\nX γ(α, β; l)(2α − 1)!!(2β − 1)!! Z\n×\n(cos θ)α+β e−(α+β+1)iθ dθ\n(−4π)α+β\n1\nS\n= −(−Nu\n\n−1\n\n0≤α+β≤l\n\nSince α + β ≤ l ≤ r we have\nZ\n\n(cos θ)α+β ei(2r−α−β+1)θ dθ =\n\nS1\n\n1\n2α+β\n\nα+β\nX\u0012\nj=0\n\nα+β\nj\n\n\u0013Z\n\ne\n\n2i(r−j)θ\n\ndθ =\n\nS1\n\n(\n\n21−r π\n0\n\nif α + β = l = r ,\notherwise.\n\n\u0001\nhence L∞ (φ(l,2(κ+r)) , ξ∞ , s) = 0 if l < r. When l = r, since γ(j, r − j; r) = rj and\n\u0001\nPr\nr\nr\nj=0 j (2j − 1)!!(2r − 2j − 1)!! = 2 r! as readily proved by induction, we have\n1\n\nL∞ (φ(r,2(κ+r)) , ξ∞ , s) =\n\n2π(−Nu−1 ) 2 ξ∞ (zu )r!\n(−4π)r\nr\n\n=\n\n−1\n\n1\n2\n\nZ\n\nR>0\n\n) ξ∞ (zu )r!\nΓ(s\n1\ns+2(κ+r)−\n2\n(4π)\n\n(−1) 2π(−Nu\n\n1\n\nas+2κ+r− 2 e−4πa d× a\n1\n+ 2κ + r − ).\n2\n\nWe shall now state and prove the main result of this section.\nTheorem 4.21. Let N be a positive integer and fix a decomposition N = ∆No with ∆ a\nproduct of an even number of distinct primes and (∆, No ) = 1. Let π be an automorphic\ncuspidal representation for GL2 of conductor N such that\n2κ−1\n1. π∞ ≃ σ(μ1 , μ2 ), the discrete series representation with μ1 μ−1\nsgn(t).\n2 (t) = t\n\n2. πl is special for each l|∆.\nLet K be a quadratic imaginary field such that all l|∆ are inert in K and all l|No are\nsplit in K. Let c be a positive integer with (c, N ) = 1 and p an odd prime number\n×\nnot dividing N that splits in K. Assume that OK,c\n= {±1}. Suppose that there exist\nGrössencharakters χ ∈ Ξ(−2κ,0) (OK,c ) and ξ ∈ Ξ(−2,0) (OK,c ) such that the p-adic avatar\nξb takes values in a totally ramified extension of Qp .\nThen, there exists x ∈ CM(∆, N ; OK,c ) represented by τ = t + yi ∈ CM∆,K with\n40\n\n\fPower series expansions of modular forms\n\nassociated periods Ω∞ and Ωp such that for all r ≥ 0\nΩp−4(κ+r)\n\nZ\n\nz r dμ(f, x; χ, ξ) =\n\nZp\n\n2\n2̟VN wK,c\n(−1)κ+r r!(2κ + r)!\n1\n1\nν(ξr , τ, )L(πK ⊗ ξr , )L(ηK , 1)−1\n2\n4(κ+r)\nmc hK 42κ+3r π 2(κ+r+1) y 2(κ+r) Ω∞\n2\n2\n\nwhere ξr = ξχr NK/Q\n\n−κ−r\n\nand ̟ is a (fixed) ratio of Petersson norms.\n\nProof. Let D be the quaternion algebra with ∆D = ∆. By hypothesis the representation π is the image of an automorphic representation π D of D× under the JacquetLanglands correspondence and let f ∈ S2k,0 (∆, No ) be a holomorphic newform in π D .\nFor all integers r ≥ 0 let φr be as in (42).\nBy proposition 1.6 there exists x ∈ CM(∆, N ; OK,c ) and choose a split p-ordinary\ntest triple (τ, v, e), τ = t + iy, representing x with corresponding d∞ ∈ SL2 (R). By\ntaking Ov and F large enough, we can assume that f is defined over O(v) ⊂ OF , and\nthat the measure μ(f, x; χ, ξ) has values in OF\nBy remark 4.17.3 we can write π(d∞ )φ0 ⊗ π(d∞ )φ0 = ̟θeφ (F ) with φ = φ∞ ⊗ φf\nas in (46), F the adelization of the normalized eigenform in π and ̟ ∈ C× a Petersson\nnormalization constant. We claim that for all r ≥ 0\nr−1\n\nπ(d∞ )φr ⊗ π(d∞ )φr = ̟\n\nX\n(−1)κ e\nar,l , θeφl,2(κ+r) ⊗φf (F )\nθφr,2(κ+r) ⊗φf (F ) +\nr\n4 π\n\n(51)\n\nl=0\n\nwhere ar,l ∈ ̟Z[π]. For, the short exact sequence (14) gives a Lie algebras identification\ngo(D) ≃ (D∞ ×D∞ )/R and in particular o(D) = {(A, B) ∈ D∞ ×D∞ | trA = trB}/R ≃\nsl2 × sl2 . Under this identification, differentiating (45) yields\nde\nθφ (F )(h exp(tH))\nθeHφ (F ) =\ndt\n\nwith Hφ(x) =\nt=0\n\nd\nφ(e−tH1 xetH2 )\ndt\n\nt=0\n\nfor all H = (H1 , H2 ) ∈ Lie(O(D)). If A ∈ sl2 a repeated application of the last\nformula with A′ = (A, 0) and A′′ = (0, A) shows that the diagonal action of A on\nπ D ⊗ π D corresponds to the action of the second order operator A2 = A′ A′′ = A′′ A′ ∈\nA(Lie(O(D))) on Schwartz functions, i.e.\nA2 φ(x) =\n\n∂2\nφ(e−uA xevA )\n∂u∂v\n\n.\nu=v=0\n\nWe are interested in the expression of the operator A2 in the normalized coordinates for\nA = d∞ X + d−1\n∞ . Up to conjugation, this is the same as to compute the second order operator associated to A = X + under the standard coordinates (16). A straightforward computation using the obvious real coordinates associated to the underlying\u0010real decomposi\u0011\n\u0001\n\u0001\n\u0001\n\u0001\ntion D∞ = R 1 1 ⊕ R 1 −1 ⊕ R 1 1 ⊕ R −1 1 shows that A′ = −i z2 ∂∂z̄1 + z1 ∂∂z̄2\n\u0010\n\u0011\nand A′′ = i z2 ∂z∂ 1 + z̄1 ∂∂z̄2 , so that\nA2 = z22\n\n∂\n∂2\n∂2\n∂2\n∂2\n+ z2\n+ z̄1 z2\n+ z1 z2\n+ z1 z̄1\n.\n2\n∂z1 ∂ z̄1\n∂ z̄1 ∂ z̄2\n∂z1 ∂ z̄2\n∂ z̄2\n∂ z̄2\n41\n\n\fA. Mori\n\nSince\nm,q\n\nA2 φ\n\n=\n\n(\n\n−2πφ0,q+2 + 4π 2 φ1,q+2\nm2 φm−1,q+2 − (4m − 2)πφm,q+2 + 4π 2 φm+1,q+2\n\nif m = 0,\nif m ≥ 1,\n\nformula (51) follows from an r-fold iteration using the linearity of the theta lift and the\ndefinitions (42) and (46) of φr and φ∞ respectively.\nbc× such that\nLet χr be a Grössencharakter of weight (−2(κ + r), 0) and trivial on R\n−κ−r\nξr = χr NK/Q\nis unitary. Combining (51) and (49) with lemma 4.20 we get\nJr (f, ξr , τ )2 =\n\n(−1)κ+r 2̟VN r!(2κ + r)!\n1\n1\nν(ξr , τ, )L(πK ⊗ ξr , )L(ηK , 1)−1 .\n42κ+3r hK π 2κ+2r\n2\n2\n\n(52)\n\nOn the other hand, from theorem 4.13,\nJr (f, ξr , τ )2 =\n\nm2c π 2 ♯ 2 2(κ+r) 4(κ+r)\nc(r) (f, x), χr\n(hc ) y\nΩ∞\n2\nwK,c\n\n2\n\n.\n\nWhen χr = χξ r we use proposition 4.6 to rewrite the last formula as\nΩp−4(κ+r) mr (μ(f, x; χ, ξ))2 =\n\n2\nwK,c\nΩ−4(κ+r) y −2(κ+r) Jr (f, ξr , τ )2 .\nm2c π 2 ∞\n\nSubstituting (52) into the latter formula proves the theorem.\n\nReferences\n[1] M. Bertolini and H. Darmon. Heegner points on Mumford-Tate curves. Inventiones\nMath., 126:413–456, 1996.\n[2] J. F. Boutot and H. Carayol. Uniformisation p-adique des courbes de Shimura:\nles theoremes de Cerednik et de Drinfeld. In Courbes modulaires at courbes de\nShimura, volume 196 of Astérisque, pages 45–158, 1991.\n[3] D. Bump. Automorphic Forms and Representations, volume 55 of Cambridge Studies in Adv. Math.. Cambridge University Press, 1996.\n[4] H. Darmon. Rational Pooints on Modular Elliptic Curves, volume 101 of Regional\nConf. Ser. Math.. American Mathematical Society, 2004.\n[5] P. Deligne. Hodge cycles on abelian varieties. In Hodge cycles, Motives, and\nShimura varieties, volume 900 of Lecture Notes in Math., pages 9–100, 1982.\n[6] P. Deligne and M. Rapoport. Les schémas de modules de courbes elliptiques. In\nModular Functions of One Variable II, volume 349 of Lecture Notes in Math., pages\n143–316, 1973.\n[7] F. Diamond and J. Im. Modular forms and modular curves. In Seminar on Fermat's\nLast Theorem (Toronto, ON, 1993–1994), volume 17 of CMS Conf. Proc., pages\n39–133. American Math. Soc., 1995.\n[8] F. Diamond and R. Taylor. Non-optimal levels of mod l representations. Inventiones\nMath., 115:435–462, 1994.\n42\n\n\fPower series expansions of modular forms\n\n[9] G. Faltings and C.-L. Chai. Degenerations of Abelian Varieties, volume 22 of\nErgebnisse der Math. Springer, 1990.\n[10] M. Harris. A note on three lemmas of Shimura. Duke Math. J., 46:871–879, 1979.\n[11] M. Harris. Special values of zeta functions attached to Siegel modular forms. Ann.\nSc. Éc. Norm. Sup., 14:77–120, 1981.\n[12] M. Harris. Non-vanishing of L-functions on 2 × 2 unitary groups. Forum Math.,\n5:405–419, 1993.\n[13] M. Harris and S. Kudla. The central critical value of a triple product L-function.\nAnnals Math., 133:605–672, 1991.\n[14] M. Harris and S. Kudla. Arithmetic automorphic forms for the nonholomorphic\ndiscrete series of GSp(2). Duke Math. J., 66:59–121, 1992.\n[15] M. Harris and J. Tilouine. p-adic measures and square roots of special values of\ntriple product L-functions. Math. Ann., 320:127–147, 2001.\n[16] K. Hashimoto. Explicit form of quaternion modular embeddings. Osaka J. Math.,\n32:533–546, 1995.\n[17] H. Hida. Hecke algebras for GL1 and GL2 . In Seminaire de theorie des nombres,\nParis 1983–84, volume 63 of Progr. Math., pages 133–146, 1986.\n[18] H. Hida. Elementary Theory of L-functions and Eisenstein Series, volume 26 of\nStudent Texts. London Mathematical Society, 1993.\n[19] R. Howe. Transcending classical invariant theory. J. Amer. Math. Soc, 2:536–552,\n1989.\n[20] H. Jacquet. Automorphic forms on GL(2), II, volume 278 of Lecture Notes in Math.\nSpringer-Verlag, 1972.\n[21] H. Jacquet and R. P. Langlands. Automorphic forms on GL(2), volume 114 of\nLecture Notes in Math. Springer-Verlag, 1970.\n[22] B. Jordan. Points on Shimura curves rational over number fields. J. reine u. angew.\nMath., 371:92–114, 1986.\n[23] N. Katz. Nilpotent connections and the monodromy theorem: applications of a\nresult of Turrittin. Publ. Math. IHES, 39:355–412, 1970.\n[24] N. Katz. p-adic properties of modular schemes and modular forms. In Modular\nFunctions of One Variable III, volume 350 of Lecture Notes in Math., pages 70–\n189, 1973.\n[25] N. Katz. p-adic interpolation of real analytic Eisenstein series. Annals of Math.,\n104:459–571, 1976.\n[26] N. Katz. p-adic L-function for CM fields. Inventiones Math., 49:199–297, 1978.\n[27] N. Katz. Serre-Tate local moduli. In Surfaces Algebraiques, volume 868 of Lecture\nNotes in Math., pages 138–202, 1981.\n43\n\n\fA. Mori\n\n[28] N. Katz and B. Mazur. Arithmetic moduli of elliptic curves, volume 108 of Annals\nof Math. Studies. Princeton Univ. Press, 1985.\n[29] N. Katz and T. Oda. On the differentiation of de Rham cohomology classes with\nrespect to parameters. J. Math. Kyoto Univ., 8(2):199–213, 1968.\n[30] S. Kudla. Seesaw dual reductive pairs. In Automorphic forms of several variables\n(Katata 1983), volume 46 of Progr. Math, pages 244–268. Birkhäuser Boston, 1984.\n[31] H. Maass. Die Differentialgleichungen in der Theorie der Siegelschen Modulfunktionen. Math. Ann., 126:44–68, 1953.\n[32] J. S. Milne. Points on Shimura varieties modp. In Automorphic Forms, Representations and L-functions, volume 33 of Proc. Symp. Pure Math., pages 165–183,\n1979.\n[33] A. Mori. A characterization of integral elliptic automorphic forms. Ann. Sc. Norm.\nSup. Pisa, IV(21):45–62, 1994.\n[34] A. Mori and L. Terracini. A canonical map between Hecke algebras. Boll. Un. Mat.\nIt. Sez. B, 8(2):429–452, 1999.\n[35] D. Mumford. Geometric Invariant Theory. Springer-Verlag, Heidelberg, 1965.\n[36] R. Noot. Hodge classes, Tate classes, and local moduli of abelian varieties. PhD\nthesis, Rijksuniversiteit Utrecht, 1992.\n[37] F. Oort. Finite group schemes, local moduli for abelian varieties and lifting problems. Compositio Math., 23:265–296, 1971.\n[38] K. Prasanna. Integrality of a ratio of Petersson norms and level-lowering congruences. Ann. Math., 163:901–967, 2006.\n[39] D. Roberts. Shimura curves analogous to X0 (N ). PhD thesis, Harvard University,\n1989.\n[40] J.-P. Serre. Endomorphismes completement continus des espaces de Banach padiques. IHES Publ. Math., 12:69–85, 1962.\n[41] J.-P. Serre. Formes modulaires et fonctions zêta p-adiques. In Modular Functions\nof One Variable, III, volume 350 of Lecture Notes in Math., pages 191–268, 1973.\n[42] H. Shimizu. Theta series and automorphic forms on GL2 . Math. Soc. Japan,\n24:638–683, 1972.\n[43] G. Shimura. Introduction to the Arithmetic Theory of Automorphic Functions.\nIwanami Shoten and Princeton University Press, 1971.\n[44] J. Tilouine. Deformations of Galois representations and Hecke algebras. Narosa\nPubl. House, 1996.\n[45] M.-F. Vigneras. Arithmétique des Algèbres de Quaternions, volume 800 of Lecture\nNotes in Math. Springer-Verlag, 1980.\n[46] J.-L. Waldspurger. Sur les valeurs des certaines fonctions L automorphes en leur\ncentre de symétrie. Compositio Math., 54:173–242, 1985.\n44\n\n\fPower series expansions of modular forms\n\n[47] T. Watson. Rankin triple products and quantum chaos . PhD thesis, Princeton\nUniversity, 2003.\n[48] A. Weil. On a certain type of characters of the idele-class group of an algebraic\nnumber-field. In Proceedings of the international symposium on algebraic number\ntheory, Tokio & Nikko 1955, pages 1–7, 1956.\n\n45\n\n\f"}