{"id": "http://arxiv.org/abs/math/0603427v2", "guidislink": true, "updated": "2006-04-10T13:13:08Z", "updated_parsed": [2006, 4, 10, 13, 13, 8, 0, 100, 0], "published": "2006-03-17T13:51:37Z", "published_parsed": [2006, 3, 17, 13, 51, 37, 4, 76, 0], "title": "The irregularity of cyclic multiple planes after Zariski", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=math%2F0603656%2Cmath%2F0603448%2Cmath%2F0603388%2Cmath%2F0603533%2Cmath%2F0603420%2Cmath%2F0603455%2Cmath%2F0603378%2Cmath%2F0603259%2Cmath%2F0603731%2Cmath%2F0603499%2Cmath%2F0603349%2Cmath%2F0603719%2Cmath%2F0603354%2Cmath%2F0603422%2Cmath%2F0603587%2Cmath%2F0603691%2Cmath%2F0603032%2Cmath%2F0603486%2Cmath%2F0603607%2Cmath%2F0603544%2Cmath%2F0603599%2Cmath%2F0603598%2Cmath%2F0603665%2Cmath%2F0603576%2Cmath%2F0603474%2Cmath%2F0603428%2Cmath%2F0603064%2Cmath%2F0603042%2Cmath%2F0603539%2Cmath%2F0603280%2Cmath%2F0603307%2Cmath%2F0603314%2Cmath%2F0603110%2Cmath%2F0603631%2Cmath%2F0603488%2Cmath%2F0603219%2Cmath%2F0603668%2Cmath%2F0603068%2Cmath%2F0603509%2Cmath%2F0603682%2Cmath%2F0603186%2Cmath%2F0603007%2Cmath%2F0603616%2Cmath%2F0603613%2Cmath%2F0603024%2Cmath%2F0603182%2Cmath%2F0603310%2Cmath%2F0603647%2Cmath%2F0603040%2Cmath%2F0603745%2Cmath%2F0603688%2Cmath%2F0603442%2Cmath%2F0603664%2Cmath%2F0603425%2Cmath%2F0603371%2Cmath%2F0603300%2Cmath%2F0603005%2Cmath%2F0603603%2Cmath%2F0603530%2Cmath%2F0603489%2Cmath%2F0603293%2Cmath%2F0603727%2Cmath%2F0603361%2Cmath%2F0603446%2Cmath%2F0603102%2Cmath%2F0603105%2Cmath%2F0603710%2Cmath%2F0603418%2Cmath%2F0603020%2Cmath%2F0603160%2Cmath%2F0603413%2Cmath%2F0603585%2Cmath%2F0603136%2Cmath%2F0603001%2Cmath%2F0603308%2Cmath%2F0603582%2Cmath%2F0603235%2Cmath%2F0603154%2Cmath%2F0603547%2Cmath%2F0603009%2Cmath%2F0603209%2Cmath%2F0603507%2Cmath%2F0603387%2Cmath%2F0603312%2Cmath%2F0603385%2Cmath%2F0603723%2Cmath%2F0603498%2Cmath%2F0603609%2Cmath%2F0603427%2Cmath%2F0603254%2Cmath%2F0603564%2Cmath%2F0603492%2Cmath%2F0603737%2Cmath%2F0603144%2Cmath%2F0603058%2Cmath%2F0603283%2Cmath%2F0603111%2Cmath%2F0603641%2Cmath%2F0603132%2Cmath%2F0603555%2Cmath%2F0603577&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The irregularity of cyclic multiple planes after Zariski"}, "summary": "A formula for the irregularity of a cyclic multiple plane associated to a\nbranch curve that has arbitrary singularities and is transverse to the line at\ninfinity is established. The irregularity is expressed as a sum of\nsuperabundances of linear systems associated to some multiplier ideals of the\nbranch curve and the proof rests on the theory of standard cyclic coverings.\nExplicit computations of multiplier ideals are performed and some applications\nare presented.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=math%2F0603656%2Cmath%2F0603448%2Cmath%2F0603388%2Cmath%2F0603533%2Cmath%2F0603420%2Cmath%2F0603455%2Cmath%2F0603378%2Cmath%2F0603259%2Cmath%2F0603731%2Cmath%2F0603499%2Cmath%2F0603349%2Cmath%2F0603719%2Cmath%2F0603354%2Cmath%2F0603422%2Cmath%2F0603587%2Cmath%2F0603691%2Cmath%2F0603032%2Cmath%2F0603486%2Cmath%2F0603607%2Cmath%2F0603544%2Cmath%2F0603599%2Cmath%2F0603598%2Cmath%2F0603665%2Cmath%2F0603576%2Cmath%2F0603474%2Cmath%2F0603428%2Cmath%2F0603064%2Cmath%2F0603042%2Cmath%2F0603539%2Cmath%2F0603280%2Cmath%2F0603307%2Cmath%2F0603314%2Cmath%2F0603110%2Cmath%2F0603631%2Cmath%2F0603488%2Cmath%2F0603219%2Cmath%2F0603668%2Cmath%2F0603068%2Cmath%2F0603509%2Cmath%2F0603682%2Cmath%2F0603186%2Cmath%2F0603007%2Cmath%2F0603616%2Cmath%2F0603613%2Cmath%2F0603024%2Cmath%2F0603182%2Cmath%2F0603310%2Cmath%2F0603647%2Cmath%2F0603040%2Cmath%2F0603745%2Cmath%2F0603688%2Cmath%2F0603442%2Cmath%2F0603664%2Cmath%2F0603425%2Cmath%2F0603371%2Cmath%2F0603300%2Cmath%2F0603005%2Cmath%2F0603603%2Cmath%2F0603530%2Cmath%2F0603489%2Cmath%2F0603293%2Cmath%2F0603727%2Cmath%2F0603361%2Cmath%2F0603446%2Cmath%2F0603102%2Cmath%2F0603105%2Cmath%2F0603710%2Cmath%2F0603418%2Cmath%2F0603020%2Cmath%2F0603160%2Cmath%2F0603413%2Cmath%2F0603585%2Cmath%2F0603136%2Cmath%2F0603001%2Cmath%2F0603308%2Cmath%2F0603582%2Cmath%2F0603235%2Cmath%2F0603154%2Cmath%2F0603547%2Cmath%2F0603009%2Cmath%2F0603209%2Cmath%2F0603507%2Cmath%2F0603387%2Cmath%2F0603312%2Cmath%2F0603385%2Cmath%2F0603723%2Cmath%2F0603498%2Cmath%2F0603609%2Cmath%2F0603427%2Cmath%2F0603254%2Cmath%2F0603564%2Cmath%2F0603492%2Cmath%2F0603737%2Cmath%2F0603144%2Cmath%2F0603058%2Cmath%2F0603283%2Cmath%2F0603111%2Cmath%2F0603641%2Cmath%2F0603132%2Cmath%2F0603555%2Cmath%2F0603577&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A formula for the irregularity of a cyclic multiple plane associated to a\nbranch curve that has arbitrary singularities and is transverse to the line at\ninfinity is established. The irregularity is expressed as a sum of\nsuperabundances of linear systems associated to some multiplier ideals of the\nbranch curve and the proof rests on the theory of standard cyclic coverings.\nExplicit computations of multiplier ideals are performed and some applications\nare presented."}, "authors": ["Daniel Naie"], "author_detail": {"name": "Daniel Naie"}, "author": "Daniel Naie", "arxiv_comment": "The introduction was modified and the bibliography accordingly. 25\n  pages", "links": [{"href": "http://arxiv.org/abs/math/0603427v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/math/0603427v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.AG", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.AG", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "14E20, 14E22, 14B05", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/math/0603427v2", "affiliation": "LAREMA", "arxiv_url": "http://arxiv.org/abs/math/0603427v2", "journal_reference": null, "doi": null, "fulltext": "arXiv:math/0603427v2 [math.AG] 10 Apr 2006\n\nThe irregularity of cyclic multiple planes after\nZariski\nDaniel Naie\nMathematics Subject Classification (2000): 14E20, 14E22, 14B05\nAbstract\nA formula for the irregularity of a cyclic multiple plane associated to a branch curve\nthat has arbitrary singularities and is transverse to the line at infinity is established. The\nirregularity is expressed as a sum of superabundances of linear systems associated to some\nmultiplier ideals of the branch curve and the proof rests on the theory of standard cyclic\ncoverings. Explicit computations of multiplier ideals are performed and some applications\nare presented.\n\nIntroduction\nLet f (x, y) = 0 be an affine equation of a curve B ⊂ P2 and H∞ be the line at infinity. The\nprojective surface S0 ⊂ P3 defined by the affine equation z n = f (x, y) is called the n-cyclic\nmultiple plane associated to B and H∞ . In [20], Zariski obtains his famous result for the\nirregularity of certain n-cyclic multiple planes.\nZariski's Theorem. Let B be an irreducible curve of degree b, transverse to the line\nat infinity H∞ and with only nodes and cusps as singularities. Let S0 ⊂ P3 be the n-cyclic\nmultiple plane associated to B and H∞ , and let S be a desingularization of S0 . The surface\nS is irregular if and only if n and b are both divisible by 6 and the linear system of curves of\ndegree 5b/6 − 3 passing through the cusps of B is superabundant. In this case,\nq(S) = h1 (P2 , IZ (−3 +\n\n5b\n)),\n6\n\nwhere Z is the support of the set of cusps.\nThe aim of this paper is to present a generalization of Zariski's Theorem to a branch curve\nthat has arbitrary singularities and is transverse to the line at infinity bringing to the fore the\ntheory of cyclic coverings as developed in [18]. The irregularity will be expressed as a sum of\nsuperabundances of linear systems associated to some multiplier ideals of the branch curve\nB. We refer to [4] for the notion of multiplier ideal. To state the main result in Section 2,\nwe recall here that if the rational c varies from a very small positive value to 1, then one can\nattach a collection of multiplier ideals J (cB) that starts at OP2 , diminishes exactly when c\nequals a jumping number-they represent an increasing discrete sequence of rationals-and\nfinally ends at IB .\n\n1\n\n\fTheorem (2.1). Let B be a plane curve of degree b and let H∞ be a line transverse to\nB. Let S be a desingularization of the n-cyclic multiple plane associated to B and H∞ . If\n1\nZ, then\nJ(B, n) is the subset of subunitary jumping numbers of B that live in gcd(b,n)\nq(S) =\n\nX\n\nh1 (P2 , IZ(ξB) (−3 + ξb)),\n\nξ∈J(B,n)\n\nwhere Z(ξB) is the subscheme defined by the multiplier ideal J (ξB).\nIn case the singularities of B are locally given by xp = y q such as equations, explicit\ncomputations of the jumping numbers and of the multiplier ideals will enable us to apply the\nabove theorem to various examples in Section 4. An example in Remark 4.4 shows that the\nirregularity may jump in case the position of H∞ with respect to B becomes special.\nGeneralizations of Zariski's Theorem are discussed in several papers and the proofs are\nbased on different points of view. First, Zariski's original argument divides naturally into\nthree parts. He describes the canonical system of S in terms of the conditions imposed by the\nsingularities of S0 that correspond to the cusps. Then he establishes the formula\nq(S) =\n\nn−1\nX\n\nk=n−⌊n/6⌋\n\n\u0018\n\n\u0019\nkb\nh (P , IZ (−3 +\n)),\nn\n1\n\n2\n\n(1)\n\nwhere Z denotes the support of the set of cusps. To finish, he invokes the topological result\nproved in [21]: If n is the power of a prime and B is irreducible, then the n-cyclic multiple\nplane is regular. The theorem follows from the examination of the terms that vanish in the\nprevious sum when the degree of the cyclic multiple plane covers an unbounded sequence of\npowers of primes.\nSecond, in [5], Esnault establishes a formula, similar to (1), for the irregularity of the bcyclic multiple plane S0 , where b is the degree of the branch curve B that possesses arbitrary\nisolated singularities. She uses the techniques of logarithmic differential complexes, the existence of a mixed Hodge structure on the complex cohomology of the associated Milnor fibre-\nthe complement of S0 with respect to the plane that contains B-and Kawamata-Viehweg\nVanishing Theorem. In [1], Artal-Bartolo interprets Esnault's formula for irregularity and\napplies it to produce two new Zariski pairs. Two plane curves B1 , B2 ⊂ P2 are called a Zariski\npair if they have the same degree and homeomorphic tubular neighbourhood in P2 , but the\npairs (P2 , B1 ) and (P2 , B2 ) are not homeomorphic. Zariski was the first to discover that there\nare two types of plane sextics with six cuspidal singularities: there are the ones where the\ncusps lie on a conic, and the ones where the cusps don't lie on a plane conic. In [19], Vaquié\ngives a formula for the irregularity of a cyclic covering of degree n of a nonsingular algebraic\nsurface Y ramified along a reduced curve B of degree b with respect to some projective embedding and a nonsingular hyperplane section H that intersects B transversally. His formula\nis stated in terms of superabundances of the set of singularities of B and the proof also uses\nthe techniques of logarithmic differential complexes. The superabundances involved are given\nby ideal sheaves that coincide in fact to the multiplier ideals. Vaquié's paper is one among\nseveral to introduce the notion of multiplier ideals implicitly and we refer to [4] for this issue.\nThird, in [11], Libgober applies methods from knot theory to study the n-multiple plane\nS0 . His results are expressed in terms of Alexander polynomials and extend Zariski's Theorem\nto irreducible curves B with arbitrary singularities and to lines H∞ with arbitrary position\n2\n\n\fwith respect to B. Later on, in [12, 13, 14], he deals with the case of reducible curves B having\ntransverse intersection with the line at infinity and the irregularity of the multiple plane is\nexpressed using quasiadjunction ideals. The technique is based on mixed Hodge theory, and\nthe result is a particular case in a vaster study, pursued in the above mentioned papers, where\nthe homotopy groups of the complements of various divisors in smooth projective varieties\nare explored. These groups are related to the Hodge numbers of cyclic or more generally\nabelian coverings ramified along the considered divisors, as well as to the position of their\nsingularities. We refer the reader to [16] for more ample details and references and to [15] for\nthe relation between the quasiadjunction ideals and the multiplier ideals.\nOur argument will follow Zariski's ideas. The multiple plane is transformed into a standard\ncyclic covering of the plane through a sequence of blowing-ups of P3 . Then an analog of the\nformula (1) is obtained thanks to the theory of cyclic coverings:\nq(S) =\n\nn−1\nX\nk=1\n\n\u0018\n\n\u0019\nkb\n)).\nh (P , IZ( k B) (−3 +\nn\nn\n1\n\n2\n\nFinally Theorem 2.1 is established using Kawamata-Viehweg-Nadel Vanishing Theorem.\nRemark. The above formula coincides with Vaquié's in [19] when the latter is interpreted\nfor a plane curve B and a line H transverse to it. At the same time, Vaquié's formula in its\ngeneral form might be obtained by the argument we make use of in establishing Theorem 2.1\nif Vaquié's general setting were to be considered.\nThe paper is organized as follows. In Section 1 the theory of cyclic coverings and some facts\nabout multiplier ideals are recalled. Next, in Section 2 it is shown how through a sequence of\nblowing-ups a cyclic multiple plane is transformed into a standard cyclic covering of the plane\nand Theorem 2.1 is proved. Explicit computations of the jumping numbers and multiplier\nideals are performed in Section 3, using the theory of clusters. Finally, in Section 4 some\napplications are presented.\nNotation and conventions. All varieties are assumed to be defined over C. Standard\nsymbols and notation in algebraic geometry will be freely used. Moreover, if D is a divisor\non the variety X, we shall often write H i (X, D) and hi (X, D) instead of H i (X, OX (D)) and\nhi (X, OX (D)) respectively. If L is an invertible sheaf on X, then we shall regularly denote\nby L a divisor such that L ≃ OX (L).\nAcknowledgements. I started this paper during a one week stay at the University of Pisa in\nthe spring of 2004. I would like to thank Rita Pardini for her hospitality and for the friendly\ntalks we had.\nThe paper owes Mihnea Popa its present form. I would like to record my debt to his reading\nof a preliminary version in the autumn of 2005 and to his encouragements to generalize the\nresults I obtained at that time.\nFinally, I would like to thank my colleagues Laurent Evain and Jean-Philippe Monnier for\nthe conversations they put up with throughout this period.\n\n3\n\n\f1\n\nPreliminaries\n\nWe shall summarize, in a form convenient for further use, some properties of cyclic coverings and of multiplier ideals.\n\n1.1\n\nCyclic coverings\n\nLet X be a variety and let G be the finite abelian group of order n. If G acts faithfully on\nX, then the quotient Y = X/G exists and X is called an abelian covering of Y with group\nG. The map π : X → Y is a finite morphism, π∗ OX is a coherent sheaf of OY -algebras, and\nX ≃ Spec (π∗ OX ).\nIf X is normal and Y is smooth, then π is flat which is equivalent to π∗ OX locally free.\nThe action of G on π∗ OX decomposes it into the direct sum of eigensheaves associated to the\nb\ncharacters χ ∈ G,\nM\nπ∗ OX =\nL−1\nχ .\nb\nχ∈G\n\nThe action of G on Lχ is the multiplication by χ and L1 = OY .\nTo understand the ring structure of π∗ OX we suppose that every component D of the\nramification locus is 1-codimensional. Such a component is associated to its stabilizer subb that generates H:\nb ψ corresponds to the induced\ngroup H ⊂ G and to a character ψ ∈ H\nrepresentation of H on the cotangent space to X at D. Dualizing the inclusion H ⊂ G, such\nb → Z/mf , where mf = |H|; for\na couple (H, ψ) is equivalent to a group epimorphism f : G\nb the induced representation χ|H is given by ψ f (χ)• .\nany χ ∈ G,\nHere and later on, a• denotes the smallest non-negative integer in the equivalence class of\nb to different Z/mZ.\na ∈ Z/m, and F the set of all group epimorphisms from G\nLet Bf be the divisor whose components belong to the branch locus and are exactly those\ncovered by components of the ramification locus associated to the group epimorphism f . The\nb\nring structure is given by the following isomorphisms (see [18]): for any χ, χ′ ∈ G,\nO\nLχ ⊗ Lχ′ ≃ Lχχ′ ⊗\nOY (ε(f, χ, χ′ )Bf )\n(2)\nf ∈F\n\nwith ε(f, χ, χ′ ) = 0 or 1, depending on whether or not f (χ)• + f (χ′ )• < | Im f̂ |.\nThe next proposition is formulated for cyclic groups, since it is in this case that will be\nused in the sequel. We refer again to [18] for the case of abelian groups.\nProposition 1.1. Let π : X → Y be a cyclic covering with X normal, Y smooth and\nb then for every\nevery component of the ramification locus 1-codimensional. If χ generates G,\nk = 1, . . . , n,\nX \u0016 kf (χ)• \u0017\nBf .\n(3)\nLχk ≡ kLχ −\nmf\nf ∈F\n\nIn particular, for k = n equation (3) becomes\nX\nnLχ ≡\n[G : Im f̂ ] f (χ)• Bf .\nf ∈F\n\n4\n\n(4)\n\n\fProof. For the proof we need to define the sequence (ζkm,r )k≥0 : for m and r fixed positive\nintegers with r ≤ m, and for k ≥ 0, put ζkm,r = 1 if ⌊kr⌋•m < r, and ζkm,r = 0 otherwise.\nm,r\nObviously this sequence is m-periodic, ζm\n= ζ0m,r = 1 and in case m > r, ζ1m,r = 0.\nNow, from the hypotheses, χ spans the group of characters. Taking χ′ = χj−1 in (2) we\nget\nX m ,f (χ)•\nLχ + Lχj−1 ≡ Lχj +\nζj f\nBf ,\nf ∈F\n\nsince ε(f, χ, χj−1 ) = 1, f (χ)• + f (χj−1 )• ≥ mf , (f (χ) + f (χj−1 ))• < r and [jf (χ)• ]•mf < r\nare equivalent. Then, summing over j from 1 to k,\nLχk ≡ kLχ −\n\nk X\nX\n\nmf ,f (χ)•\n\nζj\n\nBf .\n\nj=1 f ∈F\n\nBut\n\nPk\n\nhence\n\nj=1\nP\nk\n\nζjn,b represents the number of 1's among the first k terms in the sequence (ζjn,b )j ,\n\nn,b\nj=1 ζj\n\n= ⌊kb/n⌋ and (3) follows. Formula (4) is obvious, since χn = 1.\n\n\u0003\n\nConversely, to every set of data Lχ , Bf , with f ∈ F, that satisfies (4), using (3), we\ndefine the line bundles Lχk and associate in a natural way the standard cyclic covering π :\n) → Y , unique up to isomorphisms of cyclic coverings. The line bundles Lχk\nSpec (⊕k L−1\nχk\n\nis endowed with a ring structure.\nverify equation (2) and, consequently, ⊕k L−1\nχk\nNow, the standard covering thus obtained may not be normal; in fact it is not normal\nprecisely above the multiple components of the branch locus (see [18] Corollary 3.1).\n\n1.2\n\nThe normalization procedure for standard cyclic coverings\n\nb → Z/mf be a group epimorphism, so mf = ord(Im f̂ ), and let Bf = rC + R, with\nLet f : G\nC irreducible and not a component of R, and r ≥ 2. X is not normal along the pull-back of\nC. The normalization procedure along this multiple component of the branch locus splits into\nthree steps showing how to end up with a new covering X ′ → X → Y , with X ′ normal along\nthe pull-back of C (see [18]). The steps are given by the comparison between the multiplicity\nr and the order mf of the stabilizer subgroup.\nStep 1. If Bf = rC + R with r ≥ mf , then set q and r ′ by the Euclidean division\nr = qmf + r ′ , and construct a new set of building data by putting\nL′χ ≡ Lχ − f (χ)• q C,\n\nBf′ ≡ r ′ C + R\n\nand\n\nBg′ ≡ Bg\n\nif g 6= f.\n\nStep 2. If Bf = rC + R with r < mf and (r, mf ) = d > 1, then the natural composition\nis considered\nmf\nf\nb −→\n.\nf′ : G\nZ/mf −→ Z/\nd\nThe integers f (χ)• and f ′ (χ)• are linked by the relation f (χ)• = qmf /d + f ′ (χ)• . Put\nr\nL′χ ≡ Lχ − q C,\nd\n\nBf′ ≡ R,\n\nBf′ ′ ≡ Bf ′ +\n\nr\nC\nd\n\nand Bg′ ≡ Bg\n\nif g 6= f, f ′\n\nin order to construct a 'less non-normal' covering. Notice that the induced multiplicity and\nthe corresponding subgroup order become relatively prime.\n5\n\n\fStep 3. If Bf = rC + R with r < mf and (r, mf ) = 1, then the composition\nf\n\nr*\n\nb −→ Z/mf −→ Z/mf\nf′ : G\n\nis considered. As before, the integers f (χ)• and f ′ (χ)• are linked by r * f (χ)• = qmf + f ′(χ)• .\nPut\nL′χ ≡ Lχ − q C, Bf′ ≡ R, Bf′ ′ ≡ Bf ′ + C and Bg′ ≡ Bg if g 6= f, f ′\nto get a new covering X ′ and finish the normalization procedure along C.\nExample 1.2. On P2 let Lχ = O(1) and nLχ ≡ H0 + (n − 1)H∞ , where H0 and H∞ are\nb → Z/n involved in (2) are given by\ntwo fixed different lines. Here the only functions f : G\nχ 7→ 1 and by χ 7→ n − 1. In this way, the standard n-cyclic covering S0 → P2 is normal\nand has a singular point above P , the intersection of H0 and H∞ . To desingularize it, we\nconsider the blow-up surface BlP P2 , with E the exceptional divisor and the induced cyclic\ncovering S → BlP P2 . We have nLχ ≡ H0 + (n − 1)H∞ + nE and the induced covering\nS is not normal above E. The normalization procedure leads to S ′ → BlP P2 defined by\nnL′χ ≡ H0 + (n − 1)H∞ , with L′χ ≡ H − E. S ′ is a geometrically ruled surface and the\npull-back of E is a rational section with self-intersection −n, i.e. S ′ is the Hirzebruch surface\nF n.\n\n1.3\n\nMultiplier ideals\n\nLet X be a smooth variety, D ⊂ X be an effective Q-divisor and μ : Y → X be an embedded\nresolution for D. Assume that the support of the Q-divisor KY |X −μ∗ D is a union of irreducible\nsmooth divisors with normal crossing intersections. Then μ∗ OY (KY |X − ⌊μ∗ D⌋) is an ideal\nsheaf J (D) on X. We will denote by Z(D) the subscheme defined by this ideal. Hence\nIZ(D) = J (D). Showing that J (D) is independent of the choice of the resolution, see [10],\nwe have:\nDefinition. The ideal J (D) = μ∗ OY (KY |X − ⌊μ∗ D⌋) is called the multiplier ideal of D.\nThe sheaf computing the multiplier ideal verifies the following vanishing result: for every\ni > 0, Ri μ∗ OY (KY |X − ⌊μ∗ D⌋) = 0. Therefore, applying the Leray spectral sequence, we\nobtain that for every i\nH i (X, OX (KX + L) ⊗ IZ(D) ) = H i (Y, OY (μ∗ KX + μ∗ L + KY |X − ⌊μ∗ D⌋)).\n\n(5)\n\nMoreover,\nKawamata-Viehweg-Nadel Vanishing Theorem. Let X be a smooth projective variety. If L is a Cartier divisor and D is an effective Q-divisor on X such that L − D is a nef\nand big Q-divisor, then\nhi (X, OX (KX + L) ⊗ IZ(D) ) = 0\nfor every i > 0.\n\n6\n\n\fDefinition-Lemma. (see [4]) Let B ⊂ X be an effective divisor and P ∈ B be a fixed\npoint. Then there is an increasing discrete sequence of rational numbers ξi := ξ(B, P ),\n0 = ξ0 < ξ1 < * * *\nsuch that\nJ (ξB)P = J (ξi B)P\n\nfor every\n\nξ ∈ [ξi , ξi+1 ),\n\nand J (ξi+1 B)P ⊂ J (ξi B)P . The rational numbers ξi 's are called the jumping numbers of B\nat P .\n\n2\n\nThe irregularity of cyclic multiple planes\n\nTheorem 2.1. Let B be a plane curve of degree b and let H∞ be a line transverse to B.\nLet S be a desingularization of the projective n-cyclic multiple plane associated to B and H∞ .\n1\nIf J(B, n) is the subset of subunitary jumping numbers of B that live in gcd(b,n)\nZ, then\nX\nq(S) =\nh1 (P2 , IZ(ξB) (−3 + ξb)),\nξ∈J(B,n)\n\nwith Z(ξB) the subscheme defined by the multiplier ideal of ξB.\nThe proof splits naturally into four parts. First, we show that there is a sequence of\nblowing-ups of P3 such that S1 , the strict transform of the multiple plane S0 ⊂ P3 , becomes\na standard cyclic covering of the plane defined by nL′χ ≡ B + (βn − b)H∞ , with β = ⌈b/n⌉\nand L′χ = OP2 (β). Second we choose a desingularization of B such that its total transform\non μ : Y → P2 is a divisor with normal crossing intersections, a log resolution. It induces\na standard cyclic covering S2 . We apply the normalization procedure to it and obtain a\nnormalization S of S0 , defined by the line bundle Lχ and that has only Hirzebruch-Jung\nsingularities.\nS/@\n//@@\n// @@@\n// @\u001f\u001f\n/\nπ // S2\n//\n//\n/\n\n\u0017\u0017 \u000f\u000f\nY\n\n// S1\nμ\n\n// S0\n\n\u000f\u000f\n// P2\n\nThird, we compute the line bundles Lχk 's in terms of the pull-back μ∗ OP2 (1) and the exceptional configuration on Y and get the irregularity of S as a sum of some h1 's. Finally, the\nresult is obtained by applying the Kawamata-Viehweg-Nadel Vanishing Theorem.\nThe first step is given by:\nProposition 2.2. Let S0 be the n-multiple plane associated to the curve B of degree b\nand the line H∞ . There exists a sequence of blowing-ups S1 → S0 such that S1 is the standard\ncyclic covering of the plane determined by\nnL′χ ≡ B + (βn − b)H∞ ,\nwith β = ⌈b/n⌉ and L′χ ≡ βH.\n7\n\n\fProof. Let [x0 , . . . , x3 ] be a homogeneous system of coordinates in P3 . Let Λ be the plane\ndefined by x3 = 0, and let B, H∞ ⊂ Λ be defined by F (x0 , x1 , x2 ) = 0 and x0 = 0, respectively.\nH∞ will be called the line at infinity. The projective n-cyclic multiple plane S0 ⊂ P3 is defined\nby xn3 = x0n−b F (x0 , x1 , x2 ).\nIf deg B = b ≤ n, then things are easy. The point N of homogeneous coordinates [0, 0, 0, 1]\nis not on S0 . The complement of the exceptional divisor E in the blow-up of P3 at N coincides\nwith the total space of the line bundle OP2 (1). Over any open subset xi 6= 0 of the projective\nplane Λ, i = 0, 1, 2, if z = x3 /xi , then z coincides with the tautological section of p∗ OΛ (1)\nwith p : BlN P3 − E → Λ. The zero divisor of p∗ F − z defines S0 . Hence S0 is the standard\ncyclic covering determined by\nnL′χ ≡ B + (n − b)H∞ ,\nwith L′χ ≡ H.\nIf deg B = b > n, then the situation is slightly more complicated since now N lies on S0 .\nLet Ξ be the plane spanned by H∞ and N . In the open set x3 6= 0, S0 is defined by\nub−n\n= F (u0 , u1 , u2 ),\n0\nwith ui = xi /x3 , 0 ≤ i ≤ 2. First, we blow up the projective space at N , X1 = BlN P3 → P3 .\nE ⊂ BlN P3 denotes again the exceptional divisor and L∞ ⊂ E the line that correspond to Ξ,\ni.e. L∞ = Ξ ∩ E. The strict transform S0 is defined by\n(1) b−n\n\nu0\n(1) (1)\n\n(1) n\n\n= u1\n\n(1)\n\n(1)\n\n(1)\n\nF (u0 , 1, u2 )\n\n(1) (1)\n\n(1)\n\n(1)\n\non the subset u0 = u0 u1 , u1 = u1 , u2 = u1 u2 . Notice that the line L∞ : u0 = u1 = 0\nis contained in S0 . What we have to understand is the geometry of S0 along L∞ .\nSecond, we see X1 as P(OΛ ⊗ OΛ (1)) → Λ and make an elementary transform of X1 along\nL∞ . We blow up X1 along L∞ (the trace of the new exceptional divisor on E is denoted by\nL∞ ). Then, we contract the strict transform of Ξ to L∞ . We obtain X2 = P(OΛ ⊗OΛ (2)) → Λ.\nThe new exceptional divisor becomes an F 1 through H∞ and L∞ , and will be denoted by Ξ.\n(1)\n(2)\n(1)\n(2) (2)\n(1)\n(2)\nOn u0 = u0 , u1 = u0 u1 , u2 = u2 , an equation for S0 is\n(2) b−2n\n\nu0\n(2)\n\n(2) n\n\n= u1\n\n(2)\n\n(2)\n\nF (u0 , 1, u2 ),\n\n(2)\n\nwith L∞ : u0 = u1 = 0.\nAfter β − 1 elementary transforms along L∞ , we get S0 ⊂ P(OΛ ⊗ OΛ (β)) → Λ with S0\nlocally characterized by\n(β) b−βn\n(β) n\n(β)\n(β)\nu0\n= u1 F (u0 , 1, u2 ).\n(β)\n\n(β)\n\n(β)\n\nE is defined by u0 = 0 and L∞ by u0 = u1 = 0. The new Ξ is the Hirzebruch surface\n(β)\n(β)\n(β)\nF β . To finish, we put z = 1/u1 and look at x = u0 and y = u2 as to local coordinates\non Λ. Then\nS0 : z n = xβn−b F (x, 1, y).\nThe complement of E in Xβ seen through p : Xβ − E → Λ, coincides with the total space\nof OΛ (β). The coordinate z coincides with the tautological section of p∗ OΛ (β). We conclude\nthat S0 is the standard cyclic covering determined by\nnL′χ ≡ B + (βn − b)H∞ ,\nwith L′χ ≡ βH.\n\n\u0003\n8\n\n\fFor the next step in the proof of Theorem 2.1 we need several preliminary results.\nProposition 2.3. Let Y be smooth and let π : X → Y be a standard cyclic covering of\ndegree n determined by\nX\nnLχ ≡\n[G : Im f̂ ] f (χ)• Bf .\nf ∈F\n\nFor a fixed g ∈ F, the branching divisor Bg is supposed to have a multiple component, say\nBg = rC + R with r > 1. Let X ′ → Y be the standard cyclic covering obtained from X after\nthe normalization procedure has been applied to the multiple component rC. If X ′ is associated\nto\nX\nnL′χ ≡\n[G : Im f̂ ] f (χ)• Bf′ ,\nf ∈F\n\nthen for every k = 1, . . . , n − 1,\n\u0017\n\u0016\n\u0017\n\u0016\nX \u0016 kf (χ)• \u0017\nkg(χ)•\nkrg(χ)•\n′\nC−\nR−\nBf .\nLχk ≡ kLχ −\nmg\nmg\nmf\nf 6=g\n\nProof. If r ≥ mg , then r = qmg + r1 , with 0 ≤ r1 < r. The covering data are modified to\n•\nL(1)\nχ ≡ Lχ − qg(χ) C,\n\nBg(1) ≡ r1 C + R\ng\n\n(1)\n\nand Bf ≡ Bf for f 6= g.\n\n(6)\n\nm\n\nb −→ Z/mg → Z/ g is considered. The integer g(χ)•\nIf (r1 , mg ) = d > 1, then the map g2 : G\nd\nsatisfies\nmg\n+ g2 (χ)• .\n(7)\ng(χ)• = q1\nd\nThe covering data are modified to\n(1)\nL(2)\nχ ≡ Lχ −q1\n\nr1\nC,\nd\n\nBg(2) ≡ R,\n\nBg(2)\n≡ Bg(1)\n+\n2\n2\n\nr1\nC\nd\n\n(1)\n\n(2)\n\nBf ≡ Bf\n\nand\n\nfor f 6= g, g2 . (8)\n\nFinally, if the multiplicity of C, r1 /d, is an integer greater than 1 and prime to mg /d, then\nr1 /d\ng2\nm\nb −→\nthe map g3 : G\nZ/mg −→ Z/ g is considered. We have\nd\n\nr1\nmg\ng2 (χ)• = q2\n+ g3 (χ)• .\nd\nd\n\n(9)\n\nThe covering data are modified to\nL′χ ≡ L(2)\nχ − q2 C,\n\nBg′ 2 ≡ Bg(1)\n,\n2\n\nBg′ 3 ≡ Bg(2)\n+C\n3\n\nand\n\n(2)\n\nBf′ ≡ Bf\n\nfor f 6= g2 , g3 .\n\n(10)\n\nUsing (6), (8)P\nand (10) we have L′χ ≡ Lχ − (qg(χ)• + q1 r1 /d + q2 )C and, since we know that\n′\n′\nLχk ≡ kLχ − ⌊kf (χ)• /mf ⌋ Bf′ , we also have\nL′χk\n\n\u0017\n\u0017\n\u0016\n\u0017\n\u0016\nX \u0016 kf (χ)• \u0017\nkg3 (χ)•\nkg(χ)•\nkg2 (χ)•\nR−\nBg 2 −\n(C + Bg3 ) −\nBf\n≡\n−\nmg /d\nmg /d\nmg\nmf\nf 6=g,g2 ,g3\n\u0017\n\u0017\n\u0013\n\u0016\n\u0012\u0016\n•\nX \u0016 kf (χ)• \u0017\nkg(χ)\nr\nkg3 (χ)•\n1\n•\nR−\n+ kqg(χ) + kq1 + kq2 C −\nBf .\n≡ kLχ −\nmg /d\nd\nmg\nmf\nkL′χ\n\n\u0016\n\nf 6=g\n\n9\n\n\fNow, from (9) and (7), we get successively\n\u0017\n\u0016\n\u0017\n\u0017 \u0016\n\u0016\nkr1 g(χ)•\nkr1 g2 (χ)•\nr1\nkg3 (χ)•\n− kq2 =\n− kq1 − kq2 ,\n=\nmg /d\nmg\nmg\nd\nand finally, by the Euclidean division of r to mg ,\n\u0016\n\u0017\n\u0017 \u0016\nkg3 (χ)•\nkrg(χ)•\nr1\n− kqg(χ)• − kq1 − kq2 ,\n=\nmg /d\nmg\nd\n\u0003\nProposition 2.4. Let X be a normal projective variety and Y be a smooth projective\nvariety. Let π : X → Y be a cyclic covering. If ωX is a dualizing sheaf for X, then\nM\nπ∗ ω X =\nωY ⊗ Lχ ,\nb\nχ∈G\n\nthe action of G on ωY ⊗ Lχ being the multiplication by χ−1 .\nProof. We recall the following construction from [7], III, Ex.6.10 and Ex.7.2 valid for X\nand Y be projective schemes and π : X → Y a finite morphism. For any quasi-coherent\nOY -module G, the sheaf Hom(π∗ OX , G) is a quasi-coherent π∗ OX -module. Hence there exists\na unique quasi-coherent OX -module, denoted π ! G, such that π∗ π ! G = Hom(π∗ OX , G). If\nF is coherent on X and G is quasi-coherent on Y , then there is a natural isomorphism\nπ∗ Hom(F, π ! G) ≃ Hom(π∗ F, G). It yields the natural isomorphism\n≃\n\nHom(F, π ! G) −→ Hom(π∗ F, G)\nsince H 0 (X, Hom(F, π ! G)) ≃ H 0 (Y, π∗ Hom(F, π ! G)). If ωY is the canonical sheaf for Y , then\nit follows that π ! ωY is a dualizing sheaf for X. Hence\nM\nπ∗ ωX = π∗ π ! ωY = Hom(π∗ OX , ωY ) =\nωY ⊗ Lχ .\nb\nχ∈G\n\n\u0003\n\nLemma 2.5. Let S1 → Y be a normal standard cyclic covering of surfaces defined by the\nline bundle L. If S1 has only rational singularities and S → S1 denotes a desingularization\nof S1 , then\nn−1\nn−1\nX\nX\n1\nq(S) = q(Y ) +\nh (Y, ωY ⊗ Lχk ) −\nh2 (Y, ωY ⊗ Lχk ).\nk=1\n\nk=1\n\nε\n\nProof. Since the singularities are rational, if S −→ S1 is a resolution of the singular\npoints of S1 , then Ri ε∗ OS = 0, for all i ≥ 1. From the Leray spectral sequence it follows\nthat hi (S, OS ) = hi (S1 , OS1 ) for all i, and hence χ(OS ) = χ(OS1 ). Then q(S) = q(S1 ) =\npg (S1 ) + 1 − χ(OS1 ) = h0 (Y, π∗ ωS1 ) + 1 − χ(π∗ OS1 ) and using the formulae for π∗ ωS and\nπ∗ OS , we get\nn−1\nn−1\nX\nX\ne =\nq(S)\nh0 (Y, ωY ⊗ Lχk ) + 1 −\nχ(L−1\n).\nχj\nk=0\n\nk=0\n\nBy Serre duality, the required equality follows.\n\n10\n\n\u0003\n\n\fOne more notation is in order. Let P be a singular point of B and let μ : Y → P2 be\na desingularization of B at P , with EP,1 , EP,2 , . . . be the irreducible components of the fibre\nμ−1 (P ) ⊂ Y . E P will denote this finite array of irreducible curves, and if c is a finite array\nof rational numbers c1 , c2 , . . ., then\nX\nc * EP =\ncα EP,α .\n(11)\nα\n\nProof of Theorem 2.1. For any integer n, S0 ⊂ P3 , the n-cyclic multiple plane associated to\nB and H∞ is considered. B is assumed to be reduced and transverse to H∞ . By Proposition\n2.2 there is a convenient sequence of blowing-ups such that S1 , the strict transform of S0 ,\nbecomes a standard cyclic covering of the plane defined by nL′χ ≡ B + (βn − b)H∞ , with\nβ = ⌈b/n⌉ and L′χ ≡ βH. We choose a desingularization of B such that its total transform\nby μ : Y → P2 is a divisor with normal crossing intersections. S1 induces a standard cyclic\ncovering S2 defined by\nX\nnL′′χ ≡ B + (βn − b)H∞ +\ncP * E P .\nP\n\nWe apply the normalization procedure to S2 to end up with a normalization S of S0 that\nhas only Hirzebruch-Jung singularities (see [18], Proposition 3.3). By Proposition 2.3, if S is\ndefined by the line bundle Lχ , then\n\u0017\n\u0016\nX \u0016k \u0017\nk\n′′\n(βn − b) H −\ncP * E P\nLχk ≡ kLχ −\nn\nn\nP\n\u0018 \u0019\nX \u0016k \u0017\nkb\n≡\ncP * E P ,\nH−\n(12)\nn\nn\nP\n\nthe\nP last equality resulting from βk − ⌊k(βn − b)/n⌋ = ⌈kb/n⌉. Here, ⌊kcP /n⌋ * E P denotes\nα ⌊kcP,α /n⌋ EP,α . From Lemma 2.5, since H * (−Lχk ) = − ⌈kb/n⌉ < 0, it follows that\nq(S) =\n\nn−1\nX\n\nh1 (Y, KY + Lχk ).\n\n(13)\n\nk=1\n\nIn order to end the proof we have to take account in the formula above, of the vanishing of\ncertain h1 's and of the equality of the others with certain superabundances of linear systems\non the projective plane.\nClaim. H 1 (Y, ωY ⊗Lχk ) ≃ H 1 (P2 , OP2 (−3+⌈kb/n⌉)⊗IZ(k/nB) ), with Z(k/nB) the scheme\ndefined by the multiplier ideal of k/nB.\n\n11\n\n\fIndeed, by (12) and (5), it follows that\n\u0018 \u0019\nX\u0016k \u0017\nkb\n1\n∗\n1\nH (Y, ωY ⊗ Lχk ) = H (Y, μ ωP2 ⊗ OY (\ncP * E P ))\nH) ⊗ OY (KY |P2 −\nn\nn\nP\n\u0016 \u0017\n\u0018 \u0019\nX\u0016k \u0017\nk\nkb\n1\n∗\ncP * E P ))\nH) ⊗ OY (KY |P2 −\nB−\n= H (Y, μ ωP2 ⊗ OY (\nn\nn\nn\nP\n\u0017\n\u0018 \u0019\n\u0016\nkb\nk\n= H 1 (Y, μ∗ ωP2 ⊗ OY (\nH) ⊗ OY (KY |P2 − μ∗ B ))\nn\nn\n\u0018 \u0019\nkb\n≃ H 1 (P2 , OP2 (−3 +\n) ⊗ IZ( k B) ),\nn\nn\njustifying the claim.\nUsing (13) and the above claim, the irregularity is given by\nq(S) =\n\nn−1\nX\nk=1\n\n\u0019\nkb\n) ⊗ IZ( k B) ).\nh (P , OP2 (−3 +\nn\nn\n1\n\n\u0018\n\n2\n\nIf k/n 6∈ J(B, n), then either k/n is not a jumping number of B, or it is, but kb/n is not an\ninteger. In the former case, if ξ is the biggest jumping number for B smaller than k/n, then,\nsince ⌈kb/n⌉ − ξ > 0,\n\u0018 \u0019\n\u0018 \u0019\nkb\nkb\n1 2\n1 2\n) ⊗ IZ( k B) ) = h (P , OP2 (−3 +\n) ⊗ IZ(ξB) ) = 0\nh (P , OP2 (−3 +\nn\nn\nn\nby Kawamata-Viehweg-Nadel Vanishing Theorem. In the latter case, we apply the same\nargument, now using ⌈kb/n⌉ − kb/n > 0. The result follows.\n\u0003\nCorollary 2.6. Under the hypotheses of Theorem 2.1, if furthermore B is supposed to\nbe an irreducible plane curve, then\nX\nq(S) =\nh1 (P2 , IZ(ξB) (−3 + ξb)),\nξ∈J ′ (B,n)\n\nwith J ′ (B, n) the subset of J(B, n) that contains those rationals ξ for which the denominator\ncan not be the power of a prime.\nProof. In [21] the following topological result is established: If q is the power of a prime\nand B is irreducible and transverse to H∞ , then the q-cyclic multiple plane is regular. By inspecting the formula for the irregularity given in Theorem 2.1 for q-multiple planes associated\nto B and H∞ , q a power of a prime such that there exists a jumping number l/q ∈ J(B, n),\nwe obtain the corollary.\n\u0003\n\n3\n\nThe case of specified singularities\n\nExplicit versions of Theorem 2.1 may be formulated as soon as the multiplier ideals and\nthe jumping numbers can be evaluated. Such an explicit version is obtained, for example,\n12\n\n\fif the singularities of B are locally characterized by the equation xdp − y dq = 0, with p, q\nand d positive integers and p, q relatively prime. Turning to Definition 3.6 where the cluster\nKp,q (α, β) is introduced and if Zp,q (α, β) is the subscheme associated to it, we have:\nCorollary 3.1. Let B be a plane curve of degree b with each of its singular points of\ntype, either A1 , or given locally by the equation xdp − y dq = 0. Let H∞ be a line transverse\nto B and let S be a desingularization of the n-cyclic multiple plane associated to B and H∞ .\nThen\nX\nαp + βq\nb)).\nq(S) =\nh1 (P2 , IZp,q (α,β)\ng (−3 +\ndpq\n(α,β)\n\nαp + βq\nαp + βq\n1\n< 1 and\n∈\nZ. In\ndpq\ndpq\ngcd(b, n)\ngβ) is defined by\naddition, the couple of positive integers (α,\nThe sum ranges over the couples (α, β) such that\n\nmin {α′ p + β ′ q ≥ (α − 1)p + (β − 1)q + 1},\n\n(α′ ,β ′ )\n\ngβ) = ∪P Zp,q (α,\ngβ)P , with P ∈ Sing C not of type A1 .\nand Zp,q (α,\n\nIn this section we mainly want to establish this corollary. We need to control the jumping\nnumbers and the multiplier ideals associated to a curve with this type of singularities. The\nmultiplier ideals and their jumping numbers are known in this case; see for example [3] and\n[4], or [9] for the case of monomial ideals in general. We like to present a different argument\nbased on Enriques diagrams for the particular case of two unknowns, since it will provide a\nsimple interpretation of the multiplier ideals involved, and also, could provide an algorithm\nfor the generalization to an arbitrary singular point of a curve on a surface.\n\n3.1\n\nClusters and Enriques diagrams\n\nLet X be a surface and P ∈ X a smooth point. A point Q is called infinitely near to P\nif Q ∈ X ′ , μ : X ′ → X is a composition of blowing-ups and Q lies on the exceptional\nconfiguration that maps to P .\nDefinition. A cluster in X, centered at a smooth point P is a finite set of weighted infinitely\nnear points to P , K = {P1w1 , . . . , Prwr }, with P1 = P .\nLet μ : Y → X be the composition of blowing-ups Y = Yr+1 → Yr → * * * → Y1 = X,\nwith Yα+1 = BlPα Yα . Since the points infinitely near P are partially ordered-the point Q\nprecedes the point R if and only if R is infinitely near Q-the points of a cluster are partially\nordered. In the sequel, if K is a cluster, then all points preceding a point that belongs to K\nare in K, possibly with weight 0.\nLet K be a cluster centered at P . Each point Pα corresponds to an exceptional divisor\nEα ⊂ Yα+1 . All its strict transforms will also be denoted by Eα and the total transform\nof each Eα will be denoted by Fα . When needed, the strict transform of Eα on Yβ will be\n(β)\n(α+1)\n(α+1)\ndenoted by Eα , and similarly for the totalP\ntransform. For example Fα\n= Eα\n.\nEvery cluster K defines a divisor DK = wα Fα on Y and an ideal sheaf μ∗ OY (−DK ) on\nX, hence a subscheme ZK of X. The lemma below clarifies the comparison between the ideal\nsheaf OY (−DK ) and the pull-back μ∗ μ∗ OY (−DK ).\n13\n\n\fDefinitions. Let K be a cluster. A point Pβ is said to be proximate to Pα if Pβ lies on\nEα , the exceptional divisor corresponding to the blowing-up at Pα , or on one of its strict\ntransforms.\nA cluster K is said to satisfy the proximity relations if for every Pα in K,\nX\nwβ ≤ wα .\nwα =\nPβ proximate to Pα\n\nLemma 3.2 (see also [2], Theorem 4.2). Let K = {P1w1 , . . . , Prwr } be a cluster that contains\nw′\n\nw′\n\na point Pα for which the proximity relation is not satisfied. If K ′ = {P1 1 , . . . , Pr r } is the\ncluster defined by wα′ = wα +1, wβ′ = wβ −1 for every β with Pβ proximate to Pα , and wγ′ = wγ\notherwise, then K and K ′ define the same subscheme in X, i.e. μ∗ OY (−DK ) = μ∗ OY (−DK ′ ).\nK ′ is said to be obtained from K by the unloading procedure. Starting from K, iterated\ne that satisfies the proximity relations and\napplications of this procedure lead to a cluster K\ne is called the unloaded cluster. Notice that\ndefines the same subscheme in X. K\nμ∗ μ∗ OY (−DK ) ≃ μ∗ μ∗ OY (−DKe ) ≃ OY (−DKe ).\n\nRemark. If wr < 0, then the proximity relation is not satisfied at Pr since w r = 0. When\nthe unloading procedure of Lemma 3.2 is applied to a cluster with non-negative weights,\nit may happen that a weight becomes negative, or more precisely, becomes −1. But it is\nto be noticed that the negative weight is eventually rubbed out by the next applications of\nthe procedure, and that the unloaded cluster has only non-negative weights. Moreover, the\nunloaded cluster associated to a cluster with non-positive weights is the empty cluster, the\none with all its weights equal to 0.\nDefinition. A gridded tree is a couple (T, g), where T = T (V, A) is an oriented tree with\nV the set of vertices and A the set of arcs, and g is a map\ng : A → {slant, horizontal, vertical}.\nDefinition. Let T be a gridded tree. A horizontally (vertically) L-shape branch of T is an\nordered chain of arcs, such that each begins where the previous ends, and such that all are\nhorizontal (vertical), but the first.\nNotice that an L-shape branch is completely determined by the subset of incident vertices\nof it. Moreover, an arc is an L-shape branch, regardless its value through g.\nDefinition. Let T be a gridded tree. A segment is a maximal chain of arcs of the same\ntype through g, arcs that are also maximal L-shape branches.\nExample 3.3. Let p < q be relatively prime positive integers. Tp,q will denote the gridded\ntree associated to the Euclidean algorithm. If r0 = a1 r1 + r2 , . . . , rm−2 = am−1 rm−1 + rm and\nrm−1 = am rm , with r0 = q and r1 = p, then Tp,q has d segments containing a1 , . . . , am−1 and\nrespectively am vertices each. The first segment is slanted and the others are alternatively,\neither horizontal or vertical, starting with a horizontal one.\n\n14\n\n\fDefinition. An Enriques diagram is an weighted gridded tree.\nClusters and Enriques diagrams carry the same information as the lemma below asserts,\nand it will often be convenient to argue using diagrams.\nDefinition. A point of a cluster is said to be free if it is proximate to exactly one point\nof the cluster. A point is said to be a satellite if it is proximate to exactly two points of the\ncluster.\nLemma 3.4 (see [6]). There exists an unique map from the set of clusters in X centered\nat a smooth point P to the set of Enriques diagrams such that:\n1. for every cluster K = {P1w1 , . . . , Prwr } the set of vertices of the image tree is V =\n{P1 , . . . , Pr } with the weights given by the integers w1 , w2 , . . . , wr ;\n2. at every point ends at most one arc;\n3. a point Pα is satellite if and only if there is either a horizontal or a vertical arc that\nends at the vertex Pα ;\n(β)\n4. if there is an arc that begins at the vertex Pα and ends at the vertex Pβ then Pβ ∈ Eα ,\nand the converse is true if Pβ is free;\n5. Pβ is proximate to Pα if and only if there is an L-shape branch that starts at Pα and\nends at Pβ ;\n6. the strict transforms Eα and Eβ intersect on Y if and only if the Enriques diagram\ncontains a maximal L-shape branch that has Pα and Pβ as its extremities;\n7. an arc that begins at a vertex of a free point and ends at a vertex of a satellite point is\nhorizontal.\n\n3.2\n\nThe minimal unloaded clusters associated to a Tp,q tree\n\nLet p < q be relatively prime positive integers. All clusters treated in this subsection will\nbe associated to the gridded tree Tp,q introduced in Example 3.3. The intent is to look for a\ncharacterization of the minimal unloaded clusters modeled on Tp,q . We refer to Lemma 3.7\nfor the result.\nDepending on the context its vertices will be denoted either by Pα i.e. using one subscript\n1 ≤ α ≤ r = a1 + * * * + am , or by Pk,i , i.e. using two subscripts 1 ≤ k ≤ d, 1 ≤ i ≤ ak . T3,5 is\nrepresented below in the latter notation.\nP3,2\nP2,1\n\nP3,1\n\nP1,1\nLet K be a cluster. We define the proximity matrix of K by Π = ||pαβ ||, where the\nelements of the diagonal equal 1 and, for every α 6= β, the element pαβ equals −1 if Pβ is\nproximate to Pα and 0 if not. Notice that along the α column of Π, the non-zero elements\nnot on the diagonal correspond to the points to which Pα is a satellite.\n\n15\n\n\fThe proximity matrix is the decomposition matrix of the strict transforms Eα 's in terms\nof the total transforms Fα 's. Hence if K = {P1w1 , . . . , Prwr }, then on Y ,\nX\nX\nDK =\nwα Fα =\ncα Eα ,\nα\n\nα\n\nand c = w Π−1 , where w = (w1 , . . . , wr ) and similarly c = (c1 , . . . , cr ). The formula\nX\nFβ\nEα = Fα −\nPβ proximate to Pα\n\nand induction on α tell us that the coefficient of Er in the decomposition of a total transform\ncorresponding to a point lying on the kth segment in terms of strict transforms equals the\nremainder rk introduced in Example 3.3.\nLemma 3.5. If K = {P1w1 , . . . , Prwr } is an unloaded cluster centered at P , then the coefficient of Er is of the form ap + bq, with a, b non-negative integers.\nProof. We shall denote the weights on the kth segment of the Enriques diagram for the\ncluster K by wk,1 , wk,2 , . . . , wk,ak and the coefficient of Er by cr . We shall successively transform the cluster, each time considering the last segment that contains non-zero weights, unless\nthis segment is the first or the second one. The transformation is P\nthe following: if the last\nsegment with non-zero weights is the segment k + 1, and if wk,ak = i wk+1,i , then put\n′\n= 0 for 1 ≤ i ≤ ak+1 ,\n1. wk+1,i\n\n′ =w\n2. wk,i\nk,i − w k,ak for 1 ≤ i ≤ ak ,\n′\n3. wk−1,1\n= wk−1,1 + wk,ak ,\n\nand leave the other weights unchanged. It is easy to see that the cluster K ′ defined by the\n′ is again unloaded and that the coefficient of E remains unchanged. Hence the\nweights wk,i\nr\nsame process can be applied till eventually K is transformed into the cluster K ′ with non-zero\nweights only on the first and, at the most, the second segments of the Enriques diagram. K ′\nis unloaded and\ncr = c′r = p\n\na1\nX\ni=1\n\n′\nw1,i\n+ r2\n\na2\nX\n\n′\nw2,j\n=p\n\na1\nX\n′\n(w1,i\n− w′ 1,a1 ) + qw′ 1,a1 ,\ni=1\n\nj=1\n\nwhere q = a1 p + r2 .\n\n\u0003\n\nBesides, since for each couple of non-negative integers a, b there exists an unloaded cluster\nwith ap + bq the coefficient of Er -for example the cluster with w1,1 = a + b, w1,i = b for\ni 6= 1, w2,1 = b and wk,i = 0 otherwise-, the ideal sheaf μ∗ OY (−(ap + bq)Er ) defines the\nminimal unloaded cluster having ap + bq the coefficient of Er . It is natural to ask the question\nwhether we can decide if an unloaded cluster is minimal only by inspection of its weights, or\nequivalently its associated divisor. The answer is yes and is given by the lemma hereafter. It\nwill deal with clusters satisfying the following condition:\n\n16\n\n\f(∗) for every ordered chain of maximal L-shape branches determined by the points\nPα1 , . . . , Pαl , i.e. each Pαj precedes Pαj+1 and the jth maximal L-shape branch\nstarts at Pαj and ends at Pαj+1 , then\nl\nl\nX\nX\npαj + 2 − l.\n(wαj − wαj ) <\nj=1\n\nj=1\n\nDefinition 3.6. If a and b are non negative integers, Kp,q (a, b) denotes the minimal unloaded\ncluster associated to the Tp,q tree and whose coefficient of the last strict transform equals\nap + bq.\nLemma 3.7. Let K be an unloaded cluster with ap + bq the coefficient of its last strict\ntransform. K satisfies (∗) if and only if K = Kp,q (a, b).\nProof. We start by showing that a minimal unloaded cluster K min always satisfies (∗).\nIndeed, if not, there would exist a chain of maximal L-shape branches such that pαj ≥\nP\nP\nwαj − w αj for 1 ≤ j ≤ l, and that l1 wαj − w αj ≥ l1 (pαj − 1) + 2. Furthermore, since there\nwould be at least two points such that pα = wα − w α , we may always assume wα1 − wα1 = pα1 ,\nwαj − w αj = pαj − 1 for 2 ≤ j ≤ l − 1, and wαl − w αl = pαl . Now for this chain, we could\napply the inverse of the unloading procedure successively at Pα1 , Pα2 , . . . , Pαl to end up with\nan unloaded cluster with the same coefficient for Er as K min , hence a contradiction.\nTo end the proof, we assume that K 6= K min , K and K min having the same coefficient for\nEr , and show that K does not satisfy (∗). Since it is satisfied by K min , we notice that along\neach segment of K min , there is at most one jump of height 1. We may further assume that\nmin + 1. To make up for the apparent increase of c\nw1,1 ≥ w1,1\nm,am (= cr ) by at least r1 = p\nmin\ndue to the difference between w1,1 and w1,1 , some of the weights along the next segments of\nK must be smaller than the corresponding weights of K min , but not along the first segment.\nLooking at the points on the second segment and at the first point of the third segment for\nthis counterbalance problem, we notice that at most one of their weights may not diminish,\notherwise (∗) will not be satisfied somewhere along the following segments. Two possibilities\nmin − 1 and, either\ncan appear. First, all a2 weights of the second segment satisfy w2,i ≤ w2,i\nmin − 1, or w\nmin\nthere exists an i such that w3,i ≤ w3,i\n3,i = w3,i for all i's. In the former case (∗)\nis not verified at P1,a1 , P3,1 , P3,2 , . . . , P3,i , and in the latter the same counterbalance problem\nmust be solved for a difference of r3 units, starting with the fourth segment. Second, the\nmin − 1 are verified for all but one point of the second segment, and\ninequalities w2,i ≤ w2,i\nmin − 1. There is a counterbalance problem left for r units, starting with the third\nw3,1 ≤ w3,1\n2\nsegment. Eventually, the counterbalance problem is pushed on to the last segment and hence\n(∗) will not be satisfied there for K.\n\u0003\n\n3.3\n\nThe multiplier ideals and the jumping numbers for (xdp , y dq )\n\nLet P be a singular point of B ⊂ X given locally by xdp + y dq = 0, with p, q and d positive\nintegers and p ≤ q relatively prime, and let μ : Y → X be the minimal log resolution of B at\nP . The exceptional configuration of μ is given by the gridded tree Tp,q . As before, we shall\ndenote by Er the last strict transform.\n\n17\n\n\fLemma 3.8. The coefficient of Er in −KY |X + ⌊μ∗ ξB⌋ equals ⌊dpqξ⌋ − (p + q − 1).\nProof. It is sufficient to determine the coefficient of Er in μ∗ B. By Example 3.3 and the\ndecomposition of the Fα 's in terms of the strict transforms, we have that the coefficient of Er\n2 = dpq.\n\u0003\nis a1 r12 + * * * + am rm\nProposition 3.9. If cr is the coefficient of Er in −KY |X + ⌊μ∗ ξB⌋, then the multiplier\nideal J (ξB) is given by\nJ (ξB) = μ∗ OY (−cr Er ),\ni.e. is the ideal sheaf associated to the minimal cluster that contains cr Er .\nProof. We shall argue on the cluster associated to the divisor −KY |X + ⌊μ∗ ξB⌋. To find\nthe multiplier idealPis equivalent to determine the unloaded corresponding\nP cluster. Let the\npull-back of B be r1 cα Eα + B = c * E + B. Then −KY |X + ⌊μ∗ ξB⌋ = r1 wα Fα = w * F ,\nwith w = −ω + ⌊ξc⌋ * Π and ω = (1, . . . , 1).\nLet Pα1 , . . . , Pαl be ordered points that determine a chain of maximal L-shape branches.\nSince\n(14)\nw − w = w t Π = ⌊ξc⌋ Π t Π − ω t Π,\nwhere the matrix −Π Πt is the intersection matrix of the strict transforms Eα 's on the surface\nY , for every 1 ≤ j ≤ l,\n\u0005\n\u0005 \u0004\n\u0005\n\u0004\n\u0004\nwαj − wαj = − ξcαj−1 + (pαj + 1) ξcαj − ξcαj+1 + (pαj − 1).\nP\nSo lj=1 (wαj − w αj ) equals\n− ⌊ξcα0 ⌋ + pα1 ⌊ξcα1 ⌋ +\n\nl\nl−1\nX\n\u0005\n\u0004\n\u0005 X\n\u0004\n(pαj − 1),\n(pαi − 1) ξcαj + pαl ⌊ξcαl ⌋ − ξcαl+1 +\nj=1\n\nj=2\n\nand since c Π t Π = (0, . . . , 0, d), we have\n−2 <\n\nl\nX\n\n(wαj − w αj ) <\n\nj=1\n\nl\nX\n\npαj + 2 − l.\n\n(15)\n\nj=1\n\nPutting l = 1 we observe that if the proximity relation is not satisfied at Pα , then wα − wα =\n−1. But the unloading procedure of Lemma 3.2 at Pα changes the vector w−w into the vector\nw − w + (Π t Π)α . It follows that the unloading procedure does not change the inequalities\nin (15) for the new cluster. We conclude that the unloaded cluster satisfies (∗), hence, by\nLemma 3.7, the result.\n\u0003\nProposition 3.10. The jumping numbers of B at P are (ap + bq)/(dpq) with a, b positive\nintegers.\nProof. Let ξ be a jumping number and K ′ the corresponding unloaded cluster and let,\nby Lemma 3.5, c′r = a′ p + b′ q be its coefficient for Er with a′ , b′ non-negative integers. By\nLemma 3.8 and Proposition 3.9, we have\n⌊dpqξ⌋ − (p + q − 1) = ap + bq + 1 ≤ a′ p + b′ q\nwhere a and b are non-negative integers, and a′ p+b′ q is the first integer combination of p and q\nwith this property. So, by the definition of the jumping numbers, ξ = ((a+1)p+(b+1)q)/(dpq).\n\u0003\n18\n\n\fProof of Corollary 3.1. We know that the irregularity is given by\nX\nh1 (P2 , IZ(ξB) (−3 + ξb))\nξ∈J(B,n)\n\nwith J(B, n) the subset of jumping numbers ξ of B of the form k/n, 0 < k < n, and such\nthat ξb is an integer. By Proposition 3.10, it is sufficient to describe the subscheme associated\nto the multiplier ideal J (ξB) for every ξ = (αp + βq)/(dpq) ∈ J(B, n). By Proposition 3.9,\nLemma 3.8 and Lemma 3.7, the subscheme is given by the minimal unloaded cluster whose\ncoefficient for the last strict transform is the first integer combination of p and q not smaller\nthan (α − 1)p + (β − 1)q + 1.\n\u0003\nRemark 3.11. Since many of the applications in the next section will be for a curve B with\nsingularities of a given type A• , we interpret Corollary 3.1 for this situation. If P1 , . . . , Pr\nare the infinitely near points to P = P1 involved in the minimal log resolution of an A• type\n[α]\nsingularity at P , we shall denote by ZP the curvilinear subscheme associated to the unloaded\n[α]\ncluster {P1 , . . . , Pα }, and by Z [α] = ∪ZP .\ni) If the singularities of B are of type A1 or A2r−1 , i.e. p = 1, q = r and d = 2, then\nq(S) =\n\nX\n\nh1 (P2 , IZ [α] (−3 +\n\nα\n\n(α + r)b\n)),\n2r\n\n1\nα ranging from 1 to r − 1 such that α+r\n2r ∈ gcd(b,n) Z.\nii) If the singularities of B are of type A1 or A2m , i.e. p = 2, q = 2m + 1 and d = 1, then\n\nq(S) =\n\nX\n\nh1 (P2 , IZ [α] (−3 +\n\nα\n\nb\nαb\n+ )),\n2m + 1 2\n\nn and b are even, and α ranges from 1 to m such that\n\n4\n\nα\n2m+1\n\n∈\n\n1\ngcd(b,n)\n\nZ.\n\nApplications\n\nWe shall now apply the results in the previous sections to illustrate how to compute in an\nuniform way, the irregularity for some examples of cyclic multiple planes.\n\nZariski's example\nThe curve B is irreducible, of degree 6 and has six cusps as singularities. In the formula for\nthe irregularity of the 6-cyclic multiple plane in Remark 3.11 ii), since m = 1, α may only be\n1. Hence q(S) = h1 (P2 , IZ (2)), where Z is the support of the cusps. So either the cusps lie\non a conic and the irregularity is 1, or they do not, and the irregularity is 0. Notice that the\nresult is the same for every n-cyclic multiple plane, provided that 6 divides n.\n\n19\n\n\fArtal-Bartolo's first example in [1]\nLet C ⊂ P2 be a smooth elliptic curve and let P1 , P2 , P3 be three inflexion points of C, with\nLi the tangent lines at Pi to C. Taking B = C + L1 + L2 + L3 we construct the multiple\ncyclic plane with three sheets S0 associated to B and H∞ . The curve B has three points of\ntype A5 at the Pi 's, hence n = 3, b = 6 and r = 3 in Remark 3.11 i). We have\nq(S) = h1 (P2 , I{P1 ,P2 ,P3 } (1)).\nSo, if the three inflexion points are chosen on a line, then the irregularity is 1. If the points are\nnot aligned, then the irregularity is 0. These two configurations give an example of a Zariski\npair.\n\nArtal-Bartolo's second example in [1]\nLet P be a fixed point and K = {P1 , . . . , P9 } a cluster centered at P , all its points being free.\nIt represents a curvilinear subscheme Z = ZK . In [1], Artal-Bartolo considers sextics with an\nA17 type singularity at P , with P2 , . . . , P9 the infinitely near points of the minimal resolution.\n1) If P3 lies on the line L determined by P1 and P2 and if K does not impose independent\nconditions on cubics, then all sextics are reducible. Let B be the union of two smooth cubics\nfrom |IZ (3)|, and let H∞ be a line transverse to B. If S0 is the 3-cyclic multiple plane\nassociated to B and H∞ , then by Remark 3.11 i),\nq(S) = h1 (P2 , IZ [3] (1)) = 1.\nSimilarly, if S0 is the 6-cyclic multiple plane, then\nq(S) = h1 (P2 , IZ [3] (1)) + h1 (P2 , IZ [6] (2)) = 2,\nsince there is no irreducible conic through Z [6] -i.e. through the points P1 , . . . , P6 - but the\ndouble line 2L: if K ′ = {P12 , P22 , P32 }, then Z [6] ⊂ ZK ′ .\nMore generally, if S0 is the n-cyclic multiple plane associated to B and H∞ , then by the\nsame argument it follows that q(S) = 2 when n ≡ 0 mod 6, q(S) = 1 when n ≡ 3 mod 6,\nand q(S) = 0 otherwise.\n2) If P3 ∈\n/ L and P6 ∈ Γ, the conic through P1 , . . . , P5 , then there exists an irreducible\nsextic with an A17 type singularity at P , such that the intersection with Γ is supported only\nat P . If S0 is the n-cyclic multiple plane associated to B and to a transverse line to it, then\nq(S) = h1 (P2 , IZ [6] (2)) = 1\nwhen n is divisible by 6, and q(S) = 0 otherwise.\n3) If P3 ∈\n/ L and P6 ∈\n/ Γ, the conic through P1 , . . . , P5 , then, for every reduced sextic B\nwith an A17 type singularity at P , if S0 is the n-cyclic multiple plane associated to B and to\na transverse line to it, then q(S) = 0.\nRemark. In [1] it is shown that in the third case above, two configurations may appear:\neither P1 , . . . , P9 do not impose independent conditions on cubics and B is the union of two\nsmooth cubics, or the points impose independent conditions on cubics and B is irreducible.\nUsing these and the two configurations in 1) and 2), two more Zariski couples are thus produced there.\n20\n\n\fOka's example in [17]\nIn [17], when p and q are relatively prime integers, Oka constructs the curve Cp,q of degree pq\nenjoying the following property: Cp,q has pq cusp singularities each of which is locally defined\nby the equation xp + y q = 0. We shall show that the pq-multiple plane associated to Cp,q is\nirregular, the irregularity being equal to (p − 1)(q − 1)/2.\nWe start with the particular case p = 2, since all ideas of the general computation are\nalready present in this situation. The construction of the branching curve B = C2,2m+1 is as\nfollows. Let C ⊂ P2 be a curve of degree 2m + 1 and let Γ be a conic transverse to C. If f = 0\nand g = 0 are homogeneous equations for C and Γ respectively, then the curve B is defined\nby f 2 + g 2m+1 = 0. It is a curve of degree 4m + 2 with 4m + 2 singular points of type A2m .\nLet S0 be the (4m + 2)-cyclic multiple plane associated to B and let S be the normal cyclic\ncovering constructed in Section 2.\nClaim. q(S) = m.\nP\n1 2\nTo see this, we apply Remark 3.11 ii) to obtain q(S) = m\nα=1 h (P , IZ [α] (2m + 2α − 2)),\n[α]\n[α]\nwhere Z [α] = ∪P ZP and ZP is the curvilinear subscheme associated to the cluster {P1 =\nP, P2 , . . . , Pm+2 }. We shall show that all the terms of the sum equal 1. To do this, we apply\nthe trace-residual exact sequence with respect to Γ, see [8] or Remark 4.1, and obtain\n0 −→ IZ [α−1] (2m + 2α − 4) −→ IZ [α] (2m + 2α − 2) −→ OP1 (4α − 6) −→ 0.\nSince C ∈ |IZ [m+1] (2m + 1)|, the map H 0 (P2 , IZ [α] (2m + 2α − 2)) → H 0 (P1 , OP1 (4α − 6)) from\nthe long exact sequence in cohomology is surjective for every 1 ≤ α ≤ m. Hence\nh1 (P2 , IZ [r] (4r − 2)) = * * * = h1 (P2 , IZ [1] (2r)) = h1 (P1 , OP1 (−2)) = 1.\nRemark. The irregularity of the n-cyclic multiple plane associated to B and to a line\nH∞ transversal to B, n being an arbitrary positive integer, may be computed by the same\nargument. Of course, if 2m + 1 is a prime number, then q(S) = 0 unless 4m + 2 divides n,\nsee Corollary 2.6. But if 2m + 1 is not a prime number, then irregular cyclic multiple planes\nexist for other values of n. For example, if 2m + 1 = 15 and n = 40, then\nq(S) = h1 (P2 , IZ [3] (18)) + h1 (P2 , IZ [6] (24)) = 2.\nIn the general case, if p < q, let B = Cp,q and Cp and Cq be the smooth curves of degree\np and respectively q used in the construction of B. Cp and Cq intersect transversely and if P\nis an intersection point, then B has a singularity at P given locally by an xp + y q = 0 type\nequation.\nClaim. q(S) = (p − 1)(q − 1)/2.\nBy Corollary 3.1,\nX\nq(S) =\n\nα,β≥1\nαp+βq<pq\n\nh1 (P2 , IZp,q (α,β)\ng (−3 + αp + βq)).\n\nThe sum consists of (p − 1)(q − 1)/2 terms, and as before, we shall show that each of them\nequals 1. For an arbitrary couple (α, β), with α ≥ 2, we first apply the trace-residual exact\nsequence α − 1 times with respect to Cp . We have\nρ\n\n0 → IZ(α−1,β)\ng (−3 + αp + βq) → ITr\n^ (−3 + (α − 1)p + βq) → IZ(α,β)\n\nCp\n\n21\n\ng\nZ(α,β)\n\n(−3 + αp + βq) → 0.\n\n\fgβ). Since the cluster is not greater than\nLet w1 be the weight of P1 = P in the cluster Kp,q (α,\ngβ) ⊂ w1 Cq\nKp,q (0, ⌊(α − 1)p/q⌋ + β), it is easy to see that w1 ≤ ⌊(α − 1)p/q⌋ + β. Then Z(α,\nand together with the identity\n\u0012\n\u0016\n\u0017 \u0013 \u0012\u0016\n\u0017\n\u0013\n(α − 1)p\n(α − 1)p\n−3 + αp + βq = −3 + p + (α − 1)p −\nq +\n+ β − w1 q + w1 q\nq\nq\nimply the surjectivity of H 0 ρ. We conclude that\n1 2\nh1 (P2 , IZ(α,β)\ng (−3 + αp + βq)) = h (P , IZ(1,β)\nf (−3 + p + βq))\n\n(16)\n\nwhenever α ≥ 2. Then, in case β ≥ 2, we apply β − 1 times the trace-residual exact sequence\ng\nwith respect to Cq starting with the subscheme Z(1,\nβ). As before, we have\nρ\n\n0 → IZ(1,β−1)\nf (−3 + p + βq) → ITr\n^ (−3 + p + (β − 1)q) → IZ(1,β)\n\nCq\n\nf\nZ(1,β)\n\n(−3 + p + βq) → 0,\n\nthe surjectivity of H 0 ρ being given by the inequality w < 1 + (β − 1)q/p, with w the sum of\ng\ng\nthe weights of the points P1,1 , . . . , P1,a1 , P2,1 in Kp,q (1,\nβ) and the inclusion Z(1,\nβ) ⊂ wCp .\nSo\n1 2\nh1 (P2 , IZ(1,β)\n(17)\nf (−3 + p + βq)) = h (P , IZ(1,1)\nf (−3 + p + q)).\n\nf1) = ∪P P , we apply once more the trace-residual exact sequence of\nFinally, since Zp,q (1,\nf1) with respect to Cp and get\nZ(1,\n0 −→ OP2 (−3 + q) −→ IZ(1,1)\nf (−3 + p + q) −→ OCp (−3 + p) −→ 0.\n\n1\nSince q > p, h1 (P2 , IZ(1,1)\nf (−3 + p + q)) = h (Cp , OCp (−3 + p)) = 1. Together with (16) and\n(17) finish the claim.\n\nRemark 4.1 (The trace-residual exact sequence). Let X be a projective variety, D be\na Cartier divisor on X and Z be a a closed subscheme of X. The schematic intersection\nTrD Z = D ∩ Z defined by the ideal sheaf (ID + IZ )/ID is called the trace of Z on D. The\nclosed subscheme ResD Z ⊂ X defined by the conductor ideal (IZ : ID ) is called the residual\nof Z with respect to D. Following [8], the canonical exact sequence\n0 −→ IRes Z (−D) −→ IZ −→ ITr Z −→ 0.\nis called the trace-residual exact sequence of Z with respect to D.\n\nA specialization of Oka's example when p = 2\nKeeping the notation from the first part of the previous paragraph, the conic Γ is now the\nunion of two distinct lines that intersect at O and C is a smooth curve of degree 2m + 1\npassing through O and intersecting transversely the lines of Γ at this point. The curve B has\n4m points of type A2m and one singular point at O of type A4m+1 . It can be shown that\nthe irregularity of the (4m + 2)-cyclic multiple plane associated to B is again m. We develop\nthe computation for m = 2. In this case, B is a curve of degree 10 with 8 points of type A4\n\n22\n\n\fand one point of type A9 . By Theorem 2.1 and using the notation from Remark 3.11, the\nirregularity is given by\nh1 (P2 , Iξ [1] ∪Z [2] (4)) + h1 (P2 , Iξ [2] ∪Z [4] (6)),\nO\n\nO\n\n[2]\n\nwhere ξ [1] is the support of the points of type A4 and ξ [2] = ∪P of type A4 ZP is the support\nplus the tangent directions. Now, 10 points on a conic do not impose independent conditions\non quartics, hence the first term is 1. The second term is seen to be equal to the first\nafter applying the trace-residual exact sequence with respect to the two lines of Γ. So the\nirregularity is 2.\nThe computations for m = 1 lead to a branching curve of degree 6 with 4 cusps and an A5\nsingularity at O. The irregularity of a 6-cyclic multiple plane is 1, given by h1 (P2 , Iξ [1] ∪Z [2] (2)).\nO\nIf in addition, the two lines of the degenerate conic Γ are brought together such that the cusps\ncollapse two by two, the branching curve has 3 A5 singularities. For a 6-multiple plane, q = 2,\nwith the contributions of the superabundance of the singularities with respect to the lines and\nthe conics both equal to 1. Necessarily, by Corollary 2.6, the branching curve is reducible; it\nis Artal-Bartolo's first example.\n\nLine arrangements following [5]\nIn this example we consider as branch curve a line arrangement B = ∪bi=1 Li ⊂ P2 that has only\nnodes and ordinary triple points as singularities. For an ordinary triple point 2/3 is the only\nsubunitary jumping number. By Corollary 3.1, if H∞ is a line transverse to B = ∪bi=1 Li , then\nthe normal n-cyclic covering S corresponding to the n-cyclic multiple plane associated to B\nand H∞ is irregular if and only if 3 divides both b and n, and |IZ (−3 + 2b\n3 )| is superabundant,\nin which case\n2b\nq(S) = h1 (P2 , IZ (−3 + )).\n3\nIn case S is irregular, it can be shown that the irregularity is bounded by a constant depending\non the arrangement B. More precisely, we have\nProposition 4.2. Let B = ∪bi=1 Li , H∞ and S be as above with b and n divisible by 3. If\nti is the number of triple points lying on the line Li for each i, then\nb\n\nq(S) ≤ min ti .\ni=1\n\nFor the proof (see [5] for a different argument), we will start with a preliminary lemma.\nLemma 4.3. If 3 divides both b and n and if one line of the arrangement contains no triple\npoint, then q(S) = 0.\nProof. Let B ′ be the arrangement of the b − 1 lines of B except the one one with no\ntriple point. If S ′ is the normal n-cyclic covering corresponding to the n-cyclic multiple plane\nassociated to B ′ and H∞ , then q(S ′ ) = 0 since 3 does not divide deg B ′ . Taking k = 2n/3\nand denoting by Z the support of the triple points, we obtain\n\u0019\n\u0018\n2b\n2(b − 1)\n1 2\n) = h1 (P2 , IZ (−3 + ) = q(S).\n0 = h (P , IZ (−3 +\n3\n3\n\u0003\n23\n\n\fProof of Proposition 4.2. Let us S\nsuppose that L1 is the line containing the minimum\nnumber of triple points. If B ′ = L′1 ∪ i6=1 Li is a line arrangement with no triple point on\nL′1 , then by the previous lemma, h1 (P2 , IResL1 Z (−3 + 2b/3)) = 0. But\nh1 (P2 , IZ (−3 +\n\n2b\n2b\n)) ≤ h1 (P2 , IResL1 Z (−3 + )) + card(Z − ResL1 Z) = t1 ,\n3\n3\n\nhence the result.\n\n\u0003\n\nExample. Let B be the line arrangement of 9 lines with 9 triple points represented below.\nIn a convenient affine coordinate system (x, y), the triple points that lie in the affine plane\nare the following: (0, 0), (±2, −2), (−2, 0), (0, s), (2, s) and 2s/(s + 4) (−1, 1), with s 6= −2, 0\nand 2.\n\nO\n\nIt is easy to see that there are two cubics-each the union of three lines-through the 9 triple\npoints, i.e. the system of cubics through the points is superabundant. It follows that the\nirregularity of the n-cyclic multiple plane associated to B and to a line H∞ transverse to B,\nis 1 if and only if 3 divides n.\nIf s = 2, then the arrangement specialize to an arrangement with 10 triple points, 4 of\nthem lying on the line x + y = 0. But these points lie on a cubic, the union of three of the\nlines of B, and again h1 (P2 , IZ (3)) = 1, hence the irregularity is 1 in this case too.\nRemark 4.4. The irregularity depends on the position of the line H∞ with respect to B.\nTo see this, let B be the line arragement below of 5 lines with 2 triple points.\n\nQ\nP\n\nIf H∞ is transverse to B, then the irregularity of the 6-cyclic multiple plane is 0. But if H∞\nis the line through the double points P and Q then the irregularity jumps to 1.\n\n24\n\n\fReferences\n[1] E. Artal-Bartolo, Sur les couples de Zariski. J. Algebraic Geom. 3 (1994), 223–247.\n[2] E. Casa-Alvero, Infinitely near imposed singularities and singularities of polar curves.\nMath. Ann. 287 (1990), 429–454.\n[3] L. Ein, Multiplier ideals, vanishing theorems and applications. Algebraic geometry-\nSanta Cruz 1995, 203–219.\n[4] L. Ein, R. Lazarsfeld, K. E. Smith and D. Varolin, Jumping coefficients of multiplier ideals. Duke Math. J. 123 no. 3 (2004), 469-506.\n[5] H. Esnault, Fibre de Milnor d'un cône sur une courbe algébrique plane. Invent. Math.\n68 (1982), 477–496.\n[6] L. Evain, La fonction de Hilbert de la réunion de 4h gros points gńériques de P2 de\nmême multiplicité. J. Algebraic Geom. 8 (1999), 787–796.\n[7] R. Hartshorne, Algebraic Geometry. Graduate Texts in Mathematics, Springer-Verlag,\n1977.\n[8] A. Hirschowitz, La méthode d'Horace pour l'interpolation à plusieurs variables.\nManuscripta Math. 50 (1985), 337–388.\n[9] J. A. Howald, Multiplier ideals of monomial ideals. Trans.Amer.Math.Soc. 353 (2001),\n2665–2671.\n[10] R. Lazarsfeld, Positivity in algebraic geometry. A Series of Modern Surveys in Mathematics, Springer-Verlag, Berlin, 2004.\n[11] A. Libgober, Alexander polynomial of plane algebraic curves and cyclic multiple planes.\nDuke Math. J. 49 (1982), 833–851.\n[12] A. Libgober, Homotopy groups of the complements to singular hypersurfaces. Bull.\nAmer. Math. Soc. 13 (1985), 49–52.\n[13] A. Libgober, Position of singularities of hypersurfaces and the topology of their complements. J. Math. Sci. 82 (1996), 3194–3210.\n[14] A. Libgober, Characteristic varieties of algebraic curves. In Applications of algebraic\ngeometry to coding theory, physics and computation (Eilat, 2001), 215–254, NATO Sci.\nSer. II Math. Phys. Chem., 36, Kluwer Acad. Publ., Dordrecht, 2001.\n[15] A. Libgober, Hodge decomposition of Alexander invariants. Manuscripta Math. 107\n(2002), 251–269.\n[16] A. Libgober, Lectures on topology of complements and fundamental groups,\narXiv:math.AG/0510049 (2005).\n[17] M. Oka, Some plane curves whose complements have nonabelian fundamental groups.\nMath. Ann. 218 (1978), 55–65.\n25\n\n\f[18] R. Pardini, Abelian covers of algebraic varieties. J. reine angew. Math. 417 (1991),\n191–213.\n[19] M. Vaquié, Irrégularité des revêtements cycliques des surfaces projectives non singulières. Amer. J. Math. 114 (1992), no. 6, 1187–1199.\n[20] O. Zariski, On the irregularity of cyclic multiple planes. Ann. of Math. 32 (1931),\n485-511.\n[21] O. Zariski, On the linear connection index of the algebraic surfaces z n = f (x, y). Proceedings Nat. Acad. Sciences 15 (1929), 494-501.\nDaniel Naie\nDépartement de Mathématiques\nUniversité d'Angers\nF-40045 Angers\nFrance\n\n26\n\n\f"}