{"id": "http://arxiv.org/abs/nlin/0504014v1", "guidislink": true, "updated": "2005-04-06T12:30:50Z", "updated_parsed": [2005, 4, 6, 12, 30, 50, 2, 96, 0], "published": "2005-04-06T12:30:50Z", "published_parsed": [2005, 4, 6, 12, 30, 50, 2, 96, 0], "title": "Architecture of optimal transport networks", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=nlin%2F0308030%2Cnlin%2F0308014%2Cnlin%2F0308027%2Cnlin%2F0308028%2Cnlin%2F0308020%2Cnlin%2F0308034%2Cnlin%2F0308007%2Cnlin%2F0308018%2Cnlin%2F0308006%2Cnlin%2F0308008%2Cnlin%2F0308024%2Cnlin%2F0308032%2Cnlin%2F0308022%2Cnlin%2F0308011%2Cnlin%2F0308013%2Cnlin%2F0308026%2Cnlin%2F0308025%2Cnlin%2F0308031%2Cnlin%2F0308016%2Cnlin%2F0308033%2Cnlin%2F0308012%2Cnlin%2F0504052%2Cnlin%2F0504003%2Cnlin%2F0504008%2Cnlin%2F0504059%2Cnlin%2F0504028%2Cnlin%2F0504049%2Cnlin%2F0504011%2Cnlin%2F0504047%2Cnlin%2F0504004%2Cnlin%2F0504022%2Cnlin%2F0504015%2Cnlin%2F0504051%2Cnlin%2F0504025%2Cnlin%2F0504012%2Cnlin%2F0504033%2Cnlin%2F0504029%2Cnlin%2F0504014%2Cnlin%2F0504026%2Cnlin%2F0504007%2Cnlin%2F0504064%2Cnlin%2F0504050%2Cnlin%2F0504053%2Cnlin%2F0504005%2Cnlin%2F0504027%2Cnlin%2F0504039%2Cnlin%2F0504057%2Cnlin%2F0504009%2Cnlin%2F0504021%2Cnlin%2F0504019%2Cnlin%2F0504035%2Cnlin%2F0504045%2Cnlin%2F0504058%2Cnlin%2F0504063%2Cnlin%2F0504002%2Cnlin%2F0504048%2Cnlin%2F0504020%2Cnlin%2F0504061%2Cnlin%2F0504001%2Cnlin%2F0504040%2Cnlin%2F0504017%2Cnlin%2F0504042%2Cnlin%2F0504055%2Cnlin%2F0504010%2Cnlin%2F0504043%2Cnlin%2F0504038%2Cnlin%2F0504037%2Cnlin%2F0504054%2Cnlin%2F0504023%2Cnlin%2F0504034%2Cnlin%2F0504060%2Cnlin%2F0504046%2Cnlin%2F0504036%2Cnlin%2F0504024%2Cnlin%2F0504041%2Cnlin%2F0504030%2Cnlin%2F0504044%2Cnlin%2F0504031%2Cnlin%2F0504018%2Cnlin%2F0504006%2Cnlin%2F0504056%2Cnlin%2F0504062%2Cnlin%2F0504013%2Cnlin%2F0504016%2Cnlin%2F0504032%2Cnlin%2F0105012%2Cnlin%2F0105003%2Cnlin%2F0105050%2Cnlin%2F0105024%2Cnlin%2F0105035%2Cnlin%2F0105037%2Cnlin%2F0105015%2Cnlin%2F0105054%2Cnlin%2F0105062%2Cnlin%2F0105041%2Cnlin%2F0105031%2Cnlin%2F0105023%2Cnlin%2F0105036%2Cnlin%2F0105039%2Cnlin%2F0105044%2Cnlin%2F0105025&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Architecture of optimal transport networks"}, "summary": "We analyze the structure of networks minimizing the global resistance to flow\n(or dissipated energy) with respect to two different constraints: fixed total\nchannel volume and fixed total channel surface area. First, we determine the\nshape of channels in such optimal networks and show that they must be straight\nwith uniform cross-sectional areas. Then, we establish a relation between the\ncross-sectional areas of adjoining channels at each junction. Indeed, this\nrelation is a generalization of Murray's law, originally established in the\ncontext of local optimization. Moreover, we establish a relation between angles\nand cross-sectional areas of adjoining channels at each junction, which can be\nrepresented as a vectorial force balance equation, where the force weight\ndepends on the channel cross-sectional area. A scaling law between the minimal\nresistance value and the total volume or surface area value is also derived\nfrom the analysis. Furthermore, we show that no more than three or four\nchannels meet in one junction of optimal bi-dimensional networks, depending on\nthe flow profile (e.g.: Poiseuille-like or plug-like) and the considered\nconstraint (fixed volume or surface area). In particular, we show that sources\nare directly connected to wells, without intermediate junctions, for minimal\nresistance networks preserving the total channel volume in case of plug flow\nregime. Finally, all these results are illustrated with a simple example, and\ncompared with the structure of natural networks.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=nlin%2F0308030%2Cnlin%2F0308014%2Cnlin%2F0308027%2Cnlin%2F0308028%2Cnlin%2F0308020%2Cnlin%2F0308034%2Cnlin%2F0308007%2Cnlin%2F0308018%2Cnlin%2F0308006%2Cnlin%2F0308008%2Cnlin%2F0308024%2Cnlin%2F0308032%2Cnlin%2F0308022%2Cnlin%2F0308011%2Cnlin%2F0308013%2Cnlin%2F0308026%2Cnlin%2F0308025%2Cnlin%2F0308031%2Cnlin%2F0308016%2Cnlin%2F0308033%2Cnlin%2F0308012%2Cnlin%2F0504052%2Cnlin%2F0504003%2Cnlin%2F0504008%2Cnlin%2F0504059%2Cnlin%2F0504028%2Cnlin%2F0504049%2Cnlin%2F0504011%2Cnlin%2F0504047%2Cnlin%2F0504004%2Cnlin%2F0504022%2Cnlin%2F0504015%2Cnlin%2F0504051%2Cnlin%2F0504025%2Cnlin%2F0504012%2Cnlin%2F0504033%2Cnlin%2F0504029%2Cnlin%2F0504014%2Cnlin%2F0504026%2Cnlin%2F0504007%2Cnlin%2F0504064%2Cnlin%2F0504050%2Cnlin%2F0504053%2Cnlin%2F0504005%2Cnlin%2F0504027%2Cnlin%2F0504039%2Cnlin%2F0504057%2Cnlin%2F0504009%2Cnlin%2F0504021%2Cnlin%2F0504019%2Cnlin%2F0504035%2Cnlin%2F0504045%2Cnlin%2F0504058%2Cnlin%2F0504063%2Cnlin%2F0504002%2Cnlin%2F0504048%2Cnlin%2F0504020%2Cnlin%2F0504061%2Cnlin%2F0504001%2Cnlin%2F0504040%2Cnlin%2F0504017%2Cnlin%2F0504042%2Cnlin%2F0504055%2Cnlin%2F0504010%2Cnlin%2F0504043%2Cnlin%2F0504038%2Cnlin%2F0504037%2Cnlin%2F0504054%2Cnlin%2F0504023%2Cnlin%2F0504034%2Cnlin%2F0504060%2Cnlin%2F0504046%2Cnlin%2F0504036%2Cnlin%2F0504024%2Cnlin%2F0504041%2Cnlin%2F0504030%2Cnlin%2F0504044%2Cnlin%2F0504031%2Cnlin%2F0504018%2Cnlin%2F0504006%2Cnlin%2F0504056%2Cnlin%2F0504062%2Cnlin%2F0504013%2Cnlin%2F0504016%2Cnlin%2F0504032%2Cnlin%2F0105012%2Cnlin%2F0105003%2Cnlin%2F0105050%2Cnlin%2F0105024%2Cnlin%2F0105035%2Cnlin%2F0105037%2Cnlin%2F0105015%2Cnlin%2F0105054%2Cnlin%2F0105062%2Cnlin%2F0105041%2Cnlin%2F0105031%2Cnlin%2F0105023%2Cnlin%2F0105036%2Cnlin%2F0105039%2Cnlin%2F0105044%2Cnlin%2F0105025&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We analyze the structure of networks minimizing the global resistance to flow\n(or dissipated energy) with respect to two different constraints: fixed total\nchannel volume and fixed total channel surface area. First, we determine the\nshape of channels in such optimal networks and show that they must be straight\nwith uniform cross-sectional areas. Then, we establish a relation between the\ncross-sectional areas of adjoining channels at each junction. Indeed, this\nrelation is a generalization of Murray's law, originally established in the\ncontext of local optimization. Moreover, we establish a relation between angles\nand cross-sectional areas of adjoining channels at each junction, which can be\nrepresented as a vectorial force balance equation, where the force weight\ndepends on the channel cross-sectional area. A scaling law between the minimal\nresistance value and the total volume or surface area value is also derived\nfrom the analysis. Furthermore, we show that no more than three or four\nchannels meet in one junction of optimal bi-dimensional networks, depending on\nthe flow profile (e.g.: Poiseuille-like or plug-like) and the considered\nconstraint (fixed volume or surface area). In particular, we show that sources\nare directly connected to wells, without intermediate junctions, for minimal\nresistance networks preserving the total channel volume in case of plug flow\nregime. Finally, all these results are illustrated with a simple example, and\ncompared with the structure of natural networks."}, "authors": ["Marc Durand"], "author_detail": {"name": "Marc Durand"}, "author": "Marc Durand", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevE.73.016116", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/nlin/0504014v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/nlin/0504014v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "nlin.AO", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "nlin.AO", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.class-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/nlin/0504014v1", "affiliation": "MSC", "arxiv_url": "http://arxiv.org/abs/nlin/0504014v1", "arxiv_comment": null, "journal_reference": "Physical Review E 73 (2006) 016116", "doi": "10.1103/PhysRevE.73.016116", "fulltext": "arXiv:nlin/0504014v1 [nlin.AO] 6 Apr 2005\n\nArchitecture of optimal transport networks\n\nMarc Durand\nMatière et Systèmes Complexes\nUMR 7057 CNRS & Université Paris 7 - Denis Diderot\nTour 33/34 - 2ème étage - case 7056\n2 Place Jussieu - 75251 Paris Cedex 05, France\nOctober 31, 2018\n\n\fAbstract\nWe analyze the structure of networks minimizing the global resistance to flow (or dissipated energy) with\nrespect to two different constraints: fixed total channel volume and fixed total channel surface area. First, we\ndetermine the shape of channels in such optimal networks and show that they must be straight with uniform\ncross-sectional areas. Then, we establish a relation between the cross-sectional areas of adjoining channels at\neach junction. Indeed, this relation is a generalization of Murray's law, originally established in the context\nof local optimization. Moreover, we establish a relation between angles and cross-sectional areas of adjoining\nchannels at each junction, which can be represented as a vectorial force balance equation, where the force\nweight depends on the channel cross-sectional area. A scaling law between the minimal resistance value and\nthe total volume or surface area value is also derived from the analysis. Furthermore, we show that no more\nthan three or four channels meet in one junction of optimal bi-dimensional networks, depending on the flow\nprofile (e.g.: Poiseuille-like or plug-like) and the considered constraint (fixed volume or surface area). In\nparticular, we show that sources are directly connected to wells, without intermediate junctions, for minimal\nresistance networks preserving the total channel volume in case of plug flow regime. Finally, all these results\nare illustrated with a simple example, and compared with the structure of natural networks.\n\n\fNetworked structures arise in a wide array of different contexts such as water, gas and power supply\nof a city, vascular systems of plants and animals, or river basins [1][2][3]. Thus, optimization of transport\nin networks has evident industrial and economical importance, but may also shed light on the structure\nof natural networked structures. Indeed, the analysis of these structures from optimization and selection\nprinciples has been recently the subject of intense scientific activity [4][5][6][7][8] and controversy [9][10][11].\nBesides, theoretical models - based on local optimization (i.e. optimization of the geometry of a single\njunction) - have been attempted to explain in detail the regular patterns of vascular networks [12][13][14][15].\nHowever, it is generally known that as the global optimum is achieved the local optimum of a single junction\nis often discarded. In the present paper, we characterize the structure of networks satisfying to the global\noptimization of transport. For the class of networks mentioned here, euclidean metric must be taken account,\nand the optimization must be achieved with respect to some geometrical constraint.\nPrecisely, the problem we consider can be expressed as it follows: consider s sources at the same potential\n(electrical potential, pressure, concentration, temperature,...) VS and w wells at the same potential VW , their\nrespective positions being fixed. What is the architecture of the network linking all the sources to all the\nwells and minimizing the effective resistance (or dissipated energy), for a fixed total channel volume or fixed\ntotal channel surface area [16] ? Or equivalently, which architecture minimizes the total channel volume or\nsurface area for a same value of the global resistance ?\nIn the following, we shall refer often to the electrical circuit terminology, although this study obviously\nconcerns any flow-in-network situation. Let us denote each pipe by a pair of indices (i, j) corresponding\nto the labels of its two ends. We suppose a priori that pipes can be curved, but we assume that their\naspect ratios are sufficiently high so a length lij and a local cross-sectional area sij (l) (where l denotes the\ncurvilinear coordinate along a channel) can be unequivocally defined for each pipe (i, j). The resistance drij\n\n1\n\n\fof an infinitesimal piece of pipe of length dl is then defined as:\ndrij =\n\nρ\ndl,\nsm\nij\n\n(1)\n\nwhere ρ is the \"resistivity\", supposed to be the same for all the pipes. For m = 1, the flow in each channel\nis plug-like, while for m = 2 the flow is Poiseuille-like. Assuming there is no leakage through the pipe lateral\nsurface, the resistance of the whole pipe (i, j) is:\n\nrij =\n\nZlij\n0\n\nρ\ndl.\nsm\nij\n\n(2)\n\nSince we shall inspect the minimal resistance configuration with respect with two different constraints (a\nfixed total channel volume Vtot and a fixed total surface-area channel Stot ), we introduce for simplicity the\nlij\nXZ\nsnij dl , so that: C1 = Vtot , and C1/2 ∝ Stot .\n\"constraint function\": Cn =\n(i,j) 0\n\n1\n\nCohn's theorem\n\nTo characterize the architecture of minimal resistance networks, we shall invoke Cohn's theorem, originally\ndeveloped in the context of electrical circuit analysis [17]: consider a one-port network composed entirely\nof two-terminal elements with resistances rij . The variation of the effective network resistance R with the\nvariation of the resistance rij is given by:\n∂R\n=\n∂rij\n\n\u0012\n\niij\nI\n\n\u00132\n\n.\n\n(3)\n\nNo particular assumption is made on the expression of the resistances rij for the derivation of this result\n(indeed, the theorem is still valid for complex impedances). Conservation of flow and energy only are required.\nThus, Cohn's theorem can be applied to a broader class of flow-in-network situations.\n\n2\n\n\f2\n\nOptimal shape of channels\n\nWe first notice that in order for the effective network resistance to be at its minimum value with respect to the\nconstraint Cn , each channel must be straight with a uniform cross-sectional area (i.e.: sij (l) = sij ). Indeed,\nwe see from eq. 3 that the effective network resistance R is a monotone function of the individual resistances\nrij . Thus, any small change in pipe diameter or pipe length from the minimal resistance configuration compatible with the constraint - must lead to an increase of the resistances rij . As a consequence, the\nlength of each pipe must be as small as possible and its diameter as large as possible, i.e. each channel must\nbe straight with a uniform cross-sectional area. Besides, it can be noticed that a circular cross-sectional\narea have the specific property of minimizing both the pipe surface area for a fixed volume (or equivalently\nmaximizing the pipe volume for a fixed surface area) and the dissipative energy in the channel for a fixed\nincoming flow-rate in case of Poiseuille-flow regime.\n\n3\n\nRelations between diameters: generalized Murray's law\n\nWe now establish relations between diameters and angles in an optimal network, for a given topology (meaning\nthat no junction or channel can be added or removed from the network, but the channel lengths and crosse = R + λCn (where λ is a Lagrange\nsection areas are free to vary). We thus have to minimize the function R\n\nmultiplier) with respect to the independent variables {sij } and {ri = (xi , yi )}, respectively the channel crosssectional areas and node positions. Using Cohn's theorem 3, the condition of extremum with respect to the\ne\ncross-sectional areas (∂ R/∂s\nij = 0) gives:\n\n\u0012\n\niij\nI\n\n\u00132\n\n=\n\nλ n m+n\ns\n.\nρ m ij\n\n3\n\n(4)\n\n\fX\nFurthermore, conservation of flow-rate at each junction i ( iij = 0) implies:\nj\n\nX\n\n(m+n)/2\n\nsign (iij ) sij\n\n= 0.\n\n(5)\n\nj\n\nThis relation, illustrated on Fig. 1 and valid for netted-like as for tree-like networks, is a generalization of\nMurray's law [12] to any flow profile and with different constraints (Murray's law was originally derived for\nthe particular case m = 2, n = 1). Moreover, we must point out that relation 5 results here from the global\noptimization of the network structure, while the original derivation of Murray's law was based on a local\noptimization (flow and channel cross-sectional area were functionally related: an optimal cross-sectional area\nwas found for a given flow, and not for all levels of total flow).\n\nFigure 1: Relation between cross-sectional areas of adjoining channels in a minimal resistance network. This\nrelation is a generalization of Murray's law.\n\n4\n\n\f4\n\nGeometry of nodes\n\ne\nCondition of extremum with respect to the node positions (∂ R/∂r\ni = 0) together with relation 4 straightfor-\n\nwardly leads to the following vectorial equality at each node i:\nX\n\nsnij eij = 0,\n\n(6)\n\nj\n\nwhere eij is the outward-pointing unit vector along the channel (i, j) (see Fig. 2). This equality, relating\nangles between adjoining channels to their cross-sectional areas, is similar to a force balance equation, where\nthe weight of the force acting along the channel (i, j) is directly proportional to snij . As for Murray's law, local\noptimization principles have already been proposed in order to describe the geometry of nodes in natural\nnetworks, namely: minimization of channel volume (V), channel surface area (S), dissipated power (P), and\ndrag force (D) on the walls [3][13][14]. All these approaches consist in varying the position of a given junction,\nwhile the positions of the other junctions, the network topology, the channel cross-sectional areas, and the\nflow-rates through every channel are remained fixed. However, in the context of a global optimization, a\nchange in a node position should alter the flow-rate distribution, and it is therefore to be expected that\nglobal minimization of the dissipated energy leads to a different optimal geometry of nodes than in the local\noptimization context (P). Indeed, the optimal geometry of nodes described by Eq. 6 is similar to the one\nobtained for (S) (when n = 1/2) or (V) (when n = 1), but different from (P) [3][13][14].\n\n5\n\nScaling-law between minimal resistance and constraint value\n\nA relation between the minimal resistance value and the constraint value can be established, using Eq. 4\nand conservation of energy:\nR=\n\nX\n\n(i,j)\n\nrij\n\n\u0012\n\niij\nI\n\n5\n\n\u00132\n\n=λ\n\nn\nCn .\nm\n\n(7)\n\n\fFigure 2: Relation between angles and cross-sectional areas of adjoining channels in a minimal resistance\nnetwork. This relation is similar to a force balance equation describing the equilibrium of strings tied together\nand under respective tensions, or weights, snij .\n\nOn the other hand, a classical result of optimization theory relates the Lagrange multiplier to the change\nm\nof the minimal resistance with respect to the constraint value: λ = − dR\ndCn (note that Eq. 7 implies λ ≥ 0).\n\n−m/n\n\nTherefore, it is found that the resistance of an optimal network scales as Cn\nR = ρl\n\n\u0012\n\nl\nCn\n\n\u0013m\nn\n\n, i.e.:\n\n,\n\n(8)\n\nwhere l is a parameter with dimension of length, depending solely on the network topology, the positions of\nsources and wells, and the values of m and n.\nWe have shown that a minimal resistance configuration, for a given topology, if it does exist, must satisfy\nto the equations 4, 5, 6, and 8. Wether the extrema characterized by this set of equations are local minima\nor local maxima is not clear (although this uncertainty might be dispelled by some convexity argument).\nNevertheless, because individual resistances have finite values, there must exist at least one configuration\nwith global minimal resistance (but we do not know if this configuration is unique) [18].\n\n6\n\n\f6\n\nUpper bound on the node connectivity\n\nFinally, we establish an upper bound on the number of channels joining in one node, in a bi-dimensional\nminimal resistance network. To do so, we look at a given junction of N channels and determine when this\njunction is preferentially replaced with two junctions respectively of 3 and N − 1 channels. Suppose we create\na new channel of infinitesimal length dl3 , as depicted in Fig. 3. Then, the length variation of the two other\nchannels joining in the new 3-fold junction are: dl1 = −dl3 cos θ1 and dl2 = −dl3 cos θ2 , with: θ1 + θ2 = γ,\nwhere γ is the angle between these two adjacent channels. The variation of the associated resistances are\nm\nm\nrespectively: dr1 = −ρdl3 cos θ1 /sm\n1 , dr2 = −ρdl3 cos θ2 /s2 , and dr3 = ρdl3 /s3 , where s1 , s2 and s3 are the\n\nrespective channel cross-sectional areas. Moreover, this transformation must preserve the value of Cn , so the\nnew channel cross-sectional area s3 must satisfy:\nsn3 = sn1 cos θ1 + sn2 cos θ2 .\n\n(9)\n\nUsing once again Cohn's theorem, we obtain the variation of the effective resistance:\ndl3\ndR = ρ 2\nI\n\n\u0012\n\ni23\ni21 cos θ1\ni22 cos θ2\n−\n−\nsm\nsm\nsm\n3\n1\n2\n\n\u0013\n\n.\n\n(10)\n\nSuppose now that the N -fold junction was in a minimal resistance configuration. Then, conditions 4 and 6\nmust be fulfilled, and we can replace i21 and i22 in Eq. 10 by their expressions (Eq. 4). Moreover, conservation\nof flow rate relates i3 to i1 and i2 : i3 = −i1 − i2 . Using Eq. 9, we see that the resistance variation dR is\n(m+n)/2\n\nnegative when: s3\n\n(m+n)/2\n\n≥ s1\n\n(m+n)/2\n\n± s2\n\n. The sign in the right-hand side of this inequality is positive\n\nwhen the two adjacent channels are crossed by flows in same direction, and negative when they are crossed by\n2n\n\u0011 m+n\n\u0010\nm+n\n,\nflows in opposite directions. The former inequality can be rewritten as: cos θ1 + rn cos θ2 ≥ 1 ± r 2\n\nwith r = s2 /s1 . Before establishing an upper-bound on the node connectivity, we must notice the following\n\n\"rules\" on the geometry of junctions in optimal networks:\n\n7\n\n\fFigure 3: Elementary transformation of a N -fold junction to a (N − 1)-fold junction plus a 3-fold junction.\nA new channel, with infinitesimal length dl3 is thus created.\n\n1. There is at least one angle lower than 2π/N between two adjacent channels in a N -fold junction (from\ngeometrical consideration).\n2. There is at least one pair of adjacent channels crossed by flows in opposed directions (from flow conservation).\n3. The angle between two adjacent channels is always lower than π (from Eq. 6).\nLet us choose θ1 and θ2 such that sin θ1 = rn sin θ2 , what corresponds to the maximum value of the\nleft-hand side of the former equality. Since γ ≤ π (rule 3.), we easily check that both θ1 and θ2 are positive\nand lower than π/2, and simple algebra leads to:\ncos θ1 + rn cos θ2 =\n\np\n1 + r2n + 2rn cos γ.\n\n(11)\n\nThus, the resistance variation dR is negative if and only if:\n\ncos γ ≥ f± (r) =\n\n\u0010\n\n1±r\n\nm+n\n2\n\n4n\n\u0011 m+n\n\n2rn\n\n− 1 − r2n\n,\n\n(12)\n\nwhere the functions f+ (r) and f− (r) correspond to the respective situations of two adjacent channels crossed\nby flows in same and opposite directions. The analysis of f+ (r) and f− (r) shows that, for any value of r,\n8\n\n\f3n−m\nm+n\n\n− 1 for any value of m, n; f− (r) ≤ 0 if\n\u0011\n\u0010 3n−m\nm > n, and f− (r) ≤ −1 if m = n. So if γ is lower than γ+ = arccos 2 m+n − 1 for the first situation, or\nthese functions are bounded in the following way: f+ (r) ≤ 2\n\nγ− = 90◦ (if m > n) or 180◦ (if m = n) for the second situation, we are ensured that the resistance variation\nis negative. Let us inspect the different situations:\n• If m = 2, and n = 1/2: γ+ ≃ 97.4◦ , γ− = 90◦ . We know there is at least one angle lower than\n360◦ /N between two adjacent channels in a N -fold junction (rule 1.). By choosing this angle as γ in\nthe previous analysis, we conclude that a N -fold junction is preferably replaced with a (N − 1)-fold\njunction plus a 3-fold junction, as long as N ≥ 4. The new structure is not in a minimal resistance\nconfiguration, determined by Eqs 4 and 6, so the \"relaxation\" of the new structure such a configuration\nimplies a further decrease of the effective resistance. Eventually, we can repeat the same reasoning on\nthe (N − 1)-fold junction, if N − 1 ≥ 4. We come to the conclusion that exactly three channels meet\nat each junction in such an optimal network.\n• If m = 2, and n = 1 or m = 1, and n = 1/2: γ+ ≃ 74.9◦ , γ− = 90◦ . Following the same argumentation,\nwe conclude that a N -fold junction is preferably replaced with a (N − 1)-fold junction plus a 3-fold\njunction as long as N ≥ 5. Thus, no more than four channels meet in one junction in such an optimized\nnetwork. Furthermore, it can be noticed that only two kinds of 4-fold junctions can exist in such a\nnetwork: either three adjacent channels are crossed by flows of same sign (and the last flow has an\nopposed sign), or two adjacent channels are crossed by flows with same sign and the two other adjacent\nchannels are crossed by flows with same opposite sign. A 4-fold junction with channels crossed by flows\nwith alternate signs is preferably replaced by two 3-fold junctions, since there is always two adjacent\nchannels crossed by flows with opposite signs and with an angle lower than 90◦ (rule 1.).\n• If m = 1 and n = 1: γ+ = 0◦ , γ− = 180◦ . But we know that there is always two adjacent channels\n\n9\n\n\fcrossed by flows with opposite signs in a N -fold junction (rule 2.), with an angle between them lower\nthan 180◦ (rule 3.). So the N -fold junction is preferably replaced with a (N − 1)-fold junction plus a\n3-fold junction for any N ≥ 4. Now, if we let the new structure of the network \"relax\" to a minimal\nresistance configuration, it must simultaneously satisfy Eqs. 5 and 6 at every junction, and particularly\nat the 3-fold junction. But this set of equations applied in a 3-fold junction has only trivial solutions\nwhen m ≤ n: either one cross-section is null, or the three channels are colinear. We conclude that\nsources are directly connected to the wells, with no intermediate junction, in a minimal resistance\nnetwork preserving total channel volume and in case of plug-flow regime.\nAs a concluding remark for this section, we point out that the same reasoning may be used on the total\nchannel length variation instead of resistance variation (Steiner tree problem). In that case, we obtain that\nlinks meet at threefold junctions (with equal angles of 120◦) in a length-minimizing network.\n\n7\n\nA simple example\n\nWe compare our results with a simple example: two sources and two wells placed at the corner of a rectangle,\nas depicted on Fig. 4. Four configurations are analyzed. In configuration (1), sources are directly connected\nto wells, without any intermediate junction. In Configuration (2), sources are connected to wells via a\n4-fold intermediate junction. In configurations (3) and (4), sources and wells are connected through two\n3-fold junctions (and the position of intermediate junctions are chosen such that equality 6 is satisfied). The\ncorresponding dimensionless resistance\n\nR\nρa\n\nCn\na\n\n\u0001 m+n\nn\n\nof each configuration is reported on table 1. From these\n\nexpressions, we note the following observations, in agreement with our results: firstly, we notice that R scales\nm/n\n\nas (1/Cn )\n\n. Secondly, when m = n (= 1), configuration (1) is the smallest resistance configuration, for\n\nany value of the aspect ratio b/a. Thirdly, resistance of configuration (3) is always lower than resistance of\n\n10\n\n\fconfiguration (2) and higher than resistance of configuration (1) (R1 ≤ R3 ≤ R2 ), for any value of m, n,\nand b/a. Fourthly, resistance of configuration (4) is lower than resistance of configuration (2) as soon as:\nq\n2\n1 + (b/a) ≤ 22(m−n)/(m+n) , for any value of m, n, and b/a. One can easily check that this criterion on the\naspect ratio b/a (for given values of m and n) corresponds to the condition for Eq. 5 to be simultaneously\n\nsatisfied with Eq. 6 at each 3-fold junctions of configuration (4). In particular, resistance of configuration\n(4) cannot be lower than resistance of configuration (2) when m = n, in agreement with the second point.\nFifthly, when m > n, resistance of configuration (4) can be lower than resistance of configuration (1) for a\nsufficiently low value of b/a.\n\nFigure 4: Four different network configurations linking two sources to two wells, placed at the corners of a\nrectangle of length a and b.\n\n11\n\n\f(1)\n\n2\n\n(2)\n\n2\nb\nl1\n\n(3)\n\nm−n\nn\n\nq\n\nm−n\nn\n\n\u0010\n1+\n\n4b\nl1 + 2b\nl2 q\n\n\u0001m\nn\n\nCn\na\n\nR\nρa\n\nConfiguration\n\n\u0001\nb 2\na\n\nb/a−b\nl2\n\n\u0011 m+n\nn\n\n2\n1+(b/a−b\nl2 )\n\nb\n\n,\n\n2\n\n1+(b/a−l2 )\nwith b\nl1 =\n2\n\u0012\n\u0013\n\u0010\n\u0011m\n\u0011m\n\u0010\nn\nb\nb\nl1\nl2 n\nb\nb\n,\nl\n+\nl\n4b\nl1 + b\nl2 1−\n1\n2 1−b\nb\nl\nl\n\n(4)\n\n1\n\nTable 1: Dimensionless resistances\n\n!m\nn\n\nR\nρa\n\nCn\na\n\nwith b\nl1 =\n\n\u0001m\nn\n\nq\n\n2\n\n(b/a)2 +(1−b\nl2 )\n2\n\n2\n\ncorresponding to the four configurations depicted on Fig. 4.\n\nFor configurations (3) and (4), b\nl1 = l1 /a and b\nl2 = l2 /a are the dimensionless lengths of the two kind of\n\nchannels.\n\n8\n\nComparison with natural networks\n\nAll the results derived in previous sections (relations 4, 5, 6, 8 as well as the upper-bound on the node\nconnectivity) are consequences of global optimization. However, these results have been established by\nstudying any local perturbation of the structure. Such a local adaptive process may take place during\nontogeny of natural networks. Therefore, it may be of interest to compare the structure of some natural\nnetworks with the results presented in this work. Indeed, it has been already shown in various publications\n[19][20] that Murray's law is well satisfied in some appropriate portions of human and animal vascular\nsystems. In that case, the flow profile is nearly Poiseuille-like (m = 2) and the relevant constraint is\na fixed total channel volume (n = 1) [19][20]. Validity of Murray's law for vascular system of plants is\nmore controversial [20][21][22][23], mostly because of the underlying theoretical assumptions in the original\nderivation of Murray's law, and of the particular structure of veins in vascular system of plants. Nevertheless,\n\n12\n\n\fexperimental data suggest that a relation\n\nX\n\nν/2\n\nsign (iij ) sij\n\n= 0 is still verified, with ν between 2.49 and 3\n\nj\n\n[15][23][24][25]. Let us look more precisely at the bi-dimensional leaf venation network, like the one reported\non Fig. 5. Leaf veins are actually vascular bundles [26], supporting two parallel flows : a pressure-driven flow\nof water and minerals from petiole to stomata through xylem tissues, and a diffusive flow of nutrients and\nphotosynthesis products in the opposite direction through phloem tissues. So petiole (or major vein) and\nstomata play alternatively roles of sources and wells for the leaf. An outer layer of cells, called the bundle\nsheath, surrounds the vascular tissues. Although this layer is not fully impermeable, the leaky radial flow is\nsmall when compared with the axial flow, except for the minor veins [21][27]. For these veins, leakage is very\nimportant and the pressure field and nutrient concentration nearby are almost uniform. Kull and Herbig [28]\ninvestigated on leaf topology of several species. They observed that leaf venations preferably show trivalent\nnodes with six neighbors, and noticed that this geometry is typical of self-generating structures like bubble\nfloats. In a recent study, S. Bohn et al. [29] analyzed geometry of junctions in the leaf venation of various\nspecies. They observed that angles between veins are very well defined and that a vectorial balance equation\ncomparable to eq. 6 can be established, where the weight of each vector is directly proportional to the vein\nradius (i.e. n = 1/2). Comparison of Bohn et al. observations with our optimization principles suggest then\nthat structure of leaf venation corresponds to a minimization of the resistance for a fixed total channel surface\narea (or minimization of surface area for a fixed value of resistance). This result is coherent with the idea\nof a predominant building cost of the bundle sheath cells over those of the vascular tissues [21][23]. Taking\nn = 1/2 and comparing Eq. 5 with experimental studies of Murray's law leads to a value of m between\n1.99 and 2.5, meaning that flow in veins is nearly Poiseuille-like. Note it is assumed in the theory that all\nchannels have same resistivity ρ. However, density of xylem and phloem tissues in a leaf vein might be a\nfunction of the vein diameter as well. This variation of the resistivity is then include in the coefficient m,\nwhat could explain the slight difference observed between the experimental value of m and the theoretical\n\n13\n\n\fvalue for a Poiseuille-flow regime. All these results and the presence of trivalent nodes suggest then that\nstructure of leaf venation correspond to minimal resistance configuration preserving the total surface area\nand nearly Poiseuille flow profile. The measure of the scaling-law between the hydraulic resistance and the\ntotal channel volume or surface area might be an additional way to test this conjecture.\n\nFigure 5: Portion of leaf venation. In most species, the structure is netted-like, and veins meet in 3-fold\njunctions.\n\nReferences\n[1] A. Bejan, Rev. Gén. Therm. 36, 592-604 (1997).\n[2] S. Lorente, W. Wechsatol, and A. Bejan, Int. J. Heat and Mass Transfer 45, 3299-3312 (2002).\n[3] M. A. Changizi and C. Cherniak, Can. J. Physiol. Pharmacol. 78, 603-611 (2000).\n[4] G. B. West, J. H. Brown, and B. J. Enquist, Science 276, 122-126 (1997).\n[5] G. B. West, J. H. Brown, and B. J. Enquist, Nature 400, 664-667 (1999).\n14\n\n\f[6] J. R. Banavar, F. Colaiori, A. Flammini, A. Maritan, and A. Rinaldo, Phys. Rev. Lett. 84, 4745-4748\n(2000).\n[7] V. Colizza, J. R. Banavar, A. Maritan, and A. Rinaldo, Phys. Rev. Lett. 92, 198701 (2004).\n[8] J. R. Banavar, A. Maritan, and A. Rinaldo, Nature 399, 130-132 (1999).\n[9] J. Kozlovski and M. Konarzewski, Functional Ecology 18, 283-289 (2004).\n[10] J. Whitfield, Nature 413, 342-344 (2001).\n[11] J. R. Banavar, J. Damuth, A. Maritan, and A. Rinaldo, Nature 420, 626 (2002).\n[12] C. D. Murray, Proc. Natl. Acad. Sci. USA 12, 207-214 (1926).\n[13] M. Zamir, J. theor. Biol. 62, 227-251 (1976)\n[14] M. Zamir, J. Gen. Physiol. 72, 837-845 (1978).\n[15] W. Zhi, Z. Ming, and Y. Qi-Xing, J. Theor. Biol. 209, 383-394 (2001).\n[16] Note that a fixed total length is not a pertinent constraint, unless channel cross-sectional areas are\nbounded; otherwise one could built channels with infinitely large cross-sections and the minimal resistance value would be trivialy zero.\n[17] R. M. Cohn, Proc. Am. Math. Soc. 1, 316 (1950).\n[18] It is also obvious that there are no global maximum, since one can built a network with infinitely long\nand indefinitely thin channels (so that value of Cn is preserved) and whose resistance is infinitely large.\n[19] T. F. Sherman, J. Gen. Physiol. 78, 431-453 (1981).\n[20] M. LaBarbera, Science 249, 992-1000 (1990).\n15\n\n\f[21] A. Roth-Nebelsick, D. Uhl, V. Mosbrugger, and H. Kerp, Annals of Botany 87, 553-566 (2001).\n[22] M. J. Canny, Phil. Trans. R. Soc. Lond. B 341, 87-100 (1993).\n[23] K. A. McCulloh, J. S. Sperry, and F. R. Adler, Nature 421, 939-942, (2003).\n[24] P. Kruszewski and S. Whitesides, J. Theor. Biol. 191, 221-236 (1998).\n[25] N. Kizilova, ICCSA 2004, LNCS 3004, 476-485 (2004).\n[26] A. H. de Boer and V. Volkov, Plant, Cell and Environment 26, 87-101 (2003).\n[27] M. A. Zwieniecki, P. J. Melcher, C. K. Boyce, L. Sack, and N. M. Holbrook, Plant, Cell and Environment\n25, 1445-1450 (2002).\n[28] U. Kull and A. Herbig, Naturwissenschaften 82, 441-451 (1995).\n[29] S. Bohn, B. Andreotti, S. Douady, J. Munzinger, and Y. Couder, Phys. Rev. E 65, 061914 (2002).\n\n16\n\n\f"}