{"id": "http://arxiv.org/abs/nlin/0408024v1", "guidislink": true, "updated": "2004-08-14T06:48:18Z", "updated_parsed": [2004, 8, 14, 6, 48, 18, 5, 227, 0], "published": "2004-08-14T06:48:18Z", "published_parsed": [2004, 8, 14, 6, 48, 18, 5, 227, 0], "title": "Hierarchical structure description of spatiotemporal chaos", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=nlin%2F0410050%2Cnlin%2F0410030%2Cnlin%2F0410058%2Cnlin%2F0410056%2Cnlin%2F0410027%2Cnlin%2F0410037%2Cnlin%2F0610018%2Cnlin%2F0610004%2Cnlin%2F0610028%2Cnlin%2F0610078%2Cnlin%2F0610077%2Cnlin%2F0610054%2Cnlin%2F0610067%2Cnlin%2F0610037%2Cnlin%2F0610007%2Cnlin%2F0610071%2Cnlin%2F0610048%2Cnlin%2F0610061%2Cnlin%2F0610041%2Cnlin%2F0610070%2Cnlin%2F0610062%2Cnlin%2F0610009%2Cnlin%2F0610051%2Cnlin%2F0610035%2Cnlin%2F0610069%2Cnlin%2F0610032%2Cnlin%2F0610020%2Cnlin%2F0610008%2Cnlin%2F0610040%2Cnlin%2F0610059%2Cnlin%2F0610065%2Cnlin%2F0610016%2Cnlin%2F0610010%2Cnlin%2F0610057%2Cnlin%2F0610046%2Cnlin%2F0610001%2Cnlin%2F0610034%2Cnlin%2F0610042%2Cnlin%2F0610036%2Cnlin%2F0610038%2Cnlin%2F0610056%2Cnlin%2F0610024%2Cnlin%2F0610064%2Cnlin%2F0610002%2Cnlin%2F0610030%2Cnlin%2F0610021%2Cnlin%2F0610003%2Cnlin%2F0610076%2Cnlin%2F0610015%2Cnlin%2F0610023%2Cnlin%2F0610014%2Cnlin%2F0610052%2Cnlin%2F0610049%2Cnlin%2F0610025%2Cnlin%2F0610017%2Cnlin%2F0610031%2Cnlin%2F0610012%2Cnlin%2F0610027%2Cnlin%2F0610063%2Cnlin%2F0610047%2Cnlin%2F0610039%2Cnlin%2F0610075%2Cnlin%2F0610072%2Cnlin%2F0610043%2Cnlin%2F0610013%2Cnlin%2F0610029%2Cnlin%2F0610044%2Cnlin%2F0610053%2Cnlin%2F0610005%2Cnlin%2F0610074%2Cnlin%2F0610026%2Cnlin%2F0610019%2Cnlin%2F0610006%2Cnlin%2F0610011%2Cnlin%2F0610022%2Cnlin%2F0610058%2Cnlin%2F0610033%2Cnlin%2F0610055%2Cnlin%2F0610068%2Cnlin%2F0610045%2Cnlin%2F0610060%2Cnlin%2F0610050%2Cnlin%2F0610066%2Cnlin%2F0610073%2Cnlin%2F0408021%2Cnlin%2F0408007%2Cnlin%2F0408040%2Cnlin%2F0408003%2Cnlin%2F0408024%2Cnlin%2F0408046%2Cnlin%2F0408015%2Cnlin%2F0408002%2Cnlin%2F0408032%2Cnlin%2F0408008%2Cnlin%2F0408059%2Cnlin%2F0408037%2Cnlin%2F0408012%2Cnlin%2F0408027%2Cnlin%2F0408038%2Cnlin%2F0408043%2Cnlin%2F0408017&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Hierarchical structure description of spatiotemporal chaos"}, "summary": "We develop a hierarchical structure (HS) analysis for quantitative\ndescription of statistical states of spatially extended systems. Examples\ndiscussed here include an experimental reaction-diffusion system with\nBelousov-Zhabotinsky kinetics, the two-dimensional complex Ginzburg-Landau\nequation and the modified FitzHugh-Nagumon equation, which all show complex\ndynamics of spirals and defects. We demonstrate that the spatial-temporal\nfluctuation fields in the above mentioned systems all display the HS similarity\nproperty originally proposed for the study of fully developed turbulence [Z.-S.\nShe and E. Leveque, Phys. Rev. Lett. {\\bf 72}, 336 (1994)]. The derived values\nof a HS parameter $\\beta$ from experimental and numerical data in various\nphysical regimes exhibit consistent trends and characterize the degree of\nturbulence in the systems near the transition, and the degree of heterogeneity\nof multiple disorders far from the transition. It is suggested that the HS\nanalysis offers a useful quantitative description for the complex dynamics of\ntwo-dimensional spatiotemporal patterns.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=nlin%2F0410050%2Cnlin%2F0410030%2Cnlin%2F0410058%2Cnlin%2F0410056%2Cnlin%2F0410027%2Cnlin%2F0410037%2Cnlin%2F0610018%2Cnlin%2F0610004%2Cnlin%2F0610028%2Cnlin%2F0610078%2Cnlin%2F0610077%2Cnlin%2F0610054%2Cnlin%2F0610067%2Cnlin%2F0610037%2Cnlin%2F0610007%2Cnlin%2F0610071%2Cnlin%2F0610048%2Cnlin%2F0610061%2Cnlin%2F0610041%2Cnlin%2F0610070%2Cnlin%2F0610062%2Cnlin%2F0610009%2Cnlin%2F0610051%2Cnlin%2F0610035%2Cnlin%2F0610069%2Cnlin%2F0610032%2Cnlin%2F0610020%2Cnlin%2F0610008%2Cnlin%2F0610040%2Cnlin%2F0610059%2Cnlin%2F0610065%2Cnlin%2F0610016%2Cnlin%2F0610010%2Cnlin%2F0610057%2Cnlin%2F0610046%2Cnlin%2F0610001%2Cnlin%2F0610034%2Cnlin%2F0610042%2Cnlin%2F0610036%2Cnlin%2F0610038%2Cnlin%2F0610056%2Cnlin%2F0610024%2Cnlin%2F0610064%2Cnlin%2F0610002%2Cnlin%2F0610030%2Cnlin%2F0610021%2Cnlin%2F0610003%2Cnlin%2F0610076%2Cnlin%2F0610015%2Cnlin%2F0610023%2Cnlin%2F0610014%2Cnlin%2F0610052%2Cnlin%2F0610049%2Cnlin%2F0610025%2Cnlin%2F0610017%2Cnlin%2F0610031%2Cnlin%2F0610012%2Cnlin%2F0610027%2Cnlin%2F0610063%2Cnlin%2F0610047%2Cnlin%2F0610039%2Cnlin%2F0610075%2Cnlin%2F0610072%2Cnlin%2F0610043%2Cnlin%2F0610013%2Cnlin%2F0610029%2Cnlin%2F0610044%2Cnlin%2F0610053%2Cnlin%2F0610005%2Cnlin%2F0610074%2Cnlin%2F0610026%2Cnlin%2F0610019%2Cnlin%2F0610006%2Cnlin%2F0610011%2Cnlin%2F0610022%2Cnlin%2F0610058%2Cnlin%2F0610033%2Cnlin%2F0610055%2Cnlin%2F0610068%2Cnlin%2F0610045%2Cnlin%2F0610060%2Cnlin%2F0610050%2Cnlin%2F0610066%2Cnlin%2F0610073%2Cnlin%2F0408021%2Cnlin%2F0408007%2Cnlin%2F0408040%2Cnlin%2F0408003%2Cnlin%2F0408024%2Cnlin%2F0408046%2Cnlin%2F0408015%2Cnlin%2F0408002%2Cnlin%2F0408032%2Cnlin%2F0408008%2Cnlin%2F0408059%2Cnlin%2F0408037%2Cnlin%2F0408012%2Cnlin%2F0408027%2Cnlin%2F0408038%2Cnlin%2F0408043%2Cnlin%2F0408017&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We develop a hierarchical structure (HS) analysis for quantitative\ndescription of statistical states of spatially extended systems. Examples\ndiscussed here include an experimental reaction-diffusion system with\nBelousov-Zhabotinsky kinetics, the two-dimensional complex Ginzburg-Landau\nequation and the modified FitzHugh-Nagumon equation, which all show complex\ndynamics of spirals and defects. We demonstrate that the spatial-temporal\nfluctuation fields in the above mentioned systems all display the HS similarity\nproperty originally proposed for the study of fully developed turbulence [Z.-S.\nShe and E. Leveque, Phys. Rev. Lett. {\\bf 72}, 336 (1994)]. The derived values\nof a HS parameter $\\beta$ from experimental and numerical data in various\nphysical regimes exhibit consistent trends and characterize the degree of\nturbulence in the systems near the transition, and the degree of heterogeneity\nof multiple disorders far from the transition. It is suggested that the HS\nanalysis offers a useful quantitative description for the complex dynamics of\ntwo-dimensional spatiotemporal patterns."}, "authors": ["Jian Liu", "Zhen-Su She", "Hongyu Guo", "Liang Li", "Qi Ouyang"], "author_detail": {"name": "Qi Ouyang"}, "author": "Qi Ouyang", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevE.70.036215", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/nlin/0408024v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/nlin/0408024v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "11 pages, 13 figures, to be published in Pre. Rev. E", "arxiv_primary_category": {"term": "nlin.PS", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "nlin.PS", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "nlin.CD", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/nlin/0408024v1", "affiliation": "Department of Physics, PKU", "arxiv_url": "http://arxiv.org/abs/nlin/0408024v1", "journal_reference": "Phys. Rev. E 70, 036215 (2004)", "doi": "10.1103/PhysRevE.70.036215", "fulltext": "Hierarchical structure description of spatiotemporal chaos\nJian Liu1 , Zhen-Su She1,2∗\n1\n\nState Key Laboratory for Turbulence and Complex Systems\nand Department of Mechanics and Engineering Science, Peking University, Beijing 100871, P.R. China\n2\nDepartment of Mathematics, UCLA, Los Angeles, CA 90095, USA\n\nHongyu Guo, Liang Li, Qi Ouyang\n\narXiv:nlin/0408024v1 [nlin.PS] 14 Aug 2004\n\nDepartment of Physics, Peking University, Beijing, 100871, P.R. China\n(Dated: October 1, 2018)\nWe develop a hierarchical structure (HS) analysis for quantitative description of statistical states\nof spatially extended systems. Examples discussed here include an experimental reaction-diffusion\nsystem with Belousov-Zhabotinsky kinetics, the two-dimensional complex Ginzburg-Landau equation and the modified FitzHugh-Nagumon equation, which all show complex dynamics of spirals\nand defects. We demonstrate that the spatial-temporal fluctuation fields in the above mentioned\nsystems all display the HS similarity property originally proposed for the study of fully developed\nturbulence [Z.-S. She and E. Leveque, Phys. Rev. Lett. 72, 336 (1994)]. The derived values of a HS\nparameter β from experimental and numerical data in various physical regimes exhibit consistent\ntrends and characterize the degree of turbulence in the systems near the transition, and the degree\nof heterogeneity of multiple disorders far from the transition. It is suggested that the HS analysis\noffers a useful quantitative description for the complex dynamics of two-dimensional spatiotemporal\npatterns.\nPACS numbers: 05.45.-a; 82.40.Ck; 47.54.+r; 47.27.-i\n\nAnother question often raised is what quantitative\nmeasures are useful when spatiotemporal patterns evolve,\n\nespecially after spatiotemporal chaos are developed [7, 8].\nAttempt to identify defects and conduct statistical study\nof defects in defect-mediated turbulence has yielded some\ninteresting results. In the discussion on the CGL system, it was argued [6] that the number of defects can\nbe a convenient quantity to characterize spatiotemporal\nchaos. However, the relation between the finite-time dimension and the number of defects has not been fully\nestablished for systems of all sizes and of all duration\nintervals, and thus the method of separation has not\nappeared fully convincing [7]. In addition, when spatiotemporal pattern become chaotic, the identification of\nthe basic structure (e.g. the defect) is not always possible, and its statistics become dubious. In general, spirals\nact more like waves than particles, but sometimes they\nmay display spatially intermittent features. Note that,\nalthough the RB convection, the BZ reaction, and the\nCGL system all exhibit spiral wave behaviors and defect\nstructures, the instabilities leading to complex spatiotemporal behaviors are of different nature. Moreover, local\npattern structures may also appear in various forms of\nspiral, stripe, hexagon, or square. Nevertheless, transitions from ordered to disordered states exist in all these\nsystems, and a common feature of these transitions is\nthe generation of multiple scale fluctuations. Therefore,\nsimple phenomenology independent of the details of the\nparticular system is needed to reveal the essential feature\nof spatiotemporal chaos \"buried in the wealth of available\ndata\" [8]. The present work propose such a simple phenomenology but with a quantitative measure.\n\n∗ Correspondance:\n\nThere are several other quantitative measures proposed for characterizing disorder in pattern dynamics.\nCorrelation length was directly estimated in experiments\n\nI.\n\nINTRODUCTION\n\nSpatiotemporal chaos have been studied extensively in\nrecent years with different level of quantitative characterization [1]. It was discovered that for some spatially\nextended systems such as the Rayleigh-Bénard (RB) convection [2, 3], an ordered state of straight or weakly\ncurved rolls breaks down to a spatiotemporally chaotic\nstate consisting of elementary spiral structures which appear and disappear in an irregular fashion. Spiral patterns driven far from equilibrium have also been studied\nin chemical reaction-diffusion systems such as BelousovZhabotinsky (BZ) reaction [4] and in biological systems\nsuch as cardiac muscle tissue [5]. While an individual\nspiral is considered as a self-organized topological defect,\ninstabilities can lead to so-called defect-mediated turbulence [6] that is characterized by an exponential decay\nof correlations with length and time. There have been\nvery fruitful efforts in the theoretical, experimental and\nnumerical studies on the onset phase of the instability\nwhich results in the breaking down of spiral waves to the\nearly transition to the disorder states (for a review on the\ncomplex Ginzburg-Landau (CGL) system, see Ref. [7]).\nThe study of the transition via instabilities is important\nfor problems such as the transition from spiral to spiral\nturbulence in heart tissue which plays an essential role in\ncardiac arrhythmia and fibrillation [5].\n\nshe@pku.edu.cn\n\n\f2\n\n• simply rotating spiral (S);\n• meandering spiral (M );\n• chemical turbulence due to the Doppler instability\n(D);\n• abnormal chemical turbulence (A);\n• renascent stable spiral (R);\n• convectively unstable spiral (C1 and C2 );\n• chemical turbulence due to the long wavelength instability (T )\nThis rich set of spiral patterns is an ideal system for testing theoretical methods for characterizing spatiotemporal\nchaos.\nWe have proposed a hierarchical structure (HS) description of spatiotemporal chaos [18, 19] based on an\nearlier HS model of She and Leveque for hydrodynamic\nturbulence [20, 21]. The starting point of the analysis\nis to construct a multi-scale probability density function\n(PDF) description for the fluctuation field of our interest, and then to develop a phenomenological model for\n\n(M)\n\n1.0\n\n0.8\n\nM\n\nMA\n\n[9], and was also extracted from correlation functions [10]\nor from the width of so-called structure factors [11, 12].\nHu et al. [13] proposed to use local wave numbers as\nan order parameter to characterize experimental RB patterns. Gunaratne et al. [14] suggested a disorder function\nto describe disordered patterns close to locally striped\nstructures [15]. Egolf et al. [16] presented a simple algorithm for real-time quantitative analysis of local structure by computing the local wave number in disordered\nstriped patterns. Newell and co-workers [17] used a wavevector field determined by the wavelet transform to study\nthe behavior of phase-diffusion equations in the presence\nof defects. All the methods mentioned above are effective\nto describe irregular patterns with \"visually\" distinct local structures such as local striped structure. When spatiotemporal chaos are overwhelmingly developed, however, local striped structures can not be defined and these\nmeasures can not be applied. This is the case for spiral turbulence in highly turbulent regimes of BZ experiments where either exact defect structures or characteristic wave numbers are difficult to obtain. The present\nstudy gives a different approach which may be applicable\nto much more disordered patterns.\nThe BZ reaction system is a particularly interesting\nsystem for the study of the spiral dynamics, where spirals\ncan be supported in excitable or oscillatory media [1, 4].\nA recent experimental study [18] has systematically identified several regimes of spatial patterns resulted from two\ninstabilities, a Doppler instability and a long wavelength\ninstability. At various values of the chemical concentration in reservoir A of malonic acid [M A]A and in reservoir\nB of sulfuric acid [H2 SO4 ]B , the BZ reaction system displays a variety of patterns including (see Fig. 1 which is\nreproduced from Fig. 1 of Ref. [18])\n\nC1\n\nS\n\n0.6\n\nC2\n0.4\n\nA\nD\n\n0.2\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n2\n\nR\n1.0\n\nH SO\n\n4\n\nT\n\n1.2\n\n1.4\n\n1.6\n\n(M)\n\nFIG. 1: The phase diagram of the BZ experiment reproduced\nfrom [18]. The concentrations [M A]A and [H2 SO4 ]B are the\ncontrol parameters. The solid lines indicate the onsets of\ndifferent instabilities. The dashed lines are the extrapolation\nof the solid lines. The heavy line with arrows at [M A]A =\n0.4M indicate the case studied here.\n\nthe description of PDFs over the entire range of scales.\nThis set of PDFs carries the probability information for\nfluctuations at different scales (large versus small) and at\ndifferent intensities (tail events versus core events). The\nscale enters as a parameter when the fluctuation field is\nfiltered for defining random variables, and the intensity\nis parameterized by the order of the moments calculated\nwith the PDFs. Therefore, the dependence of the moments on the scale l and on the order p constitute a set\nof quantitative measures about the properties of the field.\nThe HS model gives a special compact description of\nthis set of multi-scale and multi-intensity properties. The\nbasic idea in the HS model is that many statistically stationary multi-scale fluctuation fields generated from nonlinear interactions between many degrees of freedom have\na self-organized property expressible in terms of multifractal scaling whose multifractal dimension function can\nbe understood in terms of a similarity relation between\nstructures of increasing intensities of successive momentorder p [20]. This new similarity relation was proposed\nfor turbulence as a generalization of the Kolmogorov's\ncomplete-scale-similarity [21]. Later, it was discovered\nthat the HS similarity is satisfied in a variety of nonlinear\nsystems and other complex systems, such as the RB convection [22], the Couette-Taylor flow [23], flows in rapidly\nrotating annulus [24], the climate variations [25], the variation of nucleotide density along DNA sequences [26], the\ndiffusion-limited aggregates [27], a fluctuating luminosity\nfield of natural images [28] and several others [29]. More\ninterestingly, the previous studies show that the derived\nHS parameters are closely related to global property of\nthe turbulent system. For example, in Couette-Taylor\nflow, one HS parameter gives a signature of the breaking\ndown of the Taylor vortex [23]. It is thus hoped that\n\n\f3\nthe HS analysis would shed light on the properties of a\nfluctuation field displaying spatiotemporal chaos.\nIn [18, 19], the HS analysis is briefly applied to describe\nthe spiral turbulence in the BZ experiment and in the numerical solutions of the two-dimensional CGL equation.\nIt was shown that the HS similarity is accurately verified\nfor various experimental and numerical two-dimensional\nfluctuation fields which include both the ordered spirals\nand spatiotemporal chaos. In the study of the BZ experiment, it is discovered that the measured HS parameter\nβ shows a transition when the system undergoes a transition from one kind of spiral turbulence state to another\n(e.g. from the state D to the state T in Fig. 1). Those\npreliminary findings have inspired the present detailed\nstudy of the nature of β while a more complex sequence\nof transitions are analyzed and more numerical models\nare considered.\nSpecifically, we will examine more experimental data\nwith transitions between complex states. In Fig. 1, at\n[M A]A = 0.4, the patterns vary through M , S, C1 , A,\nC2 , R, and T . During the transition, the amount of order (e.g. spiral structures), the degree of heterogeneity\n(with the mixing of ordered and disordered structures)\nand intermittency vary with parameters. We will show\nthat β characterizes such transitions near and far from\nthe threshold in the experimental BZ system. We supplement this with a further detailed study of the spiral dynamics in the CGL equation [7] and in a twocomponent model equation called modified FitzHughNagumo (mFN) model [30, 31] which has a number of\napplications in biological systems. In all cases, we focus\non the validity of the HS description and the explanation\nof the dynamics in terms of the degree of heterogeneity\nand of intermittency that the value of β indicates. We\nbelieve that the relationship between the values of β and\nthe dynamics of spatiotemporal patterns is valuable.\nThe paper is organized as follows. In Section II, we\npresent briefly the HS model with special emphasis on\nthe method of the HS similarity test (β-test) and the\nexplanation of the meaning of β. Section III is devoted\nto the analysis of a sequence of complex transitions in\nthe experimental BZ system. In Section IV, we carry out\na detailed study of the transition of the spiral dynamics\nin the CGL equation and the mFN equation. Section V\noffers a summary and some additional discussion.\n\nII.\n\nTHE HS DESCRIPTION\n\nThe HS model has been originally proposed by She\nand Leveque to describe inertial-range multi-scale fluctuations in a turbulent fluid. The key concept in the\nmodel is a hierarchy of moment ratios. Let εl denotes a\ncertain characteristic variable characterizing fluctuations\nof the physical system at the length scale l. Define the\npth-order moments Sp (l) = h|εl |p i. The HS model intro-\n\nduce a hierarchy of functions:\nFp (l) =\n\nSp+1 (l)\n,\nSp (l)\n\n(1)\n\neach of which has the physical dimension of εl and hence\ndescribes a certain amplitude of the fluctuations. The\nfunction Fp (l) depends on the probability density functions (PDFs) of εl . For a typical set of PDFs of a turbulent field and of a spatiotemporal field as we study in this\nwork, the function Fp (l) increases with p. In other words,\nFp (l) at higher p is associated with higher intensity fluctuation structures. We refer Fp (l) to as the pth-order HS\nfunction.\nAn intuitive idea in the HS model is that in a selforganized dynamical steady state, there is a similarity in the dependence of Fp (l) on l for different p's\n(0 ≤ p ≤ ∞). In the case of scaling dependence on l,\nthe simplest similarity is that all Fp (l) have the same\nscaling. This corresponds to the Kolmogorov 1941 (K41)\ntheory of turbulence in which the large and small scale\nstatistics are completely self-similar. For example, when\nεl represents the locally averaged dissipation, then the\nK41 theory predicts that Fp (l) ∼ F0 (l) = hεl i ∼ l0 (the\nmean dissipation is equal to the average energy flux that\nis constant independent of the scale). This complete selfsimilarity law has been demonstrated invalid in experiments and numerical simulations during the past decade,\nand the dissipation fluctuations have anomalous scalings\nin l. This is so-called intermittency effect [33].\nShe and Leveque [20] postulate that the most intense\nstructure F∞ (l) = limp→∞ Fp (l) plays a special role, and\nall other fluctuation structures of finite p obey a hierarchical similarity law, namely:\nFp+1 (l)\n= Ap\nF∞ (l)\n\n\u0012\n\nFp (l)\nF∞ (l)\n\n\u0013β\n\n(2)\n\n,\n\nwhere 0 ≤ β ≤ 1, Ap are independent of l. The term\nF∞ (l) can be eliminated by considering the ratio\nFp+1 (l)\nAp\n=\nFp (l)\nAp−1\n\n\u0012\n\nFp (l)\nFp−1 (l)\n\n\u0013β\n\n.\n\n(3)\n\nBoth sides of Eq. (3) can be computed from the empirical PDFs (or histograms) of εl calculated from an experimental or numerical fluctuation field. The linearity\nin the log-log plot of Eq. (3) can be a direct test of the\nvalidity of Eq. (2). This will be refer to as the HS similarity test, or the β-test [23, 34]. Figure 2 shows the\nresult of applying the β-test to the data of experimental\nBZ reaction (for details, see below). The linear relation\nis obviously verified, and the slope β can be accurately\nestimated.\nThe meaning of the parameter β can be readily obtained from the definition Eq. (2) [21, 23]. It describes a\nkind of discrepancy between Fp+1 and Fp . When β approaches 1, high p (intense) structures and low p (weak)\n\n\f4\nappears to be heterogeneous. The smallest β indicates\nthe appearance of overwhelmingly disordered and intermittent state with fully developed spatiotemporal chaos.\nThe details of these findings are reported below.\n\n0.0007\n\n0.0006\n\np\n\n(l)/F (l)]\n\n0.0005\n\nIII.\n\nANALYSIS OF EXPERIMENTAL BZ\nSYSTEM\n\n0.0003\n\nlog\n\n10\n\n[F\n\np+1\n\n0.0004\n\nB\n\n0.0002\n\n=1.00 [H SO ] =0.367M\n2\n\n4\n\nB\n\n=0.75 [H SO ] =1.000M\n2\n\n4\n\n0.0001\n\nB\n\n=0.61 [H SO ] =1.600M\n2\n\n4\n\n0.0000\n0.0000\n\n0.0001\n\n0.0002\n\nlog\n\n0.0003\n\n[F (l)/F\n\n10\n\np\n\n0.0004\n\n(l)]\n\np-1\n\nFIG. 2: The HS similarity test for three patterns from the\nexperimental BZ system: [H2 SO4 ]B = 0.367M , 1.0M , and\n1.6M . The other control parameter is fixed at [M A]A =\n0.4M . A straight line indicates the validity of the HS similarity. The slope β is estimated by a least square fitting. For\nclarity, the second and third set of data points are displaced\nvertically up by a suitable amount.\n\nstructures are alike. This may be realized at either extremely ordered states or completely homogeneous disordered states. In the former, the structures of various\nintensities are strongly correlated. Below, we will report\nobservations of this β for ordered spiral states. The latter situation corresponds to the hypothetical field postulated by the K41 theory with complete self-similarity;\nunfortunately, it has not yet been observed in real physical system. Another extreme case is the limit β → 0.\nThis is the case in which F∞ (l) stands out as the only\nkind of singular structure which is responsible for the\nphysical process. A mathematical model displaying the\ndynamics of one-dimensional shocks, the so-called Burgers equation, exhibits behavior close to this description,\nwhere only shocks at isolated points are responsible for\nthe energy dissipation and all statistical moments are determined by the discontinuities across the shocks.\nThe study of hydrodynamic turbulence reveals that in\nmany realistic turbulent systems, 0 < β < 1, namely the\nmost intense fluctuations do not completely dominate\nand the fluctuation structures of various intensities are\nnot completely alike. The fluctuation structures of various intensities are all responsible for the physical process,\nbut they are related by the hierarchical similarity law\nEq. (2) which we believe is a form of the self-organization\nof the system.\nThe results reported below on the experimental BZ\nsystem and numerical spiral dynamics demonstrate that\nwhen the hierarchical similarity holds, the parameter\nβ gives a quantitative description of the degree of order/disorder and of homogeneity/heterogeneity. For β\nclose to one, the system appears to be orderly homogeneous and orderly self-organized; for moderately smaller\nβ the system contains a mixture of order/disorder and\n\nThe experimental BZ system analyzed here has been\ndescribed in detail in Ref. [18]. An extensive phase\ndiagram (see Fig. 1) is established in the two dimensional plane formed by the concentration [H2 SO4 ]B versus [M A]A , in which various pattern dynamical states are\nidentified based (essentially) on visual inspection of experimental images or luminosity fields. The HS analysis\nis performed on the total variation field, G(x, y), rather\nthan directly on the luminosity (image) field f (x, y):\nwhich is proportional to the chemical concentration:\n\u0014\n\n∂f\n∂f\nG(x, y) = ( )2 + ( )2\n∂x\n∂y\n\n\u00151/2\n\n.\n\n(4)\n\nThen, we construct a set of multi-scale variables to be\nthe coarse-grained local variation field, εl , similar to the\nlocally averaged energy dissipation in turbulence, which\nis defined as below:\n1\nεl = 2\nl\n\ny+l\nx+l Z\nZ\nG(f (x′ , y ′ ))dx′ dy ′ .\nx\n\n(5)\n\ny\n\nWe examine the statistical properties by calculating the\nmoments of εl as l varying for increasing control parameter [H2 SO4 ]B . The moments Sp (l) = h|εl |p i are calculated by a space-average of 256 × 256 pixels and by a\ntime-average over a number of images collected at different times. Furthermore, the HS functions Fp (l) are\ncalculated and the ratio across successive orders are evaluated and plotted, as in Fig. 2. It is readily seen that\nthe hierarchical similarity is satisfied and the HS parameter β can be obtained (by a least square fitting) with\na good accuracy. Technically speaking, this completes\nthe HS analysis of a fluctuation field at a given control\nparameter.\nDetailed examinations of the values of β at various control parameters constitute a further step in the analysis.\nThe variation of β for all patterns observed in the experiment at each parameter value of [H2 SO4 ]B is recorded\nin Fig. 3. The values of β seem to exhibit strong fluctuations, and it seems that there is no simple correspondence\nbetween the value of β and the regime. More careful inspection reveals, however, that β describes the property\nof the pattern as expected from the theoretical consideration above. We attempt to itemize our observations as\nfollows:\n(a) For the ordered patterns, the values of β measured\nare close to one. In Fig. 4(a), we plot a typical experimental image of the ordered spiral state (M ) with β = 1.\n\n\f5\n\nM\nS\nC1\nA\nC2\nR\nT\n\n1.0\n\n0.9\n\n0.8\n\n0.7\n\n0.6\n\n0.4\n\n0.6\n\n0.8\n\n1.0\n\n1.2\n\n[H SO ]\n2\n\n4\n\nB\n\n1.4\n\n1.6\n\n1.8\n\n2.0\n\n(M)\n\nFIG. 3: The HS similarity parameter β as a function of\nthe control parameter [H2 SO4 ]B with fixed [M A]A = 0.4M .\nSymbols indicate the pattern regimes as found experimentally\n(see the text for detailed explanation).\n\nFIG. 4: Optical images of typical experimental states obtained with different [H2 SO4 ]B : (a) an ordered state with\n0.367M , β = 1.0; (b) a heterogeneous disordered state (coexistence of spiral waves and spatiotemporal chaos) with\n0.833M , β = 0.7; (c) an abnormal turbulent state with\n0.867M , β = 0.94; (d) a homogeneous intermittent disordered state with 1.4M , β = 0.62. The parameter [M A]A are\nfixed at 0.4M . The region shown is 8.5 × 8.5mm2 out of a\ndisk with 20mm2 in diameter.\n\nTheoretically speaking, β = 1 implies that low and high\nintensity structures are alike, which happens with an ordered pattern. Note that some values of measured β are\nnot close to one for ordered spiral states (e.g. the two\nS states for which β ≈ 0.75 in Fig. 3). One possible explanation for the exception of the two S states with low\nβ is the existence of experimental noise (e.g., dark spots\nin the experimental images) that introduces artificially\nsharp structures in the field. Our studies show that such\n\"intrusion\" of sharp objects lead to a decrease of β.\n(b) Near the transition between one regime and another, we observe a depletion of the value of β compared to that measured for the states far from the transition (see Fig. 3). We plot a typical experimental image near the transition between C1 and A in Fig. 4(b)\nwith β = 0.7. Theoretically speaking, a lower value of\nβ indicates a higher intermittency of the spatial patterns. Fig. 4(b) indeed shows a mixture of ordered spirals\nand disordered irregular spiral elements, which displays\nclearly a strong heterogeneity. We conclude that one kind\nof intermittency in spatially extended systems is related\nto heterogeneous composition of patterns of different origins. In addition, we conclude that a sharp variation of\nβ usually indicates a transition of regimes. This finding\nis interesting for defining statistical regimes. We believe\nthat this is the most interesting finding of this work.\n(c) In fully developed spatiotemporally chaotic states,\nthe spatial patterns develop small-scale intermittent\nstructures and yield even smaller values of β (< 0.65). In\nFig. 4(d), we show a experimental image for the chemical turbulent state T with β = 0.62. It is clear that very\nsmall characteristic scales are developed in the patterns\nwhich signify large fluctuations in the total variation field\n(because of the spatial derivatives). This enhanced intermittency appears to be stronger than noted in item (b).\n(d) There are also other disordered states (e.g. A\nand C2 ) for which β is close to one. Close inspection\nshows that these disordered states all encompass largescale irregular spiral elements, as shown in Fig 4(c) where\nβ = 0.94. These large-scale patterns are quite homogeneous and spatially ordered, which may yield a large\nvalue of β. Note that the HS analysis conducted in this\npaper is a spatially multiscaling analysis which describes\nonly the property of instantaneous spatial patterns. Our\nconclusion is that the states in the regimes A and C2 involve only spatially ordered patterns with actively temporal dynamics. They are distinguished from the other\nchaotic states like T and D.\nThe above analysis helps to understand the nature of\nthe parameter β in the HS analysis of spatiotemporal\nchaos, and confirms our previous finding that β's variation reveals a transition between two different spatiotemporally chaotic states. The spiral turbulence state due to\nthe Doppler instability has a characteristic scale larger\nthan that in the spiral turbulence state due to the long\nwavelength instability. Both states are homogeneously\nchaotic, but the later contains more intermittent smallscale structures. The HS analysis is suitable to capture\n\n\f6\n\n1.00\n\n0.95\n\nBreaking-up\n0.90\n\nChaos states\n\n0.85\n\n0.80\n\n0.5\n\n0.6\n\n0.7\n\n0.8\n\n0.9\n\nC\n\n3\n\nFIG. 7: The HS similarity parameter β as a function of the\ncontrol parameter c3 in the CGL equation. Note a clear transition from an ordered state to a spatiotemporally chaotic\nstate.\nFIG. 5: Snapshots of the field f (x, y) from the CGL equation\nat four different parameter values of c3 . (a) stable spiral,\nc3 = 0.6; (b) coexistence of spiral and spatiotemporal chaos,\nc3 = 0.74; (c) coexistence of spiral and spatiotemporal chaos,\nc3 = 0.75; (d) fully spatiotemporal chaos, c3 = 0.8.\n\n0.009\n\n0.008\n\n0.007\n\n0.005\n\n0.004\n\nlog\n\n10\n\n[F\n\np+1\n\np\n\n(l)/F (l)]\n\n0.006\n\n0.003\n\n(a)\n\n0.002\n\n0.001\n\n=0.99\n\n(b)\n\n=0.82\n\n(c)\n\n=0.79\n\n(d)\n\n=0.90\n\n0.000\n0.000\n\n0.001\n\n0.002\n\n0.003\n\nlog\n\n0.004\n\n[F (l)/F\n\n10\n\np\n\n0.005\n\n0.006\n\n0.007\n\n(l)]\n\np-1\n\nFIG. 6: The HS similarity test for the four patterns in Fig. 5\nof the CGL equation. A straight line indicates the validity of\nthe HS similarity. The slope β is estimated by a least square\nfitting. For clarity, the second, the third and the fourth set of\ndata points are displaced vertically up by a suitable amount.\n\nsuch difference.\n\nIV.\n\nANALYSIS OF NUMERICAL SPIRAL\nTURBULENCE\n\nWe now turn to the analysis of numerically simulated\ntwo-dimensional spatiotemporal dynamics. First, in nu-\n\nFIG. 8: A sequence of evolving fields f (x, y) from the CGL\nequation at different times. (a) t = 390; (b) t = 500; (c)\nt = 550; (d) t = 770.\n\nmerical calculations, the interaction mechanism responsible for the generation of spatial patterns is under good\ncontrol, so that spatial patterns are free of noises and\nperturbations that are inevitable in experiments. For example, optical artifacts in the experimental images pose\ngreat challenge to the HS analysis (in the calculation of\nthe total variation field) and thus compromise the clarity\nof the finding. Secondly, the experimental states analyzed above are all asymptotical states. We are also interested in the characterization of transient states. In\nother words, we are interested in testing whether the\n\n\f7\ntion is the two-dimensional CGL equation:\n∂A\n= A + (1 + ic1 )△A − (1 + ic3 ) |A|2 A,\n∂t\n\n0.030\n\n0.025\n\np\n\n(l)/F (l)]\n\n0.020\n\nlog\n\n10\n\n[F\n\np+1\n\n0.015\n\n0.010\n\n(a)\n\n0.005\n\n=0.99\n\n(b)\n\n=0.84\n\n(c)\n\n=0.72\n\n(d)\n\n=0.89\n\n0.000\n0.000\n\n0.002\n\n0.004\n\n0.006\n\nlog\n\n0.008\n\n0.010\n\n[F (l)/F\n\n10\n\np\n\n0.012\n\n0.014\n\n0.016\n\n0.018\n\n(l)]\n\np-1\n\nFIG. 9: The HS similarity test for the four patterns in Fig. 8\nof the CGL equation. A straight line indicates the validity of\nthe HS similarity. The slope β is estimated by a least square\nfitting. For clarity, the second, the third and the fourth set of\ndata points are displaced vertically up by a suitable amount.\n\n1.00\n\nBreaking-up\n\n0.95\n\n0.90\n\n0.85\n\n0.80\n\nChaos states\n\n0.75\n\n0.70\n\n300\n\n400\n\n500\n\n600\n\n700\n\n800\n\nt\n\nFIG. 10: The HS similarity parameter β as a function of time\nfor a sequence of evolving patterns in the CGL equation. Note\nthat β acts as an order parameter revealing the transition\nfrom an ordered state to a spatiotemporally chaotic state.\n\nHS description can characterize the property of a spatial pattern which undergoes actively dynamical evolution. Numerical simulations provide a detailed sequence\nof patterns under dynamic evolution. Finally, the present\nanalysis of numerically simulated field may inspire further studies of a variety of two-dimensional partial differential equations of pattern dynamics, e.g. the NavierStokes equation for the vortex dynamics. Such empirical\nstudies are important to the finding of right order parameters of chaotic pattern dynamics.\nWe will study two model equations for the pattern dynamics leading to spatiotemporal chaos. The first equa-\n\n(6)\n\nwhere A(r, t) is a complex function of time (t) and space\n(r), the real parameters c1 and c3 are coefficients characterizing linear and nonlinear dispersion respectively. Although the CGL equation is a normal form relevant only\nnear the threshold of a supercritical Hopf bifurcation,\nit has become a popular model to study spatiotemporal chaos where oscillations and waves are present [1, 7].\nIndeed, our simulation gives rise to both simple spiral\nwaves and chaotic states which encompass many disordered spatiotemporal oscillations.\nThe numerical study of Eq. (6) is performed using an\nEuler algorithm with no-flux boundary condition on a\n256 × 256 square lattice and a time step of △t = 0.03.\nThe initial conditions are chosen to be a simple spiral\nwave which is the stable solution when c1 = −1.40 and\nc3 = 0.50. We then keep c1 fixed and increase c3 to\nexplore possibly alternative patterns. We choose to analyze the fluctuation properties of the real part f (x, y)\nof the complex field A(x, y) = f (x, y) + ig(x, y). The\ndetails of the computation and the transition leading to\nspatiotemporal chaos can be found in Ref. [19], where\nwe have established the fact that the β-test is satisfied\nin both ordered spiral states and spatiotemporal chaos\nstates. In the present work, we report the result of a\nsystematic HS analysis of a sequence of patterns with\nvarying parameters.\nFour snapshots of the field f (x, y) are shown in Fig. 5,\nwhich contribute to a so-called far-field breaking-up process. As c3 increases, the convective instability occurs\nand the spiral wave breaks up far from the tip. In a range\nof intermediate values of c3 , the spiral wave coexists with\nspatiotemporal chaos surrounding it. Finally, at high\nvalues of C3 , the spiral wave totally breaks up and spatiotemporal chaos dominate the whole box (c3 > 0.76).\nThe HS analysis of the solutions of the CGL equation\nbegins with the construction of the total variation field.\nLet G(x, y) be defined as in Eq. (4) with the field f (x, y).\nThe coarse-grained local variation field, εl , is defined as\nin Eq. (5). The same procedure of the β-test as explained\nin the previous section is now applied to the data εl .\nAs shown in Fig. 6, good linearity and hence the HS\nsimilarity are obtained for all the states of both ordered\nspirals and irregular spiral turbulence, consistent with\nthe result reported previously [19] and similar to that in\nFig. 2. Note again that the values of β are close to one for\nordered spiral states, but significantly below one (< 0.9)\nwhen spatiotemporal chaos are developed.\nThe variation of β as a function of c3 is shown in Fig. 7.\nAll ordered spiral states have β very close to one, and\nthe appearance of the irregular patterns surrounding the\ncentral spiral leads to a smaller β. It is interesting to\nnote that the final chaotic states at high c3 have a β ≈\n0.9 which is bigger than that of the transitional states\nwith a mixture of ordered spirals and chaos. This fact\n\n\f8\nthe evolution of the CGL system from the ordered spiral\nto the disordered spatiotemporal chaos.\nThe second model equation we have studied is a simple activator-inhibitor model: the two-dimensional mFN\nmodel [30, 31]. While the CGL equation describes an\noscillatory dynamics (with two components representing\nthe real and imaginary parts of a complex variable field),\nthe mFN model is a two-component model of an excitable\nsystem in which a fast activator (u) and a slow inhibitor\n(v) are in interaction:\n\u0015\n\u0014\n1\nv+b\nut = − u(u − 1) u −\n+ △u,\n(7a)\nσ\na\nvt = f (u) − v,\n\nFIG. 11: Snapshots of the field of the fast activator u in the\nmFN equation. (a): simple spiral, σ = 0.0525; (b): meandering spiral, σ = 0.07; (c): outbreak of breaking-up spiral,\nσ = 0.0725; (d): spatiotemporal chaos, σ = 0.075. Other\nparameters are a = 0.84, b = 0.07.\n\nis consistent with the previous finding in the analysis of\nthe experimental BZ system that the mixed states near\nthe transition are more heterogeneous and tend to have\nsmaller β.\nAnother interesting aspect of the numerical CGL dynamics is the possibility to follow closely a spontaneous\ngeneration of spatial disorder from an ordered state. A\nsequence of dynamically evolving patterns are shown in\nFig 8, where the spiral core breaks up without meandering and then subsequently develops to a complete spatiotemporal chaotic pattern. This fast breaking-up process is phenomenologically similar to that of the Doppler\ninstability [4, 32], but with the spiral center fixed. The\ndetails of the explanation for this process can be found\nin Ref. [19]. Here, we show four typical snapshots of the\nspatial pattern at successive times with fixed control parameter c1 = −1.40 and c3 = 0.8.\nFigure 9 reports the result of the β-test for the corresponding four pattern states in Fig. 8. Good HS similarity property is found for all pattern states, including the\nsingle spiral (β ≈ 1), the intermediate state with generated defects (β < 0.9) and the full developed turbulent\nstate (β ≈ 0.9). Figure 10 shows the variation of β as\na function of time during the core breaking-up. The parameter β begins with a value close to one and undergoes\na transition when disorder is developed. At t ≈ 550, β\nreaches the minimum value when disorder is mixed with\norder. Later, β increases again because of the homogeneity of the disorder. These facts are consistent with the\nobservations reported earlier. Once more, the HS parameter β acts as an order parameter to the description of\n\n\n 0,\nf (u) =\n1 − 6.75u(u − 1)2 ,\n\n1,\n\n(7b)\n0 ≤ u < 31\n1\n3 ≤ u≤ 1\nu>1\n\n(7c)\n\nwhere, the form of f (u) describes an inhibitor production only above a threshold value of u, and the value of\nσ related to the time scales of both activator (u) and\ninhibitor (v) measures the degree of excitability. A nice\nfeature of the mFN model is that the degree of the excitability of the medium can be continuously modified by\nvarying the parameters. It is known [30] that fast activator dynamics (0 < σ ≪ 1) and suitable choice for other\nparameters (a < 1, b > 0) lead to excitability. When\none fixes the parameters a and b and gradually increases\nσ, the excited spiral waves will loss its stability, begin to\nmeander, then break up at the tip, and spread chaotic\nspiral elements outward. Finally, the system develops a\nstate of spatiotemporal chaos. This scenario is illustrated\nin Fig. 11, which contains a sequence of images of grayscale picture of the activator u obtained at various times\nof a dynamic evolution.\nThe numerical calculation of Eq. (7) reported above\nuses an Euler algorithm with no-flux boundary condition\non a 256 × 256 square lattice. The data presented in\nFig. 11 are obtained with fixed parameters a = 0.84 and\nb = 0.07, but with several different values of σ. The\nsimulation starts with a simple spiral initial condition\nthat is the stable solution of the system at smaller values\nof σ (e.g. σ = 0.50). At σ = 0.725, a transition from the\nsimple spiral to spatiotemporal chaos as described earlier\nis fully realized.\nTo carry out the HS analysis, the total variation field\nG(x, y) for the mFN model is calculated from the fast\nactivator field u(x, y) as in Eq. (4). The coarse-grained\nlocal variation field, εl , is defined as in Eq. (5). We have\napplied the β-test for the moments of εl , and the result\nis shown in Fig. 12. Clearly, the hierarchical similarity is\nverified for all values of σ and the values of β are derived\naccurately in all cases. The variation of β as a function\nof σ is presented in Fig. 13. The correspondence between\nthe degrees of orders/disorder and the values of β is quite\n\n\f9\nis worth noting that the numerical data are free from\ncomplicated disturbance so that the values of β show a\nconsistent trend of variation with less fluctuations, compared to the results of Fig. 3. We therefore find the\nconvincing evidence that the HS parameter β is like an\norder parameter that describes the transition from an\nordered spiral state to a homogeneous disordered spiral\nturbulence.\n\n0.010\n\n0.006\n\n0.004\n\nlog\n\n10\n\n[F\n\np+1\n\np\n\n(l)/F (l)]\n\n0.008\n\n(a)\n0.002\n\n=0.99\n\n(b)\n\n=0.93\n\n(c)\n\n=0.86\n\n(d)\n\n=0.83\n\nV.\n\nSUMMARY AND DISCUSSION\n\n0.000\n\n0.000\n\n0.002\n\nlog\n\n0.004\n\n[F (l)/F\n\n10\n\np\n\n0.006\n\n(l)]\n\np-1\n\nFIG. 12: The HS similarity test for the four pattern states\nin Fig. 11 of the mFN equation. A straight line indicates the\nvalidity of the HS similarity. The slope β is estimated by\na least square fitting. For clarity, the second, the third and\nthe fourth set of data points are displaced vertically up by a\nsuitable amount.\n\n1.00\n\nMeandering\n\n0.95\n\n0.90\n\n0.85\n\nBreaking-up\n0.80\n\n0.05\n\n0.06\n\n0.07\n\n0.08\n\n0.09\n\nFIG. 13: The HS similarity parameter β as a function of\nthe control parameter σ in the mFN equation. Note a clear\ntransition from an ordered state to a spatiotemporal chaotic\nstate.\n\nclear, as shown in the study of the CGL equation. As\nthe parameter σ increases, the pattern gradually loses\nthe correlation and β decreases. Detailed examination\nshows that the tip of the spiral wave begins to meander\nat σ = 0.625, and completely breaks up at σ = 0.725.\nThe break-up of the tip of the spiral marks the transition\nfrom β ≈ 1 to β ≈ 0.8. The later state corresponds to a\nfully developed spatiotemporal chaos.\nThe above numerical studies reveal that the CGL and\nmFN model equations have less complicated patterns\nthan those in the experimental BZ system. This significantly reduces the complexity of the matter, and renders\nthe HS description of the dynamics easy to interpret. It\n\nOne of the most interesting problems in the study of\nthe pattern dynamics is to find a quantitative measure\nthat describes the global property of the pattern in both\nordered states and turbulent states. When spatiotemporal chaos prevail and the effective number of degrees of\nfreedom is large, many familiar quantities in the study\nof dynamical systems and chaos become hard to evaluate. On the other hands, traditional statistical measures\nsuch as correlation length also become ineffective when\nthe pattern presents intermittent features. A new sound\nphenomenology is needed to capture subtle correlations\nacross multiple scales and multiple fluctuation intensities.\nWe present here a sound phenomenology, the HS\nmodel, that gives a concise description of a spatiotemporal field by its multifractal scaling properties in terms\nof the HS parameter β. In this work, we present detailed\nevidence, based on analyzing experimental BZ system\nand numerical CGL and mFN model, that the HS similarity holds for all the fields (ordered or disordered) and\nthe derived parameter β describes the strength of the correlation across scales and across intensities. For β close\nto one, the pattern is strongly correlated or ordered; a\nsmaller β implies a higher degree of heterogeneity and\na mixture of order and disorder; the smallest β is related to the intermittency associated with fully developed spatiotemporal chaos. In particular, our analysis\nhas identified two different disordered states in the BZ\nexperiment: the heterogeneous disordered state with a\nmixture of spirals and irregular spiral elements and the\ndisordered and intermittent state of fully developed spatiotemporal chaos. In those cases, β provides a useful\ncharacterization of the patterns in transition.\nBased on the above results, we speculate that the HS\nsimilarity is an emergent property of self-organized complex nonlinear multi-scale systems in general. This property, like the maximum entropy property of the thermal equilibrium state, may be difficult to be derived directly from the first principle (such as the Navier-Stokes\nequation for fluids or the Newtonian mechanical law for\ngases). It is thus important to conduct more empirical\nstudies for proving/disproving the above conjecture, or\nfor assessing its limit of validity.\nFor the quantitative analysis of spatiotemporal chaos,\nwe believe that it is important to go beyond the simple statistics for defects, wave numbers, or other local\npattern properties, since often they are hard to be de-\n\n\f10\ntermined when spatial patterns become overwhelmingly\nirregular. The HS analysis is a global method that takes\ninto account the properties of the whole field, but emphasizes at the same time subtle correlations and similarities among structures at multiple scales and multiple\nintensities. While the previous work [18, 19] establishes\nthe validity of the HS model for describing both experimental and numerical spiral patterns, the present work\ngives detailed evidence that the HS order parameter (β)\ncharacterizes the degree of heterogeneity and intermittency of spatial patterns and is particularly suitable for\ndescribing the evolution of patterns from ordered states\nto fully developed spatiotemporally chaotic states. This\nis demonstrated in the BZ, CGL and mFN systems. Our\napproach may be easily extended to describe other complex pattern-formation systems with different unit \"cells\"\nthan spirals, such as strips, hexagons, squares, triangles,\netc., and this is one of the advantages of the HS analysis.\nTo make a concise description for all these statistical\nproperties, a phenomenology is required. The HS analysis is one of the plausible phenomenological proposals\n\nthat rest on empirical observations (β-test). The fact\nthat the HS similarity is found to be valid for a wide\nclass of nonlinear processes indicates the possible universal mechanism/principle behind these processes. It is not\nyet clear how this universality should be expressed (e.g.\nin terms of a variational principle like the maximum entropy and minimum entropy production), but we believe\nthat it deserves special attention in future studies.\n\n[1] M. C. Cross and P. C. Hohenberg, Rev. Mod. Phys. 65,\n851 (1993).\n[2] S.W. Morris, E. Bodenschatz, D.S. Cannell, and G.\nAhlers Phys. Rev. Lett. 71, 2026 (1993);\n[3] M. Assenheimer and V. Steinberg, Nature 367, 345\n(1994).\n[4] L. Q. Zhou and Q. Ouyang, J. Phys. Chem. A 105, 112\n(2001)\n[5] A. T. Winfree, Science 266, 1003 (1994); F. X.\nWitkowski, L. J. Leon, P. A. Penkoske, W. R. Giles, M.\nL. Spanol, W. L. Ditto, and A. T. Winfree, Nature 392,\n78 (1998).\n[6] P. Coullet, L. Gil, and J. Lega, Phys. Rev. Lett. 62, 1619\n(1989).\n[7] I. S. Aranson and L. Kramer, Rev. Mod. Phys. 74, 99\n(2002).\n[8] M. C. Cross and P. C. Hohenberg, Science 263, 1569\n(1994).\n[9] Q. Ouyang and H. L. Swinney, Chaos 1, 411 (1991).\n[10] M. C. Cross and D. I. Meiron, Phys. Rev. Lett. 75, 2152\n(1995).\n[11] K. R. Elder, J. D. Gunton, and N. Goldenfeld, Phys. Rev.\nE 56, 1631 (1997); T. Galla and E. Moro, Phys. Rev. E\n67, 035101 (2003).\n[12] Structure factors were first used as a measure of the structure of local RB patterns in Ref. [2]. Detail comments on\nthe usage of structure factor can be found in Ref. [13].\nThis measure has also been used to measure the growth\nof pattern domains, as in Ref. [10] and L. Purvis and M.\nDennin, Phys. Rev. Lett. 86, 5898 (2001).\n[13] Y. Hu, R. Ecke, and G. Ahlers, Phys. Rev. E 51, 3263\n(1995); Y. Hu, R. E. Ecke, and G. Ahlers, Phys. Rev.\nLett. 74, 391 (1995); Phys. Rev. E 55, 6928 (1997).\n[14] G. H. Gunaratne, R. E. Jones, Q. Ouyang, and H. L.\nSwinney, Phys. Rev. Lett. 75, 3281 (1995); G. H. Gunaratne, D. K. Hoffman, and D. J. Kouri, Phys. Rev. E\n\n57, 5146 (1998); G. H. Gunaratne, A. Ratnaweera, and\nK. Tennekone, Phys. Rev. E 59, 5058 (1999);\nThe disorder function calculates the local curvature of\ncontour lines and local characteristic wavenumber for\npatterns of local stripped structures. For more complicated patterns, the calculation of the disorder function is\ndifficult. Detail comments can be seen in Ref. [14].\nD. A. Egolf, I. V. Melnikov, and E. Bodenschatz, Phys.\nRev. Lett. 80, 3228 (1998).\nC. Bowman and A. C. Newell, Rev. Mod. Phys. 70, 289\n(1998).\nH. Y. Guo, L. Li, Q. Ouyang, J. Liu, and Z.-S. She, J.\nChem. Phys. 118, 5038 (2003).\nJ. Liu, Z.-S. She, Q. Ouyang, and X. T. He, Inter. J.\nMod. Phys. B 17, 4139 (2003).\nZ.-S. She and E. Leveque, Phys. Rev. Lett. 72, 336\n(1994); Z.-S. She and E. C. Waymire, Phys. Rev. Lett.\n74, 262 (1995).\nZ.-S. She, Prog. Theor. Phys. Supp. 130, 87 (1998).\nE. S. C. Ching, Acta Mech. Sinica 19, 385 (2003); E. S.\nC. Ching, C. K. Leung, X. L. Qiu, and P. Tong, Phys.\nRev. E 68, 026307, (2003); E. S. C. Ching and C. Y.\nKwok, Phys. Rev. E 62, R7587 (2000).\nZ.-S. She, K. Ren, G. S. Lewis, and H. L. Swinney, Phys.\nRev. E. 64, 016308 (2001).\nC. Baroud, B. Plapp, H. Swinney, and Z.-S. She, Phys.\nFluids, 15, 2091 (2003).\nZ.-S. She, Z. T. Fu, J. Chen, S. Liang, and S. D. Liu,\nProg. in Natural Sci. 12(10), 747-752 (2002)\nJ. Wang, Q. D. Zhang, K. Ren, and Z.-S. She, Chinese\nSci. Bull. 46(23), 1988-1992 (2001).\nD. Queiros-Conde, Phys. Rev. Lett. 78, 4426 (1997).\nA. Turiel, G. Mato, N. Parga, and J.-P. Nadal, Phys.\nRev. Lett. 80, 1098 (1998).\nG. Ruiz Chavarria, C. Baudet, and S. Ciliberto, Physica\nD 99, 369 (1996); E. Leveque, G. Ruiz-Chavarria, C.\n\nAcknowledgments\n\nWe thank both anonymous referees for their helpful\ncomments. We have benefited from the research environment at the LTCS of Peking University. The computation work is helped by the Turbulence Simulation\nCenter of the LTCS. We acknowledge the support by\nthe National Natural Science Foundation of China, No.\n10225210, and by the State Key Project for Basic Research No. 2000077305.\n\n[15]\n\n[16]\n[17]\n[18]\n[19]\n[20]\n\n[21]\n[22]\n\n[23]\n[24]\n[25]\n[26]\n[27]\n[28]\n[29]\n\n\f11\nBaudet, and S. Ciliberto, Phys. Fluids 11, 1869 (1999).\n[30] M. Bär and M. Eiswirth, Phys. Rev. E 48, 1635 (1993);\n[31] D. Barkley, M. Kness and L. S. Tuckerman, Phys. Rev.\nA 42, 2489 (1990); D. Barkley, Physica D 49, 61 (1991);\nPhys. Rev. Lett. 68, 2090 (1992); Phys. Rev. Lett. 72,\n164 (1994).\n\n[32] Q. Ouyang, H. L. Swinney, and G. Li, Phys. Rev. Lett.\n84, 1047 (2000).\n[33] K. R. Sreenivasan, Ann. Rev. Fluid Mech. 23, 539 (1991).\n[34] Z.-S. She and L. Liu, Acta Mech. Sinica, 19, 453 (2003);\nL. Liu and Z.-S. She, Fluid Dyn. Res., 33, 261 (2003).\n\n\f"}