{"id": "http://arxiv.org/abs/nlin/0106030v1", "guidislink": true, "updated": "2001-06-20T09:45:39Z", "updated_parsed": [2001, 6, 20, 9, 45, 39, 2, 171, 0], "published": "2001-06-20T09:45:39Z", "published_parsed": [2001, 6, 20, 9, 45, 39, 2, 171, 0], "title": "Perron-Frobenius spectrum for random maps and its approximation", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=nlin%2F0208048%2Cnlin%2F0208025%2Cnlin%2F0208010%2Cnlin%2F0208042%2Cnlin%2F0208033%2Cnlin%2F0208034%2Cnlin%2F0208045%2Cnlin%2F0208028%2Cnlin%2F0208032%2Cnlin%2F0208015%2Cnlin%2F0208004%2Cnlin%2F0208023%2Cnlin%2F0208005%2Cnlin%2F0208019%2Cnlin%2F0208031%2Cnlin%2F0208049%2Cnlin%2F0208011%2Cnlin%2F0208027%2Cnlin%2F0208044%2Cnlin%2F0208021%2Cnlin%2F0208002%2Cnlin%2F0208046%2Cnlin%2F0208037%2Cnlin%2F0208013%2Cnlin%2F0106035%2Cnlin%2F0106006%2Cnlin%2F0106036%2Cnlin%2F0106025%2Cnlin%2F0106019%2Cnlin%2F0106030%2Cnlin%2F0106017%2Cnlin%2F0106028%2Cnlin%2F0106045%2Cnlin%2F0106015%2Cnlin%2F0106042%2Cnlin%2F0106029%2Cnlin%2F0106002%2Cnlin%2F0106021%2Cnlin%2F0106024%2Cnlin%2F0106010%2Cnlin%2F0106009%2Cnlin%2F0106001%2Cnlin%2F0106038%2Cnlin%2F0106032%2Cnlin%2F0106040%2Cnlin%2F0106016%2Cnlin%2F0106034%2Cnlin%2F0106008%2Cnlin%2F0106011%2Cnlin%2F0106046%2Cnlin%2F0106026%2Cnlin%2F0106020%2Cnlin%2F0106014%2Cnlin%2F0106044%2Cnlin%2F0106013%2Cnlin%2F0106005%2Cnlin%2F0106004%2Cnlin%2F0106003%2Cnlin%2F0106018%2Cnlin%2F0106033%2Cnlin%2F0106023%2Cnlin%2F0106031%2Cnlin%2F0106027%2Cnlin%2F0106039%2Cnlin%2F0106041%2Cnlin%2F0106037%2Cnlin%2F0106012%2Cnlin%2F0106007%2Cnlin%2F0106043%2Cnlin%2F0106022%2Cnlin%2F0003009%2Cnlin%2F0003061%2Cnlin%2F0003038%2Cnlin%2F0003005%2Cnlin%2F0003056%2Cnlin%2F0003013%2Cnlin%2F0003031%2Cnlin%2F0003035%2Cnlin%2F0003003%2Cnlin%2F0003023%2Cnlin%2F0003049%2Cnlin%2F0003043%2Cnlin%2F0003010%2Cnlin%2F0003046%2Cnlin%2F0003006%2Cnlin%2F0003017%2Cnlin%2F0003040%2Cnlin%2F0003028%2Cnlin%2F0003022%2Cnlin%2F0003036%2Cnlin%2F0003001%2Cnlin%2F0003048%2Cnlin%2F0003019%2Cnlin%2F0003051%2Cnlin%2F0003058%2Cnlin%2F0003027%2Cnlin%2F0003068%2Cnlin%2F0003042%2Cnlin%2F0003037%2Cnlin%2F0003054%2Cnlin%2F0003045&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Perron-Frobenius spectrum for random maps and its approximation"}, "summary": "To study the convergence to equilibrium in random maps we developed the\nspectral theory of the corresponding transfer (Perron-Frobenius) operators\nacting in a certain Banach space of generalized functions. The random maps\nunder study in a sense fill the gap between expanding and hyperbolic systems\nsince among their (deterministic) components there are both expanding and\ncontracting ones. We prove stochastic stability of the Perron-Frobenius\nspectrum and developed its finite rank operator approximations by means of a\n``stochastically smoothed'' Ulam approximation scheme. A counterexample to the\noriginal Ulam conjecture about the approximation of the SBR measure and the\ndiscussion of the instability of spectral approximations by means of the\noriginal Ulam scheme are presented as well.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=nlin%2F0208048%2Cnlin%2F0208025%2Cnlin%2F0208010%2Cnlin%2F0208042%2Cnlin%2F0208033%2Cnlin%2F0208034%2Cnlin%2F0208045%2Cnlin%2F0208028%2Cnlin%2F0208032%2Cnlin%2F0208015%2Cnlin%2F0208004%2Cnlin%2F0208023%2Cnlin%2F0208005%2Cnlin%2F0208019%2Cnlin%2F0208031%2Cnlin%2F0208049%2Cnlin%2F0208011%2Cnlin%2F0208027%2Cnlin%2F0208044%2Cnlin%2F0208021%2Cnlin%2F0208002%2Cnlin%2F0208046%2Cnlin%2F0208037%2Cnlin%2F0208013%2Cnlin%2F0106035%2Cnlin%2F0106006%2Cnlin%2F0106036%2Cnlin%2F0106025%2Cnlin%2F0106019%2Cnlin%2F0106030%2Cnlin%2F0106017%2Cnlin%2F0106028%2Cnlin%2F0106045%2Cnlin%2F0106015%2Cnlin%2F0106042%2Cnlin%2F0106029%2Cnlin%2F0106002%2Cnlin%2F0106021%2Cnlin%2F0106024%2Cnlin%2F0106010%2Cnlin%2F0106009%2Cnlin%2F0106001%2Cnlin%2F0106038%2Cnlin%2F0106032%2Cnlin%2F0106040%2Cnlin%2F0106016%2Cnlin%2F0106034%2Cnlin%2F0106008%2Cnlin%2F0106011%2Cnlin%2F0106046%2Cnlin%2F0106026%2Cnlin%2F0106020%2Cnlin%2F0106014%2Cnlin%2F0106044%2Cnlin%2F0106013%2Cnlin%2F0106005%2Cnlin%2F0106004%2Cnlin%2F0106003%2Cnlin%2F0106018%2Cnlin%2F0106033%2Cnlin%2F0106023%2Cnlin%2F0106031%2Cnlin%2F0106027%2Cnlin%2F0106039%2Cnlin%2F0106041%2Cnlin%2F0106037%2Cnlin%2F0106012%2Cnlin%2F0106007%2Cnlin%2F0106043%2Cnlin%2F0106022%2Cnlin%2F0003009%2Cnlin%2F0003061%2Cnlin%2F0003038%2Cnlin%2F0003005%2Cnlin%2F0003056%2Cnlin%2F0003013%2Cnlin%2F0003031%2Cnlin%2F0003035%2Cnlin%2F0003003%2Cnlin%2F0003023%2Cnlin%2F0003049%2Cnlin%2F0003043%2Cnlin%2F0003010%2Cnlin%2F0003046%2Cnlin%2F0003006%2Cnlin%2F0003017%2Cnlin%2F0003040%2Cnlin%2F0003028%2Cnlin%2F0003022%2Cnlin%2F0003036%2Cnlin%2F0003001%2Cnlin%2F0003048%2Cnlin%2F0003019%2Cnlin%2F0003051%2Cnlin%2F0003058%2Cnlin%2F0003027%2Cnlin%2F0003068%2Cnlin%2F0003042%2Cnlin%2F0003037%2Cnlin%2F0003054%2Cnlin%2F0003045&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "To study the convergence to equilibrium in random maps we developed the\nspectral theory of the corresponding transfer (Perron-Frobenius) operators\nacting in a certain Banach space of generalized functions. The random maps\nunder study in a sense fill the gap between expanding and hyperbolic systems\nsince among their (deterministic) components there are both expanding and\ncontracting ones. We prove stochastic stability of the Perron-Frobenius\nspectrum and developed its finite rank operator approximations by means of a\n``stochastically smoothed'' Ulam approximation scheme. A counterexample to the\noriginal Ulam conjecture about the approximation of the SBR measure and the\ndiscussion of the instability of spectral approximations by means of the\noriginal Ulam scheme are presented as well."}, "authors": ["Michael Blank"], "author_detail": {"name": "Michael Blank"}, "author": "Michael Blank", "arxiv_comment": "24 pages, LaTeX", "links": [{"href": "http://arxiv.org/abs/nlin/0106030v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/nlin/0106030v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "nlin.CD", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "nlin.CD", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.DS", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/nlin/0106030v1", "affiliation": "Russian Academy of Sci., Russia", "arxiv_url": "http://arxiv.org/abs/nlin/0106030v1", "journal_reference": null, "doi": null, "fulltext": "arXiv:nlin/0106030v1 [nlin.CD] 20 Jun 2001\n\nPerron-Frobenius spectrum for random maps\nand its approximation\nMichael Blank∗\nApril 20, 2001\nAbstract. To study the convergence to equilibrium in random maps we developed the spectral\ntheory of the corresponding transfer (Perron-Frobenius) operators acting in a certain Banach space\nof generalized functions. The random maps under study in a sense fill the gap between expanding\nand hyperbolic systems since among their (deterministic) components there are both expanding and\ncontracting ones. We prove stochastic stability of the Perron-Frobenius spectrum and developed its\nfinite rank operator approximations by means of a \"stochastically smoothed\" Ulam approximation\nscheme. A counterexample to the original Ulam conjecture about the approximation of the SBR\nmeasure and the discussion of the instability of spectral approximations by means of the original\nUlam scheme are presented as well.\n\n1\n\nIntroduction\n\nLet {Ti } be a collection of nonsingular maps from a d-dimensional smooth manifold XP\ninto itself\nwith a metrics ρ on it, and let {pi } be a collection of nonnegative integers, such that i pi = 1.\nA random dynamical system on the space X is a stationary stochastic process T1 , T2 , * * * : X → X\n(i.e., with values in a space of maps), see for instance [17]. There are several approaches in further\ndetalization of this object and in the sequel we shall use the following Markov one.\nBy a random map T we shall mean the Markov\nrandom process on X given by the following\nP\nfamily of transition probabilities P(x, A) := i pi 1T −1 (A) (x) from a point x ∈ X to a subset A ⊆\ni\nX. In other words, on every time step the map Ti is chosen from the collection {Ti } independently\nfrom the previous choices with the probability given by the distribution {pi }.\nIn the literature (especially physical) the above defined random map is often called by the\niterated function system (with probabilities). Naturally, a pure deterministic setup was studied as\nwell. This can be done as follows. According to the given collection of maps {Ti } one can define\na new multivalued map T̃ : X → X as T̃ x := ∪i Ti x. Assuming that the maps Ti are continuous\nand strictly contracting one can show [13] that the multivalued map T̃ possesses a global attractor\nXT̃ ⊂ X, namely the Hausdorff distance between the sets T̃ n Y and XT̃ decreases exponentially\nfast for any closed nonempty set Y ⊂ X.\nIt is worth note that our aim in this paper is not to study the most general setup (for example,\none can consider an infinite (continual) collection of maps {Ti }, while the distribution {pi } might\nbe place dependent (on the space variable), but rather to give a deeper analysis of dynamical and\nstatistical properties of these systems related to the convergence to equilibrium, i.e. on spectral\nproblems of the corresponding transfer operators practically not studied in the literature (except\n[1]). Therefore we shall not consider well studied problems of the dimensional analysis of invariant\nsets and measures. The reader can find results and further references of this type, e.g. in [9].\nOne can always realize the random map under study as a deterministic one on the extended\nphase space. Denote by Ω̄ the space of one-side sequences ω̄ := {ω1 , ω2 , . . .} ∈ Ω̄, where each ωi\nbelongs to the set of indices of the collection Ti . On the space Ω̄ one defines the left-shift map\nσ : Ω̄ → Ω̄ according to the rule (σ ω̄)i := ωi+1 . The topology in the space Ω̄ is defined as the\ndirect product of discrete topologies, acting on the set of indices, and a Borel measure μp on Ω̄\nis defined as the product of distributions {pi } on the set of indices. Naturally there exists an\n∗ Russian\n\nAcademy of Sciences, Inst. for Information Transmission Problems, B. Karetnij 19, 101447, Moscow,\nRussia, and Observatoire de la Cote d'Azur, BP 4229, F-06304 Nice Cedex 4, France; e-mail: blank@obs-nice.fr\n\n\fone-to-one correspondence between the sequences of maps Ti and the elements of the space Ω̄. On\nthe extended space Ω̄ × X one can define a new map – a skew product upon the left-shift map:\nT̃ (ω̄, x) := (σ ω̄, Tω1 x).\nLet us give a few simple examples of random maps, demonstrating that even in the simplest\ncases the dynamics of random maps might be rather nontrivial. For the sake of simplicity in all our\nexamples both here and in the sequel the collection of maps will consist of only two maps T1 , T2\nfrom the unit interval into itself and thus the corresponding distribution is described by the one\nparameter p := p1 .\nExample 1.1 Pure contractive maps: T1 (x) := x/2, T2 (x) := x/2 + 1/2.\nAccording to [13] (see also the next section) for each value of the parameter 0 < p < 1 the\ncorresponding random map T has the unique invariant measure, whose support typically (when\np 6= 1/2) is a Cantor set.\nExample 1.2 A mixed case: T1 (x) := 1 − |2x − 1|, T2 (x) := x/2.\nIn distinction to the previous example, depending on the choice of the parameter p the properties\nof the random map T differ qualitatively. Namely for 0 ≤ p < 12 the random map possesses\nthe unique invariant measure concentrated at 0. For p > 12 the invariant measure becomes non\nunique but there exists a unique absolutely continuous invariant one, whose density hT is such\nthat hT |Ik = γk for any k = 1, 2, . . . and intervals Ik := (2−(k−1) , 2−k ]. However the constants γk\nare bounded on k while 2/3 < p < 1/2 and go to infinity with k for 0 ≤ p < 2/3.\nThe above examples are typical for statistical problems related to random maps and in the next\nsection we shall discuss separately properties of random maps expanding on average and contracting\non average and thus we postpone the proof of the above claims till all needed technicalities will be\nintroduced. It is worth note that our results related to the expanding on average random maps are\nvery similar to those known for deterministic piecewise expanding maps [1] (see also results about\nthe convergence to the Sinai-Bowen-Ruelle (SBR ) measure for multidimensional expanding on\naverage random maps in [16, 6]). Therefore in the corresponding sections we mainly demonstrate\nthe similarities between these two types of systems. On the other hand, spectral analysis of the\ncontracting on average random maps is completely new. In fact our interest in this type of systems\nis due to the analysis of spectral properties of Anosov maps in [4], where the presence of stable\nfoliations relates the situation to our case. Some of the methods and ideas used in this paper\nwere originated from the construction in [4] needed to study the behavior of the transfer operators\n'along the stable foliation' and are based technically on the establishing of the so called LasotaYorke type inequalities. The nature of the system under study gives some advantages compare to\nthe Anosov maps, in particular, the functional Banach spaces in our case do not depend on the\nfinite structure of the map, the spectrum stability results are proven for a much broader class of\nrandom perturbations, and a more direct approximation scheme is elaborated.\nThe paper is organized as follows. In the following two sections (2 and 3) we introduce the\nnotions of contractive and expanding on average random maps and discuss some of their basic\nproperties slightly generalizing known results about them. The main results of the paper are\ndescribed in section 4, where we construct and study the Perron-Frobenius spectrum for random\nmaps. We prove also stochastic stability of isolated eigenvalues in this spectrum and construct by\nmeans of a special random smoothing two schemes of their finite rank operator approximation. To\nsome extent these schemes generalize the well known Ulam approximation scheme [22] (see also\ndiscussion of its realization in [1, 7, 11, 18]). We discuss in detail why the spectrum approximation\nby means of the original Ulam scheme is not stable in the case of random maps (see also [1, 4]).\nSince the original Ulam conjecture about the approximation of the SBR measure (the leading\nelement of the spectrum) still holds in our setting, in Lemma 4.13 we construct the first (to the\nbest of our knowledge) counterexample to this conjecture. Note however that the map in this\ncounterexample is not only discontinuous, but the discontinuity occurs in a periodic turning point\n(compare to instability results for general random perturbations in [1]).\n\n\f2\n\nContracting on average random maps\n\nAn important and well known case of random maps corresponds to the situation when all the maps\nTi are continuous and their contracting constants\nΛTi := sup\n\nx,y∈X\n\n|T (x) − T (y)|\n≤ Λ < 1.\nρ(x, y)\n\nOnly the list of literature dedicated to various theoretical and applied aspects of the theory of this\nclass of random maps would fill several pages, therefore we only give a reference to one of the first\n(and giving a very essential contribution) works in this field – [13], to the monograph [9], and to\none of the recent publications [10], where the reader can find more references to recent results.\nNote that these papers are dedicated mainly to questions related to dimensional and multifractal\nproperties of invariant sets and measures which we shall not touch in this work.\nWe start the analysis of ergodic properties of these systems using a weaker assumption, namely\nthat the random map T is contracting on average.\nDefinition 2.1 We shall say that the random map T is contracting on average if its contracting\nconstant\nX\npi ΛTi < 1.\nΛT :=\ni\n\nLet M be the space of probability measures on X. Then the Markov operator associated with\nthe random map T for each probabilistic measure μ ∈ M can be written as\nX\npi μ ◦ Ti−1 .\nT μ :=\ni\n\nFollowing the standard scenario we introduce in the space M the special metrics (often called\nHutchinson metrics) [13]:\n\u001aZ\n\u001b\nZ\n0\nρH (μ, ν) := sup\nh dμ − h dν, h ∈ C (X, IR), |h(x) − h(y)| ≤ ρ(x − y), ∀x, y ∈ X ,\nwhere ρ is the metrics on our original phase space X. It is well known (see, for example, [13]) that\nthe pair (M, ρH ) defines a compact metric space.\nLemma 2.1 Let h : X → IR be a continuous function and let μ ∈ M. Then\nZ\nX Z\nh d(T μ) =\npi h ◦ Ti dμ.\ni\n\nProof. For each continuous function h : X → IR there is a sequence of piecewise constant\napproximating functions hn converging uniformly on X. Therefore\nZ\nX Z\npi hn d(μ ◦ Ti−1 )\nhn d(T μ) =\ni\n\n=\n\nX\ni\n\npi\n\nZ\n\nTi X\n\nhn d(μ ◦ Ti−1 ) =\n\nX\ni\n\npi\n\nZ\n\nhn ◦ Ti dμ.\n\nR\nR\nOn the other hand, hn d(T μ) → h d(T μ) as n → ∞, while for each pair i, n the function hn ◦ Ti\nis piecewise constant. Thus the sequence of functions {hn ◦ Ti }n converges uniformly on n to a\nfunction h ◦ Ti which yields the convergence\nX Z\nX Z\npi h ◦ Ti dμ.\npi hn ◦ Ti dμ →\ni\n\ni\n\nThe following result is a simple generalization of the well known Hutchinson Theorem [13].\n\n\fLemma 2.2 ρH (T μ, T ν) ≤ ΛT * ρH (μ, ν) for any measures μ, ν ∈ M. In particular contraction\non average yields the strict ergodicity of the random map T .\nProof. Introduce the notation\n\b\nH := h ∈ C0 (X, IR), |h(x) − h(y)| ≤ ρ(x, y), ∀x, y ∈ X .\nThen\n\nρ(T μ, T ν) = sup\n= sup\nConsider a function h̃ :=\n\n1\nΛT\n\nP\n\n\u001aZ\n\n(\n\nh d(T μ) −\n\nX\ni\n\npi\n\nZ\n\nZ\n\nh d(T ν), h ∈ H\n\nh ◦ Ti dμ −\n\nX\ni\n\npi\n\nZ\n\n\u001b\n\n)\n\nh ◦ Ti dν, h ∈ H .\n\npi h ◦ Ti . For each pair of points x, y ∈ X we have\n\ni\n\n1 X\npi |h ◦ Ti (x) − h ◦ Ti (y)|\nΛT i\n1 X\n1 X\npi ρ(Ti (x), Ti (y)) ≤\npi ΛTi * ρ(x, y) = ρ(x, y).\n≤\nΛT i\nΛT i\n\n|h̃(x) − h̃(y)| ≤\n\nHence h̃ ∈ H. Introducing another set of functions\n(\n\n1 X\npi h ◦ T i\nh̃ ∈ H : ∃h ∈ H : h̃ =\nΛT i\n\nH̃ :=\n\n)\n\n,\n\nwe can rewrite the distance between the images of the measures as follows\n\u001b\n\u001a\nZ\nZ\n1\n1\nρH (T μ, T ν) = sup\nh̃ dμ −\nh̃ dν : h̃ ∈ H̃ .\nΛT\nΛT\nNow, since H̃ ⊂ H, we come to the desired estimate\nρH (T μ, T ν) ≤ ΛT * ρH (μ, ν),\nand thus the contraction on average yields the uniform contraction in the space of measures.\nNote that the example 1.1 satisfies the conditions of Lemma 2.2, while for the example 1.2 the\nconditions of Lemma 2.2 hold only when 0 < p < 1/3. Indeed,\nX\ni\n\n3\n1\n1\npi Λi = 2p + (1 − p) = p + < 1.\n2\n2\n2\n\nOn the first sight it seems that the continuity of the maps Ti was not used in the proof, however\nit plays a very important role in it. One can easily construct an example when the absence of this\nproperty leads to the nonuniqueness of the invariant measure.\nExample 2.3 T1 (x) :=\n\nx\n2\n\n1[0,1/2] (x) + x+1\n2 1(1/2,1] (x), T2 (x) := x.\n\nFor each p ∈ (0, 1) the random map corresponding to example 2.3 possesses exactly two ergodic\ninvariant measures concentrated at points 0 and 1 respectively.\nThe contraction on average, that we assume in this section, does not prevent some of the maps\nTi to be expanding. Therefore, despite the fact that some of the maps Ti may possess several (not\nnecessary a finite number) ergodic invariant measures, the random map T under the assumptions\nof Lemma 2.2 is strictly ergodic.\n\n\f3\n\nExpanding on average random maps\n\nResults obtained in the previous section are based technically on the contraction on average property. Now we are going to show that the opposite assumption about the expansion on average leads\nto the ideologically close result – the existence of the absolutely continuous invariant measure.\nFor the sake of simplicity we shall restrict ourselves here to the analysis of piecewise C 2 -smooth\nmaps of the unit interval [0, 1] into itself with nondegenerate expanding constants\nλTi := inf |Ti′ (x)| ≥ λ > 0.\nx\n\nIt is straightforward to show that the transfer operator corresponding to the random map T in the\nspace L1 can be written as\nX\npi Pi ,\nPT :=\ni\n\nwhere Pi is the Perron-Frobenius operator, corresponding to the map Ti and describing the dynamics of densities of measures under its action (see a detailed discussion of properties of these\noperators for example in [1]).\nDenoting by Ω the set of values of the index i, we consider for a given number Λ the sequence\nof sets\nn\nΩ(n) (Λ) := {ω ∈ Ω : |(T ω x)′ | > Λn for a.a. x ∈ X},\nwhere\n\nn\n\nT ω x := Tωn ◦ Tωn−1 ◦ . . . ◦ Tω1 x\nis the n-th point of a realization of a trajectory of the random map T starting from the point x,\nand introduce the following regularity assumption: there exist two constants Λ > 1 and C < ∞\nsuch that\n√\n(3.1)\nP{Ω(n) (Λ)} ≥ 1 − Ce− n\nfor each positive integer n.\nDenote by var(*) the standard one-dimensional variation o a function and by BV the space of\nfunctions of bounded variation equipped with the norm || * ||BV := var(*) + || * ||L1 .\nThe following result gives the decomposition for the transfer operator under the considered\nassumptions.\nTheorem 3.1 [19, 1] Let the regularity assumption (3.1) holds. Then for each pair of positive\nintegers n, k the following decomposition takes place for the random map T :\nPnT = Pn,k + Qn,k ,\nand\n\u0001\nvar(Pn,k h) ≤ Const αn var(h) + β k ||h|| ,\n√\n√\n||Qn,k h|| < Const ke− k ||h||,\n\n(3.2)\n(3.3)\n\nfor each function h ∈ BV and 0 < α < 1 < β < ∞. All constants above depend on the choice of\nthe map Ti , but do not depend on n and k.\nOne can find in the literature dedicated to the question of the existence of absolutely continuous\ninvariant measures in our setting two types of sufficient conditions for this existence. The first of\nthese conditions obtained in [21] corresponds to the strong expansion on average\nX pi\n< 1,\nλTi\n\n(3.4)\n\ni\n\nwhile the second, described in [19], is a weaker condition:\nY p\nλTii > 1.\ni\n\n(3.5)\n\n\fOne can easily show that the first of these assumption yields the second one. On the other hand,\nas we shall show there is an important difference between properties of invariant measures and\nrespectively random maps under these assumptions. To explain the difference let us return to our\nregularity assumption and show that it is even more general with respect the inequality (3.5). For\nthis purpose we shall need the following simple technical estimate.\nLemma 3.1 Let {ξi }i be a sequence of independent identically distributed\n(iid) random variables\n\u0002 \u0003\nhaving exponential moments up to some positive order s0 , i.e. E esξ < ∞ for all 0 < s < s0 .\nThen for each number R > E [ξi ] there are constants a < 1, A < ∞ such that\nn\n\nP{\n\n1X\nξi > R} < Aan\nn i=1\n\nfor each positive n.\nProof. By the exponential Chebyshev inequality\nn\n\nP{\n\n\u0002 \u0003\n1X\nξi > R} ≤ e−sR E esξ\nn i=1\n\nfor each positive number s. For our purpose it is enough to show that the right hand side of this\ninequality decreases exponentially fast. Note that for each number x the following inequality holds\n|ex − 1 − x| ≤ e|x| − 1 − |x|.\nIndeed, this is trivial for x ≥ 0 (since ex ≥ +x and e−x ≤ ex ), while for x < 0 we have ex ≤ +x.\nThus the inequality can be reduced to\n−ex + 1 + x ≤ e−x − 1 + x\n\nor\n\ne−x + ex ≥ 2,\n\nwhich is evidently correct. Therefore\n|esξ − 1 − sξ| ≤ e|sξ| − 1 − |sξ|.\nAssume first, that the values ξi are bounded from below. Then\ni\nh\nE e|sξ| − 1 − E [|sξ|] < ∞\n\nfor |s| < s0 , which yields the negativity of the left hand side of the previous inequality. Therefore\nthere are such positive constants s ∈ (0, s̃0 ) and C that\n\u0002 \u0003\n2\nE esξ ≤ 1 + E [ξ] + Cs2 ≤ esE[ξ]+Cs\nThus, setting\n\ns = (R − E [ξ])/(2C),\n\na = e−(R−E[ξ]\n\n2\n\n)/(4C))\n\n,\n\nwe get the desired estimate. Observe that s < s̃0 by the consruction. Therefore our inequalities\nmake sense only if\nR ≤ R0 := E [ξ] + 2C s̃0 .\nThis means that larger values of R should be changed to R0 . To finish the proof note that if the\nrandom values ξi are not bounded from below it is enough to 'cut' them from below by means of\nsome constant and to apply the above argument to the result.\n\nLemma 3.2 The inequality (3.5) implies the regularity assumption (3.1).\nProof. It is enough to apply Lemma 3.1 to the sequence of iid random values ξi := ln λTi .\nOn the other hand, the following result shows that the opposite statement does not hold.\n\n\f3\n4\n2\n3\n\n✁✁\n✁✁\n✁✁\n✁✁\n✁✁\n❆\n✁\n❆\n✁\n❆\n✁✁\n❆❆\nT\n✁✁\n❆❆ 1\n✁✁\n❆❆\n✁✁\n❆❆\n✁✁\n❆❆❆\nT2 ❆ ◗\n✁✁\n❆ ◗\n✁✁\n◗ ◗\n◗ ◗✁✁\n✁\n◗◗\n✁\n✁\n1\n4\n\n1\n2\n\nFigure 1:\nExample when the regularity condition holds while the condition (3.5) breaks down\nExample 3.3\n3\nif 0 ≤ x < 41\n 4 − 2x,\n1\n2\nT1 (x) := 4 − 3 x,\nif 41 ≤ x < 12\n\n2 − 2x (mod 1) , otherwise,\n\nwhile T2 (x) := T1 (x) + 1/12 (mod 1) . Graphs of these maps are shown on Fig. 1.\nLemma 3.4 The random map T in the example 3.3 for any 0 < p < 1 satisfies the regularity\nassumption, while the condition (3.5) breaks down. It is interesting that in this example the stronger\n2\nassumption (3.4) holds for the second iterate T .\nProof. Both maps Ti are piecewise linear and the moduli of their derivatives take only two\nvalues 2 (on the intervals (0, 14 ) and ( 21 , 1)) and 23 (on the interval ( 21 , 1)). Since both these maps\ntransform the interval ( 41 , 12 ) into (0, 41 ) and on the remaining interval ( 12 , 1) the derivatives of both\nmaps is equal to 2, it follows that for any i, j ∈ {1, 2} the inequality\n|(Ti Tj x)′ | ≥ 2 *\n\n4\n2\n= >1\n3\n3\n\nholds. Thus we have checked the regularity assumption. Now observe that the derivatives of both\nmaps is strictly less than 1 on the interval x ∈ ( 14 , 21 ), which contradicts to the condition (3.5).\n2\n\nIt remains to check the condition (3.4) for the second iterate T , which turns out to be a\nconsequence of the fact that expanding constants for the maps (Ti Tj x) are not less than 43 > 1\n(according to the inequality above).\nNote that since the right hand side of the inequality (3.2) contains the term β k with β > 1 the\nTheorem 3.1 guarantees only estimates of the type\nvar(Pn,k h) ≤ Const\n\nβk\n,\n1−α\n\nwhich means that despite the fact that the density of the invariant measure is integrable, it might\nbe not a function of bounded variation. In fact, the example 2 from Section 1 demonstrate this\nphenomenon when the parameter p belongs to ( 21 , 32 ). Moreover, in this example the density not\nonly not a function of bounded variation, but it goes to infinity in the vicinity of the origin.\nIt turns out that under a stronger assumption (3.4) the standard Lasota-Yorke inequality is\nvalid for the random map and thus the invariant density is a function of bounded variation.\nTheorem 3.2 [21] Let for a.a. x ∈ [0, 1] the inequality\nX pi\n≤γ<1\n|Ti′ (x)|\n\n\fholds. Then there are constants C, β < ∞ such that for each n ∈ ZZ+ and a function h ∈ BV the\nLasota-Yorke inequality holds:\nvar(PnT h) ≤ Cγ n var(h) + β||h||,\n\n(3.6)\n\nfrom where (as usual) it follows that for each nonnegative function h ∈ L1 with ||h|| = 1 the limit\nn−1\n1X k\nPT h =: hT ,\nn→∞ n\n\nlim\n\nk=0\n\nexists and\nPT hT = hT ,\n\nvar(hT ) ≤ Const ,\n\nwhile which respect to the absolutely continuous invariant measure μT with the density hT the\ncorrelations decay exponentially.\nNow we are able to finish the analysis of the example 2 from Section 1. Observe that for p >\nwe have\n\u0012 \u00131−p\nY p\n1\nλTkk = 2p *\n= 22p−1 > 1,\n2\n\n1\n2\n\nk\n\nwhich yields the condition (3.5) and, hence, our regularity assumption. Therefore for p > 1/2\nthere exists an absolutely continuous T -invariant measure. On the other hand, for 23 < p < 1 the\ncondition (3.4):\nX pk\np\n3\n= + 2(1 − p) = 2 − p < 1\n′\n|Tk (x)|\n2\n2\nk\n\nholds for a.a. x ∈ [0, 1]. Thus we can apply Theorem 3.2, whereis the boundedness of the density\nof the invariant measures follows.\n\n4\n\nPerron-Frobenius spectrum (PF-spectrum)\n\nIn the previous sections we have restricted the analysis of statistical features of random maps to the\nproperties of their invariant measures and more specifically Sinai-Bowen-Ruelle (SBR measures).\nFrom a more general point of view the SBR measure is the eigenfunction of the Perron-Frobenius\n(transfer) operator of our random map in a suitable Banach space corresponding to the leading\neigenvalue (1). Therefore it is very natural to extend the analysis of the dynamics to the complete\nspectrum of this operator.\nIt is worth note that the interest to the PF-spectrum is based to a large extent on the fact\nthat the subleading elements of the spectrum define the rate of mixing (convergence to the SBR\nmeasure, correlation decay, etc.).\n\n4.1\n\nDefinition of the PF-spectrum\n\nLet us start with the short description of objects related to the notion of the spectrum which\nwe shall need further. Let P : B → B be a bounded linear operator in a complex Banach space\n(B, ||*||B ). As usual we denote by spB (P) its spectrum, which is defined as a complement to the\nset of regular elements, i.e. to the points z ∈ C such that the resolvent (zI − P)−1 of the operator\nis defined in the entire space and hence is bounded. The maximal (on modulus) element of the\nspectrum is called the spectral radius:\nρB (P) := sup{|z| : z ∈ spB (P)}.\nAs it is well known [8] the spectral radius can be calculated by the following formula:\n1/n\n\nρB (P) = lim ||Pn ||B .\nn→∞\n\nBrowder [5] introduced the notion of essential spectrum ess spB (P) of a bounded linear operator\nP as a union of the elements of the spectrum z ∈ spB (P) such that at least one of the following\nproperties holds:\n\n\f1. The region of values of the operator zI − P is not bounded in B.\n2. ∪n≥0 ker((zI − P)n ) is infinite dimensional.\n3. z is a limit point of the spectrum spB (P).\nOutside of the essential spectrum only a countable number of isolated eigenvalues of the operator\nP may occur. Naturally the essential spectral radius ρB,ess (P) of the operator P is defined as the\nminimal nonnegative number such that all elements of the spectrum spB (P) outside of the disc\n{z ∈ C : |z| ≤ ρB,ess (P)} are isolated eigenvalues of finite multiplicity. It turns out [20] that the\nessential spectral radius can be calculated by a formula similar to the one for the usual spectral\nradius:\n1/n\n(4.1)\nρB,ess (P) = lim ||Pn ||B,ess ,\nn→∞\n\nbut for the specialized seminorm:\n||P||B,ess := inf{||P − K||B : K : B → B – a compact operator}.\nClearly for each ε > 0 the set\nsp(P) ∩ {z ∈ C : |z| ≥ ρB,ess (P) + ε}\nconsists of a finite number eigenvalues λ1 , λ2 , . . . , λM(ε) of the operator P. Schematically on the\ncomplex plane the spectrum can be represented as a disk of radius ρB,ess (P) centered at the origin\n(describing the essential spectrum) and (not more than countable) collection of points between\nthis disk and the circle of radius ρB (P) also centered at the origin.\n\n4.2\n\nSpectrum for the case of contracting on average random maps\n\nIn Section 2 it was shown that a contracting on average random map T possesses the only one\nn\ninvariant measure μT to which the sequence of iterations {T μ} converges (exponentially fast in the\nHutchinson metrics) for each probabilistic initial measure μ. From the point of view of dynamical\nsystem theory the following question after this is the analysis of the spectrum of this convergence.\nThe problem here is that typically the limit measure μT is not absolutely continuous, which rules\nout the description of the transfer operator PT in a space of a reasonably 'good' functions, for\nexample, in the space of functions of bounded variation. To overcome this difficulty we shall study\nthe action of the operator PT in a much larger space of generalized functions equipped with a\nnorm induced by the Hutchinson metrics.\nLet (X, ρ) be a d-dimensional smooth manifold with a finite collection of continuous maps {Ti }\nhaving bounded Lipschitz constants ΛTi from X into itself, and a collection of probabilities {pi },\ndefining the random map T . Remind that the contraction on average means that\nX\nΛT :=\npi ΛTi < 1.\ni\n\nBefore to define our space of generalized functions we need first to define the class of testfunctions φ : X → IR1 . For this purpose we introduce the following functionals:\nHα (φ) :=\n\nsup\nx,y∈X, ρ(x,y)≤ν\n\n|φ(x) − φ(y)|\n,\nρα (x, y)\n\nVα (φ) := Hα (φ) + |φ|∞ ,\nwhere |φ|∞ := esssup|φ|, and the constant ν ∈ (0, 1]. The first of these functionals is the Hölder\nconstant with the exponent α < 1, while the second one for each finite nonnegative value of the\nparameter a is the norm in the Banach space of α-Hölder functions on X, which we shall denote\nby Cα . Without the loss of generality we shall assume that the diameter of the phase space\nsupx,y∈X ρ(x, y) ≤ 1. Note that the another restriction ρ(x, y) ≤ ν is introduced only to be able\nto work with the exponential map on general smooth manifolds: in the case of a flat torus this\nrestriction can be omitted (or simply one can set ν = 1).\n\n\fConsider now the space of generalized functions F on X with the norm defined in terms of the\ntest-functions from the space Cα :\nZ\n||h||(α) := sup\nhφ.\nVα (φ)≤1\n\nThe proof that the functional ||*||(α) is indeed a norm in this space is standard and we leave it for\nthe reader.\nDenote by Fα the closure of the set of bounded in the norm ||*||(α) generalized functions from\nF.\nLemma 4.1 Fβ ⊆ Fα for any numbers 0 < α ≤ β ≤ 1 and each function φ ∈ Cβ the inequality\nVβ (φ) ≤ Vα (φ) holds.\nProof. Indeed,\n|φ(x) − φ(y)|\n|φ(x) − φ(y)| β−α\n=\nρ\n(x, y) ≤ Hα (φ).\nβ\nρ (x, y)\nρα (x, y)\n\nExtending the standard definition of the Perron-Frobeniusa operator to the action in the space\nof generalized functions we get the representation\nZ\nZ\nZ\nX\npi φ ◦ Ti =: h * (φ ◦ T )\nPT h * φ = h *\ni\n\nα\n\nfor each test-function from φ ∈ C .\nLet us fix some constants 0 < α < β ≤ 1, 0 < a < ∞, whose exact values we shall define later.\nOur first aim is to derive a version of the Lasota-Yorke inequality for the action in the space Fα .\nFor q ∈ [0, 1] define a function\nX\nΛT (q) :=\npi ΛqTi ,\ni\n\nwhich we shall need in this derivation.\nIntroduce additionally the notation G = {Gi , pi } for the random map defined by the collection\nof maps Gi and the distribution {pi }.\n′\n\nLemma 4.2 The superposition of any pair of random maps G = {Gi , pi } and G = {G′i , p′i }\nacting on the same manifold (X, ρ) and satisfying the Lipschitz condition is again the random map\n′\nG ◦ G := {G′i ◦ Gj , p′i pj } and ΛG′ ◦G (q) ≤ ΛG′ (q) * ΛG (q) for each q ∈ [0, 1].\nProof. Indeed,\nΛG′ ◦G (q) =\n=\n\nXX\ni\n\nj\n\nX\ni\n\np′i pj ΛqG′ ◦Gj ≤\ni\n\np′i ΛqG′\n\ni\n\n! \n*\n\nX\nj\n\nXX\ni\n\nj\n\np′i pj ΛqG′ * ΛqGj\ni\n\n\n\npj ΛqGj  = ΛG′ (q) * ΛG (q).\n\nTheorem 4.1 For each number κ > 2 and for any h ∈ Fα and n ∈ ZZ+ the Lasota-Yorke inequality\nholds:\nPTn h\n≤ κΛTn (α) ||h||(α) + Const * (κ − 2)−1/α ||h||(β) .\n(4.2)\n(α)\n\n\fProof. We start from the proof of the following two inequalities:\nPT h\nPT h\n\n(α)\n\n≤ ||h||(β) ,\n\n(4.3)\n\n≤ κΛT (α) ||h||(α) + Const * (κ − 2)−1/α ||h||(β) .\n\n(4.4)\n\n(β)\n\nBy the definition of the Hölder constant we have:\nρα (Ti x, Ti y) |φ(Ti x) − φ(Ti y)|\n|φ(Ti x) − φ(Ti y)|\n=\n≤ Λα\nTi Hα (φ).\nα\nρ (x, y)\nρα (x, y)\nρα (Ti x, Ti y)\nHence,\nP\n\ni\n\nThus,\nHα\n\npi |φ(Ti x) − φ(Ti y)| X\npi Λ α\n≤\nTi Hα (φ).\nρα (x, y)\ni\nX\ni\n\nOn the other hand, since\n\n!\n\npi (φ ◦ Ti )\n\n≤ ΛT (α)Hα (φ) < Hα (φ).\n\n|φ ◦ Ti |∞ ≤ |φ|∞ ,\nthen\n\nX\ni\n\nTherefore for each β ∈ (0, 1] we have\nVβ\n\npi |φ ◦ Ti |∞ ≤ |φ|∞ .\n\nX\ni\n\npi |φ ◦ Ti |\n\n!\n\n≤ Vβ (φ),\n\nwhich implies the inequality (4.3) for each β ∈ (0, 1] and a function h ∈ Fβ .\nTo prove the second inequality (4.4) we need more delicate estimates.\nIntroduce the following notation:\nBδ (x) := {y ∈ X : ρ(x, y) ≤ δ}\n\nBδ := {ξ ∈ Tx X : |ξ| ≤ δ},\n\ni.e. Bδ (x) is the ball of radius δ centered at the point x in the space X, while Bδ is the ball\nof radius δ centered at the origin in the tangent space Tx X. For each point x ∈ X consider the\nexponential map\nΨx := expx : Bδ ⊆ Tx X → X.\nChoosing δ > 0 small enough we always can assume that Ψx Bδ ⊂ Bν (x).\nDenoting by m the Lebesgue measure on X, we introduce the following smoothing operator\nR\nR\nφ(Ψx z) * JΨx (z) dz\nφ(y)m(dy)\nΨx Bδ\n,\n= Bδ R\nQδ φ(x) :=\nm(Ψx Bδ )\nBδ JΨx (z) dz\nwhere JΨx is the Jacobian of the map Ψx .\nLet us estimate the Hölder constant of the function Qδ φ:\n|Qδ φ(x) − Qδ φ(y)| ≤\n\nZ\n\nBδ\n\nJΨx (z) dz −\n\nZ\n\nBδ\n\nR\n\nφ(Ψy z) * JΨy (z) dz\nR\nJΨx (z) dz * Bδ JΨy (z) dz\nBδ\nZ\nφ(Ψy z) * JΨy (z) dz\nφ(Ψx z) * JΨx (z) dz −\n\nJΨy (z) dz * R\n\nBδ\n\n1\n*\nJΨ\nx (z) dz\nBδ\nBδ\nBδ\n\u00132\n\u0012\n−1\n−1\n|Bδ \\ Ψx Ψy Bδ | + |Ψx Ψy Bδ \\ Bδ |\n≤ 2 sup JΨx * |φ|∞ *\n|Bδ |\nx\n1\n≤ C1 |φ|∞ ρ(x, y),\n+R\n\nZ\n\n\fwhere the constant C1 depends only on the properties of the manifold X.\nNow we estimate how much the operator Qδ differs from the identical operator:\nR\n|φ(Ψx (z)) − φ(x)| * JΨx (z) dz\nR\n|Qδ φ(x) − φ(x)| ≤ Bδ\n≤ C2 δ α Hα (φ),\nBδ JΨx (z) dz\n\nwhere the constant C2 also depends only on the properties of the manifold X.\nOn the other hand,\n!!\nX\nX\npi (φ ◦ Ti )\npi (φ ◦ Ti ) − Qδ\nHα\ni\n\ni\n\n≤ Hα\n\nX\ni\n\n!\n\npi (φ ◦ Ti )\n\n+ Hα\n\nQδ\n\nX\ni\n\n≤ 2ΛT (α)Hα (φ).\n\n!!\n\npi (φ ◦ Ti )\n\nThus,\nVα\n\nX\ni\n\npi (φ ◦ Ti ) − Qδ\n\nX\ni\n\n!!\n\npi (φ ◦ Ti )\n\n≤ 2ΛT (α)Hα (φ) + C2 δ α Hα (φ).\n\nGathering the obtained estimates and using Lemma 4.1 we come to\n!\nZ\nZ\nX\nX\np\n(φ\n◦\nT\n)\n+\nsup\npi (φ ◦ Ti − Qδ (φ ◦ Ti ))\nh\n≤\nsup\nh*\nh\n*\nQ\nPT\ni\ni\nδ\n(α)\n\nVα (φ)≤1\n\n≤\n\nVβ (φ)≤1\n\nX\ni\n\nsup Vα\nVα (φ)≤1\n\n≤\n\nQδ\n\nsup Vα\n\n+\n\nVα (φ)≤1\n\ni\n\nX\ni\n\n!!\n\npi (φ ◦ Ti )\n\ni\n\n||h||(β)\n!\n\npi (φ ◦ Ti − Qδ (φ ◦ Ti ))) ||h||(α)\n\n\u0001\nC1\n||h||(β) + 2ΛT (α) + C2 δ α ||h||(α) .\nδ\n\nTherefore choosing the value of the parameter δ such small that C2 δ α = κ − 2, we get the inequality (4.4).\nNow according to Lemma 4.2 and above inequalities we get\nPnT h\n\n(α)\n\n= PT n h\n\n(α)\n\n≤ κΛT n (α) ||h||(α) + Const δ −1 ||h||(β)\n\n≤ κΛnT (α) ||h||(α) + Const * (κ − 2)−1/α ||h||(β) ,\nwhich finishes the proof of the inequality (4.2).\n\nLemma 4.3 The function ΛT (*) is convex, takes values strictly less than 1 in the interval (0, 1],\nand under the condition\nY pi ΛT\nΛTi i < 1\n(4.5)\ni\n\nits unique point of minima either lies inside of this interval, or is larger than 1 otherwise.\n\nProof. By the definition of the contraction on average we have ΛT (1) = ΛT < 1. On the other\nhand, ΛT (0) = 1, and\nX\nd2\n2\npi ΛqTi * (ln ΛTi ) > 0.\nΛT (q) =\n2\ndq\ni\n\n\fΛT (q)\n1\n\n0\n\nq̃\n\n1\n\nq\n\nFigure 2:\nA typical behavior of the function ΛT (q).\nThus the function ΛT (q) is strictly convex and for any q ∈ (0, 1] it is less than 1. Let us show that\nthis function strictly decreases at 0. Indeed,\nX\nd\nΛT (0) =\npi ln ΛTi .\ndq\ni\nOn the other hand, from the contraction on average\nX\npi ΛTi < 1\ni\n\nusing the convexity of the logarithmic function, we get:\nX\npi ln ΛTi < ln 1 = 0,\ni\n\nwhich proves that\n\nd\ndq ΛT (0)\n\n< 0. It remains to check the last statement.\n\nY pi ΛT\nX\nX\nd\npi ΛT\nΛT (1) =\nΛTi i\nln ΛTi i = ln\npi ΛTi * ln ΛTi =\ndq\ni\ni\ni\n\n!\n\n.\n\nThus due to the inequality (4.5) the unique (due to the strict convexity of the function ΛT (*))\nd\nsolution of the equation dq\nΛT (q) = 0 (the point of minima of the function ΛT (*)) belongs to the\ninterval (0, 1). On the other hand, if the inequality (4.5) does not hold this solution is greater than\n1.\nA typical behavior of the function ΛT (q) is shown Fig. 2. Denote by q̃ the value of the parameter\nq corresponding to the unique (due to the strict convexity) minima of the function ΛT (q). The\nd\nΛT (0) < 0. The position of q̃ with respect to 1 is defined by the sign of\nvalue q̃ is positive since dq\nthe derivative of the function ΛT (q) at 1 which might be both positive and negative. For example,\nif all the maps are contractive then this sign is negative and the function ΛT (q) strictly decreases\non the interval [0, 1]. On the other hand, the map in the example 1.2 satisfies the condition (4.5) if\n0 < p < 1/5 and in this case q̃ = 12 log2 (1/p − 1). We describe the properties of the function ΛT (q)\nin such detail because the fact that it can grow in the vicinity of the point 1 plays an important\nrole in further calculations.\nLemma 4.4 The unit disk in the strong norm ||*||(α) is a compact set in the weak norm ||*||(β)\nThe proof of this statement follows immediately from standard results on the enclosure of the\nspaces of Hölder functions.\n\n\fAbove statements imply by the Ionescu-Tulchea and Marinescu Theorem [14] the quasicompactness of the operator PT , and the validity of the following based on Nussbaum Theorem [20]\nestimate of its essential spectral radius.\nLemma 4.5 [12] The essential spectal radius of the operator PT : Fα → Fα belongs to the disk\nor radius ΛT (α) centered at zero.\nNote that the estimates leading to the Lasota-Yorke type inequalities depend sensitively on the\nchoice of the value of the parameter α. Thus it is reasonable to choose the value of α which yields the\nsmallest (and hence the best) available estimate of the essential spectral radius. Normally (compare\nto [4]) this value is equal to 1 which is unavailable since we consider only Hölder continuous test\nfunctions. However in our case Lemma 4.3 shows that under the condition (4.5) the optimal value\nof α may be strictly less than 1.\nAn immediate corollary to Lemma 4.5 is the existence of a constant γ ∈ [ΛT (α), 1) such\nthat the set sp(PT ) \\ {|z| ≤ γ} consists of a finite number of periferal eigenvalues r1 , . . . , rN\nof finite\nDenote by P1 , . . . , PN the corresponding spectral projectors and set P :=\nPmultiplicity.\nN\n1Fα − j=1 Pj . Then the rank(Pj ) < ∞, PT Pj = rj Pj (j = 1, . . . , N ), and the spectral radius of\nthe operator PT P does not exceed γ.\nBesides,\n• If |r| = 1 the operator\n\u001a\nN\nn−1\nn−1\nX\n1 X \u0010 rj \u0011k\n1 X −k k\nPj , if r = rj\nlim\nPj =\nr PT =\nPr := lim\n0,\notherwise\nn→∞ n\nn→∞ n\nr\nj=1\nk=0\n\nis well defined in the ||*||(α) -norm. In particular, Pj = Prj , and since\n1\n\n(4.6)\n\nk=0\n\n1\n\nR\n\n|Prj f | ≤\n\nR\n\n|f | for all\n\nf ∈ C (X, IR ), then operators Pj can be extended continuously to the entire space L1 .\n\n• RFor any function f ∈ Pj Fα there is a finite Borel signed measure μf on X such that hf, φi =\nφ dμf for all φ ∈ C1 (X, IR1 ). r1 := 1 ∈ sp(PT ), μ := μP1 1 – a positive measure, μ(X) =\nm(X), and all signed measures μf are absolutely continuous with respect to μ.\nOne can interpret these statements as follows: for f, φ ∈ C1 (X, IR1 ) and |r| = 1,\nZ\nn−1\nn−1\n1 X −k k\n1 X −k\nk\nhPr f, φi = lim\nr hPT f, φi = lim\nr\nφ ◦ T * f.\nn→∞ n\nn→∞ n\nk=0\n\n(4.7)\n\nk=0\n\nR\nHence, hPr f, φi ≤ |φ|∞ * |f |, so Pr f can be extended by continuity to a continuous linear\nfunctional\non C0 (X, IR1 ), and by Riss RTheorem there is a measure μPr f , such that\nR\nR hPr f, φi =\nφ dμPr f . If r = 1 and f, φ ≥ 0 then φ dμP1 f = hP1 f, φi ≥ 0 and hP1 f, 1i = f according\nto (4.7). μP1 1 is a positive measure and r = 1 is an eigenvalue of the operator PT . Finally,\nit follows from (4.7) that for any φ ≥ 0 we have\nZ\nn−1 Z\n1X\nk\n|hPj f, φi| ≤ lim\nφ.\nφ ◦ T * |f | ≤ |f |∞ hP1 1, φi = |f |∞\n→∞ n\nk=0\n\nBesides, μPj f is absolutely continuous with respect to μ.\nIt remains to show that Pj Fα = Vj := Pj (C1 (X, IR1 )). Since Vj ⊆ Pj Fα and they are\nfinite dimensional linear subspaces in Fα , then this statement immediately follows from the\ndenseness of the space C1 (X, IR1 ) in Fα .\nR\nR\nR\nPn−1 R\n∗\n∗\nk+1\n= φ dμ for all\n• T μ = μ, since φ d(T μ) = φ ◦ T dμ = limn→∞ n1 k=0 φ ◦ T\nφ ∈ C1 (X, IR1 ).\n• If r = 1 is a simple eigenvalue and there are no other eigenvalues equal to 1 on modulus, then\nP1 f = hf, 1i*P1 1 for all f ∈ Fα . This follows immediately from the fact that hP1 f, 1i = hf, 1i\n(see (4.7).\n\n\f✁❆\n✁ ❆\n❆r\n✁\n❆\n✁\n❆✟✟\n✁\n✟\n✁\n✟ ❆\n❆\n✟\n✁ ✟ T2\n❆\n✟\n✁\n✟\n❆\n✟\n✟ ✁\n❆\n✟✟ ✁\n❆✟✟\n✁\n✟ ❆\n✁\n❆r\n✁\n❆ ✁\n❆❆\n✁\nT1\n\nc\n\n1−c\n\n1/2\n\nFigure 3:\nExample of a random map with a nontrivial isolated eigenvalue\n• μ is a SBR measure, since for each φ ∈ C1 (X, IR1 )\n\u0012 n−1\n\u0013\nZ\nZ\nn−1 Z\n1 X ∗k\n1X\nk\nlim\nφd\nT m = lim\nφ ◦ T = hP1 1, φi = φ dμ .\nn→∞\nn→∞ n\nn\nk=0\n\nk=0\n\nSo far the only isolated eigenvalue that we were able to identify explicitly was the unit eigenvalue\n(the leading one). Let us discuss the following argument. According to Lemma 4.5 the essential\nspectral radius of the operator PT is not larger than ΛT (α). On the other hand, the Lemma 2.2\ngarantees the convergence to the limit measure with the rate at least 1 > ΛT > ΛT (α) (by\nLemma 4.3). Thus if there is a function f ∈ Fα such that PT f = ΛT f , then ΛT is an isolated\neigenvalue.\nExample 4.6 T1 (x) := 1/2 + sign(x − 1/2) * [1/2 − |2sign(x − 1/2) * (x − 1/2) − 1/2|], where sign(x)\nis the sign of the number x, and T2 (x) := x/2.\nThe maps Ti are shown on Fig. 3. Note that this random map is contractive on average when\n0 < p < 1/3. By the construction the map T1 has three unstable fixed points c = 1/6, 1/2 and\n1 − c = 5/6 and the point 1/2 is the only fixed point of the contractive map T2 . Besides, the\ntrajectories of the random map starting at points c and 1 − c are symmetric and consist of a\ncountable number of points {2−1 − 2−n c}n and {2−1 + 2−n (1 − c)}n respectively. Consider a family\nof generalized functions\nfā (x) :=\n\nn\nX\n\nk=0\n\nak * 12−1 −2−k c (x) −\n\nn\nX\n\nk=0\n\nak * 12−1 +2−k (1−c) (x),\n\nparametrized by the sequence of coefficients ā = {ak }k . Due to the previous remark this family\nis invariant with respect to the action of PT and our aim is to find such a sequence ā that\nPT fā = ΛT fā .\nLemma 4.7 In the example 4.6 for each 0 < p < 1/5 there is a sequence ā = ā(p) such that\nPT fā = ΛT fā . However ||fā ||(α) = ∞ for any α ∈ ( 12 log2 (1/p − 1), 1).\nProof. Observe that ΛT = (1 + 3p)/2 < 1. Therefore rewriting the eigenvalue relation in terms\nof the weights ak we obtain the following recurrent relations:\n((1 + 3p)/2) * a0 = pa0 + pa1\n((1 + 3p)/2) * ak = (1 − p)ak−1 + pak+1\nfor each k ≥ 1. Solving these equations with respect to the variables with higher indices we get:\na1 =\n\n1+p\n\na0 ,\n\nak+1 =\n\n1 + 3p\n\nak −\n\n1−p\n\nak−1\n\nfor k ≥ 1.\n\n\f\u0012 1+3p\n\n\u0013\n− 1−p\np\n, controlling the growth of the coefficients, are\n1\n0\nequal to 2 and (1 − p)/(2p) respectively. Now since for 0 < p < 1/5 the second eigenvalue is larger\nand since a1 /a0 = (1 + p)/(2p) > 2 we deduce that the constants ak grow as ((1 − p)/(2p))k as\nk → ∞.\nIt remains to estimate the ||*||(α) -norm of the generalized function fā :\nThe eigenvalues of the matrix A =\n\n2p\n\n||fā ||(α) = 2cα\n\n∞\nX\n\nk=0\n\nak 2−kα < ∞\n\nif and only if ((1 − p)/(2p))2−kα < 1. On the other hand, (1 − p)/(2p) > 2 for 0 < p < 1/5 which\ncontradicts to the convergence.\n\n4.3\n\nSpectrum for the case of expanding on average random maps\n\nLet Ti for each i be a map from the unit interval into itself and let the following condition holds:\nX pi\nγT := sup\n< 1,\n|Ti′ (x)|\nx\ni\n\nwhere the supremum is taken over all points x ∈ X where the derivatives of maps Ti are well\ndefined. Then, according to Theorem 3.2, the Lasota-Yorke inequality is valid:\nvar(PTn h) ≤ CγTn var(h) + β||h||.\nTherefore all known results on the spectral properties of the Perron-Frobenius operator obtained\nfor piecewise expanding maps based on a similar inequalities remain valid as well (see for example\nthe detailed discussion in [1]).\nAs we already mentioned the condition (3.5) does not imply the inequality of Lasota-Yorke type\nand moreover there are examples when under the condition (3.5) there is no exponential correlation\ndecay. Therefore the question how to extend the description of the spectrum to this case remains\nopen.\n\n4.4\n\nStochastic stability\n\nIn this section we shall study random perturbations of random maps under consideration. Since\nunder the condition (3.4) perturbations of expanding on average random maps can be considered\nexactly as in the case of deterministic piecewise expanding maps (see [2, 3] and general discussion\nin [1]) we shall restrict ourselves only to the case of contracting on average systems.\nAs usual under the randomly perturbed system we shall mean the superposition of the original\nsystem and a Markov process acting on the same phase space and defined by the family of transition\noperators Qε (here ε stands for the 'size' of perturbation).\nTo simplify the calculations we shall start from the case X = Tord and then shall explain how\nthe corresponding arguments should be changed in the case of a general smooth manifold.\nConsider two families of operators: integral operators Qε : Fα → C1 and the dual ones Q∗ε :\n1\nC → C1 :\nZ\nQε f (x) := qε (z, x)f (z) dz,\nZ\nQ∗ε φ(x) := qε (x, z)φ(z) dz\nwith the family of nonnegative kernels qε (*, *), with respect to which we shall assume that for some\n1 < M < ∞ the following conditions hold:\nZ\nqε (x, y) dy = 1, qε (x, y) = 0 ∀ρ(x, y) > ε,\n(4.8)\nZ\n\n|qε (x, z) − qε (y, z + y − x)| dz ≤ M ρ(x, y),\n\nWe start the analysis of the operator Q∗ε from the following simple estimates.\n\n(4.9)\n\n\fLemma 4.8 For each φ ∈ Cα we have\n|Q∗ε φ|∞ ≤ |φ|∞ ,\n\n(4.10)\n\n|Q∗ε φ − φ|∞ ≤ εα Hα (φ).\n\n(4.11)\n\nProof. The proof is straightforward:\nZ\nZ\n|Q∗ε φ(x)| = | qε (x, z)φ(z) dz| ≤ qε (x, z)|φ(z)| dz ≤ |φ|∞ .\nZ\n∗\n|Qε φ(x) − φ(x)| = | qε (x, z)φ(z) dz − φ(x)|\nZ\n≤ qε (x, z)|φ(z) − φ(x)| dz\n≤ εα Hα (φ),\n\nsince only the points z ∈ Bε (x) should be taken into account.\nNow let us estimate the norm of the operator Qε .\nLemma 4.9 Let M1 (ε) := max{2εα/2 , M ε(1−α)/2 }. Then ||Qε ||(α) ≤ 1 + M1 (ε).\nProof. Our aim is to show that Q∗ε φ is a valid test function and to estimate the values of Vα (Q∗ε φ).\nWe already estimated the supremum norm of the function Q∗ε φ. To get the estimate of the√Hölder\nconstant we consider two different situations: when the points x, y are close, i.e. ρ(x, y) ≤ ε, and\nthe opposite case when they are far apart. In the first case we proceed as follows:\nZ\nZ\n|Q∗ε φ(x) − Q∗ε φ(y)| = | qε (x, z)φ(z) dz − qε (y, z)φ(z) dz|\nZ\nZ\n= | qε (x, z)φ(z) dz − qε (y, z + y − x)φ(z + y − x) dz|\nZ\nZ\n≤ | qε (x, z)φ(z) dz − qε (x, z)φ(z + y − x) dz|\nZ\nZ\n+ | qε (x, z)φ(z + y − x) dz − qε (y, z + y − x)φ(z + y − x) dz|\nZ\n≤ qε (x, z)|φ(z) − φ(z + y − x)| dz\nZ\n+ |qε (x, z) − qε (y, z + y − x)| * |φ(z + y − x)| dz\n≤ ρα (x, y)Hα (φ) + M ρ(x, y)|φ|∞\nh\ni\n≤ Hα (φ) + M ε(1−α)/2 |φ|∞ ρα (x, y).\n\nIn the opposite case, when ρ(x, y) >\n\n√\nε we shall proceed in a different way:\n\n|Q∗ε φ(x) − Q∗ε φ(y)| ≤ |Q∗ε φ(x) − φ(x)| + |Q∗ε φ(y) − φ(y)| + |φ(x) − φ(y)|\n≤ 2|Q∗ε φ − φ|∞ + ρα (x, y)Hα (φ)\n≤ 2εα Hα (φ) + ρα (x, y)Hα (φ)\n\n≤ (1 + 2εα/2 )ρα (x, y)Hα (φ).\nHence we have\n\nVα (Q∗ε φ) = Hα (Q∗ε φ) + |Q∗ε φ|∞\n≤ (1 + 2εα/2 )Hα (φ) + M ε(1−α)/2 |φ|∞\n\n≤ (1 + max{2εα/2 , M ε(1−α)/2 })Vα (φ).\n\n\fThus, setting M1 (ε) := max{2εα/2 , M ε(1−α)/2 }, we get\nZ\nZ\n||Qε f ||(α) = sup\nQε f * φ = sup\nf * Q∗ε φ\nVα (φ)≤\n\n≤\n\nVα (φ)≤\n\nsup Vα (Q∗ε φ) *\n\nVα (φ)≤1\n\nsup\nVα (ψ)≤1\n\n≤ (1 + M1 (ε)) * ||f ||(α) .\n\nZ\n\nf *ψ\n\nObserve that in several places we used the estimates of the supremum norms obtained in Lemma 4.8.\n\n∗\n1\n1\nRLemma 4.10\nR Let∗ G : Fα → Fα be a linear operator, and let G : C → C be dual to it, i.e.\nGf * φ = f * G φ. Then for all f ∈ Fβ\n!\n\n||Gf ||(β) ≤\n\nsup Vα (G∗ φ)\n\nVβ (φ)≤1\n\n* ||f ||(α) .\n\nProof. Indeed,\n||Gf ||(β) =\n≤\n\nsup\nVβ (φ)≤1\n\nZ\n\nGf * φ =\n∗\n\n!\n\nsup Vα (G φ)\nVβ (φ)≤1\n\nsup\nVβ (φ)≤1\n\n*\n\nZ\n\nsup\nVα (ψ)≤1\n\nf * G∗ φ\nZ\n\nf * ψ.\n\nLemma 4.11\n|||Qε − 1||| ≡ ||Qε − 1||(β→α) :=\n\nsup\n||f ||\n\n(α)\n\n≤1\n\n||Qε f − f ||(β) → 0\n\nas\n\nε → 0.\n\nProof. Applying Lemma 4.10 to the operator G = Qε − 1 we get that the sufficient condition of\nthe validity of the desired statement is the convergence of\nsup Vα (Q∗ε φ − φ) → 0\n\nVβ (φ)≤1\n\nas ε → 0. Let us prove this convergence. Observe that since β > α and φ ∈ Cβ we can get a\nstronger estimate compare to Lemma 4.8:\nZ\n|Q∗ε φ(x) − φ(x)| = | qε (x, z)φ(z) dz − φ(x)|\nZ\n≤ qε (x, z)|φ(z) − φ(x)| dz\n≤ εβ Hβ (φ).\n\nApplying now estimates similar to ones used in the proof of Lemma 4.9 and taking into account\nthat we consider more smooth test-functions φ ∈ Cβ in the case ρ(x, y) ≤ ε we get\n|(Q∗ε φ(x) − φ(x)) − (Q∗ε φ(y) − φ(y))|\n\n≤ |Q∗ε φ(x) − Q∗ε φ(y)| + |φ(x) − φ(y)|\n≤ ρβ (x, y)Hβ (φ) + M ρ(x, y)|φ|∞ + ρβ (x, y)Hβ (φ)\n\u0003\n\u0002\n≤ 2εβ−α Hβ (φ) + M ε1−α |φ|∞ ρα (x, y).\n\n\fWhile in the opposite case, when ρ(x, y) > ε, using the same argument as in the proof of Lemma 4.9\nwe get\n| (Q∗ε φ(x) − φ(x)) − (Q∗ε φ(y) − φ(y)) | ≤ 2|Q∗ε φ − φ|∞ ≤ 2εβ Hβ (φ)\n≤ 2εβ−α Hβ (φ)ρα (x, y).\n\nHence for φ ∈ Cβ\n\nHα (Q∗ε φ − φ) ≤ 2εβ−α Hβ (φ) + M ε1−α |φ|∞ ,\n\nwhich yields the following estimate\nVα (Q∗ε φ − φ) ≤ 2εβ−α Hβ (φ) + M ε1−α |φ|∞ + εβ Hβ (φ)\n\n≤ 3εβ−α Hβ (φ) + M ε1−α |φ|∞ ≤ (3 + M ε1−β )εβ−α Vα (φ) → 0\n\nas ε → 0.\nThe properties of the transition operator obtained above together with Theorem 4.1 under\nthe additional assumption that ΛT (α) < 1/2 make it possible to use results about the spectral\nstability of transfer operators satisfying Lasota-Yorke type inequalities [15] and to obtain the\nfollowing stability result.\nTheorem 4.2 Let the conditions (4.8, 4.9) be satisfied and let ΛT (α) < 1/2 for some α ∈ (0, 1).\nThen all elements of the spectrum spFα (PT ) outside of the disk of radius ΛT (α) are stochastically\nstable and the corresponding eigenprojectors of the perturbed system converge to the genuine ones.\nProof.\nFirst let us show that the transfer operator for the stochastically perturbed system\nsatisfies a Lasota-Yorke type inequality. A straightforward calculation shows that this operator is\nequal to Qε PT . Combining the results of Lemma 4.9 and Theorem 4.1 we get for any h ∈ Fα that\nQε PT h\n\n(α)\n\n≤ (1 + M1 (ε)) PT h\n\n(α)\n\n≤ (1 + M1 (ε))κΛT (α) ||h||(α) + Const * (κ − 2)−1/α ||h||(β) .\nTherefore, if ΛT (α) < 2 for some 0 < α < 1, then the number γ := (1 + M1 (ε))κΛT (α) < 1 for the\nvalue of κ > 2 guaranteed by Theorem 4.1. Since all other assumptions of the abstract spectral\nstability result in [15] were alredy checked during the analysis of our Banach spaces of generalized\nfunctions, we come to the desired statement.\nTo proceed further we need to generalize the notion of the periodic turning point, well known\nin the one-dimensional dynamics. Namely, a point x ∈ X is called the periodic turning point for\nthe map T : X → X if T n x = x for some n ∈ ZZ+ and the derivative of the map T is not well\ndefined at the point x.\nDefinition 4.1 A point x ∈ X is called the periodic turning point for the random map T : X → X\nif there is a finite collection of indices i1 , i2 , . . . , ik such that the point x is the periodic turning\npoint for the deterministic map Ti1 ◦ Ti2 ◦ . . . Tik .\nFor example, the point x = 1/2 is the periodic turning point for the random map in the example\n2 for any nontrivial distribution (0 < p < 1).\nTheorem 4.3 The assumption ΛT (α) < 1/2 can be replaced by the following: either all the maps\nTi are bijective and C 1 -differentiable, or they are piecewise C 1 -differentiable and have no periodic\nturning points. Then all isolated eigenvalues are stochastically stable.\nProof.\nThe key idea here is to consider another representation of the perturbed operator\n(Qε PT )n = Q̃ε(n) PnT and to show that the new operator Q̃ε(n) satisfies the same assumptions\n(4.8, 4.9) as the operator Qε (except that the value of ε(n) might be in 1/ min{ΛTi } times larger).\nTherefore choosing n large enough we can always get Λn (α) < 1/2. This idea was first applied in\n\n\fthe case of piecewise expanding maps in [2, 3] and then in the case of hyperbolic maps in [4]. If\nall maps Ti are bijective this can be done by a simple change of variables, while in the second case\nthe construction is more involved but is completely similar to the one in [2, 3].\nLet us show now what should be changed in the case of a general smooth manifold. Since\nlocally in a neighborhood of a point x ∈ X one can introduce local coordinates by means of the\nexponential map Ψx , the tangent linear space Tx X can be isometrically mapped into IRd . Let\nν > 0 be a number such that for each point x ∈ X the ball (v the metrics ρ) of radius ν centered\nat this point belongs to the domain of values of the exponential map Ψx . Note that we already\nhave introduced the restriction on the distance between the points in the definition of the Hölder\nconstant needing to be content with the domain of definition of the exponential map. In fact, the\nfirst difference appears only in the analysis of random perturbations, in particular, the condition\n(4.9) should be rewritten as\nZ\n−1\n−1\n|qε (x, y) − qε (Ψx (Ψ−1\nx (x) + t), Ψy (Ψy (y) + t))| dy ≤ ρ(x, Ψx (Ψx (x) + t))M,\nwhere t ∈ IRd and |t| ≤ ν.\nAssuming now that ε < ν and replacing the expressions of type z + y − x to\n\u0001\n−1\n−1\nΨz Ψ−1\nz (z) + Ψz (y) − Ψz (x) ,\n\nwe obtain the same estimates as in the flat case (when X is the unit torus). Therefore all results\nof this section remain valid for the case of a general smooth manifold.\n\n4.5\n\nFinite rank approximations\n\nLet us discuss now finite dimensional approximations of transfer operators. Again due to the same\nreason as in the previous section we shall restrict the analysis to the case of contracting on average\nrandom maps.\nLet {∆i }i be a finite partitions of the phase space X into domains (cells) ∆i of diameter not\nlarger than δ > 0. For a point x ∈ X by ∆x we denote the element of the partition containing it.\nUnder these notation the so called Ulam approximation can be described as an operator\nZ\n1\nQ̃δ f (x) :=\nf.\n|∆| ∆x\nNote that this operator is selfdual, i.e. Q̃δ = Q̃∗δ . One can easily check also that the dimension of\nthe space Q̃δ Fα coincides with the number of elements in the Ulam partition.\nLemma 4.12 ||Qδ ||(α) = ∞.\nProof. Let a point y0 ∈ X belongs to the boundary between two elements of the Ulam partition,\nand let the points y(ε) and y ′ (ε) belong to neighboring elements of the partition both on the\ndistance ε from y0 . For the function\nfε (x) := 1y(ε) (x) + 1y′ (ε) (x),\nwhere\n\n1y means the δ-function at the point y, the following inequalities hold:\n||fε ||(α) ≤ Const εα ,\n||Qδ fε ||(α) ≥ Const > 0.\n\nThe first of these inequalities follows from the definition of the norm ||*||(α) , while the second\none is a consequence of the fact that the function Qδ fε is the characteristic function of the\nunion of two neighboring elements of the partition containing the points y(ε) and y ′ (ε). Thus,\n||Qδ fε ||(α) / ||fε ||(α) → ∞ as ε → 0.\n\n\f✟\n✟✟\n✟\n✟\n✟✟\n✟\n\n✿\n✘\n✘✘✘\n✘✘\n\n❆\n❆\n0\n\n❆❯\n\n5/12 1/2\n\n1\n\nFigure 4:\nCounterexample for the original Ulam construction.\nThis result shows that the original Ulam approximation scheme cannot be immediately applied\nto the spectral analysis of random maps.\nWhat is still possible is that the leading eigenfunction – SBR measure may be stable for the\nclass of maps we consider (the above example does not contradict to this – the SBR measure\nis preserved). I believe there should be very deep reasons explaining the stability of the leading\neigenfunction, while all others are not stable, however presently we do not have the adequate\nexplanation. In the literature (see, for example, [1] and further references therein) the stability\nof the SBR measure is proven for the class of piecewise expanding maps. Moreover numerous\nnumerical studies confirm this stability for a much broader class of dynamical systems. To the best\nof our knowledge the following simple example of a one-dimensional discontinuous map represent\nthe first counterexample to the original Ulam hypothesis.\nLemma 4.13 The map\n\nx 1\n4 + 2\nT x := −2x + 1\nx 1\n2 + 4\n\n5\nif 0 ≤ x < 12\n5\nif 12 ≤ x < 12\notherwise.\n\nfrom the unit interval into itself is uniquely ergodic, but the leading eigenvector of the Ulam approximation Π1/n PT does not converge weakly to the only T -invariant measure.\nObserve that the situation when the SBR measure becomes unstable with respect to Ulam\nscheme is indeed very exotic and the map in the corresponding example is not only discontinuous\n(see Fig. 4), but this discontinuity occurs in a periodic turning point (compare to instability results\nabout general random perturbations in [3]).\nProof. Denote by v (n) the normalized leading eigenvector of the matrix Π1/n PT . A straightforward calculation shows that for each n ∈ ZZ1+ all entries of the vector v (2n+1) are zeros except the\nfirst entry, which is equal to 1/3 and the (n + 1)-th one, which is equal to 2/3. Compare this to\nthe only invariant measure of the map T – the unit mass at the point 1/2.\nTo overcome this difficulty we consider another 'smoothed' approximation scheme. In each\nelement of the partition {∆i } (of diametr ≤ δ) we fix an arbitrary point (its 'center') xi ∈ ∆i .\nNow for a given smooth enough kernel qε (*, *) satisfying the assumptions from the previous section\nwe define the following finite dimensional operator:\nZ\nX\n1∆i (x) qε (z, xi )f (z) dz.\nQε,δ f (x) :=\ni\n\nObserve that the dual operator is equal to:\nZ\nX\n∗\nqε (x, xi )\nQε,δ φ(x) :=\n\n∆i\n\nφ(z) dz.\n\n\fIndeed,\nZ\n\nQε,δ f (x) * φ(x) dx =\n\nZ X\n\n1∆i (x)\n\ni\n\n=\n\nZ\n\n=\n\nZ\n\nZ\n\nqε (z, xi )f (z) dz * φ(x) dx\n\nf (z)\n\nX\n\nqε (z, xi )\n\n\u0012Z\n\nf (z)\n\nX\n\nqε (z, xi )\n\nZ\n\ni\n\n\u0013\n1∆i (x)φ(x) dx dz\nφ(x) dx dz =\n\n∆i\n\ni\n\nZ\n\nf (z) * Q∗ε,δ φ(z) dz.\n\nLemma 4.14 Let additionally to the assumptions (4.8, 4.9) for any points x, y, z ∈ X the inequality\n|qε (x, y) − qε (x, z)| + |qε (y, x) − qε (z, x)| ≤ M ε−d−1 ρ(y, z).\n(4.12)\n\nholds. Then\n\n||Qε f − Qε,δ f ||(α) ≤ 5M ε−d−1δ 1−α ||f ||(α) .\nProof.\n\nDenote\n\nZ\n\n(Qε f − Qε,δ f ) * φ =\n\nΦ(x) := Q∗ε φ(x) − Q∗ε,δ φ(x) =\nThen\n|Φ|∞ ≤ |φ|∞ * sup\nx\n\n≤ |φ|∞ * sup\nx\n\nXZ\n\n∆i\n\ni\n\nXZ\n\n∆i\n\ni\n\nZ\n\nf * (Q∗ε φ − Q∗ε,δ φ).\n\nXZ\ni\n\n∆i\n\n(qε (x, z) − qε (x, xi ))φ(z) dz.\n\n|qε (x, z) − qε (xi , x)| dz\n(|qε (x, z) − qε (x, xi )| + |qε (x, xi ) − qε (xi , x)|) dz\n\n≤ 2M ε−d−1δ|φ|∞ ,\nsince x, z ∈ ∆i and, hence, max{ρ(z, xi ), ρ(x, xi )} ≤ δ.\nLet us estimate Hα (Φ). If ρ(x, y) ≤ δ then\n|Φ(x) − Φ(y)| ≤ |Q∗ε φ(x) − Q∗ε φ(y)| + |Q∗ε,δ φ(x) − Q∗ε,δ φ(y)|\nZ\nZ\nX\n|qε (x, xi ) − qε (y, xi )|\n≤ |qε (x, z) − qε (y, z)| * |φ(z)| dz +\ni\n\n∆i\n\n|φ|\n\n≤ M ε−d−1 ρ(x, y)|φ|∞ + M ε−d−1 ρ(x, y) * |φ|∞ = 2M ε−d−1 δ 1−α ρα (x, y) * |φ|∞ .\n\nOtherwise if ρ(x, y) > δ we apply another estimate\n|Φ(x) − Φ(y)| ≤ 2|Φ|∞ ≤ 4M ε−d−1δ|φ|∞ ≤ 4M ε−d−1ρα (x, y) * δ 1−α * |φ|∞ .\nThus,\nand hence\n\nHα (Φ) ≤ 4M ε−d−1δ 1−α * |φ|∞ ,\nVα (Φ) ≤ 5M ε−d−1δ 1−α * Vα (φ),\n\nwhich yields the desired statement.\n\nTheorem 4.4 Let the family of kernels {qε (*, *)} satisfies the conditions (4.8, 4.9,4.12). Then\n||Qε,δ ||(α) ≤ 1 + M1 (ε) + 5M ε−d−1δ 1−α ,\n\n|||Qε,δ − 1||| ≤ (5M + 3 + M ε1−β )(ε−d−1 δ 1−α + εβ−α ) → 0\n\nas ε−d−1 δ 1−α + εβ−α → 0.\n\nHence for the case ΛT (α) < 1/2 the isolated eigenvalues and the corresponding eigenprojectors of\nthe operator P are stable with respect to the considered approximation.\n\n\fProof. According to Lemmas 4.9 and 4.14\n||Qε,δ ||(α) ≤ ||Qε ||(α) + ||Qε,δ − Qε ||(α) ≤ 1 + M1 (ε) + 5M ε−d−1δ 1−α ,\nwhich proves the first statement.\nSimilarly but using Lemma 4.11 instead of Lemma 4.9, we get\nVα (Qε,δ φ − φ) ≤ Vα (Qε,δ φ − Qε φ) + Vα (Qε φ − φ)\n\n\u0001\n≤ 5M ε−d−1δ 1−α + (3 + M ε1−β )εβ−α * Vα (φ),\n\nwhich finishes the proof.\n\nIn fact the finite dimensional approximation defined by the two-parameter family of operators\n{Qε,δ }ε,δ one can consider as a smoothed version of the original Ulam construction, which corresponds to the case ε = 0. Observe that in our approximations the relation between the parameters\nis completely different – it is necessary that ε ≫ δ.\nWe consider also another (seeming more natural) finite rank approximation scheme. Denote\nby Πδ the pure Ulam approximation operator corresponding to the partition into domains {∆i }\nwhose diameters do not exceed δ:\nZ\n1\nΠδ f (x) :=\nf (s) ds,\n|∆x | ∆x\nwhere ∆x stands for the element of the partition containing the point x. Note that this operator is\nself adjoint. We shall approximate our transfer operator PT by Πδ Qε PT . To study the properties\nof this approximation we need as usual to analyze properties of the adjoint operator, i.e. of the\noperator\nZ\nZ\n1\nφ(s) ds dz.\nQ∗ε Π∗δ φ(x) = qε (x, z)\n|∆z | ∆x\nLemma 4.15 ||Qε − Πδ Qε ||(α) ≤ (3 + 2M )ε−d−1 δ α(1−α) → 0 as ε−d−1 δ α(1−α) → 0.\nProof. Denote\nΦ(x) :=\n=\n\nQ∗ε φ(x)\nZ\n\n−\n\nqε (x, z)\n\nQ∗ε Π∗δ φ(x)\n\n1\n|∆z |\n\nZ\n\n∆x\n\n=\n\nZ\n\n\u0012\n\n1\nqε (x, z) φ(z) −\n|∆z |\n\nZ\n\nφ(s) ds\n\n∆x\n\n\u0013\n\ndz\n\n(φ(z) − φ(s)) ds dz.\n\nSince φ ∈ Cα and the diameter of the elements of the partition does not exceed δ, we have\nZ\n|Φ|∞ ≤ δ α Hα (φ) sup qε (x, z) dz = δ α Hα (φ).\nx\n\nNow we are going to estimate the Hölder constant of the function Φ. which we shall do in two\nsteps. First, we consider the case when ρ(x, y) ≤ δ α :\n|Φ(x) − Φ(y)| ≤ |Q∗ε φ(x) − Q∗ε φ(y)| + |Q∗ε Π∗δ φ(x) − Q∗ε Π∗δ φ(y)|\nZ\nZ\n≤ |qε (x, z) − qε (y, z)| * |φ|∞ dz + |qε (x, z) − qε (y, z)| *\n≤ 2M ε−d−1ρ(x, y)|φ|∞ ≤ 2M ε−d−1 δ α(1−α) |φ|∞ ρα (x, y).\n\n1\n|∆z |\n\nZ\n\n∆z\n\n|φ(s)| ds dz\n\nIn the opposite case, when r(x, y) > δ α we use a different estimate:\n|Φ(x) − Φ(y)| ≤ 2|Φ|∞ ≤ 2δ α Hα (φ) ≤ 2δ α(1−α) Hα (φ)ρα (x, y).\nThus\nVα (Φ) ≤ 2δ α(1−α) Hα (φ) + 2M ε−d−1 δ α(1−α) |φ|∞ + δ α Hα (φ)\n≤ 3δ α(1−α) Hα (φ) + 2M ε−d−1 δ α(1−α) |φ|∞ ≤ (3 + 2M )ε−d−1 δ α(1−α) Vα (φ) → 0\n\n\fas ε−d−1 δ α(1−α) → 0.\nObserve that the rate of convergence in this approximation is lower compare to the previous\none, however the numerical application of the 2nd scheme is more straitforward.\nCorollary 4.16 Again as in Theorem 4.3 and due to the same reason the assumption ΛT (α) < 1/2\ncan be replaced by either the bijectivity of the maps Ti or the absence of its periodic turning points.\n\nReferences\n[1] M. Blank, Stability and localization in chaotic dynamics, MCCME, Moscow, 2001.\n[2] M. Blank, G. Keller, Stochastic stability versus localization in chaotic dynamical systems, Nonlinearity\n10:1 (1997), 81–107.\n[3] M. Blank, G. Keller, Random perturbations of chaotic dynamical systems: stability of the spectrum,\nNonlinearity 11 (1998), 81-107.\n[4] M. Blank, G. Keller, C. Liverani,\nnlin.CD/0104031, (2001), 1-58.\n\nRuelle-Perron-Frobenius spectrum for Anosov maps,\n\n[5] F.E. Browder, On the spectral theory of elliptic differential operators I, Math. An. 142 (1961), 22-130.\n[6] J. Buzzi, Exponential decay of correlations for random Lasota-Yorke maps, Commun. Math. Phys.\n208 (1999), 25-54.\n[7] M. Dellnitz, O. Junge, On the approximation of complicated dynamical behavior, SIAM J. on Numerical\nAnalysis 36:2 (1999), 491-515.\n[8] N. Dunford, J.T. Schwartz, Linear operators, Part 1: General Theory, Wiley, 1957.\n[9] K.J. Falkoner, Fractal geometry, John Wiley and Sons, 1990.\n[10] Ai Hua Fan, Ka-Sing Lau, Iterated function system and Ruelle operator, preprint 1999.\n[11] G. Froyland, Ulam's method for random interval maps, Nonlinearity 12:4 (1999), 1029-1052.\n[12] H.Hennion, Sur un Théoreme spectral et son application aux noyaux Lipchitziens, Proc. of American\nMathematical Society 118, 2, (1993), 627–634.\n[13] J.E. Hutchinson, Fractals and self-similarity, Indiana Univ. Math. J. 30(1981), 713-747.\n[14] C.T. Ionescu-Tulcea, G. Marinescu, Theorie ergodique pour des classes d'operators non complement\ncontinues, Ann. of Math. (2) 52:1 (1950), 140-147.\n[15] G. Keller, C. Liverani, Stability of the Spectrum for Transfer Operators, Annali della Scuola Normale\nSuperiore di Pisa, Scienze Fisiche e Matematiche (4) 28 (1999), 141-152.\n[16] K. Khanin, Yu. Kifer, Thermodynamic formalism for random transformations and statistical mechanics, Sinai's Moscow seminar on dynamical systems, AMS Translation, Series 2, 171, AMS, Providence,\nRhode Island, 1996.\n[17] Yu. Kifer, Ergodic theory of random transformations, Birkhauser, Boston, 1986.\n[18] Yu. Kifer, Computations in dynamical systems via random perturbations, Discrete Contin. Dynam.\nSystems 3:4 (1997), 457–476.\n[19] T. Morita, Random iteration of one-dimensional transformations, Osaka J. Math. 22:3 (1985), 489–\n518.\n[20] R.D. Nussbaum, The radius of the essential spectrum, Duke Math. J. 37(1970), 473-478.\n[21] S. Pelikan, Invariant densities for random maps of the interval, Trans. Amer. Math. Soc. 281:2 (1984),\n813–825.\n[22] S. Ulam, Problems in modern mathematics, Interscience Publishers, New York, 1960.\n\n\f"}