{"id": "http://arxiv.org/abs/nlin/0606037v1", "guidislink": true, "updated": "2006-06-14T07:29:43Z", "updated_parsed": [2006, 6, 14, 7, 29, 43, 2, 165, 0], "published": "2006-06-14T07:29:43Z", "published_parsed": [2006, 6, 14, 7, 29, 43, 2, 165, 0], "title": "Strength distributions and symmetry breaking in coupled microwave\n  billiards", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=nlin%2F0606066%2Cnlin%2F0606027%2Cnlin%2F0606005%2Cnlin%2F0606047%2Cnlin%2F0606018%2Cnlin%2F0606011%2Cnlin%2F0606043%2Cnlin%2F0606023%2Cnlin%2F0606004%2Cnlin%2F0606012%2Cnlin%2F0606037%2Cnlin%2F0606068%2Cnlin%2F0606041%2Cnlin%2F0606038%2Cnlin%2F0606025%2Cnlin%2F0606046%2Cnlin%2F0606048%2Cnlin%2F0606020%2Cnlin%2F0606036%2Cnlin%2F0606069%2Cnlin%2F0606002%2Cnlin%2F0606003%2Cnlin%2F0606001%2Cnlin%2F0606055%2Cnlin%2F0606071%2Cnlin%2F0606058%2Cnlin%2F0606010%2Cnlin%2F0606042%2Cnlin%2F0606067%2Cnlin%2F0606013%2Cnlin%2F0606062%2Cnlin%2F0606028%2Cnlin%2F0606056%2Cnlin%2F0606022%2Cnlin%2F0606024%2Cnlin%2F0606050%2Cnlin%2F0606044%2Cnlin%2F0606060%2Cnlin%2F0606034%2Cnlin%2F0606057%2Cnlin%2F0205010%2Cnlin%2F0205022%2Cnlin%2F0205009%2Cnlin%2F0205035%2Cnlin%2F0205054%2Cnlin%2F0205067%2Cnlin%2F0205062%2Cnlin%2F0205027%2Cnlin%2F0205061%2Cnlin%2F0205029%2Cnlin%2F0205066%2Cnlin%2F0205046%2Cnlin%2F0205059%2Cnlin%2F0205041%2Cnlin%2F0205021%2Cnlin%2F0205050%2Cnlin%2F0205064%2Cnlin%2F0205034%2Cnlin%2F0205036%2Cnlin%2F0205065%2Cnlin%2F0205058%2Cnlin%2F0205039%2Cnlin%2F0205033%2Cnlin%2F0205052%2Cnlin%2F0205005%2Cnlin%2F0205063%2Cnlin%2F0205028%2Cnlin%2F0205020%2Cnlin%2F0205042%2Cnlin%2F0205001%2Cnlin%2F0205048%2Cnlin%2F0205012%2Cnlin%2F0205011%2Cnlin%2F0205044%2Cnlin%2F0205047%2Cnlin%2F0205017%2Cnlin%2F0205016%2Cnlin%2F0205002%2Cnlin%2F0205053%2Cnlin%2F0205025%2Cnlin%2F0205003%2Cnlin%2F0205023%2Cnlin%2F0205037%2Cnlin%2F0205008%2Cnlin%2F0205026%2Cnlin%2F0205051%2Cnlin%2F0205004%2Cnlin%2F0205013%2Cnlin%2F0205007%2Cnlin%2F0205006%2Cnlin%2F0205031%2Cnlin%2F0205045%2Cnlin%2F0205024%2Cnlin%2F0205040%2Cnlin%2F0205056%2Cnlin%2F0205055%2Cnlin%2F0205030%2Cnlin%2F0205032%2Cnlin%2F0205038%2Cnlin%2F0205014%2Cnlin%2F0205060&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Strength distributions and symmetry breaking in coupled microwave\n  billiards"}, "summary": "Flat microwave cavities can be used to experimentally simulate quantum\nmechanical systems. By coupling two such cavities, we study the equivalent to\nthe symmetry breaking in quantum mechanics. As the coupling is tunable, we can\nmeasure resonance strength distributions as a function of the symmetry\nbreaking. We analyze the data employing a qualitative model based on Random\nMatrix Theory (RMT) and show that the results derived from the strength\ndistribution are consistent with those previously obtained from spectral\nstatistics.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=nlin%2F0606066%2Cnlin%2F0606027%2Cnlin%2F0606005%2Cnlin%2F0606047%2Cnlin%2F0606018%2Cnlin%2F0606011%2Cnlin%2F0606043%2Cnlin%2F0606023%2Cnlin%2F0606004%2Cnlin%2F0606012%2Cnlin%2F0606037%2Cnlin%2F0606068%2Cnlin%2F0606041%2Cnlin%2F0606038%2Cnlin%2F0606025%2Cnlin%2F0606046%2Cnlin%2F0606048%2Cnlin%2F0606020%2Cnlin%2F0606036%2Cnlin%2F0606069%2Cnlin%2F0606002%2Cnlin%2F0606003%2Cnlin%2F0606001%2Cnlin%2F0606055%2Cnlin%2F0606071%2Cnlin%2F0606058%2Cnlin%2F0606010%2Cnlin%2F0606042%2Cnlin%2F0606067%2Cnlin%2F0606013%2Cnlin%2F0606062%2Cnlin%2F0606028%2Cnlin%2F0606056%2Cnlin%2F0606022%2Cnlin%2F0606024%2Cnlin%2F0606050%2Cnlin%2F0606044%2Cnlin%2F0606060%2Cnlin%2F0606034%2Cnlin%2F0606057%2Cnlin%2F0205010%2Cnlin%2F0205022%2Cnlin%2F0205009%2Cnlin%2F0205035%2Cnlin%2F0205054%2Cnlin%2F0205067%2Cnlin%2F0205062%2Cnlin%2F0205027%2Cnlin%2F0205061%2Cnlin%2F0205029%2Cnlin%2F0205066%2Cnlin%2F0205046%2Cnlin%2F0205059%2Cnlin%2F0205041%2Cnlin%2F0205021%2Cnlin%2F0205050%2Cnlin%2F0205064%2Cnlin%2F0205034%2Cnlin%2F0205036%2Cnlin%2F0205065%2Cnlin%2F0205058%2Cnlin%2F0205039%2Cnlin%2F0205033%2Cnlin%2F0205052%2Cnlin%2F0205005%2Cnlin%2F0205063%2Cnlin%2F0205028%2Cnlin%2F0205020%2Cnlin%2F0205042%2Cnlin%2F0205001%2Cnlin%2F0205048%2Cnlin%2F0205012%2Cnlin%2F0205011%2Cnlin%2F0205044%2Cnlin%2F0205047%2Cnlin%2F0205017%2Cnlin%2F0205016%2Cnlin%2F0205002%2Cnlin%2F0205053%2Cnlin%2F0205025%2Cnlin%2F0205003%2Cnlin%2F0205023%2Cnlin%2F0205037%2Cnlin%2F0205008%2Cnlin%2F0205026%2Cnlin%2F0205051%2Cnlin%2F0205004%2Cnlin%2F0205013%2Cnlin%2F0205007%2Cnlin%2F0205006%2Cnlin%2F0205031%2Cnlin%2F0205045%2Cnlin%2F0205024%2Cnlin%2F0205040%2Cnlin%2F0205056%2Cnlin%2F0205055%2Cnlin%2F0205030%2Cnlin%2F0205032%2Cnlin%2F0205038%2Cnlin%2F0205014%2Cnlin%2F0205060&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Flat microwave cavities can be used to experimentally simulate quantum\nmechanical systems. By coupling two such cavities, we study the equivalent to\nthe symmetry breaking in quantum mechanics. As the coupling is tunable, we can\nmeasure resonance strength distributions as a function of the symmetry\nbreaking. We analyze the data employing a qualitative model based on Random\nMatrix Theory (RMT) and show that the results derived from the strength\ndistribution are consistent with those previously obtained from spectral\nstatistics."}, "authors": ["B. Dietz. T. Guhr", "H. L. Harney", "A. Richter"], "author_detail": {"name": "A. Richter"}, "author": "A. Richter", "links": [{"href": "http://arxiv.org/abs/nlin/0606037v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/nlin/0606037v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "nlin.CD", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "nlin.CD", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/nlin/0606037v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/nlin/0606037v1", "arxiv_comment": null, "journal_reference": null, "doi": null, "fulltext": "Strength distributions and symmetry breaking in coupled\nmicrowave billiards\nB. Dietz,1 T. Guhr,2 H.L. Harney,3 and A. Richter1, ∗\n1\n\nInstitut für Kernphysik, Technische Universität Darmstadt, D-64289 Darmstadt, Germany\n\narXiv:nlin/0606037v1 [nlin.CD] 14 Jun 2006\n\n2\n\nMatematisk Fysik, LTH, Lunds Universitet, S-22100 Lund, Sweden\n\n3\n\nMax-Planck-Institut für Kernphysik, D-69029 Heidelberg, Germany\n(Dated: July 16, 2018)\n\nAbstract\nFlat microwave cavities can be used to experimentally simulate quantum mechanical systems.\nBy coupling two such cavities, we study the equivalent to the symmetry breaking in quantum\nmechanics. As the coupling is tunable, we can measure resonance strength distributions as a\nfunction of the symmetry breaking. We analyze the data employing a qualitative model based on\nRandom Matrix Theory (RMT) and show that the results derived from the strength distribution\nare consistent with those previously obtained from spectral statistics.\nPACS numbers: 05.45.Mt,05.60.Gg\n\n1\n\n\fThe breaking of quantum mechanical symmetries represents a prominent object of study\nin a rich variety of systems, ranging from high energy to condensed matter physics. Sometimes it is possible to determine the size of the symmetry breaking by analyzing statistical\nobservables. We mention parity violation [1], the breaking of atomic and molecular symmetries [2, 3] and isospin mixing [4, 5, 6, 7, 8, 9] in nuclei. Symmetry breaking influences the\nspectral statistics as well as the wave function statistics, such as the distributions of partial\nwidths and transition matrix elements. While symmetry breaking cannot be controlled or\ntuned in nuclei, atoms and molecules, this was possible for elastomechanical resonances in\nquartz crystals by successively breaking crystal symmetries [10]. An analogy to the nuclear\ncase of symmetry breaking was given by two coupled microwave cavities [11] with a tunable coupling. The statistical properties of both systems are fully equivalent to those of a\nquantum system [12, 13]. Wheras these two investigations focused on the spectral statistics,\nwidth distributions for two different types of resonances in elastic aluminum plates were\nstudied in Ref. [14] for a varying degree of mixing.\nHere, we present experimental results on the distribution of products of partial widths\nin two coupled chaotic microwave cavities. First, we measure the distribution for different\ncouplings. It can be normalized such that it only depends on the symmetry breaking. As\nthis is different from Ref. [14], we can apply a qualitative statistical model which extends\nthe model of Ref. [8] in order to, second, extract the size of the symmetry breaking from\nthe data. We then show, third, that the symmetry breaking thereby obtained is consistent\nwith the one previously found from the spectral statistics.\nIn the experiment, we used two flat cylindrical microwave cavities having the shape of\nthe quarter of a Bunimovich stadium[11]. In both resonators (see Fig. 1) the radius of\nthe quarter circle is 0.2 m. The ratios of the length of the rectangular part to the radius\nare γ1 = 1 and γ2 = 1.8, respectively. Therefore the level densities increase with different\nslopes as functions of frequency [15, 16]. The cavities were put on top of each other and\ncircular holes, 4 mm in diameter, were drilled through the walls of both resonators. The\ncoupling was realized by a niobium pin, 2 mm in diameter, penetrating through the holes\ninto both resonators. Due to the ring-shaped gap between the niobium pin and the hole\nsurface, the pin acts like an antenna, which in the experimental frequency range supports\none TEM-mode. The coupling is controlled by the penetration depth [11].\nInformation about the partial widths is obtained from transmission spectra. At a given\n2\n\n\ffrequency f , the relative power transmitted from antenna a to antenna b is proportional to\nthe absolute square of the scattering matrix element, Pout,b /Pin,a ∼ |Sab (f )|2. For sufficiently\nisolated resonances, one has\nSab (f ) = δab − i\n\nq\n\nΓμa Γμb\n\n(1)\n\nf − fμ + 2i Γμ\n\nfor f close to the frequency fμ of the μ-th resonance. The quantities Γμa and Γμb are\nthe partial widths related to the antennae a and b, Γμ is the total width of the resonance\n[17]. In the experiment, three antennae were attached to each resonator, where half of the\nmicrowave power was fed into each resonator (see insert of Fig. 2). Thereby, altogether\nsix transmission spectra were obtained for 4 different couplings; in the order of increasing\ncoupling these are denoted as (8,0), (5,3), (4,4) and (5,8) in Ref. [11]. Here, the pair (x1 , x2 )\ndenotes the penetration depth in mm of the pin into either cavity. The transmission spectra\nwere measured up to a maximum frequency of 17.5 GHz. The resonance strengths Γμa Γμb ,\ni.e. the products of the partial widths, are determined as described in [18]. Resonances with\npeak heights below a certain value may not be detected, implying that some strength is\nmissing in the tails of the distributions [18]. We will show that this has no effect on the\nresults.\nWe work with the resonance strengths Γμa Γμb and their distributions. They yield the\nsame information as the distributions of the partial widths Γμa themselves. The data are\nunfolded as in Refs. [17, 18].\nTo interpret the distribution of the empirical data Γμa Γμb , we employ a statistical model\nwhich is a special case of the Rosenzweig–Porter model [2]. A symmetry is associated with\na quantum number. If it suffices to consider only two different values of it, the Hamiltonian\ncan be written in the form\nH=\n\nH1\n\n0\n\n0\n\nH2\n\n!\n\n+α\n\n0\n\nV\n\nVT\n\n0\n\n!\n\n,\n\n(2)\n\nwhere the first part preserves the symmetry and the second part breaks it with the parameter\nα. For isospin mixing in nuclei, H1 and H2 correspond to the sub–Hamiltonians for two\nisospin quantum numbers, while V accounts for the Coulomb interaction that mixes isospin.\nIn our case the \"symmetry\" preserving situation is simply realized by considering the states\nof each uncoupled cavity as eigenstates of a \"symmetry operator\". Thus, H1 and H2 model\nthe dynamics in the two cavities, without the coupling. We choose their dimensions N1 and\n3\n\n\fN2 different because the level densities in the cavities have different slopes as a function\nof frequency. For later purposes, we introduce the fractional densities g1 = N1 /(N1 + N2 )\nand g2 = N2 /(N1 + N2 ). As the whole system is time–reversal invariant and the dynamics\nin the Bunimovich billiards is fully chaotic, we represent H1 and H2 by real–symmetric\nrandom matrices drawn from the Gaussian Orthogonal Ensemble (GOE) [12, 19, 20, 21].\nThe coupling is modeled by the off–diagonal blocks V and V T in Eq. (2), where the matrix\nV is real with no symmetries and has dimension N1 × N2 . In the experiment the modes in\none resonator are coupled to those in the other via one TEM-mode. We model the coupling\nof the N1 and N2 resonator modes with this TEM mode by an N1 -dimensional vector v\nand an N2 -dimensional vector w. The coupling matrix V then acquires the dyadic structure\nV = vw T . The matrix V has rank M = 1. The entries of v and w are chosen as Gaussian\nrandom numbers. The distribution of the elements Vnm is\n√\nK0 (Vnm / σ)\n√\nq(Vnm |σ) dVnm =\ndVnm ,\n(3)\nπ σ\nwhere K0 is the modified Bessel function of zeroth order [22]. The variance σ of the elements\nof V is adjusted exactly as described in [6, 8]. The vertical bar on the l.h.s. separates the\nargument of q into the random variable Vnm and the parameters, i.e. in this case σ. Universal\nspectral fluctuations have to be measured on the scale of the local mean level spacing D.\nAccordingly, the parameter measuring the size of the coupling or the symmetry breaking is\nλ = α/D [23]. It connects to the spreading width via the relation Γ↓ = 2πα2 /D = 2πλ2 D [5].\nSpectral fluctuations have been calculated perturbatively in λ in Refs. [24, 25] and exactly\nfor the time–reversal non–invariant case in Refs. [6, 26]. For the analysis of the spectral\nproperties of the coupled microwave billiards [11], a model Hamiltonian of the form Eq. (2)\nwith a coupling matrix V of rank N1 was applied. While, in the relevant range of λ-values\nthe spectral properties do not depend on the rank of V , the statistical properties of the\neigenvector components deviate for M ≪ N1 .\nAccordingly we apply and extend the qualitative model of Ref. [8] where the statistics of\ntransition strengths was considered. In a fully chaotic system, the partial width distribution\nconverges to the Porter-Thomas form [12, 20, 21, 27]\n\u0012\n\u0013\nta dta\n1\nexp −\nPT(ta |τa )dta = q\n2τa τa\n2πta /τa\n\n(4)\n\nfor a large level number. We write ta for the partial width instead of Γμa , because the\ndistribution does not depend on the resonance index μ. In practice the distribution is\n4\n\n\fobtained from the sample of all resonances. Its first moment equals τa . For two coupled\nchaotic systems the partial width distribution p(ta |λ, τa ) involves the symmetry breaking\nHamiltonian in Eq. (2) for large level numbers. It is easily constructed in the limiting case\nwithout symmetry breaking; i.e. for λ = 0 we have\np(ta |λ = 0, τa ) =\n\ng12 PT\n\nτa\nta\ng1\n\n!\n\n+\n\ng22 PT\n\nta\n+2g1 g2 δ\nτa\n\u0012\n\n\u0013\n\nτa\nta\ng2\n\n!\n\n.\n\n(5)\n\nThe distribution in Eq. (5) again has the expectation value τa . We now model the case of\nsmall symmetry breaking λ by an interpolating ansatz: We expect the Porter-Thomas distributions in Eq. (5) to maintain their shape, such that only their width parameters change.\nThe delta function in Eq. (5) acquires a width and develops into a non-singular function. Nu\u0010q\n\u0011\n√\nmerical studies have lead us to approximate it by [28] P0 (t|ρ) dt = K0\nt/ρ / (π tρ) dt,\n\nwhere ρ stands for the variance parameter. We arrive at the model\n\np(ta |λ, τa ) = g12 PT (ta |τa κ1 (η)) + g22 PT (ta |τa κ2 (η))\n+2g1 g2 P0 (ta |τa η 2 ) .\n\n(6)\n\nThe shape of the whole distribution is determined by the quantities κ1 (η), κ2 (η) and η =\nη(λ) which all depend on λ. With the help of the limiting case Eq. (5), we can come\nup with educated guesses for these functions. We must have η(0) = 0 and furthermore\nκj (0) = 1/gj , j = 1, 2. As the functions κj ought to be even in η, we choose κj (η) =\n1/gj + (1 − 1/gj ) η 2 ,\n\nj = 1, 2. To construct the function η = η(λ), we fit the ansatz given\n\nin Eq. (6) including these choices to Monte Carlo simulations of the distributions involving\nthe Hamiltonian in Eq. (2) for N1 + N2 = 300. We do that for 21 values of λ in the interval\n[0.05, 0.25] which is the relevant parameter range in the experiment. The fractional densities\nin the experiment are g1 = 0.59 and g2 = 0.41. In Fig. 2 we display the values thus obtained\nfor η(λ). The functional form is well described by the polynomial η(λ) = 2.57λ − 1.98λ2 .\nFrom the distributions for two partial widths ta and tb , say, we obtain the distribution for\nthe resonance strength y = ta tb as in [18] by a filter integration. As we know the fractional\ndensities g1 and g2 in the experiment, we arrive at a qualitative model for the resonance\nstrength distribution that depends only on one single parameter - the measure λ for the\nsymmetry breaking. The distributions in Eq. (6) and accordingly the strength distribution\n5\n\n\fdiverge for ta → 0. Thus, for their graphical representation we use the logarithmic variable\nz = log10 (y/τa τb ).\nDespite its simplicity, the qualitative model in Eq. (6) yields a satisfactory description.\nWe demonstrate this in Fig. 3 where a Monte Carlo simulation of resonance strength distributions obtained from the random matrix Hamiltonian in Eq. (2) with the same fractional\ndensities as in the experiment is compared to the calculated strength distribution for four\ndifferent values of λ. The strongest deviations between both curves are observed for the\nsmallest value of λ. For values λ < 0.03 the description by the qualitative model ceases to\nbe satisfactory. But, most importantly, the position of the maximum is described very well\nin all four examples. It is particularly this feature which makes the qualitative model in\nEq. (6) useful for the analysis of experimental data. The fit of the model to the experimental\ndata is displayed in Fig. 4. Due to the above mentioned missing strength in the left tails,\nthe shape of the distribution is not described quantitatively. In fact, for the determination\nof λ only strengths in a z interval [-3,1.5] were taken into account, where the probability of\nmissing strength is small. The corresponding experimental distributions are shown together\nwith the RMT model fits in the insets of Fig. 4 b)-d). For very small values of λ (cf. Fig. 4\na)) the distributions agree fairly well in this interval. We emphasize again that the peak\npositions in the chosen interval of z values uniquely determine the coupling strengths. We\nthus expect reliable results for the parameter λ. To carefully check how much the missing\nstrength influences the extracted values of λ, we amended the qualitative model by taking\ncare of the experimental thresholds using an analytic ansatz [18]. As expected, the influence\nof the thresholds on the extracted values of λ turned out to be negligible, except when λ\nis essentially zero. As only the position of the maximum in the strength distribution is\nrelevant, we have some freedom in choosing the distribution P0 in Eq. (6). We also tried a\nPorter-Thomas distribution, but the K0 –one describes the shape of the resonance strength\ndistribution better.\nWe finally compare the coupling strengths λ found in the present work with those extracted from the spectral correlations in Ref. [11, 29]. The values are given in Tab. I. The\nλ values obtained in the present work are averaged over all six antennae combinations. The\ntwo analyses agree within the experimental errors. For the weakest coupling only an upper\nlimit can be given. This is due to the fact that for essentially zero coupling a considerable share of strength lies below the experimental threshold of detection. The consistency\n6\n\n\ffor the other couplings is an encouraging corrobaration of the analysis carried out in this\ncontribution [30].\nIn conclusion, we have measured resonance strength distributions for two coupled microwave billiards modeling quantum systems with symmetry breaking. We analyzed the\ndata with a qualitative model which depends only on one single free parameter - the size\nof the symmetry breaking. Our results are interesting from an additional point of view. The\nspectral correlations are more strongly affected by missing levels than partial widths and\ntransition or resonance strength distributions are affected by missing strength. This is so\nbecause the latter do not comprise correlations, they are just densities. Thus the observables related to the wave functions may provide more reliable information than the spectral\ncorrelations. We have shown, with data much better than are usually available, that the\nempirical information extracted from the wave function observables is consistent with that\nobtained from the spectral correlations.\nWe thank T. Seligman for hospitality at the Centro Internacional de Ciencias in Cuernavaca, Mexico, where Part of this work was done, and H.J. Stöckmann for valuable discussions concerning the modeling of the coupling as well a C. Dembowski for extracting the\nresonance parameters from the spectra [31]. This work has been supported by the DFG\nwithin SFB 634 and by Det Svenska Vetenskapsrådet. One of us (A.R.) is grateful to the\nlatter for the Tage Erlander Guest Professorship 2006.\n\n∗\n\nElectronic address: richter@ikp.tu-darmstadt.de\n\n[1] J. D. Bowman et al., Annu. Rev. Nucl. Part. Sci. 43, 829 (1993); G.E. Mitchell, J.D. Bowman,\nand H.A. Weidenmüller, Rev. Mod. Phys. 71, 445 (1999).\n[2] N. Rosenzweig and C. E. Porter, Phys. Rev. 120, 1698 (1960).\n[3] E. Haller, H. Köppel, and L. S. Cederbaum, Chem. Phys. Lett. 101, 215 (1983).\n[4] G. E. Mitchell et al., Phys. Rev. Lett. 61, 1473 (1988).\n[5] H. L. Harney, A. Richter, and H. A. Weidenmüller, Rev. Mod. Phys. 58, 607 (1986).\n[6] T. Guhr and H. A. Weidenmüller, Ann. Phys. (N.Y.) 199, 412 (1990).\n[7] J. F. Shriner, Jr., G. E. Mitchell, and B. A. Brown, Phys. Rev. C 71, 024313 (2005), and refs.\ntherein.\n\n7\n\n\f[8] C.I. Barbosa, T. Guhr, and H.L. Harney, Phys. Rev. E 62, 1936 (2000).\n[9] S. Åberg et al., Phys. Lett. B 598, 42 (2004).\n[10] C. Ellegaard et al., Phys. Rev. Lett. 77, 4918 (1996).\n[11] H. Alt et al., Phys. Rev. Lett. 81, 4847 (1998).\n[12] H.- J. Stöckmann, Quantum Chaos - An Introduction, (Cambridge University Press, Cambridge, 1999).\n[13] A. Richter, in: Emerging Applications of Number Theory, The IMA Volumes in Mathematics\nand its Applications, Vol. 109, edited by D.A. Hejhal et al., p. 479, (Springer, New York,\n1999).\n[14] A. Andersen et al., Phys. Rev. E 63, 066204 (2001).\n[15] H. Weyl, J. Reine Angew. Math. 141, 1 (1912); ibid 163, J. Reine Angew. Math. 143, 177\n(1913).\n[16] H. P. Baltes and E. R. Hilf, Spectra of Finite Systems (Bibliographisches Institut Mannheim,\n1975).\n[17] H. Alt et al., Phys. Rev. Lett. 74, 62 (1995).\n[18] C. Dembowski et al., Phys. Rev. E 71, 046202 (2005).\n[19] M. L. Mehta, Random Matrices (Academic Press, New York, 1991), 2nd ed.\n[20] T. Guhr, A. Müller–Groeling, and H.A. Weidenmüller, Phys. Rep. 299, 189 (1998).\n[21] F. Haake, Quantum Signatures of Chaos, 2nd edition, (Springer Verlag, Berlin 2001).\n[22] I.S. Gradshteyn and I.M. Ryzhik, Tables of Integrals, Series, and Products., (Academic Press,\nNew York, 1980).\n[23] F.J. Dyson, J. Math. phys. 3, 1191 (1962); A. Pandey, Ann. Phys. (NY) 134, 110 (1981).\n[24] D. M. Leitner, Phys. Rev. E 48, 2536 (1993); D. M. Leitner, H. Köppel, and L. S. Cederbaum,\nPhys. Rev. Lett. 73, 2970 (1994).\n[25] J.B. French et al., Ann. Phys. (NY) 181, 198 (1988).\n[26] A. Pandey, Chaos, Solitons and Fractals 5, 1275 (1995).\n[27] C.E. Porter, Statistical Theories of Spectra: Fluctuations, (Academic Press, New York, 1965).\n[28] For very weak symmetry breaking, this follows from the K0 -distribution of the matrix elements\nVnm .\n[29] A. Y. Abul-Magd et al., Phys. Rev. E 65, 056221 (2002).\n[30] However, this consistency does not prove that the dyadic coupling specified prior to Eq. (3) is\n\n8\n\n\fnecessary to describe the present data. It is required by the experimental set-up. We have convinced ourselves that the qualitative model in the version of reference [8] with high-dimensional\ncoupling yields this consistency, too.\n[31] C. Dembowski, Dissertation D17, TU-Darmstadt (2003).\n\n9\n\n\fFigures\n\n10\n\n\fFIG. 1: The two cavities are coupled with a tunable coupling\n\n11\n\n\f0.5\n\nη(λ)\n\n0.4\n0.3\n0.2\n0.1\n0\n\n0.1\n\n0.15\nλ\n\n0.2\n\n0.25\n\nFIG. 2: Size of the tunable coupling λ between the two cavities sketched in Fig. 1. The function\nη(λ) enters Eq. (6).\n\n12\n\n\fP(z|λ,1)\n\n0.3\na)\n\nb)\n\nc)\n\nd)\n\n0.2\n0.1\n\nP(z|λ,1)\n\n0\n0.2\n0.1\n0\n-15\n\nFIG. 3:\n\n-10\n\nz\n\n-5\n\n0\n\n-10\n\nz\n\n-5\n\n0\n\nMonte Carlo simulation of resonance strength distributions (solid lines) compared to\n\nthe calculated strength distribution (dashed lines) for the couplings λ = 0.03 (a), λ = 0.10 (b),\nλ = 0.17 (c), λ = 0.24 (d).\n\n13\n\n\fP(z|λ,1)\n\n0.4\n0.4\n\na)\n\n0.3\n0.2\n\nb)\n\n0\n-4\n\n-2\n\n0\n\n2\n\n0.1\n0\n\nP(z|λ,1)\n\n0.4\n\n0.2\n\n0\n-4\n\n0.4\n\nc)\n\n0.3\n-2\n\n0\n\nd)\n\n0\n-4\n\n2\n\n-2\n\n0\n\n2\n\n0.1\n0\n-10 -8\n\n-6\n\n-4\n\nz\n\n-2\n\n0\n\n2\n\n-8\n\n-6\n\n-4\n\nz\n\n-2\n\n0\n\n2\n\nFIG. 4: The experimental resonance strength distributions (histograms) for the couplings (8,0)\n(a), (5,3) (b), (4,4) (c) and (5,8) (d) fitted to the calculated strength distribution. The symmetry\nbreaking parameter λ equals λ = 0 in (a), λ = 0.110 in (b), λ = 0.125 in (c), and λ = 0.185 in (d).\nThe insets in b), c), and d) show experimental strength distributions together with RMT model\nfits for a z interval [-3,1.5] in which the probability of missing strength is small.\n\n14\n\n\fTables\n\n15\n\n\fTABLE I: Symmetry breaking parameter λ from the spectral correlations and from the resonance\nstrength distributions.\nPhysical\n\nλ\n\nλ\n\ncoupling\n\nRef. [11]\n\nPresent work\n\n(8,0)\n\n≤ 0.029\n\n< 0.003\n\n(5,3)\n\n0.105 ± 0.008\n\n0.116 ± 0.003\n\n(4,4)\n\n0.130 ± 0.007\n\n0.122 ± 0.004\n\n(5,8)\n\n0.180 ± 0.006\n\n0.195 ± 0.007\n\n16\n\n\f"}