{"id": "http://arxiv.org/abs/nlin/0612005v3", "guidislink": true, "updated": "2007-08-25T16:40:07Z", "updated_parsed": [2007, 8, 25, 16, 40, 7, 5, 237, 0], "published": "2006-12-04T01:14:18Z", "published_parsed": [2006, 12, 4, 1, 14, 18, 0, 338, 0], "title": "Physical dynamics of quasi-particles in nonlinear wave equations", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=nlin%2F0209054%2Cnlin%2F0209043%2Cnlin%2F0209010%2Cnlin%2F0209034%2Cnlin%2F0209051%2Cnlin%2F0209047%2Cnlin%2F0209048%2Cnlin%2F0612047%2Cnlin%2F0612007%2Cnlin%2F0612021%2Cnlin%2F0612015%2Cnlin%2F0612004%2Cnlin%2F0612064%2Cnlin%2F0612003%2Cnlin%2F0612020%2Cnlin%2F0612055%2Cnlin%2F0612061%2Cnlin%2F0612045%2Cnlin%2F0612027%2Cnlin%2F0612052%2Cnlin%2F0612063%2Cnlin%2F0612049%2Cnlin%2F0612024%2Cnlin%2F0612028%2Cnlin%2F0612009%2Cnlin%2F0612036%2Cnlin%2F0612016%2Cnlin%2F0612057%2Cnlin%2F0612065%2Cnlin%2F0612010%2Cnlin%2F0612054%2Cnlin%2F0612051%2Cnlin%2F0612030%2Cnlin%2F0612046%2Cnlin%2F0612023%2Cnlin%2F0612013%2Cnlin%2F0612002%2Cnlin%2F0612029%2Cnlin%2F0612039%2Cnlin%2F0612056%2Cnlin%2F0612050%2Cnlin%2F0612044%2Cnlin%2F0612053%2Cnlin%2F0612019%2Cnlin%2F0612041%2Cnlin%2F0612062%2Cnlin%2F0612012%2Cnlin%2F0612058%2Cnlin%2F0612040%2Cnlin%2F0612006%2Cnlin%2F0612037%2Cnlin%2F0612043%2Cnlin%2F0612038%2Cnlin%2F0612032%2Cnlin%2F0612042%2Cnlin%2F0612008%2Cnlin%2F0612034%2Cnlin%2F0612059%2Cnlin%2F0612031%2Cnlin%2F0612060%2Cnlin%2F0612048%2Cnlin%2F0612033%2Cnlin%2F0612018%2Cnlin%2F0612017%2Cnlin%2F0612026%2Cnlin%2F0612005%2Cnlin%2F0612025%2Cnlin%2F0612011%2Cnlin%2F0612001%2Cnlin%2F0612035%2Cnlin%2F0612022%2Cnlin%2F0612014%2Cnlin%2F0311013%2Cnlin%2F0311005%2Cnlin%2F0311039%2Cnlin%2F0311036%2Cnlin%2F0311055%2Cnlin%2F0311053%2Cnlin%2F0311015%2Cnlin%2F0311035%2Cnlin%2F0311020%2Cnlin%2F0311009%2Cnlin%2F0311046%2Cnlin%2F0311038%2Cnlin%2F0311019%2Cnlin%2F0311002%2Cnlin%2F0311051%2Cnlin%2F0311034%2Cnlin%2F0311040%2Cnlin%2F0311058%2Cnlin%2F0311008%2Cnlin%2F0311021%2Cnlin%2F0311041%2Cnlin%2F0311027%2Cnlin%2F0311059%2Cnlin%2F0311033%2Cnlin%2F0311050%2Cnlin%2F0311007%2Cnlin%2F0311017%2Cnlin%2F0311025%2Cnlin%2F0311032&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Physical dynamics of quasi-particles in nonlinear wave equations"}, "summary": "By treating the centers of solitons as point particles and studying their\ndiscrete dynamics, we demonstrate a new approach to the quantization of the\nsoliton solutions of the sine-Gordon equation, one of the first model nonlinear\nfield equations. In particular, we show that a linear superposition of the\nnon-interacting shapes of two solitons offers a qualitative (and to a good\napproximation quantitative) description of the true two-soliton solution,\nprovided that the trajectories of the centers of the superimposed solitons are\nconsidered unknown. Via variational calculus, we establish that the dynamics of\nthe quasi-particles obey a pseudo-Newtonian law, which includes cross-mass\nterms. The successful identification of the governing equations of the\n(discrete) quasi-particles from the (continuous) field equation shows that the\nproposed approach provides a basis for the passage from the continuous to a\ndiscrete description of the field.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=nlin%2F0209054%2Cnlin%2F0209043%2Cnlin%2F0209010%2Cnlin%2F0209034%2Cnlin%2F0209051%2Cnlin%2F0209047%2Cnlin%2F0209048%2Cnlin%2F0612047%2Cnlin%2F0612007%2Cnlin%2F0612021%2Cnlin%2F0612015%2Cnlin%2F0612004%2Cnlin%2F0612064%2Cnlin%2F0612003%2Cnlin%2F0612020%2Cnlin%2F0612055%2Cnlin%2F0612061%2Cnlin%2F0612045%2Cnlin%2F0612027%2Cnlin%2F0612052%2Cnlin%2F0612063%2Cnlin%2F0612049%2Cnlin%2F0612024%2Cnlin%2F0612028%2Cnlin%2F0612009%2Cnlin%2F0612036%2Cnlin%2F0612016%2Cnlin%2F0612057%2Cnlin%2F0612065%2Cnlin%2F0612010%2Cnlin%2F0612054%2Cnlin%2F0612051%2Cnlin%2F0612030%2Cnlin%2F0612046%2Cnlin%2F0612023%2Cnlin%2F0612013%2Cnlin%2F0612002%2Cnlin%2F0612029%2Cnlin%2F0612039%2Cnlin%2F0612056%2Cnlin%2F0612050%2Cnlin%2F0612044%2Cnlin%2F0612053%2Cnlin%2F0612019%2Cnlin%2F0612041%2Cnlin%2F0612062%2Cnlin%2F0612012%2Cnlin%2F0612058%2Cnlin%2F0612040%2Cnlin%2F0612006%2Cnlin%2F0612037%2Cnlin%2F0612043%2Cnlin%2F0612038%2Cnlin%2F0612032%2Cnlin%2F0612042%2Cnlin%2F0612008%2Cnlin%2F0612034%2Cnlin%2F0612059%2Cnlin%2F0612031%2Cnlin%2F0612060%2Cnlin%2F0612048%2Cnlin%2F0612033%2Cnlin%2F0612018%2Cnlin%2F0612017%2Cnlin%2F0612026%2Cnlin%2F0612005%2Cnlin%2F0612025%2Cnlin%2F0612011%2Cnlin%2F0612001%2Cnlin%2F0612035%2Cnlin%2F0612022%2Cnlin%2F0612014%2Cnlin%2F0311013%2Cnlin%2F0311005%2Cnlin%2F0311039%2Cnlin%2F0311036%2Cnlin%2F0311055%2Cnlin%2F0311053%2Cnlin%2F0311015%2Cnlin%2F0311035%2Cnlin%2F0311020%2Cnlin%2F0311009%2Cnlin%2F0311046%2Cnlin%2F0311038%2Cnlin%2F0311019%2Cnlin%2F0311002%2Cnlin%2F0311051%2Cnlin%2F0311034%2Cnlin%2F0311040%2Cnlin%2F0311058%2Cnlin%2F0311008%2Cnlin%2F0311021%2Cnlin%2F0311041%2Cnlin%2F0311027%2Cnlin%2F0311059%2Cnlin%2F0311033%2Cnlin%2F0311050%2Cnlin%2F0311007%2Cnlin%2F0311017%2Cnlin%2F0311025%2Cnlin%2F0311032&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "By treating the centers of solitons as point particles and studying their\ndiscrete dynamics, we demonstrate a new approach to the quantization of the\nsoliton solutions of the sine-Gordon equation, one of the first model nonlinear\nfield equations. In particular, we show that a linear superposition of the\nnon-interacting shapes of two solitons offers a qualitative (and to a good\napproximation quantitative) description of the true two-soliton solution,\nprovided that the trajectories of the centers of the superimposed solitons are\nconsidered unknown. Via variational calculus, we establish that the dynamics of\nthe quasi-particles obey a pseudo-Newtonian law, which includes cross-mass\nterms. The successful identification of the governing equations of the\n(discrete) quasi-particles from the (continuous) field equation shows that the\nproposed approach provides a basis for the passage from the continuous to a\ndiscrete description of the field."}, "authors": ["Ivan Christov", "C. I. Christov"], "author_detail": {"name": "C. I. Christov"}, "author": "C. I. Christov", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/j.physleta.2007.08.038", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/nlin/0612005v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/nlin/0612005v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "10 pages, 3 figures (6 images); v2: revised and improved the\n  presentation, updated the references, fixed typos; v3: corrected a few minor\n  mistakes and typos, version accepted for publication in Phys. Lett. A", "arxiv_primary_category": {"term": "nlin.PS", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "nlin.PS", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/nlin/0612005v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/nlin/0612005v3", "journal_reference": "Physics Letters A 372 (6), 2008, pp. 841-848", "doi": "10.1016/j.physleta.2007.08.038", "fulltext": "arXiv:nlin/0612005v3 [nlin.PS] 25 Aug 2007\n\nPhysical dynamics of quasi-particles in nonlinear wave equations\nIvan Christov a,∗,1 , C. I. Christov b\na Department\nb Department\n\nof Mathematics, Texas A&M University, College Station, TX 77843-3368, USA\nof Mathematics, University of Louisiana at Lafayette, Lafayette, LA 70504-1010, USA\n\nAbstract\nBy treating the centers of solitons as point particles and studying their discrete dynamics, we demonstrate a new approach to the\nquantization of the soliton solutions of the sine-Gordon equation, one of the first model nonlinear field equations. In particular,\nwe show that a linear superposition of the non-interacting shapes of two solitons offers a qualitative (and to a good approximation\nquantitative) description of the true two-soliton solution, provided that the trajectories of the centers of the superimposed solitons\nare considered unknown. Via variational calculus, we establish that the dynamics of the quasi-particles obey a pseudo-Newtonian\nlaw, which includes cross-mass terms. The successful identification of the governing equations of the (discrete) quasi-particles\nfrom the (continuous) field equation shows that the proposed approach provides a basis for the passage from the continuous to\na discrete description of the field.\nKey words: Solitons, Variational approximation, Quasi-particles, sine-Gordon equation, Nonlinear-wave quantization\nPACS: 05.45.Yv, 11.10.Lm\n\n1. Introduction\nA sought-after property of model field equations is\nthat they possess localized, permanent wave solutions\nthat retain their identity upon interactions with one another. Solitons, which are solutions of fully-integrable\nequations, are an example of such waves. Unfortunately,\nintegrability is not always a property of models that are\nof physical importance. Therefore, it is important to develop simple, albeit approximate, approaches to studying the dynamics of permanent waves in non-integrable\nsystems, for which exact solutions are difficult to obtain.\n\n∗ Corresponding author.\nEmail addresses: christov@alum.mit.edu (Ivan Christov),\nchristov@louisiana.edu (C. I. Christov).\nURL: http://www.ucs.louisiana.edu/~cic6380/ (C. I.\nChristov).\n1 Present address: Department of Engineering Sciences and Applied\nMathematics, Northwestern University, Evanston, IL 60208-3125,\nUSA.\nPreprint submitted to Physics Letters A\n\nThe idea of identifying a localized solution of a nonlinear wave equation with an elementary particle was\nfirst proposed by Perring & Skyrme [1]. They found a\nsolution of (what is known today as) the sine-Gordon\nequation (SGE) [2] consisting of two interacting, localized waves, which is an example of (what is nowadays called) a two-soliton solution, several years before\nthe notion of a soliton was introduced by Zabusky &\nKruskal [3]. Through numerical simulation, the latter\nauthors discovered that the localized traveling-wave solutions of the Korteweg–de Vries equation retain their\nshapes (identities) after they pass through each other (interact). Apparently, Zabusky & Kruskal were unaware\nof the work of Perring & Skyrme [1] and arrived at the\nidea of identifying the nonlinear waves' dynamics with\nthose of particles through experiment rather than conjecture.\nSince their discovery, solitons have attracted an enormous amount of attention. Significant progress has been\nmade in their mathematical description, and their applications have been far-reaching [4,5]. The so-called kink\n2 November 2018\n\n\fsolitary waves considered by Perring & Skyrme [1] have\nbeen shown to be indeed solitons [5,6]. Moreover, the\nrelationship between the particle-like dynamics of the\ncoherent structures that emerge in the solutions of nonlinear wave equations and the field theories of particle\nphysics are well-established in the literature [7,4,8,9].\nFrom a mathematical point of view, we can elucidate\nthe latter relationship by, somehow, reducing the \"infinitely complex\" continuous description of the field to\na \"finitely complex\" discrete description. In this Letter, we show how this can be achieved by studying the\ndynamics of quasi-particles. Our approach amounts to\n\"degrading\" the continuous description of the wave profile to a discrete description of the centers of coherent structures, assuming that the shapes of the coherent structures (for an integrable system, this would simply be the solitons) are not significantly affected by the\neach other's presence. To this end, in this Letter, the\nterm \"quasi-particle\" refers to these permanent, indestructible and virtually non-deformable coherent structures, whose centers can be treated as point particles\nwith mass equal to some associated measure of inertia that we call the pseudomass. Furthermore, replacing\na complicated continuous profile by a superposition of\nlocalized shapes can also be viewed as a coarse-grain\ndescription, in the sense that small deformations and\nwiggles are filtered out from the profile leaving merely\nthe main structure (the \"grains\").\nHence, the coarse-grain description amounts to replacing the solution of a nonlinear wave equation with\na linear superposition of basis states (i.e., travelingwave solutions in their undeformed, or non-interacting,\nstate), then the trajectories of the centers of the superimposed waves, which for a nonlinear equation do not\nfollow the undisturbed (linear) trajectories, are treated\nas unknown. Restricting to the case of just two superimposed waves, a discrete model for the trajectories is\nderived and solved numerically in this Letter. This approach gives a wave profile whose deviation from the\nanalytical two-soliton solution (when available) is orders of magnitude smaller than the characteristic size of\nthe solitons. Consequently, this paves the way to constructing successive approximations that account for the\nhigher-order, nonlinear interactions of solitons.\nHere, we note that our coarse-grain description is a\nspecial interpretation of the more general method of\ncollective coordinates/variables, which has been put on\nsolid theoretical ground [10] and become part of the\ntextbooks on solitons [5]. The latter approach made its\ndebut in the study of resonances and collisions of solitary waves in the so-called φ 4 equation [11,12], a close\nrelative of the SGE, and the study of two-soliton inter-\n\nactions in the SGE [13,14]. Moreover, the method of\ncollective variables is just one type of variational approximation, which is another approach to the analytical study of nonlinear wave equations that has recently\nregained popularity [15,16,17]. Furthermore, it appears\nthat Rice [18] was the first to realize that the collectivecoordinate variational approximation provides a way\nof \"distilling\" the particle-like dynamics of nonlinear\nwaves from the continuos (field) description, though\nKarpman & Solov'ev [13] had the foresight to use the\nterm 'quasi-particle' in their discussion.\nFinally, we note that the nonlinear wave equation featured herein - the sine-Gordon equation - continues\nto be of interest as a model field equation [19]. In addition, various modifications of it have been considered\nin the literature. For example, in order to establish the\neffects of acceleration on the shape of the SGE's solitons, Fogel et al. [20] introduced a driving force into the\nSGE. However, this required also adding dissipation in\nthe field equation in order to stabilize the evolution of\nthe solitons, i.e., to ensure that they reach a steady terminal velocity [20,21]. Adding dissipation opens new\nhorizons of investigation, and different physical mechanisms can be considered as progenitors of the dissipative\nforce. It is well known that, in fluid mechanics, linear\ndissipation of either viscous or Darcy type can balance\nthe nonlinearity in the field equation, and allow stable\nlocalized waves to exist [22,23]. Moreover, in incompressible shallow-water flows, a viscous dissipation can\nallow for the existence of localized coherent structures\nwith solitonic behavior [24]. Nonetheless, one thing is\ncertain: dissipation can alter the behavior of a nonlinear field equation dramatically. Therefore, in this Letter,\nwe focus on the lossless SGE of Perring & Skyrme [1]\nand show that the coarse-grain description of the field\nleads to the physical dynamics of locally-accelerating\nquasi-particles, without introducing a driving force or\ndissipation into the equation. In this respect, however,\nthe SGE differs fundamentally from the modern lossless nonlinear field theories of continuum mechanics\n(see, e.g., Ref. [25] and those therein), since the \"unbalanced\" nonlinearity in the former allows for the creation of localized coherent structures and does not lead\nto formation of singularities in finite time.\n2. The sine-Gordon equation and its soliton\nsolutions\nFor the purposes of this Letter, the SGE takes the\nfollowing dimensionless (h̄ = c = m = 1) form:\nutt − uxx = − sin u,\n2\n\n(1)\n\n\fwhere the subscripts denote partial differentiation. We\nhave selected the SGE as our featuring example because there are known analytical expressions for its twosoliton solutions. This allows us to show that the coarsegrain description is both an effective approximation tool\nand a new method for nonlinear-wave quantization.\nIt is easy to show that the Lagrangian and the Hamiltonian of the SGE read\nZ +∞\n\u0001\n1 2\n1 2\n(2)\nL, H =\n2 ut ∓ 2 ux + 1 − cos u dx,\n−∞\n\nrespectively [2,5], where the \"−\" sign in the right-hand\nside refers to L and the \"+\" sign to H. In addition, the\nwave momentum is defined [7] as\nP=−\n\nZ +∞\n−∞\n\nux ut dx.\n\n(3)\n\nThen, the conservation of the energy and linear momentum require that dH/dt = 0 and dP/dt = 0.\nNow, if we consider the moving frame ξ = x − vt,\nEq. (1) reduces to an ODE, which has the following\nsolution:\n\u0013\u0015\n\u0014 \u0012\nξ\n, 0 ≤ v < 1.\nu = φ (ξ ) = 4 arctan exp √\n1 − v2\n(4)\nNotice that the latter is a one-soliton solution because\n1\n2π [limx→∞ u(x,t) − limx→−∞ u(x,t)] = 1 for all t < ∞\n[2]. The kink, whose shape is termed a hydraulic jump\nin fluid mechanics, is a localized wave in the sense that\nits derivative\n\u0012\n\u0013\n2\nξ\nux = √\nsech √\n(5)\n1 − v2\n1 − v2\n\nFig. 1. (Color online) Space-time plots of the soliton-soliton (top)\nand the soliton-antisoliton (bottom) interaction.\n\nsense because, then, it leads to a discontinuous definition of u+ . But, if the quadrant of the argument of the\ninverse tangent is taken into account, then u+ is welldefined.\nHenceforth, the solutions u+ and u− are referred to\nas the soliton-soliton (S-S) and soliton-antisoliton (SA) solutions, respectively. To justify this terminology,\nwe present the spatial derivatives, which are the quantities of importance in defining the corresponding quasiparticles, of the S-S and S-A solutions in Fig. 1.\nNow, when the two solitons are far from each other\n(as t → +∞), it can be shown that Eq. (6) reduces to\n\u0002\n\u0003\n\u0002\n\u0003\nu± ≡ 4 arctan exp(θ1 + δ1± ) ± 4 arctan exp(θ2 + δ2± ) ,\n(8)\nwhere δ1± = −δ2± = 21 ln |a12 | are the phase shifts [6].\nThe above decomposition means that far from the point\nof collision of the two solitons, the profile is merely\nthe linear superposition of two single solitons [whose\nshapes are identical to the one-soliton profile given by\nEq. (4)]. However, we cannot immediately express the\ntwo-soliton solution as a sum of two single solitons because of the phase shifts, which are, in fact, the most\n\nis a function of finite energy (i.e., it is square-integrable).\nAnother well-known analytical solution of the SGE is\nthe two-soliton solution [6], which can take two distinct\nforms:\n\u001a\n\u001b\ncosh[(θ1 − θ2 )/2]\nu+ = 4 arctan\n,\n(6a)\na12 sinh[(θ1 + θ2 )/2]\n\u001a\n\u001b\nsinh[(θ1 − θ2 )/2]\n,\n(6b)\nu− = 4 arctan\n|a12 | cosh[(θ1 + θ2 )/2]\nwhere, for j ∈ {1, 2},\nθ j = γ j (x − v j t − x j ),\na2j\n\nγ 2j = (1 − v2j )−1 ,\n\n(7a)\n\n= (1 − v j )/(1 + v j ),\n\n(7b)\n\na12 = (a1 − a2 )/(a1 + a2 ).\n\n(7c)\n\nIt is important to note that, due to the multivalued nature of the inverse tangent function, one has to be careful about the definition of u+ . The inverse tangent in\nEq. (6a) should not be taken in the \"principal value\"\n3\n\n\f\"smallness\") of the acceleration is the same as that of\nthe velocity. Under these assumptions the first term in\nEq. (10) can be disregarded because it is of second order\nof \"smallness\" while the second term is of first order.\nIn addition, any explicit dependence of the shape of the\nsoliton on its phase speed is negligible in the classical\nlimit. Finally, we note that the classical approximation\nis valid for speeds up to v ' 0.2.\nThus, under the above assumptions, we get the following simple expressions for the profile and its partial\nderivatives:\n\nconspicuous manifestation of the nonlinearity as far as\ninteracting solitons are concerned. Yet, the actual wave\nprofile is approximated quite well by the mere sum of\none-soliton profiles provided their centers follow trajectories that somehow account for the nonlinear interaction. The technical details and physical underpinning of\nthis approximation are the goal of the this Letter.\nHere, we must note that Bowtell & Stuart [9] developed a method, based on the poles of the Hamiltonian density, that allowed them to compute the exact\n(ODEs for the) trajectories of the centers of the solitons. Their technique has not been applied to any other\nwell-known nonlinear wave equations, which makes the\nSGE unique from the point of view of availability of\nreference solution for the trajectories of the centers to\nestablish the practical applicability of the present approach. However, we emphasize again that we do not\nintend to develop an exact method for computing the\ntrajectories based on particular properties of the governing nonlinear wave equation, rather we show how\nto approximate them based on more general principles.\nThus, the method proposed below is applicable to integrable and non-integrable equations alike.\n\nu = 4 arctan[exp(ξ )], 1 − cos u = 2 sech2 ξ ,\nux = 2 sech ξ , ut = −2Ẋ sech ξ .\n\nThen, by substituting the latter expressions into Eq. (2),\nwe get that the discrete Lagrangian L is\nL = 12 MẊ 2 ,\n\n3. From continuous to discrete dynamics\n\nTo elucidate the concept of a quasi-particle we consider the propagation of a single solitary wave, whose\nshape is given by Eq. (4), centered at certain spatial position x = X(t) (termed the particle trajectory), which\nmay be unknown in advance. Under the latter assumptions we have that\ndef\n\nv(t) = Ẋ(t).\n\nZ +∞\n−∞\n\nsech2 ξ dξ = 8,\n\n(12)\n\nZ +∞\n−∞\n\n−4Ẋ sech2 ξ dξ = MẊ,\n\n(13)\n\nwhich (again) is identical to the momentum of a (point)\nparticle of mass M undergoing inertial motion. To distinguish between the properties of the continuous and\ndiscrete descriptions, we call M the pseudomass and P\nthe pseudomomentum. Hence, Eq. (13) shows that the\nwave momentum of a single solitary wave is the momentum of its \"center,\" if the latter is considered as a\npoint particle endowed with mass M = 8. Of course,\nthis should be of no surprise if the solutions to the SGE\nare to model elementary particles, which obey the principle of wave-particle duality.\nSo far we have used the term \"center of a soliton\"\nwithout defining it. Unfortunately, there is no general\nagreement on the matter, and the center of a coherent\nstructure (e.g., a soliton) has to be defined on a case-bycase basis. A definition is given by Bergman et al. [26]\nbut, as Kaup [27] shows, depending upon the definition\nbeing used, one may obtain that the quasi-particle's dynamics are Newtonian [20] or non-Newtonian [21] -\nclearly, this is quite a discrepancy. In this respect, the\nclosest work to ours is that of Rice [18], who derives\nthe discrete Hamiltonian and Lagrangian for a single\nquasi-particle whose support can be considered an internal parameter of the problem. He comes to the conclusion that the dynamics of a deforming quasi-particle\nare, generally, non-Newtonian, as do we. For the purposes of this Letter, it suffices to define the center of\n\n3.1. One-soliton case\n\nξ = x − X(t),\n\ndef\n\nM=4\n\nwhich is identical to the Lagrangian of a particle of mass\nM undergoing inertial motion. Similarly, we obtain, by\nsubstituting Eqs. (11) into Eq. (3), that the discrete wave\nmomentum P is just\nP=−\n\nu(x,t) = φ (ξ ),\n\n(11)\n\n(9)\n\nConsequently, the time derivative of wave profile is\n\u0015\n\u0014\n\u0015\n\u0014\nv\nx − X(t)\nx − X(t)\nvv̇ − √\nsech √\n.\nut = 2 √\n( 1 − v2 )3\n1 − v2\n1 − v2\n(10)\nNow, the straightforward way to compute the discrete\nLagrangian and Hamiltonian for the motion of the center of the soliton is to insert Eqs. (5) & (10) into Eq. (2)\nand to integrate over the infinite domain. However, in\norder not to obscure the main idea of the present work,\nwe restrict ourselves to the non-relativistic (or classical) approximation, i.e., Ẋ ≡ v \u001c 1 ⇒ v2 ≪ 1 (small\nphase speed) and Ẍ ≡ v̇ = O(v) (small phase acceleration). This means that the speed of the quasi-particle\nis much smaller than the characteristic speed of the\nequation (i.e., unity) and that the asymptotic order (of\n4\n\n\fa coherent structure u as the point where ux attains its\nmaximum (recall Fig. 1), and that is precisely where\nthe corresponding quasi-particle should be located. Note\nthat, for the SGE solitons, this also corresponds to the\ninflection point of u(*,t), which is always located at x∗\nsuch that uxx (x∗ ,t) = 0.\n\nNow, we show how the trajectories of the quasiparticles [as quantified by the functions X1 (t) and X2 (t)]\ncan be calculated. First, recall that we are working in\nthe classical limit so we can neglect the dependence of\na soliton's shape on its phase speed and use the undeformed (non-interacting) shape of the soliton in the caldef\nculation. Thus, after setting Φ1 = Φ2 = Φ, neglecting\nthe term Φ12 in Eq. (14) and acknowledging Eq. (8), we\narrive at the following simple ensemble of two waves\nas the coarse-grain approximation:\n\n3.2. Two-soliton case\nContinuing on to the two-soliton case, we first note\nthat one can formally represent any two-soliton (twowave, if the equation is non-integrable) solution of the\nfield equations as the combination of the undeformed\n(non-interacting) shapes of two solitary waves Φ1 , Φ2\nand an arbitrary disturbance term Φ12 due to the interaction of the latter two:\n\nu± (x,t) = Φ[x − X1 (t)] ± Φ[x − X2 (t)],\nΦ(ζ ) = 4 arctan[exp(ζ )],\n\n(15)\n\nwhere the \"+\" and \"−\" sign follow the convention set\nforth in Eq. (6). Then, the first partial derivatives of the\nwave profile u± are just\nut± (x,t) = −Ẋ1 Φ0 [x − X1 (t)] ∓ Ẋ2 Φ0 [x − X2 (t)], (16a)\nu±\nx (x,t) =\n\nu(x,t) = Φ1 [x − X1 (t)] + Φ2 [x − X2 (t)]\n+ Φ12 [x − X1 (t), x − X2 (t)]. (14)\n\nΦ0 [x − X1 (t)] ±\n\nΦ0 [x − X2 (t)]. (16b)\n\nHenceforth, we leave the time dependence of X1 and\nX2 implicit to simplify the notation. Consequently, the\nkinetic energy term of the Lagrangian, for both u+ and\nu− (denoted simply by u), reads\n\nIn fact, one can think of Φ12 as the difference between\nthe full two-soliton solution given by Eq. (6) and the linear superposition of two single soliton given by Eq. (8),\nwith properly selected trajectories that are unknown in\nadvance.\nThe two first terms of Eq. (14) give a linear superposition that is bound to be a poor quantitative description\nof interaction of two nonlinear waves when they overlap\nsignificantly. Indeed, it is well-known that, e.g., for the\nKorteweg–de Vries equation, the maximal amplitude of\na two-soliton solution is much smaller than the sum of\nthe maximal amplitudes of the individual solitons [5].\nBut, a linear superposition along two undisturbed trajectories Xi (t) = Xi (0) + vit would give a maximal amplitude equal to the sum of the two maximal amplitudes.\nThe main idea of the present work is that if the\ntrajectories Xi (t) are selected in a specific manner,\nthen the predominant part of the nonlinear effects,\nrepresented by Φ12 in Eq. (14), in the two-soliton solution can be recovered by the linear superposition\nalone, i.e., Eq. (14) with Φ12 neglected. That is to say,\nfor properly chosen trajectories, one has max |Φ12 | <\nε max{max |Φ1 |, max |Φ2 |} for some small ε(> 0). It\nis not know in advance how small ε is, but one can\nestimate it a posteriori and vindicate the approximation. We do so by comparison to the exact solution of\nthe problem, but one can also judge the quality of the\napproximation, without any knowledge of the exact solution, by the novel method of Kaup & Vogel [28]. The\nlatter will be necessary when the governing equation is\nnon-integrable and the former approach fails.\n\nZ +∞\n−∞\n\n1 2\n2 ut dx\n\n= 12 M11 X12 + 21 M22 X22\n+ M12 (X2 − X1 )Ẋ1 Ẋ2 , (17)\n\nwhere the pseudomasses Mi j (i, j ∈ {1, 2}) are given by\ndef\n\nM12 (X2 − X1 ) = ±\n\nZ +∞\n\n= ±4\n\nΦ0 (x − X1 )Φ0 (x − X2 ) dx\n\n−∞\nZ +∞\n−∞\n\nsech(x − X1 ) sech(x − X2 ) dx\n\n= ±8(X2 − X1 ) csch(X2 − X1 ),\n(18a)\nZ +∞\ndef\n\nMii =\n\n−∞\n\n[Φ0 (ξi )]2 dx = 4\n\nZ +∞\n−∞\n\nsech2 ξi dξi = 8,\n(18b)\n\nand ξi = x − Xi .\nSimilarly, we can compute the interaction potential\n(i.e., the remaining terms of the Lagrangian). First, we\nnote that\n\b\n2\n2\n1 2\n2 ux + 1 − cos u = 4 sech (x − X1 ) + sech (x − X2 )±\n[cosh(2x−X1 −X2 )−1] sech2 (x−X1 ) sech2 (x−X2 ) .\n(19)\nThen, by integrating the latter [Eq. (19)] over space 2 ,\nwe find that the potential energy of interaction is\n2\n\nThese integrals are rather difficult, thus we refer the reader to\nthe appendices of Ferguson & Willis [14] and Sugiyama [11] for\nexplicit formulae and hints.\n\n5\n\n\fdef\n\nU(z) = 16 ± 4 csch3\n\n1\n2z\n\n\u0001\n\nsech\n\ndef\n\nẌ1 = U 0 (z)Ξ(z)(M22 + M12 ) =\n\n1\n2z\n\n\u0001\n(sinh z − z), (20)\n\ndef\n\nand we have set z = X2 − X1 for convenience. Consequently, combining the above computations, we obtain\nthe discrete Lagrangian by substituting the coarse-grain\napproximation, given by Eq. (15), into Eq. (2), namely\n\n(24a)\n\nẌ2 = −U (z)Ξ(z)(M11 + M12 ) = −G(z),\n\n(24b)\n\nwhere\n\u0001−1\n= 64 − 64z2 csch2 z\n(25)\nfor the case when M11 = M22 . For this same situation,\nthe \"mathematical\" (or effective) force per unit mass\ntakes the form\ndef\n\nΞ(z) = M11 M22 − M212\n\nL = 12 M11 Ẋ12 + M12 (z)Ẋ1 Ẋ2 + 12 M22 Ẋ22 −U(z) (21)\nThus, we can use the Euler–Lagrange equations for\nthe extremization of the discrete Lagrangian to find the\ngoverning system of equations for the centers of the\nsolitons (i.e., the quasi-particles), namely\n\n\u0001−1\n\nG(z) = ±[z − 2 sinh z − (sinh z − 2z) cosh z]\n\u0001\n\u0001\n× 2 csch4 12 z sech2 12 z /(8 ∓ 8z csch z), (26)\n\n\u0001 d\u0002\n\u0003\nd\nM11 Ẋ1 +\nM12 (z)Ẋ2 + M012 (z)Ẋ1 Ẋ2 = U 0 (z),\ndt\ndt\n(22a)\n\u0002\n\u0003\n\u0001\nd\nd\nM12 (z)Ẋ1 +\nM22 Ẋ2 − M012 (z)Ẋ1 Ẋ2 = −U 0 (z).\ndt\ndt\n(22b)\n\nwhere the \"+\" and \"−\" sign still refer to the solitonsoliton and soliton-antisoliton case, respectively. Here,\nit should be noted that the asymptotic behavior of the\nright-hand side, as z → 0, is G(z) ∼ z−1 for the S-S case\nand G(z) ∼ z for the S-A case. The singularity (i.e.,\nthe infinite repulsion) in the S-S case is precisely what\nprevents the trajectories of the quasi-particles (solitons)\nfrom crossing each other.\nFinally, we note that Ferguson & Willis [14] previously performed a number of calculations, in the context\nof Josephson junctions, similar to the ones presented\nabove. Nonetheless, our results are novel because we\npropose a very different understanding of the results obtained by the collective-variable method, one that has\nfundamental physical meaning [embodied by Eqs. (23)].\n\nFinally, recalling that Mii are constants, Ẋi2 \u001c 1 for i ∈\n{1, 2}, and using the chain rule for differentiation, we\ncan recast the above system into\nM11 Ẍ1 + M12 (z)Ẍ2 = U 0 (z),\nM12 (z)Ẍ1 + M22 Ẍ2 = −U 0 (z).\n\nG(z),\n\ndef\n\n0\n\n(23a)\n(23b)\n\nThe most conspicuous trait of the above equation of\nmotion is that it is not Newtonian per se. It reflects\nthe fact that the inertia of each particle is affected by\nthe presence of another (accelerating) particle in its\nvicinity 3 . Therefore, it is more appropriate to refer to\nsuch pseudo-Newtonian dynamics as Machean. Here,\nby \"Machean dynamics\" we mean those that satisfy a\nlocal version of Mach's principle, which is the hypothesis that the inertia of a body depends not only upon its\nmass but also upon the quantity, distribution and relative motion of matter in its viscinity [30]. In Eqs. (23)\nthis effect manifests itself through the terms whose coefficient is M12 (z). In fact, the crossmass M12 (z) gives\nrise to an interaction between the quasi-particles similar to the interaction due to the potential U(z), so the\ndiscrete kinetic and potential energies (i.e., those of the\nquasi-particles) are not in one-to-one correspondence\nwith their continuous counterparts (i.e., those of the\nsolitons).\nNow, it is convenient to render Eqs. (23) into \"Newtonian form\" by resolving them with respect to the second time derivatives of each quasi-particle, namely\n\n4. Numerical results\n4.1. Quasi-particle dynamics\nIn this section, we provide numerical results, based\non the coarse-grain description of the soliton-soliton\nand soliton-antisoliton interactions, and benchmark\nthem against the exact results in [9]. Though a quantitative comparison cannot be made because no scales\nare provided on the plots in [9], we can still perform a\nqualitative comparison.\nIt is clear that the system given by Eqs. (24) can be\nreduced to a single differential equation governing the\nevolution of the distance between the quasi-particles,\ni.e., X2 − X1 . Then, upon obtaining the solution for\nX2 − X1 , one can go back and solve Eqs. (24) for each\nindividual trajectory. For the sake of simplicity, and\nconvenience in comparing the results to the analytical\ntwo-soliton solution, we consider here the case of two\nquasi-particles whose initial phase speeds and positions\nare equal in magnitude but differ in sign. Consequently,\nwe have\n\n3\n\nThis should not alarm the reader, as it is now generally accepted\nthat Newton's concept of inertia and his second law of motion are\nmerely the starting point for modern theories (see, e.g., Ref. [29]\nand those therein), not the end-all.\n\n6\n\n\fx\n\nX1 (t) = Y (t),\nX2 (t) = −Y (t),\n(27a)\nX1 (0) = Y (0) = −x0 , X2 (0) = −Y (0) = x0 , (27b)\nẊ1 (0) = Ẏ (0) = v0 , Ẋ2 (0) = −Ẏ (0) = −v0 , (27c)\n\n6\n4\n2\n\nand, clearly, X2 (t)−X1 (t) ≡ −2Y (t). Now, we can combine Eqs. (24) and (27) to obtain the following initialvalue the problem for Y (t):\nŸ = G(−2Y ),\n\nY (0) = −x0 ,\n\nẎ (0) = v0 .\n\nt\n\n0\n-2\n\n(28)\n\n-4\n\nThe analytic expression for the effective force (per unit\nmass) G(z) is known and given by Eq. (26), so we\ncan use any standard numerical ODE integration algorithm, e.g., M ATHEMATICA's NDSolve, to solve the initial value problem for Y (t) given in Eq. (28). Naturally,\nwhen the function Y (t) is obtained numerically, we can\nrecover the trajectories of the two quasi-particles.\nFor the initial phase speed, we select a value that\nfalls within the classical limit, namely v0 = 0.1. Respectively, we choose an initial position of x0 = 6, which\nverifies the assumption that (initially) the interaction\nbetween the two solitons is insignificant, i.e., they are\nwell-separated.\nFig. 2 presents the results for the S-S (top) and SA (bottom) solutions. Recall that we defined the centers of the solitons, i.e., the points where ux has a local\nmaximum (see Fig. 1), as the locations of their corresponding quasi-particles. So, the difference between the\nstraight lines in Fig. 2, which represent the trajectories\nfollowed by two non-interacting quasi-particles (solitons), i.e., Xi = ∓x0 ± v0t, and the actual trajectories\nat the time when the quasi-particles (solitons) return to\ntheir initial positions gives their phase shifts.\nFor the S-S case, according to the numerical solution,\nthe time needed for the quasi-particles to return to their\nstarting position [i.e., t ∗ 6= 0 such that Y (t ∗ ) = Y (0)] is\nt ∗ = 74.0355. On the other hand, the time needed for\nthe latter quasi-particles to reach the same spatial positions would be t ∗ = 120 in the absence of interaction\nbetween the two quasi-particles. Hence, the interacting quasi-particles return to their initial positions ∆t =\n120 − 74.0355 = 45.9645 dimensionless time units earlier than their non-interacting counterparts. Thus, if the\nnon-interacting quasi-particles were to return to their\ninitial positions at the same time as the interacting ones,\nthe former would have to have been separated by a distance v0 ∆t = 0.1 × 45.9645 = 4.59645 smaller than the\nactual distance of 12 dimensionless length units (see\nFig. 2). Therefore, half of this number, 2.29823, is precisely the phase shift of each quasi-particle. At the same\ntime, substituting the values of the initial phase speed\n(i.e., v0 = 0.1) in Eqs. (7) & (8), we can compute the\nexact phase shift of each of the solitons in the full two-\n\n10\n\n20\n\n30\n\n40\n\n50\n\n60\n\n70\n\nx\n6\n4\n2\n\nt\n\n0\n-2\n-4\n10\n\n20\n\n30\n\n40\n\n50\n\n60\n\n70\n\nFig. 2. (Color online) The thick solid lines represent the trajectories\nof the interacting quasi-particles (as calculated from coarse-grain\ndescription) are shown for the S-S case (top) and the S-A case (bottom). The dashed lines represent the trajectories of two non-interacting quasi-particles (solitons). And, the thin solid lines represent\nthe location of the inflection points of the two-soliton solution.\n\nsoliton solution (for both the S-S and S-A case):\nδ1 = −δ2 = 2.30259.\n\n(29)\n\nClearly, the phase shift we obtained from our numerical\ncomputation is in very good quantitative agreement with\nthe exact one - the difference is merely 0.2%.\nFor the S-A case, the solution for the trajectory is\nshown in Fig. 2 (bottom). The time needed for the\nquasi-particles to swap their positions after their interaction is t ∗ = 75.9069, which is ∆t = 120 − 75.9069 =\n44.0931 units earlier than their non-interacting counterparts. Therefore, the phase shift of each quasi-particle\nis 2.20466, which gives a relative error between the\napproximate and exact phase shifts of 4%. Indeed, in\nthis case, the approximation is supposed to be generally worse than in the S-S case, since in the S-A case\nthe solitons overlap significantly and their velocities get\nlarge. This will become clear in the next section.\nThus, the coarse-grain description gives a good,\nquantitative account of the trajectories of the centers of\nsolitons (i.e., the location of the corresponding quasiparticles). This provides further support for the claim\nthat solitons are indeed particle-like objects and, to a\ngood approximation, they can be considered as point\n7\n\n\fparticles obeying pseudo-Newtonian dynamics.\n4.2. Soliton dynamics\nApart from the significance of the present work\nas tool for studying the discrete dynamics of quasiparticles corresponding to solitons, our results also\nshow that the coarse-grain description is a practical way\nof constructing approximate wave-train solutions (two\nwaves in this Letter but, eventually, N) of nonlinear\nwave equations. This is of great importance for nonintegrable systems where analytical expressions for\nwave-train solutions are not available. Here, we outline\nthe quantitative limits of this kind of approximation\nby comparing our results to the analytical two-soliton\nsolution of the SGE.\nTo this end, we compute the difference between the\nanalytical solution, given in Eqs. (6), and the coarsegrain approximation, given by Eq. (15), presented in the\nprevious section. Fig. 3 (top) shows the results for the\nS-S case, where the maximal pointwise error is found\nto be ≈ 0.028, which corresponds to a relative error of\n0.028/(4π) ≈ 0.23%. In addition, we note that, for the\nS-S case, the maximum of the phase speed occurs at the\ninitial instant of time, hence the speeds of the solitons\n(and quasi-particles) remain classical for all times under\nconsideration.\nThe S-A case is depicted in Fig. 3 (bottom) and the\nmaximal pointwise error for this case is ≈ 0.73, which\ncorresponds to a relative error of 0.73/(2π) ≈ 12%. The\nreason the error for the S-A case is an order of magnitude larger than the errors for the S-S case is that the\nassumption of classical speeds is no longer justified.\nIn particular, the attraction between the quasi-particles\nincreases their velocities (i.e., the phase speeds of the\ncorresponding solitons) significantly. As a result, we\nhave maxt v(t) = Ẋ1 (37.9534) = 0.675316, which is no\nlonger small in comparison to unity. Nonetheless, even\nwith the relativistic effects ignored, the error in the\napproximation (away from the point where the quasiparticles annihilate each other) is small enough so that\nthe coarse-grain description is in good agreement with\nthe exact two-soliton solution.\nHere, we note that, for the purposes of these comparisons, we have eliminated any phase error by evaluating the two-soliton solution at t − θ ± , where θ ± is the\nphase error committed by the approximation. Thus, the\ninstant of time when the quasi-particles are closest (S-S\ncase) or pass through (S-A case) each other predicted\nby the coarse-grain description is the same as the one\ngiven by the analytical solution. We found that θ + =\n\nFig. 3. (Color online) Space-time plots of the absolute value of\nthe difference between the exact two-soliton solution and the linear\nsuperposition of two single solitons following the calculated trajectories for the S-S case (top) and S-A case (bottom).\n\n−0.0660218 for the S-S case and θ − = 0.858073 for the\nS-A case. Finally, to make sure the quasi-particles and\nthe solitons start at the same place, we had to take, in the\nanalytical solution given in Eqs. (6), x1,2 = ∓3.70838\nfor the S-S case and x1,2 = ∓3.70954 for the S-A case.\n5. Conclusions\nAn approximate approach to the construction of twosoliton solutions of nonlinear wave equations is discussed. It consist of considering the linear superposition\nof the non-interacting (or inertially-propagating) shapes\nof two single solitons following trajectories that are unknown in advance. On the basis of the variational formulation of the field problem, a discrete Lagrangian is derived that governs the trajectories of the corresponding\nquasi-particles (i.e., the point-particles endowed with\ncertain mass located at the position of the center of a\nsoliton).\nThe approach was validated using the celebrated sine8\n\n\fGordon equation, which has analytical two-soliton solutions and the dynamics of the corresponding quasiparticles have been investigate. By numerically integrating the ODEs that govern the trajectories of the quasiparticles, we constructed an approximate two-soliton\nprofile, showing that the quasi-particles obey a pseudoNewtonian, more precisely Machean, law. Then, the\nquasi-particle dynamics and the coarse-grain solution\nwere compared to the exact dynamics [9] and the analytical two-soliton solution, respectively. In both cases,\nexcellent quantitative and qualitative agreement was obtained. Furthermore, the present results can easily be\nextended to the relativistic case by including another\ncollective-coordinate that governs the width of the wave\n[18,14].\nFinally, we emphasize that the collective-coordinate/variable (or variational approximation) type of\napproach discussed herein is an effective technique for\nstudying the two-soliton solutions of equations that are\nnot fully-integrable. Therefore, our interpretation of the\nmethod - i.e., the idea of a coarse-grain description -\ncan shed light on the passage form the continuous to a\ndiscrete description of the dynamics (i.e., the quantization) of nonlinear dispersive waves, their relation to the\nelementary particles and the concept of wave-particle\nduality for more than just the \"classical\" (integrable)\nequations of soliton theory.\n\n[7] G. A. Maugin, C. I. Christov, Nonlinear duality between elastic\nwaves and quasi-particles, in: C. I. Christov, A. Guran (Eds.),\nSelected Topics in Nonlinear Wave Mechanics, Birkhäuser,\nBoston, 2002, pp. 117–152.\n[8] D. J. Kaup, A. C. Newell, Solitons as particles, oscillators, and\nin slowly changing media: a singular perturbation theory, Proc.\nR. Soc. Lond. A 361 (1978) 413–446.\n[9] G. Bowtell, A. E. G. Stuart, Interacting sine-Gordon solitons\nand classical particles: A dynamic equivalence, Phys. Rev. D\n15 (1977) 3580–3591.\n[10] R. Boesch, P. Stancioff, C. R. Willis, Hamiltonian equations for\nmultiple collective-variable theories of nonlinear Klein–Gordon\nequations: A projection-operator approach, Phys. Rev. B 38\n(1988) 6713–6735.\n[11] T. Sugiyama, Kink-antikink collisions in the two-dimensional\nφ 4 model, Prog. Theor. Phys. 61 (1979) 1550–1563.\n[12] D. K. Campbell, J. F. Schonfeld, C. A. Wingate, Resonance\nstructure in kink-antikink interactions in φ 4 theory, Physica 9D\n(1983) 1–32.\n[13] V. I. Karpman, V. V. Solov'ev, A perturbation approach to the\ntwo-soliton systems, Physica 3D (1981) 487–502.\n[14] C. D. Ferguson, C. R. Willis, One- and two-collective variable\ndescriptions of two interacting sine-Gordon kinks, Physica D\n119 (1998) 283–300.\n[15] D. J. Kaup, B. A. Malomed, Variational principle for the\nZakharov–Shabat equations, Physica D 84 (1995) 319–328.\n[16] B. Malomed, M. I. Weinstein, Soliton dynamics in the discrete\nnonlinear Schrödinger equation, Phys. Lett. A 220 (1996) 91–\n96.\n[17] D. J. Kaup, Variational solutions for the discrete nonlinear\nSchrödinger equation, Math. Comput. Simul. 69 (2005) 322–\n333.\n[18] M. J. Rice, Physical dynamics of solitons, Phys. Rev. B 28\n(1983) 3587–3589.\n[19] S. Y. Lou, H.-C. Hu, X.-Y. Tang, Interactions among periodic\nwaves and solitary waves of the (N + 1)-dimensional sineGordon field, Phys. Rev. E 71 (2005) 036604.\n[20] M. B. Fogel, S. E. Trullinger, A. R. Bishop, J. A.\nKrumhansl, Dynamics of sine-Gordon solitons in the presence\nof perturbations, Phys. Rev. B 15 (1977) 1578–1592.\n[21] G. Reinisch, J. C. Fernandez, Specific sine-Gordon solution\ndynamics in the presence of external driving forces, Phys. Rev.\nB. 24 (1981) 835–844.\n[22] P. M. Jordan, An analytical study of Kuznetsov's equation:\ndiffusive solitons, shock formation, and solution bifurcation,\nPhys. Lett. A 326 (2004) 77–84.\n[23] P. M. Jordan, Finite-amplitude acoustic traveling waves in\na fluid that saturates a porous medium: Acceleration wave\nformation, Phys. Lett. A 355 (2006) 216–221.\n[24] C. I. Christov, M. G. Velarde, Dissipative solitons, Physica D\n86 (1995) 323–347.\n[25] J. Jaisaardsuetrong, B. Straughan, Thermal waves in a rigid\nheat conductor, Phys. Lett. A 366 (2007) 433–436.\n[26] D. J. Bergman, E. Ben-Jacob, Y. Imry, K. Maki, Sine-Gordon\nsolitons: Particles obeying relativistic dynamics, Phys. Rev. A\n27 (1983) 3345–3348.\n[27] D. J. Kaup, Comment on \"Specific sine-Gordon dynamics in\nthe presence of external driving forces\", Phys. Rev. B 29 (1984)\n1072–1074.\n[28] D. J. Kaup, T. K. Vogel, Quantitative measurement of variational\napproximations, Phys. Lett. A 362 (2007) 289–297.\n\nAcknowledgments The authors would like to thank\nProf. C. R. Willis for bringing to their attention recent\nwork on the collective-variable approach for two-soliton\nsolutions. All figures appearing in this Letter were generated using the software package M ATHEMATICA (Version 5.2).\n\nReferences\n[1] J. K. Perring, T. H. R. Skyrme, A model unified field equation,\nNuclear Physics 31 (1962) 550–555.\n[2] J. Rubinstein, Sine-Gordon equation, J. Math. Phys. 11 (1970)\n258–266.\n[3] N. J. Zabusky, M. D. Kruskal, Interaction of \"solitons\" in a\ncollisionless plasma and the recurrence of initial states, Phys.\nRev. Lett. 15 (1965) 240–243.\n[4] A. T. Filippov, The Versatile Soliton, Birkhäuser, Boston, 2000.\n[5] T. Dauxois, M. Peyrard, Physics of Solitons, Cambridge\nUniversity Press, Cambridge, 2006.\n[6] R. K. Bullough, P. J. Caudrey, The soliton and its history, in:\nR. K. Bullough, P. J. Caudrey (Eds.), Solitons, Vol. 17 of Topics\nin Current Physics, Springer-Verlag, Berlin, 1980, pp. 1–64.\n\n9\n\n\f[29] G. W. Milton, J. R. Willis, On modifications of Newton's second\nlaw and linear continuum elastodynamics, Proc. R. Soc. A 463\n(2007) 855–880.\n[30] D. Kleppner, R. Kolenkow, An Introduction to Mechanics,\nMcGraw-Hill, New York, 1973.\n\n10\n\n\f"}