{"id": "http://arxiv.org/abs/nucl-th/0701097v1", "guidislink": true, "updated": "2007-01-31T16:55:33Z", "updated_parsed": [2007, 1, 31, 16, 55, 33, 2, 31, 0], "published": "2007-01-31T16:55:33Z", "published_parsed": [2007, 1, 31, 16, 55, 33, 2, 31, 0], "title": "Progress in Understanding the Nuclear Equation of State at the Quark\n  Level", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=nucl-th%2F0005019%2Cnucl-th%2F0005071%2Cnucl-th%2F0005013%2Cnucl-th%2F0005020%2Cnucl-th%2F0005068%2Cnucl-th%2F0005043%2Cnucl-th%2F0005057%2Cnucl-th%2F0005007%2Cnucl-th%2F0005064%2Cnucl-th%2F0005032%2Cnucl-th%2F0005051%2Cnucl-th%2F0005072%2Cnucl-th%2F0005008%2Cnucl-th%2F0005012%2Cnucl-th%2F0005055%2Cnucl-th%2F0005034%2Cnucl-th%2F0005022%2Cnucl-th%2F0005006%2Cnucl-th%2F0005036%2Cnucl-th%2F0005011%2Cnucl-th%2F0005059%2Cnucl-th%2F0005073%2Cnucl-th%2F0005029%2Cnucl-th%2F0005004%2Cnucl-th%2F0005038%2Cnucl-th%2F0005066%2Cnucl-th%2F0005005%2Cnucl-th%2F0005063%2Cnucl-th%2F0005058%2Cnucl-th%2F0005027%2Cnucl-th%2F0005040%2Cnucl-th%2F0005056%2Cnucl-th%2F0005014%2Cnucl-th%2F0005025%2Cnucl-th%2F0005031%2Cnucl-th%2F0005028%2Cnucl-th%2F0005046%2Cnucl-th%2F0005002%2Cnucl-th%2F0005050%2Cnucl-th%2F0005074%2Cnucl-th%2F0005039%2Cnucl-th%2F0005060%2Cnucl-th%2F0005015%2Cnucl-th%2F0005044%2Cnucl-th%2F0005030%2Cnucl-th%2F0005048%2Cnucl-th%2F0005017%2Cnucl-th%2F0005016%2Cnucl-th%2F0005035%2Cnucl-th%2F0005010%2Cnucl-th%2F0005003%2Cnucl-th%2F0005023%2Cnucl-th%2F0005047%2Cnucl-th%2F0005033%2Cnucl-th%2F0005041%2Cnucl-th%2F0701034%2Cnucl-th%2F0701044%2Cnucl-th%2F0701059%2Cnucl-th%2F0701039%2Cnucl-th%2F0701011%2Cnucl-th%2F0701042%2Cnucl-th%2F0701032%2Cnucl-th%2F0701070%2Cnucl-th%2F0701020%2Cnucl-th%2F0701091%2Cnucl-th%2F0701055%2Cnucl-th%2F0701097%2Cnucl-th%2F0701014%2Cnucl-th%2F0701015%2Cnucl-th%2F0701040%2Cnucl-th%2F0701002%2Cnucl-th%2F0701081%2Cnucl-th%2F0701086%2Cnucl-th%2F0701026%2Cnucl-th%2F0701010%2Cnucl-th%2F0701009%2Cnucl-th%2F0701023%2Cnucl-th%2F0701092%2Cnucl-th%2F0701065%2Cnucl-th%2F0701072%2Cnucl-th%2F0701006%2Cnucl-th%2F0701071%2Cnucl-th%2F0701021%2Cnucl-th%2F0701004%2Cnucl-th%2F0701056%2Cnucl-th%2F0701012%2Cnucl-th%2F0701074%2Cnucl-th%2F0701062%2Cnucl-th%2F0701033%2Cnucl-th%2F0701018%2Cnucl-th%2F0701031%2Cnucl-th%2F0701084%2Cnucl-th%2F0701080%2Cnucl-th%2F0701050%2Cnucl-th%2F0701022%2Cnucl-th%2F0701060%2Cnucl-th%2F0701029%2Cnucl-th%2F0701067%2Cnucl-th%2F0701037%2Cnucl-th%2F0701058%2Cnucl-th%2F0701030&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Progress in Understanding the Nuclear Equation of State at the Quark\n  Level"}, "summary": "At the present time there is a lively debate within the nuclear community\nconcerning the relevance of quark degrees of freedom in understanding nuclear\nstructure. We outline the key issues and review the impressive progress made\nrecently within the framework of the quark-meson coupling model. In particular,\nwe explain in quite general terms how the modification of the internal\nstructure of hadrons in-medium leads naturally to three- and four-body forces,\nor equivalently, to density dependent effective interactions.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=nucl-th%2F0005019%2Cnucl-th%2F0005071%2Cnucl-th%2F0005013%2Cnucl-th%2F0005020%2Cnucl-th%2F0005068%2Cnucl-th%2F0005043%2Cnucl-th%2F0005057%2Cnucl-th%2F0005007%2Cnucl-th%2F0005064%2Cnucl-th%2F0005032%2Cnucl-th%2F0005051%2Cnucl-th%2F0005072%2Cnucl-th%2F0005008%2Cnucl-th%2F0005012%2Cnucl-th%2F0005055%2Cnucl-th%2F0005034%2Cnucl-th%2F0005022%2Cnucl-th%2F0005006%2Cnucl-th%2F0005036%2Cnucl-th%2F0005011%2Cnucl-th%2F0005059%2Cnucl-th%2F0005073%2Cnucl-th%2F0005029%2Cnucl-th%2F0005004%2Cnucl-th%2F0005038%2Cnucl-th%2F0005066%2Cnucl-th%2F0005005%2Cnucl-th%2F0005063%2Cnucl-th%2F0005058%2Cnucl-th%2F0005027%2Cnucl-th%2F0005040%2Cnucl-th%2F0005056%2Cnucl-th%2F0005014%2Cnucl-th%2F0005025%2Cnucl-th%2F0005031%2Cnucl-th%2F0005028%2Cnucl-th%2F0005046%2Cnucl-th%2F0005002%2Cnucl-th%2F0005050%2Cnucl-th%2F0005074%2Cnucl-th%2F0005039%2Cnucl-th%2F0005060%2Cnucl-th%2F0005015%2Cnucl-th%2F0005044%2Cnucl-th%2F0005030%2Cnucl-th%2F0005048%2Cnucl-th%2F0005017%2Cnucl-th%2F0005016%2Cnucl-th%2F0005035%2Cnucl-th%2F0005010%2Cnucl-th%2F0005003%2Cnucl-th%2F0005023%2Cnucl-th%2F0005047%2Cnucl-th%2F0005033%2Cnucl-th%2F0005041%2Cnucl-th%2F0701034%2Cnucl-th%2F0701044%2Cnucl-th%2F0701059%2Cnucl-th%2F0701039%2Cnucl-th%2F0701011%2Cnucl-th%2F0701042%2Cnucl-th%2F0701032%2Cnucl-th%2F0701070%2Cnucl-th%2F0701020%2Cnucl-th%2F0701091%2Cnucl-th%2F0701055%2Cnucl-th%2F0701097%2Cnucl-th%2F0701014%2Cnucl-th%2F0701015%2Cnucl-th%2F0701040%2Cnucl-th%2F0701002%2Cnucl-th%2F0701081%2Cnucl-th%2F0701086%2Cnucl-th%2F0701026%2Cnucl-th%2F0701010%2Cnucl-th%2F0701009%2Cnucl-th%2F0701023%2Cnucl-th%2F0701092%2Cnucl-th%2F0701065%2Cnucl-th%2F0701072%2Cnucl-th%2F0701006%2Cnucl-th%2F0701071%2Cnucl-th%2F0701021%2Cnucl-th%2F0701004%2Cnucl-th%2F0701056%2Cnucl-th%2F0701012%2Cnucl-th%2F0701074%2Cnucl-th%2F0701062%2Cnucl-th%2F0701033%2Cnucl-th%2F0701018%2Cnucl-th%2F0701031%2Cnucl-th%2F0701084%2Cnucl-th%2F0701080%2Cnucl-th%2F0701050%2Cnucl-th%2F0701022%2Cnucl-th%2F0701060%2Cnucl-th%2F0701029%2Cnucl-th%2F0701067%2Cnucl-th%2F0701037%2Cnucl-th%2F0701058%2Cnucl-th%2F0701030&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "At the present time there is a lively debate within the nuclear community\nconcerning the relevance of quark degrees of freedom in understanding nuclear\nstructure. We outline the key issues and review the impressive progress made\nrecently within the framework of the quark-meson coupling model. In particular,\nwe explain in quite general terms how the modification of the internal\nstructure of hadrons in-medium leads naturally to three- and four-body forces,\nor equivalently, to density dependent effective interactions."}, "authors": ["AW Thomas", "PAM Guichon"], "author_detail": {"name": "PAM Guichon"}, "author": "PAM Guichon", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/j.nuclphysa.2006.12.061", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/nucl-th/0701097v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/nucl-th/0701097v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Invited presentation at XXX Symposium on Nuclear Physics, Hacienda\n  Cocoyoc, Jan. 3-6, 2007", "arxiv_primary_category": {"term": "nucl-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "nucl-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/nucl-th/0701097v1", "affiliation": "CEA Saclay", "arxiv_url": "http://arxiv.org/abs/nucl-th/0701097v1", "journal_reference": null, "doi": "10.1016/j.nuclphysa.2006.12.061", "fulltext": "Progress in Understanding the Nuclear Equation of State at the Quark Level\nA.W. Thomas1,2 and P.A.M. Guichon3\nThomas Jefferson National Accelerator Facility,\n12000 Jefferson Ave., Newport News, VA 23606, USA\n2\nCollege of William and Mary, Williamsburg, VA 23187, USA\n3\nSPhN-DAPNIA, CEA Saclay, F91191 Gif sur Yvette, France\n1\n\narXiv:nucl-th/0701097v1 31 Jan 2007\n\nAt the present time there is a lively debate within the nuclear community concerning the relevance\nof quark degrees of freedom in understanding nuclear structure. We outline the key issues and review\nthe impressive progress made recently within the framework of the quark-meson coupling model.\nIn particular, we explain in quite general terms how the modification of the internal structure\nof hadrons in-medium leads naturally to three- and four-body forces, or equivalently, to density\ndependent effective interactions.\n\nI.\n\nINTRODUCTION\n\nWe have a fundamental theory of the strong interaction, namely Quantum Chromodynamics (QCD), the mathematical beauty of which, in combination with its phenomenological successes, has convinced most physicists that\nit must be correct. Its predictions have been accurately confirmed in the short-distance (or high energy) regime\nof \"asymptotic freedom\". In the opposite limit of long distances (corresponding to quark confinement), it will be\nextensively tested over the next decade through advances in lattice QCD combined with new experimental facilities,\nsuch as the 12 GeV upgrade at Jefferson Lab and the new hadronic capabilities at J-PARC and FAIR. One of the\nmost compelling challenges in modern nuclear physics is to relate the properties of nuclear matter, from finite nuclei\nto neutron stars, to the underlying quark and gluon structure of matter and QCD itself.\nOver the past 50 years the standard approach to understanding nuclear structure has involved the application of nonrelativistic many-body theory, based upon nucleon-nucleon (NN) potentials fit to experimental two-nucleon scattering\ndata. Amongst the potentials used at various stages we mention the Paris potential [1], with its intermediate range\nstructure determined through dispersion relations and hence almost model independent. Other approaches which are\nstill widely used are the one-boson-exchange forces, such as the various Bonn [2] and Nijmegen [3] potentials. In its\nmodern form this approach is best represented by the Argonne 18 potential [4], supplemented by a phenomenological\nthree-body force [5]. This has been used in combination with Green function monte-carlo methods to calculate the\nenergy levels of light nuclei.\nThese models of the nuclear forces have no direct connection to QCD, in that they operate at the purely hadronic\nlevel. Another recent approach, which preserves the chiral symmetry of QCD [6], is based on effective field theory\n(EFT). Such calculations are just now achieving the phenomenological success in fitting NN data that is characteristic\nof the Bonn and Nijmegen potentials mentioned above – with a similar number of fitting parameters, typically between\n20 and 30. The apparatus of EFT is also being exploited to generate the corresponding three-body forces [7], so that\none can tackle the energy levels of light nuclei. While the use of EFT permits one to preserve the chiral symmetry of\nQCD, this is a pale reflection of the full power of QCD itself. Indeed, given the extensive knowledge of chiral symmetry\nat the time, one could have carried out the EFT program for the NN force in the 1960s, before the discovery of QCD.\nNeither the usual treatments of nuclear structure outlined above, nor the usual EFT approach, have yet incorporated\nthe requirements of special relativity. We mentioned earlier the results of the Paris group's dispersion relation analysis\nof the nature of the intermediate range NN force. The intermediate range NN force is unambiguously dominated by\ntwo-pion exchange with a Lorentz scalar and isoscalar character. Quantum Hadrodynamics (QHD) exploited this by\nformulating a description of nuclear matter in which Lorentz scalar attraction (represented by a σ meson) competed\nwith Lorentz vector repulsion (represented by an ω meson) [8]. At the saturation density of nuclear matter, ρ0 , the\nmean scalar field strength in QHD was of order 400 MeV. A similar result was found in a relativistic Brueckner\nHartree-Fock calculation using a boson exchange potential [9]. Given such a huge scalar field, with a strength almost\nhalf of the mass of the nucleon itself, one must anticipate that it will have a significant effect on the internal structure\nof the nucleons making up the nuclear matter. In particular, we recall that the typical energy associated with the\nexcitation of internal degrees of freedom in the nucleon is only 300 MeV (for spin excitations) to 500 MeV (for orbital\nexcitations).\nLet us briefly summarize. Any serious treatment of the model independent Lorentz scalar nature of the intermediate\nrange NN force leads to the conclusion that the bound nucleons experience a scalar potential of a strength up to one\nhalf of the mass of the nucleon itself – a strength comparable with the typical internal excitation energy of the\nnucleon. This immediately suggests that the internal structure of the nucleon should indeed play a crucial role in\n\n\f2\nnuclear structure. The popular prejudice which leads many to neglect this role is generally based on the observation\nthat the nucleon binding energy is very small in comparison with its mass. However this small binding actually\narises from a cancellation between the scalar and the vector potential in-medium, while the structure modification is\nexpected to arise primarily through the scalar potential.\nIn order to anticipate the possible consequences of this very general observation, we turn to atomic and molecular\nsystems where we have text book experience. We know that when an atom is subjected to a strong electric field, its\nelectron structure will rearrange in order to oppose the applied field. This change in the internal structure of the\natom, at least if one is concerned solely with describing the energy of the system, can be described in terms of an\nelectric polarizability. In particular, the energy of the system has a term quadratic in the applied electric field, with\nthe coefficient being (one half of) the electric polarizability. Exactly the same thing happens if we apply a magnetic\nfield, with the coefficient of the term quadratic in the applied magnetic field involving the magnetic polarizability.\nTurning to the nucleon itself, we know that applied electric and magnetic fields alter its internal structure, giving\nrise to electric and magnetic polarizabilities and even, in sophisticated electron scattering experiments, the so-called\ngeneralized polarizabilities [10, 11]. Given this background it is remarkable that it has taken so long for nuclear\nphysicists to pay serious attention to the response of the nucleon to an applied scalar field, especially its scalar\npolarizability.\nTaking the experience with atomic physics as our lead, we would naturally expect that a nucleon embedded in\nmatter would have an energy with a non-linear dependence on the mean scalar field:\nd\n∗\n= MN − gσ σ + (gσ σ)2\nMN\n2\n\n(1)\n\nwhere d is the scalar polarizability. In QHD such a term is, of course, absent – although later phenomenological\ndevelopments involving a self-interaction of the scalar field can be rewritten (using a redefinition of the scalar field)\nin just this way. Viewed in this way the scalar polarizability can be seen as giving a very natural explanation of such\na self-interaction. In the first examination of nuclear matter from this point of view, using the MIT bag model to\ndescribe the quark structure of the bound nucleons, Guichon found exactly such a behavior, with d = +0.22R and\nR the bag radius [12]. Since that time, this model, which is known as the quark-meson coupling (QMC) model, has\nbeen extended to describe finite nuclei [13]. It has also been widely applied to the extremely interesting problem of\nhow the structure of hadrons in general might be expected to change in-medium [14, 15] – applications which have\nincluded the possibility of η- or ω-nucleus bound states [16], the structure of hypernuclei [17] and the modification of\nthe electric and magnetic form factors of bound protons [18], as well as their structure functions [19].\nRather than reviewing these many applications, which have recently been the subject of a major review [14], we\nreturn to the atomic and molecular analogy for further insights which, as we shall see, are crucial to understanding\nthe structure of atomic nuclei. When two atoms approach each other they mutually modify their internal structure.\nThis implies that when a third atom approaches it does not see a pair of bare atoms. Consequently, the total energy\nof the system will not be the sum of the individual pair-wise interactions (potentials) – that is:\nVtot 6= V12 + V23 + V13\n\n(2)\n\nand the difference is, by definition, a \"three-body force\", V123 . By analogy, we anticipate that the scalar polarizability\nof the nucleon will naturally lead to many-body forces in-medium.\nIn the next section we briefly review the exploration of the origin of many-body forces (or equivalently density\ndependent effective interactions), arising as a consequence of the modification of the internal structure of the nucleon\nin-medium, within the framework of QMC. We shall see that it is indeed possible, starting from the quark level, to\ngenerate realistic effective interactions of the Skyrme type [20].\nII.\n\nEFFECTIVE FORCES OF THE SKYRME TYPE DERIVED FROM THE QUARK LEVEL\n\nIn 2004 Guichon and Thomas [21] showed that by expanding about < σ >= 0 one could derive an effective force\nof the Skyrme type (widely used in nuclear structure calculations) in which the local two-body effective interaction\nwas supplemented by three- and four-body forces, proportional to d and d2 , respectively. A comparison between the\nvarious coefficients in the SkIII force with those derived from the QMC model showed agreement at typically the 10%\nlevel. This remarkable result provided the first, direct microscopic connection between a commonly used effective\nnuclear force and the underlying degrees of freedom of QCD.\nAs important as the results of Ref. [21] were, many important issues were left unaddressed:\n• The relatively large scalar field found in nuclear matter means that one would really like to remove the need to\nexpand about σ = 0.\n\n\f3\n• Modern Skyrme forces tend to include density dependent coefficients (fit to appropriate nuclear data), rather\nthan being density independent with an explicit three-body term. Hence one would really like to rewrite the\nenergy functional for QMC in terms of a density dependent effective force.\n• A crucial issue at higher densities, when for example one is calculating the equation of state (EoS) for application\nto neutron stars, concerns the density at which hyperons appear in matter in β-equilibrium. For this purpose\none would very much like to derive effective, density dependent effective hyperon-nucleon and hyperon-hyperon\nforces. Because one starts from the quark level, QMC is ideally suited for this purpose.\nAll of these issues were successfully resolved by the recent formulation of Guichon et al. [22]. The resulting energy\nfunctional in its full relativistic form was too difficult to use in finite nuclei. However, in that case a non relativistic\nexpansion was allowed and that provided an effective force with a novel density dependence – the coefficients being\nrational functions of the local density. For example, the central pieces of the corresponding Hamiltonian\n< H(~r) >= ρM +\n\nτ\n+ H0 + H3 + Hef f + Hf in + HSO\n2M\n\n(3)\n\ntook the form:\nH0 + H3\n\n\"\n\nGσ\n−3 Gρ\nGσ\n3 Gω\n−\n= ρ\n+\n+\n3\n32\n2 (1 + d ρ Gσ )\n8\n8 (1 + d ρ Gσ )\n\"\n#\nGω\nGσ\n2 5 Gρ\n(ρn − ρp )\n.\n+\n3 − 8\n32\n8 (1 + d ρ Gσ )\n2\n\n#\n\n+\n(4)\n\nThis appears rather different from commonly used density dependent Skyrme forces such as SkM, which includes a\ndependence on a fractional power of the density. For comparison, we show for SkM the central pieces corresponding\nto those that were given for QMC in Eq. (4):\n\u0001\u0001\n\u0001\n1\nt0 ρ2 (2 + x0 ) − (1 + 2 x0 ) ρn 2 + ρp 2\nρ 6 t3 2 ρ 2 − ρ n 2 − ρ p 2\n+\n.\n(5)\nH0 + H3 =\n24\n4\nIn order to make a quantitative comparison between these two forms of effective potential the SkM form was fit to\nthe QMC form over the density range (0, ρ0 ). The comparison between the usual phenomenological values of the\nconstants appearing in the SkM force and those fitted to QMC showed a level of agreement at the 10-20% level. This\nis reasonable but by no means impressive. On the other hand, since the functional forms are quite different it seemed\nappropriate to compare the predictions of the two effective forces for real nuclear properties. Accordingly the effective\nforce derived from the QMC model was employed within the Hartree-Fock framework to calculate the properties of\nclosed shell, finite nuclei. The result was extremely gratifying, with the level of agreement between theory and data\n(where available and phenomenological Skyrme-type forces where data was unavailable) being very good. In Fig. 1 we\nshow a comparison between the charge densities of selected closed shell nuclei calculated within QMC in comparison\nwith experimental data, as well as the widely used Sly4 force [23]. Clearly the level of agreement between the two\ntheories is remarkably good. Given that the QMC calculation had no parameters adjusted to reproduce the properties\nof finite nuclei, the agreement with the experimental charge densities is also very satisfactory.\nAs there is no model independent experimental determination of the neutron densities we show, in Fig. 2, a\ncomparison between the neutron densities produced by Sly4 and by the QMC model. Once again, it is reassuring in\nterms of assessing the quality of the effective interaction derived from the QMC model that they are so close.\nAnother key test of the model is its ability to describe the dependence of the spin-orbit splittings on both mass\nnumber and isospin. At first glance this looks like an area in which QMC might fail, in view of the strong isospin\ndependence of the effective force derived from QMC. However, as we see in Table I (taken from Ref. [22]), this worry\nis in fact misplaced. Once the interaction is used, within the Hartree-Fock framework, to self-consistently determine\nthe nuclear structure there is agreement between the predictions of QMC and experiment across the full range of\nnuclear mass number for both protons and neutrons.\nIII.\n\nCONCLUDING REMARKS\n\nIn the limited space available we have been able to introduce just the main ideas of these modern QMC based\ncalculations. The results obtained with the density dependent effective force are particularly impressive. However,\nthey are based upon the non-relativistic approximation, which cannot be expected to be reliable much beyond ρ0 .\n\n\f4\n16\n\n40\n\nO\n\nCa\n\n0.1\n\n0.1\n\n-3\n\nρ(fm )\n\n0.08\n0.06\n\n0.04\n\n0.02\n\n0.02\n48\n\n208\n\nCa\n\n-3\n\n0.06\n\n0.04\n\n0\n\nρ(fm )\n\n0.08\n\nProton (QMC)\nProton (Sly4)\nExp.\n\n0\nPb\n\n0.1\n\n0.1\n\n0.08\n\n0.08\n\n0.06\n\n0.06\n\n0.04\n\n0.04\n\n0.02\n\n0.02\n\n0\n\n0\n\n10\n0\n\n5\nr(fm)\n\n0\n10\n\n5\nr(fm)\n\nFIG. 1: Proton densities calculated using the density dependent effective interaction derived from the QMC model compared\nwith experiment and with the predictions of the Skyrme Sly4 force – from Ref. [22] .\n\n16\n\n40\n\nO\n\nCa\n\n0.1\n\n0.1\n\n-3\n\nρ(fm )\n\n0.08\n\n0.08\n\nNeutron (QMC)\nNeutron (Sly4)\n\n0.06\n\n0.06\n\n0.04\n\n0.04\n\n0.02\n\n0.02\n\n0\n\n48\n\n208\n\nCa\n\n0\nPb\n\n0.1\n\n0.1\n\n-3\n\nρ(fm )\n\n0.08\n0.06\n0.05\n0.04\n0.02\n0\n\n0\n\n5\nr(fm)\n\n10\n0\n\n5\nr(fm)\n\n0\n10\n\nFIG. 2: Neutron densities calculated using the density dependent effective interaction derived from the QMC model compared\nwith the predictions of the Skyrme Sly4 force – from Ref. [22].\n\n\f5\n\n16\n\nO, 1p1/2 − 1p3/2\n40\nCa, 1d3/2 − 1d5/2\n48\nCa, 1d3/2 − 1d5/2\n208\nP b, 2d3/2 − 2d5/2\n\nNeutrons (exp) Neutrons (th) Protons (exp) Protons (th)\n6.10\n6.01\n6.3\n6.15\n6.41\n6.00\n6.24\n6.05 (Sly4)\n5.64\n6.06 (Sly4)\n5.59\n2.15 (Sly4)\n2.04\n1.87 (Sly4)\n1.74\n\nTABLE I: Values of the spin-orbit splitting for selected nuclear levels calculated from the QMC model, in comparison with the\ncorresponding experimental values, where known. As they are not so well known in the case of 48 Ca and 208 P b, there we give\nthe values corresponding to the Skyrme Sly4 force.\n\nQMCπ4\nQMC700\nFlow constaint\n\n3\n\nP(MeV/fm )\n\n100\n\n10\n\n1\n\n1\n\n2\n\n3\nρ/ρ0\n\n4\n\n5\n\nFIG. 3: QMC predictions for the pressure as a function of density in comparison with the allowed region for isoscalar matter\ndeduced from the constraints of heavy-ion flow data [25].\n\nIndeed, as shown by Guichon et al. [22], it leads to an error of almost 50% in the velocity of sound in the nuclear\nmedium at just 2ρ0 . Thus, in studying dense matter, one must return to using the original relativistic HartreeFock formulation. This is feasible in uniform matter [24]. As an illustration of our results, in Figure 3 we show\nour predictions for the pressure of symmetric nuclear matter as a function of baryonic density. The labels QMC700\nand QMCπ4 refer to two extreme versions of the model which give an incompressibility of 340 MeV and 256 MeV,\nrespectively. Also shown in the figure is the experimental constraint deduced from the flow data in high energy nuclear\ncollisions [25].\nAnother challenge faced by nuclear theory, as the density increases, is the possible entry of hyperons into the\nnuclear stew. Hyperon-nucleon forces are unfortunately poorly constrained by data, even in the case of Λ N , while\nin the case of Σ N and Ξ N the situation is worse. Typical phenomenological forces rely on SU(3) symmetry, a hard\npath to tread when cancellations between various components of the force are so important. When it comes to using\nhypernuclear data to constrain the parameters of Skyrme-type forces we note that only a single Σ-hypernucleus has\nbeen confirmed and no Ξ-hypernuclei. For Λ-hypernuclei the situation is a little better. It is little wonder that there\nis no consensus on the threshold density at which hyperons appear, nor even which one will appear first. As the\nappearance of hyperons will soften the nuclear equation of state and, for example, raise the critical density for the\ntransition to quark matter, this is a vital issue.\nBecause the QMC model starts at the quark level, it can can also be used to calculate density dependent, effective\nhyperon-nucleon or even hyperon-hyperon forces – with no additional parameters. The only hypothesis needed is\nthat the nuclear fields do not couple to the strange quark. This is certainly a good approximation if the meson fields\nsimulate multi-pion exchanges. It is also supported by the absence of spin-orbit splitting in Λ hypernuclei. As shown\nin Figure 4, a striking prediction of the model is that the thresholds for the appearance of strange particles do not\nfollow the usual pattern where the Σ− and Λ appear first. Because of the scalar polarizability of the baryons and\nthe use of the Hartree-Fock approximation [24] (rather than the mean field approximation), the Ξ and Λ appear first\nand at a rather high density (∼ 3ρ0 ). The Σ does not show up in the density domain pertinent to neutron stars.\n\n\f6\n\nPopulation\n\n1\n\nn\n\np\n\n0.1\n\ne\n0.01\n0.001\n0\n1\n\nPopulation\n\nQMC700\nμ\n\n0.2\n\nΞ\n\nΞ\n0.6\n\n0.4\n\nQMCπ4\n\n0\n\nΛ\n\ne\n0.01\n0.2\n\nμ\n\nΞ\n\n0.4\n\n0.8\n\n1\n\n1.2\n\n1\n\n1.2\n\nn\n\np\n\n0.1\n\n0.001\n0\n\n−\n\n−\n\n0.6\n-3\nnB [fm ]\n\nΞ\n\n0\n\nΛ\n\n0.8\n\nFIG. 4: The β equilibrium population of particles calculated for the models QMC700 and QMCπ4 – from Ref. [24].\n\nThe resulting equation of state is relatively stiff and produces a maximum neutron star mass of about 2.1M⊙, with a\nrather small central density (∼ 6ρ0 ).\nFinally, we note that the QMC model is built upon the MIT bag model. This is a fairly ancient and unsophisticated\nquark model and although all indications are that the details of the model are not so important one would like to\ndo better. In particular, one would ideally like to have a quark model describing the structure of the hadrons which\nis covariant, in order to address the problem of nuclear structure functions – the famous EMC effect [26, 27] – with\nsome confidence.\nIn parallel with the developments concerning QMC, Bentz, Thomas and collaborators have made considerable\nprogress with just such a model. They took the NJL model, modified using proper time regularization in order to\nsimulate confinement. The model is therefore covariant, confining and respects chiral symmetry. Exactly as in QMC,\nthe hadron structure in-medium was self-consistently modified (by solving the corresponding Faddeev equations).\nAlso as in the QMC model the scalar polarizability led to the saturation of nuclear matter and, incidentally, solved\nthe long-standing problem of chiral collapse suffered by the NJL model [28]. In application to the nuclear EMC effect\nthe model is able to reproduce the data for unpolarized structure functions [29, 30]. However, even more important,\nit makes a prediction characteristic of models of the QMC type in which the mean scalar field enhances the lower\nDirac components of the confined quark wave functions. (We note that a similar calculation within the chiral quark\nsoliton model [31] produces a qualitatively similar result.) That is, it predicts a polarized EMC effect roughly twice\nas big as the unpolarized effect. This will provide a critical test of such models.\nA final success of this approach has been to use the same underlying quark model to describe matter made of\n\"nucleons\" (albeit with modified internal structure), as well as matter made of quarks [32, 33]. Indeed a major\ndiscovery of Lawley and collaborators [33] was that, once the effect of the pion cloud of the nucleon [34] is taken\ninto account, one can use the same underlying, quark level Hamiltonian to consistently describe the hadronic, quark\nmatter and superconducting quark matter phases of dense matter. This is a major step forward in a field where one\nis usually forced to employ completely different models for the different phases. Such calculations are of great interest\nin view of the difficulties in simulating supernova explosions, as well as because of the very different mass-radius\nrelations that one typically finds for stars containing quark matter.\nAcknowledgements\n\nIt is a pleasure to acknowledge the collaboration with W. Bentz, I. Cloët, S. Lawley, H. Matevosyan, J. Riskova Stone,\nK. Saito, N. Sandulescu and K. Tsushima, who made crucial contributions to the work described here. This work was\n\n\f7\nsupported by DOE contract DE-AC05-06OR23177, under which Jefferson Science Associates operates Jefferson Lab.\n\n[1] W. N. Cottingham, M. Lacombe, B. Loiseau, J. M. Richard and R. Vinh Mau, Phys. Rev. D 8 (1973) 800.\n[2] R. Machleidt, K. Holinde and C. Elster, Phys. Rept. 149 (1987) 1.\n[3] J. J. de Swart, R. A. M. Klomp, M. C. M. Rentmeester and T. A. Rijken, Few Body Syst. Suppl. 8 (1995) 438\n[arXiv:nucl-th/9509024].\n[4] R. B. Wiringa, V. G. J. Stoks and R. Schiavilla, Phys. Rev. C 51 (1995) 38 [arXiv:nucl-th/9408016].\n[5] J. Carlson, V. R. Pandharipande and R. B. Wiringa, Nucl. Phys. A 401 (1983) 59.\n[6] E. Epelbaum, W. Glockle and U. G. Meissner, Nucl. Phys. A 747 (2005) 362 [arXiv:nucl-th/0405048];\n[7] E. Epelbaum, Prog. Part. Nucl. Phys. 57 (2006) 654 [arXiv:nucl-th/0509032].\n[8] B. D. Serot and J. D. Walecka, Adv. Nucl. Phys. 16 (1986) 1.\n[9] R. Brockmann and R. Machleidt, arXiv:nucl-th/9612004.\n[10] P. A. M. Guichon, G. Q. Liu and A. W. Thomas, Nucl. Phys. A 591, 606 (1995) [arXiv:nucl-th/9605031].\n[11] A. W. Thomas and W. Weise, \"The Structure of the Nucleon\", VCH Verlag, Berlin (2001)\n[12] P. A. M. Guichon, Phys. Lett. B 200 (1988) 235.\n[13] P. A. M. Guichon, K. Saito, E. N. Rodionov and A. W. Thomas, Nucl. Phys. A 601 (1996) 349 [arXiv:nucl-th/9509034].\n[14] K. Saito, K. Tsushima and A. W. Thomas, \"Nucleon and hadron structure changes in the nuclear medium and impact on\nobservables,\" to appear in Prog. Part. Nucl. Phys. arXiv:hep-ph/0506314; K. Saito and A. W. Thomas, Phys. Rev. C 52\n(1995) 2789 [arXiv:nucl-th/9506003].\n[15] K. Saito, K. Tsushima and A. W. Thomas, Phys. Rev. C 55, 2637 (1997) [arXiv:nucl-th/9612001].\n[16] K. Tsushima, D. H. Lu, A. W. Thomas and K. Saito, Phys. Lett. B 443, 26 (1998) [arXiv:nucl-th/9806043].\n[17] K. Tsushima, K. Saito, J. Haidenbauer and A. W. Thomas, Nucl. Phys. A 630, 691 (1998) [arXiv:nucl-th/9707022].\n[18] D. H. Lu, A. W. Thomas, K. Tsushima, A. G. Williams and K. Saito, Phys. Lett. B 417, 217 (1998) [arXiv:nucl-th/9706043].\n[19] K. Saito and A. W. Thomas, Nucl. Phys. A 574 (1994) 659.\n[20] D. Vautherin and D. M. Brink, Phys. Rev. C 5 (1972) 626.\n[21] P. A. M. Guichon and A. W. Thomas, Phys. Rev. Lett. 93 (2004) 132502 [arXiv:nucl-th/0402064].\n[22] P. A. M. Guichon, H. H. Matevosyan, N. Sandulescu and A. W. Thomas, Nucl. Phys. A 772 (2006) 1\n[arXiv:nucl-th/0603044].\n[23] E. Chabanat, P. Bonche, P. Haensel, J. Meyer and R. Schaeffer, Nucl. Phys. A 635 (1998) 231.\n[24] P. A. M. Guichon, H. Matevosyan, J. Riskova Stone and A. W. Thomas, to be published, [arXiv:nucl-th/0611030].\n[25] P. Danielewicz, R. Lacey and W.G. Lynch, Science 298 (2002) 1592.\n[26] J. J. Aubert et al. [European Muon Collaboration], Phys. Lett. B 123 (1983) 275.\n[27] D. F. Geesaman, K. Saito and A. W. Thomas, Ann. Rev. Nucl. Part. Sci. 45 (1995) 337.\n[28] W. Bentz and A. W. Thomas, Nucl. Phys. A 696 (2001) 138 [arXiv:nucl-th/0105022].\n[29] I. C. Cloet, W. Bentz and A. W. Thomas, Phys. Rev. Lett. 95 (2005) 052302 [arXiv:nucl-th/0504019].\n[30] I. C. Cloet, W. Bentz and A. W. Thomas, arXiv:nucl-th/0605061.\n[31] J. R. Smith and G. A. Miller, Phys. Rev. C 72 (2005) 022203 [arXiv:nucl-th/0505048].\n[32] S. Lawley, W. Bentz and A. W. Thomas, Phys. Lett. B 632 (2006) 495 [arXiv:nucl-th/0504020].\n[33] S. Lawley, W. Bentz and A. W. Thomas, J. Phys. G 32 (2006) 667 [arXiv:nucl-th/0602014].\n[34] R. D. Young, D. B. Leinweber, A. W. Thomas and S. V. Wright, Phys. Rev. D 66 (2002) 094507 [arXiv:hep-lat/0205017].\n\n\f"}