{"id": "http://arxiv.org/abs/nucl-th/0302025v1", "guidislink": true, "updated": "2003-02-12T13:41:12Z", "updated_parsed": [2003, 2, 12, 13, 41, 12, 2, 43, 0], "published": "2003-02-12T13:41:12Z", "published_parsed": [2003, 2, 12, 13, 41, 12, 2, 43, 0], "title": "Fusion cross sections at deep subbarrier energies", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=nucl-th%2F0512082%2Cnucl-th%2F0512011%2Cnucl-th%2F0512105%2Cnucl-th%2F0512003%2Cnucl-th%2F0512080%2Cnucl-th%2F0512005%2Cnucl-th%2F0512083%2Cnucl-th%2F0512029%2Cnucl-th%2F0512066%2Cnucl-th%2F0512061%2Cnucl-th%2F0512078%2Cnucl-th%2F0512104%2Cnucl-th%2F0512014%2Cnucl-th%2F0512049%2Cnucl-th%2F0512009%2Cnucl-th%2F0512015%2Cnucl-th%2F0512077%2Cnucl-th%2F0512051%2Cnucl-th%2F0512018%2Cnucl-th%2F0512025%2Cnucl-th%2F0512074%2Cnucl-th%2F0512069%2Cnucl-th%2F0512056%2Cnucl-th%2F0512017%2Cnucl-th%2F0512004%2Cnucl-th%2F0512022%2Cnucl-th%2F0512063%2Cnucl-th%2F0512060%2Cnucl-th%2F0512047%2Cnucl-th%2F0512100%2Cnucl-th%2F0512044%2Cnucl-th%2F0512097%2Cnucl-th%2F0512067%2Cnucl-th%2F0512058%2Cnucl-th%2F0512052%2Cnucl-th%2F0512016%2Cnucl-th%2F0512103%2Cnucl-th%2F0512081%2Cnucl-th%2F0512008%2Cnucl-th%2F0512028%2Cnucl-th%2F0512088%2Cnucl-th%2F0512050%2Cnucl-th%2F0512087%2Cnucl-th%2F0512072%2Cnucl-th%2F0512006%2Cnucl-th%2F0512106%2Cnucl-th%2F0512043%2Cnucl-th%2F0512099%2Cnucl-th%2F0512064%2Cnucl-th%2F0512102%2Cnucl-th%2F0512042%2Cnucl-th%2F0512031%2Cnucl-th%2F0512079%2Cnucl-th%2F0512091%2Cnucl-th%2F0512019%2Cnucl-th%2F0302027%2Cnucl-th%2F0302029%2Cnucl-th%2F0302025%2Cnucl-th%2F0302024%2Cnucl-th%2F0302046%2Cnucl-th%2F0302050%2Cnucl-th%2F0302054%2Cnucl-th%2F0302056%2Cnucl-th%2F0302015%2Cnucl-th%2F0302026%2Cnucl-th%2F0302052%2Cnucl-th%2F0302033%2Cnucl-th%2F0302003%2Cnucl-th%2F0302038%2Cnucl-th%2F0302048%2Cnucl-th%2F0302042%2Cnucl-th%2F0302037%2Cnucl-th%2F0302045%2Cnucl-th%2F0302060%2Cnucl-th%2F0302064%2Cnucl-th%2F0302013%2Cnucl-th%2F0302058%2Cnucl-th%2F0302074%2Cnucl-th%2F0302072%2Cnucl-th%2F0302012%2Cnucl-th%2F0302017%2Cnucl-th%2F0302061%2Cnucl-th%2F0302073%2Cnucl-th%2F0302040%2Cnucl-th%2F0302016%2Cnucl-th%2F0302070%2Cnucl-th%2F0302007%2Cnucl-th%2F0302018%2Cnucl-th%2F0302076%2Cnucl-th%2F0302023%2Cnucl-th%2F0302006%2Cnucl-th%2F0302079%2Cnucl-th%2F0302039%2Cnucl-th%2F0302004%2Cnucl-th%2F0302041%2Cnucl-th%2F0302020%2Cnucl-th%2F0302009%2Cnucl-th%2F0302005%2Cnucl-th%2F0302021%2Cnucl-th%2F0302022%2Cnucl-th%2F0302066&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Fusion cross sections at deep subbarrier energies"}, "summary": "A recent publication reports that heavy-ion fusion cross sections at extreme\nsubbarrier energies show a continuous change of their logarithmic slope with\ndecreasing energy, resulting in a much steeper excitation function compared\nwith theoretical predictions. We show that the energy dependence of this slope\nis partly due to the asymmetric shape of the Coulomb barrier, that is its\ndeviation from a harmonic shape. We also point out that the large low-energy\nslope is consistent with the surprisingly large surface diffusenesses required\nto fit recent high-precision fusion data.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=nucl-th%2F0512082%2Cnucl-th%2F0512011%2Cnucl-th%2F0512105%2Cnucl-th%2F0512003%2Cnucl-th%2F0512080%2Cnucl-th%2F0512005%2Cnucl-th%2F0512083%2Cnucl-th%2F0512029%2Cnucl-th%2F0512066%2Cnucl-th%2F0512061%2Cnucl-th%2F0512078%2Cnucl-th%2F0512104%2Cnucl-th%2F0512014%2Cnucl-th%2F0512049%2Cnucl-th%2F0512009%2Cnucl-th%2F0512015%2Cnucl-th%2F0512077%2Cnucl-th%2F0512051%2Cnucl-th%2F0512018%2Cnucl-th%2F0512025%2Cnucl-th%2F0512074%2Cnucl-th%2F0512069%2Cnucl-th%2F0512056%2Cnucl-th%2F0512017%2Cnucl-th%2F0512004%2Cnucl-th%2F0512022%2Cnucl-th%2F0512063%2Cnucl-th%2F0512060%2Cnucl-th%2F0512047%2Cnucl-th%2F0512100%2Cnucl-th%2F0512044%2Cnucl-th%2F0512097%2Cnucl-th%2F0512067%2Cnucl-th%2F0512058%2Cnucl-th%2F0512052%2Cnucl-th%2F0512016%2Cnucl-th%2F0512103%2Cnucl-th%2F0512081%2Cnucl-th%2F0512008%2Cnucl-th%2F0512028%2Cnucl-th%2F0512088%2Cnucl-th%2F0512050%2Cnucl-th%2F0512087%2Cnucl-th%2F0512072%2Cnucl-th%2F0512006%2Cnucl-th%2F0512106%2Cnucl-th%2F0512043%2Cnucl-th%2F0512099%2Cnucl-th%2F0512064%2Cnucl-th%2F0512102%2Cnucl-th%2F0512042%2Cnucl-th%2F0512031%2Cnucl-th%2F0512079%2Cnucl-th%2F0512091%2Cnucl-th%2F0512019%2Cnucl-th%2F0302027%2Cnucl-th%2F0302029%2Cnucl-th%2F0302025%2Cnucl-th%2F0302024%2Cnucl-th%2F0302046%2Cnucl-th%2F0302050%2Cnucl-th%2F0302054%2Cnucl-th%2F0302056%2Cnucl-th%2F0302015%2Cnucl-th%2F0302026%2Cnucl-th%2F0302052%2Cnucl-th%2F0302033%2Cnucl-th%2F0302003%2Cnucl-th%2F0302038%2Cnucl-th%2F0302048%2Cnucl-th%2F0302042%2Cnucl-th%2F0302037%2Cnucl-th%2F0302045%2Cnucl-th%2F0302060%2Cnucl-th%2F0302064%2Cnucl-th%2F0302013%2Cnucl-th%2F0302058%2Cnucl-th%2F0302074%2Cnucl-th%2F0302072%2Cnucl-th%2F0302012%2Cnucl-th%2F0302017%2Cnucl-th%2F0302061%2Cnucl-th%2F0302073%2Cnucl-th%2F0302040%2Cnucl-th%2F0302016%2Cnucl-th%2F0302070%2Cnucl-th%2F0302007%2Cnucl-th%2F0302018%2Cnucl-th%2F0302076%2Cnucl-th%2F0302023%2Cnucl-th%2F0302006%2Cnucl-th%2F0302079%2Cnucl-th%2F0302039%2Cnucl-th%2F0302004%2Cnucl-th%2F0302041%2Cnucl-th%2F0302020%2Cnucl-th%2F0302009%2Cnucl-th%2F0302005%2Cnucl-th%2F0302021%2Cnucl-th%2F0302022%2Cnucl-th%2F0302066&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A recent publication reports that heavy-ion fusion cross sections at extreme\nsubbarrier energies show a continuous change of their logarithmic slope with\ndecreasing energy, resulting in a much steeper excitation function compared\nwith theoretical predictions. We show that the energy dependence of this slope\nis partly due to the asymmetric shape of the Coulomb barrier, that is its\ndeviation from a harmonic shape. We also point out that the large low-energy\nslope is consistent with the surprisingly large surface diffusenesses required\nto fit recent high-precision fusion data."}, "authors": ["K. Hagino", "N. Rowley", "M. Dasgupta"], "author_detail": {"name": "M. Dasgupta"}, "author": "M. Dasgupta", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevC.67.054603", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/nucl-th/0302025v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/nucl-th/0302025v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "9 pages, 3 eps figures", "arxiv_primary_category": {"term": "nucl-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "nucl-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/nucl-th/0302025v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/nucl-th/0302025v1", "journal_reference": "Phys.Rev. C67 (2003) 054603", "doi": "10.1103/PhysRevC.67.054603", "fulltext": "Fusion cross sections at deep subbarrier energies\nK. Hagino1,2 , N. Rowley3 , and M. Dasgupta4\n\narXiv:nucl-th/0302025v1 12 Feb 2003\n\n1 Yukawa\n\nInstitute for Theoretical Physics, Kyoto University, Kyoto 606-8502, Japan\n2 Institut de Physique Nucléaire, IN2P3-CNRS,\nUniversité Paris-Sud, F-91406 Orsay Cedex, France\n3 Institut de Recherches Subatomiques, UMR7500, IN2P3-CNRS/Universtité Louis Pasteur,\nBP28, F-67037 Strasbourg Cedex 2, France\n4 Department of Nuclear Physics, Research School of Physical Sciences and Engineering,\nAustralian National University, Canberra ACT0200, Australia\n\nAbstract\n\nA recent publication reports that heavy-ion fusion cross sections at extreme subbarrier energies show a continuous change of their logarithmic slope\nwith decreasing energy, resulting in a much steeper excitation function compared with theoretical predictions. We show that the energy dependence of\nthis slope is partly due to the asymmetric shape of the Coulomb barrier, that\nis its deviation from a harmonic shape. We also point out that the large\nlow-energy slope is consistent with the surprisingly large surface diffusenesses\nrequired to fit recent high-precision fusion data.\n\nTypeset using REVTEX\n1\n\n\fThe primary ingredient in any nuclear reaction calculation is the nucleus-nucleus potential, consisting of the repulsive Coulomb interaction and an attractive nuclear part. Although\nthe Coulomb term VC (r) is well-known, there are large ambiguities in the nucleus-nucleus\npotential Vn (r), and many attempts have been made to extract information on this quantity from experimental data for heavy-ion reactions. While elastic and inelastic scattering\nare sensitive mainly to the surface region of the nuclear potential, the fusion reaction is\nalso relatively sensitive to the inner part. They thus provide complementary sources of\ninformation.\nIn heavy-ion reactions, strong channel coupling effects (due to collective inelastic excitations of the colliding nuclei and/or transfer processes) significantly modify the landscape of\npotential energy surface, replacing the uncoupled single barrier with a distribution of barriers [1–4]. In order to extract the nucleus-nucleus potential from heavy-ion fusion reactions,\nit is therefore advisable to use either high-energy fusion data where the barrier penetrability is essentially unity for all the distributed barriers, or very low-energy data where only\nthe lowest barrier contributes to the cross section. Of these, the low-energy data probably\nprovide cleaner information since the high-energy data may be complicated by competing\nreaction processes such as deep-inelastic scattering.\nA recent paper [5] has reported an attempt to measure the fusion cross section σ for the\n60\nNi + 89 Y system at deep subbarrier energies, down to the 10−4 mb level. The authors\nof Ref. [5] used the Wong fusion formula [6] to analyse their data and showed that the\nexperimental cross section exhibited an abrupt decrease at extreme subbarrier energies. They\nalso analysed the data in terms of the logarithmic slope, defined by L(E) = d(ln(σE))/dE,\nand showed that this quantity exhibited a continuous increase with decreasing energy, in\ncontrast to the theoretical slope which approached a constant value. They also found similar\nbehavior in a few other systems found in the literature, including the 58 Ni + 58 Ni and 90 Zr\n+ 92 Zr reactions.\nThe main part of the analysis in Ref. [5] relied on the Wong formula as a reference. A\nnatural question is whether this formula, based on a parabolic approximation to the Coulomb\nbarrier, is adequate at deep subbarrier energies [7]. It was claimed in Ref. [5] that the Wong\nformula leads to fusion cross sections similar to those obtained with the coupled-channels\napproach for the 58 Ni + 58 Ni system. However, the former was simply a fit to the latter with\nparameters which had no physical connection to the potential used in the coupled-channels\ncalculations.\nThe aim of this paper is to reanalyse critically the 58 Ni + 58 Ni reaction with an exact\none-dimensional-potential calculation as well as with coupled-channels calculations [8] and\nshow that the Wong formula is indeed unreliable at very low energies. This is particularly\nso for a quantity such as the logarithmic slope which accentuates the energy dependence of\nthe cross section. We also discuss the findings of Ref. [5] in connection with the problem\nof the large surface diffusenesses of the nuclear potential for subbarrier fusion, discussed for\nsome time in the literature [4,9,10].\nLet us first discuss the validity of the parabolic approximation to the potential. Fig. 1\nshows the nucleus-nucleus potential for the 58 Ni + 58 Ni system (solid line), along with its\nparabolic approximation (dashed line)\n1\nV (r) ∼ B − μω 2(r − R)2 ,\n2\n2\n\n(1)\n\n\fwhere B and R are the barrier height and position, respectively. Here μ is the reduced\nmass of the system and ω is the barrier \"curvature\" given by ω 2 = −V ′′ (R)/μ. We use\na Woods-Saxon nuclear potential with V0 = 160 MeV, r0 = 1.1 fm and a= 0.65 fm. On\nthe inside, the nuclear potential varies relatively rapidly, while on the outside the Coulomb\npotential varies slowly, resulting in an asymmetric barrier shape. The deviation from the\nparabolic approximation (1) becomes larger as the energy goes down and one expects this\napproximation to break down at energies well below the barrier. It was shown in Ref. [7] that\nthe parabolic approximation is adequate only for |r − R| ≤ a, that is for incident energies\nwithin μω 2a2 /2 of the barrier height. In the present example μω 2 a2 /2 = 2.62 MeV, and it is\nevident that the parabolic approximation is valid only in a relatively small range of energies\nnear the barrier top.\nAn analytic formula for the fusion cross section for the parabolic barrier (1) was derived\nsome time ago by Wong [6]:\nσ(E) =\n\ni\nh̄ω 2 h\nR ln 1 + e2π(E−B)/h̄ω .\n2E\n\n(2)\n\nThe upper panel of Fig. 2 compares this formula with the fusion cross section obtained by\nnumerically solving the Schrödinger equation with the true potential. No coupling is included\nin these calculations. As we saw in Fig. 1, the parabolic approximation underestimates the\nbarrier thickness in the tunnelling region, and thus overestimates the penetrability at low\nenergies. The bottom panel of Fig. 2 shows the logarithmic slopes L(E). Eq. (2) yields a\nslope that is constant at low energies and is given by\n#\n\n\"\n\nd\n2π\nh̄ω 2 2π(E−B)/h̄ω\nL(E) ∼\n=\nln\nR e\n.\ndE\n2\nh̄ω\n\n(3)\n\nOn the other hand, the slope computed from the exact results shows a continuous increase\nwith decreasing incident energy (solid line). This is reminiscent of the experimental findings\nof Ref. [5].\nAt low energies, the logarithmic slope is related to the s-wave barrier penetrability P0\nby L(E) = d ln(P0 (E))/dE. In the WKB approximation, the penetrability is given by\n−2S(E)/h̄\n\nP0 (E) = e\n\n\u0014\n\n= exp −2\n\nZ\n\nr2\n\nr1\n\ndr\n\nq\n\n2\n\n2μ(V (r) − E)/h̄\n\n\u0015\n\n(4)\n\nat energies well below the barrier. Here, r1 and r2 are the inner and the outer turning points,\nrespectively. Defining ∆(E) as the difference between the true action integral S(E) and its\nvalue in the quadratic approximation we have (ingoring an unimportant constant factor):\nS(E) =\n\nZ\n\nr2\n\nr1\n\ndr\n\nq\n\n2μ(V (r) − E) =\n\nπ\nh̄\n(B − E) + ∆(E).\nω\n2\n\n(5)\n\nSince the Coulomb barrier V (r) has a non-symmetric shape, ∆(E) increases as the energy\ndecreases and the logarithmic slope L(E) = 2π/h̄ω−d∆(E)/dE is always larger than 2π/h̄ω.\nFurthermore, one can show that the second derivative of this action integral is a positive\nquantity and thus L(E) is a decreasing function of E. For example, this is the case for the\nsharp-cut potential, Vn (r) = [−VC (r) − V0 ] θ(R0 − r), for which the action integral can be\n3\n\n\fevaluated analytically [11]. These facts are consistent with the numerical result shown in\nthe lower panel of Fig. 2 as well as with the experimental findings discussed in Ref. [5]. We\nthus conclude that the continuous increase of the logarithmic slope with decreasing energy is\nnot in itself evidence of anomalous behavior of the fusion cross section at very low energies,\nas claimed in Ref. [5].\nWe now discuss the relation between the logarithmic slope L(E) and the surface property\nof the nuclear potential. For scattering processes, it seems well accepted that the surface\ndiffuseness parameter a should be around 0.63 fm if Vn is parametrised by a Woods-Saxon\nform [12–14]. In marked contrast, recent high-precision fusion data suggest that a much\nlarger diffuseness, between 0.8 and 1.4 fm, is needed to fit the data [9]. This is not just for\nparticular systems but seems to be a rather general result [4,10,15–18]. Note that fusion\ndepends strongly on the potential on both sides of the barrier, in contrast to the elastic\nscattering which depends mainly on the potential on the outside. At high energies, the\nfusion cross section changes with the diffuseness due to the way the position and height of\nthe l-dependent barrier change with increasing l. At lower energies, the main effect comes\nfrom the overall width of the barrier. A large diffuseness seems to be derirable in both these\nrespects [9].\nFor a fixed value of the barrier height B, the barrier curvature h̄ω is approximately\nproportional to a−1/2 [7]. Eq. (3) then indicates that the logarithmic slope L(E) is roughly\nproportional to a1/2 . The large experimental slope found in Ref. [5] may therefore be another\nindication of the large surface diffusenesses already noted in heavy-ion fusion. In order to\nassess this, we perform the exact coupled-channels calculations for the 58 Ni + 58 Ni reaction\nusing the computer code CCFULL [8] with different values of the surface diffuseness. This code\nuses the isocentrifugal approximation to reduce the dimensionality of the coupled-channels\nequations (see Ref. [8] for details) but we have checked that this is still valid at energies\nwell below the Coulomb barrier. In the calculations, we include the double quadrupolephonon excitations in both the projectile and target nuclei. A similar coupling scheme\nsuccessfully explained the experimental fusion cross section and barrier distribution for the\nvery similar 58 Ni + 60 Ni system [17]. The dynamical quadrupole deformation parameter\nβ2 for the Coulomb coupling is estimated to be 0.177 from the experimental B(E2) [19]\nwith the radius parameter rcoup = 1.2 fm. We require a somewhat larger value of β2 =\n0.261 (with rcoup = 1.06 fm) for the nuclear coupling in order to fit the data. The fusion\nreaction often requires a radius parameter of around 1.06 fm, smaller than the usual value of\naround 1.2 fm, used to extract a deformation parameter from the electromagnetic transition\nprobability. This results in a larger deformation parameter as well as in a larger deformation\nlength β * rcoup . Although the Coulomb-coupling hamiltonian is independent of the value\nof the radius parameter to be used, the nuclear coupling term depends on it through the\ncombination β * rcoup . Therefore, this problem may also be related to the parametrization of\nthe nucleus-nucleus potential and thus to the large surface diffuseness problem, though the\nvalue of rcoup = 1.06 fm should be reasonable for finite nuclei with a diffuse surface [20].\nIn Fig. 3, we show the dependence of the fusion cross section (upper panel) and of\nthe logarithmic slope (lower panel) on the surface diffuseness parameter a for the 58 Ni +\n58\nNi reaction. The figure also includes the experimental data [21] for comparison. The\nexperimental slope was computed using point-difference formulae with both two and three\nsuccessive data points. The dotted line is the result with the nuclear potential shown in\n4\n\n\fFig. 1, that is with a=0.65 fm, while the dashed line is obtained with the potential parameters\nV0 = 195 MeV, r0 = 0.94 fm and a= 1.0 fm. The former leads to a cross section whose slope\nis not steep enough to account for the experimental data at energies below the barrier. As a\nconsequence, the logarithmic slope L(E) is underestimated at these energies, as in Ref. [5].\nOn the other hand, the potential with a=1.0 fm improves the agreement considerably both\nfor the cross section and the logarithmic slope. We also include in the figure a calculation\nwith a = 1.3 fm (solid line). This further improves the fit to the logarithmic slope, although\nit somewhat worsens the fit to the cross section itself at incident energies around 97 MeV.\n(We have confirmed that none of these results depends on the value of r0 as long as V0 is\nadujusted so that the barrier height remains unchanged.) Clearly, the experimental data\nfavor a large value of the surface diffuseness, as in many other systems in the literature.\nIn summary, the \"unexpected\" behavior of heavy-ion fusion cross sections at extreme\nsubbarrier energies claimed in Ref. [5] has two causes. One is the use of the Wong formula\nwhich is inadequate at energies far below the barrier. The exact numerical calculation is\nvital in discussing the fusion cross section and especially the logarithmic slope L(E) at low\nenergies. We pointed out that the exact calculation shows a similar energy dependence of\nthe logarithmic slope as in the experimental data even without coupling. The other reason\nfor this apparent anomaly is the use of a diffuseness parameter which is widely used in\ncalculations for scattering processes, that is a ≈ 0.63 fm. This potential leads to fusion cross\nsections whose logarithmic slope is much smaller than for the experimental data at deep\nsubbarrier energies. If such a calculation is used as a reference, the experimental data may\nappear to fall much more steeply than expected [5]. However, if one uses a larger value of\nthe diffuseness parameter in the phenomenological potential, the data can be reproduced\nwithin the present coupled-channels framework. The need for a large diffuseness to describe\nthe fusion process has also been found consistently in other systems. However, the reason\nfor the large differences in diffuseness parameters extracted from scattering and from fusion\nanalyses remains an open problem. In particular, it is still not clear whether a large surface\ndiffuseness reflects the true nature of the potential or simply mocks up other effects which\ncause a rapid decrease of fusion at low energies. In this context, we mention that neither the\ndouble-folding potential [9] (which is usually much deeper and narrower than the WoodsSaxon) nor the geometrical corrections to the coupling potential [22] seem to resolve this\nproblem.\nMore experimental and theoretical studies of fusion at deep subbarrier energies are needed\nto improve our understanding of this process which may be especially important in astrophysical fusion reactions. Isotopic dependences may also be of interest, particularly for\nexotic nuclei whose surface properties may be modified by the presence of weakly bound\nnucleons.\nK.H. thanks the Nuclear Theory Group at the IPN Orsay for its hospitality, and the\nKyoto University Foundation for financial support. M.D. acknowledges financial support\nfrom the Australian Research Council.\n\n5\n\n\fFIGURES\n58\n\nV(r) (MeV)\n\n100\n\n58\n\nVn(r) + VC(r)\nParabolic Approximation\n\nNi + Ni\n\n90\n\n80\n\n70\n\n60\n\n5\n\n10\n\n15\n\n20\n\nr (fm)\nFIG. 1. The nucleus-nucleus potential for the 58 Ni + 58 Ni reaction. The solid line is obtained\nwith a Woods-Saxon nuclear potential with parameters V0 =160 MeV, r0 =1.1 fm, and a = 0.65 fm.\nThe dashed line shows the quadratic expansion of the potential around the barrier position.\n\n6\n\n\flog10(σ)\n-1\n\nd(ln(σE))/dE (MeV )\n\n4\n2\n0\n-2\n-4\n-6\n-8\n-10\n-12\n-14\n-16\n2.5\n\n58\n\n58\n\nNi + Ni\n\nExact\nWong Formula\n\n2\n1.5\n1\n0.5\n0\n80\n\n85\n\n90\n95 100\nEcm (MeV)\n\n105\n\n110\n\nFIG. 2. The validity of the Wong formula (2) for the fusion cross section for the 58 Ni + 58 Ni\nsystem. The upper panel shows the fusion cross section σ (in mb) on a logarithmic scale, while the\nlower panel shows the logarithmic slope L(E) = d(ln(σE))/dE. The solid and dashed lines denote\nthe exact numerical results and the Wong cross section, respectively.\n\n7\n\n\f10\n\n3\n58\n\n2\n\n58\n\nNi + Ni\n\nσ (mb)\n\n10\n\n10\n\n0\n\n10\n10\n\nd(ln(σE))/dE (MeV )\n\n10\n-1\n\n1\n\n-1\n\n-2\n\n4\nExpt\na = 0.65 fm\na = 1.0 fm\na = 1.3 fm\n\n3\n2\n1\n0\n\n95\n\n100\n105\nEcm (MeV)\n\n110\n\nFIG. 3. Dependence of the fusion cross section (upper panel) and the logarithmic slope (lower\npanel) on the surface diffuseness parameter a for the 58 Ni + 58 Ni reaction. The dotted, dashed and\nsolid lines are coupled-channels results using diffuseness parameters of 0.65 fm, 1.0 fm and 1.3 fm,\nrespectively. The double quadrupole-phonon exitations in both the projectile and target are taken\ninto account. Experimental data are from Ref. [21].\n\n8\n\n\fREFERENCES\n[1] N. Rowley, G.R. Satchler, and P.H. Stelson, Phys. Lett. B254, 25 (1991).\n[2] M. Dasgupta, D.J. Hinde, N. Rowley, and A.M. Stefanini, Annu. Rev. Nucl. Part. Sci.\n48, 401 (1998).\n[3] A.B. Balantekin and N. Takigawa, Rev. Mod. Phys. 70, 77 (1998).\n[4] J.R. Leigh, M. Dasgupta, D.J. Hinde, J.C. Mein, C.R. Morton, R.C. Lemmon, J.P.\nLestone, J.O. Newton, and N. Rowley, Phys. Rev. C52, 3151 (1995).\n[5] C.L. Jiang, H. Esbensen, K.E. Rehm, B.B. Back, R.V.F. Janssens, J.A. Caggiano, P.\nCollon, J. Greene, A.M. Heinz, D.J. Henderson, I. Nishinaka, T.O. Pennington, and D.\nSeweryniak, Phys. Rev. Lett. 89, 052701 (2002).\n[6] C.Y. Wong, Phys. Rev. Lett. 31, 766 (1973).\n[7] N. Rowley and A.C. Merchant, Astro. Phys. J. 381, 591 (1991).\n[8] K. Hagino, N. Rowley, and A.T. Kruppa, Comp. Phys. Comm. 123, 143 (1999).\n[9] K. Hagino, M. Dasgupta, I.I. Gontchar, D.J. Hinde, C.R. Morton, and J.O. Newton,\ne-print:nucl-th/0110065, and references therein.\n[10] J.O. Newton, C.R. Morton, M. Dasgupta, J.R. Leigh, J.C. Mein, D.J. Hinde, H. Timmers, and K. Hagino, Phys. Rev. C64, 064608 (2001).\n[11] In the limit of R0 → 0, the action integral for this model is given by πη(E), where η(E) =\nZP ZT e2 /h̄v is the Sommerfeld parameter. For this, S ′ (E) and S ′′ (E) are proportional\nto −E −3/2 /2 and +3E −5/2 /4, respectively.\n[12] P.R. Christensen and A. Winther, Phys. Lett. B65, 19 (1976).\n[13] L.C. Chamon, D. Pereira, E.S. Rossi, C.P. Silva, H. Dias, L. Losano, and C.A.P.\nCeneviva, Nucl. Phys. A597, 253 (1996).\n[14] C.P. Silva, M.A.G. Alvarez, L.C. Chamon, D. Pereira, M.N. Rao, E.S. Rossi, L.R.\nGasques, M.A.E. Santo, R.M. Anjos, J. Lubian, P.R.S. Gomes, C. Muri, B.V. Carlson,\nS. Kailas, A. Chatterjee, P. Singh, A. Shrivastava, K. Mahata, and S. Santra, Nucl.\nPhys. A679, 287 (2001).\n[15] C.R. Morton, A.C. Berriman, M. Dasgupta, D.J. Hinde, J.O. Newton, K. Hagino, and\nI.J. Thompson, Phys. Rev. C60, 044608 (1999).\n[16] C.R. Morton, A.C. Berriman, R.D. Butt, M. Dasgupta, D.J. Hinde, A. Godley, J.O.\nNewton, and K. Hagino, Phys. Rev. C64, 034604 (2001).\n[17] A.M. Stefanini, D. Ackermann, L. Corradi, D.R. Napoli, C. Petrache, P. Spolaore, P.\nBednarczyk, H.Q. Zhang, S. Beghini, G. Montagnoli, L. Mueller, F. Scarlassara, G.F.\nSegato, F. Sorame, and N. Rowley, Phys. Rev. Lett. 74, 864(1995).\n[18] A.M. Sefanini, L. Corradi, A.M. Vinodkumar, Y. Feng, F. Scarlassara, G. Montagnoli,\nS. Beghini, and M. Bisogno, Phys. Rev. C62, 021601 (2001).\n[19] M.R. Bhat, Nucl. Data Sheets 80, 789 (1997).\n[20] D.M. Brink and N. Rowley, Nucl. Phys. A219, 79 (1974).\n[21] M. Beckerman, J. Ball, H. Enge, M. Salomaa, A. Sperduto, S. Gazes, A. DiRienzo, and\nJ.D. Molitoris, Phys. Rev. C23, 1581 (1981).\n[22] I.I. Gontchar, M. Dasgupta, D.J. Hinde, R.D. Butt, and A. Mukherjee, Phys. Rev. C65,\n034610 (2002).\n\n9\n\n\f"}