{"id": "http://arxiv.org/abs/nucl-th/0108008v2", "guidislink": true, "updated": "2001-12-06T10:15:54Z", "updated_parsed": [2001, 12, 6, 10, 15, 54, 3, 340, 0], "published": "2001-08-04T13:00:49Z", "published_parsed": [2001, 8, 4, 13, 0, 49, 5, 216, 0], "title": "Nuclear Matter Spectral Functions by Transport Theory", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=nucl-th%2F0701066%2Cnucl-th%2F0701024%2Cnucl-th%2F0701046%2Cnucl-th%2F0701019%2Cnucl-th%2F0701003%2Cnucl-th%2F0701068%2Cnucl-th%2F0701096%2Cnucl-th%2F0701041%2Cnucl-th%2F0701061%2Cnucl-th%2F0701057%2Cnucl-th%2F0701094%2Cnucl-th%2F0701036%2Cnucl-th%2F0701008%2Cnucl-th%2F0701082%2Cnucl-th%2F0701089%2Cnucl-th%2F0701064%2Cnucl-th%2F0701035%2Cnucl-th%2F0701043%2Cnucl-th%2F0701005%2Cnucl-th%2F0701027%2Cnucl-th%2F0701001%2Cnucl-th%2F0701013%2Cnucl-th%2F0701048%2Cnucl-th%2F0701079%2Cnucl-th%2F0701077%2Cnucl-th%2F0701054%2Cnucl-th%2F0701038%2Cnucl-th%2F0701098%2Cnucl-th%2F0701090%2Cnucl-th%2F0701016%2Cnucl-th%2F0701085%2Cnucl-th%2F0701028%2Cnucl-th%2F0701007%2Cnucl-th%2F0701063%2Cnucl-th%2F0701088%2Cnucl-th%2F0701073%2Cnucl-th%2F0701025%2Cnucl-th%2F0701049%2Cnucl-th%2F0701095%2Cnucl-th%2F0701093%2Cnucl-th%2F0701053%2Cnucl-th%2F0701076%2Cnucl-th%2F0701017%2Cnucl-th%2F0701075%2Cnucl-th%2F0701069%2Cnucl-th%2F0701051%2Cnucl-th%2F0701083%2Cnucl-th%2F0701087%2Cnucl-th%2F0701078%2Cnucl-th%2F0701047%2Cnucl-th%2F0701045%2Cnucl-th%2F0701052%2Cnucl-th%2F0108001%2Cnucl-th%2F0108068%2Cnucl-th%2F0108037%2Cnucl-th%2F0108028%2Cnucl-th%2F0108067%2Cnucl-th%2F0108042%2Cnucl-th%2F0108021%2Cnucl-th%2F0108064%2Cnucl-th%2F0108041%2Cnucl-th%2F0108065%2Cnucl-th%2F0108053%2Cnucl-th%2F0108066%2Cnucl-th%2F0108032%2Cnucl-th%2F0108025%2Cnucl-th%2F0108013%2Cnucl-th%2F0108045%2Cnucl-th%2F0108049%2Cnucl-th%2F0108048%2Cnucl-th%2F0108027%2Cnucl-th%2F0108044%2Cnucl-th%2F0108003%2Cnucl-th%2F0108014%2Cnucl-th%2F0108006%2Cnucl-th%2F0108016%2Cnucl-th%2F0108047%2Cnucl-th%2F0108052%2Cnucl-th%2F0108019%2Cnucl-th%2F0108056%2Cnucl-th%2F0108046%2Cnucl-th%2F0108072%2Cnucl-th%2F0108010%2Cnucl-th%2F0108031%2Cnucl-th%2F0108059%2Cnucl-th%2F0108061%2Cnucl-th%2F0108073%2Cnucl-th%2F0108036%2Cnucl-th%2F0108070%2Cnucl-th%2F0108009%2Cnucl-th%2F0108033%2Cnucl-th%2F0108050%2Cnucl-th%2F0108022%2Cnucl-th%2F0108008%2Cnucl-th%2F0108023%2Cnucl-th%2F0108062%2Cnucl-th%2F0108057%2Cnucl-th%2F0108043%2Cnucl-th%2F0108002%2Cnucl-th%2F0108029%2Cnucl-th%2F0108063&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Nuclear Matter Spectral Functions by Transport Theory"}, "summary": "Quantum transport theory is used to calculate the nucleon spectral function\nin infinite nuclear matter. A self-consistent description is obtained by\nutilizing the relations between collision rates and correlation functions.\nStatic and dynamical self-energies are taken into account in the single\nparticle propagators. The real parts of the non-static self-energy\ncontributions are calculated by dispersion theory thus conserving the\nanalyticity of momentum distributions. The transport theoretical spectral\nfunctions, momentum distributions, occupation probabilities and responce\nfunctions are in close agreement with results of variational and other\nmany-body theoretical calculations. The results indicate that the nucleon\nspectral functions are determined only by the average short-range correlation\nstrength.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=nucl-th%2F0701066%2Cnucl-th%2F0701024%2Cnucl-th%2F0701046%2Cnucl-th%2F0701019%2Cnucl-th%2F0701003%2Cnucl-th%2F0701068%2Cnucl-th%2F0701096%2Cnucl-th%2F0701041%2Cnucl-th%2F0701061%2Cnucl-th%2F0701057%2Cnucl-th%2F0701094%2Cnucl-th%2F0701036%2Cnucl-th%2F0701008%2Cnucl-th%2F0701082%2Cnucl-th%2F0701089%2Cnucl-th%2F0701064%2Cnucl-th%2F0701035%2Cnucl-th%2F0701043%2Cnucl-th%2F0701005%2Cnucl-th%2F0701027%2Cnucl-th%2F0701001%2Cnucl-th%2F0701013%2Cnucl-th%2F0701048%2Cnucl-th%2F0701079%2Cnucl-th%2F0701077%2Cnucl-th%2F0701054%2Cnucl-th%2F0701038%2Cnucl-th%2F0701098%2Cnucl-th%2F0701090%2Cnucl-th%2F0701016%2Cnucl-th%2F0701085%2Cnucl-th%2F0701028%2Cnucl-th%2F0701007%2Cnucl-th%2F0701063%2Cnucl-th%2F0701088%2Cnucl-th%2F0701073%2Cnucl-th%2F0701025%2Cnucl-th%2F0701049%2Cnucl-th%2F0701095%2Cnucl-th%2F0701093%2Cnucl-th%2F0701053%2Cnucl-th%2F0701076%2Cnucl-th%2F0701017%2Cnucl-th%2F0701075%2Cnucl-th%2F0701069%2Cnucl-th%2F0701051%2Cnucl-th%2F0701083%2Cnucl-th%2F0701087%2Cnucl-th%2F0701078%2Cnucl-th%2F0701047%2Cnucl-th%2F0701045%2Cnucl-th%2F0701052%2Cnucl-th%2F0108001%2Cnucl-th%2F0108068%2Cnucl-th%2F0108037%2Cnucl-th%2F0108028%2Cnucl-th%2F0108067%2Cnucl-th%2F0108042%2Cnucl-th%2F0108021%2Cnucl-th%2F0108064%2Cnucl-th%2F0108041%2Cnucl-th%2F0108065%2Cnucl-th%2F0108053%2Cnucl-th%2F0108066%2Cnucl-th%2F0108032%2Cnucl-th%2F0108025%2Cnucl-th%2F0108013%2Cnucl-th%2F0108045%2Cnucl-th%2F0108049%2Cnucl-th%2F0108048%2Cnucl-th%2F0108027%2Cnucl-th%2F0108044%2Cnucl-th%2F0108003%2Cnucl-th%2F0108014%2Cnucl-th%2F0108006%2Cnucl-th%2F0108016%2Cnucl-th%2F0108047%2Cnucl-th%2F0108052%2Cnucl-th%2F0108019%2Cnucl-th%2F0108056%2Cnucl-th%2F0108046%2Cnucl-th%2F0108072%2Cnucl-th%2F0108010%2Cnucl-th%2F0108031%2Cnucl-th%2F0108059%2Cnucl-th%2F0108061%2Cnucl-th%2F0108073%2Cnucl-th%2F0108036%2Cnucl-th%2F0108070%2Cnucl-th%2F0108009%2Cnucl-th%2F0108033%2Cnucl-th%2F0108050%2Cnucl-th%2F0108022%2Cnucl-th%2F0108008%2Cnucl-th%2F0108023%2Cnucl-th%2F0108062%2Cnucl-th%2F0108057%2Cnucl-th%2F0108043%2Cnucl-th%2F0108002%2Cnucl-th%2F0108029%2Cnucl-th%2F0108063&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Quantum transport theory is used to calculate the nucleon spectral function\nin infinite nuclear matter. A self-consistent description is obtained by\nutilizing the relations between collision rates and correlation functions.\nStatic and dynamical self-energies are taken into account in the single\nparticle propagators. The real parts of the non-static self-energy\ncontributions are calculated by dispersion theory thus conserving the\nanalyticity of momentum distributions. The transport theoretical spectral\nfunctions, momentum distributions, occupation probabilities and responce\nfunctions are in close agreement with results of variational and other\nmany-body theoretical calculations. The results indicate that the nucleon\nspectral functions are determined only by the average short-range correlation\nstrength."}, "authors": ["J. Lehr", "H. Lenske", "S. Leupold", "U. Mosel"], "author_detail": {"name": "U. Mosel"}, "author": "U. Mosel", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/S0375-9474(01)01534-2", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/nucl-th/0108008v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/nucl-th/0108008v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "24 pages, 8 figures, few changes in the text, new figure 3", "arxiv_primary_category": {"term": "nucl-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "nucl-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/nucl-th/0108008v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/nucl-th/0108008v2", "journal_reference": "Nucl.Phys. A703 (2002) 393-408", "doi": "10.1016/S0375-9474(01)01534-2", "fulltext": "arXiv:nucl-th/0108008v2 6 Dec 2001\n\nNuclear Matter Spectral Functions by\nTransport Theory∗\nJ. Lehr a , H. Lenske a , S. Leupold\na\n\na\n\nand U. Mosel\n\na,b\n\nInstitut für Theoretische Physik, Universität Giessen,\nHeinrich-Buff-Ring 16, D-35392 Giessen, Germany\n\nb\n\nInstitute for Nuclear Theory, University of Washington,\nBox 351550, Seattle, WA 98195, USA\n\nUGI-01-05\nAugust 30, 2018\n\nAbstract\nQuantum transport theory is used to calculate the nucleon spectral\nfunction in infinite nuclear matter. A self-consistent description is obtained by utilizing the relations between collision rates and correlation\nfunctions. Static and dynamical self-energies are taken into account in\nthe single particle propagators. The real parts of the non-static selfenergy contributions are calculated by dispersion theory thus conserving the analyticity of momentum distributions. The transport theoretical spectral functions, momentum distributions, occupation probabilities and responce functions are in close agreement with results of\nvariational and other many-body theoretical calculations. The results\nindicate that the nucleon spectral functions are determined only by\nthe average short-range correlation strength.\n\nPACS numbers: 21.65.+f, 24.10.Cn\nKeywords: nuclear matter, many-body theory, nucleon spectral function\n∗\n\nWork supported by BMBF, DFG and GSI Darmstadt\n\n1\n\n\f1\n\nIntroduction\n\nA still controversial problem of nuclear many-body theory is the content of\nshort-range correlations in nuclear matter and finite nuclei. The experimentally observed spectral functions, e.g. measured in A(e, e′ p)X [1] and more\nrecent A(e, e′ pp)X [2] experiments clearly show the presence of a sizeable\namount of high-momentum processes in nuclei not accounted for by meanfield dynamics. The observed pattern of the energy and momentum distributions indicates considerable admixtures of dynamical short-range correlations\nbeyond the level of a static mean-field. While typical (e, e′ ) experiments are\nperformed on stable target nuclei corresponding to densities close to saturation extreme nucleon removal reactions with dripline nuclei like 11 Be and 19 C\n[3, 4] show increasing evidence for dynamical correlations also in low density\nnuclear matter.\nAn overall measure of short-range correlations in nuclear matter is the\ndepletion of ground state momentum distributions from a pure Fermi gas\npicture by about 10%. The deviations are due to processes scattering nucleons from states inside the Fermi sphere into high momentum configurations\nwhich clearly are not of mean-field nature. As a result, the momentum distribution obtains a high momentum tail extending significantly beyond the\nFermi surface. An important finding is that the magnitude and the shape of\nthe high momentum component is almost independent of the system under\nconsideration while the low momentum parts, especially in light nuclei, are\naffected by the shell structure and finite size effects. Hence, the high momentum tails of the spectral functions are likely to reflect a universal property\nof nuclear many-body dynamics at short distances.\nThe whole subject has become of renewed interest by the recent discussions on off-shell transport theory and in-medium cross sections [5], structure\nfunctions in a nuclear environment [6] and the QCD-related phenomenon of\ncolor transparency [7, 8]. The standard approach, taken for granted in most\nof the theoretical studies, is to assume that nucleons in a nuclear medium\nbehave similar as in free space except for a change of the energy-momentum\nrelation giving rise to a modified single particle spectrum but still concentrating the strength at the \"on-shell\" mean-field point. It has to be realized,\nhowever, that such a strict quasi-particle assumption is only partially supported by the available data. A general observation, e.g. in (e, ep) data is\nthat the deviations increase for states deep inside the Fermi sphere.\nInvestigations on non-standard phenomena rely on a safe understanding of\n2\n\n\fthe many-body theoretical aspects of short-range correlations. In fact, the results obtained from many-body theory describe the available data rather satisfactorily. The majority of the model calculations for infinite matter are using Brueckner and Dirac-Brueckner techniques, see e.g. [9, 10, 11, 12, 13, 14].\nAn explanation referring to the QCD aspects of strong interactions was proposed in [7]. In [15] a correlation dynamical treatment was applied. The\nDirac-Brueckner calculations in [13], including hole-hole propagation, led to\nan extended and numerically rather involved energy-momentum structure of\nself-energies but the net effect on binding energies and occupation probabilities was surprisingly moderate. Most of the approaches use the quasi-particle\napproximation, i.e. assuming a sharp energy distribution for the nucleons in\nintermediate states (see e.g. [16]); only very recently self-consistent calculations, going beyond the quasiparticle approximation, have been performed\n[17]. Occupation probabilities in stable nuclei could be well described by\nsecond RPA [18] and by polarization self-energies [19], respectively, also in\nunstable nuclei [4, 3].\nIn this paper the quantum transport theoretical description of nucleon\nspectral functions in nuclear matter presented in [20] is discussed in more\ndetail and extended in several aspects by considering additional observables.\nSince a long time transport theory is known to be in principle the correct\ndescription [21, 22, 23] for spectral functions. But explicit calculations on\na realistic level were pending, also because an appropriate treatment of offshell effects in transport equations was missing. The recent progress on\nimplementing off-shell transport for heavy-ion and other nuclear collisions\nnumerically [24, 25, 26] and theoretically [5] were important pre-requisites\nfor the studies in [20] and the present work.\nThe theoretical background formulae are summarized in section 2. Since\ncollision rates and correlation functions are directly related, the calculation\nof either of the two quantities depends on the knowledge of the other one.\nTheoretically, this rather involved self-consistency problem cannot be solved\nin closed form, but a practical approach is obtained by an iterative sequence\nof successive approximations for self-energies, spectral functions and collision\nintegrals [13, 20].\nDetails of the numerical realization of the many-body theoretical relations\nare discussed in section 3. In extension of the previous work [20] here we include also dispersive self-energies into the single particle propagators. These\nnon-static, i.e. energy and momentum dependent, self-energies are calculated\nby dispersion theory. In this way, the consistency of single particle dynamics\n3\n\n\fand spectral functions is enforced and, equally important, the analyticity of\nthe results is guaranteed. The equations are solved using an average matrix\nelement accounting primarily for the \"hard\" short-range collisions. Different\nto [20] here we include an energy and momentum dependent form factor.\nIn section 3 results for nuclear matter spectral functions, ground state momentum distributions, occupation probabilities and response functions are\npresented. The agreement with results obtained with many-body theory by\nBenhar et al. [27] and Ciofi degli Atti et al. [28, 29] is striking. It confirms\nthe universality of short-range correlations in nuclear systems and leads us\nto the conclusion that they are determined by an average matrix element\nrepresenting globally the hard in-medium collisions.\n\n2\n2.1\n\nSpectral Functions in Quantum Transport\nTheory\nTransport Theoretical Relations\n\nHere, the known fundamental relations of quantum transport theory [21, 22]\nfor the description of non-stationary processes in an interacting quantum\nsystem are briefly summarized, following closely the presentation in [20].\nIn quantum transport theory the non-stationary processes which introduce\na coupling between causal and anti-causal single particle propagation are\ndescribed by the one-particle correlation functions\ng > (1, 1′ ) = −ihΨ(1)Ψ† (1′ )i\ng < (1, 1′ ) = ihΨ† (1′ )Ψ(1)i,\n\n(1)\n\nwhere Ψ are the nucleon field operators in Heisenberg representation. Correspondingly, in an interacting quantum system the single particle self-energy\noperator includes correlation self-energies Σ<> which couple particle and hole\ndegrees of freedom [21, 22]. Clearly, g <> and Σ<> are closely related. The\nwanted relation is obtained from transport theory. After a Fourier transformation to energy-momentum representation the self-energies are found as\n[21]\nZ 3\nd p2 dω2 d3 p3 dω3 d3 p4 dω4\n>\nΣ (ω, p) = g\n(2π)4 δ 4 (p + p2 − p3 − p4 ) |M|2\n(2π)4 (2π)4 (2π)4\n× g < (ω2 , p2 )g > (ω3 , p3 )g > (ω4 , p4 ),\n(2)\n4\n\n\f<\n\nd3 p2 dω2 d3 p3 dω3 d3 p4 dω4\n(2π)4 δ 4 (p + p2 − p3 − p4 ) |M|2\n(2π)4 (2π)4 (2π)4\n× g > (ω2 , p2 )g < (ω3 , p3 )g < (ω4 , p4 ).\n(3)\n\nΣ (ω, p) = g\n\nZ\n\nHere, g = 4 is the spin-isospin degeneracy factor and |M|2 denotes the square\nof the in-medium nucleon-nucleon scattering amplitude, averaged over spin\nand isospin of the incoming nucleons and summed over spin and isospin of\nthe outgoing nucleons.\nSince both g <> and Σ<> describe the correlation dynamics, the spectral\nfunction can be obtained from either of the two quantities as the difference\nover the cut along the energy real axis. In terms of the correlation propagators, the spectral density is defined by\na(ω, p) = i (g > (ω, p) − g < (ω, p)) .\n\n(4)\n\nNon-relativistically, the single particle spectral function is explicitly found as\na(ω, p) =\n\nΓ(ω, p)\n(ω −\n\np2\n2mN\n\n− ReΣ(ω, p))2 + 41 Γ2 (ω, p)\n\n,\n\n(5)\n\nincluding the particle and hole nucleon self-energy Σ. The width Γ is given\nby the imaginary part of the retarded self-energy,\nΓ(ω, p) = 2ImΣ(ω, p) = i(Σ> (ω, p) − Σ< (ω, p)).\n\n(6)\n\nIn the limiting case of vanishing correlations, i.e. ImΣ → 0, the usual deltalike quasi-particle spectral function is recovered.\nThe correlation functions g <> can be re-written in terms of the phasespace distribution function f (ω, p):\ng < (ω, p) = ia(ω, p)f (ω, p),\ng > (ω, p) = −ia(ω, p)(1 − f (ω, p)).\n\n(7)\n(8)\n\nFor a system at T = 0, f reduces to\nf (ω, p) = Θ(ωF − ω)\n\n(9)\n\nwith the Fermi energy ωF . As a result,we obtain for the self-energies the\nconditions\nΣ> (ω, p) = 0,\nΣ< (ω, p) = 0,\n\nΓ(ω, p) = −iΣ< (ω, p) for ω ≤ ωF\nΓ(ω, p) = iΣ> (ω, p) for ω ≥ ωF .\n5\n\n(10)\n(11)\n\n\fDue to the dependence of the width and the single particle spectral function upon each other the calculation of a(ω, p) requires a self-consistent treatment. Therefore, the transport theoretical approach leads to single particle\npropagators including correlation self-energies to all orders by a complete\nresummation of the basic sunset diagram. The diagrammatic structure of\nDyson equation defining the correlated propagators is shown in Fig. 1.\n\n2.2\n\nThe Scattering Amplitude\n\nObviously, the correlation effects depend on the yet undetermined matrix element M. The question arises which processes contribute most significantly to\nM. Since the bulk of interactions giving rise to long-range mean-field interactions is already taken care of by the proper self-energies of particle and hole\nstates the correlation functions and self-energies must both be determined by\nthose parts of the fundamental interactions producing non-stationary effects\nbeyond the mean-field. An estimate of the relevant interaction scales can\nbe obtained by considering the physical situation, implying strong contributions from the high-momentum components of wave functions and interactions. From the observation that bulk self-energies include in their exchange\nparts momenta up to twice the Fermi momentum kF a realistic estimate\nis to identify processes involving momentum transfers q ≫ 2kF as the origin for short-range correlations. At the saturation point of nuclear matter\nwith kF ∼ 270 MeV/c this corresponds to collisions with q ≫ 600 MeV/c.\nSuch processes are located in the interaction regime of the ω and ρ vector\nmesons, typically accounting for the short-range repulsion in nucleon-nucleon\ninteractions. These processes are appropriately described by the short-range\nparts of a Brueckner G-matrix, accounting for the whole series of repeated\nmeson-exchange processes.\nIn addition to the ladder-type interactions from the exchange of individual\nmesons also three-body (and possibly even higher order) interactions will\ncontribute to short-range correlations in a nuclear medium. Such interactions\ninvolve the intermediate excitation of nucleon resonances which subsequently\ndecay back to the nucleon sector by an interaction with a third nucleon. Of\nsimilar importance are virtual excitations of NN pairs giving rise to the\nso-called Z graph contributions [30, 31]. The major contributions of these\nsub-nucleonic processes are known to be expressible to a good approximation\nin terms of an effective density dependent two-body interaction (see e.g. [32]),\nand, as such, will be part of M. The importance of such processes is indicated\n6\n\n\fe.g. by the variational nuclear matter calculations of the Urbana group [32]\nshowing a sizeable contribution from three-body interactions by subsequent\npion exchange already at and below saturation density. Interestingly, DiracBrueckner calculations including the polarization of the nucleonic Dirac sea\n[30] and investigations of three-nucleon interactions [31] also point to the\nimportance of dynamically generated repulsive short-range modes.\nIn this context it is of interest that the off-shell behavior of mesonexchange interactions is essentially determined by the mass of the exchanged\nboson. Hence, the matrix element M will vary only weakly on off-shell momenta, at least on a scale of about 1GeV/c, allowing to replace it to a good\napproximation by an energy and momentum independent constant, corresponding to an effective contact interaction. A similar approach is used in\nLandau-Migdal theory [33] describing interactions by the in-medium NN\nforward scattering amplitude at the Fermi surface. Different to conventional\nLandau-Migdal theory and to Ref. [20], here we will account for the remaining\ndependences at large momentum transfers by a global off-shell form factor\nF (ω, ~q), to be discussed below.\nTaken together, these arguments lead to the expectation that M is a\nquantity being almost independent of the specific system and the momentum transfer. The matrix element will reflect general properties of shortrange nucleonic many-body dynamics, mediated by hard processes (on the\nscale of typical nuclear momenta) of universal character. Sensitivity to a\nsingle, specific channel seems to be unlikely considering the experience that\nshort-range correlations are typically determined by a collection of interfering processes with strong mutual cancellations (see e.g. [31]). We assume\nuniversality and treat M as a global parameter.\n\n3\n3.1\n\nNumerical Approach and Results\nDetails of the Calculation\n\nDiagrammatically, the particle- and hole-type transition rates Σ> and Σ< ,\nEqs. (2) and (3), are of two-particle–one-hole (2p1h) and one-particle–twohole (1p2h) structure, respectively, as shown in Fig. 1. In this respect, they\nare of the same basic structure as the polarization self-energies considered\nin many-body theoretical descriptions. However, while in many-body theory\nthe polarization self-energies are typically included perturbatively in lowest\n7\n\n\forder only by performing the integrations over intermediate 2p1h and 1p2h\nstates with quasi-particle spectral functions, e.g. in Ref. [27] and also Refs.\n[18, 19], a more extended scheme accounting for higher order effects was\npresented in [20], where the correlation self-energies with the self-consistently\nobtained spectral functions were calculated. This allows a non-perturbative\nsummation of the whole series of np mh intermediate states as shown in [20].\nHowever, here we take advantage of the observation that already the\nfirst iteration agrees within a few percent with the final result of a fully\niterated calculation. Because the main effect of higher order iterations is to\nredistribute a minor fraction of the strength into the high momentum tails of\nspectral functions the results presented here remain accurate on the energymomentum scale relevant for the gross structures of spectral function and\nmomentum distribution in pure nucleonic matter. Hence, these results also\ncan be considered as re-confirming the validity of the perturbative treatment,\nassumed implicitly in previous investigations.\nAs already pointed out in [20] the numerical simplifications achieved when\nneglecting the off-shell dependence of M are at the expense of violating\nanalyticity, seen very clearly in an unrealistic behavior of the momentum\ndistribution for p ∼ pF . These problems are corrected by introducing an\nenergy and momentum dependent form factor\n\nF (ωtot , p~tot ) =\n\nΛ4\n\u0010\nΛ4 + ωtot +\n\np\n~2tot\n4mN\n\n\u00114\n\n(12)\n\nthat multiplies the average matrix element. Here ωtot = ω + ω2 = ω3 + ω4 ,\n~ptot = p~ + ~p2 = p~3 + p~4 and Λ = mN . The structure of the form factor was\nadopted from those applied in K matrix calculations (see e.g. [34]). Note\nthat the form factor is symmetric under the exchange of the incoming and\noutgoing nucleon pair as seen from the delta function in Eqs. (2), (3). It is\napparent that collisions at total energies and momenta beyond the scale of the\ncut-off Λ will be suppressed by the form factor. Because of the fourth power\nstructure and with our choice Λ = mN processes with on-shell momenta of\nup to ∼ 3kF are not affected by the form factor, especially leaving collisions\ninside the Fermi sphere untouched.\nTheoretically, the main advantage of using a form factor is that the polarization contribution ΣD to the real part of the single particle self-energies\ncan now be calculated explicitly and consistently by means of a subtracted\n8\n\n\fdispersion relation\np2\nΣD (ω, p) = (\n− ω) P\n2mN\n\nZ∞\n\n−∞\n\ndω ′\nΓ(ω ′, p)\n,\n2π (ω − ω ′ )( p2 − ω ′)\n\n(13)\n\n2mN\n\n2\n\np\nwhere the on-shell point ω = 2m\nis chosen as subtraction point. Note, that\nN\naccording to the above definition ΣD (ω, p) is a real quantity.\nIn order to account for the static mean-field a density dependent but energy and momentum independent real self-energy Σ0 is added, i.e. the real\npart of the self-energy becomes in total ReΣ(q, ω) = Σ0 + ΣD (q, ω). Eq. 13\ncorresponds to assume that dispersive on-shell self-energies are already included in the \"mean-field\" Σ0 , following closely the approach of phenomenological mean-field theory. In fact, the constant Σ0 only serves to define the\nscale for the excitation energy ω which in our case is given by ω ≥ ωF . Since\nwe are not interested in the dependence of our results on the density but\nonly study the system at nuclear saturation density, we can absorb Σ0 into\nω, i.e. we re-define ω by ω + Σ0 for the following. Compared to [20], this\ncorresponds to a shift of the energy scale by about 52.6 MeV.\nIn general, Σ0 will also include momentum dependent contributions, reflecting the non-localities of the Hartree-Fock mean-field and the on-shell\npart of ΣD , respectively. An estimate in the effective mass approximation,\ni.e. absorbing 3-momentum dependent effects into the kinetic energy term,\nshowed that this type of momentum dependence primarily leads to a rescaling of energies by a (density dependent) constant given by the ratio of the\neffective mass to the bare mass. Conservation of probability requires to\nmultiply a corresponding factor to the spectral functions. The net result is\nthat spectral functions are almost unchanged if both scaling effects are taken\nproperly into account. Because we are primarily interested in investigating\nthe energy-momentum structure of dispersive off-shell self-energies we neglect such contributions, also for the sake of having a minimal set of free\nparameters.\nStarting from the vacuum spectral function of the nucleon\n\nainitial (ω, p) = 2πδ(ω −\n\n9\n\np2\n),\n2mN\n\n(14)\n\n\fone obtains from Eqs.(2), (3) the following expression for the self-energies:\n±ig\nΣ (ω, p) =\n4π 3\n<\n\n>\n\nZ∞\n0\n\ndk\n\nZ∞\n\ndq\n\nkq 2 mN\nk2\n− 2q 2 + p2 + 2pk)\n|M0|2 F 2 Θ(2mN ω +\np\n2\n\n0\n\nk2\n+ 2q 2 − p2 )\n× Θ(2pk − 2mN ω −\n2\nk2\nk2\n× Θ(± ± 2q 2 ∓ 2mN ω ∓ p2F ) Θ(±p2F ∓\n∓ q2)\n2\n4\n2\n\u0011\n\u0010\np2F − k4 − q 2\nk\nk\nΘ(q ± ∓ pF ) .\n× Θ(±pF − q ∓ ) ±\n2\nkq\n2\n\n(15)\n\nHere ~k = p~3 + ~p4 , ~q = (~p3 − p~4 )/2 and p2F = 2mN ωF . The upper sign refers\nto Σ< , the lower one to Σ> .\nThe average NN (off-shell) scattering amplitude M0 , which determines\nthe self-energies and spectral functions, was treated as a universal parameter.\nAdjusting it to the spectral functions from many-body calculations of Benhar\n\u00111/2\n\u0010\n=207 MeV fm3 .\net al. [27] we derive |M0|2\n\u0010\n\u00111/2\nRelating the derived |M0 |2\nto on-shell processes would correspond to\na constant total NN cross section of about 20 mb accounting for roughly 2/3\nof the commonly used value. The above strength, however, compares very\nwell with the in-medium scattering amplitude of +221.0 MeV fm3 derived\nby Landau-Migdal theory from the nuclear equation of state for the Urbana\ninteraction model [32], averaged over the Fermi sphere and spin and isospin.\nSince the calculations of [27] were performed in the correlated basis function\napproach, including also the three-body nucleon interactions in the Urbana\n\u0010\n\u00111/2\nprescription [32], we consider the derived value for |M0 |2\nas a realistic\noverall measure for correlations in nuclear matter.\n\n3.2\n\nNucleon Self-Energies and Spectral Functions\n\nBefore discussing the full spectral function Eq. (5), it is worthwhile to consider the influence of the form factor on the width and the spectral function\nwithout the dispersive ΣD contribution. In Fig. 2 we show the results for the\nspectral nucleon width using i) the constant matrix element described above\n10\n\n\fand ii) the additional form factor from Eq. (12) for different momenta. It\nis worth noting that the influence of the form factor is completely different\nfor energies below and above the Fermi energy: while for ω > ωF there is a\nstrong suppression of the width for energies larger than 0.5 GeV, for ω < ωF\nthe results for the calculations with and without form factor almost coincide.\nThe reason for the weak influence for ω < ωF can be found in the step functions in Eq. (15). The nucleons are treated on-shell, thus Eq. (12) reduces\nto\nΛ4\n\nF (k, q) =\nΛ4 +\n\n\u0010\n\nk2\n2mN\n\n+\n\nq2\nmN\n\n\u00114 .\n\nHence, for hole-type states where k 2 /2 + q 2 < 2p2F (see fourth step function\nin Eq. (15) for Σ< ), F 2 > 0.999 deviates only insignificantly from unity.\nThe observed behavior of the width in the calculations with and without\nform factor transmits to the spectral function, as can be seen in Fig. 3. The\nform factor strongly affects the high energy tails of the particle-type spectral\nfunctions at ω > ωF while for energies below ωF the changes are negligible.\nThis is a very satisfying result showing that the momentum distribution\nn(p) =\n\nZωF\n\ndω\na(ω, p)\n2π\n\n(16)\n\n−∞\n\nis almost independent of the form factor. Also shown in Fig. 3 are the results\nfrom Benhar et al. [27].\nWe are now in the position to calculate the full spectral function, including\nalso the dispersive self-energy ΣD , Eq. (13). In Fig. 4 results for ΣD and\nΓ = 2ImΣ are displayed. Due to the decrease of Γ with increasing momentum\nalso ΣD is reduced. Therefore, the dispersive real part is expected to vanish at\nhigh p. This can be seen in Fig. 5, where the results for the spectral function\nwith and without ΣD are presented. At the on-shell point the difference of\np2\n, p) ≡ 0 by definition. Comparing to\nthe two curves vanishes because ΣD ( 2m\nN\nFig. 3 the combined action of the form factor and ΣD gives rise to a slight redistribution of the strengths in the tail regions but leaves the region around\nthe quasi-particle peak almost unaffected.\nThe influence of the analyticity of the self-energies on the momentum\ndistribution (16) is illustrated in Fig. 6. Indeed, as anticipated before, the\n11\n\n\fbehavior of n(p) below pF is totally changed from a strong increase to a\nsmooth decrease towards pF being now in agreement with many-body results e.g. [13, 27]. For momenta above pF the differences between the two\napproaches are almost negligible.\n\n3.3\n\nOccupation Probabilities\n\nAnalyticity directly affects the normalization of the spectral function,\nN(p) =\n\nZ∞\n\ndω\na(ω, p),\n2π\n\n(17)\n\n−∞\n\nwhere conservation of probability requires N(p) ≡ 1. Whereas the calculation\nwithout ΣD violates this condition - varying with momentum and reaching\nvalues of up to 30 % - the inclusion of the dispersive self-energy ΣD leads to\na properly normalized spectral function over the full momentum range.\nThe physical significance of ΣD becomes evident by considering\nZ(ω, p) =\n\n1\n1−\n\n∂ΣD (ω,p)\n∂ω\n\n(18)\n\nwhich at the pole positions is known to describe the energy (and momentum)\ndependent wave function renormalization or spectroscopic factor accounting\nfor the dissipation of single particle strength into the more complex manyp2\nbody configurations. Results for Z(ω, p) at the on-shell energy ω = 2m\nare displayed in Fig. 7. The overall shape follows roughly the spectroscopic\nfactors from the many-body calculations of Benhar et al. [27], also shown\nin the figure for comparison. In magnitude our results are different, being\nhigher by about 7% at the Fermi surface.\n\n3.4\n\nThe Density Response of Nuclear Matter\n\nInclusive scattering of high-energetic electrons off nuclei measures directly\nthe longitudinal and transversal density response functions from which information on the density-density correlation function is obtained [35]. Moreover, the nuclear response function is of current interest because it enters\ndirectly into investigations of scaling behavior and color transparency [6, 8].\n\n12\n\n\fAt large momenta the density response is expected to be determined by universal properties of nuclear systems, being independent of the system under\nconsideration.\nHere, we neglect final state interactions (FSI) of the struck nucleon with\nthe bulk and consider the density response of infinite nuclear matter in plane\nwave impulse approximation (PWIA) only. In the non-relativistic limit the\ndensity response (per energy) is defined by\n1\nS(ω, p) =\nVF\n\nZ\n\n\u0013\n\u0012\ndε d3 k\n|~p + ~k|2\nΘ(|~p + ~k| − kF ), (19)\na(ε, k)δ ω + ε −\n2π (2π)3\n2mN\n\nwhere, according to our definition of spectral functions a normalization to\nthe volume of the Fermi sphere,\nZ\nd3 k\nVF =\nΘ(kF − k),\n(20)\n(2π)3\nwas introduced. The spectral function a(ε, k) is seen to act in Eq. (19) as\na source for the energy and momentum distribution of the ejected nucleons.\nAt large momentum transfers where the FSI become negligibly small the\nPWIA results are expected to carry already the relevant information. In\nFig. 8 the PWIA nuclear matter response function for several momenta are\nshown. In each case the maximum appears at the quasi-elastic (on-shell)\np2\n, as typical for quasi-free scattering. The widths of the\nenergy ωQE = 2m\ndistributions correlates with the Fermi momentum. Results of Benhar et al.\n[27, 36] are also given in this figure as dashed lines.\nConsidering the strong simplifications of the present approach the overall agreement in shape and magnitude is remarkable. A common feature,\nhowever, is a persistent shift of our response functions to lower energies.\nFrom Eq. 19 is found that S(ω, p) is a non-trivial cut through the energymomentum structure of the spectral function, varying rapidly with the external energy and momentum. The deviations seen Fig. 3 for the spectral\nfunctions become more enhanced in the response functions. By optimizing\nthe form factor the agreement both for the spectral and response functions,\nrespectively, could be improved. For the present purpose, however, this was\nnot done, because an optimal fit to other results is not of primary interest.\n\n13\n\n\f4\n\nSummary and Conclusions\n\nCorrelations and nucleon spectral functions in nuclear matter were described\nby transport theory. Dispersive contributions to the nucleon self-energies are\nincluded, thus guaranteeing analyticity of spectral functions and momentum\ndistributions. An important pre-requisite for this achievement was to include a form factor. The comparatively hard cut-off Λ = mN agrees with\nthe assumed structure of the average matrix element M as mainly given by\nprocesses involving momentum transfers well beyond twice the Fermi momentum of the system. The insensitivity of high momentum processes on\nbulk properties of a nuclear system and their weak off-shell dependence led\nus to describe dynamics by a momentum independent, universal matrix element, treated as the only adjustable parameter of the approach, once the\nform factor has been fixed. Spectral functions and momentum distributions\nfor infinite nuclear matter at equilibrium were presented.\nThe energy and momentum dependences of spectral functions and momentum distributions are well reproduced by our calculations, confirming\nalso the conjectures of Danielewicz and Bertsch [23]. Considering the strongly\nsimplified approach the agreement with results from many-body calculations\nis impressive and supports the approach.\nThe results lead to the conclusion that the hole-type spectral functions\nand momentum distributions are dominated by phase space effects rather\nthan by the off-shell momentum structure of interactions. A residual dependence on off-shell effects, however, is observed, indicating that the approach\nis most reliable for processes with intermediate energy and momentum transfers up to 1 GeV. Still, these effects could be accounted for globally by an\noverall form factor of a rather simple functional form. In the hole sector the\nmain effect of the form factor is to ensure analyticity, leaving the shape of\nthe spectral functions almost unaffected. In the particle region, of course,\nthe spectral function depends more strongly on off-shell effects. Interestingly,\nthe different behaviour in the particle and hole regions closely reflects again\nphase space effects because the density of 2p-1h configurations - responsible for the damping of particle states - increases much more rapid than the\nnumber of 2h-1p states entering into the hole self-energies. Hence, the particle spectral functions reacts much more sensitive to the cut-off properties of\ninteractions at high off-shell momenta.\nThe shape of the momentum distribution is related to the magnitude of\nM: Increasing the value - corresponding to a stronger interaction amongst\n14\n\n\fthe nucleons - would increase the occupation of states above pF and soften the\nFermi edge. This close relationship constrains the admissible range of values.\nTo the extent that higher order self-consistency is of minor importance, as\nindicated by our calculations, this also allows, in principle, to extract M\nfrom spectral functions and the slopes of momentum distributions by precise\nmeasurements of the high momentum tails. However, we again emphasize\nthat such a determination will only provide average information on shortrange correlations in nuclei, not giving access to specific processes. Moreover,\nfrom the observed independence of n(p) on form factor effects we expect\nthat also the off-shell properties of interactions will play a minor role for\nmomentum distributions, except for global properties as analyticity. This is\neasily understood if we accept that hard processes mediated by the (single or\nmultiple) exchange of heavy mesons are the major source. Since the off-shell\nbehavior of meson exchange interactions is essentially fixed by the mass of the\nmeson it is clear that the off-shell momentum dependence of the underlying\ninteractions will become important only on momentum scales well beyond 1\nGeV.\n\nReferences\n[1] for a review see, e.g., P.K.A. de Witt Huberts, J. Phys. G (Nucl. Part.\nPhys.) 16 (1990) 507.\n[2] G. Rosner, in Perspectives in Hadronic Physics edited by S. Boffi, C.\nCiofi degli Atti and M.M. Giannini (World Scientific, Singapore, 1998),\np. 185.\n[3] H. Lenske, F. Hofmann, C.M. Keil, Rep. Prog. Nucl. Part. Phys. 46\n(2001) 187.\n[4] D. Cortina-Lopez et al., Euro. Phys. J. A10 (2001) 49.\n[5] S. Leupold, Nucl. Phys. A672 (2000) 475, nucl-th/0008036, Nucl. Phys.\nA, in print.\n[6] O. Benhar, V.R. Pandharipande, I. Sick, Phys. Lett. B489 (2000) 131.\n\n15\n\n\f[7] L. Frankfurt and M.I. Strikman, Phys. Rep. 76 (1981) 215.\n[8] O. Benhar, Phys. Rev. Lett. 83 (1999) 3130.\n[9] A. Ramos, A. Polls and W.H. Dickhoff, Nucl. Phys. A503 (1990) 1; A.\nRamos, A. Polls and W.H. Dickhoff, Phys. Rev. C43 (1991) 2239.\n[10] S. Fantoni and V.R. Pandharipande, Nucl. Phys. A427 (1984) 473.\n[11] H. Müther, G. Knehr and A. Polls, Phys. Rev. C52 (1995) 2955.\n[12] F. de Jong and H. Lenske, Phys. Rev. C54 (1996) 1488.\n[13] F. de Jong and H. Lenske, Phys. Rev. C56 (1997) 154.\n[14] W.H. Dickhoff, Phys. Rev. C58 (1998) 2807.\n[15] A. Peter, W. Cassing, J.M. Häuser and A. Pfitzner, Nucl. Phys. A573\n(1994) 93.\n[16] F. de Jong and R. Malfliet, Phys. Rev. C44 (1991) 998.\n[17] W.H. Dickhoff, talk at the Workshop on Correlations in Nucleons and\nNuclei, INT, University of Washington, March 2001.\n[18] H. Lenske and J. Wambach, Phys. Lett. B249 (1990) 377.\n[19] F.J. Eckle, H. Lenske, G. Eckle, G. Graw, R. Hertenberger, H. Kader, F.\nMerz, H. Nann, P. Schiemenz and H.H. Wolter, Phys. Rev. C39 (1989)\n1662; F.J. Eckle, H. Lenske, G. Eckle, G. Graw, R. Hertenberger, H.\nKader, H.J. Maier, F. Merz, H. Nann, P. Schiemenz and H.H. Wolter,\nNucl. Phys. A506 (1990) 159.\n[20] J. Lehr, M. Effenberger, H. Lenske, S. Leupold, U. Mosel, Phys. Lett.\nB483 (2000) 324.\n[21] L.P. Kadanoff and G. Baym, Quantum Statistical Mechanics (Benjamin,\nNew York, 1962).\n[22] W. Botermans and R. Malfliet, Phys. Rep. 198 (1990) 115.\n[23] G. Bertsch and P. Danielewicz, Phys. Lett. B367 (1996) 55.\n\n16\n\n\f[24] M. Effenberger and U. Mosel, Phys. Rev. C60 (1999) 051901.\n[25] M. Effenberger, E.L. Bratkovskaya and U. Mosel, Phys. Rev. C60 (1999)\n044614.\n[26] W. Cassing and S. Juchem, Nucl. Phys. A665 (2000) 377; Nucl. Phys.\nA672 (2000) 417; Nucl. Phys. A677 (2000) 445.\n[27] O. Benhar, A. Fabrocini and S. Fantoni, Nucl. Phys. A505 (1989) 267;\nO. Benhar, A. Fabrocini and S. Fantoni, Nucl. Phys. A550 (1992) 201.\n[28] C. Ciofi degli Atti, S. Simula, L.L. Frankfurt and M.I. Strikman, Phys.\nRev. C44 R7 (1991).\n[29] C. Ciofi degli Atti and S. Simula, Phys. Rev. C53 1689 (1996).\n[30] F. de Jong and H. Lenske, Phys. Rev. C58 (1998) 890.\n[31] S.A. Coon, M.T. Peña, Phys. Rev. C48 (1993) 2559; S.A. Coon, M.T.\nPeña, D.O. Riska, Phys. Rev. C52 (1995) 2925.\n[32] A. Akmal, V.R. Pandharipande, D.G. Ravenhall, Phys. Rev. C58 (1998)\n1804.\n[33] A.B. Migdal, E.E. Saperstein, M.A. Troisky, D.N. Voskresensky, Phys.\nRep. 192 (1990) 179.\n[34] T. Feuster and U. Mosel, Phys. Rev. C58 (1997) 457.\n[35] W. Czyz, K. Gottfried, Ann. Phys. 45 (1963) 47.\n[36] O. Benhar, A.Fabrocini and S.Fantoni, Phys. Rev. Lett. 87 (2001),\n052501.\n\n17\n\n\fFigure 1: Diagrammatic structure of the self-consistent single particle propagator, indicated by a full line. The Dyson equation, corresponding to the\ncomplete resummation of the \"sun-set\" diagrams to all orders, is depicted in\nthe second line.\n\n1\n1\n\np = 0.8 fm\n\n-1\n\np = 1.8 fm\n\n-1\n\n0.1\n0.1\n0.01\n\nΓ (ω, p) [GeV]\n\n0.01\n\n1E-4\n\n1E-3\n\nwith form factor\nw/o form factor\n\n1E-3\n\n0.0\n\n0.5\n\n1.0\n\n1.5\n\n1\n\np = 2.3 fm\n\n1E-4\n-0.5\n1\n\n-1\n\n0.1\n\n0.01\n\n0.01\n\n1E-3\n\n1E-3\n\n0.0\n\n0.5\n\np = 3.6 fm\n\n0.1\n\n1E-4\n-0.5\n\n0.0\n\n0.5\n\n1.0\n\n1.5\n\nω [GeV]\n\n1E-4\n\n-0.5\n\n1.0\n\n1.5\n\n-1\n\n0.0\n\n0.5\n\n1.0\n\n1.5\n\nω [GeV]\n\nFigure 2: Widths of the nucleon spectral distributions for different momenta,\ncalculated with (full) and without (dashed) form factor. Mainly the highenergy parts are affected by the off-shell form factor.\n\n18\n\n\f0.1\n\np = 0.8 fm\n0.01\n\n-1\n\np = 1.8 fm\n\n0.1\n\nwith form factor\nw/o form factor\n\n-1\n\n0.01\n\n1E-3\n1E-3\n1E-4\n\n-1\n\na(ω,p) [MeV ]\n\n1E-4\n\n1E-5\n-0.4\n0.1\n\n-0.2\n\n0.0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1.0\n\n1E-5\n\n-0.2\n\n0.0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1.0\n\n0.1\n\np = 2.3 fm\n\n0.01\n\n-1\n\np = 3.6 fm\n\n0.01\n\n-1\n\n1E-3\n1E-3\n1E-4\n1E-4\n1E-5\n1E-5\n1E-6\n-0.4\n\n1E-6\n\n-0.2\n\n0.0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1.0\n\nω [GeV]\n\n1E-7\n\n-0.4\n\n-0.2\n\n0.0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1.0\n\nω [GeV]\n\nFigure 3: Influence of the form factor on the spectral function. Dispersive\nself-energies are not included. The dotted lines show the results from Benhar\net al. [27].\n\n19\n\n\f0.3\n\n0.15\n\np = 0.8 fm\n0.2\n\n0.1\n\n-1\n\np = 1.8 fm\n0.10\n\nΓ\n\nRe Σ\n\n0.05\n\nΓ, Re Σ [GeV]\n\n0.0\n\n-0.1\n-1.0\n0.12\n\n-1\n\n0.00\n\n-0.5\n\np = 2.3 fm\n\n0.0\n\n0.5\n\n1.0\n\n-0.05\n1.5\n-1.0\n0.06\n\n-1\n\n-0.5\n\np = 3.6 fm\n\n0.0\n\n0.5\n\n1.0\n\n1.5\n\n0.0\n\n0.5\n\n1.0\n\n1.5\n\n-1\n\n0.04\n\n0.08\n\n0.02\n0.04\n0.00\n0.00\n-1.0\n\n-0.5\n\n0.0\n\n0.5\n\n1.0\n\n-0.02\n1.5\n-1.0\n\nω [GeV]\n\n-0.5\n\nω [GeV]\n\nFigure 4: Width of the nucleon spectral function (full line) and real part of\nthe dispersive self-energy (dotted line) for different momentum cuts.\n\n20\n\n\f0.1\n\np = 0.8 fm\n0.01\n\n-1\n\nwith Re Σ\n\n-1\n\n0.01\n\nw/o Re Σ\n\n1E-3\n\np = 1.8 fm\n\n0.1\n\n1E-4\n\n1E-4\n\n-1\n\na(ω,p) [MeV ]\n\n1E-3\n\n1E-5\n-0.4\n0.1\n\n-0.2\n\n0.0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1.0\n\n1E-5\n\n-0.2\n\n0.0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1.0\n\n0.1\n\np = 2.3 fm\n\n-1\n\np = 3.6 fm\n\n0.01\n\n0.01\n\n-1\n\n1E-3\n1E-3\n1E-4\n1E-4\n1E-5\n1E-5\n1E-6\n-0.4\n\n1E-6\n\n-0.2\n\n0.0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1.0\n\nω [GeV]\n\n1E-7\n\n-0.4\n\n-0.2\n\n0.0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1.0\n\nω [GeV]\n\nFigure 5: Nucleon spectral function at momenta below and above the Fermi\nmomentum. Results with (full line) and without (dotted line) the real part of\nthe dispersive self-energy are displayed. The quasi-particle peaks are clearly\nvisible.\n\n21\n\n\f10\n\nwith Re Σ\n\n1\n\nw/o Re Σ\n\nn(p)\n\n0.1\n\n0.01\n\n1E-3\n\n1E-4\n0\n\n1\n\n2\n\n3\n\n4\n\n-1\n\np [fm ]\n\nFigure 6: Nucleon momentum distribution in nuclear matter. Results neglecting analyticity (dashed) are also displayed.\n\n22\n\n\f1.2\n\n1.1\n\nZ(p)\n\n1.0\n\n0.9\n\n0.8\n\n0.7\n\n0.6\n0\n\n1\n\n2\n\n3\n\n4\n\n-1\n\np [fm ]\n\nFigure 7: Nucleon spectroscopic factor in nuclear matter evaluated for the\non-shell energy (see Eq. (18)). For comparison, results from the full manybody calculation of Benhar et al. [27] (dots) are also shown.\n\n23\n\n\f6\n\n3.0\n\np = 2.53 fm\n\n-1\n\np = 5 fm\n\n2.5\n\n4\n\n2.0\n\n3\n\n1.5\n\n2\n\n1.0\n\n1\n\n0.5\n\n-1\n\n-1\n\nS(p, ω) [GeV ]\n\n5\n\n0\n0.0\n4\n\n0.1\n\n0.2\n\n0.3\n\n0.4\n\n0.0\n0.2\n\n0.3\n\n0.4\n\n0.5\n\n0.6\n\n0.7\n\n0.8\n\n0.9\n\nω [GeV]\n\np = 3.99 fm\n\n-1\n\n3\n\n2\n\n1\n\n0\n0.1\n\n0.2\n\n0.3\n\n0.4\n\n0.5\n\n0.6\n\n0.7\n\nω [GeV]\n\nFigure 8: Nuclear matter density response functions, Eq. (19), at different\nmomenta. The dashed lines show the results from [27, 36].\n\n24\n\n\f"}