{"id": "http://arxiv.org/abs/nucl-th/0606046v2", "guidislink": true, "updated": "2006-07-26T19:05:02Z", "updated_parsed": [2006, 7, 26, 19, 5, 2, 2, 207, 0], "published": "2006-06-21T22:55:29Z", "published_parsed": [2006, 6, 21, 22, 55, 29, 2, 172, 0], "title": "Locating strongly coupled color superconductivity using universality and\n  experiments with trapped ultracold atoms", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=nucl-th%2F0203039%2Cnucl-th%2F0606008%2Cnucl-th%2F0606001%2Cnucl-th%2F0606036%2Cnucl-th%2F0606030%2Cnucl-th%2F0606007%2Cnucl-th%2F0606004%2Cnucl-th%2F0606055%2Cnucl-th%2F0606010%2Cnucl-th%2F0606047%2Cnucl-th%2F0606034%2Cnucl-th%2F0606061%2Cnucl-th%2F0606054%2Cnucl-th%2F0606058%2Cnucl-th%2F0606049%2Cnucl-th%2F0606056%2Cnucl-th%2F0606021%2Cnucl-th%2F0606033%2Cnucl-th%2F0606019%2Cnucl-th%2F0606051%2Cnucl-th%2F0606038%2Cnucl-th%2F0606002%2Cnucl-th%2F0606050%2Cnucl-th%2F0606052%2Cnucl-th%2F0606039%2Cnucl-th%2F0606006%2Cnucl-th%2F0606037%2Cnucl-th%2F0606017%2Cnucl-th%2F0606060%2Cnucl-th%2F0606003%2Cnucl-th%2F0606040%2Cnucl-th%2F0606015%2Cnucl-th%2F0606027%2Cnucl-th%2F0606013%2Cnucl-th%2F0606043%2Cnucl-th%2F0606025%2Cnucl-th%2F0606028%2Cnucl-th%2F0606020%2Cnucl-th%2F0606022%2Cnucl-th%2F0606012%2Cnucl-th%2F0606057%2Cnucl-th%2F0606041%2Cnucl-th%2F0606062%2Cnucl-th%2F0606023%2Cnucl-th%2F0606026%2Cnucl-th%2F0606029%2Cnucl-th%2F0606035%2Cnucl-th%2F0606011%2Cnucl-th%2F0606045%2Cnucl-th%2F0606024%2Cnucl-th%2F0606044%2Cnucl-th%2F0606046%2Cnucl-th%2F0606042%2Cnucl-th%2F0606063%2Cnucl-th%2F0606031%2Cnucl-th%2F0606016%2Cnucl-th%2F0606032%2Cnucl-th%2F0606059%2Cnucl-th%2F0606005%2Cnucl-th%2F0606014%2Cnucl-th%2F0606053%2Cnucl-th%2F0606048%2Cnucl-th%2F0606009%2Cnucl-th%2F0606018%2Cnucl-th%2F0205001%2Cnucl-th%2F0205064%2Cnucl-th%2F0205006%2Cnucl-th%2F0205060%2Cnucl-th%2F0205039%2Cnucl-th%2F0205072%2Cnucl-th%2F0205031%2Cnucl-th%2F0205009%2Cnucl-th%2F0205063%2Cnucl-th%2F0205033%2Cnucl-th%2F0205058%2Cnucl-th%2F0205027%2Cnucl-th%2F0205026%2Cnucl-th%2F0205050%2Cnucl-th%2F0205054%2Cnucl-th%2F0205076%2Cnucl-th%2F0205079%2Cnucl-th%2F0205077%2Cnucl-th%2F0205013%2Cnucl-th%2F0205048%2Cnucl-th%2F0205029%2Cnucl-th%2F0205034%2Cnucl-th%2F0205053%2Cnucl-th%2F0205014%2Cnucl-th%2F0205024%2Cnucl-th%2F0205071%2Cnucl-th%2F0205008%2Cnucl-th%2F0205042%2Cnucl-th%2F0205037%2Cnucl-th%2F0205067%2Cnucl-th%2F0205004%2Cnucl-th%2F0205030%2Cnucl-th%2F0205040%2Cnucl-th%2F0205012%2Cnucl-th%2F0205043%2Cnucl-th%2F0205038%2Cnucl-th%2F0205010&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Locating strongly coupled color superconductivity using universality and\n  experiments with trapped ultracold atoms"}, "summary": "Cold fermionic atoms are known to enter the universal strongly coupled regime\nas their scattering length $a$ gets large compared to the inter-particle\ndistances. Recent experimental data provide important critical parameters of\nsuch system. We argue that quarks may enter the same regime due to marginal\nbinding of diquarks, and if so one can use its universality in order to deduce\nsuch properties as the slope of the critical line of color superconductivity,\n  $dT_c/d\\mu$. We further discuss limitations on the critical temperature\nitself and conclude that it is limited by $T_c<70\\, MeV$.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=nucl-th%2F0203039%2Cnucl-th%2F0606008%2Cnucl-th%2F0606001%2Cnucl-th%2F0606036%2Cnucl-th%2F0606030%2Cnucl-th%2F0606007%2Cnucl-th%2F0606004%2Cnucl-th%2F0606055%2Cnucl-th%2F0606010%2Cnucl-th%2F0606047%2Cnucl-th%2F0606034%2Cnucl-th%2F0606061%2Cnucl-th%2F0606054%2Cnucl-th%2F0606058%2Cnucl-th%2F0606049%2Cnucl-th%2F0606056%2Cnucl-th%2F0606021%2Cnucl-th%2F0606033%2Cnucl-th%2F0606019%2Cnucl-th%2F0606051%2Cnucl-th%2F0606038%2Cnucl-th%2F0606002%2Cnucl-th%2F0606050%2Cnucl-th%2F0606052%2Cnucl-th%2F0606039%2Cnucl-th%2F0606006%2Cnucl-th%2F0606037%2Cnucl-th%2F0606017%2Cnucl-th%2F0606060%2Cnucl-th%2F0606003%2Cnucl-th%2F0606040%2Cnucl-th%2F0606015%2Cnucl-th%2F0606027%2Cnucl-th%2F0606013%2Cnucl-th%2F0606043%2Cnucl-th%2F0606025%2Cnucl-th%2F0606028%2Cnucl-th%2F0606020%2Cnucl-th%2F0606022%2Cnucl-th%2F0606012%2Cnucl-th%2F0606057%2Cnucl-th%2F0606041%2Cnucl-th%2F0606062%2Cnucl-th%2F0606023%2Cnucl-th%2F0606026%2Cnucl-th%2F0606029%2Cnucl-th%2F0606035%2Cnucl-th%2F0606011%2Cnucl-th%2F0606045%2Cnucl-th%2F0606024%2Cnucl-th%2F0606044%2Cnucl-th%2F0606046%2Cnucl-th%2F0606042%2Cnucl-th%2F0606063%2Cnucl-th%2F0606031%2Cnucl-th%2F0606016%2Cnucl-th%2F0606032%2Cnucl-th%2F0606059%2Cnucl-th%2F0606005%2Cnucl-th%2F0606014%2Cnucl-th%2F0606053%2Cnucl-th%2F0606048%2Cnucl-th%2F0606009%2Cnucl-th%2F0606018%2Cnucl-th%2F0205001%2Cnucl-th%2F0205064%2Cnucl-th%2F0205006%2Cnucl-th%2F0205060%2Cnucl-th%2F0205039%2Cnucl-th%2F0205072%2Cnucl-th%2F0205031%2Cnucl-th%2F0205009%2Cnucl-th%2F0205063%2Cnucl-th%2F0205033%2Cnucl-th%2F0205058%2Cnucl-th%2F0205027%2Cnucl-th%2F0205026%2Cnucl-th%2F0205050%2Cnucl-th%2F0205054%2Cnucl-th%2F0205076%2Cnucl-th%2F0205079%2Cnucl-th%2F0205077%2Cnucl-th%2F0205013%2Cnucl-th%2F0205048%2Cnucl-th%2F0205029%2Cnucl-th%2F0205034%2Cnucl-th%2F0205053%2Cnucl-th%2F0205014%2Cnucl-th%2F0205024%2Cnucl-th%2F0205071%2Cnucl-th%2F0205008%2Cnucl-th%2F0205042%2Cnucl-th%2F0205037%2Cnucl-th%2F0205067%2Cnucl-th%2F0205004%2Cnucl-th%2F0205030%2Cnucl-th%2F0205040%2Cnucl-th%2F0205012%2Cnucl-th%2F0205043%2Cnucl-th%2F0205038%2Cnucl-th%2F0205010&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Cold fermionic atoms are known to enter the universal strongly coupled regime\nas their scattering length $a$ gets large compared to the inter-particle\ndistances. Recent experimental data provide important critical parameters of\nsuch system. We argue that quarks may enter the same regime due to marginal\nbinding of diquarks, and if so one can use its universality in order to deduce\nsuch properties as the slope of the critical line of color superconductivity,\n  $dT_c/d\\mu$. We further discuss limitations on the critical temperature\nitself and conclude that it is limited by $T_c<70\\, MeV$."}, "authors": ["E. V. Shuryak"], "author_detail": {"name": "E. V. Shuryak"}, "author": "E. V. Shuryak", "arxiv_comment": "v2 has some new refs and cosmetic changes", "links": [{"href": "http://arxiv.org/abs/nucl-th/0606046v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/nucl-th/0606046v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "nucl-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "nucl-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/nucl-th/0606046v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/nucl-th/0606046v2", "journal_reference": null, "doi": null, "fulltext": "arXiv:nucl-th/0606046v2 26 Jul 2006\n\nLocating strongly coupled color\nsuperconductivity using universality and data\nfor trapped ultracold atoms\nE.V. Shuryak\nDepartment of Physics and Astronomy,\nUniversity at Stony Brook NY 11794-3800, USA\nOctober 24, 2018\nAbstract\nCold fermionic atoms are known to enter the universal strongly\ncoupled regime as their scattering length a gets large compared to the\ninter-particle distances. Recent experimental data provide important\ncritical parameters of such system. We argue that quarks may enter\nthe same regime due to marginal binding of diquarks, and if so one can\nuse its universality in order to deduce such properties as the slope of\nthe critical line of color superconductivity, dTc /dμ. We further discuss\nlimitations on the critical temperature itself and conclude that it is\nlimited by Tc < 70 M eV .\n\n1.Color superconductivity (CS) in dense quark matter in general appears\ndue to attractive interaction in certain scalar diquark channels. More specifically, three mechanisms of such attraction were discussed in literature are: (i)\nthe electric Coulomb interaction (see e.g.[1]) (ii) instanton-induced 't Hooft\ninteraction [2, 3] and the magnetic interaction [4].\nUnlike electrons in ordinary superconductors (for which the driving attraction is a complicated exchange of collective excitations like phonons),\nquarks naturally may have color charges leading to their mutual electric\nattraction. However this straightforward mechanism of CS is significantly\nweakened by the electric screening, at the \"Debye mass\" scale MD ∼ gμ. It\nthus leads to rather weak pairing, with the gaps ∆ ∼ 1 MeV [1].\n1\n\n\fThe second mechanism of pairing is due to the instanton-induced forces\nbetween light quarks, also known as the 't Hooft interaction. It is related to\nfermionic zero mode of instantons and thus it is very flavor-dependent. In\nparticularly, it only exists for two quark of different flavors (such as ud, us and\nds). Therefore the simplest setting in which it was considered is the 2-flavor\n(no s-quark) problem [2, 3], for 3-flavor case see [5]. The instanton mechanism\nhave re-activated the field, because it have demonstrated for the first time\nthat large (and thermodynamically significant) pairing may actually appear\nin cold quark matter. Since forces induced by small-size instantons are not\naffected by screening that much, they can be much stronger than (i), leading\nto gaps about 2 orders of magnitude larger ∆ ∼ 100 MeV [2, 3].\nHowever such gaps are rather uncertain because they are so large1 that\nthey may fall outside of applicability range of the usual BCS-like mean field\ntheory. Unfortunately, an analytic theory of strong pairing is still in its\ninfancy. The main idea of this letter is to get around this \"calculational\"\nproblem by using the universality arguments and an appropriate atomic data.\nMagnetic mechanism of pairing (iii) has been pointed out by Son [4]: it\ndominates at very high densities (μ > 10GeV ) when two others get strongly\n2\nscreened. It leads to gaps ∆ ∼ μexp(− √3π\n), large in absolute magnitude\n2g(μ)\nbut small relatively to μ.\nDifferent colors and flavors of quarks lead to to multiple possible condensates, and indeed color superconductivity may exist in many different phases\ndepending on T, μ and quark masses. In particular, they may have chiral\nand translational symmetries being either preserved or broken. We will not\ngo into this vast subject: the reader for definiteness may think about a single\nud scalar condensate, or the so called 2SC phase. Its symmetries are similar\nto the electroweak part of the Standard Model, with the fundamental color\nrepresentation of the ud condensate, breaking the color group and making 5\ngluons massive and leaving 3 (of the unbroken SU(2)) massless.\nThe estimates for the maximal pairing possible are obviously very interesting for applications. One of them is a possibility that a superconducting\nquark matter is present at the central region of compact \"neutron\" stars.\nAnother is a possibility that either a region of the CS phase on the phase\n1\n\nAdditional argument [2] why one should believe such large gaps: the same interaction\nbut in q̄q channel is responsible for chiral symmetry breaking, producing the gap (the\nconstituent quark mass) as large as 350-400 MeV. Furthermore, in the two-color QCD, the\nso called Pauli-Gursey symmetry relates these two condensates directly.\n\n2\n\n\fdiagram, or at least a region where diquarks are bound can be reached via\nheavy ion collisions. In both cases the issue of the gap magnitude (or critical\ntemperature) is crucial for making those possibilities real.\n2. Let us now introduce the main idea of this letter. The interaction\n(scattering) of two quarks is maximally enhanced (to its unitarity limit) if\nthere is a marginal state in the diquark channel, a bound state with nearzero binding or a virtual state at small positive energy. In atomic systems\nsuch situations are generically called a \"Feshbach resonance\", tuned by external magnetic field. Transition between these two possibilities is reflected\nin specific behavior of the condesation, known as BEC-to-BCS transition. In\nthe middle, with resonance at exactly zero binding, the interaction is at its\nmaximum, limited by unitarity for the relevant partial wave. (It is s-wave\nwith l=0 in all cases considered.)\nIn quark-gluon plasma the existence of marginally bound states of quarks\nand gluons and their possible role in liquid-like behavior at RHIC has been\npointed out in [6]. For any hadronic states one can argue that they dissolves\nat large T or μ, and thus existence of some lines of zero binding on the\nphase diagram are unavoidable. The issue was so far studied only for small\nμ and high T relevant for RHIC heavy ion program: and indeed there are\ntheoretical, lattice and experimental evidences that e.g. charmonium ground\nstate does not melt till about T ∼ 400 MeV [7, 8]. One can also follow\ndiscussion of such lines for glueball and light quark mesons in [7], charmed\nmesons in [9], baryons and multi-gluon chains in [10].\nIn this letter we explore consequences of the idea that there is a diquark\nmarginal binding line, more or less trailing the phase boundary line on the\nphase diagram. If this is the case (which cannot be proven at this time), it\nmust cross the CS critical line, separating the CS region into a BCS-like and\nBEC-like. (For general information on BEC-BCS transition and its possible\npresence in quark matter see e.g. a lecture [11].)\nIn Fig.1(a) we show schematic phase diagram of QCD, in coordinates\nbaryonic chemical potential μ (per quark)- temperature T . Lines of zero\nbinding2 of a qq pair [6] starts at μ = 0 at the temperature Tqq very close\nto the critical line |Tqq − Tc | ≪ Tc : the reason for that is that effective color\nattraction in qq state is only 1/2 of that in mesons such as charmonium. The\n2\n\nSimilar \"curves of marginal stability\" (CMS) of certain states are known in various\nsettings: e.g. they have an important role in confinement of supersymmetric gauge theories\n[12].\n\n3\n\n\flines associated with (color triplet) diquark qq3 are the lower (blue) dashed\nand dash-dotted lines: below the former diquark binding is below zero and\nabove the later it does not exist at all, even as a Cooper pair.\n3. How can one relate atomic and quark systems, if at all? The way it can\nbe done is due to the so called \"universality\" of the system. As the scattering\nlength gets large a → ∞, it cannot enter the answers any more. As a result,\nthere remain so few parameters on which the answer may depend3 on that\nthose can be absorbed by selection of the appropriate units.\nAtomic 50-50 mixture of two \"spin\" states is characterized by the density n and the atomic mass m. Quantum mechanics adds h̄ to the list of\npossible quantities, and so one has only 3 input parameters, which can be\nreadily absorbed by selecting proper units of length, time and mass. Thus\nthe pressure (or mean energy) at infinite and zero a can only be related by\nsome universal numerical constant p∞ /p0 = (1 + β). We do not know how to\nget its value from any theory (other than quantum Monte-Carlo simulations\nor other brute force methods), but it has been measured experimentally (e.g.\nby the very size of the trapped system). The same should hold for transport\nproperties: e.g. viscosity of such universal gas can only be η = h̄nαη where\nαη is some universal coefficient [14]. Similarly, the critical temperature must\nbe simply proportional to the Fermi energy\nTc = αTc EF\n\n(1)\n\nwith the universal constant αTc .\nExperimental progress in the field of strongly coupled trapped fermionic\natoms is quite spectacular; unfortunately this author is certainly unqualified\nto go into its discussion. Let me just mention one paper, which killed remaining doubts about superfluidity: a discovery by the MIT group of the\nquantized vortices, neatly organized into the usual lattice [13]. We will however need only the information about the value of the transition temperature.\nDuke group lead by J.E.Thomas (Kinast et al) have for some time studied collective vibrational modes of the trapped system. Their frequencies in strong\ncoupling regime are well predicted by hydrodynamics and universal equation\nof state, with little variation with temperature. Their dampings however\n3\n\nThe next parameter of scattering amplitude, the effective range, is about 3 orders\nof magnitude smaller than interparticle distance for trapped atoms, and thus completely\nirrelevant. Although similar parameter for quarks are not that small, we will assume it\ndoes not affect the universal results too much.\n\n4\n\n\fshow significant T -dependence: in fact Kinast et al [16] have found two distinct transitions in its behavior. The lowest break in damping is interpreted\nas the phase transition to superfluidity, it corresponds to\nαTc =\n\nTc\n= .35\nEF\n\n(2)\n\nwhere EF stands for the Fermi energy of the ideal Fermi gas at the center\nof the trap. In another (earlier) set of experiments [15] there has also been\nfound a change in the specific heat, at αTc = .27. In spite of some numerical\ndifference between these two values, the Duke group indicates that both are\nrelated to the same phenomenon4 . At another temperature\nα2 =\n\nT2\n≈ 0.7 − 0.8\nTF\n\n(3)\n\nthe behavior of the damping visibly changes again. Kinast et al interpret it\nas a transition to a regime where not only there is no condensate of atomic\npairs, but even the pairs themselves are melted out.\n4. There are of course important differences between quarks and atoms.\nFirst, quarks have not only spin but also flavor and color, so there are 3 ∗ Nf\nmore Fermi surfaces. However, in the first approximation one may focus\nonly at one pair of them (say u-d quarks with red-blue colors) which are\nactually paired. Second, atoms are non-relativistic while quarks are in general\nrelativistic and in matter may have some complicated dispersion laws. Since\nthe gaps are large, one cannot use a standard argument that close to Fermi\nsurface only Fermi velocity is important. Nevertheless, we will assume that\nquark quasiparticles have dispersion laws which can be approximated by a\nsimple quadratic form\nE(p) = M1 +\n\np2\n+ ...\n2M2\n\n(4)\n\nwhere dots are for O(p4) terms we ignore. In matter M1 and M2 need not be\nthe same. It then implies that e.g. the relation between the critical T and\nchemical potential should read\nTc = αTc (μ/3 − M1 )\n\n(5)\n\n4\n\nThey do not provide any error bars on the value of T , as the absolute value of the\ntemperature is obtained in rather indirect calibration procedure. The reader may take the\nspread of about 20% as an estimate of uncertainties involved.\n\n5\n\n\fand similarly for the second point. (The factor 3 appears because baryon\nnumber is counted per baryon, not quark.)\nThe M2 can be used to set the units as explained above, and we will not\nactually need its value. The M1 is needed, but since it makes a simple shift\nof the chemical potential, it can be eliminated by differenciation. Thus we\nget a prediction of the slope of the critical line\ndTc /dμ = αTc /3 ≈ 0.1\n\n(6)\n\nThe intersection of CMS for diquarks with the SC critical line (the point S\n(strong) in our phase diagram Fig.1(a)) should thus be at this line, at which\nthe boundary of superconducting phase crosses with the zero energy of the\nbound state. The second critical point associated with disappearance of pairs\n(identified with the (blue) dash-dotted line and point D in Fig.1(a)) should\nthus be at the line with the slope α2 .\nIn order to plot the line on the phase diagram one needs the value of\nthe M1 , which unfortunately is not known. To set the upper bound one may\nsimply take M1 = 0 and draw two straight lines pointing to the origin, see\nFig.1(b). As M1 grows, the lines slide to the right, as is shown by another\nline with a (randomly chosen) value M1 = 100 MeV .\nFinally, we turn to \"realistic\" phase diagram, with numerical values extracted from experiment. We know for sure that matter is released at the so\ncalled chemical freezeout lines indicated by points in Fig.1(b). These points\nare the ends of adiabatic cooling paths. Unfortunately we do not know how\nhigh above them those curves start at a given collision energies. However it\nis general expected that this line more or less traces the critical line, being\nfew MeV below it, into the hadronic phase. One may then conclude that the\nupper limit on Tc of CS is about 70 MeV (intersection of the upper solid lines\nwith the freezeout line). The disappearance of pairing (dashed lines) is thus\nexpected below T2 = 150 MeV .\nFinally, comparing these results with theoretical expectations and experimental capabilities, we conclude that (i) if there is a strongly coupled CS,\nits critical temperature should definitely be below Tc < 70 MeV . This maximal value is amusingly close to what was obtained from the instanton-based\ncalculations [2, 3]; (ii) it is unlikely that any heavy ion collisions can reach\nthe CS domain, even at the maximal coupling. A penetration into the region\nT = 100 − 150 MeV, μ = 500 − 600 MeV in which non-condensed bound diquarks may exist, is however quite likely, both in the low-energy RHIC runs\nand in future GSI facility FAIR; (iii) if that happens, one may think of some\n6\n\n\ffurther uses of universality, e.g. about relating the transport properties in\nboth systems. One may in particularly ask whether the universal viscosity\nextracted from vibrations of trapped atoms (like that in [14], but at appropriate T ) can or cannot describe the hydrodynamics of the corresponding\nheavy ion collisions.\nAcknowledgments. This work was initiated at the Trento meeting related to GSI future facility FAIR in June 06: I thank the organizers for\nforcing me to thing about the issues discussed in this letter. It is also partially supported by the US-DOE grants DE-FG02-88ER40388 and DE-FG0397ER4014.\n\nReferences\n[1] D. Bailin and A. Love, Phys. Rept. 107, 325 (1984).\n[2] R. Rapp, T. Schäfer, E. V. Shuryak and M. Velkovsky, Phys. Rev. Lett.\n81, 53 (1998) [hep-ph/9711396].\n[3] M. Alford, K. Rajagopal and F. Wilczek, Phys. Lett. B422, 247 (1998),\n[hep-ph/9711395].\n[4] D. T. Son, Phys. Rev. D59, 094019 (1999) [hep-ph/9812287].\n[5] R. Rapp, T. Schäfer, E. V. Shuryak and M. Velkovsky, Ann. Phys. 280,\n35 (2000), hep-ph/9904353.\n[6] E. V. Shuryak and I. Zahed, Phys. Rev. C 70, 021901 (2004)\n[arXiv:hep-ph/0307267].\n[7] E. V. Shuryak and I. Zahed, Phys. Rev. D 70, 054507 (2004)\n[arXiv:hep-ph/0403127].\n[8] M. Asakawa and T. Hatsuda, Phys. Rev. Lett. 92, 012001 (2004)\n[arXiv:hep-lat/0308034]. S. Datta, F. Karsch, P. Petreczky and I. Wetzorke, Phys. Rev. D 69, 094507 (2004) [arXiv:hep-lat/0312037].\n[9] R. Rapp, V. Greco and H. van Hees, arXiv:hep-ph/0510050.\n[10] J. Liao and E. V. Shuryak,\narXiv:hep-ph/0508035. Phys. Rev.\n[arXiv:hep-ph/0510110].\n7\n\nNucl.Phys.A, in\nD 73,\n014509\n\npress,\n(2006)\n\n\f[11] B.Kerbikov, hep-ph/0510302\n[12] A.Ritz, M. A. Shifman, A. I. Vainshtein and M. B. Voloshin, Phys. Rev.\nD 63, 065018 (2001) [arXiv:hep-th/0006028].\n[13] M. W. Zwierlein, J. R. Abo-Shaeer, A. Schirotzek, C. H. Schunck and\nW. Ketterle,Nature 435, 1047-1051 (23 June 2005)\n[14] B. A. Gelman, E. V. Shuryak and I. Zahed, Phys. Rev. A 72, 043601\n(2005), nucl-th/0410067.\n[15] J. Kinast et al, Science 25, jan.2005\n[16] J. Kinast et al, cond-mat/0502507)\n[17] A. Andronic, P. Braun-Munzinger, J. Stachel, Nucl.Phys.A772:167199,2006, nucl-th/0511071\n\n8\n\n\f250\n\nT\nw QGP\n\n200\n\nsQGP\n150\n\nqq3\n\ngg\n\n_\ncc1\n\n1\n\n100\n\nTc\nE\n\n50\n\nD\nH\n\nqg 3 ,gg 8\n0\n\nS\nqq\nM\n\n0\n3\n\n250\n\n500\n\n750\n\n1,000\n\nmu\n\nBEC\nBCS\nchemical potential\n\nFigure 1: (a) Schematic phase diagram for QCD, in the plane baryon chemical\npotential - temperature. M (multifragmentation) point is the endpoint of\nnuclear gas-liquid transition. E is a similar endpoint separating the first\norder transition to the right from a crossover to the left of it. (Black) solid\nlines show phase boundaries, dashed lines are curves of marginal stability of\nindicated states. Two dash-dotted straight lines are related with bounds from\natomic experiments we discuss in the text, they intersect with unbinding of\ndiquark Cooper pairs (D) and most strongly coupled point (S), which is at\nthe maxumum of the transition line ans is also a divider between BCS-like\nand BEC-like color superconductor. (b) Compilation of experimental data\non chemical freezeout parameters from different experiments according to\n[17]. The squares and circles are for fits at mid-rapidity and all particles,\nrespectively. Two solid lines are the phase transition lines with the quark\neffective mass M1 = 0 and 100 MeV , two dashed lines show pair unbinding\nlines for the same masses.\n\n9\n\n\f"}