{"id": "http://arxiv.org/abs/nucl-th/0005020v1", "guidislink": true, "updated": "2000-05-09T00:59:50Z", "updated_parsed": [2000, 5, 9, 0, 59, 50, 1, 130, 0], "published": "2000-05-09T00:59:50Z", "published_parsed": [2000, 5, 9, 0, 59, 50, 1, 130, 0], "title": "Double Beta Decay: Theory, Experiment, and Implications", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=nucl-th%2F0005019%2Cnucl-th%2F0005071%2Cnucl-th%2F0005013%2Cnucl-th%2F0005020%2Cnucl-th%2F0005068%2Cnucl-th%2F0005043%2Cnucl-th%2F0005057%2Cnucl-th%2F0005007%2Cnucl-th%2F0005064%2Cnucl-th%2F0005032%2Cnucl-th%2F0005051%2Cnucl-th%2F0005072%2Cnucl-th%2F0005008%2Cnucl-th%2F0005012%2Cnucl-th%2F0005055%2Cnucl-th%2F0005034%2Cnucl-th%2F0005022%2Cnucl-th%2F0005006%2Cnucl-th%2F0005036%2Cnucl-th%2F0005011%2Cnucl-th%2F0005059%2Cnucl-th%2F0005073%2Cnucl-th%2F0005029%2Cnucl-th%2F0005004%2Cnucl-th%2F0005038%2Cnucl-th%2F0005066%2Cnucl-th%2F0005005%2Cnucl-th%2F0005063%2Cnucl-th%2F0005058%2Cnucl-th%2F0005027%2Cnucl-th%2F0005040%2Cnucl-th%2F0005056%2Cnucl-th%2F0005014%2Cnucl-th%2F0005025%2Cnucl-th%2F0005031%2Cnucl-th%2F0005028%2Cnucl-th%2F0005046%2Cnucl-th%2F0005002%2Cnucl-th%2F0005050%2Cnucl-th%2F0005074%2Cnucl-th%2F0005039%2Cnucl-th%2F0005060%2Cnucl-th%2F0005015%2Cnucl-th%2F0005044%2Cnucl-th%2F0005030%2Cnucl-th%2F0005048%2Cnucl-th%2F0005017%2Cnucl-th%2F0005016%2Cnucl-th%2F0005035%2Cnucl-th%2F0005010%2Cnucl-th%2F0005003%2Cnucl-th%2F0005023%2Cnucl-th%2F0005047%2Cnucl-th%2F0005033%2Cnucl-th%2F0005041%2Cnucl-th%2F0701034%2Cnucl-th%2F0701044%2Cnucl-th%2F0701059%2Cnucl-th%2F0701039%2Cnucl-th%2F0701011%2Cnucl-th%2F0701042%2Cnucl-th%2F0701032%2Cnucl-th%2F0701070%2Cnucl-th%2F0701020%2Cnucl-th%2F0701091%2Cnucl-th%2F0701055%2Cnucl-th%2F0701097%2Cnucl-th%2F0701014%2Cnucl-th%2F0701015%2Cnucl-th%2F0701040%2Cnucl-th%2F0701002%2Cnucl-th%2F0701081%2Cnucl-th%2F0701086%2Cnucl-th%2F0701026%2Cnucl-th%2F0701010%2Cnucl-th%2F0701009%2Cnucl-th%2F0701023%2Cnucl-th%2F0701092%2Cnucl-th%2F0701065%2Cnucl-th%2F0701072%2Cnucl-th%2F0701006%2Cnucl-th%2F0701071%2Cnucl-th%2F0701021%2Cnucl-th%2F0701004%2Cnucl-th%2F0701056%2Cnucl-th%2F0701012%2Cnucl-th%2F0701074%2Cnucl-th%2F0701062%2Cnucl-th%2F0701033%2Cnucl-th%2F0701018%2Cnucl-th%2F0701031%2Cnucl-th%2F0701084%2Cnucl-th%2F0701080%2Cnucl-th%2F0701050%2Cnucl-th%2F0701022%2Cnucl-th%2F0701060%2Cnucl-th%2F0701029%2Cnucl-th%2F0701067%2Cnucl-th%2F0701037%2Cnucl-th%2F0701058%2Cnucl-th%2F0701030&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Double Beta Decay: Theory, Experiment, and Implications"}, "summary": "The theory, experimental status, and implications of double beta decay are\nreviewed.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=nucl-th%2F0005019%2Cnucl-th%2F0005071%2Cnucl-th%2F0005013%2Cnucl-th%2F0005020%2Cnucl-th%2F0005068%2Cnucl-th%2F0005043%2Cnucl-th%2F0005057%2Cnucl-th%2F0005007%2Cnucl-th%2F0005064%2Cnucl-th%2F0005032%2Cnucl-th%2F0005051%2Cnucl-th%2F0005072%2Cnucl-th%2F0005008%2Cnucl-th%2F0005012%2Cnucl-th%2F0005055%2Cnucl-th%2F0005034%2Cnucl-th%2F0005022%2Cnucl-th%2F0005006%2Cnucl-th%2F0005036%2Cnucl-th%2F0005011%2Cnucl-th%2F0005059%2Cnucl-th%2F0005073%2Cnucl-th%2F0005029%2Cnucl-th%2F0005004%2Cnucl-th%2F0005038%2Cnucl-th%2F0005066%2Cnucl-th%2F0005005%2Cnucl-th%2F0005063%2Cnucl-th%2F0005058%2Cnucl-th%2F0005027%2Cnucl-th%2F0005040%2Cnucl-th%2F0005056%2Cnucl-th%2F0005014%2Cnucl-th%2F0005025%2Cnucl-th%2F0005031%2Cnucl-th%2F0005028%2Cnucl-th%2F0005046%2Cnucl-th%2F0005002%2Cnucl-th%2F0005050%2Cnucl-th%2F0005074%2Cnucl-th%2F0005039%2Cnucl-th%2F0005060%2Cnucl-th%2F0005015%2Cnucl-th%2F0005044%2Cnucl-th%2F0005030%2Cnucl-th%2F0005048%2Cnucl-th%2F0005017%2Cnucl-th%2F0005016%2Cnucl-th%2F0005035%2Cnucl-th%2F0005010%2Cnucl-th%2F0005003%2Cnucl-th%2F0005023%2Cnucl-th%2F0005047%2Cnucl-th%2F0005033%2Cnucl-th%2F0005041%2Cnucl-th%2F0701034%2Cnucl-th%2F0701044%2Cnucl-th%2F0701059%2Cnucl-th%2F0701039%2Cnucl-th%2F0701011%2Cnucl-th%2F0701042%2Cnucl-th%2F0701032%2Cnucl-th%2F0701070%2Cnucl-th%2F0701020%2Cnucl-th%2F0701091%2Cnucl-th%2F0701055%2Cnucl-th%2F0701097%2Cnucl-th%2F0701014%2Cnucl-th%2F0701015%2Cnucl-th%2F0701040%2Cnucl-th%2F0701002%2Cnucl-th%2F0701081%2Cnucl-th%2F0701086%2Cnucl-th%2F0701026%2Cnucl-th%2F0701010%2Cnucl-th%2F0701009%2Cnucl-th%2F0701023%2Cnucl-th%2F0701092%2Cnucl-th%2F0701065%2Cnucl-th%2F0701072%2Cnucl-th%2F0701006%2Cnucl-th%2F0701071%2Cnucl-th%2F0701021%2Cnucl-th%2F0701004%2Cnucl-th%2F0701056%2Cnucl-th%2F0701012%2Cnucl-th%2F0701074%2Cnucl-th%2F0701062%2Cnucl-th%2F0701033%2Cnucl-th%2F0701018%2Cnucl-th%2F0701031%2Cnucl-th%2F0701084%2Cnucl-th%2F0701080%2Cnucl-th%2F0701050%2Cnucl-th%2F0701022%2Cnucl-th%2F0701060%2Cnucl-th%2F0701029%2Cnucl-th%2F0701067%2Cnucl-th%2F0701037%2Cnucl-th%2F0701058%2Cnucl-th%2F0701030&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The theory, experimental status, and implications of double beta decay are\nreviewed."}, "authors": ["Petr Vogel"], "author_detail": {"name": "Petr Vogel"}, "author": "Petr Vogel", "arxiv_comment": "22 pages including 4 figures. Chapter 8 of the book ``Current Aspects\n  of Neutrino Physics'', D. O. Caldwell, editor", "links": [{"href": "http://arxiv.org/abs/nucl-th/0005020v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/nucl-th/0005020v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "nucl-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "nucl-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/nucl-th/0005020v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/nucl-th/0005020v1", "journal_reference": null, "doi": null, "fulltext": "Double Beta Decay: Theory, Experiment, and\nImplications\n\narXiv:nucl-th/0005020v1 9 May 2000\n\nPetr Vogel\n\n1\n\nIntroduction\n\nDouble beta decay is a rare spontaneous nuclear transition in which the nuclear charge changes by two units while the mass number remains the same.\nIt has been long recognized as a powerful tool to study lepton number conservation in general, and neutrino properties in particular. Since the lifetimes\nof double beta decays are so long, the experiments on double beta decay are\nvery challenging and have led to the development of many generally valuable\ntechniques to achieve extremely low backgrounds.\nFor the ββ decay to proceed, the initial nucleus must be less bound than\nthe final one, but more bound than the intermediate nucleus. These conditions\nare realized in nature for a number of even-even nuclei (and never for nuclei\nwith an odd number of protons or neutrons). Since the lifetime of the ββ decay\nis always much longer that the age of the Universe, both the initial and final\nnuclei exist in nature (some of the actinides being the only exceptions). In\nmany of the \"candidates\" the transition of two neutrons into two protons\nis energetically possible, with the largest Q value just above 4 MeV. In a\nfew cases the opposite transition, which decreases the nuclear charge, is also\npossible, but the Q values are typically smaller.\nThe nuclear ββ transition can proceed in several ways. One of them, the\n2ν decay\n−\n(Z, A) → (Z + 2, A) + e−\n1 + e2 + ν̄e1 + ν̄e2\n\n(1)\n\nconserves the lepton number, while the other one, the 0ν decay\n−\n(Z, A) → (Z + 2, A) + e−\n1 + e2\n\n(2)\n\nviolates lepton number conservation and is therefore forbidden in the standard electroweak theory. The prospect of discovering this neutrinoless double\nbeta decay mode is the driving force of most of the interest in this field. It is\nthe possible window into physics \"beyond the Standard Model\".\nDouble beta decay has been and continues to be a popular topic since\nfirst discussed by Maria Goeppert-Meyer in nineteen thirties. There have\nbeen numerous earlier reviews, beginning with the \"classics\" by Primakoff\nand Rosen [1], Haxton and Stephenson [2] and Doi, Kotani and Takasugi [3],\n\n\f2\n\nPetr Vogel\n\nto the more recent ones, often devoted to particular aspects of the ββ decay\n[4,5,6,7,8,9,10]. Many details are also described in the monograph [11]. The\nReview of Particle Physics [12] regularly summarizes the most recent experimental data.\nDouble beta decay in all its modes is a second order weak semileptonic\nprocess, hence its lifetime, proportional to (GF cos θC )−4 , is so very long.\n(Here GF = 1.166 × 10−5 GeV−2 is the Fermi coupling constant, and θC is\nthe Cabbibo angle.) The neutrinoless decay can be mediated by a variety of\nvirtual particles, in particular by the exchange of light or heavy Majorana\nneutrinos. The decay amplitude then depends on the masses and coupling\nconstants of these virtual particles. Independent of the actual mechanism\nof the 0ν ββ decay, its observation would imply that neutrinos necessarily\nhave a nonvanishing Majorana mass [13]. In fact, if the 0ν decay is actually\nobserved, and its rate measured, one can obtain, at least in principle, a lower\nlimit on that mass [14].\nHowever, so far no 0ν decay has been observed. This means (barring artificial complete cancellation of the amplitudes which we dismiss as unnatural)\nthat the upper limit of the decay rate can be interpreted as an independent limit for each of the possible amplitudes of the decay. In particular, we\ncan obtain the limit on the properties of light and heavy virtual Majorana\nneutrinos. Below we concentrate on the decays mediated by these particles.\n(Other possibilities, e.g., the decays mediated by the new particles predicted\nby supersymmetry, are discussed in [9,10].)\nThe ββ decay with the Majoron emission, 0νχ mode,\n−\n(Z, A) → (Z + 2, A) + e−\n1 + e2 + χ .\n\n(3)\n\nbelongs to the category of the lepton number violating decays, even though\nthe lepton number is formally conserved when χ is assigned the lepton number\n−2. The hypothetical scalar particle χ, which must be in this case light\nenough to be emitted in the ββ decay, is usually associated with spontaneous\nbreaking of the B − L symmetry [15,16].\nEmpirically, it is easy to distinguish between the three decay modes listed\nabove, provided the electron energies are measured. The electron sum energy\nspectra are determined by the phase space of the outgoing leptons and clearly\ncharacterize the decay mode, as schematically illustrated in Figure 1. (Geochemical or milking experiments, however, cannot distinguish between the\ndifferent ββ modes as they determine only the total decay rate.)\nThere are two distinct groups of theoretical issues associated with the\ninterpretation of the ββ decay experiments. The particle physics issues deal\nwith the expression of the decay rate in terms of the fundamental parameters,\nsuch as the neutrino masses and mixing angles, coupling constants in the weak\ninteraction Hamiltonian, etc. This group of problems involves also the relation\nof the ββ decay to other processes, such as neutrino oscillations, direct mass\nmeasurements, and searches for other lepton number violating processes.\n\n\fARBITRARY SCALE\n\nDouble beta decay\n\n0.6\n\n0ν, χ\n\n2ν\n\n3\n\n0ν\n\n0.4\n\n0.2\n\n0.0\n0.0\n\n0.5\n\nΚ / Τ0\n\n1.0\n\nFig. 1. Schematic sum electron spectra of the three ββ decay modes. Each is normalized arbitrarily and independently of the others. The abscissa is the ratio K/T0\nof the sum-electron kinetic energy divided by its maximum value.\n\nThe other, essentially decoupled, set of problems involves the nuclear\nstructure issues associated with the ββ decay. The decay rate is expressed in\nterms of nuclear matrix elements (NME) which have to be evaluated. One\nwould like to know, first of all, their value and its uncertainty. This area of\nresearch has attracted lots of attention, and there are many, often conflicting,\nevaluations available in the literature. Unfortunately, there is no simple way\nof judging the correctness and accuracy of the evaluations of the nuclear matrix elements for the neutrinoless decay. Comparison to the experimentally\nknown rate of the 2ν ββ decay rate is often invoked in that context as a test\nof the ability of the nuclear model to describe the related phenomena. It is\nnot clear, however, if this is indeed a valid test. For example, if one assumes\nthat the 0ν decay is mediated by the exchange of a heavy particle (whether\nthis exchanged particle is a heavy neutrino or not), the corresponding internucleon potential is of short range, and additional issues involving nucleon\nstructure, irrelevant for the 2ν decay, play an important role. Another, less\nfundamental but in praxis perhaps more important example deals with the\ndependence of the NME on the number of single nucleon subshells included\nin the calculation. For the 2ν decay, where only the Gamow-Teller operator\nστ plays a role, it is clearly sufficient to include just the states within the\nvalence oscillator shell. It is less clear that the same truncation is sufficient\nfor the correct description of the 0ν decay.\nThe experimental study of the ββ decay presents a formidable challenge\nsince the goal is to detect a process with a half-life in excess of 1025 years\n(the present best limit for the 0ν decay). The ββ decay must be detected in\npresence of an inevitable background of a similar energy caused by trace ra-\n\n\f4\n\nPetr Vogel\n\ndioisotopes with half-lives 15 or more orders of magnitude shorter. Thus, the\noptimum separation of the signal from background, combined with the requirement of having kilogram quantities of the source isotopes, characterizes\nthe present day experiments.\nThe past and current experiments are still relatively modest in size, and\ntherefore also in complexity and cost. Given the importance of the search\nfor the neutrinoless decay, ambitious plans, involving much larger amounts\nof the source nuclei, are considered. Naturally, the larger source mass will\nbe beneficial only if it is accompanied by the corresponding reduction of\nthe background. The future projects will be therefore inevitably much more\ncomplex, and will involve larger groups of researchers. With them, the field\nof ββ decay, which competes already with the other experiments described\nin this book in importance, will also compete in size and cost.\n\n2\n\nLepton number violation\n\nWith the usual assignment of the lepton number, L(l− ) = L(ν) = −L(l+ ) =\n−L(ν̄) = +1, 0ν ββ decay represents a change in the global lepton number\nby two units, ∆L = 2. In that respect its observation would be related to the\nattempts to detect ν̄e from the sun, or of νe from nuclear reactors. Both of\nthese latter processes represent a kind of \"ν ↔ ν̄ oscillations\", and also are\npossible only for massive Majorana neutrinos.\nFor light Majorana neutrinos the lepton number conservation is irrelevant\nand the 0ν decay is hindered only by the helicity mismatch. However, the\n\"antineutrino\" born in association with one of the e− in the 0ν decay is not\nfully righthanded, but has a lefthanded component of amplitude ∼ mν /Eν .\nThis lefthanded piece can be absorbed by another neutron which is converted\ninto a proton and the second e− is emitted. Similar consideration would\ngovern the above mentioned ν ↔ ν̄ oscillations. The word \"oscillations\" in\nthis context is a misnomer, however, since the process (if it exists) would\nproceed without an oscillatory behavior [17].\nThe expected branching ratio for the \"wrong\" neutrinos at low energies,\nrelevant for the sun or nuclear reactors is [18]\nR∼\n\nm2ν σ ν̄N\n∼ 10−14 ,\n2Eν2 σ νN\n\n(4)\n\nwhere the numerical factor was derived for mν ∼ 1 eV, Eν ∼ 5 MeV, and\nthe ratio of cross sections put to unity. Since the 0ν ββ decay is presently\nsensitive to such neutrino masses, one cannot expect a signal for this kind of\nν ↔ ν̄ oscillations until similar sensitivity is achieved, i.e., not anytime soon,\nif ever.\nHowever, it is also possible that ν̄e from the sun are produced in a more\ncomplicated, but possibly more efficient way. Let us assume that a transition\nmagnetic moment μe,l connects the lefthanded νe,L with a righthanded ν̄l,R of\n\n\fDouble beta decay\n\n5\n\na different flavor, which can subsequently oscillate (by the vacuum or matter\nenhanced oscillations) into the righthanded and thus observable ν̄e,R , i.e.,\nwhen neutrinos propagate in a transverse solar magnetic field B⊥ one or both\nof the sequences νe,L → ν̄l,R → ν̄e,R or νeL → νl,L → ν̄eR occurs. Such process\nrequires that the magnetic conversion, which is possible only for the massive\nMajorana neutrinos and which depends on the product μe,l B⊥ , and the flavor\noscillation, which depends on ∆m2 and sin2 2θ, are both present. There is no\nobvious relation between this process and the neutrinoless ββ decay, except\nthat both require the existence of the neutrino Majorana mass term. (This\nbrief discussion of the magnetic conversion is highly simplified. In reality, the\ntransition magnetic moments ought to be written in terms of mass eigenstates\n[19].)\nFinally, tight experimental limits exist on the total lepton number violating processes which involve both electrons and muons (see [12]), such as the\nmuon conversion\nμ− + (Z, A) → (Z − 2, A) + e+ ,\n\n(5)\n\nand the muonium-antimuonium conversion\nμ+ e − → μ− e + .\n\n(6)\n\nThe relation of these processes to the ββ decay is, however, not well established.\n\n3\n\nParticle physics aspects\n\nIn this section we shall consider how the rate of the neutrinoless ββ decay is\nrelated to the unknown parameters of the neutrino mass matrix and to the\nphenomenological parameters describing a generalized semileptonic charged\ncurrent weak interactions HW :\n\u0003\nGF \u0002\n+\n+\n+\n+\nα\n+ κMRα\n) + JR\n(ηMLα\n+ λMRα\n) + H.c. , (7)\nHW = √ JLα (MLα\n2\n\nwhere JL(R) and ML(R) are the lepton and quark left(right)-handed current\nfour-vectors, respectively. The dimensionless parameters η, λ, and κ characterize deviations from the standard model. (Since κ gives a negligible contribution to double beta decay, we will not consider it from now on.) The\ncoupling parameters η and λ, modified by the neutrino mixing, and denoted\nthen usually as hηi and hλi are unknown (and presumably small).\nThe lepton sector of the theory contains in general n generations of\ncharged leptons as well as n left- and n right-handed neutrinos. The neutrino mass matrix is the 2n × 2n matrix M\n\u0013\n\u0012\nT\nML MD\n,\n(8)\nM=\nMD MR\n\n\f6\n\nPetr Vogel\n\nwhere MD is the n × n lepton number conserving Dirac mass term, and\nthe symmetric n × n matrices ML and MR are the lepton number violating\nMajorana mass terms. The matrix M has 2n real, but not necessarily positive,\neigenvalues. Writing the eigenvalues as mj ǫj , we can impose the physically\nreasonable condition that mj ≥ 0. The sign of the eigenvalues of the mass\nmatrix is contained in the phases ǫj = ±1 which are the intrinsic CP parities\nof the neutrinos j.\nNeutrino oscillation phenomena arise because the \"mass eigenstates\" of\nM or, more precisely their chiral projections NjL and NjR , are not necessarily\nthe familiar weak interaction neutrinos that couple to the known intermediate vector boson WL and to the hypothetical right-handed boson WR . The\nphysical \"weak eigenstate\" or current neutrinos, the n left-handed neutrinos\n′\nνL and the n right-handed ones νR (the prime has been added in order to\nstress that they are different particles), are related to the neutrinos of definite\nmass by the n × 2n mixing matrices U and V\n′\n\nνL = U N L , νR = V N R .\n\n(9)\n\nThe mixing matrices U and V obey the normalization and orthogonality\nconditions\n2n\nX\n\nUlj∗ Ul′ j = δll′ ,\n\n2n\nX\n\nVlj∗ Vl′ j = δll′ ,\n\nj=1\n\nj=1\n\n2n\nX\n\nUlj∗ Vl′ j = 0 .\n\n(10)\n\nj=1\n\nIn neutrinoless ββ decay the rate depends on the effective parameters\nwhich are expressed in terms of the mixing matrices U and V :\nX′\n2\nhmν i =\nǫj mj Ue,j\n,\nj\n\nhλi = λ\nhηi = η\nhgν,χ i =\n\nX′\n\nǫj Ue,j Ve,j ,\n\n(11)\n\nj\n\nX′\n\nǫj Ue,j Ve,j ,\n\nj\n\n1 X′\n(gi,j ǫi + gj,i ǫj ) Ue,i Ue,j .\n2 i,j\n\nHere the prime indicates that the summation is over only relatively light\nneutrinos. Also, λ and η are the dimensionless coupling constants for the\nright-handed current weak interaction, Eq.(7), and gi,j are the coupling constants of interaction between the Majoron χ and the Majorana neutrinos Ni\nand Nj . For the heavy neutrino one obtains\nX ′′\n2\nhm−1\nǫj m−1\n(12)\nν iH =\nj Ue,j ,\nj\n\n\fDouble beta decay\n\n7\n\nwhere the double prime indicates that the summation, involving the inverse neutrino masses m−1\nj , is over only the heavy neutrino mass eigenstates\n(mj ≥1 GeV).\nIt is now clear that, within the mechanism considered so far, there is no\nneutrinoless double beta decay if all neutrinos are massless. Not only hmν i\nvanishes in such a case but also hλi and hηi vanish due to the orthogonality\ncondition Eq. (10). Moreover, hλi and hηi vanish for the same reason even if\nsome or all neutrinos are massive but light and therefore the summation in\nEq.(11) contains all neutrino mass eigenstates. In that case, however, there is\na smaller next order contribution from the mass dependence of the neutrino\npropagator, which for this purpose can be written as\n!\nm2j\nγμ q μ\nγμ q μ\n1− 2\n.\n(13)\n≈\nq 2 + m2j\nq2\nq\nP ′\n2\nThe expression for e.g., hλi now contains\nj ǫj Ue,j Ve,j mj which clearly\nshows that a nonvanishing neutrino mass is required.\nThe presence of the phases ǫj in the expression for hmν i means that\ncancellations are possible. In particular, for every Dirac neutrino there is an\nexact cancellation, since the Dirac neutrino is equivalent to a pair of Majorana\nneutrinos with the opposite sign of the phases ǫj and degenerate masses.\nIn the general case the neutrinoless double beta decay rate is a quadratic\npolynomial in the unknown parameters\n0ν\n[T1/2\n(0+ → 0+ )]−1 = C1\n\nhmν i\nhmν i\nhmν i2\ncos ψ1 + C3 hηi\ncos ψ2\n+ C2 hλi\n2\nme\nme\nme\n\n+ C4 hλi2 + C5 hηi2 + C6 hλihηi cos(ψ1 − ψ2 ) .\n\n(14)\n\nHere ψ1 and ψ2 are the phase angles between the generally complex numbers\nmν , λ and η. (However, when CP invariance is assumed ψ1,2 are either 0 or\nπ.) The phase space integrals and the nuclear matrix elements are combined\nin the factors Ci . Assuming that we can calculate them, Eq. (14) represents\nan ellipsoid which restricts the allowed range of the unknown parameters\nhmν i, hλi and hηi for a given value (or limit) of the 0ν double beta decay\nlifetime.\nIn order to evaluate the nuclear matrix elements, we must consider the\nneutrino propagator. Assuming that hmν i2 is the only relevant quantity, one\ncan perform the integration over the four-momentum of the exchanged particle and obtain the \"neutrino potential\", which for mν < 10 MeV has the\nform\nZ\nsin(qr)\n2R ∞\n,\n(15)\ndq\nH(r, ∆E) =\nπr 0\nq + ∆E\nwhere ∆E = hEN i − 1/2(Mi + Mf ) is the average excitation energy of the\nintermediate odd-odd nucleus and the factor R (the nuclear radius) has been\nadded to make the neutrino potential dimensionless.\n\n\f8\n\nPetr Vogel\n\nWhen the 0ν decay is mediated by the right-handed weak current interaction the evaluation of the decay rate becomes more complicated, since\nmany more terms must be included (see [2,3,20]). If the four-momentum of\nthe virtual neutrino is qμ ≡ ω, q, the neutrino propagator contains\nωγ0 − q * γ + mj .\nThe part of the propagator proportional to mj is responsible for the neutrino\npotential Eq.(15). The part containing q leads to a new potential related to\nthe derivative of H(r, ∆E), and the part with ω leads to yet another potential,\nwhich is a combination of H(r, ∆E) and its derivative.\nSimilarly, there are now also more nuclear matrix elements, which contain\nin addition the nucleon momenta (i.e., the gradient operators), and depend\non the nucleon spins and radii in a more complicated way (e.g., they contain\ntensor operators). The outgoing electrons are no longer just in the s1/2 states,\nbecause for some of the operators one of the electrons will be in the p1/2\nstate. The recoil matrix element, which originates from the recoil term in the\nnuclear vector current is numerically relatively large [20], resulting in more\nsensitivity to the parameter hηi. The current best limits on hηi and hλi are\nlisted in [12].\n\n4\n\nExperimental techniques and results\n\nIt is beyond the scope of this review to describe in detail the experimental\ntechniques developed to meet the challenge of background suppression and\nsignal recognition needed to determine the rate (or an interesting limit) of\nthe ββ decay. Thus, only the briefest outline is given, and the most important\nexperimental results are summarized in tables.\nHistorically, the existence of ββ decay was first established using the geochemical method. Here one takes advantage of geologic integration times by\nsearching for daughter products accumulated in ancient minerals that are\nrich in the parent isotope. (The related radiochemical method is applicable\nif the daughter isotope is radioactive.) Since the energy information is long\nlost, the mode of ββ decay responsible is not directly determined. Instead,\nthe total decay rate is determined, and thus an upper limit of each mode as\nwell.\nOnly by measuring the energies of electrons released in the decay in the\ndirect counting experiments can one distinguish directly the mode of decay.\nThe 2ν and 0νχ decay modes each result in a rather generic looking electron\nspectrum (see Fig.1), and the observation of these decays requires either an\nextremely efficient background suppression or additional information, such\nas a tracking capability.\nThe measured half-lives of the 2ν mode are collected in Table 1. Many of\nthem have been measured by several groups; only the results with the smallest\nclaimed errors are shown. (The case of 130 Te where the two competing results\n\n\fDouble beta decay\n\n9\n\nhave the same error but exclude each other is the only exception.) Also,\nthe numerous half-life limits have been omitted. The 2ν mode is now well\nestablished; no doubt many more and more accurate results will become\navailable soon.\nIn fact, ββ decay is becoming a valuable tool of nuclear spectroscopy.\nThe decay of 100 Mo into the excited 0+ state at 1130 keV in 100 Ru has been\nobserved [30,31]. The technique used, the observation of the subsequent γ\ndecay cascade, can be readily applied to other nuclei as well. This development not only expands the scope of the experimental study of the ββ decay,\nbut allows more detailed comparison between theory and experiment (for an\nearly attempt, see [32]).\nTable 1. Recent ββ2ν results.\n(Only positive results are listed. The most accurate published values are given,\nexcept for 130 Te where two conflicting results with the same claimed errors are\nquoted.)\n\nIsotope T2ν\n1/2 (y)\n19\n(4.3+2.4\n−1.1 ± 1.4) × 10\n+0.13\n(1.77 ± 0.01 −0.11 ) × 1021\n(8.3 ± 1.0 ± 0.7) × 1019\n(3.9 ± 0.9) × 1019 geoch\n18\n(6.82+0.38\n−0.53 ± 0.68) × 10\n(3.75 ± 0.35 ± 0.21) × 1019\n(7.2 ± 0.4) × 1024 geoch\n(2.7 ± 0.1) × 1021 geoch\n(7.9 ± 1.0) × 1020 geoch\n150\n18\nNd (6.75+0.37\n−0.42 ± 0.68) × 10\n238\n21 radioch\nU\n(2.0 ± 0.6) × 10\n\n48\n\nCa\n76\nGe\n82\nSe\n96\nZr\n100\nMo\n116\nCd\n128\nTe\n130\nTe\n\ngeoch\n\nReference\n[21]\n[22]\n[23]\n[24]\n[25]\n[26]\n[27]\n[27]\n[28]\n[25]\n[29]\n\ngeochemical determination; total decay rate.\nradiochemical determination; total decay rate\n\nradioch\n\nThe 0ν mode can be approached quite differently from 2ν and 0ν, χ modes\nbecause of the distinctive character of the 0ν electron sum spectrum - a\nmonoenergetic line at the full Q-value (see Fig. 1). Obviously, sharp energy\nresolution of 0ν detectors is a big advantage which helps to isolate the line\nfrom background. As in the case of the 2ν decay other features, such as\ntracking, naturally help as well.\nThe best reported limits for the neutrinoless ββ decay modes are collected in Tables 2 and 3. Again, only the most restrictive limits for the given\ntransition are shown. The longest half-life limit, reported for 76 Ge by the\n\n\f10\n\nPetr Vogel\n\nHeidelberg-Moscow collaboration [33], is based on 24.16 kg yr of exposure\nand uses pulse shape discrimination to suppress the background (in the relevant energy region the background is a mere (0.06±0.02) events/(kg*yr*keV)).\nIn that experiment 7 events were observed in the 3σ region around the 0ν decay Q value, while from the background extrapolation one expects 13 events.\nUsing this lack of background events an even more stringent limit (the entry\nin parenthesis in Table 2) is obtained.\nThe limit based on the Te lifetime ratio in Table 2 is based on the different\nQ value dependence of the 0ν and 2ν modes. That this offers a valuable tool\nhas been recognized already in the prophetic early paper by Pontecorvo [44].\nEven though the corresponding NME are not exactly equal, they are close\nenough to allow one to use the geochemical lifetime determination here and\nin Table 3.\nTable 2. Best reported limits on T0ν\n1/2 and hmν i.\nThe experimental result is listed first with its reference. This is followed by the limit\non hmν i followed by the reference to the employed nuclear matrix element (NME).\nWhenever possible the choice of the authors of the experimental paper regarding\nthe NME is respected. See the text for the discussion of uncertainties associated\nwith the evaluation of NME's.\nIsotope\n48\nCa\n76\nGe\n82\nSe\n100\nMo\n116\nCd\nT1/2 (130) (see 2)\nT1/2 (128)\n136\n\n22\nT0ν\ny) (CL%)\nexp. ref.\nhmν i (eV)\n1/2 (10\n> 0.95 (76)\n[34]\n< 18.3\n> 1600(5700) (see 1) (90) [33] < 0.4(0.2) (see\n> 2.7 (68)\n[36]\n<5\n> 5.2 (68)\n[37]\n< 6.6\n> 2.9 (90)\n[38]\n< 4.6\n\n(3.52 ± 0.11) × 10−4\n\n[27]\n\n< 1.1 − 1.5\n\n1)\n\nNME ref.\n[2]\n[35]\n[2]\n[20]\n[35]\n[35,39]\n\nXe\n> 44 (90)\n[40]\n< 2.3 − 2.8\n[39]\nNd\n> 0.12 (90)\n[25]\n< 4.0\n[35]\n1\nthe first entry is based on the average background and the entry in parenthesis\nis based on the apparent lack of background counts in the corresponding energy\ninterval.\n2\ngeochemical determination of the lifetime ratio\n150\n\n5\n\nNuclear structure aspects\n\nThe rate of the 2ν ββ decay is simply\n2ν\n1/T1/2\n= G2ν (E0 , Z)|M2ν |2 ,\n\n(16)\n\n\fDouble beta decay\n\n11\n\nTable 3. The most restrictive Majoron limits.\nIsotope T0ν,χ\n(y) and (CL %) hgν,χ i\n1/2\n48\n\n20\n\nReference\n−4\n\nCa > 7.2 × 10 (90)\n< 5.3 × 10\n[41]\nGe > 1.66 × 1022 (90)\n< 1.8 × 10−4 ,\n[42]\n82\nSe\n> 2.4 × 1021 (68)\n< 2.3 × 10−4\n[23]\n100\n21\n−5\nMo > 5.4 × 10 (68)\n< 7.3 × 10\n[37]\n116\nCd > 1.2 × 1021 (90)\n< 2.1 × 10−4\n[43]\n128\nTe > 7.7 × 1024 geoch (90) < 3 × 10−5\n[27]\n136\nXe > 7.2 × 1021 (90)\n< 1.6 × 10−4\n[40]\n150\nNd > 2.8 × 1020 (90)\n< 1 × 10−4\n[25]\ngeoch\ngeochemical determination; from total decay rate\n76\n\nwhile for the neutrinoless decay (assuming that it is mediated by a light\nMajorana neutrino and that there are no right-handed weak interactions),\nand for the decay with Majoron emission, it is given by\n0ν\n= G0ν (E0 , Z)|M0ν |2 hmν i2 ,\n1/T1/2\n\n(17)\n\n0ν,χ\n1/T1/2\n= G0ν,χ (E0 , Z)|M0ν,χ |2 hgν,χ i2 .\n\nHere the phase space functions G(E0 , Z) are accurately calculable, and the\nnuclear matrix elements M are the topic of this section. Obviously, the accuracy with which the fundamental particle physics parameters hmν i and hgν,χ i\ncan be determined is limited by our ability to evaluate these nuclear matrix\nelements.\nIn that context there are three distinct set of problems:\n• 2ν decay: the physics of the Gamow-Teller amplitudes\n• 0ν decay with the exchange of light massive Majorana neutrinos: no selection rules on multipoles, role of nucleon correlations, sensitivity to nuclear\nmodels.\n• 0ν decay with the exchange of heavy neutrinos: physics of the nucleonnucleon states at short distances.\n5.1\n\nTwo neutrino decay\n\nSince the energies involved are modest, the allowed approximation should\nbe applicable, and the rate is governed by the double Gamow-Teller matrix\nelement\nX hf ||στ+ ||mi × hm||στ+ ||ii\n′\n2ν\n(18)\nMGT\n=\nE\n−\n(M\n+\nM\n)/2\nm\ni\nf\nm\n\n\f12\n\nPetr Vogel\n\nwhere i, f are the ground states in the initial and final nuclei, and m are\nthe intermediate 1+ (virtual) states in the odd-odd nucleus. The first factor\nin the numerator above represents the β + (or (n, p)) amplitude for the final\nnucleus, while the second one represents the β − (or (p, n)) amplitude for the\ninitial nucleus. Thus, in order to correctly evaluate the 2ν decay rate, we\nhave to know, at least in principle, all GT amplitudes for both β − and β +\nprocesses, including their signs. The difficulty is that the 2ν matrix element\nexhausts a very small fraction (10−5 − 10−7 ) of the double GT sum rule [45],\nand hence it is sensitive to details of nuclear structure.\nVarious approaches used in the evaluation of the 2ν decay rate have been\nreviewed recently in Ref. [6]. The Quasiparticle Random Phase Approximation (QRPA) has been the most popular theoretical tool in the recent past.\nIts main ingredients, the repulsive particle-hole spin-isospin interaction, and\nthe attractive particle-particle interaction, clearly play a decisive role in the\nconcentration of the β − strength in the giant GT resonance, and the relative suppression of the β + strength and its concentration at low excitation\nenergies. Together, these two ingredients are able to explain the suppression\nof the 2ν matrix element when expressed in terms of the corresponding sum\nrule.\nYet, the QRPA is often criticized. Two \"undesirable\", and to some extent\nunrelated, features are usually quoted. One is the extreme sensitivity of the\ndecay rate to the strength of the particle-particle force (often denoted as\ngpp ). This decreases the predictive power of the method. The other one is\nthe fact that for a realistic value of gpp the QRPA solutions are close to\ntheir critical value (so called collapse). This indicates a phase transition, i.e.,\na rearrangement of the nuclear ground state. QRPA is meant to describe\nsmall deviations from the unperturbed ground state, and thus is not fully\napplicable near the point of collapse. Numerous approaches have been made\nto extend the range of validity of QRPA, see e.g. [6]. Altogether, QRPA and\nits various extensions, with their ability to adjust at least one free parameter,\nare typically able to explain the observed 2ν decay rates.\nAt the same time, detailed calculations show that the sum over the excited\nstates in Eq.(18) converges quite rapidly [46]. In fact, a few low lying states\nusually exhaust the whole matrix element. Thus, it is not really necessary to\ndescribe all GT amplitudes; it is enough to describe correctly the β + and β −\namplitudes of the low-lying states, and include everything else in the overall\nrenormalization (quenching) of the GT strength.\nNuclear shell model methods are presently capable of handling much\nlarger configuration spaces than even a few years ago. Thus, for many nuclei\nthe evaluation of the 2ν rates within the 0h̄ω shell model space is feasible. (Heavy nuclei with permanent deformation, like 150 Nd and 238 U remain,\nhowever, beyond reach of the shell model techniques.) Using the shell model\navoids, naturally, the above difficulties of QRPA. At the same time, the shell\nmodel can describe, using the same method and the same residual interaction,\n\n\fDouble beta decay\n\n13\n\na wealth of spectroscopic data, allowing much better tests of its predictive\npower.\n5.2\n\nNeutrinoless decay: light Majorana neutrino\n\nIf one assumes that the 0ν decay is caused by the exchange of a virtual light\nMajorana neutrino between the two nucleons, then several new features arise:\na) the exchanged neutrino has a momentum q ∼ 1/rnn ≃ 50 − 100 MeV (rnn\nis the distance between the decaying nucleons). Hence, the dependence on\nthe energy in the intermediate state is weak and the closure approximation is\napplicable and one does not have to sum explicitly over the nuclear intermediate states. Also, b) since qR > 1 (R is the nuclear radius), the expansion\nin multipoles is not convergent, unlike in the 2ν decay. In fact, all possible multipoles contribute by a comparable amount. Finally, c) the neutrino\npropagator results in a neutrino potential of a relatively long range (see Eq.\n(15)).\nThus, in order to evaluate the rate of the 0ν decay, we need to evaluate only the matrix element connecting the ground states 0+ of the initial\nand final nuclei. Again, we can use the QRPA or the shell model. Both calculations show that the features enumerated above are indeed present. In\naddition, the QRPA typically shows less extreme dependence on the particleparticle coupling constant gpp than for the 2ν decay, since the contribution\nof the 1+ multipole is relatively small. The calculations also suggest that for\nquantitatively correct results one has to treat the short range nucleon-nucleon\nrepulsion carefully, despite the long range of the neutrino potential.\nDoes that mean that the calculated matrix elements are insensitive to nuclear structure? An answer to that question has obviously great importance,\nsince unlike the 2ν decay, we cannot directly test whether the calculation is\ncorrect or not.\nFor simplicity, let us assume that the 0ν ββ decay is mediated only by the\nexchange of a light Majorana neutrino. The relevant nuclear matrix element\n0ν\nis then the combination MGT\n− MF0ν , where the GT and F operators change\ntwo neutrons into two protons, and contain the corresponding operator plus\nthe neutrino potential. One can express these matrix elements either in terms\nof the proton particle - neutron hole multipoles (i.e., the usual beta decay\noperators) or in terms of the multipole coupling of the exchanged pair, nn\nand pp.\nWhen using the decomposition in the proton particle - neutron hole multipoles, one finds that all possible multipoles (given the one-nucleon states\nnear the Fermi level) contribute, and the contributions have typically equal\nsigns. Hence, there does not seem to be much cancellation.\nHowever, perhaps more physical is the decomposition into the exchanged\npair multipoles. There one finds, first of all, that only natural parity multipoles (π = (−1)I ) contribute noticeably. And there is a rather severe cancellation. The biggest contribution comes from the 0+ multipole, i.e., the pairing\n\n\f14\n\nPetr Vogel\n16\n\nCumulative matrix element\n\n14\n12\n10\n\nGe76\n\n8\n6\n4\n\nCa48\n2\n0\n\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\nMultipolarity I\nFig. 2. The cumulative contribution, i.e., the summed contribution of all natural\nparity multipoles up to I of the exchanged nn and pp pair, to the 0ν nuclear matrix\n0ν\nelement combination MGT\n− MF0ν . The full line is for 76 Ge and the dashed line for\n48\nCa.\n\npart. All other multipoles, related to higher seniority states, contribute with\nan opposite sign. The final matrix element is then a difference of the pairing\nand higher multipole (or broken pair ≡ higher seniority) parts, and is considerably smaller than either of them. This is illustrated\n2 where the cu-\u0003\nPin\u0002Fig.\n0ν\nmulative effect is shown, i.e., the quantity M (I) = IJ MGT\n(J) − MF0ν (J)\n76\n48\nis displayed for Ge (from [47]) and Ca (from [48]). Thus, the final result\ndepends sensitively on both the correct description of the pairing and on the\nadmixtures of higher seniority configurations in the corresponding initial and\nfinal nuclei. It appears, moreover, that the final result might depend on the\nsize of the single particle space included. That important question requires\nfurther study.\nSince there is no objective way to judge which calculation is correct, one\noften uses the spread between the calculated values as a measure of the\ntheoretical uncertainty. This is illustrated in Fig. 3. There, I have chosen two\nrepresentative QRPA sets of results, the highly truncated \"classical\" shell\nmodel result of Haxton and Stephenson, and the result of more recent shell\nmodel calculation which is convergent for the set of single particle states\nchosen (essentially 0h̄ω space).\nFor the most important case of 76 Ge the calculated rates differ by a factor\nof 6-7. Since the effective neutrino mass hmν i is inversely proportional to the\n\n\fDouble beta decay\n\n15\n\n25\n\nHalflives corresponding to <mν> = 1 eV\n\n10\n\n24\n\n10\n\nGe\n\n76\n\n82\n\nSe\n\n100\n\nMo\n\n130\n\nTe\n\nXe\n\n136\n\nFig. 3. Half-lives (in years) calculated for hmν i = 1 eV by various representative\nmethods and different authors for the most popular double-beta decay candidate\nnuclei. Solid lines are QRPA from [35], dashed lines are QRPA from [39] (recalculated for gA = 1.25 and α′ = −390 MeV fm3 ), dotted lines are shell model [2], and\ndot-and-dashed lines are shell model [49].\n\nsquare root of the lifetime, the experimental limit of 1.6 × 1025 y translates\ninto limits of about 1 eV using the NME of [39,49], and about 0.4 eV with\nthe NME of [2,35]. On the other hand, if one would accept the more stringent\nlimit of 5.7 × 1025 [33], even the more pessimistic matrix elements restrict\nhmν i < 0.5 eV. Needless to say, a more objective measure of the theoretical\nuncertainty would be highly desirable.\nIn Tables 2 and 3 we list the deduced limits on the fundamental parameters, the effective neutrino Majorana mass hmν i, and the Majoron coupling\nconstant hgν,χ i. The references to the source of the corresponding nuclear\nmatrix elements, used to translate the experimental half-life limit into the\nlisted limits on hmν i and hgν,χ i are also given. When using the tables one\nhas to keep in mind the uncertainties illustrated in Fig. 3.\n5.3\n\nNeutrinoless decay: very heavy Majorana neutrino\n\nThe neutrinoless ββ decay can be also mediated by the exchange of a heavy\nneutrino. The decay rate is then inversely proportional to the square of the\neffective neutrino mass [50]. In this context it is particularly interesting to\nconsider the left-right symmetric model proposed by Mohapatra [51]. In it,\n\n\fPetr Vogel\n\nweak vertex\n\nN\n\n11\n00\n00\n11\n\nn\n\nN\n\nπ, ω\n\n,\n\nρ\n\nstrong vertex\n\n16\n\n11\n00\n00\n11\n\nn\n\nπ\n\nπ 1\n0\n0\n1\n0\n1\n\ne\n\nN\n\nN\n\np\n\ne\n\np\n\nFig. 4. The Feynman graph description of the parity-violating nucleon-nucleon\nforce (left graph) and of the ββ decay with the exchange of a heavy neutrino\nmediated by the pion exchange. The short range lepton number violating amplitude\nis symbolically described by the filled blob in the right graph.\n\none can find a relation between the mass of the heavy neutrino MN and the\nmass of the right-handed vector boson WR . Thus, the limit on the ββ rate\nprovides, within that specific model, a stringent lower limit on the mass of\nWR .\nThe process then involves the emission of the heavy WR− by the first neutron and its virtual decay into an electron and the heavy Majorana neutrino,\nWR− → e− + νN . This is followed by the transition νN → e− + WR+ and the\nabsorption of the WR+ on the second neutron, changing it into the second proton. Since all exchanged particles between the two neutrons are very heavy,\nthe corresponding \"neutrino potential\" is of essentially zero range. Hence,\nwhen calculating the nuclear matrix element, one has to take into account\ncarefully the short range nucleon-nucleon repulsion.\nAs long as we treat the nucleus as an ensemble of nucleons only, the only\nway to have nonvanishing nuclear matrix elements for the above process is\nto treat the nucleons as finite size particles. In fact, that is the standard way\nto approach the problem [50]; the nucleon size is described by a dipole form\nfactor with the cut-off parameter Λ ≃ 0.85 GeV. Using such a treatment of\nthe nucleon size, and the half-life limit for the 76 Ge 0ν decay listed in Table\n2, one obtains a very interesting limit on the mass of the vector boson WR\n[52]\nmWR ≥ 1.6 TeV .\n\n(19)\n\nHowever, another way of treating the problem is possible, and already\nmentioned in [50]. Let us recall how the analogous situation is treated in the\ndescription of the parity-violating nucleon-nucleon force [53]. There, instead\n\n\fDouble beta decay\n\n17\n\nof the weak (i.e., very short range) interaction of two nucleons, one assumes\nthat a meson (π, ω, ρ) is emitted by one nucleon and absorbed by another\none. One of the vertices is the parity-violating one, and the other one is the\nusual parity-conserving strong one. The corresponding range is then just the\nmeson exchange range, easily treated. The situation is schematically depicted\nin the left-hand panel of Fig. 5.3. The analogy for ββ decay is shown in\nthe right-hand graph. It involves two pions, and the \"elementary\" lepton\nnumber violating ββ decay then involves a transformation of two pions into\ntwo electrons. Again, the range is just the pion exchange range. It would be\ninteresting to see if a detailed treatment of this graph would lead to more\nor less stringent limit on the mass of the WR than the treatment with form\nfactors. The relation to the claim in [54] that an analogous graph contributing\nto the lepton number violating muon capture identically vanishes should be\nfurther investigated; in fact that claim is probably not valid.\n\n6\n\nPerspectives\n\nAs stated earlier, the present best limits on the rate of the 0ν ββ decay,\nor equivalently on the neutrino effective Majorana mass hmν i, were obtained\nwith an exposure of about 20 kg*yr. Several experiments (Heidelberg-Moscow\n76\nGe [33], IGEX 76 Ge [55], Caltech-Neuchatel TPC 136 Xe [40]) are presently\nat or near that level. The other limits in Tables 2 and 3 were obtained with\nsmaller exposures of ∼ 1 kg*yr. The detector NEMO-3, with planned source\nmass of 10 kg, is being built and should be operational soon [56]. In few years\nof operation it should reach a half-life limit of ∼ 1025 yr for the 0ν decay\nof 100 Mo, and perhaps other nuclei as well. However, further improvements\nwith the existing detectors becomes increasingly difficult, since the sensitivity\nto the hmν i is proportional to only the 1/4 power of the source mass and\nexposure time. Thus, much larger sources are clearly needed.\nWhat are the perspectives of a radical improvement in the search for the\n0ν ββ decay? To achieve that, one would have to build a detector capable of\nusing hundreds of kg or even several tons of the source material. At the same\ntime, the background per unit mass has to be correspondingly improved so\nthat one can benefit from the larger mass. Obviously, such program is very\nchallenging.\nThe difficulty begins with the problem of acquiring such a large mass of the\nisotopically separated and radioactively clean material. Here, the principal\nobstacle is the cost of the isotope separation. (This can be avoided only if\nthe source isotope has large abundance; in practice that is true only for 130 Te\nwith 34% abundance.)\nThe second unavoidable difficulty is the background caused by the 2ν\ndecay. One can observe the 0ν decay only if its rate exceeds the fluctuations\nof the 2ν events at the same energy, i.e., near the decay Q value. The number\nof 2ν decays in an energy interval ∆E near Q depends on these quantities\n\n\f18\n\nPetr Vogel\n\nlike ∼ (∆E/Q)6 provided ∆E ≪ Q. (If the energy resolution is folded in,\nthis dependence is somewhat modified.) Thus, good energy resolution, which\ndetermines how wide interval ∆E one must consider, is again crucial in order\nto reduce the effect of this \"ultimate\" background.\nOne of the proposal for such a large ββ experiments has been extensively\ndiscussed in the literature (see, e.g., [9]). The project, with the acronym GENIUS, would use a large amount of 'naked' enriched 76 Ge, in the form of\nan array of about 300 detectors, suspended in liquid nitrogen, which provides simultaneously cooling and shielding. It is envisioned that the detector\nwould consist of one ton of enriched 76 Ge. The anticipated background is\n0.04 counts/(keV*yr*t), i.e., about 1000 times lower than the best existing\nbackgrounds. Such a detector could reach the half-life limit of about 6 × 1027\nyr within one year of operation, thus improving the neutrino mass limit by\nan order of magnitude.\nAnother large project, CUORE, [57] is a cryogenic set-up consisting of 17\ntowers, each containing 60 cubic crystals of TeO2 . It would be housed in a\nsingle specially constructed dilution refrigerator and would contain about 800\nkg of the sensitive material. A prototype system, CUORICINO, consisting of\none of the towers, is being developed now.\nAn experiment with a large amount (100 tons) of natural molybdenum,\n(abundance of the ββ candidate 100 Mo = 9.6%) with good energy and position resolution, is proposed in Ref. [58].\nIn order to radically suppress the background, the Ba ions, the final products of the 136 Xe double beta decay, could be identified by laser tagging. That\napproach, described in Ref. [59], would allow to use a large Time Projection\nChamber with perhaps ton quantities of 136 Xe, reaching sensitivities to halflives ∼ 1028 years.\nThis, still incomplete list of proposed very large ββ decay experiments\nshows that the field is entering a critical phase. If the new techniques, mentioned above, can be developed in conjuntion with the large source mass, the\nbackground caused by radioactivities can be essentially eliminated. However,\nas stated above, the ultimate background due to the tail of the 2ν decay can\nbe compensated only by a superior energy resolution.\nGiven the importance of the neutrinoless decay, it is likely that several\nof these large and costly projects, involving ton*years of exposure and a correspondingly reduced background, will be realized in the foreseeable future.\nThus, sensitivity to the neutrino Majorana mass hmν i approaching 0.01 eV\nmay be in sight. Whether the neutrinoless decay will be discovered is unknown, but the reasons to look for it are so compelling, that the search will\nundoubtedly continue.\n\n\fDouble beta decay\n\n7\n\n19\n\nImplications\n\nThe study of 0ν ββ decay provides at present an upper limit well below 1 eV\nfor the effective electron neutrino Majorana mass hmν i even if the most pessimistic nuclear matrix elements are used. What are the consequences of that\nlimit when combined with the manifestations of the neutrino oscillations?\nRecall that the atmospheric neutrino anomaly (with its zenith angle dependence) implies the nearly maximum mixing of μ and τ neutrinos (or μ\nand sterile neutrinos) with ∆m2 ∼ 10−3 eV2 (see chapter 5 of this book).\nThere is, so far, no unique neutrino oscillation solution to the solar neutrino\ndeficit(see chapter 4 of this book). However, all of the acceptable solutions\nhave ∆m2 < 10−4 eV2 and involve electron neutrinos. Both large and small\nmixing angle solutions are currently compatible with the data. Finally, the\nthird \"positive\" evidence comes from the LSND experiment (see chapter 7\nof this book), and implies relatively small mixing between the electron and\nmuon neutrinos and ∆m2 ≥ 0.1 eV2 . A full analysis must contain, in addition,\nall experimental results which exclude various parts of the possible regions of\nthe quantities ∆m2 and the mixing angles. Taking all these findings together\nwould necessarily imply the existence of a fourth neutrino, which must be\n\"sterile\" given the constraint on the invisible width of the Z. At the same\ntime, it is well known that oscillation experiments are not able to furnish the\noverall scale of the neutrino masses.\nThis absolute neutrino mass scale is essential not only as a matter of\nprinciple, but in particular if one wants to ascribe part of the dark matter,\nnamely its \"hot\" component, to massive\nP neutrinos. Doing that would mean\nthat the sum of the neutrino masses\nmν is one or several eV. Tritium beta\ndecay gives an upper limit of a similar magnitude for any mass eigenstate with\na large electron flavor component. Clearly, if light neutrinos are responsible\nfor a nonnegligible part of the dark matter, the oscillation data mean that\nat least two, and possibly all neutrino masses are nearly degenerate. (Such\nscenario was discussed for the first time in Ref. [60].) The relation of the 0ν\nββ decay and the oscillation scenarios, in particular the scenarios involving\ndegenerate neutrinos, has been a topic of several recent papers [61,62,63,64].\nThe consequences are particularly dramatic if one assumes that only three\nmassive Majorana neutrinos exist with nearly degenerate masses mi ≃ m̄ ∼\nO(eV). (Hence discarding for this purpose the LSND experimental result,\neven though there is no evidence against it.) The ββ decay constraint can be\nexpressed as [61]\n′\n\nhmν i = |m1 c22 c23 eiφ + m2 c22 s23 eiφ + m3 s22 ei2δ | ,\n\n(20)\n\nwhere ci , si denote cos θi , sin θi in the 3×3 mixing matrix, δ is the CP violating\nphase in that matrix, and φ, φ′ are the CP violating phases in the diagonal\nmass matrix. Clearly, the differences in mi can be neglected in this case.\nMoreover, the reactor long baseline experiments have established that νe do\n\n\f20\n\nPetr Vogel\n\nnot mix very much with anything else near ∆m2 ∼ 10−3 eV2 , which means\nthat the angle θ2 is small. At the same time, the angle θ1 which controls\nthe atmospheric neutrino oscillations is near its maximum value sin2 2θ1 ≃ 1.\nThus\n′\n\n| cos2 θ3 + sin2 θ3 ei(φ −φ) | < hmν i/m̄ ≪ 1 .\n\n(21)\n\nHence also θ3 must be near the maximum mixing, sin 2θ3 ≃ 1, and the CP\nphases in the above equation (21) are such that the two terms cancel each\nother.\nThat would be a very unexpected result. We would have three massive\nhighly degenerate neutrinos with bimaximal mixing. Moreover, the electron\nneutrino would be 'quasi-Dirac' with its two components essentially canceling\neach other in their contribution to the 0ν ββ decay. While such a scenario is\nrather problematic (see [62]), and it does not accommodate the LSND result\nat all, it illustrates the power of the neutrinoless ββ decay in constraining\nthe choice of the neutrino oscillation scenarios.\n\n8\n\nConclusions\n\nThe quest for neutrino mass is at a critical stage at present. The evidence for\nneutrino mixing is getting stronger and stronger, and the basic parameters\ndescribing the neutrino oscillation phenomena are being constrained more\nand more. At the same time, the oscillation searches cannot give us the scale\nof the neutrino masses, but only their differences. Among the experiments\nthat are sensitive to the masses themselves, albeit to their different aspects\n(end point of the ordinary beta decay, observation of the supernova neutrinos,\nand the neutrinoless double beta decay), only the 0ν decay is able to reach\nthe sub eV region, and in a foreseeable future extend it by a substantial\nmargin.\nIn this review the present status of the ββ decay is described. The unpleasant uncertainty related to the nuclear structure aspect of the problem is\nestimated to be at the level of a factor of 2-3 for the effective neutrino mass.\nHowever, the experimental progress is such that even using the most conservative nuclear matrix elements allows us to push the limit well below the\ncompeting techniques. The nuclear structure uncertainty can be reduced by\nfurther development of the corresponding nuclear models. At the same time,\nby reaching comparable experimental limits in several nuclei, the chances of\na severe error in the NME will be substantially reduced.\nSeveral projects are under way that will improve the life-time limit substantially, or find the 0ν decay. Already now the search for ββ decay gives\nimportant constraints on the fundamental properties of neutrinos and their\ninteractions. The role of the ββ decay in the whole enterprise descibed in\nvarious chapters of this book will be substantially strengthened once these\nambitious projects are underway.\n\n\fDouble beta decay\n\n21\n\nAcknowledgment\nThis work was supported by the US Department of Energy under Grant\nNo. DE-FG03-88ER-40397.\n\nReferences\n1. H. Primakoff and S. P. Rosen, Rep. Prog. Phys. 22, 121(1959).\n2. W. C. Haxton and G. J. Stephenson Jr., Prog. in Part. Nucl. Phys. 12, 409\n(1984).\n3. M. Doi, T. Kotani, and E. Takasugi , Prog. Theor. Phys. Suppl 831 (1985).\n4. M. Moe and P. Vogel, Ann. Rev. Nucl. Part. Sci. 44, 247 (1994).\n5. V. I. Tretyak and Yu. Zdesenko, At. Data Nucl. Data Tables 61, 43 (1995).\n6. J. Suhonen and O. Civitarese, Phys. Rep. 300, 123 (1998).\n7. F. Šimkovic, G. Pantis, and A. Faessler, Phys. Atom. Nucl. 61, 218 (1998).\n8. A. Morales, Nucl. Phys. B, Proc. Suppl. 77, 335 (1999).\n9. H. V. Klapdor-Kleingrothaus, preprint hep-ex/9907040.\n10. J. D. Vergados, Beyond the Desert 99, Ringberg Castle, June 99; hepph/9907316.\n11. F. Boehm and P. Vogel, Physics of Massive Neutrinos Cambridge University\nPress, Cambridge, 1992 (Second Edition).\n12. C. Caso et al, Eur. Phys. J. 3, 1 (1998).\n13. J. Schechter and J. W. F. Valle, Phys. Rev. D 25, 2951 (1982).\n14. B. Kayser, Nucl. Phys. B, Proc. Suppl. 19, 177 (1991).\n15. Y. Chikashige, R. N. Mohapatra, and R. D. Peccei, Phys. Rev. Lett, 45, 1926\n(1980).\n16. G. Gelmini and M. Rondacelli, Phys. Lett. B99, 411 (1981).\n17. P. Fisher, B. Kayser, and K. D. McFarland, hep-ph/9906244.\n18. P. Langacker and J. Wang, Phys. Rev. D 58 093004.\n19. J. Beacom and P. Vogel, Phys. Rev. Lett. 83, 5222 (1999).\n20. T. Tomoda, Rep. Progr. Part. Phys. 54, 53 (1991).\n21. A. Balysh et al., Phys. Rev. Lett. 77, 5186 (1996).\n22. M. Günther et al., Phys. Rev. D 55, 54 (1997).\n23. R. Arnold et al., Nucl. Phys. A636, 209 (1998).\n24. A. Kawashima, K. Takahashi, and A. Masuda, Phys. Rev. C 47, 2452 (1993).\n25. A. De Silva et al., Phys. Rev. C 56, 2451 (1997).\n26. R. Arnold et al, Z. Phys. C72, 239 (1996).\n27. T. Bernatowicz et al., Phys. Rev. Lett. 69, 2341 (1992).\n28. N. Takaoka, Y. Motomura, K. Nagao, Phys. Rev. C 53, 1557 (1996).\n29. A. L. Turkevich, T. E. Economou, and G. A. Cowan, Phys. Rev. Lett. 67, 3211\n(1991).\n30. A. S. Barabash et al. , Phys. Lett. B345, 408 (1995).\n31. L. De Braeckeleer et al, preprint, September 1999.\n32. A. Griffiths and P. Vogel, Phys. Rev. C46, 181 (1992).\n33. L. Baudis et al., Phys. Rev. Lett. 83, 41 (1999).\n34. K. E. You et al., Phys. Lett. B265 53 (1991).\n35. A. Staudt, K. Muto, and H. V. Klapdor-Kleingrothaus, Europ. Lett. 13, 31\n(1990).\n36. S. R. Elliott et al., Phys. Rev. C 46, 1535 (1992).\n\n\f22\n37.\n38.\n39.\n40.\n41.\n42.\n43.\n44.\n45.\n46.\n47.\n48.\n49.\n50.\n51.\n52.\n53.\n54.\n55.\n56.\n57.\n58.\n59.\n60.\n61.\n62.\n63.\n64.\n\nPetr Vogel\nH. Ejiri et al., Nucl. Phys. A611, 85 (1996).\nA. Sh. Georgadze et al., Phys. At. Nucl. 58, 1093 (1995).\nJ. Engel, P. Vogel, and M. R. Zirnbauer, Phys. Rev. C 37, 731 (1988).\nR. Luescher et al., Phys. Lett. B434, 407 (1998).\nA. S. Barabash , Phys. Lett. B216, 257 (1989).\nM. Beck et al., Phys. Rev. Lett. 70, 2853 (1993).\nF. A. Danevich et al., Nucl. Phys. A643, 317 (1998).\nB. Pontecorvo, Phys. Lett. B26, 630 (1968).\nP. Vogel, M. Ericson, and J. D. Vergados, Phys. Lett. B212, 259 (1988); K.\nMuto, Phys. Lett. B277, 13 (1992).\nM. Ericson, T. Ericson, and P. Vogel, Phys. Lett. B328, 259 (1994).\nK. Muto, E. Bender, and H. V. Klapdor, Z. Phys. A 334, 187 (1989).\nE. Caurier, A. Poves, and A. P. Zuker, Phys. Lett. B252, 13 (1990).\nE. Caurier, F. Nowacki, A. Poves, and J. Retamosa, Phys. Rev. Lett. 77, 1954\n(1996), and E. Caurier, private communication.\nJ. D. Vergados, Phys. Rev. C24, 640 (1981).\nR. N. Mohapatra, Phys. Rev. D34, 909 (1986).\nM. Hirsch, H. V. Klapdor-Kleingrothaus, and S. G. Kovalenko, Phys. Lett.\nB372, 181 (1996).\nE. G. Adelberger and W. C. Haxton, Ann. Rev. Nucl. Part. Sci. 35, 501 (1985).\nM. D. Shuster and M. Rho, Phys. Lett. B42, 54 (1972).\nC. E. Aalseth et al., Phys. Rev. C 59, 2108 (1999).\nX. Sarazin et al., Nucl. Phys. B70 (Proc. Suppl), 239 (1999).\nE. Fiorini, Phys. Rep. 307, 309 (1998).\nH. Ejiri et al., nucl-ex/9911008.\nM. Danilov et al., Phys. Lett., to be published; hep-ex/0002003\nD. O. Caldwell and R. N. Mohapatra, Phys. Rev. D48, 3259 (1993).\nH. Georgi and S. L. Glashow, hep-ph/9808293.\nJ. Ellis and S. Lola, Phys. Lett. B458, 310(1999).\nV. Barger and K. Whisnant, Phys. Lett. B456, 194 (1999).\nS. M. Bilenky et al., hep-ph/9907234.\n\n\f"}