{"id": "http://arxiv.org/abs/nucl-th/0305092v1", "guidislink": true, "updated": "2003-05-30T03:43:27Z", "updated_parsed": [2003, 5, 30, 3, 43, 27, 4, 150, 0], "published": "2003-05-30T03:43:27Z", "published_parsed": [2003, 5, 30, 3, 43, 27, 4, 150, 0], "title": "Fluctuation properties of strength functions associated with giant\n  resonances", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=nucl-th%2F0506012%2Cnucl-th%2F0506002%2Cnucl-th%2F0506015%2Cnucl-th%2F0506014%2Cnucl-th%2F0506032%2Cnucl-th%2F0506066%2Cnucl-th%2F0506078%2Cnucl-th%2F0506037%2Cnucl-th%2F0506074%2Cnucl-th%2F0506056%2Cnucl-th%2F0506064%2Cnucl-th%2F0506028%2Cnucl-th%2F0506069%2Cnucl-th%2F0506041%2Cnucl-th%2F0506087%2Cnucl-th%2F0506070%2Cnucl-th%2F0506043%2Cnucl-th%2F0506048%2Cnucl-th%2F0506010%2Cnucl-th%2F0506065%2Cnucl-th%2F0506081%2Cnucl-th%2F0506025%2Cnucl-th%2F0506020%2Cnucl-th%2F0506039%2Cnucl-th%2F0305075%2Cnucl-th%2F0305028%2Cnucl-th%2F0305031%2Cnucl-th%2F0305045%2Cnucl-th%2F0305023%2Cnucl-th%2F0305083%2Cnucl-th%2F0305081%2Cnucl-th%2F0305071%2Cnucl-th%2F0305090%2Cnucl-th%2F0305001%2Cnucl-th%2F0305079%2Cnucl-th%2F0305002%2Cnucl-th%2F0305053%2Cnucl-th%2F0305059%2Cnucl-th%2F0305048%2Cnucl-th%2F0305082%2Cnucl-th%2F0305016%2Cnucl-th%2F0305051%2Cnucl-th%2F0305066%2Cnucl-th%2F0305078%2Cnucl-th%2F0305056%2Cnucl-th%2F0305029%2Cnucl-th%2F0305009%2Cnucl-th%2F0305006%2Cnucl-th%2F0305026%2Cnucl-th%2F0305010%2Cnucl-th%2F0305055%2Cnucl-th%2F0305077%2Cnucl-th%2F0305036%2Cnucl-th%2F0305044%2Cnucl-th%2F0305019%2Cnucl-th%2F0305088%2Cnucl-th%2F0305099%2Cnucl-th%2F0305065%2Cnucl-th%2F0305038%2Cnucl-th%2F0305025%2Cnucl-th%2F0305098%2Cnucl-th%2F0305069%2Cnucl-th%2F0305011%2Cnucl-th%2F0305005%2Cnucl-th%2F0305018%2Cnucl-th%2F0305047%2Cnucl-th%2F0305086%2Cnucl-th%2F0305089%2Cnucl-th%2F0305080%2Cnucl-th%2F0305084%2Cnucl-th%2F0305032%2Cnucl-th%2F0305096%2Cnucl-th%2F0305014%2Cnucl-th%2F0305093%2Cnucl-th%2F0305027%2Cnucl-th%2F0305097%2Cnucl-th%2F0305061%2Cnucl-th%2F0305037%2Cnucl-th%2F0305092%2Cnucl-th%2F0305008%2Cnucl-th%2F0305021%2Cnucl-th%2F0305062%2Cnucl-th%2F0305068%2Cnucl-th%2F0305022%2Cnucl-th%2F0305050%2Cnucl-th%2F0305039%2Cnucl-th%2F0305034%2Cnucl-th%2F0305052%2Cnucl-th%2F0305060%2Cnucl-th%2F0305067%2Cnucl-th%2F0305043%2Cnucl-th%2F0305058%2Cnucl-th%2F0305101%2Cnucl-th%2F0305041%2Cnucl-th%2F0305074%2Cnucl-th%2F0305085%2Cnucl-th%2F0305015%2Cnucl-th%2F0305087%2Cnucl-th%2F0305003%2Cnucl-th%2F0305054%2Cnucl-th%2F0305024&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Fluctuation properties of strength functions associated with giant\n  resonances"}, "summary": "We performed fluctuation analysis by means of the local scaling dimension for\nthe strength function of the isoscalar (IS) and the isovector (IV) giant\nquadrupole resonances (GQR) in $^{40}$Ca, where the strength functions are\nobtained by the shell model calculation within up to the 2p2h configurations.\nIt is found that at small energy scale, fluctuation of the strength function\nalmost obeys the Gaussian orthogonal ensemble (GOE) random matrix theory limit.\nOn the other hand, we found a deviation from the GOE limit at the intermediate\nenergy scale about 1.7MeV for the IS and at 0.9MeV for the IV. The results\nimply that different types of fluctuations coexist at different energy scales.\nDetailed analysis strongly suggests that GOE fluctuation at small energy scale\nis due to the complicated nature of 2p2h states and that fluctuation at the\nintermediate energy scale is associated with the spreading width of the\nTamm-Dancoff 1p1h states.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=nucl-th%2F0506012%2Cnucl-th%2F0506002%2Cnucl-th%2F0506015%2Cnucl-th%2F0506014%2Cnucl-th%2F0506032%2Cnucl-th%2F0506066%2Cnucl-th%2F0506078%2Cnucl-th%2F0506037%2Cnucl-th%2F0506074%2Cnucl-th%2F0506056%2Cnucl-th%2F0506064%2Cnucl-th%2F0506028%2Cnucl-th%2F0506069%2Cnucl-th%2F0506041%2Cnucl-th%2F0506087%2Cnucl-th%2F0506070%2Cnucl-th%2F0506043%2Cnucl-th%2F0506048%2Cnucl-th%2F0506010%2Cnucl-th%2F0506065%2Cnucl-th%2F0506081%2Cnucl-th%2F0506025%2Cnucl-th%2F0506020%2Cnucl-th%2F0506039%2Cnucl-th%2F0305075%2Cnucl-th%2F0305028%2Cnucl-th%2F0305031%2Cnucl-th%2F0305045%2Cnucl-th%2F0305023%2Cnucl-th%2F0305083%2Cnucl-th%2F0305081%2Cnucl-th%2F0305071%2Cnucl-th%2F0305090%2Cnucl-th%2F0305001%2Cnucl-th%2F0305079%2Cnucl-th%2F0305002%2Cnucl-th%2F0305053%2Cnucl-th%2F0305059%2Cnucl-th%2F0305048%2Cnucl-th%2F0305082%2Cnucl-th%2F0305016%2Cnucl-th%2F0305051%2Cnucl-th%2F0305066%2Cnucl-th%2F0305078%2Cnucl-th%2F0305056%2Cnucl-th%2F0305029%2Cnucl-th%2F0305009%2Cnucl-th%2F0305006%2Cnucl-th%2F0305026%2Cnucl-th%2F0305010%2Cnucl-th%2F0305055%2Cnucl-th%2F0305077%2Cnucl-th%2F0305036%2Cnucl-th%2F0305044%2Cnucl-th%2F0305019%2Cnucl-th%2F0305088%2Cnucl-th%2F0305099%2Cnucl-th%2F0305065%2Cnucl-th%2F0305038%2Cnucl-th%2F0305025%2Cnucl-th%2F0305098%2Cnucl-th%2F0305069%2Cnucl-th%2F0305011%2Cnucl-th%2F0305005%2Cnucl-th%2F0305018%2Cnucl-th%2F0305047%2Cnucl-th%2F0305086%2Cnucl-th%2F0305089%2Cnucl-th%2F0305080%2Cnucl-th%2F0305084%2Cnucl-th%2F0305032%2Cnucl-th%2F0305096%2Cnucl-th%2F0305014%2Cnucl-th%2F0305093%2Cnucl-th%2F0305027%2Cnucl-th%2F0305097%2Cnucl-th%2F0305061%2Cnucl-th%2F0305037%2Cnucl-th%2F0305092%2Cnucl-th%2F0305008%2Cnucl-th%2F0305021%2Cnucl-th%2F0305062%2Cnucl-th%2F0305068%2Cnucl-th%2F0305022%2Cnucl-th%2F0305050%2Cnucl-th%2F0305039%2Cnucl-th%2F0305034%2Cnucl-th%2F0305052%2Cnucl-th%2F0305060%2Cnucl-th%2F0305067%2Cnucl-th%2F0305043%2Cnucl-th%2F0305058%2Cnucl-th%2F0305101%2Cnucl-th%2F0305041%2Cnucl-th%2F0305074%2Cnucl-th%2F0305085%2Cnucl-th%2F0305015%2Cnucl-th%2F0305087%2Cnucl-th%2F0305003%2Cnucl-th%2F0305054%2Cnucl-th%2F0305024&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We performed fluctuation analysis by means of the local scaling dimension for\nthe strength function of the isoscalar (IS) and the isovector (IV) giant\nquadrupole resonances (GQR) in $^{40}$Ca, where the strength functions are\nobtained by the shell model calculation within up to the 2p2h configurations.\nIt is found that at small energy scale, fluctuation of the strength function\nalmost obeys the Gaussian orthogonal ensemble (GOE) random matrix theory limit.\nOn the other hand, we found a deviation from the GOE limit at the intermediate\nenergy scale about 1.7MeV for the IS and at 0.9MeV for the IV. The results\nimply that different types of fluctuations coexist at different energy scales.\nDetailed analysis strongly suggests that GOE fluctuation at small energy scale\nis due to the complicated nature of 2p2h states and that fluctuation at the\nintermediate energy scale is associated with the spreading width of the\nTamm-Dancoff 1p1h states."}, "authors": ["Hirokazu Aiba", "Masayuki Matsuo", "Shigeru Nishizaki", "Toru Suzuki"], "author_detail": {"name": "Toru Suzuki"}, "author": "Toru Suzuki", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevC.68.054316", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/nucl-th/0305092v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/nucl-th/0305092v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "14 pages including 13figures", "arxiv_primary_category": {"term": "nucl-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "nucl-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/nucl-th/0305092v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/nucl-th/0305092v1", "journal_reference": "Phys.Rev. C68 (2003) 054316", "doi": "10.1103/PhysRevC.68.054316", "fulltext": "Fluctuation properties of strength functions associated with giant resonances\nHirokazu Aiba1 , Masayuki Matsuo2 , Shigeru Nishizaki3 , and Toru Suzuki4\n1\n\narXiv:nucl-th/0305092v1 30 May 2003\n\nKyoto Koka Women's College, 38 Kadono-cho Nishikyogoku, Ukyo-ku, 615-0882 Kyoto, Japan\n2\nGraduate School of Science and Technology, Niigata University, 950-2181 Niigata, Japan\n3\nFaculty of Humanities and Social Sciences, Iwate University, 3-18-34 Ueda, 020-8550 Morioka, Japan\n4\nDepartment of Physics, Tokyo Metropolitan University, 192-0397 Hachioji, Japan\n(November 23, 2018)\nWe performed fluctuation analysis by means of the local scaling dimension for the strength\nfunction of the isoscalar (IS) and the isovector (IV) giant quadrupole resonances (GQR) in 40 Ca,\nwhere the strength functions are obtained by the shell model calculation within up to the 2p2h\nconfigurations. It is found that at small energy scale, fluctuation of the strength function almost\nobeys the Gaussian orthogonal ensemble (GOE) random matrix theory limit. On the other hand,\nwe found a deviation from the GOE limit at the intermediate energy scale about 1.7MeV for the IS\nand at 0.9MeV for the IV. The results imply that different types of fluctuations coexist at different\nenergy scales. Detailed analysis strongly suggests that GOE fluctuation at small energy scale is due\nto the complicated nature of 2p2h states and that fluctuation at the intermediate energy scale is\nassociated with the spreading width of the Tamm-Dancoff 1p1h states.\nPACS number: 24.60.Ky, 21.10.-k, 24.30.Cz\n\nI. INTRODUCTION\n\nStrengths of exciting high lying states in nuclei, for instance, a giant resonance, are spread over a certain energy\ninterval due to the coupling to a background which is complicated and has huge degrees of freedom. As a result, the\nstrength function, at a large energy scale, exhibits a global shape profile like a Lorentzian. The values of the center\nof energy or the total width depend on the properties of a probe such as multiporality, isospin, and so on, and change\nsmoothly as the mass number of a nucleus. Most of these values are well understood up to now [1–3]. On the other\nhand, at small energy scale limit comparable to the level spacing of the background states, the strength function may\nrapidly fluctuate from state to state on top of the global profile, if we neglect the escaping width due to the coupling to\nthe continuum. It is believed that the fluctuation properties at this energy scale can be well simulated by the random\nmatrix theory of the Gaussian orthogonal ensemble (GOE) [4–7], which has been verified by several experimental\ndata: The nearest-neighbor level spacing distribution (NND) of neutron resonances near the threshold approximately\nfollows the Wigner distribution [7,8]. The distribution of the reduced width (proportional to an absolute square of a\ncomponent of the wave function) of these resonance also shows the Porter-Thomas distribution [7,8]. Furthermore, the\nNND of the Nuclear Data Ensemble shows the Wigner distribution and the ∆3 statistics of them shows ∆3 (L) ∝ ln L\n[9]. All of these are typical signatures of the GOE.\nThus, we know well the behavior of the strength function at both extreme small and large energy scales. From this\nknowledge, one may construct the following model to describe the strength function of highly excited states in nuclei:\nA collective state couples democratically to each of unperturbed background states, and the background Hamiltonian\nitself is the GOE random matrix. This GOE background model is closely connected with the pandemonium picture\n[10,11]. If we adjust the energy of the collective state and the coupling strength between the collective state and\nbackground states, the resultant strength function should be consistent with the giant resonance strength function\nat least at both extreme energy scale limits. Therefore, in order to find the difference between a realistic strength\nfunction and that from this model, we must investigate fluctuation properties of the strength function at intermediate\nenergy scale [12,13].\nRecently, we proposed a new method to perform fluctuation analysis of the strength function [14]. This method is\ndevised to quantitatively characterize a fluctuation property as a function of energy scale by a new measure called\nthe local scaling dimension (LSD), and is suitable to investigate fluctuation at intermediate energy scales. We applied\nthis method to a simple doorway damping model. The doorway damping model is different from the above GOE\nbackground model with respect to two points: First, unperturbed background states are divided into two different\nclasses so that unperturbed states in one class, which are called the doorway states, couple directly to a collective state,\nwhile states in another class do not. The second point is that doorway states and other unperturbed background states\nhave a finite spreading width due to the mixing among them. (Note that the GOE background model corresponds to\nthe large spreading width limit.) Fluctuation properties of the strength functions of both models are same at small\nenergy scale limit. The result of the analysis clearly showed that fluctuation properties of both strength functions\n1\n\n\fdeviate from each other at a certain intermediate energy scale, and this energy scale is closely related to the spreading\nwidth of the doorway states in the doorway damping model.\nIn this paper, we apply the same method to a more realistic strength function of the giant resonances in a nucleus.\nStrength functions of the isoscalar (IS) and the isovector (IV) giant quadrupole resonance (GQR) in 40 Ca are obtained\nby the shell model calculation within up to the 2p2h configurations. The strength functions reproduce the experimental\ncenter of energy and the total width, and also show the GOE fluctuation at the small energy scale limit, as will be\nshown later. Furthermore, in this model, the doorway structure and the deviation from GOE in the background\nmay be introduced in a natural way, while they are input by hand in the doorway damping model. Therefore these\nstrength functions may provide the better test for the analysis.\nNote that a similar method of analysis was proposed and applied to the (e, e′ ) or (p, p′ ) experimental data on 208 Pb\n[15,16].\nThe paper is organized as follows: In Sec. II, we briefly explain the LSD. In Sec. III, we apply the method to\nthe strength functions of the isoscalar (IS) and the isovector (IV) GQR. We also discuss the physical origin of the\ndeviation from the GOE background model in detail. Finally, Sec. IV is devoted to conclusions.\nII. LOCAL SCALING DIMENSION\n\nWe briefly explain the local scaling dimension in this section. See Ref. [14] for detail.\nThe strength function is expressed as [17]\nX\nSi δ(E − Ei + E0 ),\nS(E) =\n\n(1)\n\ni\n\nfor exciting the nucleus with excitation energy E. Here Ei and E0 are the energy of discrete levels and the ground\nstate energy, respectively,\nand Si denotes the strength of exciting the ith energy level. Let us assume strengths are\nP\nnormalized as i Si = 1.\nIn order to quantitatively characterize how the strength function fluctuate at various energy scale, we consider\nbinned distribution of the strength function S(E) by dividing whole energy interval under consideration into L bins\nwith length ǫ. Strength contained in nth bin is denoted by pn ,\nX\npn ≡\nSi .\n(2)\ni∈nth bin\n\nTo characterize the distribution of the binned strengths, we introduce the moments of it, which are called in literature\nthe partition function χm (ǫ) defined by\nχm (ǫ) ≡\n\nL\nX\nn=1\n\nm\npm\nn = Lhpn i.\n\n(3)\n\nClearly, the partition functions contains, at small ǫ limit, the information of the strength distribution , as well as the\nenergy-strength correlation as a function of a bin width or an energy scale ǫ.\nIt is then helpful to employ the idea of the generalized fractal dimension [18,19], which is derived from the partition\nfunction and has a definite physical meaning. The concept of the generalized fractal dimension is useful only when\na system has a multifractal nature, namely, has a self-similar structure against the change of the scale. Strength\nfunctions at a nucleus generally do not have such a property. Thus, we have to extend the concept of the generalized\nfractal dimension and finally reach the local scaling dimension (LSD) defined by\nDm (ǫ) ≡\n\n1 ∂ log χm (ǫ)\n.\nm − 1 ∂ log ǫ\n\n(4)\n\nDifferent from the generalized fractal dimension, the local scaling dimension characterizes \"how the partition function\nscales for different energy scales\" and accordingly is a function of a bin width or an energy scale ǫ. The local\nscaling dimension, however, has an easily understandable physical meaning similar to those of the generalized fractal\ndimension: For instance, the value of Dm (ǫ) close to unity means that the strength function looks like a one dimensional\nobject distributed smoothly over an energy interval when we look at the strength function at an energy scale ǫ. On\nthe other hand, it looks like a zero dimensional object, namely a dot if the value of Dm (ǫ) is close to zero. Note that\nthe local scaling dimension reduces to the generalized fractal dimension when the value of Dm (ǫ) is constant over a\nwhole interval of ǫ.\n2\n\n\f(a) N=2048\n\n(b) Local Scaling Dimension\n\n0.007\n\n1\n\n0.006\n0.8\n0.6\n\n0.004\n\nDm(ε)\n\nS(E)\n\n0.005\n\n0.003\n\n0.4\n\n0.002\n0.2\n0.001\n0\n\n0\n0\n\n500\n\n1000\n\n1500\n\n2000\n\n1\n\n10\n\n100\n\n1000\n\nε/d\n\nE\n\nFIG. 1. (a)An example of the GOE strength function with matrix dimension of 2048. (b)The local scaling dimension Dm (ǫ)\nfor the GOE strength function obtained after the ensemble average. The curves correspond to Dm (ǫ) for m = 2 to 5 from\nupper to lower.\n\nIn actual calculation of the local scaling dimension, we define it by means of the finite difference under the change\nof a factor 2,\n√\nDm ( 2ǫ) =\n\n1 log χm (2ǫ) − log χm (ǫ)\n,\nm−1\nlog 2\n\n(5)\n\nrather than the derivative in Eq. (4). Using the finite difference, the calculation is very simple for all the moments.\nOne of the important strength functions may be the one obtained from the GOE random matrix. The local scaling\ndimension of this GOE strength function can be used as a reference to study other strength functions which are\nsupposed to have a similar fluctuation properties to the GOE, as in the case of nuclear strength functions in the\nhighly excited region. We show in Fig. 1 an example of the GOE strength function and the local scaling dimension\nDm (l), where l ≡ ǫ/d (the bin width measured in the unit of the level spacing d) is used as the scaling parameter.\nIII. ANALYSIS OF THE GIANT QUADRUPOLE RESONANCES IN\n\n40\n\nCa\n\nWe apply the local scaling dimension to the strength functions of the giant quadrupole resonances in\n\n40\n\nCa.\n\nA. Numerical Calculation of Strength Functions\n\nWe calculated the strength functions of the isoscalar and the isovector giant quadrupole resonances in 40 Ca within\nthe second Tamm-Dancoff approximation including the 1p1h and 2p2h excitations. Single-particle wave-functions\nand energies were obtained in terms of a Woods-Saxon potential including the Coulomb interaction. To simulate the\nbare (Hartree-Fock) single-particle energies εHF , the above single-particle energies εW S were scaled by the effective\nmass m∗ /m as εHF = εW S /(m∗ /m). As the residual interaction, the Landau-Migdal-type interaction [20] including\nthe density-dependence was adopted. The model space was constructed in terms of single-particle states within the\nfour major shells, two below and two above the Fermi surface, and included all 1p1h states and 2p2h states whose\nunperturbed energies were less than 50MeV. Resultant number of 1p1h states and 2p2h states are 34 and 4144,\nrespectively. We diagonalized the Hamiltonian within this model space and obtained the strength functions for the\nisoscalar and the isovector quadrupole operators.\nFigure 2 (a) and (b) show the strength functions for ISGQR and IVGQR, respectively. The mean energy and\nthe total width (the standard deviation) are 23MeV(31MeV) and 4.0MeV(7.0MeV) for the ISGQR(IVGQR). The\neffective mass m∗ /m = 0.9 was used to reproduce the empirical mean energy for IVGQR in 40 Ca [3]. These strength\nfunctions were already used in Refs. [21] and [22] to study the generic properties of nuclear giant-resonance decay.\n\n3\n\n\f(a) ISGQR\n\n(b) IVGQR\n0.008\n\n0.02\n\n0.007\n0.006\n\n0.015\n\nS(E)\n\nS(E)\n\n0.005\n0.01\n\n0.004\n0.003\n0.002\n\n0.005\n\n0.001\n0\n\n0\n0\n\n10\n\n20\n\n30\n\n40\n\n50\n\n0\n\n10\n\n20\n\nE\n\n30\n\n40\n\n50\n\nE\n\nFIG. 2. Strength functions for ISGQR (a) and IVGQR (b).\n\nB. Several Measures\n\nBefore going to the detailed discussion for the local scaling dimension, we briefly show other fluctuation measures.\n\n0.06\n0.05\n\nP(s)\n\n0.04\n0.03\n0.02\n0.01\n0\n0\n\n0.5\n\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\ns\n\nFIG. 3. The nearest neighbor level spacing distribution for levels between 20MeV and 30MeV. Level spacings were unfolded\nby the Strutinsky method with a smoothing width 5MeV. The dashed curve represents the Wigner distribution.\n\nFigure 3 shows the nearest-neighbor level spacing distribution (NND), where levels between 20MeV and 30MeV are\nconsidered (the number of levels is 804), and are unfolded by means of the Strutinsky method with a smoothing width\n5MeV [23]. The NND follows rather well the Wigner distribution, which indicates at the very small energy scale the\nlevel fluctuation almost obeys the GOE. We also plot in Fig. 4 the ∆3 statistics. We again find that at small energy\nrange the ∆3 follows the GOE line. At Lmax ≃ 15, however, ∆3 starts to deviate from the GOE line to upward. This\nvalue of Lmax roughly corresponds to the energy scale E ≃ 0.18MeV.\nFigure 5 shows the strength distribution where the distribution of the square-root of normalized strengths S̄i is\nplotted as a histogram; strengths are normalized also by Strutinsky method, detailed procedure of which will be\nexplained in the next subsection. We can see that the strength distribution follows considerably well the PorterThomas distribution.\n\n4\n\n\f0.8\n0.7\n0.6\n\n∆3(L)\n\n0.5\n0.4\n0.3\n0.2\n0.1\n0\n0\n\n10 20 30 40 50 60 70 80\nL\n\nFIG. 4. The ∆3 statistics. The dashed curve represents the ∆3 for the GOE level fluctuation. Same as Fig. 3 for others.\n\n(a) ISGQR\n\n(b) IVGQR\n\n45\n\n55\n\n40\n\n50\n45\n\n35\n\n40\n35\n\n25\n\nP(S1/2)\n\n1/2\n\nP(S )\n\n30\n\n20\n\n30\n25\n20\n\n15\n\n15\n\n10\n\n10\n\n5\n\n5\n\n0\n\n0\n0\n\n0.02\n\n0.04\n\n0.06\n\n0.08\n\n0\n\n0.02\n\n1/2\n\n0.04\n\n0.06\n\n0.08\n\n1/2\n\nS\n\nS\n1/2\n\nFIG. 5. The statistical distribution of square root of unfolded strengths, S̄i , associated with the individual levels between\n20MeV and 30MeV for (a)ISGQR and (b)IVGQR. The dashed curve represents the Porter-Thomas distribution which becomes\n1/2\na Gaussian when plotted as a function of S̄i .\n\nC. Results of the Local Scaling Dimension\n\nSince we are not interested in the global shape of the strength function, it is convenient to introduce the normalized\nstrength function where the global smooth energy dependence is removed from the original strength function as\nfollows:\nS̄i = N\n\nSi ρ̃(Ei )\n.\nS̃(Ei )\n\n(6)\n\nHere, S̃(E)\nP and ρ̃(E) are obtained by averaging the calculated strength function, Eq.(1), and the level density\nρ(E) = i δ(E − Ei + E0 ), respectively, by the\nPStrutinsky method. We adopted 5MeV as a smoothing width. N\nis an overall normalization factor to guarantee i S̄i = 1 for the considered energy interval. Moreover, we adopt as\nenergy levels the equidistant ones [14], namely, Ei = id, where d denotes average level spacing. By adopting these\nlevels, we can neglect global energy dependence of the level density and the local level fluctuation. (We verified that\n\n5\n\n\fthe inclusion of the local level fluctuation affects only the behavior of the LSD at small energy scales, and this effect\ncan be described by the GOE.) Thus, we obtain the normalized strength function S̄(E);\nS̄(E) = Σi S̄i δ(E − Ei + E0 ).\n\n(7)\n\nThe local scaling dimension is derived from this normalized strength function. Finally, since the visible strengths of\nISGQR are almost concentrated in the energy range between 20MeV and 30MeV, we adopt this energy interval for\nanalysis.\n(a) ISGQR\n\n(b) IVGQR\n\n0.012\n\n0.018\n0.016\n\n0.01\n0.014\n0.012\n\nS(E)\n\nS(E)\n\n0.008\n0.006\n0.004\n\n0.01\n0.008\n0.006\n0.004\n\n0.002\n0.002\n0\n\n0\n20\n\n22\n\n24\n\n26\n\n28\n\n30\n\n20\n\nE\n\n22\n\n24\n\n26\n\n28\n\n30\n\nE\n\nFIG. 6. The normalized strength functions S̄(E) corresponding to the original ones for the ISGQR (a) and for the IVGQR\n(b) plotted in Fig. 2. A summation of strengths within an energy interval 20MeV-30MeV is normalized to unity.\n\nThe normalized strength functions for ISGQR and IVGQR are plotted in Figs. 6 (a) and (b), respectively.\nFirst, let us discuss the ISGQR case in detail. The case of the IVGQR will be discussed in Sec. III D 4. Figures\n7(a) and (b) show the partition functions χm (ǫ) defined by Eq. (3) and the local scaling dimensions Dm (ǫ) defined by\nEq. (5), respectively. The horizontal axes in both figures represent the bin width of energy axis in unit of d, where\nd represents the average level spacing over the energy range 20MeV and 30MeV (d ≃ 12keV). From the partition\nfunction χm (ǫ), one sees that the fluctuation does not follow the power scaling law (or linear relation in the log-log\nplot). Correspondingly, the local scaling dimension Dm (ǫ) varies as a function of ǫ. At small energy scale, the values\nof Dm (ǫ) gradually increase as the energy scale ǫ increases, and almost follow the GOE line. As the energy scale\nǫ increases further, the values of Dm (ǫ) bend downwards and then again turn to increase. The behavior of Dm (ǫ)\naround this energy scale clearly deviates from the GOE limit. The value of the energy scale where the deviation\nis maximum is roughly ǫf ≃ 140d ≃ 1.7MeV. From these observations, we again find that at small energy scale,\nfluctuation of the strength function is essentially governed by the GOE, as one knows from other measures such as\nthe NND or the strength distribution. The scaling analysis by means of the local scaling dimension, however, can\nreveal the new feature which may not be realized by other measures. Namely, the GOE fluctuation is limited to the\nsmall energy scale, while, at intermediate energy scales, a different fluctuation from the GOE arises.\nOne may wonder that the statistical error could produce a fictitious dip, since the number of levels considered\n804 is not so large. Of course, there may be a statistical error. Accordingly, we should take the energy scale\nǫf ≃ 140d ≃ 1.7MeV mentioned above as a rough estimate. The existence of the dip itself, however, is not due to\na statistical error. This would be verified from a systematic analysis in the next subsection.\n√\n√ Note that the simple\nestimate of the standard deviation, of the mth local scaling dimension is σ(Dm ) ≃ 3m/ Ntot [14], and in the\npresent case for the second local scaling dimension, σ(D2 ) ≃ 0.12.\nA type of the smoothing procedure to obtain the normalized strength function does not much affect the results.\nIndeed, we verified that the Gaussian smoothing instead of the Strutinsky smoothing leads to the essentially same\nresults.\n\n6\n\n\f(a)\n\n(b)\n\n1\n\n1\n0.8\n\nχm(ε)\n\nDm(ε)\n\n0.6\n0.4\n0.2\n10-10\n\n0\n1\n\n10\n\n100\n\n1\n\nε/d\n\n10\n\n100\nε/d\n\nFIG. 7. (a)The partition function χm (ǫ) for m = 2 to 5 for the ISGQR corresponding to the normalized strength funciton\nplotted in Fig. 6 (a). (b) Its local scaling dimension Dm (ǫ)for m = 2 to 5. The dashed curve represents D2 (ǫ) for the GOE.\n\nD. Origin of the Deviation from the GOE\n\nWe shall investigate the origin of the observed energy scale ǫf = 1.7MeV characteristic to the fine structures in the\nisoscalar quadrupole strength function.\n\n1. Doorway damping mechanism\n\nFor this purpose we consider a damping mechanism by separating the shell model space to 1p1h and 2p2h subspaces,\nand we focus on the residual interactions within and between the subspaces. The giant resonance is a collective\nvibrational state whose dominant component is a coherent superposition of 1p1h configurations. The collective state\ncan be described by the Tamm-Dancoff (TD) approximation, which corresponds to a truncated shell model where\nonly 1p1h configurations are taken into account. The result of the TD approximation (TDA) is shown in Fig. 8(a),\nand is compared with the full shell model calculation including up to 2p2h's (Fig. 2(a)). It is seen that the peak\nposition is well reproduced by the TDA. Note also that the isoscalar quadrupole strength in the TDA is spread over\nmany eigenstates, which are correlated 1p1h states. This spreading of the quadrupole strength among 1p1h states is\noften called the Landau damping. Comparing Figs. 8(a) and 2(a), the Landau damping is found to give dominant\ncontribution to the total FWHM of the strength function.\nIf we take into account the 2p2h configurations, the interaction acting between 1p1h and 2p2h states (abbreviated\nas V12 ) takes part in. Since the 2p2h states have much more degrees of freedom, V12 causes spreading of the TD\n1p1h states. Because of this spreading of 1p1h states, the quadrupole strength is also fragmented by V12 on top of\nthe Landau damping at the TDA level. To see the effect of V12 , we performed a calculation where unperturbed 2p2h\nstates and the interaction V12 is introduced. The resultant strength distribution, shown in Fig. 8(b), appears similar\nto the final result (Fig. 2(a)) as far as the gross profile of the strength distribution is concerned.\nNote also that there exists the residual interaction acting among 2p2h states, which we call V22 in the following.\nV22 causes configuration mixing among the 2p2h states. Comparison between Figs. 8(b) and 2(a) indicates effects of\nV22 on fine details of strength distribution, although the gross profile of strength distribution is not influenced very\nmuch.\nThe above observations lead us to the following doorway damping picture. The quadrupole strength distribution is\nfragmented first in the 1p1h subspace. The 1p1h TD states then spread further over 2p2h states through V12 . Here\nthe 1p1h TD states may be considered as doorway states in the whole damping processes. The 2p2h states on the\nother hand may be regarded as states that play roles of background in the main damping processes since they do not\ndominate the total damping width, but they influence the fine structures through the coupling to the doorway states.\n\n7\n\n\f(a)\n\n(b)\n\n0.4\n\n0.2\n\n0.35\n\n0.18\n0.16\n\n0.3\n\n0.14\n0.12\n\nS(E)\n\nS(E)\n\n0.25\n0.2\n0.15\n\n0.1\n0.08\n0.06\n\n0.1\n\n0.04\n\n0.05\n\n0.02\n\n0\n\n0\n0\n\n10\n\n20\n\n30\n\n40\n\n50\n\n0\n\nE\n\n10\n\n20\n\n30\n\n40\n\n50\n\nE\n\nFIG. 8. (a) The strength function for the ISGQR obtained within the Tamm-Dancoff approximation and (b) the strength\nfunction for the ISGQR by omitting the coupling among the unperturbed 2p2h states.\n\nAssuming the above picture, we can consider energy scales that may be relevant to the fine structures of the\nquadrupole strength distribution. Concerning the 1p1h TD states which are considered as the doorway states, we\nhave as energy scales 1) the spreading width (which we denote γ12 ) of the TD 1p1h states caused by the interaction\nV12 , in addition to 2) the average level spacing d1p1h between the 1p1h states. Concerning the 2p2h states, 3) the\nlevel spacing d2p2h between 2p2h states is to be noted. (d2p2h is almost identical to the level spacing d for the whole\nset of energy spectra since the number of 2p2h states is much larger than that of 1p1h states. ) Note also that\nmixing among 2p2h states caused by the interaction V22 is characterized by 3) the spreading width (γ22 named in\nthe following) of 2p2h states. We have found previously that, in the case of a schematic model which incorporate\ndoorway states coupled to background states, the spreading width of doorway states (corresponding to γ12 in the\npresent context) determines the energy scale where the local scaling dimension deviates from the generic GOE limit\n[14]. Note also that the deviation from the GOE is seen in the energy level fluctuation by the analysis of the ∆3\nstatistics. The energy level fluctuation is sensitive to the residual interaction that causes mixing among unperturbed\nconfigurations. We found that the energy level fluctuation is governed by V22 , but not by V12 , as shown in Fig. 9.\nThus we can consider another possibility that the energy scale of the deviation from the GOE limit may be related\nto the spreading width γ22 of the 2p2h states. In the following, we shall focus on the effects of V12 and V22 which are\nconnected to the two spreading widths γ12 and γ22 .\n(a) λ22=0.1\n\n(b) λ22=2.0\n\n0.8\n\n0.7\n\n0.7\n\n0.6\n\n0.6\n\n0.5\n\n0.5\n\n∆3(L)\n\n∆3(L)\n\n0.8\n\n0.4\n\n0.4\n\n0.3\n\n0.3\n\n0.2\n\n0.2\n\n0.1\n\n0.1\n\n0\n\n0\n0\n\n10 20 30 40 50 60 70 80\n\n0\n\nL\n\n10 20 30 40 50 60 70 80\nL\n\nFIG. 9. The ∆3 statistics with rescaling the interaction strength V22 by a factor λ22 , for (a)λ22 = 0.1 and (b)λ22 = 2.0. The\ndashed curve represents the ∆3 for the GOE level fluctuation. We can find the large dependence of the ∆3 on the value of\nV22 . We also verified that the ∆3 is insensitive to the change of the value of V12 , namely the behavior of ∆3 at λ12 = 0.1 or\nλ12 = 2.0 is almost same as that at λ12 = 1.0, where λ12 represents the rescaling factor of the interaction strength V12 .\n\n8\n\n\f2. Spreading widths of 1p1h and 2p2h states\nFG\nLet us quantify γ12 and γ22 . If we assume the Fermi golden rule, we obtain a simple estimate of γ12 by γ12\n=\n2\n2πh1p1h|V12 |2p2hi /d2p2h where h1p1h|V12 |2p2hi is a root mean square value of the matrix elements between 1p1h and\n2\n\nFG\n2p2h states. Similarly, we can make an estimation of the spreading width γ22 as γ22\n= 2πh2p2h|V22 |2p2hi /d2p2h .\nFG\nFG\nThe above estimate gives γ12 ≃ 5.3MeV, and γ22 ≃ 6.0MeV. Here we have inserted h1p1h|V12 |2p2hi = 98 keV,\nh2p2h|V22 |2p2hi = 104 keV, d2p2h = 11.3keV, which are evaluated for all the unperturbed 1p1h and 2p2h states in the\nenergy interval of E = 20 − 30MeV. Note also d1p1h ≈ 0.5MeV for the 1p1h states in the same interval. Very similar\nvalues are obtained for h1p1h|V12 |2p2hi when we use the correlated 1p1h states (TD states) instead of unperturbed\n1p1h's.\nIt is also possible to evaluate γ12 and γ22 in a more direct way by using the strength functions of 1p1h and 2p2h\nstates. Strength function of a 1p1h state |i, 1p1hi is given by\nX\n2\nSi,1p1h (e) =\nhi, 1p1h|ai δ(e − (Ea − Ei,1p1h )),\n(8)\na\n\nwhere |ai and Ea are the eigenstates of the full calculation and their energies, respectively. e denotes the relative\nenergy from the energy centroid Ei,1p1h of the 1p1h state considered. Evaluating an average of Si,1p1h (e) over all the\n1p1h states, the average strength function of 1p1h states is obtained, as shown in Fig. 10(a). Its FWHM gives an\nevaluation of the average spreading width γ12 of 1p1h states. Similar method can be used to evaluate the spreading\ndm\ndm\nwidth γ22 of the 2p2h states (cf. Fig. 10(b)). This direct method gives γ12\n= 1.5MeV and γ22\n= 5.2MeV.\n\n(a)\n\n(b)\n0.15\n\n0.3\n\nS2p2h (E)\n\nS1p1h (E)\n\n0.4\n\n0.10\n\n0.2\n\n0.05\n\n0.1\n\n0.00\n\n0.0\n-20\n\n-10\n\n0\n\n10\n\n20\n\n-20\n\n-10\n\n0\n\n10\n\n20\n\nE (MeV)\n\nE (MeV)\n\nFIG. 10. (a) The strength function of the 1p1h state averaged over all 1p1h states within the energy interval E = 20−30MeV\nand (b) the strength function of the 2p2h states averaged over the same energy interval.\n\nIt is noted that the values of the spreading width γ12 are very different between the golden rule and the direct\nmethod. To investigate the difference, we evaluated root mean square values of interaction matrix elements of V12 for\nindividual 1p1h states, and found that about one third of the 1p1h states have significantly large value ≃ 120−200 keV\nas compared with the other 1p1h states which have small value ≃ 30 − 70keV. Corresponding golden rule estimates\nFG\nFG\nof the spreading width are γ12\n= 8.3 − 22MeV and γ12\n= 0.5 − 2.8MeV, respectively. The FWHM of the average\nstrength function of 1p1h states used in the direct method is dominated by the 1p1h states having small FWHM.\ndm\nFG\nAccordingly the direct method gives much smaller value (γ12\n= 1.5 MeV) than that of the golden rule (γ12\n= 5.3\nMeV).\n3. Dependence of LSD on V12 and V22\n\nIn order to identify the origin of the observed energy scale ǫf = 1.7MeV, we shall analyze the dependence of the\nfine structures of the strength functions on V12 and V22 , which are intimately related to the spreading widths γ12 and\n9\n\n\fγ22 . For this analysis we rescale the interaction strength V12 and V22 by factors λ12 and λ22 respectively, and look\ninto the local scaling dimension to see how the fine structures change.\nIt is seen from Fig. 11 that the fine structures probed by the local scaling dimension Dm (ǫ) strongly depend on λ12 .\nWhen the value of λ12 is small, λ12 = 0.1, the LSD exhibits very strong deviation from the GOE limit in almost all\nenergy scales except at very small energy scale ǫ/d ∼ 1. As the value of λ12 increases, the deviation becomes smaller\nand the LSD at small energy scales coincides with the GOE limit. The energy scale ǫ∗ where the LSD start to deviate\nfrom the GOE limit moves to larger values as λ12 increases. If λ12 is increased more than the original value (e.g.\nλ12 = 1.7), the LSD almost reaches the GOE limit over almost whole energy scales. The above dependence on λ12\nagrees very well with a similar behavior found in the simple doorway damping model [14]. (In that schematic model\none can account for the spreading width γdw of the doorway states analytically.) We found in the schematic model\nthat the energy scale ǫ∗ is proportional to γdw as ǫ∗ ≈ γdw /5 and the energy scale ǫ∗∗ where the LSD decreases most\nsteeply corresponds to γdw . ǫ∗ and ǫ∗∗ moves with the interaction v between the doorway states and the background\nstates since γdw ∝ v 2 . This behavior is consistent with the λ12 dependence in the present model. For quantitative\nevaluation, we compare the spreading width γ12 of the 1p1h TD states, which is considered here as the doorway\nstates, and the energy scale ǫf where the deviation of the LSD from the GOE limit is maximum. Here we adopt the\nenergy scale ǫf in place of ǫ∗∗ , whose extraction is not easy in the present model due to fluctuation in the LSD. The\nenergy scale ǫf = 1.7MeV found for the original interaction (i.e. λ12 = 1) agrees with the spreading width γ12 of the\ndm\n1p1h states if we adopt the value γ12\n= 1.5MeV obtained by the direct evaluation. The agreement is a little worse\nFG\nif we refer to the value γ12 = 5.3MeV derived from the golden rule estimate. We expect that the fine structures\nare dominated by the group of 1p1h states having smaller spreading width γ12 ∼ 1MeV, while the remaining 1p1h\nstates with γ12 > 10MeV, which is larger than the total width of the giant resonance, do not contribute to the fine\ndm\nstructure. The comparison with the spreading width γ12\nby the direct evaluation would be more appropriate since\ndm\nFG\nγ12 reflects mainly the first group. (On the other hand, γ12\nbased on the root mean square of interaction matrix\nelements puts emphasis on the other group. See the previous subsection.) The λ12 -dependence and the comparison\nwith γ12 indicate an approximate relation ǫf ∼ γ12 , for which we estimate an ambiguity by a factor of two.\nFig. 12 shows λ22 -dependence of the LSD. We immediately see that dependence on λ22 is much weaker than that\non λ12 . For λ22 < 0.2, the LSD exhibits deviation from the GOE limit for rather wide interval of energy scale, but\nthe deviation itself is not very large. As λ22 increases, the LSD approaches the GOE limit at small energy scales. (At\nλ22 = 0.5, for instance, the local scaling dimensions almost follow the GOE when ǫ <\n∼ 10d.) For λ22 > 0.5 the LSD is\nnot sensitive to the change in λ22 , and there remains the same deviation from the GOE limit even up to the maximal\nchoice of λ22 = 2.0.\nThe insensitivity to λ22 for λ22 > 0.5 may be understood as follows: We first note that the energy scale of the\nmixing among 2p2h states is given by the spreading width γ22 of the 2p2h states, and that the mixing properties\nare expected to show up in the GOE behaviors for small energy scales satisfying ǫ < γ22 . In the case of the original\ndm\n=5.2MeV of the 2p2h states is larger than the spreading width\nstrength λ12 = λ22 = 1, the spreading width γ22\ndm\nγ12 = 1.5MeV of the 1p1h TD states. If λ22 < 0.5, opposite relation γ22 < γ12 is realized (n.b. γ22 ∝ λ222 and\nγ12 ∝ λ212 ), and hence the energy scale where the deviation from the GOE limit starts is determined by γ22 . In the\ncase of λ22 > 0.5 (including the case of the original strength), on the other hand, we have γ12 < γ22 , and the deviation\nfrom the GOE limit is governed by γ12 . In principle, we can consider a possibility that the LSD exhibits the two\nenergy scales γ12 and γ22 separately. However the deviation related to γ22 is small even when γ22 < γ12 (λ22 < 0.5),\nmaking it difficult to extract the energy scale associated with γ22 . In the case of the original interaction strength,\ndm\n= 5.2MeV is close to the total width γGR (∼ 5MeV) of the giant resonance, and thus it is\nthe spreading widths γ22\ndifficult to be probed. (Notice that we adopted a smoothing width 5MeV.)\nSummarizing the above two analyses, the characteristic energy scale of the fine structures is related to the spreading\nwidth γ12 of the 1p1h TD states, which is considered as the doorway states in the giant resonance decay.\n4. Isovector strength function\n\nWe have also analyzed the strength distribution for the isovector quadrupole operator. Figures 13(a) and (b) show\nthe partition function and the local scaling dimension, respectively, for the isovector strength function in the energy\ninterval E =20-30MeV. The behavior of the LSD is similar to that of isoscalar strength function. Namely, the local\nscaling dimension almost follows the GOE limit at smaller energy scales whereas the deviation from the GOE limit is\nrecognized at intermediate energy scales. We also verified that the change of the value of ǫf is quite sensitive to the\nchange of λ12 compared to the change of λ22 as in the case of the ISGQR. Characteristic energy scale of the deviation\nreads ǫf ∼ 70d ∼ 0.9MeV. This value is smaller than that for the isoscalar strengths (ǫf ∼ 1.7MeV) by about a factor\ndm\nof two. Both are consistent with the spreading width γ12\n= 1.5MeV.\n\n10\n\n\f(a) λ12=0.1\n\n(b) λ12=0.4\n\n1\n\n0.8\n\n0.8\n\n0.6\n\n0.6\n\nDm(ε)\n\nDm(ε)\n\n1\n\n0.4\n0.2\n\n0.4\n0.2\n\n0\n\n0\n1\n\n10\n\n100\n\n1\n\n10\n\nε/d\n\n(d) λ12=1.0\n\n1\n\n0.8\n\n0.8\n\n0.6\n\n0.6\n\nDm(ε)\n\nDm(ε)\n\nε/d\n\n(c) λ12=0.7\n\n1\n\n0.4\n0.2\n\n0.4\n0.2\n\n0\n\n0\n1\n\n10\n\n100\n\n1\n\n10\n\nε/d\n\n100\nε/d\n\n(e) λ12=1.4\n\n1\n\n(f) λ12=1.9\n\n1\n\n0.8\n\n0.8\n\n0.6\n\n0.6\n\nDm(ε)\n\nDm(ε)\n\n100\n\n0.4\n0.2\n\n0.4\n0.2\n\n0\n\n0\n1\n\n10\n\n100\n\n1\n\nε/d\n\n10\n\n100\nε/d\n\nFIG. 11. The local scaling dimensions Dm (ǫ) (m = 2 to 5) for the ISGQR calculated by changing values of λ12 , which is\nchosen as (a) λ12 = 0.1, (b)λ12 = 0.4, (c)λ12 = 0.7, (d)λ12 = 1.0, (e)λ12 = 1.4, and (f)λ12 = 1.9. Here λ12 represents the ratio\nbetween the adopted values of the Hamiltonian matrix elements between the TD 1p1h states and 2p2h states, and those of\noriginal values. The dashed curve represents D2 (ǫ) for the GOE.\n\n11\n\n\f(a) λ22=0.1\n\n(b) λ22=0.4\n\n1\n\n0.8\n\n0.8\n\n0.6\n\n0.6\n\nDm(ε)\n\nDm(ε)\n\n1\n\n0.4\n0.2\n\n0.4\n0.2\n\n0\n\n0\n1\n\n10\n\n100\n\n1\n\n10\n\nε/d\n\n(d) λ22=1.0\n\n1\n\n0.8\n\n0.8\n\n0.6\n\n0.6\n\nDm(ε)\n\nDm(ε)\n\nε/d\n\n(c) λ22=0.7\n\n1\n\n0.4\n0.2\n\n0.4\n0.2\n\n0\n\n0\n1\n\n10\n\n100\n\n1\n\n10\n\nε/d\n\n100\nε/d\n\n(e) λ22=1.6\n\n1\n\n(f) λ22=1.9\n\n1\n\n0.8\n\n0.8\n\n0.6\n\n0.6\n\nDm(ε)\n\nDm(ε)\n\n100\n\n0.4\n0.2\n\n0.4\n0.2\n\n0\n\n0\n1\n\n10\n\n100\n\n1\n\nε/d\n\n10\n\n100\nε/d\n\nFIG. 12. The local scaling dimensions Dm (ǫ) (m = 2 to 5) for the ISGQR calculated by changing values of λ22 , which is\nchosen as (a) λ22 = 0.1, (b)λ22 = 0.4, (c)λ22 = 0.7, (d)λ22 = 1.0, (e)λ22 = 1.6, and (f)λ22 = 1.9. Here λ22 represents the ratio\nbetween the adopted values of the Hamiltonian off-diagonal matrix elements between 2p2h states and those of original values.\nThe dashed curve represents D2 (ǫ) for the GOE.\n\n12\n\n\f(a)\n\n(b)\n\n1\n\n1\n0.8\n\nχm(ε)\n\nDm(ε)\n\n0.6\n0.4\n0.2\n10-10\n\n0\n1\n\n10\n\n100\n\n1\n\nε/d\n\n10\n\n100\nε/d\n\nFIG. 13. (a)The partition function χm (ǫ) (m = 2 to 5) for the IVGQR corresponding to the normalized strength funciton\nplotted in Fig. 6 (b). (b)Its local scaling dimension Dm (ǫ) for m = 2 to 5. The dashed curve rpresents D2 (ǫ) for the GOE.\n\nIV. CONCLUSIONS\n\nWe have analyzed fine structures of the giant quadrupole resonances described by means of the microscopic shell\nmodel including up to 2p2h configurations. By applying the scaling analysis of strength fluctuations that utilizes\nthe local scaling dimension, we extracted the energy scale ǫf = 1.7 MeV for the ISGQR and ǫf = 0.9 MeV for the\nIVGQR that characterize the fine structure. We discussed the origin of the characteristic energy scale in terms of the\nspreading widths of the 1p1h and 2p2h states. We found a clear correlation between the characteristic energy scale\nand the spreading width γ12 of the 1p1h Tamm-Dancoff states, which play a role of doorway states in the present\nshell model description of the giant quadrupole resonances in 40 Ca.\nIn the present paper, we intended to illustrate how the scaling analysis can be utilized to investigate the fine\nstructures and their origin. Although the adopted model has some realistic features, we do not claim that the present\nshell model predicts all the quantitative features of the quadrupole strength distributions since the particle escaping\nwidth for instance is neglected in the present model. Also, other mechanisms such as the surface phonon coupling\nare not explicitly taken into account in the present model. Apparently, one may need more realistic model if one\nintends to make a quantitative prediction or comparison with the experiment. Instead we would like to emphasize\nthat the local scaling analysis provides a general tool for quantitative investigation of the fine structures, and the\nscaling analysis itself can be applied to any kinds of models which exhibit fine structures in the strength functions.\n\n[1]\n[2]\n[3]\n[4]\n[5]\n[6]\n[7]\n[8]\n[9]\n[10]\n[11]\n[12]\n[13]\n[14]\n\nG.F. Bertsch, P.F. Bortignon, and R.A. Broglia, Rev. Mod. Phys. 55, 287 (1983).\nElectric and Magnetic Giant Resonances in Nuclei (World Scientific, Singapore, 1991), ed. J. Speth.\nM. N. Harakeh and A. van der Woude, Giant Resonances (Oxford University Press, Oxford, 2001).\nF.J. Dyson, J. Math. Phys. 3, 140, 157, 166 (1962).\nM.L. Mehta, Random matrices, 2nd ed. (Academic Press, 1991).\nO.Bohigas and M.-J. Giannoni, in Lecture Notes in Physics Vol.219 (Springer, 1984) p.1.\nT.A.Brody, J.Flores, J.B.French, P.A.Mello, A.Pandy and S.S.M.Wong, Rev. Mod. Phys. 53, 385 (1981).\nA. Bohr and B.R. Mottelson, Nuclear Structure (Benjamin, New York, 1996), Vol.1, Chap.2.\nR.V. Haq, A. Pandey, and O. Bohigas, Phys. Rev. Lett. 48, 1086 (1982).\nP.G. Hansen, B. Jonson, and A. Richter, Nucl. Phys. A 518, 13 (1990).\nJ.C. Hardy, B. Jonson, P.G. Hansen, Nucl. Phys. A 305, 15 (1978).\nG. Kilgus, G. Kühner, S. Müller, A.Richter, W.Knüpfer, Z. Phys. A 326, 41 (1987).\nS. Kamerdzhiev, J. Lisantti, P. von Neumann-Cosel, A. Richter, G. Tertychny, J. Wambach, Phys. Rev. C 55, 2101 (1997).\nH. Aiba and M. Matsuo, Phys. Rev. C 60, 034307 (1999).\n\n13\n\n\f[15]\n[16]\n[17]\n[18]\n[19]\n[20]\n[21]\n[22]\n[23]\n\nD. Lacroix and Ph. Chomaz, Phys. Rev. C 60, 064307 (1999).\nD. Lacroix, A. Mai, P. von Neumann-Cosel, A. Richter, and J. Wambach, Phys. Lett. B 479, 15 (2000).\nA. Bohr and B.R. Mottelson, Nuclear Structure (Benjamin, New York, 1996), Vol.1, Chap.2D.\nH.G.E. Hentschel and I. Procaccia, Physica D 8, 435 (1983).\nT.C. Halsey, M.H. Jensen, L.P. Kadanoff, I. Procaccia, and B.I. Shraiman, Phys. Rev. A 33, 1141 (1986).\nB. Schwesinger and J. Wambach, Nucl. Phys. A 426, 253 (1984).\nS. Drożdż, S. Nishizaki and J. Wambach, Phys. Rev. Lett. 72, 2839 (1994).\nS. Drożdż, S. Nishizaki, J. Wambach and J. Speth, Phys. Rev. Lett. 74, 1075 (1995).\nP. Ring and P. Schuck, The Nuclear Many-Body Problem (Springer, New York, 1980), Chap.2.9.\n\n14\n\n\f"}