{"id": "http://arxiv.org/abs/nucl-th/0110056v1", "guidislink": true, "updated": "2001-10-23T14:07:40Z", "updated_parsed": [2001, 10, 23, 14, 7, 40, 1, 296, 0], "published": "2001-10-23T14:07:40Z", "published_parsed": [2001, 10, 23, 14, 7, 40, 1, 296, 0], "title": "Statistical theory of the many-body nuclear system", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=nucl-th%2F0702056%2Cnucl-th%2F0702083%2Cnucl-th%2F0702004%2Cnucl-th%2F0702073%2Cnucl-th%2F0702075%2Cnucl-th%2F0702035%2Cnucl-th%2F0702043%2Cnucl-th%2F0702084%2Cnucl-th%2F0702003%2Cnucl-th%2F0702063%2Cnucl-th%2F0702052%2Cnucl-th%2F0702047%2Cnucl-th%2F0702027%2Cnucl-th%2F0702020%2Cnucl-th%2F0702070%2Cnucl-th%2F0702044%2Cnucl-th%2F0702007%2Cnucl-th%2F0702014%2Cnucl-th%2F0702060%2Cnucl-th%2F0702031%2Cnucl-th%2F0702026%2Cnucl-th%2F0702045%2Cnucl-th%2F0702042%2Cnucl-th%2F0702054%2Cnucl-th%2F0702049%2Cnucl-th%2F0702008%2Cnucl-th%2F0702057%2Cnucl-th%2F0110084%2Cnucl-th%2F0110036%2Cnucl-th%2F0110010%2Cnucl-th%2F0110019%2Cnucl-th%2F0110083%2Cnucl-th%2F0110040%2Cnucl-th%2F0110082%2Cnucl-th%2F0110067%2Cnucl-th%2F0110052%2Cnucl-th%2F0110007%2Cnucl-th%2F0110059%2Cnucl-th%2F0110055%2Cnucl-th%2F0110001%2Cnucl-th%2F0110065%2Cnucl-th%2F0110016%2Cnucl-th%2F0110042%2Cnucl-th%2F0110021%2Cnucl-th%2F0110057%2Cnucl-th%2F0110081%2Cnucl-th%2F0110024%2Cnucl-th%2F0110012%2Cnucl-th%2F0110003%2Cnucl-th%2F0110004%2Cnucl-th%2F0110049%2Cnucl-th%2F0110027%2Cnucl-th%2F0110058%2Cnucl-th%2F0110078%2Cnucl-th%2F0110011%2Cnucl-th%2F0110008%2Cnucl-th%2F0110014%2Cnucl-th%2F0110037%2Cnucl-th%2F0110056%2Cnucl-th%2F0110085%2Cnucl-th%2F0110069%2Cnucl-th%2F0110047%2Cnucl-th%2F0110080%2Cnucl-th%2F0110038%2Cnucl-th%2F0110031%2Cnucl-th%2F0110062%2Cnucl-th%2F0110066%2Cnucl-th%2F0110063%2Cnucl-th%2F0110068%2Cnucl-th%2F0110017%2Cnucl-th%2F0110041%2Cnucl-th%2F0110035%2Cnucl-th%2F0110077%2Cnucl-th%2F0110015%2Cnucl-th%2F0110044%2Cnucl-th%2F0110054%2Cnucl-th%2F0110025%2Cnucl-th%2F0110051%2Cnucl-th%2F0110073%2Cnucl-th%2F0110034%2Cnucl-th%2F0110039%2Cnucl-th%2F0110020%2Cnucl-th%2F0110071%2Cnucl-th%2F0110074%2Cnucl-th%2F0110030%2Cnucl-th%2F0110028%2Cnucl-th%2F0110033%2Cnucl-th%2F0110026%2Cnucl-th%2F0110079%2Cnucl-th%2F0110053%2Cnucl-th%2F0110072%2Cnucl-th%2F0110064%2Cnucl-th%2F0110023%2Cnucl-th%2F0110009%2Cnucl-th%2F0110075%2Cnucl-th%2F0110029%2Cnucl-th%2F0110006%2Cnucl-th%2F0110018%2Cnucl-th%2F0110032%2Cnucl-th%2F0110022%2Cnucl-th%2F0110043&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Statistical theory of the many-body nuclear system"}, "summary": "A recently proposed statistical theory of the mean fields associated with the\nground and excited collective states of a generic many-body system is extended\nby increasing the dimensions of the P-space. In applying the new framework to\nnuclear matter, in addition to the mean field energies we obtain their\nfluctuations as well, together with the ones of the wavefunctions, in first\norder of the expansion in the complexity of the Q-space states. The physics\ndescribed by the latter is assumed to be random. To extract numerical\npredictions out of our scheme we develop a schematic version of the approach,\nwhich, while much simplified, yields results of significance on the size of the\nerror affecting the mean fields, on the magnitude of the residual effective\ninteraction, on the ground state spectroscopic factor and on the mixing\noccurring between the vectors spanning the P-space.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=nucl-th%2F0702056%2Cnucl-th%2F0702083%2Cnucl-th%2F0702004%2Cnucl-th%2F0702073%2Cnucl-th%2F0702075%2Cnucl-th%2F0702035%2Cnucl-th%2F0702043%2Cnucl-th%2F0702084%2Cnucl-th%2F0702003%2Cnucl-th%2F0702063%2Cnucl-th%2F0702052%2Cnucl-th%2F0702047%2Cnucl-th%2F0702027%2Cnucl-th%2F0702020%2Cnucl-th%2F0702070%2Cnucl-th%2F0702044%2Cnucl-th%2F0702007%2Cnucl-th%2F0702014%2Cnucl-th%2F0702060%2Cnucl-th%2F0702031%2Cnucl-th%2F0702026%2Cnucl-th%2F0702045%2Cnucl-th%2F0702042%2Cnucl-th%2F0702054%2Cnucl-th%2F0702049%2Cnucl-th%2F0702008%2Cnucl-th%2F0702057%2Cnucl-th%2F0110084%2Cnucl-th%2F0110036%2Cnucl-th%2F0110010%2Cnucl-th%2F0110019%2Cnucl-th%2F0110083%2Cnucl-th%2F0110040%2Cnucl-th%2F0110082%2Cnucl-th%2F0110067%2Cnucl-th%2F0110052%2Cnucl-th%2F0110007%2Cnucl-th%2F0110059%2Cnucl-th%2F0110055%2Cnucl-th%2F0110001%2Cnucl-th%2F0110065%2Cnucl-th%2F0110016%2Cnucl-th%2F0110042%2Cnucl-th%2F0110021%2Cnucl-th%2F0110057%2Cnucl-th%2F0110081%2Cnucl-th%2F0110024%2Cnucl-th%2F0110012%2Cnucl-th%2F0110003%2Cnucl-th%2F0110004%2Cnucl-th%2F0110049%2Cnucl-th%2F0110027%2Cnucl-th%2F0110058%2Cnucl-th%2F0110078%2Cnucl-th%2F0110011%2Cnucl-th%2F0110008%2Cnucl-th%2F0110014%2Cnucl-th%2F0110037%2Cnucl-th%2F0110056%2Cnucl-th%2F0110085%2Cnucl-th%2F0110069%2Cnucl-th%2F0110047%2Cnucl-th%2F0110080%2Cnucl-th%2F0110038%2Cnucl-th%2F0110031%2Cnucl-th%2F0110062%2Cnucl-th%2F0110066%2Cnucl-th%2F0110063%2Cnucl-th%2F0110068%2Cnucl-th%2F0110017%2Cnucl-th%2F0110041%2Cnucl-th%2F0110035%2Cnucl-th%2F0110077%2Cnucl-th%2F0110015%2Cnucl-th%2F0110044%2Cnucl-th%2F0110054%2Cnucl-th%2F0110025%2Cnucl-th%2F0110051%2Cnucl-th%2F0110073%2Cnucl-th%2F0110034%2Cnucl-th%2F0110039%2Cnucl-th%2F0110020%2Cnucl-th%2F0110071%2Cnucl-th%2F0110074%2Cnucl-th%2F0110030%2Cnucl-th%2F0110028%2Cnucl-th%2F0110033%2Cnucl-th%2F0110026%2Cnucl-th%2F0110079%2Cnucl-th%2F0110053%2Cnucl-th%2F0110072%2Cnucl-th%2F0110064%2Cnucl-th%2F0110023%2Cnucl-th%2F0110009%2Cnucl-th%2F0110075%2Cnucl-th%2F0110029%2Cnucl-th%2F0110006%2Cnucl-th%2F0110018%2Cnucl-th%2F0110032%2Cnucl-th%2F0110022%2Cnucl-th%2F0110043&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A recently proposed statistical theory of the mean fields associated with the\nground and excited collective states of a generic many-body system is extended\nby increasing the dimensions of the P-space. In applying the new framework to\nnuclear matter, in addition to the mean field energies we obtain their\nfluctuations as well, together with the ones of the wavefunctions, in first\norder of the expansion in the complexity of the Q-space states. The physics\ndescribed by the latter is assumed to be random. To extract numerical\npredictions out of our scheme we develop a schematic version of the approach,\nwhich, while much simplified, yields results of significance on the size of the\nerror affecting the mean fields, on the magnitude of the residual effective\ninteraction, on the ground state spectroscopic factor and on the mixing\noccurring between the vectors spanning the P-space."}, "authors": ["A. De Pace", "A. Molinari"], "author_detail": {"name": "A. Molinari"}, "author": "A. Molinari", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1006/aphy.2001.6205", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/nucl-th/0110056v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/nucl-th/0110056v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "27 pages, 3 figures; Dedicated to the memory of Herman Feshbach", "arxiv_primary_category": {"term": "nucl-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "nucl-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/nucl-th/0110056v1", "affiliation": "INFN and Dipartimento di Fisica Teorica, Torino, Italy", "arxiv_url": "http://arxiv.org/abs/nucl-th/0110056v1", "journal_reference": "Annals Phys. 296 (2002) 263-286", "doi": "10.1006/aphy.2001.6205", "fulltext": "Statistical theory of the many-body nuclear system\nA. De Pace and A. Molinari\n\narXiv:nucl-th/0110056v1 23 Oct 2001\n\nDipartimento di Fisica Teorica dell'Università di Torino and\nIstituto Nazionale di Fisica Nucleare, Sezione di Torino,\nvia P.Giuria 1, I-10125 Torino, Italy\n(October 2001)\n\nAbstract\nA recently proposed statistical theory of the mean fields associated with the\nground and excited collective states of a generic many-body system is extended by increasing the dimensions of the P -space. In applying the new\nframework to nuclear matter, in addition to the mean field energies we obtain\ntheir fluctuations as well, together with the ones of the wavefunctions, in first\norder of the expansion in the complexity of the Q-space states. The physics\ndescribed by the latter is assumed to be random. To extract numerical predictions out of our scheme we develop a schematic version of the approach,\nwhich, while much simplified, yields results of significance on the size of the\nerror affecting the mean fields, on the magnitude of the residual effective interaction, on the ground state spectroscopic factor and on the mixing occurring\nbetween the vectors spanning the P -space.\n\nTypeset using REVTEX\n1\n\n\fI. INTRODUCTION\n\nWe have recently addressed the problem of assessing the impact of randomness in the\nground state of atomic nuclei [1–3]. In exploring this issue we assume random processes to\nbe related to the strong repulsion the nucleons experience when they come close to each\nother inside the nucleus. This occurrence, while comparatively rare, is of crucial relevance\nfor the nuclear dynamics and in the perturbative approach one tries to compute the related\ncontribution, e. g., to the binding energy of the system, using G-matrix techniques. The\nlatter, however, account solely for the two-body aspect of the short-range nucleon-nucleon\n(NN) correlations and do so only within certain approximations.\nFurthermore, the large violation of the Hughenoltz-Van Hove theorem occurring in the\nBrueckner-Hartree-Fock (BHF) nuclear matter calculations, - not to mention the wellknown failure of the BHF theory in accounting for the empirical data, - clearly demonstrates\nthat diagrams beyond the ladder ones are needed to satisfactorily describe the physics of\natomic nuclei, in particular the short-range one. Higher order diagrams in the BruecknerBethe-Goldstone hole-line expansion have been computed, but they still appear to fall short\nof accounting for the experiments.\nAlternatively, one seeks for an exact solution of the nuclear many-body problem via the\nGreen's function Monte Carlo method. This has actually been achieved lately in light nuclei,\nowing to the remarkable progress in the computational capabilities of modern computers (see,\ne. g., Ref. [4]. Yet, even the present days number crunching power is not enough to tackle\nthe enormously complex problem represented by medium-heavy and heavy nuclei, precisely\nas it happens, in a different context, for the non-perturbative QCD.\nMoreover, given that these computational obstacles will eventually be surmounted, one\nwill still have to face the question whether a non-relativistic potential model description is\nsufficient to encompass all the aspects of the nuclear many-body problem. Indeed, the issue\nof Lorentz covariance, of particular importance for the short-range physics in nuclei where\nlarge momenta are attained, is lurking in a corner, not to mention the ambiguities existing\nin defining and constructing a potential model description of the NN interaction at short\ndistances, where it is so hard to disentangle particle and nuclear physics from each other\nand where off-shell effects become larger.\nIt thus appears warranted to explore alternative routes in attacking the nuclear manybody problem. Hence, we have recently examined an approach to the theory of the ground\nstate of atomic nuclei based on the concept of averaging rather than computing most of the\nphysics related to the strong NN collisions at short distances. As a first step we have thus\nset up an energy averaging procedure suitable for constructing a mean field to be eventually\nidentified with the shell model. Here, our procedure parallels the one successfully adopted\nin the development of the \"optical model\" of nuclear reactions [5], to which it is in fact\ndirectly inspired.\nClearly, for the mean field to have a meaning an assessment should be provided for the\nerror associated with it. Indeed, if the error turns out to be large, then the concept of mean\nfield is no longer tenable. Hence, we have derived an expression for the error through an\nexpansion in the complexity of the states that the NN repulsion at short distances allows\nto reach. At the basis of the derivation lies the hypothesis alluded to in the beginning of\nthis Introduction, namely that the matrix elements of the NN repulsion are random, thus\n2\n\n\fentailing the vanishing of the average value of the error, but, of course, not of its square. It\nis this one that our expansion (finite in finite nuclei and fastly convergent, as we shall prove)\nprovides.\nThe above outlined framework basically correspond to a statistical theory of the ground\nstate (more generally, of the bound states) of the atomic nuclei. As a first example, we\nhave attempted to implement it in the simplest among the latter, namely nuclear matter,\nassuming this system to represent, at least partially, the physics of heavy nuclei. Already\nin performing this task, far from trivial technical problems have been encountered, notably\nthe one of performing the sum over the complex nuclear excited states building up the error\n(square of). We have been able to surmount this obstacle in Ref. [3].\nIt should be furthermore observed that, at the present stage, even in nuclear matter our\nstatistical theory cannot be made parameter–free. As a consequence, its predictive power is\nsomewhat limited: Indeed, what we actually do amounts to correlate a set of observables of\nnuclear matter (or heavy nuclei), either measured or computed (via, e. g., the BHF theory),\n- like the binding and the excited states energies and the level density, - and \"predict\"\non this basis the mean field energies of the ground and of the collective nuclear states, -\ntogether with the associated error, - the residual effective interaction, which, while well\ndefined, is presently hardly computable, and in addition the ground state spectroscopic\nfactor.\nConcerning the parameters entering in our approach, one is needed to characterize our\nenergy averaging procedure, whereas the others are required whenever the experimental\nvalues of the above referred to observables are lacking or their theoretical evaluation not\navailable. We shall discuss in particular the significance of the former, which plays a central\nrole in our approach.\nThis work is cast in the language introduced to build the unified theory of nuclear\nreactions [5], at the core of which lies the partition of the nuclear Hilbert space in the P\nand Q sectors. We implement this partition by inserting the random aspects of the physics\nof the nucleus in the latter. Hence the Q-space should not be viewed as specific of a given\nHamiltonian, but rather it displays universal features and indeed it is in the Q-space that\nthe energy average is performed. The P -space embodies instead the deterministic physics\nof the nucleus and its dimensions should be dovetailed for this purpose. This is why the\nchief scope of the present research is to expand the dimensions of the P sector of the nuclear\nHilbert space, thus removing a major restriction of our past work, where the P -space was\nlimited to one dimension only.\nSpecifically, the enlargement of the dimensions of the P -space allows: i) to compute\nthe fluctuations of the nuclear wave function and not only of the energy, thus assessing the\nerror associated both with the mean field energy and its wave function; ii) to show the fast\nconvergence of the expansion for the error, essentially stemming from the rapid increase of\nthe nuclear level density with the excitation energy; iii) to provide an improved estimate,\nwith respect to our past work, of the mean field energy and of the spectroscopic factor of\nnuclear matter; iv) to predict a quenching of an order of magnitude of the matrix elements\nof the NN residual effective interaction as compared to those of the bare force.\nIn the following we shall dwell on the above items shortly revisiting the theory in Sect. II,\ndeepening the meaning of the energy averaging in Sect. III and broadening the P -space in\nSect. IV. Next, we shall address the question of the spectroscopic factor and of the wave\n3\n\n\ffunction fluctuations in Sect. V. Finally, the numerical results obtained on the basis of a\nschematic model will be presented in Sect. VI.\nII. THEORETICAL FRAMEWORK\n\nOur statistical theory has been developed in Refs. [1–3]. For the convenience of the\nreader and to facilitate the understanding of the extension of the theory presented in this\npaper, we shortly recall in the following the basic equations characterizing our approach.\nAs it is well-known, the splitting of the Hilbert space induced by the projection operators\nP and Q transforms the Schroedinger equation\nHψ = Eψ\n\n(2.1)\n\ninto the pair of coupled equations\n(E − HP P )(P ψ) = HP Q (Qψ)\n(E − HQQ )(Qψ) = HQP (P ψ),\n\n(2.2a)\n(2.2b)\n\nthe meaning of the symbols being obvious. From the above the equation obeyed solely by\n(P ψ) is derived. It reads\nH(P ψ) = E(P ψ),\n\n(2.3)\n\nthe P -space Hamiltonian being\nH = HP P + HP Q \u0012\n\n1\n1\neQ\n\n\u0013−1\n\nHQP ,\n\n(2.4)\n\n+ WQQ\n\nwith\neQ = E − HQQ − WQQ\n1\nWQQ = HQP\nHP Q .\nE − HP P\n\n(2.5a)\n(2.5b)\n\nIt is of significance that although Eq. (2.3) is not an eigenvalue equation, since the energy E\nalso appears in the denominator of its right hand side, yet its solutions only occur for those\nvalues of E which are eigenvalues of (2.1) as well; in other words, a one-to-one correspondence\nbetween the values of E allowed by (2.1) and (2.3) exists (see next section for a further\ndiscussion of this point).\nNow, as already mentioned in the Introduction, in our framework the quantum deterministic aspect of nuclear dynamics is assumed to be embodied in the P -space, the chaotic\none in the Q-space. Hence, the strategy of averaging over the latter follows, although, admittedly, some fuzziness does affect this partitioning. To set up the averaging procedure we\nstart by the recognition that the wave functions in the Q-space are rapidly varying functions\nof the energy E, viewed as a parameter classifying their ensemble.\nAccordingly, we average over this ensemble following the prescription\n4\n\n\fhf (E)i =\n\nZ\n\n∞\n\n−∞\n\ndE ρ(E, Ē0 , ǫ)f (E),\n\n(2.6)\n\nf being a generic function to be averaged over the variable E with the distribution\nρ(E, Ē0 , ǫ). The latter depends, beyond E, also upon the value Ē0 around which the average,\n- taken over a range of E essentially set by ǫ, - is performed. A distribution convenient\nfor our purposes is\nρ(E, Ē0 , ǫ) =\n\neiEη\n1\n,\n2πi E − (Ē0 − ǫ) − iη\n\n(2.7)\n\nwhich is indeed correctly normalized being\nZ\n\n∞\n\n−∞\n\ndE ρ(E, Ē0 , ǫ) = 1\n\n(2.8)\n\n(one should let η → 0+ after the integration has been performed). Note that Eq. (2.7)\nextends in some sense the Lorentz distribution of the optical model [5] to the situation of a\nzero width state. Hence the present formalism is especially suited to deal with the nuclear\nground state, which is of course stable: We shall accordingly focus mainly on the latter in\nthe following.\nWe now recall that in [1–3] the Q-space wave functions was found to read\n(Qψ) =\n\n1\nHQP ψ0 ,\neQ\n\n(2.9)\n\nψ0 being an auxiliary function that in the end disappears from the formalism. By averaging\nEq. (2.9) according to the prescriptions (2.6) and (2.7), one then finds that the energy\naveraged wave function of the nuclear ground state in the P -space (here denoted by the\nangle brackets) obeys the equation\nH̄hP ψi = Ē0 hP ψi.\n\n(2.10)\n\nIn (2.10) Ē0 is the mean field energy and\nH̄ = HP P + HP Q \u001c\n\n1\n1\neQ\n\n\u001d−1\n\nHQP\n\n(2.11)\n\n+ WQQ (E = Ē0 )\n\nis the mean field Hamiltonian. This can be further elaborated since the singularities of the\noperator 1/eQ lie in the ImE < 0 half-plane [6]. Accordingly, one gets\nh\n\neiEη\n1\nE − (Ē0 − ǫ) − iη E − HQQ − WQQ (E)\n−∞\n1\n1\n=\n≈\n,\nĒ0 − ǫ − HQQ − WQQ (E = Ē0 − ǫ)\nĒ0 − ǫ − HQQ − WQQ (E = Ē0 )\n\n1\n1\ni=\neQ\n2πi\n\nZ\n\n∞\n\ndE\n\n(2.12)\n\nthe last passage holding if the energy dependence of the operator WQQ is mild and if the\nparameter ǫ is not too large (it should be not too small either, otherwise the energy averaging\nprocedure becomes meaningless).\n5\n\n\fThe insertion of (2.12) into (2.11) leads to the following useful alternative expression for\nthe mean field Hamiltonian\nH̄ = HP P + VP Q VQP\n\n1\n,\nĒ0 − ǫ − E\n\n(2.13)\n\nwhere the energy dependent operators\nv\nu\nu\nt\n\nĒ0 − ǫ − E\nĒ0 − ǫ − HQQ\n\n(2.14a)\n\nĒ0 − ǫ − E\nHQP ,\nĒ0 − ǫ − HQQ\n\n(2.14b)\n\nVP Q = HP Q\nand\nVQP =\n\nv\nu\nu\nt\n\nrepresent the residual effective NN interaction. The usefulness of the Eqs. (2.13) and (2.14)\nwas realized in Ref. [7], where it was noticed that with their help the pair of equations (2.2)\ncan be recast, as far as (P ψ) is concerned, into the form\n(E − H̄)(P ψ) = VP Q (Qψ)\n(E − HQQ )(Qψ) = VQP (P ψ),\n\n(2.15a)\n(2.15b)\n\nwhich is suitable for expressing the mean field fluctuations (the \"error\").\nIndeed, by exploiting the spectral decomposition of the operator (E − H̄)−1 in terms of\nthe eigenfunctions φn of the mean field Hamiltonian H̄, one gets from Eq. (2.15a)\n|φn i\nhφn |VP Q |Qψi\nn E − Ēn\n\u0013′\n\u0012\nhφ0 |VP Q |Qψi\n1\nVP Q |Qψi,\n= |φ0 i\n+\nE − Ē0\nE − H̄\n\n|P ψi =\n\nX\n\n(2.16)\n\nwhich, upon left multiplication by hφ0 |, yields\nhφ0 |P ψi =\n\nhφ0 |VP Q |Qψi\n.\nE − Ē0\n\n(2.17)\n\nIn the second term on the right hand side of Eq. (2.16), the prime stands for the omission\nof the n = 0 term in the spectral decomposition.\nNext, the insertion of Eq. (2.16) into (2.15b) leads to\n|Qψi =\n\n1\nVQP |φ0 ihφ0|P ψi,\nE − hQQ\n\n(2.18)\n\nwhere the operator\nhQQ = HQQ + VQP\n\n\u0012\n\n6\n\n1\nE − H̄\n\n\u0013′\n\nVP Q\n\n(2.19)\n\n\fhas been introduced. Finally, by combining (2.17) and (2.18), one arrives at the equation\nE − Ē0 = hφ0 |VP Q\n\n1\nVQP |φ0 i,\nE − hQQ\n\n(2.20)\n\nwhich is the basis for computing the mean field energy error.\nAlthough Eq. (2.20) is valid for any choice of the projectors P and Q, its use is in fact\nappropriate when the P -space is one-dimensional, as it was indeed the case in our past work,\nwhere this choice had been made for sake of simplicity. For example, for a two-dimensional\nP -space, as we shall later see, one should rather single out two, rather then one, terms in\nthe spectral decomposition of the operator (E − H̄)−1 on the right hand side of Eq. (2.16).\nWe refer the reader to Refs. [1–3] for a discussion on how the average of the square of\nEq. (2.20) is actually computed (the average of (2.20) of course should vanish) and on how\nthe complexity expansion is organized. Here, we simply remind that in the present work,\n- as we have done in the past, - we shall confine ourselves to the leading term of this\nfast converging expansion. The difference between the present results and the previous ones\nthus stems entirely from the enlargement of the P -space.\nIII. ENERGY AVERAGING\n\nTo understand better the significance of the energy averaging distribution (2.7) let us\nstudy how it works in the simple cases of a bi-dimensional (A) and of a tri-dimensional (B)\nHilbert space.\nA. Bi-dimensional Hilbert space\n\nLet |χ1 i and |χ2 i be the two normalized states spanning the space. Here the only possible\nchoice for the projectors clearly is\nP ≡ |χ1 ihχ1 |\n\nQ ≡ |χ2 ihχ2 |.\n\nand\n\n(3.1)\n\nThen, by expanding the operator 1/(E − HQQ ), Eq. (2.3) can be recast as follows\n\u0013\n∞ \u0012\na22 n\n1 X\n(|χ2 ihχ2 |)n |χ2 ia∗12 hχ1 | |P ψi = 0,\nE − |χ1 ia11 hχ1 | − χ1 ia12 hχ2 |\nE n=0 E\n#\n\n\"\n\n(3.2)\n\nwhich, upon multiplying from the left by hχ1 | and exploiting the idempotency of |χ2 ihχ2 |,\nsimplifies to\n\"\n\n|a12 |2\nE − a11 −\nhχ1 |P ψi = 0,\nE − a22\n#\n\n(3.3)\n\nwhere the shorthand notations\na11 = hχ1 |H|χ1i,\n\na22 = hχ2 |H|χ2i and a12 = hχ1 |H|χ2 i\n7\n\n(3.4)\n\n\fhave been introduced. This equation is trivially solved yielding the eigenvalues\nq\n1\nE± =\na11 + a22 ± (a11 − a22 )2 + 4|A212 ,\n2\n\u0014\n\n\u0015\n\n(3.5)\n\nwhich coincide with those of H. It helps notice that the eigenvalues (3.5) are also found as\nintersections of the hyperbola\nE = a11 +\n\n|a12 |2\nω − a22\n\n(3.6)\n\nwith the straight line E = ω.\nAlso the energy averaged Hamiltonian (2.13) can be expressed in the basis spanned by\nχ1 and χ2 and one gets the mean field equation\n|a12 |2\nhχ1 |hhP ψiii = 0.\nĒ − a11 −\nĒ − a22\n#\n\n\"\n\n(3.7)\n\nThe latter is again trivially solved yielding\nĒ± =\n\nq\n1\na11 + a22 + ǫ ± (a11 − a22 − ǫ)2 + 4b2 ,\n2\n\u0014\n\n\u0015\n\n(3.8)\n\nwhich now corresponds to the intersections of the hyperbola (3.6) (with Ē replacing E) with\nthe new straight line Ē = ω + ǫ.\nFrom Fig. 1, where the solutions E± and Ē± are graphically displayed, it clearly appears\nthat, while Ē− ∼\n= E− , the other solution Ē+ is much larger than E+ , the more so the greater ǫ\nis. It is thus clear that the averaging distribution (2.7), while mildly affecting the eigenvalue\nof H lying in the P -space, drives away the one lying in the Q-space.\nB. Tri-dimensional Hilbert space\n\nThe space is spanned by the normalized states |χ1 i, |χ2 i and |χ3 i. Now, two choices are\npossible for the projectors, namely\nP ≡ |χ1 ihχ1 | + |χ2 ihχ2 |\nQ ≡ |χ3 ihχ3 |\n\n(3.9a)\n(3.9b)\n\nP ≡ |χ1 ihχ1 |\nQ ≡ |χ2 ihχ2 | + |χ3 ihχ3 |.\n\n(3.10a)\n(3.10b)\n\nand\n\nIn both cases, Eq. (2.3) can be recast as follows\n(E − a11 )(E − a22 )(E − a33 ) − |a12 |2 (E − a33 ) − |a13 |2 (E − a22 ) − |a23 |2 (E − a11 ) = 0,\n\n(3.11)\n\n8\n\n\f20\n\n10\n\n0\n\n-10\n\n-20\n-15\n\n-10\n\n-5\n\n0\n\n5\n\nω\n\nFIG. 1.\nThe eigenvalues of a bi-dimensional Hilbert space. The matrix elements of the\nHamiltonian are taken to be a11 = −2, a22 = 2 and a12 = 3, in arbitrary units. The exact\neigenvalues (squares) and the ones of the energy averaged Hamiltonian H̄ (circles) are shown.\nThey correspond to the intersections with the straight line E = ω + ǫ: The former with ǫ = 0, the\nlatter with ǫ = 7. The stability of the lowest eigenvalue and the upward shift of the highest one\nare clearly apparent.\n\nwhich is the cubic equation yielding the exact eigenvalues. Note that Eq. (3.11) is easily\nobtained with the choice (3.9), because in this case the operator (E − HQQ )−1 is expanded\nin terms of the idempotent operator |χ3 ihχ3 |. Not so with the choice (3.10), because now\n(E − HQQ )−1 should be expanded in terms of the operator (3.10b), which is not idempotent.\nActually, the larger the powers of the latter are, the more cumbersome they become. Yet,\nalso in this case it can be proved that Eq. (3.11) holds valid.\nLet us now examine the solutions of Eq. (2.13): As in the previous bi-dimensional case\nit is convenient to display the solutions graphically. For the partition (3.10), one finds that\nthey are given by the intersections of the ǫ-independent curve\nĒ = a11 +\n\n|a12 |2 (ω − a33 ) |a13 |2 (ω − a22 ) a12 a∗13 a23 a∗12 a13 a∗23\n+\n+\n+\n,\nD1 (ω)\nD(ω)\nD(ω)\nD(ω)\n\n(3.12)\n\nwhere\nD(ω) = (ω − a22 )(ω − a33 ) − |a23 |2 ,\n\n(3.13)\n\nwith the straight line Ē = ω + ǫ, as displayed in Fig. 2, where the case ǫ = 0, - which\nclearly provides the exact eigenvalues Ei of the Schroedinger equation, - is also shown.\nFrom the figure, it transparently appears that Ē0 ∼\n= E0 , whereas Ē1 >> E1 and Ē2 >> E2 ,\nthe latter inequalities being stronger when the parameter ǫ is large.\nIn the case of the partition (3.9), the solutions are given by the intersections of the curve\nobtained replacing a22 → a22 − ǫ in Eqs. (3.12) and (3.13) with the straight line Ē = ω + ǫ,\nas displayed in Fig. 3. We face here a new situation, since now not only the straight line, but\n9\n\n\f20\n\n10\n\n0\n\n-10\n\n-20\n-20\n\n-10\n\n0\n\n10\n\nω\n\nFIG. 2. The eigenvalues of a tri-dimensional Hilbert space: The case of a one-dimensional\nP -space. The following matrix elements of the Hamiltonian are taken: a11 = −4, a22 = −2,\na33 = 3, a12 = 2, a13 = −5 and a23 = 3.5, in arbitrary units. The exact eigenvalues (squares)\nand the ones of the energy averaged Hamiltonian H̄ (circles) are shown. They correspond to the\nintersections with the straight line E = ω + ǫ: The former with ǫ = 0, the latter with ǫ = 10.\nThe stability of the P -space eigenvalue and the upward shift of those belonging to the Q-space are\nclearly apparent.\n20\n\n10\n\n0\n\n-10\n\n-20\n-20\n\n-10\n\n0\n\nω\n\n10\n\nFIG. 3. The eigenvalues of a tri-dimensional Hilbert space: The case of a bi-dimensional\nP -space. The matrix elements of the Hamiltonian are taken as in Fig. 2. The exact eigenvalues\n(squares) correspond to the intersections of the straight line E = ω with the continuous curve. The\neigenvalues of the energy averaged Hamiltonian H̄ correspond to the intersections of the straight\nline Ē = ω + ǫ, with ǫ = 10, with the dashed curves. Note the dependence upon ǫ. The stability of\nthe P -space eigenvalue and the upward shift of the one belonging to the Q-space are again clearly\napparent.\n\n10\n\n\falso Eqs. (3.12) and (3.13) are ǫ-dependent. Yet, one again sees that for ǫ = 0 one recovers\nthe eigenvalues Ei , whereas when ǫ 6= 0 the intercepts occur for Ē0 ∼\n= E0 and Ē1 ∼\n= E1 ,\nbut for Ē2 >> E2 . Hence, we conclude that the action of the averaging distribution (2.7)\naffects very little the eigenvalues belonging to the P -space, while pushing off the ones in the\nQ-space by an amount proportional to ǫ.\nIV. ENLARGING THE P -SPACE\n\nAs in our previous work, we address in the following the problem of the ground state\nof nuclear matter, again shortly summarizing below the equations derived in Refs. [2,3]).\nIndeed, the improvements brought in by the present research are more transparently appreciated by performing the analysis borning in mind the one formerly developed.\nAs a preliminary in carrying out our task, it is necessary to define the operators P and\nQ. For this purpose the natural candidates as building blocks of the P operator appear to\nbe the eigenstates |φn i of the mean field Hamiltonian (2.13), defined by the equation\nH̄|φn i = Ēn |φn i.\n\n(4.1)\n\nTheir finding requires, however, the solution of a difficult self-consistency problem. Hence,\nin Refs. [2,3] the simpler choice had been made of viewing as building blocks of P the\nHartree-Fock (HF) variational solutions, which are trivial in nuclear matter.\nFurthermore, there, for sake of illustration, the severe limitation of a one-dimensional\nP -space was adopted by setting\nP = |χHF ihχHF |,\n\n(4.2)\n\n|χHF i being the HF ground state wave function of nuclear matter (the Fermi sphere). It was\nthen shown that, on the basis of (4.2), one derives the mean field equation\nĒ0 = EHF +\n\nβ2\n,\nĒ0 − ǫ − E\n\n(4.3)\n\nwhich relates the mean field (Ē0 ), the HF (EHF ) and the true (E) energies per particle, and\nthe fluctuation equation\n1\nE − Ē0 = ±\nE − ǭ2\n\ns\n\n2 2\nβ ,\nN2\n\n(4.4)\n\n|hψ2p-2h |V |χHFi|2 ,\n\n(4.5)\n\nwhere\nβ2 =\n\nX\n\n2p-2h\n\nthe bras hψ2p-2h | representing the two-particle–two-holes (2p-2h) states of nuclear matter,\nwhose average energy per particle is ǭ2 . We emphasize that all the quantities appearing in\nEqs. (4.3) and (4.4) are per particle, including the parameter ǫ and the residual effective\n11\n\n\finteraction V , both of which should accordingly be thought of here as being divided by the\nnuclear mass number A.\nNote also that Eq. (4.4) gives the \"error\" of the mean field energy in the first order of\nthe complexity expansion: Hence, it is contributed to only by the sector of the Q-space\nset up with the 2p-2h excitations. Actually, again for sake of simplicity, the states of the\nQ-space, although obeying well-defined, coupled differential equations (see Ref. [2]), have\nbeen assumed to be adequately represented by the HF multi-particle–multi-hole solutions,\nan approximation not impairing the orthogonality constraint P * Q = 0.\nThe sum in Eq. (4.5) is performed over the ensemble of the 2p-2h excited states lying\nin an appropriate energy range (in Refs. [2,3] taken to be fixed essentially by the parameter\nǫ), whose number N2 can be computed using the Ericson's formula [8] for the density of the\nspin J N-particle–N-hole nuclear states, namely\n(N )\n\nρph (E, J) =\n\ng(gE)N −1\n2J + 1\n√\nexp[−(2J + 1)2 /(8Nσ 2 )],\np!h!(N − 1)! 8πσ 3 N 3/2\n\n(4.6)\n\nwhere\n3A\ng=\n2 ǫF\n\n2\n\nσ =F\n\nand\n\ns\n\nE 1\n,\na h̄2\n\n(4.7)\n\nF being the nuclear moment of inertia, ǫF the Fermi energy, a = A/8 MeV−1 and E the\nexcitation energy of the system.\nNow, Eqs. (4.3) and (4.4), because of the double sign appearing in the latter, set up two\nsystems, each one including two equations, in two unknowns. Two options are possible in\nselecting the latter: One can choose either the ground state mean field and true energies per\nparticle, i. e. Ē0 and E, - assuming the matrix elements of the residual effective interaction\nto be under control, - or Ē0 and β 2 , when E is experimentally known, - which is indeed\nthe case in nuclear matter.\nThe latter is the course we followed (and continue to follow in the present work) requiring\nthe coincidence of the two Ē0 obtained by solving the two systems separately. Actually, and\nnotably, both systems lead to the same formal expression for the mean field energy per\nparticle, namely\nq\n1\nĒ0 =\n(EHF + E + ǫ) − (EHF − E − ǫ)2 + 4β 2 ,\n2\n\u001b\n\n\u001a\n\n(4.8)\n\nwhich holds valid for ǫ < EHF − E, the right hand side of this inequality being positive\nbecause of the variational principle. The above, when β 2 → 0, yields\nĒ0 = E + ǫ,\n\n(4.9)\n\nin accord with (2.14), but also with (4.4), which, for V → 0, gives Ē0 = E, entailing\nthat when the residual effective interaction vanishes no fluctuations occur and hence the\nparameter ǫ should vanish as well.\nOn the other hand, the two systems yield two different expressions for the sum of the\nmatrix elements of the residual effective interaction squared, i. e.\n12\n\n\fβl2\n\n=\n\nEl − ǭ2\nN2 /2\n2\n\nq\n\n+\n\ns\n\u0014\n\n\u001a\u0014\n\nEl (1 +\n\nEl (1 +\n\nq\n\nN2 /2) − (ǫ +\n\nq\n\nN2 /2) − (ǫ +\n\nq\n\nN2 /2ǭ2 ) − EHF\n\nq\n\nN2 /2ǭ2 ) − EHF\n\n\u00152\n\n\u0015\n\n\n\n\n+ 4ǫ(El − EHF )\n\nand\nβu2 =\n\nq\n\nN2 /2\n+\n\nEu − ǭ2\n2\n\ns\n\u0014\n\n\u001a\u0014\n\nEu (−1 +\n\nEu (−1 +\n\nq\n\nq\n\nN2 /2) − (−ǫ +\n\nN2 /2) − (−ǫ +\n\nq\n\nN2 /2ǭ2 ) + EHF\n\nq\n\nN2 /2ǭ2 ) + EHF\n\n\u00152\n\n(4.10a)\n\n\n\n\u0015\n\n\n\n\n+ 4ǫ(Eu − EHF ) ,\n\n(4.10b)\n\n\n\nboth of which vanish in the limit ǫ → 0, in accord with the previous discussion.\nFormula (4.10a), solution of the first system of equations (the one with the \"+\" sign\non the right hand side of (4.4)), yields the value of the energy dependent quantity (4.5)\n(here denoted by βl2 ) on the lower border of the energy band expressing the fluctuations of\nthe ground state energy E (and thus encompassing Ē0 ). Formula (4.10b), solution of the\nsecond system of equations (the one with the minus sign on the right hand side of (4.4)),\nprovides instead (4.5) (here denoted by βu2 ) on the upper border of the band (remember that\nE − ǭ2 < 0).\nOf course, of the energy per particle E we only know the experimental value, not the\nvalues on the borders of the band: As a consequence, we can only surmise the width W of\nthe latter, thus providing two different inputs for the energy E appearing on the right hand\nside of (4.10), namely Eu = E + W/2 and El = E − W/2. However, we can then explore\nwhether,for a given W , a value for the parameter ǫ can be found (not too large, not too\nsmall) such to have the two mean field energies per particle to coincide. If and when this\nsearch succeeds, then an orientation on W (or, equivalently, on the size of the fluctuations\nof the ground state energy) can be gained.\nIt is of importance to realize that the very existence of this scheme stems from the\noccurrence of the same quantity β 2 in both (4.3) and (4.4). This, in turn, is due to an\napproximation introduced in Ref. [3]: It will be further discussed in Appendix A.\nWe now improve upon the above approach by first letting the projector P to encompass,\nbeyond the ground state, the 2p-2h excitations of the HF variational scheme as well. Thus,\ninstead of Eq. (4.2), we shall write\nP = |χHF ihχHF| +\n\nX\nβ\n\n2β\n|χ2β\nHF ihχHF |,\n\n(4.11)\n\nwhere the sum is meant to be extended to the whole set of 2p-2h HF excitations |χ2β\nHF i.\nWith the choice (4.11) the mean field Hamiltonian (2.13) is then defined and one can\ncompute the mean field ground state energy per particle, Ē0 = hφ0 |H̄|φ0 i, using for the ket\n|φ0 i the expression\n|φ0 i = s0 |χHFi +\n\nX\nγ\n\n13\n\nsγ2 |χ2γ\nHF i,\n\n(4.12)\n\n\fand accounting for the influence of the Q-space on the ground state mean energy per particle\nin first order of the complexity expansion, i. e. by setting\nQ=\n\nX\nγ\n\n4γ\n|χ4γ\nHF ihχHF |,\n\n(4.13)\n\nwhere the sum runs over the whole set of the HF 4p-4h excitations. In (4.12) s0 and sγ2\nare complex coefficients, fixed, in principle, by Eq. (4.1) and satisfying the normalization\ncondition\n|s0 |2 +\n\nX\nγ\n\n|sγ2 |2 = 1.\n\n(4.14)\n\nAfter straightforward, but lengthy, algebra using (4.12) and (4.13) one finally arrives at the\nfollowing new mean field equation\nĒ0 = |s0 |2 EHF +\n\nX\nγ\n\n2γ\n∗\n|sγ2 |2 hχ2γ\nHF |H|χHF i + 2s0\n\nX γ\n1\n2γ 2\n|s |2 |hχ4β\n+\nHF |V |χHF i| ,\nĒ0 − ǫ − E βγ 2\n\nX\nγ\n\nsγ2 hχHF |V|χ2γ\nHF i +\n(4.15)\n\nV being the bare NN potential.\nNotably, the above equation turns out to formally coincide with (4.3). Indeed, one\nrecognizes in the first three terms on the right hand side of Eq. (4.15) just the mean value\nof the original bare Hamiltonian H in the state |φ0i, given in (4.12). In the thermodynamic\nlimit characterizing nuclear matter what survives out of these pieces is just the HF energy,\nsince the correction to the latter due to a finite number of particle-hole excitations goes to\nzero when divided, - in order to get the energy per particle, - by the infinite number of\nparticles in the system: In other words, the 2p-2h admixture into (4.12) does not change the\nexpectation value of the Hamiltonian.\nHence, defining\nζ2 =\n\nX\nβγ\n\n2γ 2\n|sγ2 |2 |hχ4β\nHF |V |χHF i| ,\n\n(4.16)\n\n(4.15) can be recast into the form\nĒ0 = EHF +\n\nζ2\n,\nĒ0 − ǫ − E\n\n(4.17)\n\nwhose similarity with Eq. (4.3) is transparent.\nThe same will take place for any admixture of Np-Nh HF excited states in |χHF i: Hence,\nin our framework different choices of the projection operator P lead to the same structure\nfor the mean field equation for nuclear matter. This invariance does not hold in finite nuclei.\nThe only, of course important, difference between (4.5) and (4.16) is that in the latter\nthe residual interaction V induces transitions from 2p-2h to 4p-4h states, rather than from\nthe Fermi sphere to the 2p-2h states.\nConcerning the fluctuation equation one can again use (2.20), with the state |φ0 i given\nnow by Eq. (4.12). Then invoking the randomness of the phases of the Q-space wave\n14\n\n\ffunctions (RPA) and proceeding exactly as previously done in [2,3], one deduces the new\nfluctuation equation\n1\nE − Ē0 = ±\nE − ǭ4\n\ns\n\n2 2\nζ ,\nN4\n\n(4.18)\n\nwhere ǭ4 denotes the average energy per particle of the 4p-4h HF states. In (4.18), N4\nrepresents the number of 4p-4h excitations contributing to the sum over the index β in\n(4.16).\nHence, the \"formal invariance\", with respect to the choice for the projector P , holds for\nboth the equations at the core of our statistical approach to nuclear matter in first order of\nthe complexity expansion.\nIndeed, the inclusion of Np-Nh states (with N > 2) into the P -space would merely imply\nthe replacement, in (4.18), of N4 with NN +2 and, at the same time, to have ζ 2 defined in\nterms of the matrix elements of V between Np-Nh and (N +2)p-(N +2)h states. In addition,\none should of course insert in the energy denominator the average energy per particle of the\n(N + 2)p-(N + 2)h HF states.\nTherefore, in this connection one clearly sees that the extension of the P -space rapidly\nleads to the vanishing of the fluctuations, owing to the very fast increase of the number NN .\nHowever, it should be realized that Eq. (2.20), as it stands, is not in general a good\nstarting point to derive the fluctuation equation. Indeed, it selects out only one term in the\nspectral decomposition of the operator 1/(E − H̄), which, as already pointed out, is justified\nfor a one-dimensional P -space, but not so for a multidimensional one. Hence, we depart\nfrom our past work [2,3], not only by employing Eq. (4.11), but also by writing, in place of\n(2.16),\n|P ψi = |φ0 i\n\nhφ0 |VP Q|Qψi\nhφ2 |VP Q|Qψi\n1\n+ |φ2 i\n+\nE − Ē0\nE − Ē2\nE − H̄\n\u0012\n\n\u0013′′\n\nVP Q |Qψi,\n\n(4.19)\n\nwith an obvious meaning of the double primed operator in the last term on the right hand\nside. Clearly, Eq. (4.19) does not follows directly from (4.11), but it assumes that in the\nspectral decomposition of the (E − H̄)−1 operator only one prominent (collective) state |φ2 i\nenters beyond the ground state |φ0 i.\nSticking to this model, instead of Eq. (2.18), we likewise use\n|Qψi =\n\n1\n(2)\n\nE − hQQ\n\nVQP {|φ0 ihφ0 |P ψi + |φ2ihφ2 |P ψi} ,\n\n(4.20)\n\nbeing\n(2)\n\nhQQ = HQQ + VQP\n\n\u0012\n\n1\nE − H̄\n\n\u0013′′\n\nVP Q .\n\n(4.21)\n\nThen, by left multiplying (4.19) (with E = E0 ) by hφ0 | and using (4.20), we obtain\nE0 − Ē0 = hφ0 |VP Q\n\n1\nE0 −\n\n(2)\nhQQ\n\nVQP |φ0 i + hφ0 |VP Q\n15\n\n1\nE0 −\n\n(2)\nhQQ\n\nVQP |φ2 i\n\nhφ2 |P ψi\n,\nhφ0 |P ψi\n\n(4.22)\n\n\fwhich generalizes Eq. (2.20).\nIn a perfectly analogous fashion, by left multiplying (4.19) (with E = E2 ) by hφ2 | and\nusing (4.20), we obtain\nE2 − Ē2 = hφ2 |VP Q\n\n1\n(2)\n\nE2 − hQQ\n\nVQP |φ2 i + hφ2 |VP Q\n\n1\n(2)\n\nE2 − hQQ\n\nVQP |φ0 i\n\nhφ0 |P ψi\n.\nhφ2 |P ψi\n\n(4.23)\n\nIn the above, E0 and E2 stand for the first two exact eigenvalues of the Schroedinger equation;\nĒ0 and Ē2 for the corresponding quantities associated with Eq. (4.1). Of course, Eq. (4.23)\nhas no counterpart in our previous work: Here, it shows that, in our frame, all the energies\nof the P -space fluctuate.\nNow, the energy averaging of (4.22) and (4.23) vanishes by definition, but the energy\naveraging of their square, which yields the \"error\", does not. Hence, proceeding along the\nlines of Refs. [2,3], we subtract on the right hand side of both equations their average values,\nsquare the expressions thus obtained and make use of RPA, keeping of our expansion in the\ncomplexity of the Q-space states the first term only. Next, we exploit the structure of |φ2 i,\nwhich, like |φ0 i, must be normalized, orthogonal to |φ0 i and of the form\n|φ2 i =\n\nX\nβ\n\ncβ2 |χ2β\nHF i + c0 |χHF i.\n\n(4.24)\n\nWe thus finally arrive at the equation\n1\nE0 − Ē0 = ±\nE0 − ǭ4\n\ns\n\n2 2\n(ζ + rξ 2),\nN4\n\n(4.25)\n\nwhere the further definition\nξ2 =\n\nX\nβγ\n\n2γ 2\nsγ2 cγ2 |hχ4β\nHF |V |χHF i|\n∗\n\n(4.26)\n\nhas been introduced in addition to (4.16); moreover, we have set\nr≡\n\nhφ2 |P ψi\n.\nhφ0 |P ψi\n\n(4.27)\n\nLikewise, for the energy of the 2p-2h state of the P -space one obtains the fluctuation equation\n1\nE2 − Ē2 = ±\nE2 − ǭ4\n\ns\n\n2 2 ξ2\n(η + ),\nN4\nr\n\n(4.28)\n\nwhere, naturally,\nη2 =\n\nX\nβγ\n\n2γ 2\n|cγ2 |2 |hχ4β\nHF |V |χHF i| .\n\n(4.29)\n\nWe thus see that the fluctuation equations (4.25) and (4.28) are actually coupled through\nthe term (4.26).\n16\n\n\fConcerning the mean field equations, it is clear that, in the enlarged scheme brought\nabout by the projector (4.11) (actually, by our drastic modelling of the solutions of the\nmean field Hamiltonian (2.13) with P given by (4.11)) and by the |P ψi given in (4.19), an\nequation should exist also for the energy of the 2p-2h state. It can be derived by computing\nĒ2 = hφ2 |H̄|φ2i and, notably, it turns out to read\n(2)\n\nĒ2 = EHF +\n\nη2\n,\nĒ2 − ǫ − E2\n\n(4.30)\n\n(2)\n\nEHF representing the HF energy per particle of the system in the 2p-2h excited state. To\n(2)\nidentify this one is not necessary, since we split EHF into a part associated with the HF\nground state and a part associated with the 2p-2h excitation energies, both per particle.\nSince the latter vanishes in the thermodynamic limit, - as previously noted in commenting\n(2)\nEq. (4.15), then EHF = EHF , a relation we expect to be approximately fulfilled also in a\nheavy nucleus.\nWe conclude from the above analysis that our approach leads to a set of mean field\nequations, one for each of the states lying in the P -space: These equations, unlike the\nfluctuation ones, are not coupled.\nV. NORMALIZATION AND FLUCTUATION OF THE P -SPACE GROUND\nSTATE WAVE FUNCTION\n\nIn our framework one could identify the ground state spectroscopic factor S with the\nsquare root of the norm of |P ψi, the system's ground state wave function projection in P space. To work out an explicit expression for S we commence by exploiting the completeness\nof the normalized eigenstates of H̄. Hence we write\nS 2 ≡ hP ψ|P ψi =\n\nM\nX\n\nhP ψ|φn ihφn |P ψi = 1 − hQψ|Qψi.\n\n(5.1)\n\nn=0\n\nNow, if we confine ourselves to set M = 1, as in Refs. [2,3], then the Eq. (2.18) for |Qψi is\nwarranted and we rewrite (5.1) as follows\nS 2 = 1 − hφ0 |VP Q\n\n1\nVQP |φ0 i|hφ0|P ψi|2.\n2\n(E0 − hQQ )\n\n(5.2)\n\nMoreover, since the choice M = 1 clearly entails\nS 2 = |hφ0|P ψi|2,\n\n(5.3)\n\nby exploiting (2.20) Eq. (5.2) can be recast into the form [2,3]\n2\n\nS =1+S\n\n2\n\n\"\n\n#\n\nE0 − Ē0\nd\n.\n(E0 − Ē0 ) +\ndE0\nĒ0 − ǫ − E0\n\nFinally, employing (4.8) the expression, previously obtained in [2,3],\n17\n\n(5.4)\n\n\f−1\n\n\n\nǫ\n3 1 EHF − E0 − ǫ − 2dβ 2/dE0\n\n+\nS2 =  + q\n2 2 (EHF − E0 − ǫ)2 + 4β 2\nĒ0 − ǫ − E0\n\n(5.5)\n\nfollows, in which the energy derivative of the sum of the square moduls of the vacuum–2p2h matrix elements of the effective interaction appears (its explicit expression is given in\nRef. [3]). Note that (5.5) goes to one as β 2 → 0, as it should.\nIf, however, the expression (4.20) for the Q-space wave function is used, then, rather\nthan (5.2), one obtains for the ground state spectroscopic factor\nS 2 = 1 − |hφ0|P ψi|2hφ0 |VP Q\n\n1\n(E0 −\n\n−hφ0 |P ψihφ2|P ψi∗hφ2 |VP Q\n−hφ0 |P ψi∗ hφ2 |P ψihφ0|VP Q\n\nVQP |φ0 i − |hφ2 |P ψi|2hφ2 |VP Q\n\n(2)\nhQQ )2\n\n1\n(2)\n\nVQP |φ0 i\n\n(2)\n\nVQP |φ2 i.\n\n(E0 − hQQ )2\n1\n(E0 − hQQ )2\n\n1\n(2)\n\n(E0 − hQQ )2\n\nVQP |φ2 i\n\n(5.6)\n\nThe above, with the help of Eqs. (4.22) and (4.23), and assuming\n1\nE0 −\n\n(2)\nhQQ\n\n1\n\n≈\n\n(2)\n\nE2 − hQQ\n\n,\n\n(5.7)\n\ncan be further elaborated and one ends up with the expression\n#\n\n\"\n\nd(Ē2 − Ē0 )\n+ Ē2 − Ē0\n|hφ2|P ψi|2\n1−\ndE\nĒ\n−\nǫ\n−\nE\n0\n0\n0\nS2 =\n,\ndĒ0\nǫ\n1+\n+ dE\nĒ0 − ǫ − E0\n0\n\n(5.8)\n\nwhich reduces to (5.4), as it should, if hφ2 |P ψi → 0, i. e. for a one-dimensional P -space.\nSince, from Eq. (4.27),\n|hφ2 |P ψi|2 =\n\nr2\nS 2,\n2\n1+r\n\n(5.9)\n\nthen Eq. (5.8) can be recast as follows\n\u0011\n1\nr2 \u0010\n1\nS = 1+\nǫ+\nĒ\n−\nĒ\n+\n2\n0\n2\nĒ0 − ǫ − E0\n1+r\n1 + r2\n2\n\n(\n\n\"\n\n#\n\ndĒ2\ndĒ0\n+ r2\ndE0\ndE0\n\n!)−1\n\n,\n\n(5.10)\n\nwhich again reduces to (5.4) as r → 0.\nWe now address the problem of the fluctuation of |P ψi. For this scope, we focus on the\nground state and, by combining Eqs. (2.10) and (2.15), we obtain\n(E − H̄)[|P ψi − |hhP ψiii] + (E − Ē0 )|hhP ψiii = VP Q |Qψi\n(the angle brackets meaning energy averaging).\n18\n\n(5.11)\n\n\fThen, if use is made of the expression (2.18) for |Qψi and of the spectral decomposition\nof the operator (E − H̄)−1 , one gets\n|P ψi − |hhP ψiii =\n\n1\n1\nhφn |VP Q\nVQP |φ0 ihφ0|P ψi\nE − Ēn\nE − hQQ\n1\n1\n|φ0ihφ0 |VP Q\nVQP |φ0 ihφ0|P ψi\n+\nE − Ē0\nE − hQQ\nX\n1\n−(E − Ē0 )\n|φn ihφn |hhP ψiii.\nn E − Ēn\nX′\n\n|φn i\n\n(5.12)\n\nNow, since |hhP ψiii ∝ |φ0 i, from the above finally it follows\n|P ψi − |hhP ψiii = (1 − |φ0 ihφ0 |)−1\n= hφ0 |P ψi\n\n\u0012\n\n\u0012\n\n1\nE0 − H̄\n\n1\nE − H̄\n\u0013′\n\nVP Q\n\n\u0013′\n\nVP Q\n\n1\nVQP |φ0 ihφ0 |P ψi\nE − hQQ\n\n1\nVQP |φ0 i,\nE0 − hQQ\n\n(5.13)\n\nwhich vanishes when P is given by (4.2), since clearly |P ψi does not fluctuate in a onedimensional P -space.\nIf, on the other hand, P is given by Eq. (4.11), then the above can be computed, in first\norder of the complexity expansion, using (4.12) for |φ0 i, (4.24) for |φ2 i and (4.13) for Q.\nOne ends up with the expression (we set E = E0 to conform to previous notations)\n[|P ψi − |hhP ψiii]1 = hφ0 |P ψi\n\nc∗2β s2β ′\n|φ2 i X 2β\n2β ′\n4γ\ni\nhχHF |V |χ4γ\nHF\n4γ hχHF |V |χHF i,\nE0 − Ē2 ββ ′ γ\nE0 − ǫHF\n\n(5.14)\n\nwhich can be further simplified invoking the randomness of the phases of the wave functions\nin the Q-space and again introducing the average energy per particle ǭ4 for the 4p-4h HF\nexcited states. Then, with the help of Eq. (4.26), the formula\n[|P ψi − |hhP ψiii]1 =\n\nhφ0 |P ψi\n|φ2 iξ 2\n(E0 − Ē2 )(E0 − ǭ4 )\n\n(5.15)\n\nis derived. It gives the fluctuations of the wave function in first order of the complexity\nexpansion.\nNotice that here the scalar product hφ0 |P ψi, unlike in Refs. [2,3], does not coincide with\nthe spectroscopic factor S, as defined in (5.1), since Eq. (5.15) has been obtained using an\nenlarged P -space. Rather, it measures the amount of the true ground state wave function\nof the system embodied in the mean field state |φ0i.\nVI. RESULTS FROM A SCHEMATIC MODEL\n\nThe numerical implementation of the formalism described in the previous Sections represents a challenging task.\nTherefore, as a first step toward this goal, we develop here a version of our approach\nthat, while simpler, has the merit of being amenable to numerical results.\n19\n\n\fTo start with, because to solve Eq. (4.1), with the projector P given by (4.11), is a major\ntask, we assume the two lowest solutions of the latter to be of the form\n|φ0 i = s0 |χHF i + s2 |χ2p-2h\nHF i\n\n(6.1a)\n\n|φ2 i = −s2 |χHFi + s0 |χ2p-2h\nHF i,\n\n(6.1b)\n\nand\n\nwhere s20 + s22 = 1. Of course, s2 remains to be fixed.\nThis assumption corresponds to take in the sum on the right hand side of (4.11) one\nterm only and places all the strength of the 2p-2h eigenstates of H̄ in a single mode. Then,\nby defining\nμ2 =\n\nX\nγ\n\n2p-2h 2\n|hχ4γ\nHF |V |χHF i| ,\n\n(6.2)\n\nthe expressions (4.16), (4.26) and (4.29) can be recast as follows\nζ 2 = s22 μ2\n\n(6.3a)\n\nq\n\n(6.3b)\n\nξ 2 = s2 1 − s22 μ2\n\nη 2 = (1 − s22 )μ2 ,\n\n(6.3c)\n\nwhere, beyond μ2 , only the coefficient s2 enters.\nAccordingly, the mean field and the fluctuations equations now read\ns22 μ2\nĒ0 − ǫ − E0\n(1 − s22 )μ2\n(2)\nĒ2 = EHF +\nĒ2 − ǫ − E2\nĒ0 = EHF +\n\n(6.4a)\n(6.4b)\n\nand\ns\n\nq\n2\nμ2\n2\nE0 − Ē0 = ±\n(s ± rs2 1 − s22 )\nN4 E0 − ǭ4 2\n\n(6.5a)\n\nE2 − Ē2 = ±\n\n(6.5b)\n\ns\n\n1 q\nμ2\n2\n(1 − s22 ± s2 1 − s22 ),\nN4 E2 − ǭ4\nr\n\n(2)\n\nwhere EHF and ǭ4 have been previously defined. We thus see that each dimension added to\nthe P -space entails the occurrence of two new systems in two equations. Furthermore, the\ndouble sign inside the round brackets on the right hand side of Eqs. (6.5) corresponds to the\ntwo options one has in choosing s0 , namely\nq\n\ns0 = ± 1 − s22 .\n\n(6.6)\n\nAlthough the above equations are strictly valid in the thermodynamic limit only (A →\n∞), we shall make an heuristic use of them also for the nucleus A = 208, which is of course\nfinite, but large.\n20\n\n\fConcerning the ground state spectroscopic factor (5.10), in the present model the energy\nderivative appearing in S 2 is easily found (from (6.4)) to read\ndĒ0\n1 1 EHF − E0 − ǫ − 2d(s22 μ2 )/dE0\nq\n= +\n,\ndE0\n2 2\n(EHF − E0 − ǫ)2 + 4s22 μ2\n\n(6.7)\n\nwhere account is taken of the energy dependence of the coefficient s2 .\nIn accord with the general theory previously discussed, both Ē0 and Ē2 lie inside an\nenergy band expressing the \"error\" they are affected by. In conformity, also the ground\nstate spectroscopic factor should be computed on the lower and upper borders of the ground\nstate energy band: Hence, we need to compute on both boundaries Eq. (6.7), which in turn\nrequires the knowledge of the energy derivative of the quantity (s2 μ)2 .\nFor this purpose, in principle one should use the residual effective interaction on the\nlower boundary, which is found to be\ns22 μ2l = d0\n\nE0l − ǭ4 n l\nE0 (1 + d0 ) − ǫ − d0 ǭ4 − EHF\nq2\no\n+ [E0l (1 + d0 ) − ǫ − d0 ǭ4 − EHF ]2 + 4ǫ(E0l − EHF ) ,\n\n(6.8a)\n\nand on the upper one, where it reads\ns22 μ2u = d0\n\nhaving set\n\nE0u − ǭ4 n u\nE0 (−1 + d0 ) + ǫ − d0 ǭ4 + EHF\nq2\no\n+ [E0u (−1 + d0 ) + ǫ − d0 ǭ4 + EHF ]2 + 4ǫ(E0u − EHF ) ,\n\nd0 =\n\ns\n\nN4\n1\nq\n2 1 + r 1 − s22 /s2\n\n(6.8b)\n\n(6.9)\n\n(the double sign stemming from (6.6)), and where, as usual, E0l and E0u are the true ground\nstate energies on the lower and upper borders of the band: As already discussed, these are\nexpressed in terms of the band's width W .\nHowever, in practice, owing to the energy dependence of both the residual effective interaction μ and the coefficient s2 appearing in the ground state mean field wave function,\nthe energy derivative of (6.8) turns out to be very cumbersome to carry out. Accordingly,\nwe evaluated numerically all the derivatives with respect to the exact ground state energy\nE0 entering into theqexpression (5.10) for S 2 .\nNote that d0 → N4 /2 when r → 0: One thus formally recovers in this limit the results\nof a one-dimensional P -space [3].\nIn solving the systems of equations (6.4a)–(6.5a) and (6.4b)–(6.5b) we have chosen in\n(6.6) the plus sign. The other option need not be considered because it will provide the\nsame results, but for the change of sign of s2 . Indeed, our equations are clearly invariant\nunder the simultaneous transformations s0 → −s0 and s2 → −s2 , as it should be as the\nlatter simply correspond to a change of phase in the states (6.1).\n21\n\n\fConcerning the other quantities needed in our equations, we have assumed for the binding\nenergy per particle of nuclear matter\nE0 = −16 MeV\n\n(6.10a)\n\nE2 = −14.8 MeV\n\n(6.10b)\n\nfor the ground state and\n\nfor the 2p-2h \"collective\" excited state. The latter value is hinted by the calculations of\nthe (γ, nn) and (γ, pp) photo-absorption cross-sections in nuclei [9] (n being a neutron, p a\nproton).\nFor the HF energies per particle we have taken\nEHF = −12 MeV\n(2)\n\nEHF = −11.96 MeV\nǭ4 = −11.92 MeV.\n\n(6.11a)\n(6.11b)\n(6.11c)\n\nThe first of the above actually corresponds to a typical BHF outcome (see, e. g., Ref. [10]).\nThe other two stem from the minimal energy (∼\n= 4 MeV) of a ph excitation in a Wood-Saxon\nwell with parameters adjusted for the nucleus P b208 [11].\nThe choice of a minimal ph energy has been made:\na) because the only solution of our schematic model obtains with the residual effective\ninteraction weakened by an order of magnitude with respect to the bare one: Hence\nthe latter can only effectively connect with the lowest 4p-4h excitations (see the results\nbelow);\nb) because only with the minimal excitation energy of the 4p-4h states Eq. (4.6) provides a\nnumber of states in an energy range set by ǫ still compatible with non-trivial fluctuation\nequations (6.5).\nIn connection with the point b) we have limited ourselves to use formula (4.6) for 4p4h excited states with angular momentum J = 0. It should also be added that one can\nlegitimately question the validity of (4.6), which is deduced in the framework of a Fermi gas\nby purely combinatorial methods.\nWith the energies per particle above quoted, - which should clearly be viewed as merely\norientative but for (6.10a), - we have solved the pair of systems corresponding to Eqs. (6.4a)\nand (6.5a) and, as well, the one corresponding to Eqs. (6.4b) and (6.5b), fulfilling the equal\nmean field constraint in both cases. In addition, for sake of simplicity, we have required the\nnucleons' residual effective interaction μ to come out the same in both instances in accord\nwith the schematic nature of our model.\nOur findings for Ē0 , Ē2 , μ2l and μ2u and for the ground state spectroscopic factor are\ndisplayed in Table I. These results have been obtained for a specific choice of ǫ, which\nfulfills the inequalities 0 ≤ ǫ ≤ EHF − E = 4 MeV, s2 and r. Notably, in order to find a\nsolution one has to restrict these parameters to a rather narrow range around the values\n22\n\n\fĒ0 (MeV)\n-16.001\n\nĒ2 (MeV)\n-15.901\n\nμ2l (MeV2 )\n25\n\nμ2u (MeV2 )\n26\n\nSl\n1.016\n\nSu\n1.000\n\ns2\n0.71\n\nǫ (MeV)\n3.2\n\nr\n1.02\n\nTABLE I. The solution of the schematic model\n\nquoted in the Table. Also the band width W cannot be much larger then 0.1 MeV in order\nto get a solution. The numbers in Table I correspond to the choice W = 0.1 MeV.\nAlthough we consider the outcomes of this model as merely orientative and without any\npretense of being in touch with the real physics, both because of the crudeness of the model\nitself and because of the uncertainties affecting our inputs, yet they are worth a few remarks.\nFirst, the eigenstates of the mean field Hamiltonian H̄ appear to have equal projections\non the two vectors spanning the bi-dimensional P -space of our model, as it follows from the\nvalues we have found for s2 .\nSecond, it is clear that, with respect to our past work with a one-dimensional P -space, a\nreduction of the error affecting the mean field energy was to be expected. It turned out to\namount to an order of magnitude. This fact points to a fast convergence of the complexity\nexpansion or, alternatively, to a contribution of the 6p-6h excitations to the binding energy\nper particle (in nuclear matter) of less then 1%. This estimate is of course very rough: In\nfact, the magnitude of the error arises not anly from the dimensions of the P -space, but\nas well from the proximity of the HF (or BHF) solution to the experimental value of the\nbinding energy per particle.\nThird, the massive reduction of the residual effective interaction as compared to the\nbare one, already found in Refs. [2,3], is here confirmed. Unfortunately, in our past work\nwe had overlooked a factor of A (the interaction under consideration is per particle): The\nquenching there predicted was accordingly wrong, but still should be quantified in one order\nof magnitude (see Appendix B).\nFinally, a comment is in order on the spectroscopic factor S. For this purpose we write, in\nterms of the states |χHF i and |χ2p-2h\nHF i (or, alternatively, |φ0 i and |φ2 i) spanning our P -space,\n2p-2h\n|P ψi = |χHF ihχHF|ψi + |χ2p-2h\nHF ihχHF |ψi\n= |φ0 ihφ0|P ψi + |φ2 ihφ2 |P ψi.\n\n(6.12)\n\nFrom the above and (6.1) it follows easily\nhφ0 |P ψi = hχHF |ψis0 + hχ2p-2h\nHF |ψis2\nhφ2 |P ψi = −hχHF |ψis2 +\n\nhχ2p-2h\nHF |ψis0 .\n\n(6.13)\n(6.14)\n\nInverting these equations and exploiting (4.27), we obtain\nhχHF |ψi = hφ0 |P ψis0 − hφ2|P ψis2 = hφ0 |P ψi(s0 − rs2 )\nhχ2p-2h\nHF |ψi = hφ0 |P ψis2 + hφ2 |P ψis0 = hφ0 |P ψi(s2 + rs0 ).\nHence, with the values for s2 and r quoted in Table I, we conclude that\n23\n\n(6.15a)\n(6.15b)\n\n\fhχHF |ψi ∼\n= 0,\n\n∼\nhχ2p-2h\nHF |ψi = 1,\n\n(6.16)\n\nan outcome we are hardly ready to view as realistic.\nOn the other hand, taking the minus sign inside the round brackets in the fluctuation\nequations (6.4) and also in (6.9) (which amounts to the substitution s2 → −s2 ), we get\nhχHF |ψi ∼\n= 1,\n\n∼\nhχ2p-2h\nHF |ψi = 0,\n\n(6.17)\n\nwhich, while drastic , appears to provide a physical picture more consistent with the simple\nmodel we are employing. In fact, the above results hold because hφ0 |P ψi ∼\n= 1, which follows\nfrom the normalization condition\n|hφ0 |P ψi|2 + |hφ2 |P ψi|2 = 1\n\n(6.18)\n\nand from the finding that r ∼\n= 1. Clearly, both (6.16) and (6.17) lead to a value of one for\nthe spectroscopic factor S, that is the result we have found.\nThe two radically different solutions (6.16) and (6.17) can be reconciled through\nEq. (5.15). The latter, indeed, when implemented in our schematic model, yields for the\nfluctuations of the ground state wave function\n[|P ψi − |φ0i]1 ∼\n= |φ2i.\n\n(6.19)\n\nLikewise, by either simmetry arguments or explicit calculation, one can get for the collective\n2p-2h excited state\n[|P ψ2p-2h i − |φ2 i]1 ∼\n= |φ0 i.\n\n(6.20)\n\nThus, it appears that, in the schematic model presented in this Section, while the fluctuation\nof the energy is puny, the fluctuation of the wave function is the largest possible. This\ncorrelation is worth being explored in more realistic models.\nIn conclusion, it appears warranted to view the scalar product hφ0 |P ψi - which is\ninformative on how much of the true ground state wave function of the system is embodied\nin the corresponding mean field one, - as a better representative of S: In this last instance,\nwe would obtain S ∼\n= 0.7.\nVII. CONCLUSIONS\n\nIn this paper we have first shortly revisited the statistical theory of the ground and\nexcited collective states of general many-body systems developed in Refs. [1–3].\nNext we have presented an improved version of the approach by allowing for a P -space\nwith larger dimensions than in Refs. [2,3]. In applying this new framework to nuclear\nmatter we have obtained both the mean field energies and the fluctuations (the \"error\") of\nboth energies and wavefunctions. This has been done in first order of the expansion in the\ncomplexity of the states of the Q-space, which, in our scheme, hosts the random aspects of\nthe nuclear dynamics. Notably, the extension of the P -space allows to acknowledge the fast\nrate of convergence of the complexity expansion, due to the rapid growth of the nuclear level\ndensity with the excitation energy.\n24\n\n\fFinally, as a first step toward the testing of the theory on the physics of the atomic nuclei\nwe have worked out a schematic model that renders the approach amenable to numerical\npredictions. While rough, the model has nevertheless helped us in clarifying basic aspects\nof our statistical approach.\nIn conclusion, we feel the duty to state that the statistical approach here presented germinated out of the ideas discussed by Herman Feshbach in Ref. [1]. It has been subsequently\npursued by him in collaboration with us in Refs. [2,3] and in this work.\nACKNOWLEDGMENTS\n\nThis work has been partially supported by the INFN-MIT \"Bruno Rossi\" Exchange\nProgram. Discussions with Prof. H. A. Weidenmüller are gratefully acknowledged.\nAPPENDIX A:\n\nThe derivation of the coupled equations at the basis of the present approach is possible\nbecause the same quantity β 2 occurs in both (4.3) and (4.4). This occurrence stems from\nan approximation introduced in Ref. [3], namely\nXD\nβγ\n\n≈ 2A\n\nED\n\nhψ2β |V |φ0i∗ hψ2γ |V |φ0 i\n\n\nE X D\n\n\nX D\n\n\nβγ\n\nhψ2β |V |φ0ihψ2γ |V |φ0 i∗\n\nhψ2β |V |φ0 i∗ hψ2γ |V |φ0 i\n\n\n\nβγ\n\nE\nE\n\nhψ2β |V |φ0 i∗ hψ2γ |V |φ0 i .\n\n(A1)\n\nIn the above, the operator A corresponds to the arithmetic mean of the quantity within\nthe angle brackets over the set of the 2p-2h states in the energy interval ǫ centered around\nǭ2 (actually, one should take the real part of the right hand side of the previous equation:\nHowever, for the sake of the argument we shall consider real quantities).\nThis approximation gives reasonable results if the matrix elements are roughly of the\nsame order of magnitude: This is the reason why the sum in (A1) is limited to an energy\ninterval around the mean 2p-2h energy where the matrix elements are relevant.\nWe give here a few calculable examples that prove the above statement\n\n\n 0.725,\n\n(A2)\n\n\n\n 0.636,\n\n(A3)\n\n\n\n 2.311,\n\n(A4)\n\nN = 10\nN n=1 sin(n)\n= 0.746, N = 100\nP\n2 2\n\n2[ N\n\nn=1 sin(n) ]\n0.750, N = ∞\nPN\n\n4\n\nN = 10\nN n=1 n\n0.663,\nN = 100\n=\nP\n2\n\n2[ N\n\nn=1 n]\n2/3, N = ∞\nPN\n\n2\n\nN = 10\nN n=1 exp(−n)\n=\n23.11,\nN = 100 .\nPN\n\n2[ n=1 exp(−n)]2 \n∞,\nN =∞\nPN\n\n2\n\nWere the approximation exact, then the above ratios should evaluate to one.\n25\n\n\fAPPENDIX B:\n\nWe report in the following the expression for β 2 , - the sum of the square of the vacuum\n→ 2p-2h matrix elements, - for the schematic interaction employed in Refs. [2,3], that is\nV(r) = gA\n\ne−μA r\ne−μB r 1 + Px\n− gB\n,\nr\nr\n2\n\n(B1)\n\nPx being the exchange operator in coordinate space.\nFollowing the Appendix B of Ref. [2], β 2 can be recast as the combination of direct and\nexchange contributions such as\n2\nβdir\n\n(\n\n1\n̺\n(μ̃A arctan μ̃A − μ̃B arctan μ̃B )\n=A\n2\n4kF μ̃A − μ̃2B\n1\n1\n9 17\n+ + (μ̃2A + μ̃2B ) + (μ̃4A + μ̃4B ) + μ̃2A μ̃2B\n5 12\n4\n4!\n\"\n!#)\n1\n1\n1\n1\n3\n2 2\n3\n2 2\n+ 2\nμ̃ (3 + μ̃B ) arctan\n− μ̃A (3 + μ̃A ) arctan\n4 μ̃A − μ̃2B B\nμ̃B\nμ̃A\n\n(B2)\n\n(B3)\n\nand\n2\nβexc\n=A\n\n2\nπ4̺\n\nZ\n\n0\n\n∞\n\ndq\n\nq\n2\nμA + q 2\nq\n\nZ\n\n∞\n0\n\ndr\n\nn\ne−μB r\nsin(qr)\n[sin(kF r) − kF r cos(kF r)]2\nr6\nq\n\nq\n\no\n\n+[sin(kF r) − sin(r kF2 − q 2 ) − kF r cos(kF r) + r kF2 − q 2 cos(r kF2 − q 2 )]2 , (B4)\nwhere μ̃A,B = μA,B /2kF and ̺ = 2kF3 /3π 2 .\nIn the latter, a minor error in the expression reported in Ref. [2], essentially of no\nnumerical consequence, has been corrected. More importantly, the necessity of normalizing\nβ 2 to the mass number A had been overlooked in Refs. [2,3]: Hence, the previously found\nquenching of the residual effective interaction with respect to the bare one should also be\nreduced by a factor A. For example, taking 208 Pb as an orientation, the quenching would\nturn out to be of an order of magnitude.\n\n26\n\n\fREFERENCES\n[1] H. Feshbach, Phys. Rep. 264 (1996), 137.\n[2] R. Caracciolo, A. De Pace, H. Feshbach, and A. Molinari, Ann. Phys. (N.Y.) 262\n(1998), 105.\n[3] A. De Pace, H. Feshbach, and A. Molinari, Ann. Phys. (N.Y.) 278 (1999), 109.\n[4] R.B. Wiringa, S.C. Pieper, J. Carlson, and V.R. Pandharipande, Phys. Rev. C 62\n(2000), 014001.\n[5] H. Feshbach, \"Theoretical Nuclear Physics: Nuclear Reactions\", J. Wiley & Sons, New\nYork, 1992.\n[6] G. E. Brown, \"Unified Theory of Nuclear Models and Forces\", p. 30, North-Holland,\nAmsterdam, 1967.\n[7] M. Kawai, A.K. Kerman and K.W. McVoy, Ann. Phys. (N.Y.) 75 (1973), 156.\n[8] T. E. O. Ericson, Phil. Mag. Suppl. 9 (1960), 425.\n[9] S. Boffi, C. Giusti, F.D. Pacati, and M. Radici, \"Electromagnetic Response of Atomic\nNuclei\", p. 300, Oxford University Press, London, 1996.\n[10] F. Coester, S. Cohen, B. Day, and C.M. Vincent, Phys. Rev. C 1 (1970), 769.\n[11] G. Pollarolo, private communication.\n\n27\n\n\f"}