{"id": "http://arxiv.org/abs/nucl-th/0107052v1", "guidislink": true, "updated": "2001-07-18T10:23:27Z", "updated_parsed": [2001, 7, 18, 10, 23, 27, 2, 199, 0], "published": "2001-07-18T10:23:27Z", "published_parsed": [2001, 7, 18, 10, 23, 27, 2, 199, 0], "title": "Relativistic corrections in (gamma,N) knockout reactions", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=nucl-th%2F0212109%2Cnucl-th%2F0212049%2Cnucl-th%2F0212009%2Cnucl-th%2F0212070%2Cnucl-th%2F0107057%2Cnucl-th%2F0107066%2Cnucl-th%2F0107038%2Cnucl-th%2F0107016%2Cnucl-th%2F0107055%2Cnucl-th%2F0107046%2Cnucl-th%2F0107001%2Cnucl-th%2F0107072%2Cnucl-th%2F0107067%2Cnucl-th%2F0107028%2Cnucl-th%2F0107061%2Cnucl-th%2F0107059%2Cnucl-th%2F0107022%2Cnucl-th%2F0107026%2Cnucl-th%2F0107058%2Cnucl-th%2F0107030%2Cnucl-th%2F0107032%2Cnucl-th%2F0107006%2Cnucl-th%2F0107051%2Cnucl-th%2F0107044%2Cnucl-th%2F0107007%2Cnucl-th%2F0107042%2Cnucl-th%2F0107062%2Cnucl-th%2F0107036%2Cnucl-th%2F0107025%2Cnucl-th%2F0107074%2Cnucl-th%2F0107024%2Cnucl-th%2F0107012%2Cnucl-th%2F0107060%2Cnucl-th%2F0107004%2Cnucl-th%2F0107011%2Cnucl-th%2F0107040%2Cnucl-th%2F0107008%2Cnucl-th%2F0107005%2Cnucl-th%2F0107070%2Cnucl-th%2F0107003%2Cnucl-th%2F0107045%2Cnucl-th%2F0107063%2Cnucl-th%2F0107052%2Cnucl-th%2F0107047%2Cnucl-th%2F0107029%2Cnucl-th%2F0107053%2Cnucl-th%2F0107002%2Cnucl-th%2F0107023%2Cnucl-th%2F0107013%2Cnucl-th%2F0107041%2Cnucl-th%2F0107020%2Cnucl-th%2F0107048%2Cnucl-th%2F0107010%2Cnucl-th%2F0107049%2Cnucl-th%2F0107037%2Cnucl-th%2F0107033%2Cnucl-th%2F0107073%2Cnucl-th%2F0107014%2Cnucl-th%2F0107054%2Cnucl-th%2F0107035%2Cnucl-th%2F0107015%2Cnucl-th%2F0107017%2Cnucl-th%2F0107043%2Cnucl-th%2F0107050%2Cnucl-th%2F0107056%2Cnucl-th%2F0107009%2Cnucl-th%2F0107065%2Cnucl-th%2F0107064%2Cnucl-th%2F0107069%2Cnucl-th%2F0107031%2Cnucl-th%2F0107034%2Cnucl-th%2F0107068%2Cnucl-th%2F0107039%2Cnucl-th%2F0107019%2Cnucl-th%2F0107021%2Cnucl-th%2F0107071%2Cnucl-th%2F0107018%2Cnucl-th%2F0107027%2Cnucl-th%2F0501035%2Cnucl-th%2F0501033%2Cnucl-th%2F0501016%2Cnucl-th%2F0501031%2Cnucl-th%2F0501083%2Cnucl-th%2F0501012%2Cnucl-th%2F0501044%2Cnucl-th%2F0501036%2Cnucl-th%2F0501017%2Cnucl-th%2F0501025%2Cnucl-th%2F0501057%2Cnucl-th%2F0501052%2Cnucl-th%2F0501048%2Cnucl-th%2F0501080%2Cnucl-th%2F0501010%2Cnucl-th%2F0501007%2Cnucl-th%2F0501053%2Cnucl-th%2F0501063%2Cnucl-th%2F0501064%2Cnucl-th%2F0501004%2Cnucl-th%2F0501050%2Cnucl-th%2F0501077%2Cnucl-th%2F0501032&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Relativistic corrections in (gamma,N) knockout reactions"}, "summary": "We develop a fully relativistic DWIA model for photonuclear reactions using\nthe relativistic mean field theory for the bound state and the Pauli reduction\nof the scattering state which is calculated from a relativistic optical\npotential. Results for the 12C(gamma,p) and 16O(gamma,p) differential cross\nsections and photon asymmetries are displayed in a photon energy range between\n60 and 257 MeV, and compared with nonrelativistic DWIA calculations. The\neffects of the spinor distortion and of the effective momentum approximation\nfor the scattering state are discussed. The sensitivity of the model to\ndifferent prescriptions for the one-body current operator is investigated. The\noff-shell ambiguities are large in (gamma,p) calculations, and even larger in\n(gamma,n) knockout.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=nucl-th%2F0212109%2Cnucl-th%2F0212049%2Cnucl-th%2F0212009%2Cnucl-th%2F0212070%2Cnucl-th%2F0107057%2Cnucl-th%2F0107066%2Cnucl-th%2F0107038%2Cnucl-th%2F0107016%2Cnucl-th%2F0107055%2Cnucl-th%2F0107046%2Cnucl-th%2F0107001%2Cnucl-th%2F0107072%2Cnucl-th%2F0107067%2Cnucl-th%2F0107028%2Cnucl-th%2F0107061%2Cnucl-th%2F0107059%2Cnucl-th%2F0107022%2Cnucl-th%2F0107026%2Cnucl-th%2F0107058%2Cnucl-th%2F0107030%2Cnucl-th%2F0107032%2Cnucl-th%2F0107006%2Cnucl-th%2F0107051%2Cnucl-th%2F0107044%2Cnucl-th%2F0107007%2Cnucl-th%2F0107042%2Cnucl-th%2F0107062%2Cnucl-th%2F0107036%2Cnucl-th%2F0107025%2Cnucl-th%2F0107074%2Cnucl-th%2F0107024%2Cnucl-th%2F0107012%2Cnucl-th%2F0107060%2Cnucl-th%2F0107004%2Cnucl-th%2F0107011%2Cnucl-th%2F0107040%2Cnucl-th%2F0107008%2Cnucl-th%2F0107005%2Cnucl-th%2F0107070%2Cnucl-th%2F0107003%2Cnucl-th%2F0107045%2Cnucl-th%2F0107063%2Cnucl-th%2F0107052%2Cnucl-th%2F0107047%2Cnucl-th%2F0107029%2Cnucl-th%2F0107053%2Cnucl-th%2F0107002%2Cnucl-th%2F0107023%2Cnucl-th%2F0107013%2Cnucl-th%2F0107041%2Cnucl-th%2F0107020%2Cnucl-th%2F0107048%2Cnucl-th%2F0107010%2Cnucl-th%2F0107049%2Cnucl-th%2F0107037%2Cnucl-th%2F0107033%2Cnucl-th%2F0107073%2Cnucl-th%2F0107014%2Cnucl-th%2F0107054%2Cnucl-th%2F0107035%2Cnucl-th%2F0107015%2Cnucl-th%2F0107017%2Cnucl-th%2F0107043%2Cnucl-th%2F0107050%2Cnucl-th%2F0107056%2Cnucl-th%2F0107009%2Cnucl-th%2F0107065%2Cnucl-th%2F0107064%2Cnucl-th%2F0107069%2Cnucl-th%2F0107031%2Cnucl-th%2F0107034%2Cnucl-th%2F0107068%2Cnucl-th%2F0107039%2Cnucl-th%2F0107019%2Cnucl-th%2F0107021%2Cnucl-th%2F0107071%2Cnucl-th%2F0107018%2Cnucl-th%2F0107027%2Cnucl-th%2F0501035%2Cnucl-th%2F0501033%2Cnucl-th%2F0501016%2Cnucl-th%2F0501031%2Cnucl-th%2F0501083%2Cnucl-th%2F0501012%2Cnucl-th%2F0501044%2Cnucl-th%2F0501036%2Cnucl-th%2F0501017%2Cnucl-th%2F0501025%2Cnucl-th%2F0501057%2Cnucl-th%2F0501052%2Cnucl-th%2F0501048%2Cnucl-th%2F0501080%2Cnucl-th%2F0501010%2Cnucl-th%2F0501007%2Cnucl-th%2F0501053%2Cnucl-th%2F0501063%2Cnucl-th%2F0501064%2Cnucl-th%2F0501004%2Cnucl-th%2F0501050%2Cnucl-th%2F0501077%2Cnucl-th%2F0501032&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We develop a fully relativistic DWIA model for photonuclear reactions using\nthe relativistic mean field theory for the bound state and the Pauli reduction\nof the scattering state which is calculated from a relativistic optical\npotential. Results for the 12C(gamma,p) and 16O(gamma,p) differential cross\nsections and photon asymmetries are displayed in a photon energy range between\n60 and 257 MeV, and compared with nonrelativistic DWIA calculations. The\neffects of the spinor distortion and of the effective momentum approximation\nfor the scattering state are discussed. The sensitivity of the model to\ndifferent prescriptions for the one-body current operator is investigated. The\noff-shell ambiguities are large in (gamma,p) calculations, and even larger in\n(gamma,n) knockout."}, "authors": ["A. Meucci", "C. Giusti", "F. D. Pacati"], "author_detail": {"name": "F. D. Pacati"}, "author": "F. D. Pacati", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevC.64.064615", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/nucl-th/0107052v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/nucl-th/0107052v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "LaTeX2e, 18 pages, and 6 figures", "arxiv_primary_category": {"term": "nucl-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "nucl-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/nucl-th/0107052v1", "affiliation": "Dipartimento di Fisica Nucleare e Teorica, Universita` di Pavia and INFN, sezione di Pavia, Italy", "arxiv_url": "http://arxiv.org/abs/nucl-th/0107052v1", "journal_reference": "Phys.Rev. C64 (2001) 064615", "doi": "10.1103/PhysRevC.64.064615", "fulltext": "Relativisti orre tions in (γ, N ) kno kout rea tions\nA. Meu\n\ni, C. Giusti, and F. D. Pa ati\n\narXiv:nucl-th/0107052v1 18 Jul 2001\n\nDipartimento di Fisi a Nu leare e Teori a, Università di Pavia\nand Istituto Nazionale di Fisi a Nu leare, Sezione di Pavia, Italy\nNovember 13, 2018\n\nAbstra t\nWe develop a fully relativisti DWIA model for photonu lear rea tions using the\nrelativisti mean \u001celd theory for the bound state and the Pauli redu tion of the s attering state whi h is al ulated from a relativisti opti al potential. Results for the\n12\nC(γ, p) and 16 O(γ, p) di\u001berential ross se tions and photon asymmetries are displayed in a photon energy range between 60 and 257 MeV, and ompared with nonrelativisti DWIA al ulations. The e\u001be ts of the spinor distortion and of the e\u001be tive\nmomentum approximation for the s attering state are dis ussed. The sensitivity of the\nmodel to di\u001berent pres riptions for the one-body urrent operator is investigated. The\no\u001b-shell ambiguities are large in (γ, p) al ulations, and even larger in (γ, n) kno kout.\n\nPACS numbers: 25.20.D , 24.10.Jv\n\n1 Introdu tion\nThe analysis of (γ, N ) rea tions at photon energies above the giant resonan e was the obje t\nof a long debate on erning the me hanism of the rea tion (see e.g. Ref. [1℄). On the one\nhand, the fa t that the experimental ross se tions for proton emission an be easily \u001ctted\nwith a single parti le wave fun tion addresses to a dire t kno kout (DKO) me hanism [2℄.\nOn the other hand, the transitions with neutron emission, being of the same order of\nmagnitude as those with proton emission, were onsidered as a lear indi ation of a quasideuteron rea tion me hanism [3, 4, 5℄. A number of orre tions were applied to the DKO\nmodel [6, 7℄ in order to explain both (γ, p) and (γ, n) ross se tions, but were unable to\ngive a reasonable explanation of the data.\nIn re ent years, the development of tagged photon fa ilities allowed to perform experiments with high energy resolution and a lear separation of the di\u001berent individual states\nof the residual nu leus. A large number of experimental data was produ ed at the ele tron\nmi rotron a elerator MAMI-A in Mainz and at the MAX-Laboratory in Lund (see e.g.\nRefs. [8, 9, 10, 11, 12, 13℄).\nFor the (γ, p) rea tion the DKO me hanism represents a large part of the measured\nross se tions for the low-lying states and in the photon energy range above the giant\nresonan e and below the pion produ tion threshold. The results, however, are very sensitive\nto the theoreti al ingredients adopted for bound and s attering states [2, 14℄. Moreover,\nvarious al ulations in di\u001berent theoreti al approa hes indi ate that a prominent role is\nplayed by more ompli ated pro esses, like meson ex hange urrents (MEC) and multi-step\npro esses due to nu lear orrelations [1, 9, 14℄. Nonrelativisti al ulations based on the\ndistorted wave impulse approximation (DWIA) and with onsistent theoreti al ingredients\n\n\ffor bound and s attering states (i.e. overlap fun tions, spe tros opi fa tors and opti al\nmodel parameters able to give a good des ription of (e, e′ p) data) are unable to des ribe\n(γ, p) data [14, 15, 16℄. A reasonable agreement and a onsistent des ription is obtained\nwhen the ontribution of MEC is added to DKO in the (γ, p) rea tion [16℄. MEC produ e\na signi\u001c ant enhan ement of the (γ, p) ross se tions al ulated with DKO and a\u001be t both\nthe shape and the magnitude of the angular distributions. For the (γ, n) rea tion, where\nthe DKO me hanism gives only a small fra tion of the measured ross se tion, MEC and\nmore ompli ated pro esses give the dominant ontribution [1, 14, 11℄.\nHowever, the relative importan e of the di\u001berent me hanisms on (γ, p) and (γ, n) rea tions is still not ompletely understood and justi\u001ces the interest on other e\u001be ts, like\nrelativisti orre tions, nu lear urrent ambiguities and o\u001b-shell behavior of the bound\nnu leons.\nThe relativisti approa h was \u001crst applied to (γ, p) rea tions in Ref. [17℄, where also\nMEC were onsidered, and in Refs. [18, 19℄ within the framework of DKO. In these models\nthe wave fun tions of the bound and ontinuum nu leons are solutions of a Dira equation\nontaining appropriate s alar and ve tor potentials \u001ctted to the ground state properties\nof the nu leus and to proton-nu leus elasti s attering data. The DKO me hanism was\nable to reprodu e the 16 O(γ, p) ross se tion for an in ident photon energy of 60 MeV [19℄.\nThe same approa h was then extended to several target nu lei and to a mu h wider energy\nrange falling into the ∆-ex itation region [20℄. The omparison between these al ulations\nand data suggests that DKO is the leading ontribution for missing momentum values up\nto about 500 MeV/c, while for larger values of the missing momentum an important e\u001be t\nis expe ted from MEC and ∆-ex itation.\nOther studies within the same theoreti al approa h dis ussed the di\u001beren es between\nrelativisti and nonrelativisti al ulations for (γ, p) and (e, e′ p) rea tions [21, 22℄. They\nfound noti eable medium modi\u001c ations in the intera tion hamiltonian due to relativisti\npotentials, whi h suggest that the role of MEC ould be strongly modi\u001ced with respe t to\na nonrelativisti approa h. In any ase these relativisti models did not onsider the (γ, n)\nrea tion.\nDi\u001berent models based on a fully relativisti DWIA (RDWIA) framework have been\ndeveloped in re ent years and su essfully applied to the analysis of (e, e′ p) data [23, 24℄.\nIn a re ent paper [24℄ we have ompared relativisti and nonrelativisti al ulations for\nthe (e, e′ p) kno kout rea tion in order to study relativisti e\u001be ts for ross se tions and\nstru ture fun tions and to establish a limit in energy of the validity of a nonrelativisti\napproa h. In this paper we make a similar omparison for (γ, N ) rea tions. Relativisti\ne\u001be ts are di\u001berent in di\u001berent situations and kinemati s. In (γ, N ) at intermediate photon\nenergies the mismat h between the momentum transfer and the momentum of the outgoing\nnu leon is quite large and larger values of the missing momentum are explored than in usual\n(e, e′ p) experiments. Thus, di\u001berent e\u001be ts an be expe ted for the two rea tions. Our aim\nis to larify the relationship between the RDWIA and DWIA approa hes for (γ, p) and\n(γ, n) rea tions also in omparison with data, and to he k the relevan e of the DKO\nme hanism in relativisti and nonrelativisti al ulations.\nThe RDWIA treatment is the same as in Ref. [24℄. The relativisti bound state wave\nfun tions have been generated as solutions of a Dira equation ontaining s alar and ve tor\npotentials obtained in the framework of the relativisti mean \u001celd theory. The e\u001be tive\nPauli redu tion has been adopted for the outgoing nu leon wave fun tion. This s heme\nappears simpler and is in prin iple equivalent to the solution of the Dira equation. The\nresulting S hrödinger-like equation is solved for ea h partial wave starting from relativisti\nopti al potentials. In the nonrelativisti al ulations, the bound nu leon wave fun tion has\n\n\fbeen taken as the normalized upper omponent of the relativisti four- omponent spinor\nand the s attering state is the solution of the same S hrödinger equivalent equation of the\nrelativisti al ulation. In order to allow a onsistent analysis of (e, e′ p) and (γ, p) rea tions\nin omparison with data, RDWIA and DWIA al ulations have been performed with the\nsame bound state wave fun tions and opti al potentials used for (e, e′ p) in Ref. [24℄. The\nsame spe tros opi fa tors obtained in Ref. [24℄ by \u001ctting our RDWIA (e, e′ p) results to\ndata have been applied to the al ulated (γ, N ) ross se tions.\nResults for 12 C and 16 O target nu lei at di\u001berent photon energies have been onsidered for the omparison. The relativisti urrent is written following the most ommonly\nused urrent onserving (cc) pres riptions for the (e, e′ p) rea tion introdu ed in Ref. [25℄.\nThe ambiguities onne ted with di\u001berent hoi es of the ele tromagneti urrent annot\nbe dismissed. In the (e, e′ p) rea tion the predi tions of di\u001berent pres riptions are generally in lose agreement [26℄. Large di\u001beren es an however be found at high missing\nmomenta [27, 28℄. These di\u001beren es are expe ted to in rease in (γ, N ) rea tions, where the\nkinemati s is deeply o\u001b-shell and higher values of the missing momentum are probed.\nThe formalism is outlined in Se . 2. Relativisti and nonrelativisti al ulations of the\n12 C(γ, p) and 16 O(γ, p) ross se tions are ompared in Se . 3, where various relativisti\ne\u001be ts and urrent ambiguities are investigated. In Se . 4 we dis uss the role of the DKO\nme hanism in the des ription of the (γ, n) rea tion. Some on lusions are drawn in Se . 5.\n\n2 Formalism\nThe (γ, N ) di\u001berential ross se tion an be written as\nσγ =\n\n2π 2 α\n| p′ | E ′ frec f11 ,\nEγ\n\n(1)\n\nwhere Eγ is the in ident photon energy, E ′ and | p′ | are the energy and the momentum\nof the emitted nu leon, and frec is the re oil fa tor, whi h is given by\n−1\nfrec\n=1−\n\nE ′ p′ * prec\n,\nErec | p′ |2\n\n(2)\n\nwhere Erec and prec are the energy and the momentum of the residual re oiling nu leus.\nIn the ross se tion of Eq. (1) only the transverse response, f11 , appears.\nIf the photon beam is linearly polarized the ross se tion be omes\nσγ,A = σγ [1 + A cos (2φ)] ,\n\n(3)\n\nwhere φ is the angle between the photon polarization and the rea tion plane, and A is the\nphoton asymmetry, whi h an be expressed as the ratio between the interferen e transversetransverse and the pure transverse responses\nA=−\n\nf1−1\n.\nf11\n\n(4)\n\nThe stru ture fun tions fλλ′ are de\u001cned as bilinear ombinations of the nu lear urrent\nomponents, i.e.\nf11 = hJ x (J x )† i + hJ y (J y )† i ,\n\nf1−1 = hJ y (J y )† i − hJ x (J x )† i ,\n\n(5)\n\n\fwhere h. . . i means that average over the initial and sum over the \u001cnal states is performed\nful\u001clling energy onservation. In our frame of referen e the z axis is along q , and the y\naxis is parallel to q × p′ .\nIn RDWIA the matrix elements of the nu lear urrent operator, i.e.\nJμ =\n\nZ\n\n(6)\n\ndrΨf (r)ĵ μ exp {iq * r}Ψi (r) ,\n\nare al ulated using relativisti wave fun tions for initial and \u001cnal states.\nThe hoi e of the ele tromagneti operator is, to some extent, arbitrary. Here we dis uss\nthe three cc expressions [25, 29, 30℄\nκ\nμ\nF2 (Q2 )P ,\n2M\nκ\n2 μ\nF2 (Q2 )σ μν qν ,\n= F1 (Q )γ + i\n2M\nμ\ni\n2 P\n+\nGM (Q2 )σ μν qν ,\n= F1 (Q )\n2M\n2M\n\nμ\nĵcc1\n= GM (Q2 )γ μ −\nμ\nĵcc2\nμ\nĵcc3\n\n(7)\n\nμ\n\nwhere q μ = (q, ω) is the four momentum transfer, Q2 =| q |2 −ω 2 , P = (E + E ′ , p + p′ ),\nκ is the anomalous part of the magneti moment, F1 and F2 are the Dira and Pauli\nnu leon form fa tors, GM = F1 + κF2 is the Sa hs nu leon magneti form fa tor, and\nσ μν = i/2 [γ μ , γ ν ]. Sin e the photon is real, Q2 = 0. In this ase F1 redu es to the nu leon\ntotal harge (1 for the proton, and 0 for the neutron), and F2 to 1. Current onservation\nis restored by repla ing the bound nu leon energy by [25℄\nE=\n\np\np\n| p |2 +M 2 = | p′ − q |2 +M 2 .\n\n(8)\n\nThe bound state wave fun tion\n\nΨi =\n\n\u0012\n\nui\nvi\n\n\u0013\n\n(9)\n\n,\n\nis given by the Dira -Hartree solution of a relativisti Lagrangian ontaining s alar and\nve tor potentials.\nThe eje tile wave fun tion Ψf is written in terms of its positive energy omponent Ψf +\nfollowing the dire t Pauli redu tion method\nΨf +\nσ *p′\n\nΨf =\n\nM +E ′ +S−V\n\nΨf +\n\n!\n\n,\n\n(10)\n\nwhere S = S(r) and V = V (r) are the s alar and ve tor potentials for the nu leon with\nenergy E ′ . The upper omponent Ψf + an be related to a S hrödinger equivalent wave\nfun tion Φf by the Darwin fa tor D(r), i.e.\nΨf + =\nD(r) =\n\np\n\nD(r)Φf ,\nM + E′ + S − V\n.\nM + E′\n\n(11)\n(12)\n\nΦf is a two- omponent wave fun tion whi h is solution of a S hrödinger equation on-\n\ntaining equivalent entral and spin-orbit potentials obtained from the s alar and ve tor\n\n\fpotentials [22℄. Hen e, using the relativisti normalization, the emitted nu leon wave fun tion is written as\nΨf =\n\nΨ†f γ 0\n\n\"\n\n!\n\n√\n\n#†\n\n=\n\nr\n\nM + E′\n2E ′\n\n=\n\nr\n\n\u0012\n\u0013\nM + E ′ † \u0010√ \u0011†\n′ 1\nD\n1\n;\nσ\n*\np\nΦ\nγ0 ,\nf\n2E ′\nC†\n\nwhere\n\n1\nσ *p′\nC\n\nD Φf\n\nγ0\n\nC = C(r) = M + E ′ + S(r) − V (r) .\n\n(13)\n\n(14)\n\nIf we substitute Eqs. (9) and (13) into Eq. (6) and hoose one of the urrent onserving\npres riptions of Eq. (7), we obtain the relativisti expressions of the nu lear urrent\nJ cc1 =\n+\nJ cc2 =\n+\n−\nJ cc3 =\n\n+\n−\n\n\n\u0014\n\u0015\n\u0010√ \u0011† \u001a\nE′ + M \n1\n†\n\nD\nGM σvi − i(σ * ∇) † σ ui\n dr Φf\n2E ′\nC\n\u0014\n\u0015\u001b\n1\nκ\nF2 (2i∇ + q) ui + i(σ * ∇) † (2i∇ + q) vi exp{iq * r} ,\n2M\nC\nr\n\n\u0015\n\u001a\n\u0014\n\u0010\n\u0011\n√ †\nE′ + M \n1\n†\n\nD\nF1 −i(σ * ∇) † σ ui + σ vi\n dr Φf\n2E ′\nC\n\u0014\nκ\n1\ni\nF2 σ × qui + ω(σ * ∇) † σui\n2M\nC\n\u0015\u001b\n1\niωσvi + i(σ * ∇) † σ × q vi exp{iq * r} ,\nC\nr\n\n\u0010√ \u0011†\nE′ + M \n†\n\nD\ndr\nΦ\nf\n2E ′\n\u0014\n\u0015\n\u001a\ni\n1\nF1 (−2i∇ − q) ui − i (σ * ∇) † (2i∇ + q) vi\n2M\nC\n\u0014\n1\ni\nGM σ × qui + ω(σ * ∇) † σui\n2M\nC\n\u0015\u001b\n1\niωσvi + i(σ * ∇) † σ × qvi exp{iq * r} ,\nC\nr\n\n(15)\n\n(16)\n\n(17)\n\nwhere the P operator has been repla ed by the gradient −2i∇−q, whi h operates not only\non the omponents of the Dira spinor but also on exp{iq * r}. It is interesting to noti e\nthat in Eqs. (15) and (17) appear terms whi h are proportional to the se ond derivative of\nthe lower omponent of the Dira spinor.\n\n3 The (γ, p) rea tion\nThe (γ, p) rea tion is an interesting pro ess for testing our RDWIA program and investigating the di\u001beren es with respe t to the DWIA approa h. At intermediate photon energies\nthere is a large di\u001beren e between the in oming photon and outgoing nu leon momenta and\nmissing momentum values higher than in usual (e, e′ p) experiments are explored. Thus,\ndi\u001berent relativisti e\u001be ts an be expe ted in the two rea tions. Moreover, it an be\ninteresting to he k the relevan e of the DKO me hanism in omparison with data for\norresponding RDWIA and DWIA al ulations with onsistent theoreti al ingredients for\n\n\fbound and s attering states. Previous RDWIA analyses [20℄ suggest that DKO is the leading ontribution to the (γ, p) ross se tion for low values of Eγ and not too large values of\nthe missing momentum. In ontrast, in nonrelativisti al ulations the DKO me hanism\ngenerally underestimates the experimental ross se tions and an important ontribution is\ngiven by MEC even at low photon energies. In these investigations, however, RDWIA and\nDWIA al ulations make generally use of di\u001berent bound state wave fun tions and opti al\npotentials, and (γ, p) results are very sensitive to the theoreti al ingredients adopted in the\nal ulations.\nA large amount of experiments were arried out in the past on several target nu lei and\nover a wide range of photon energies. Here, we have performed al ulations for 12 C and\n16 O. The bound state wave fun tions and opti al potentials are the same as in the analysis\nof Ref. [24℄, where the RDWIA results are in satisfa tory agreement with (e, e′ p) data. In\norder to allow a onsistent omparison with data, the same spe tros opi fa tors obtained\nby \u001ctting our RDWIA (e, e′ p) al ulations [24℄ to data have been here applied to the (γ, p)\nresults, that is 0.56 for 12 C and 0.70 for 16 O.\nThe relativisti bound state wave fun tion has been generated using the program ADFX\nof Ref. [31℄, where relativisti Hartree-Bogoliubov equations are solved. The model starts\nfrom a Lagrangian density ontaining sigma-, omega-, rho-meson, and photon \u001celds, whose\npotentials are obtained by solving self- onsistently Klein-Gordon equations.\nThe orresponding wave fun tion for the nonrelativisti al ulation has been taken as\nthe upper omponent of the relativisti four- omponent spinor, whi h is normalized to 1 in\noordinate and spin spa e. Presumably, this is not the best hoi e for the nonrelativisti\nDWIA al ulations, but the same ingredients are to be used in order to perform a lear\nomparison between the two approa hes.\nThe outgoing nu leon wave fun tion is al ulated by means of the omplex phenomenologi al opti al potential of Ref. [32℄, obtained from \u001cts to proton elasti s attering data in\nan energy range up to 1040 MeV. The S hrödinger equivalent potentials al ulated in the\nsame way were used in the nonrelativisti program.\nSin e no rigorous pres ription exists for handling o\u001b-shell nu leons, it is worthwhile\nto study the sensitivity of one nu leon photoemission to di\u001berent hoi es of the nu lear\nurrent.\nThe nonrelativisti urrent is written as an expansion up to order 1/M 2 from a FoldyWouthuysen transformation [33, 34℄ applied to the intera tion Hamiltonian where the nulear urrent is in the cc2 form of Eq. (7). Thus, the cc2 pres ription for the relativisti\nnu lear urrent is more appropriate in the omparison between the relativisti and nonrelativisti models.\n\n3.1 Relativisti and nonrelativisti\n\nal ulations\n\nIn this se tion the results of the omparison between our RDWIA and DWIA al ulations\nare dis ussed. One has to remember that our nonrelativisti ode ontains some relativisti\norre tions in the kinemati s and in the nu lear urrent through the expansion in 1/M .\nThis means that the nonrelativisti results annot be obtained from the relativisti program\nsimply by negle ting the lower omponents of the Dira spinor and applying the proper\nnormalization.\nThe omparison between the RDWIA and DWIA results is shown in Fig. 1 for the ross\nse tion of the 16 O(γ, p)15 Ng.s. rea tion. The photon energy range is taken between 60 MeV\nand 257 MeV, but the nonrelativisti al ulations are not extended above 200 MeV [24℄.\nIn the onsidered energy range missing momentum values between about 200 and 1000\n\n\fMeV/c are explored.\nWe see that the di\u001beren es between the nonrelativisti al ulations and the relativisti\nones with the cc2 pres ription are sensible at all energies. The nonrelativisti results are\nalways smaller than the data [9, 35, 36, 37℄. This e\u001be t was already known from previous\nnonrelativisti analyses and suggested that MEC must give an important ontribution to\nthe ross se tion. On the ontrary, the relativisti results are generally loser to the data\nand well reprodu e the magnitude and shape, at least at low energies. This result is in\nagreement with similar RDWIA approa hes with the cc2 urrent [18, 19, 20℄. For higher\nenergies, the relativisti results fall below the data and the dis repan ies in rease with the\nproton angle. This seems to indi ate that the DKO me hanism gives the most important\nontribution to the ross se tion at lower missing momenta, while more ompli ated proesses su h as MEC and ∆-ex itations be ome more and more important at larger missing\nmomenta.\nIn Fig. 2 the photon asymmetries are shown in the same kinemati s as in Fig. 1. The\ndi\u001beren es between DWIA and RDWIA results with cc2 are small at 60 MeV, but rapidly\nin rease with the photon energy.\nIn Fig. 3 the ross se tion for the 12 C(γ, p)11 Bg.s. rea tion is presented. The nonrelativisti results are also in this ase smaller than the relativisti ones, but the most apparent\nfeature is that both results lie above the data [8, 38℄. The fa t that RDWIA al ulations\nwith the cc2 urrent overestimate the data by a fa tor of 2 was already pointed out in\nRef. [20℄. A better des ription of data might be obtained with a more areful determination of the 12 C ground state whi h should in lude its intrinsi deformation.\n\n3.2 Current ambiguities\nIn this se tion the sensitivity of (γ, p) al ulations to di\u001berent hoi es of the nu lear urrent\nis dis ussed. In the ase of one proton kno kout the expressions for the ele tromagneti\nnu lear urrent of Eq. (7) redu e to\nμ\n\nμ\nĵcc1\n\n= γ μ + κp\n\n!\n\n,\n\nκp μν\nσ qν ,\n2M\nμ\nP\ni\n+\n(1 + κp ) σ μν qν ,\n2M\n2M\n\nμ\nĵcc2\n= γμ + i\nμ\nĵcc3\n=\n\nP\nγμ −\n2M\n\n(18)\n\nwhere κp = 1.793 is the anomalous part of the proton magneti moment. These expressions\nare obviously equivalent for a free nu leon, but give di\u001berent results for an o\u001b-shell nu leon.\nIt is interesting to noti e that the nonrelativisti redu tions of the three cc forms give\nidenti al results up to order 1/M following the dire t Pauli redu tion s heme in the limit\nof no Dira S and V potentials and M + E = 2M . The equivalen e of Pauli redu tion and\nFoldy-Wouthuysen transformation up to order 1/M was already pointed out in Refs. [39,\n22℄.\nThe results obtained with di\u001berent urrent operators are displayed and ompared for\n16 O in Fig. 1. The di\u001beren es are large. We have already noti ed that the cc2 results are\nin satisfa tory agreement with the experimental data at lower energies, but they tend to\nfall down with in reasing proton angle and photon energy. RDWIA results are strongly\nenhan ed if we use cc1 urrent. This is probably due to a too small interferen e term whi h\nμ\ndoes not orre tly estimate the onve tive urrent ontained in both γ μ and P /(2M )\nterms when the nu leon is o\u001b-shell. Also in Ref. [27℄, in an (e, e′ p) analysis within the\n\n\fframework of the relativisti plane wave impulse approximation, large di\u001beren es are found\nbetween results obtained with the cc2 and cc1 pres riptions for high values of the missing\nmomentum and signi\u001c antly higher ross se tions are obtained with cc1. The results with\nthe cc3 urrent in Fig. 1 are more similar to the cc2 ones. At low energy cc3 lies below cc2,\nbut the di\u001beren es rapidly de rease with the energy.\nIn Fig. 2 a omparison of photon asymmetry al ulations in the same kinemati s as in\nFig. 1 is shown. The di\u001beren es are sensible already at 60 MeV and tend to in rease with\nthe energy.\nLarge ambiguities are found also in the ase of 12 C(γ, p) rea tion (Fig. 3). Results\nobtained with the cc1 urrent are enhan ed above the data by an order of magnitude. On\nthe ontrary, cc3 results are smaller than the data.\n\n3.3 Spinor distortion and Darwin fa tor\nThe opti al potential enters into the Darwin fa tor D, whi h multiplies the S hrödinger\nequivalent eigenfun tion, and into the spinor distortion C , whi h is applied only to the lower\nomponent of Dira spinor. The distortion of the s attering wave fun tion is al ulated\nthrough a partial wave expansion and it is always in luded in the al ulations. The Darwin\nfa tor gives a redu tion of the ross se tion. On the ontrary, the spinor distortion produ es\nan enhan ement.\nThe ombined e\u001be ts of the two orre tions are displayed and ompared in Figs. 4 and\n5 for the ross se tion of the rea tion 16 O(γ, p)15 Ng.s. at Eγ = 60 and 196 MeV. Results\nwithout the Darwin fa tor and spinor distortion at 60 MeV using either cc1 or cc2 are\nredu ed with respe t to the full al ulations, while results with cc3 are enhan ed for low\ns attering angles. These e\u001be ts de rease at 196 MeV, where al ulations without potentials\nare loser to full al ulations.\n\n3.4 E\u001be tive momentum approximation\nThe EMA pres ription, whi h onsists in evaluating the momentum operator in the nu lear\nurrent using the asymptoti value of the eje ted nu leon momentum, strongly simpli\u001ces\nthe al ulations. This approximation was su essfully used in some (e, e′ p) al ulations,\nand, in parti ular, in the model of Refs. [29, 30℄ for bound and s attering states. Sin e in\nour approa h the bound state wave fun tion is solution of a Dira equation, we investigate\nthe EMA e\u001be ts only for the s attering states. We have to noti e that in the nu lear\nμ\nurrent the EMA pres ription a\u001be ts only the P term in cc1 and cc3 formulae, while cc2\nis un hanged. However, a momentum dependen e omes from the Pauli redu tion of the\ns attering wave fun tion.\nThe e\u001be ts of EMA are displayed and ompared with the full RDWIA results in Figs. 4\nand 5 at Eγ = 60 and 196 MeV. At 60 MeV the di\u001beren es are large, but they de rease with\nthe energy and be ome mu h smaller at 196 MeV. This behavior is pra ti ally independent\nof the nu lear urrent. This an be understood if we onsider that distortion e\u001be ts de rease\nwith the energy, so that at high energy DWIA results are more similar to PWIA ones, where\nEMA is exa t.\n\n4 The (γ, n) rea tion\nIn this se tion relativisti e\u001be ts are dis ussed for the (γ, n) rea tion. The experimental\nangular distributions are similar in magnitude and shape to those obtained for the (γ, p)\n\n\frea tion. The ratio between the (γ, p) and (γ, n) ross se tions is omparable to unity and\nsuggests a two-body me hanism. In fa t, nonrelativisti al ulations based on the DKO\nme hanism give but a small fra tion of the measured ross se tions.\nIn order to test the relevan e of the DKO ontribution, we have performed RDWIA\nand DWIA al ulations for the 16 O(γ, n)15 Og.s. rea tion. For neutron kno kout the ele tromagneti nu lear urrent of Eq. (7) redu es to the anomalous spin urrent only, i.e.\nμ\nĵcc1\n\n= κn\n\nμ\nμ\nĵcc2\n= ĵcc3\n\n!\nμ\nP\nγ −\n,\n2M\nκn μν\nσ qν ,\n= i\n2M\nμ\n\n(19)\n\nwhere κn = −1.913 is the anomalous part of the neutron magneti moment. Noti e that\nμ\nμ\nĵcc2\n= ĵcc3\n, while for cc1 the spin urrent is written by means of a di\u001beren e between the\nμ\nDira urrent γ μ and the onve tive urrent P /(2M ).\nIn Fig. 6 relativisti and nonrelativisti results for the 16 O(γ, n)15 Og.s. rea tion are\n\nshown in omparison with data [11, 40, 41℄. The same spe tros opi fa tor as in the\norresponding (γ, p) rea tion has been applied to the al ulated results.\nWe see that neither nonrelativisti nor relativisti cc2 (cc3) al ulations reprodu e the\nmagnitude of experimental data. This result is not surprising. It on\u001crms what was already\nfound in previous DWIA al ulations and indi ates that more ompli ated two-body e\u001be ts\nare needed to reprodu e the data. Relativisti results are strongly enhan ed if we use the\ncc1 urrent. This e\u001be t is parti ularly surprising at Eγ = 150 and 200 MeV, where the cc1\nμ\nurve \u001cts the data. This result an be attributed to the γ μ − P /(2M ) operator, whi h\ndoes not orre tly des ribe the spin urrent when the kinemati s is deeply o\u001b-shell, and,\ntherefore, is to be onsidered unreliable.\nThe di\u001beren es between the DWIA and RDWIA results with cc2 are large. They are\nredu ed if we perform nonrelativisti al ulations with a nu lear urrent expanded up to\norder 1/M 3 [34℄, but the ontribution of the third order is very large for this rea tion, and\nomparable to the se ond order one.\n\n5 Summary and on lusions\nIn this paper we have presented relativisti and nonrelativisti DWIA al ulations for\n(γ, N ) rea tions on 12 C and 16 O, in a photon-energy range between 60 and 257 MeV, in\norder to he k the relevan e of the DKO me hanism in RDWIA and DWIA models and\ninvestigate relativisti e\u001be ts.\nThe transition matrix element of the nu lear urrent operator is al ulated in RDWIA\nusing the bound state wave fun tions obtained in the framework of the relativisti mean\n\u001celd theory, and the dire t Pauli redu tion method with s alar and ve tor potentials for\nthe eje tile wave fun tions. In order to study the ambiguities in the ele tromagneti vertex\ndue to the o\u001b-shellness of the initial nu leon, we have performed al ulations using three\nurrent onserving expressions. The nonrelativisti DWIA matrix elements are omputed\nin a similar way to allow a dire t omparison with the relativisti results. In order to allow\na onsistent omparison of (e, e′ p) and (γ, p) data, al ulations have been performed with\nthe same bound state wave fun tions, spe tros opi fa tors and opti al potentials as in our\nre ent (e, e′ p) analysis of Ref. [24℄.\nNonrelativisti (γ, p) results are always smaller than the data and suggest the idea that\nMEC are relevant even at low energies. On the ontrary, RDWIA al ulations seem to\n\n\findi ate that the DKO me hanism is the leading pro ess, at least for low photon energies.\nThese results are in substantial agreement with previous DWIA and RDWIA analyses.\nWe have dis ussed the sensitivity of the (γ, p) rea tion to the di\u001berent hoi es of the\nnu lear urrent. Unlike the ase of the (e, e′ p) rea tion, large ambiguities are generally\nfound. Results with the cc2 urrent are in satisfa tory agreement with the experimental\ndata at lower energies, but they tend to fall down with in reasing proton angle and photon\nenergy. On the ontrary, the results with cc1 are strongly enhan ed. This result seems due\nto a too small interferen e term whi h overestimates the onve tive urrent when the initial\nnu leon is o\u001b-shell. The results with cc3 are more similar to the cc2 ones. The di\u001beren es\nde rease when the energy in reases.\nThe e\u001be t of the s alar and ve tor potentials in the Pauli redu tion for the s attering\nstate has been dis ussed. These potentials appear in the relativisti treatment and are\nabsent in the nonrelativisti one. The ombined ontribution of the Darwin fa tor, whi h\nredu es the ross se tion, and of the spinor distortion, whi h enhan es the e\u001be ts of the\nlower omponents of the Dira spinor, is important at low Eγ , and de reases at higher\nenergies.\nThe validity of EMA in the s attering state of relativisti al ulations has been investigated. The di\u001beren es with respe t to the exa t result are large at low photon energies,\nbut rapidly de rease and be ome small at higher energies.\nRelativisti al ulations of the (γ, n) ross se tions give huge o\u001b-shell ambiguities. The\ncc2 and cc3 pres riptions oin ide in the neutron ase, but the enhan ement obtained with\ncc1 is dramati and brings the RDWIA results above the data at Eγ = 60 MeV and in good\nagreement with data at Eγ = 150 and 200 MeV. However, we annot argue that the DKO\nme hanism with the cc1 pres ription orre tly des ribes (γ, n) ross se tions. This result\nis due to a dominant o\u001b-shell e\u001be t on the cc1 urrent operator, whi h does not orre tly\ndes ribe the modest ontribution from the spin urrent.\nNeither norelativisti DWIA nor RDWIA al ulations with cc2 reprodu e (γ, n) data.\nThere are sensible di\u001beren es between the results of the two approa hes, but in both\nases the experimental ross se tions are largely underestimated. This is an indi ation of\nthe dominan e of two-body me hanisms in the (γ, n) rea tion. A areful and onsistent\nevaluation of these me hanisms within relativisti and nonrelativisti frameworks for (γ, n)\nand (γ, p) rea tions would be highly desirable and helpful to draw on lusions about the\nrea tion me hanism and to solve the present ambiguities.\n\nReferen es\n[1℄ S. Bo\u001e, C. Giusti, F. D. Pa ati, and M. Radi i, Ele tromagneti Response of Atomi\nNu lei, Oxford Studies in Nu lear Physi s (Clarendon Press, Oxford, 1996).\n[2℄ S. Bo\u001e, C. Giusti, and F. D. Pa ati, Nu l. Phys. A358, 91 (1981).\n[3℄ J. S. Levinger, Phys. Rev. 84, 43 (1951); Phys. Lett. B82, 181 (1979).\n[4℄ B. S ho h, Phys. Rev. Lett. 41, 80 (1970).\n[5℄ J. A. Eden et\n\nal.\n\n, Phys. Rev. C 44, 753 (1991).\n\n[6℄ S. Bo\u001e, R. Cenni, C. Giusti, and F. D. Pa ati, Nu l. Phys. A420, 38 (1984).\n[7℄ S. Bo\u001e, F. Capuzzi, C. Giusti, and F. D. Pa ati, Nu l. Phys. A436, 438 (1985).\n[8℄ S. V. Springham\n\n, Nu l. Phys. A517, 93 (1990).\n\net al.\n\n\f[9℄ G. J. Miller et\n\n, Nu l. Phys. A586, 125 (1995).\n\nal.\n\n[10℄ C. Van den Abeele, D. Ry kbos h, J. Dias, L. Van Hoorebeke, R. Van de Vyver,\nJ. O. Adler, K. Hansen, L. Isaksson, H. Ruijter, and B. S hröder, Nu l. Phys. A586,\n281 (1995).\n[11℄ B. E. Andersson et\n\nal.\n\n, Phys. Rev. C 51, 2553 (1995).\n\n[12℄ L. J. de Bever et\n\nal.\n\n, Phys. Rev. C 58, 981 (1998).\n\n[13℄ D. Branford et\n\n, Phys. Rev. C 63, 014310 (2001).\n\nal.\n\n[14℄ G. Benenti, C. Giusti, and F. D. Pa ati, Nu l. Phys. A574, 716 (1994).\n[15℄ D. G. Ireland and G. van der Steenhoven, Phys. Rev. C 49, 2182 (1994).\n[16℄ M. K. Gaidarov, K. A. Pavlova, A. N. Antonov, M. V. Stoitsov, S. S. Dimitrova,\nM. V. Ivanov, and C. Giusti, Phys. Rev. C 61, 014306 (2000);\nM. V. Ivanov, M. K. Gaidarov, A. N. Antonov, and C. Giusti, Phys. Rev. C 64,\n014605 (2001).\n[17℄ J. P. M Dermott, E. Rost, J. R. Shepard, and C. Y. Cheung, Phys. Rev. Lett. 61,\n814 (1988).\n[18℄ G. M. Lotz and H. S. Sherif, Nu l. Phys. A537, 285 (1992).\n[19℄ J. I. Johansson, H. S. Sherif, and G. M. Lotz, Nu l. Phys. A605, 517 (1996).\n[20℄ J. I. Johansson and H. S. Sherif, Phys. Rev. C 56, 328 (1997).\n[21℄ M. Hedayati-Poor and H. S. Sherif, Phys. Lett. B326, 9 (1994).\n[22℄ M. Hedayati-Poor, J. I. Johansson, and H. S. Sherif, Nu l. Phys. A593, 377 (1995).\n[23℄ Y. Jin, D. S. Onley, and L. E. Wright, Phys. Rev. C 45, 1311 (1992);\nY. Jin and D. S. Onley, Phys. Rev. C 50, 377 (1994);\nJ. M. Udías, P. Sarriguren, E. Moya de Guerra, E. Garrido, and J. A. Caballero,\nPhys. Rev. C 48, 2731 (1993);\nJ. M. Udías, P. Sarriguren, E. Moya de Guerra, E. Garrido, and J. A. Caballero,\nPhys. Rev. C 51, 3246 (1995);\nJ. M. Udías, P. Sarriguren, E. Moya de Guerra, and J. A. Caballero, Phys. Rev. C\n53, R1488 (1996);\nJ. M. Udías and J. R. Vignote Phys. Rev. C 62, 034302 (2000).\n[24℄ A. Meu i, C. Giusti, and F. D. Pa ati, Phys. Rev. C 64, 014604 (2001).\n[25℄ T. de Forest, Jr., Nu l. Phys. A392, 232 (1983).\n[26℄ S. Pollo k, H. W. L. Naus, and J. H. Ko h, Phys. Rev. C 53, 2304 (1996).\n[27℄ J. A. Caballero, T. W. Donnelly, E. Moya de Guerra, J. M. Udías, Nu l. Phys. A632,\n323 (1998).\n[28℄ S. Jes honnek and J. W. Van Orden, Phys. Rev. C 62, 044613 (2000).\n[29℄ J. J. Kelly, Phys. Rev. C 56, 2672 (1997); 59, 3256 (1999).\n\n\f[30℄ J. J. Kelly, Phys. Rev. C 60, 044609 (1999).\n[31℄ W. Pös hl, D. Vretenar, and P. Ring, Comput. Phys. Commun. 103, 217 (1997).\n[32℄ E. D. Cooper, S. Hama, B. C. Clark, and R. L. Mer er, Phys. Rev. C 47, 297 (1993).\n[33℄ L. L. Foldy and S. A. Wouthuysen, Phys. Rev. 78, 29 (1950).\n[34℄ C. Giusti and F. D. Pa ati, Nu l. Phys. A336, 427 (1980).\n[35℄ D. J. S. Findlay and R. O. Owens, Nu l. Phys. A279, 385 (1977).\n[36℄ M. J. Leit h, J. L. Matthews, W. W. Sapp, C. P. Sargent, S. A. Wood, D. J. S. Findlay, R. O. Owens, and B. L. Roberts, Phys. Rev. C 31, 1633 (1985).\n[37℄ G. S. Adams, E. R. Kinney, J. L. Matthews, W. W. Sapp, T. Soos, R. O. Owens,\nR. S. Turley, and G. Pignault, Phys. Rev. C 38, 2771 (1988).\n[38℄ A. C. Shotter, S. Springham, D. Branford, J. Yorkston, J. C. M George, B. S ho h,\nand P. Jennewein, Phys. Rev. C 37, 1354 (1988).\n[39℄ H. W. Fearing, G. I. Poulis, and S. S herer, Nu l. Phys. A570, 657 (1994).\n[40℄ H. Goringer, B. S ho h, and G. Lührs, Nu l. Phys. A384, 414 (1982).\n[41℄ E. J. Beise et\n\n, Phys. Rev. Lett. 62, 2593 (1989).\n\nal.\n\n\fFigure 1: The ross se tion for the 16 O(γ, p)15 Ng.s. rea tion as a fun tion of the proton\ns attering angle for photon energies ranging from 60 to 257 MeV. The data at 60 MeV are\nfrom Ref. [9℄ (bla k squares) and from Ref. [35℄ (open ir les). The data at 80 and 100\nMeV are from Ref. [35℄. The data at 150 MeV are from Ref. [36℄, and those at 196 and\n257 MeV are from Ref. [37℄. Results shown orrespond to RDWIA al ulations with the\ncc2 (solid line), cc1 (dashed line), and cc3 (dotted line) urrent. The dot-dashed line is the\nnonrelativisti result.\n\n\fFigure 2: The same as in Fig. 1, but for the photon asymmetry.\n\n\fFigure 3: The ross se tion for the 12 C(γ, p)11 Bg.s. rea tion as a fun tion of the proton\ns attering angle at Eγ = 58.4 and 78.5 MeV. The data are from Ref. [38℄ (bla k squares)\nand from Ref. [8℄ (open ir les). Line onvention as in Fig. 1.\n\n\fFigure 4: The ross se tion for the 16 O(γ, p)15 Ng.s. rea tion as a fun tion of the proton\ns attering angle at Eγ = 60 MeV. The data are from Ref. [9℄ (bla k squares) and from\nRef. [35℄ (open ir les). The solid lines give the RDWIA results, the dotted lines the\nal ulations without the Darwin fa tor and spinor distortion, and the dashed lines the\nEMA.\n\n\fFigure 5: The same as in Fig. 4, but at Eγ = 196 MeV. The data are from Ref. [37℄.\n\n\fFigure 6: The ross se tion for the 16 O(γ, n)15 Og.s. rea tion as a fun tion of the neutron\ns attering angle for photon energies ranging from 60 to 250 MeV. The data at 60 MeV are\nfrom Ref. [11℄ (bla k squares) and from Ref. [40℄ (open ir les), and the data at 150, 200,\nand 250 MeV are from Ref. [41℄. Line onvention as in Fig. 1.\n\n\f"}