{"id": "http://arxiv.org/abs/nucl-th/0602027v1", "guidislink": true, "updated": "2006-02-09T19:58:52Z", "updated_parsed": [2006, 2, 9, 19, 58, 52, 3, 40, 0], "published": "2006-02-09T19:58:52Z", "published_parsed": [2006, 2, 9, 19, 58, 52, 3, 40, 0], "title": "Effects of non-causal artifacts in a hadronic rescattering model for\n  RHIC collisions", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=nucl-th%2F0602028%2Cnucl-th%2F0602055%2Cnucl-th%2F0602023%2Cnucl-th%2F0602009%2Cnucl-th%2F0602011%2Cnucl-th%2F0602067%2Cnucl-th%2F0602042%2Cnucl-th%2F0602013%2Cnucl-th%2F0602044%2Cnucl-th%2F0602051%2Cnucl-th%2F0602035%2Cnucl-th%2F0602041%2Cnucl-th%2F0602010%2Cnucl-th%2F0602018%2Cnucl-th%2F0602021%2Cnucl-th%2F0602063%2Cnucl-th%2F0602022%2Cnucl-th%2F0602031%2Cnucl-th%2F0602030%2Cnucl-th%2F0602059%2Cnucl-th%2F0602005%2Cnucl-th%2F0602047%2Cnucl-th%2F0602014%2Cnucl-th%2F0602025%2Cnucl-th%2F0602046%2Cnucl-th%2F0602069%2Cnucl-th%2F0602004%2Cnucl-th%2F0602036%2Cnucl-th%2F0602053%2Cnucl-th%2F0602027%2Cnucl-th%2F0602052%2Cnucl-th%2F0602060%2Cnucl-th%2F0602007%2Cnucl-th%2F0602006%2Cnucl-th%2F0006006%2Cnucl-th%2F0006034%2Cnucl-th%2F0006047%2Cnucl-th%2F0006061%2Cnucl-th%2F0006064%2Cnucl-th%2F0006050%2Cnucl-th%2F0006004%2Cnucl-th%2F0006076%2Cnucl-th%2F0006013%2Cnucl-th%2F0006065%2Cnucl-th%2F0006009%2Cnucl-th%2F0006072%2Cnucl-th%2F0006053%2Cnucl-th%2F0006068%2Cnucl-th%2F0006066%2Cnucl-th%2F0006056%2Cnucl-th%2F0006008%2Cnucl-th%2F0006022%2Cnucl-th%2F0006043%2Cnucl-th%2F0006042%2Cnucl-th%2F0006025%2Cnucl-th%2F0006079%2Cnucl-th%2F0006048%2Cnucl-th%2F0006057%2Cnucl-th%2F0006005%2Cnucl-th%2F0006018%2Cnucl-th%2F0006082%2Cnucl-th%2F0006069%2Cnucl-th%2F0006085%2Cnucl-th%2F0006011%2Cnucl-th%2F0006026%2Cnucl-th%2F0006007%2Cnucl-th%2F0006060%2Cnucl-th%2F0006059%2Cnucl-th%2F0006086%2Cnucl-th%2F0006045%2Cnucl-th%2F0006019%2Cnucl-th%2F0006074%2Cnucl-th%2F0006033%2Cnucl-th%2F0006073%2Cnucl-th%2F0006049%2Cnucl-th%2F0006070%2Cnucl-th%2F0006017%2Cnucl-th%2F0006077%2Cnucl-th%2F0006041%2Cnucl-th%2F0006035%2Cnucl-th%2F0006058%2Cnucl-th%2F0006051%2Cnucl-th%2F0006002%2Cnucl-th%2F0006001%2Cnucl-th%2F0006021%2Cnucl-th%2F0006078%2Cnucl-th%2F0006031%2Cnucl-th%2F0006040%2Cnucl-th%2F0006036%2Cnucl-th%2F0006046%2Cnucl-th%2F0006037%2Cnucl-th%2F0006028%2Cnucl-th%2F0006052%2Cnucl-th%2F0006010%2Cnucl-th%2F0006054%2Cnucl-th%2F0006067%2Cnucl-th%2F0006039%2Cnucl-th%2F0006030%2Cnucl-th%2F0006087%2Cnucl-th%2F0006081%2Cnucl-th%2F0006075&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Effects of non-causal artifacts in a hadronic rescattering model for\n  RHIC collisions"}, "summary": "It has been shown that calculations based on a hadronic rescattering model\nagree reasonably well with experimental results from RHIC Au+Au collisions.\nBecause of the large particle densities intrinsically present at the early time\nsteps of Monte Carlo calculations attempting to model RHIC collisions\nundesirable artifacts resulting in non-causality may be present. The effects of\nsuch artifacts on observables calculated from the rescattering model are\nstudied in the present work in two ways: 1) varying the time step and 2) using\nthe subdivision method. It is shown that although non-causal artifacts are\npresent in the rescattering model they have no appreciable effects on the\ncalculated observables, thus strengthing the confidence in the results of this\nrescattering model for RHIC energies.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=nucl-th%2F0602028%2Cnucl-th%2F0602055%2Cnucl-th%2F0602023%2Cnucl-th%2F0602009%2Cnucl-th%2F0602011%2Cnucl-th%2F0602067%2Cnucl-th%2F0602042%2Cnucl-th%2F0602013%2Cnucl-th%2F0602044%2Cnucl-th%2F0602051%2Cnucl-th%2F0602035%2Cnucl-th%2F0602041%2Cnucl-th%2F0602010%2Cnucl-th%2F0602018%2Cnucl-th%2F0602021%2Cnucl-th%2F0602063%2Cnucl-th%2F0602022%2Cnucl-th%2F0602031%2Cnucl-th%2F0602030%2Cnucl-th%2F0602059%2Cnucl-th%2F0602005%2Cnucl-th%2F0602047%2Cnucl-th%2F0602014%2Cnucl-th%2F0602025%2Cnucl-th%2F0602046%2Cnucl-th%2F0602069%2Cnucl-th%2F0602004%2Cnucl-th%2F0602036%2Cnucl-th%2F0602053%2Cnucl-th%2F0602027%2Cnucl-th%2F0602052%2Cnucl-th%2F0602060%2Cnucl-th%2F0602007%2Cnucl-th%2F0602006%2Cnucl-th%2F0006006%2Cnucl-th%2F0006034%2Cnucl-th%2F0006047%2Cnucl-th%2F0006061%2Cnucl-th%2F0006064%2Cnucl-th%2F0006050%2Cnucl-th%2F0006004%2Cnucl-th%2F0006076%2Cnucl-th%2F0006013%2Cnucl-th%2F0006065%2Cnucl-th%2F0006009%2Cnucl-th%2F0006072%2Cnucl-th%2F0006053%2Cnucl-th%2F0006068%2Cnucl-th%2F0006066%2Cnucl-th%2F0006056%2Cnucl-th%2F0006008%2Cnucl-th%2F0006022%2Cnucl-th%2F0006043%2Cnucl-th%2F0006042%2Cnucl-th%2F0006025%2Cnucl-th%2F0006079%2Cnucl-th%2F0006048%2Cnucl-th%2F0006057%2Cnucl-th%2F0006005%2Cnucl-th%2F0006018%2Cnucl-th%2F0006082%2Cnucl-th%2F0006069%2Cnucl-th%2F0006085%2Cnucl-th%2F0006011%2Cnucl-th%2F0006026%2Cnucl-th%2F0006007%2Cnucl-th%2F0006060%2Cnucl-th%2F0006059%2Cnucl-th%2F0006086%2Cnucl-th%2F0006045%2Cnucl-th%2F0006019%2Cnucl-th%2F0006074%2Cnucl-th%2F0006033%2Cnucl-th%2F0006073%2Cnucl-th%2F0006049%2Cnucl-th%2F0006070%2Cnucl-th%2F0006017%2Cnucl-th%2F0006077%2Cnucl-th%2F0006041%2Cnucl-th%2F0006035%2Cnucl-th%2F0006058%2Cnucl-th%2F0006051%2Cnucl-th%2F0006002%2Cnucl-th%2F0006001%2Cnucl-th%2F0006021%2Cnucl-th%2F0006078%2Cnucl-th%2F0006031%2Cnucl-th%2F0006040%2Cnucl-th%2F0006036%2Cnucl-th%2F0006046%2Cnucl-th%2F0006037%2Cnucl-th%2F0006028%2Cnucl-th%2F0006052%2Cnucl-th%2F0006010%2Cnucl-th%2F0006054%2Cnucl-th%2F0006067%2Cnucl-th%2F0006039%2Cnucl-th%2F0006030%2Cnucl-th%2F0006087%2Cnucl-th%2F0006081%2Cnucl-th%2F0006075&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "It has been shown that calculations based on a hadronic rescattering model\nagree reasonably well with experimental results from RHIC Au+Au collisions.\nBecause of the large particle densities intrinsically present at the early time\nsteps of Monte Carlo calculations attempting to model RHIC collisions\nundesirable artifacts resulting in non-causality may be present. The effects of\nsuch artifacts on observables calculated from the rescattering model are\nstudied in the present work in two ways: 1) varying the time step and 2) using\nthe subdivision method. It is shown that although non-causal artifacts are\npresent in the rescattering model they have no appreciable effects on the\ncalculated observables, thus strengthing the confidence in the results of this\nrescattering model for RHIC energies."}, "authors": ["T. J. Humanic"], "author_detail": {"name": "T. J. Humanic"}, "author": "T. J. Humanic", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevC.73.054902", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/nucl-th/0602027v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/nucl-th/0602027v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "14 pages, 8 figures", "arxiv_primary_category": {"term": "nucl-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "nucl-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/nucl-th/0602027v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/nucl-th/0602027v1", "journal_reference": "Phys.Rev.C73:054902,2006", "doi": "10.1103/PhysRevC.73.054902", "fulltext": "Effects of non-causal artifacts in a hadronic rescattering model for\nRHIC collisions\nT. J. Humanic∗\nDepartment of Physics, The Ohio State University, Columbus, OH 43210\n\narXiv:nucl-th/0602027v1 9 Feb 2006\n\n(Dated: August 10, 2018)\n\nAbstract\nIt has been shown that calculations based on a hadronic rescattering model agree reasonably\nwell with experimental results from RHIC Au+Au collisions. Because of the large particle densities\nintrinsically present at the early time steps of Monte Carlo calculations attempting to model\nRHIC collisions undesirable artifacts resulting in non-causality may be present. The effects of such\nartifacts on observables calculated from the rescattering model are studied in the present work in\ntwo ways: 1) varying the time step and 2) using the subdivision method. It is shown that although\nnon-causal artifacts are present in the rescattering model they have no appreciable effects on the\ncalculated observables, thus strengthing the confidence in the results of this rescattering model for\nRHIC energies.\n\n∗\n\nhumanic@mps.ohio-state.edu; This work was supported by the U. S. National Science Foundation under\n\ngrant PHY-0355007.\n\n1\n\n\fI.\n\nINTRODUCTION\n\nCalculations from a simple hadronic rescattering model have been shown to agree reasonably well with experimental results obtained from the Relativistic Heavy Ion Collider\n√\n(RHIC) with s = 130 GeV and 200 GeV Au + Au collisions [1, 2, 3]. More specifically,\nthese calculations provide good representations of the data for 1) the particle mass dependence of the mT distribution slope parameters (i.e. radial flow), 2) the pT , particle mass,\nand pseudorapidity dependences of the elliptic flow, and 3) the pT , centrality, and azimuthal\nangle dependences of two-pion Hanbury-Brown-Twiss (HBT) measurements. Although the\nagreement between the model and data is sometimes more qualitative than quantitative, this\nagreement with such a broad range of RHIC experimental observables is still a noteworthy\naccomplishment for a single, simple, model.\nMany hadrons are initially produced in a relatively small volume in RHIC-type collisions,\nparticularly at early times in the interaction. It is a challenging task for a Monte Carlo\ncalculation of this type to deal accurately with binary collisions between particles in such\na large particle density environment without introducing numerical artifacts which may\naffect the results. One such undesirable artifact that can occur when the interaction range\nbetween two particles is much greater than the scattering mean-free-path is non-causality of\nthe collisions resulting in superluminal particle velocities[4, 5]. The method of subdivision\ncan be used to minimize these artifacts associated with high particle density[6].\nThe effects of such artifacts on observables calculated from the rescattering model are\nstudied in the present work in two ways: 1) varying the time step and 2) using the subdivision method. The goal will be to determine whether non-causal artifacts are present in\nthe rescattering model and, if so, whether they have appreciable effects on the calculated\nobservables. This will provide a test of whether or not one can have confidence in the results of this rescattering model for RHIC energies. Section II will describe the calculational\nmethods used and Section III with give the results of the study.\n\n2\n\n\fII.\n\nCALCULATIONAL METHODS\nA.\n\nHadronic rescattering calculation\n\nA brief description of the rescattering model calculational method is given below. The\nmethod used is similar to that used in previous calculations for lower CERN Super Proton\nSynchrotron (SPS) energies [7]. Rescattering is simulated with a semi-classical Monte Carlo\ncalculation which assumes strong binary collisions between hadrons. The Monte Carlo calculation is carried out in three stages: 1) initialization and hadronization, 2) rescattering\nand freeze out, and 3) calculation of experimental observables. Relativistic kinematics is\nused throughout. All calculations are made to simulate RHIC-energy Au+Au collisions.\nThe hadronization model employs simple parameterizations to describe the initial momenta and space-time of the hadrons similar to that used by Herrmann and Bertsch [8].\nThe initial momenta are assumed to follow a thermal transverse (perpendicular to the beam\ndirection) momentum distribution for all particles,\n1 dN\nmT\n=C\nmT dmT\nexp ( mTT ) ± 1\nwhere mT =\n\np\n\n(1)\n\npT 2 + m0 2 is the transverse mass, pT is the transverse momentum, m0 is\n\nthe particle rest mass, C is a normalization constant, and T is the initial \"temperature\nparameter\" of the system, and a gaussian rapidity distribution for mesons,\n(y − y0 )2\n]\ndN/dy = D exp [−\n2σy 2\n\n(2)\n\nwhere y = 0.5 ln [(E + pz )/(E − pz )] is the rapidity, E is the particle energy, pz is the\nlongitudinal (along the beam direction) momentum, D is a normalization constant, y0 is the\ncentral rapidity value (mid-rapidity), and σy is the rapidity width. Two rapidity distributions\nfor baryons have been tried: 1) flat and then falling off near beam rapidity and 2) peaked at\ncentral rapidity and falling off until beam rapidity. Both baryon distributions give about the\nsame results. The initial space-time of the hadrons for b = 0 fm (i.e. zero impact parameter\nor central collisions) is parameterized as having cylindrical symmetry with respect to the\nbeam axis. The transverse particle density dependence is assumed to be that of a projected\nuniform sphere of radius equal to the projectile radius, R (R = r0 A1/3 , where r0 = 1.12\nfm and A is the atomic mass number of the projectile). For b > 0 (non-central collisions)\nthe transverse particle density is that of overlapping projected spheres whose centers are\n3\n\n\fseparated by a distance b. The particle multiplicities for b > 0 are scaled from the b = 0\nvalues by the ratio of the overlap volume to the volume of the projectile. The longitudinal\nparticle hadronization position (zhad ) and time (thad ) are determined by the relativistic\nequations [9],\nzhad = τhad sinh y\n\n(3)\n\nthad = τhad cosh y\nwhere y is the particle rapidity and τhad is the hadronization proper time. Thus, apart\nfrom particle multiplicities, the hadronization model has three free parameters to extract\nfrom experiment: σy , T and τhad . The hadrons included in the calculation are pions, kaons,\nnucleons and lambdas (π, K, N, and Λ), and the ρ, ω, η, η ′ , φ, ∆, and K ∗ resonances. For\nsimplicity, the calculation is isospin averaged (e.g. no distinction is made among a π + , π 0 ,\nand π − ). Resonances are present at hadronization and also can be produced as a result of\nrescattering. Initial resonance multiplicity fractions are taken from Herrmann and Bertsch\n[8], who extracted results from the HELIOS experiment [10]. The initial resonance fractions\nused in the present calculations are: η/π = 0.05, ρ/π = 0.1, ρ/ω = 3, φ/(ρ + ω) = 0.12,\nη ′ /η = K ∗ /ω = 1 and, for simplicity, ∆/N = 0.\nThe second stage in the calculation is rescattering which finishes with the freeze out\nand decay of all particles. Starting from the initial stage (t = 0 fm/c), the positions of all\nparticles are allowed to evolve in time in small time steps (normally ∆t = 0.1 fm/c is used)\naccording to their initial momenta. At each time step each particle is checked to see a) if it\ndecays, and b) if it is sufficiently close to another particle to scatter with it. Isospin-averaged\ns-wave and p-wave cross sections for meson scattering are obtained from Prakash et al. [11].\nThe calculation is carried out to 100 fm/c, although most of the rescattering finishes by\nabout 30 fm/c. The rescattering calculation is described in more detail elsewhere [7].\nCalculations are carried out assuming initial parameter values and particle multiplicities for each type of particle. In the last stage of the calculation, the freeze-out and decay\nmomenta and space-times are used to produce observables such as pion, kaon, and nucleon\nmultiplicities and transverse momentum and rapidity distributions. The values of the initial\nparameters of the calculation and multiplicities are constrained to give observables which\nagree with available measured hadronic observables. As a cross-check on this, the total kinetic energy from the calculation is determined and compared with the RHIC center of mass\n4\n\n\fenergy to see that they are in reasonable agreement. Particle multiplicities were estimated\nfrom the charged hadron multiplicity measurements of the RHIC PHOBOS experiment [12].\nCalculations were carried out using isospin-summed events containing at freezeout for central collisions (b = 0 fm) about 5000 pions, 500 kaons, and 650 nucleons (Λ's were decayed).\nThe hadronization model parameters used were T = 300 MeV, σy =2.4, and τhad =1 fm/c.\nIt is interesing to note that the same value of τhad was required in a previous rescattering\ncalculation to successfully describe results from SPS Pb+Pb collisions [7].\nAs an indicator of the presence of superluminal artifacts, the transverse signal propagation\nvelocity, vsT , is calculated for all particle pairs in the rescattering calculation for each time\nstep from[5]\nvs =\n\nr1 (tpres ) − r2 (tprev )\ntpres − tprev\nq\n2 + v2\nvsT = vsx\nsy\n\n(4)\n\nwhere vs is the signal propagation velocity vector, r1 (tpres ) is the position of particle 1 for\nthe present collision with particle 2 at time tpres , r2 (tprev ) is the position of particle 2 for\nits previous collision at time tprev , and vsx and vsy are the perpendicular components of vs\nin the transverse plane. Note that even though the rescattering calculations are carried out\nwith relativistic kinematics, it is still possible for vsT to be greater than c for some particle\npairs due to the details of how the two-particle collisions are implemented.\n\nB.\n\nSubdivision method\n\nThe method of subdivision is based on the invariance of Monte Carlo particle-scattering\ncalculations for a simultaneous decrease of the scattering cross sections by some factor, l,\nand increase of the particle density by l, where l is called the subdivision[4]. As l becomes\nsufficiently large, non-causal artifacts become insignificant. The present rescattering calculation will be tested comparing pion observables from the \"nominal\" calculation, i.e. l = 1,\nwith subdivisions of l = 5 and l = 8. Note that a subdivision of l = 5 has been shown to\nsignificantly suppress non-causal artifacts present in some Monte Carlo calculations[4, 5].\nSince the particle density increase is accomplished by increasing the particle number by a\nfactor l, the computer CPU time taken per event increases by a factor l2 . For the present\nstudy, 1640, 124 and 120 events were generated for the l = 1, l = 5, and l = 8 samples,\n5\n\n\frespectively. Fortunately, the statistical value of the l > 1 events is l times greater per event\nthan for l = 1. As an example, the CPU time taken to generate the l = 8 sample of events\nwas 600 CPU-hours on 2.8 GHz PC processors at the Ohio Supercomputing Center.\n\nIII.\n\nRESULTS\n\nFigures 1-8 present results from the hadronic rescattering model simulating hadrons produced in RHIC-energy collisions for various time steps and subdivisions. Quantities plotted\nare vsT histograms including all particles in the calculation and several hadronic observables.\nDescriptions of how the observables are extracted from the rescattering calculation are given\nelsewhere[2]. All calculations are carried out for a mid-rapidity bin, −2 < y < 2, and for an\nimpact parameter of 8 fm to simulate a medium non-central collision which should result\nin significant elliptic flow for the purposes of the present test. Statistical errors are shown\neither as error bars or are of the order of the marker size when error bars are not shown.\n\nA.\n\nTime step study\n\nFigures 1-4 show comparisons of various quantities for three different time steps in the\nrescattering calculations, ∆t = 0.1, 0.05 and 0.2 fm/c. The time step used in calculating\nobservables which have been compared with RHIC data is ∆t = 0.1 fm/c[1, 2, 3], so the\nother time steps used represent half of the usual step and twice the usual step. Figure 1\nshows vsT histograms. It is seen that vsT extends beyond c with an exponential tail for all\ntime steps, indicating the presence of superluminal artifacts. For vsT < c all time steps lie\non top of each other whereas for vsT > c they differ somewhat according to what would be\nexpected for the different time steps, i.e. smaller and thus more frequent time steps should\nenhance the superluminal artifacts, whereas larger and thus less frequent time steps should\nreduce the artifacts. For ∆t = 0.05 fm/c an enhancement of ∼ 10 − 20% in the artifacts\nover the nominal case is seen, while in the case of ∆t = 0.2 fm/c a reduction in the artifacts\nby about 30% over the nominal time step is seen.\nThe effects of these time steps on various hadronic observables are shown in Figures 2-4.\n\nFigure 2 shows mT distributions for pions, kaons, and nucleons, Figure 3 shows the elliptic\n\n6\n\n\fsT\n\ndn/dv (arb. norm.)\n\n1000\n\nTransv. signal velocity distribution\nfor all particles from rescattering code\nRHIC, b=8 fm\n\n100\n\nTime step size\n∆t = 0.1 fm/c\n∆t = 0.05 fm/c\n∆t = 0.2 fm/c\n\n10\n0\n\n0.5\n\n1\n\n1.5\nv /c\n\n2\n\n2.5\n\n3\n\nsT\n\nFIG. 1: Transverse signal velocity distributions for all particles for various time steps.\n\nflow, V2 , vs. pT for pions and Figure 4 shows two-pion HBT source parameters[3] vs. pT . As\nseen in all three figures, even though the different time steps have noticeable effects on the\nartifacts (as seen in Figure 1), they do not significantly effect the hadronic observables, the\nobservables for all three time steps agreeing within the statistical errors of the calculations.\n\nB.\n\nSubdivision study\n\nSince it could be argued that the time step study presented above may not reduce the\nsuperluminal artifacts enough to see significant effects on the hadronic observables, the\nsubdivision test is also employed since it provides a greater ability to reduce these artifacts.\nThis is seen in Figure 5 which shows vsT histograms for the three subdivision used: l = 1, 5\nand 8. While all three subdivisions mostly lie on top of each other for vsT < c, one sees\nfactors of 5-10 reductions in the superluminal artifacts for l = 5 and 8. If these artifacts have\na large influence on the values of the hadronic observables extracted from the rescattering\n7\n\n\fm distributions from rescattering\n\n100\n\nT\n\nTime step size\n\n10\n\nπ\n\n∆t = 0.1 fm/c\n∆t = 0.05 fm/c\n∆t = 0.2 fm/c\n\n1\n\nT\n\nT\n\n1/m dn/dm (arb.norm.)\n\nRHIC, b=8 fm, mid-y\n\nK\n0.1\nN/10\n0.01\n\n0.001\n0\n\n0.5\n\n1\nm (GeV)\n\n1.5\n\n2\n\nT\n\nFIG. 2: Pion, kaon, and nucleon mT distributions for various time steps.\n\nmodel, it should surely be evident for the l = 5 and 8 cases. Figures 6-8 show the effects of\nthese different subdivisions on pion pT distributions, elliptic flow and HBT, respectively.\nAs was the case in the time step study, the hadronic observables shown in Figures 68 are not significantly effected by the different subdivisions used in spite of the fact that\nsuperluminal artifacts are greatly suppressed in the subdivision study.\n\nIV.\n\nDISCUSSION AND CONCLUSIONS\n\nIt can be concluded from Figures 1-8 that non-causal (superluminal) artifacts while being\npresent in the hadronic rescattering code used in this study do not significantly effect the\nhadronic observables calculated from this code. It is possible to speculate on why this is\nthe case. There are three main features of the code which might tend to reduce the effects\nof these artifacts: 1) individual particles are allowed to scatter only once per time step,\n2) a \"scattering time\" of two nominal time steps is defined during which particles that\n8\n\n\f0.16\nPion elliptic flow, rescattering code\nRHIC, b=8 fm, mid-y\n\nV\n\n2\n\n0.12\n\n0.08\n\nTime step size\n0.04\n\n∆t = 0.1 fm/c\n∆t = 0.05 fm/c\n∆t = 0.2 fm/c\n\n0\n0\n\n2\n\n1\n\n3\n\np (GeV/c)\nT\n\nFIG. 3: Pion elliptic flow vs. pT for various time steps.\n\nhave scattered are not allowed to rescatter, and 3) once two particles have scattered with\neach other, they are not allowed to scatter with each other again in the calculation. The\npresent study was performed for non-central collisions (b = 8 fm), but it is expected that\nthe same conclusion, i.e. that superluminal artifacts do not significantly effect the results of\ncalculations with the rescattering code, would also be obtained for central collisions. This is\nbecause the particle density is not very different for central collisions in the model than for\nmid-peripheral collisions since the particle multiplicities are scaled by the overlap volume\nfor b > 0, as mentioned earlier.\nIn summary, two methods have been used to test the validity of the present rescattering\nmodel calculations in the presence of non-causal (superluminal) artifacts. It is found that\nthe results of this model are not appreciably effected by such artifacts, thus strengthing the\nconfidence in the results presented previously from this rescattering model for RHIC.\n\n9\n\n\f6\n\n5\nRadius parameter (fm)\n\nλ\nRside\nRout\nRlong\n\nππ HBT from rescattering\nRHIC, b=8 fm, mid-y\n\nopen: ∆t=0.1 fm/c\ngrey: ∆t=0.05 fm/c\nblack: ∆t=0.2 fm/c\n\n4\n\n3\n\n1\n\n2\n\nλ\n\n1\n\n0\n\n0\n0\n\n0.2\n\n0.4\n0.6\np (GeV/c)\n\n0.8\n\n1\n\nT\n\nFIG. 4: Two-pion HBT source parameters vs. pT for various time steps. The ordinate scale for λ\nis shown to the right.\n\nAcknowledgments\n\nThe author wishes to thank Tamás Csörgő, Dénes Molnár and Derek Teaney for helpful\ndiscussions relating to this paper. This work was supported by the U. S. National Science\nFoundation under grant PHY-0355007.\n\n[1] T. J. Humanic, Nucl. Phys. A 715, 641 (2003)\n[2] T. J. Humanic, arXiv:nucl-th/0205053.\n[3] T. J. Humanic, Int. J. Mod. Phys. E 15, 197 (2006)\n[4] B. Zhang, M. Gyulassy and Y. Pang, Phys. Rev. C 58, 1175 (1998)\n[5] D. Molnár and M. Gyulassy, Phys. Rev. C 62, 054907 (2000)\n[6] B. Zhang, Comput. Phys. Commun. 109, 193 (1998)\n\n10\n\n\fSubdivision\nl=1\nl=5\nl=8\n\nsT\n\ndn/dv (normalized)\n\n1000\n\nTransv. signal vel. dist.\nall particles\nrescattering code\nRHIC Au+Au\n8 fm impact param.\n\n100\n\n10\n0\n\n0.5\n\n1\n\n1.5\nv /c\n\n2\n\n2.5\n\n3\n\nsT\n\nFIG. 5: Transverse signal velocity distributions for all particles for l = 1, 5, and 8.\n\n[7] T. J. Humanic, Phys. Rev. C 57, 866 (1998).\n[8] M. Herrmann and G. F. Bertsch, Phys. Rev. C 51, 328 (1995).\n[9] J. D. Bjorken, Phys. Rev. D 27, 140 (1983).\n[10] U. Goerlach et al. [HELIOS Collaboration], Nucl. Phys. A 544, 109C (1992).\n[11] M. Prakash, M. Prakash, R. Venugopalan and G. Welke, Phys. Rept. 227, 321 (1993).\n[12] B. B. Back et al. [PHOBOS Collaboration], Phys. Rev. Lett. 85, 3100 (2000).\n\n11\n\n\f4\n\n10\n\np distributions for pions\nT\n\nRHIC, b=8 fm, mid-y\n\n100\n\nSubdivision\n\n10\n\nl=1\nl=5\nl=8\n\nT\n\nT\n\n1/p dn/dp (arb. norm.)\n\n1000\n\n1\n\n0.1\n0\n\n1\n\n2\np (GeV/c)\nT\n\nFIG. 6: Pion pT distributions for l = 1, 5, and 8.\n\n12\n\n3\n\n\f0.16\nPion elliptic flow, rescattering code\nRHIC, b=8 fm, mid-y\n\nV\n\n2\n\n0.12\n\n0.08\nSubdivision\nl=1\nl=5\nl=8\n\n0.04\n\n0\n0\n\n1\n\n2\np (GeV/c)\nT\n\nFIG. 7: Pion elliptic flow vs. pT for l = 1, 5, and 8.\n\n13\n\n3\n\n\f6\nππ HBT from rescattering\nRHIC, b=8 fm, mid-y\n\nRadius parameter (fm)\n\n5\n\n4\n\nλ\nRside\nRout\nRlong\nopen: subdiv = 1\ngrey: subdiv = 5\nblack: subdiv = 8\n\n3\n\n1\n\n2\n\nλ\n\n1\n\n0\n\n0\n0\n\n0.2\n\n0.4\n0.6\np (GeV/c)\n\n0.8\n\n1\n\nT\n\nFIG. 8: Two-pion HBT source parameters vs. pT for l = 1, 5, and 8. The ordinate scale for λ is\nshown to the right.\n\n14\n\n\f"}