{"id": "http://arxiv.org/abs/physics/0006066v1", "guidislink": true, "updated": "2000-06-26T21:58:50Z", "updated_parsed": [2000, 6, 26, 21, 58, 50, 0, 178, 0], "published": "2000-06-26T21:58:50Z", "published_parsed": [2000, 6, 26, 21, 58, 50, 0, 178, 0], "title": "Theory of coherent photoassociation of a Bose-Einstein condensate", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=physics%2F0602099%2Cphysics%2F0602177%2Cphysics%2F0602081%2Cphysics%2F0602159%2Cphysics%2F0602071%2Cphysics%2F0602178%2Cphysics%2F0602059%2Cphysics%2F0602088%2Cphysics%2F0602022%2Cphysics%2F0602060%2Cphysics%2F0602100%2Cphysics%2F0602183%2Cphysics%2F0602147%2Cphysics%2F0602010%2Cphysics%2F0602187%2Cphysics%2F0602058%2Cphysics%2F0602040%2Cphysics%2F0602153%2Cphysics%2F0602102%2Cphysics%2F0602051%2Cphysics%2F0602092%2Cphysics%2F0602054%2Cphysics%2F0602046%2Cphysics%2F0602037%2Cphysics%2F0602135%2Cphysics%2F0602025%2Cphysics%2F0602118%2Cphysics%2F0602122%2Cphysics%2F0602143%2Cphysics%2F0602138%2Cphysics%2F0602057%2Cphysics%2F0602164%2Cphysics%2F0006026%2Cphysics%2F0006043%2Cphysics%2F0006060%2Cphysics%2F0006061%2Cphysics%2F0006014%2Cphysics%2F0006053%2Cphysics%2F0006076%2Cphysics%2F0006068%2Cphysics%2F0006013%2Cphysics%2F0006017%2Cphysics%2F0006023%2Cphysics%2F0006078%2Cphysics%2F0006056%2Cphysics%2F0006033%2Cphysics%2F0006077%2Cphysics%2F0006080%2Cphysics%2F0006020%2Cphysics%2F0006059%2Cphysics%2F0006042%2Cphysics%2F0006010%2Cphysics%2F0006072%2Cphysics%2F0006049%2Cphysics%2F0006007%2Cphysics%2F0006006%2Cphysics%2F0006066%2Cphysics%2F0006034%2Cphysics%2F0006048%2Cphysics%2F0006012%2Cphysics%2F0006036%2Cphysics%2F0006071%2Cphysics%2F0006002%2Cphysics%2F0006046%2Cphysics%2F0006001%2Cphysics%2F0006067%2Cphysics%2F0006082%2Cphysics%2F0006047%2Cphysics%2F0006032%2Cphysics%2F0006050%2Cphysics%2F0006070%2Cphysics%2F0006075%2Cphysics%2F0006039%2Cphysics%2F0006003%2Cphysics%2F0006011%2Cphysics%2F0006028%2Cphysics%2F0006025%2Cphysics%2F0006074%2Cphysics%2F0006057%2Cphysics%2F0006069%2Cphysics%2F0006063%2Cphysics%2F0006021%2Cphysics%2F0006005%2Cphysics%2F0006027%2Cphysics%2F0006058%2Cphysics%2F0006054%2Cphysics%2F0006016%2Cphysics%2F0006019%2Cphysics%2F0006004%2Cphysics%2F0006022%2Cphysics%2F0006045%2Cphysics%2F0006037%2Cphysics%2F0006073%2Cphysics%2F0006009%2Cphysics%2F0006038%2Cphysics%2F0006041%2Cphysics%2F0006055%2Cphysics%2F0006015%2Cphysics%2F0006008%2Cphysics%2F0006062%2Cphysics%2F0006035&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Theory of coherent photoassociation of a Bose-Einstein condensate"}, "summary": "We study coherent photoassociation, phenomena analogous to coherent optical\ntransients in few-level systems, which may take place in photoassociation of an\natomic Bose-Einstein condensate but not in a nondegenerate gas. We develop a\nsecond-quantized Hamiltonian to describe photoassociation, and apply the\nHamiltonian both in the momentum representation and in the position\nrepresentation (field theory). Solution of the two-mode problem including only\none mode each for the atomic and molecular condensates displays analogs of Rabi\noscillations and rapid adiabatic passage. A classical version of the field\ntheory for atoms and molecules is used to demonstrate that, in the presence of\nphotoassociating light, a joint-atom molecule is unstable against growth of\ndensity fluctuations. Experimental complications, including spontaneous\nemission and unwanted \"rogue\" photodissociation from a photoassociated molecule\nare analyzed. A two-color Raman scheme is studied as a method to set up an\neffective two-mode scheme with reduced spontaneous emission losses. We discuss\nphotoassociation rates and photoassociation Rabi frequencies for high-lying\nvibrational states in alkalis both on the basis of molecular-structure\ncalculations, and by comparing with an experiment [Wynar et al., Science 287,\n1016 (2000)].", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=physics%2F0602099%2Cphysics%2F0602177%2Cphysics%2F0602081%2Cphysics%2F0602159%2Cphysics%2F0602071%2Cphysics%2F0602178%2Cphysics%2F0602059%2Cphysics%2F0602088%2Cphysics%2F0602022%2Cphysics%2F0602060%2Cphysics%2F0602100%2Cphysics%2F0602183%2Cphysics%2F0602147%2Cphysics%2F0602010%2Cphysics%2F0602187%2Cphysics%2F0602058%2Cphysics%2F0602040%2Cphysics%2F0602153%2Cphysics%2F0602102%2Cphysics%2F0602051%2Cphysics%2F0602092%2Cphysics%2F0602054%2Cphysics%2F0602046%2Cphysics%2F0602037%2Cphysics%2F0602135%2Cphysics%2F0602025%2Cphysics%2F0602118%2Cphysics%2F0602122%2Cphysics%2F0602143%2Cphysics%2F0602138%2Cphysics%2F0602057%2Cphysics%2F0602164%2Cphysics%2F0006026%2Cphysics%2F0006043%2Cphysics%2F0006060%2Cphysics%2F0006061%2Cphysics%2F0006014%2Cphysics%2F0006053%2Cphysics%2F0006076%2Cphysics%2F0006068%2Cphysics%2F0006013%2Cphysics%2F0006017%2Cphysics%2F0006023%2Cphysics%2F0006078%2Cphysics%2F0006056%2Cphysics%2F0006033%2Cphysics%2F0006077%2Cphysics%2F0006080%2Cphysics%2F0006020%2Cphysics%2F0006059%2Cphysics%2F0006042%2Cphysics%2F0006010%2Cphysics%2F0006072%2Cphysics%2F0006049%2Cphysics%2F0006007%2Cphysics%2F0006006%2Cphysics%2F0006066%2Cphysics%2F0006034%2Cphysics%2F0006048%2Cphysics%2F0006012%2Cphysics%2F0006036%2Cphysics%2F0006071%2Cphysics%2F0006002%2Cphysics%2F0006046%2Cphysics%2F0006001%2Cphysics%2F0006067%2Cphysics%2F0006082%2Cphysics%2F0006047%2Cphysics%2F0006032%2Cphysics%2F0006050%2Cphysics%2F0006070%2Cphysics%2F0006075%2Cphysics%2F0006039%2Cphysics%2F0006003%2Cphysics%2F0006011%2Cphysics%2F0006028%2Cphysics%2F0006025%2Cphysics%2F0006074%2Cphysics%2F0006057%2Cphysics%2F0006069%2Cphysics%2F0006063%2Cphysics%2F0006021%2Cphysics%2F0006005%2Cphysics%2F0006027%2Cphysics%2F0006058%2Cphysics%2F0006054%2Cphysics%2F0006016%2Cphysics%2F0006019%2Cphysics%2F0006004%2Cphysics%2F0006022%2Cphysics%2F0006045%2Cphysics%2F0006037%2Cphysics%2F0006073%2Cphysics%2F0006009%2Cphysics%2F0006038%2Cphysics%2F0006041%2Cphysics%2F0006055%2Cphysics%2F0006015%2Cphysics%2F0006008%2Cphysics%2F0006062%2Cphysics%2F0006035&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We study coherent photoassociation, phenomena analogous to coherent optical\ntransients in few-level systems, which may take place in photoassociation of an\natomic Bose-Einstein condensate but not in a nondegenerate gas. We develop a\nsecond-quantized Hamiltonian to describe photoassociation, and apply the\nHamiltonian both in the momentum representation and in the position\nrepresentation (field theory). Solution of the two-mode problem including only\none mode each for the atomic and molecular condensates displays analogs of Rabi\noscillations and rapid adiabatic passage. A classical version of the field\ntheory for atoms and molecules is used to demonstrate that, in the presence of\nphotoassociating light, a joint-atom molecule is unstable against growth of\ndensity fluctuations. Experimental complications, including spontaneous\nemission and unwanted \"rogue\" photodissociation from a photoassociated molecule\nare analyzed. A two-color Raman scheme is studied as a method to set up an\neffective two-mode scheme with reduced spontaneous emission losses. We discuss\nphotoassociation rates and photoassociation Rabi frequencies for high-lying\nvibrational states in alkalis both on the basis of molecular-structure\ncalculations, and by comparing with an experiment [Wynar et al., Science 287,\n1016 (2000)]."}, "authors": ["Marijan Kostrun", "Matt Mackie", "Robin Cote", "Juha Javanainen"], "author_detail": {"name": "Juha Javanainen"}, "author": "Juha Javanainen", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevA.62.063616", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/physics/0006066v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/physics/0006066v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "24 pages, 7 figures; submitted to Phys. Rev. A", "arxiv_primary_category": {"term": "physics.atom-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.atom-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.chem-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/physics/0006066v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/physics/0006066v1", "journal_reference": "Phys. Rev. A 62, 063616 (2000) (23 pages)", "doi": "10.1103/PhysRevA.62.063616", "fulltext": "Theory of coherent photoassociation of a Bose-Einstein condensate\nMarijan Kos̆trun, Matt Mackie, Robin Côté, and Juha Javanainen\n\narXiv:physics/0006066v1 [physics.atom-ph] 26 Jun 2000\n\nDepartment of Physics, University of Connecticut, Storrs, Connecticut 06269-3046\n(Dated: October 30, 2018)\nWe study coherent photoassociation, phenomena analogous to coherent optical transients in fewlevel systems, which may take place in photoassociation of an atomic Bose-Einstein condensate\nbut not in a nondegenerate gas. We develop a second-quantized Hamiltonian to describe photoassociation, and apply the Hamiltonian both in the momentum representation and in the position\nrepresentation (field theory). Solution of the two-mode problem including only one mode each for\nthe atomic and molecular condensates displays analogs of Rabi oscillations and rapid adiabatic passage. A classical version of the field theory for atoms and molecules is used to demonstrate that, in\nthe presence of photoassociating light, a joint-atom molecule is unstable against growth of density\nfluctuations. Experimental complications, including spontaneous emission and unwanted \"rogue\"\nphotodissociation from a photoassociated molecule are analyzed. A two-color Raman scheme is\nstudied as a method to set up an effective two-mode scheme with reduced spontaneous emission\nlosses. We discuss photoassociation rates and photoassociation Rabi frequencies for high-lying vibrational states in alkalis both on the basis of molecular-structure calculations, and by comparing\nwith an experiment [Wynar et al., Science 287, 1016 (2000)].\n\nI.\n\nINTRODUCTION\n\nLaser cooling and its spin-offs now routinely produce gaseous samples in which thermal energies, when\nexpressed as frequencies, are smaller than the typical\nlinewidth of an optical dipole transition. Photoassociating transitions, in which two thermal atoms combine\nin the presence of light to make a molecule, may therefore exhibit linewidths every bit as narrow as the transitions one encounters in nonlinear laser spectroscopy.\nAs a result, photoassociation spectroscopy [1] has become the source of the most accurate molecular structure data available. Bose-Einstein condensation [2] is\nanother recent triumph in the quest toward low temperatures in atomic physics. The connection between photoassociation and Bose-Einstein condensation has long\nbeen close, though somewhat incidental; photoassociation spectroscopy has provided key numerical data for\ncondensation experiments [3].\nThere have been early discussions of photoassociation\nof a condensate itself [4, 5]. However, to us, the true\nscope of the connection between photoassociation and\ncondensation was only revealed by our explicit observation [6] that in a thermal gas it is the same phase space\ndensity that governs both the onset of Bose-Einstein condensation and the efficiency of photoassociation.\nAt the heart of our photoassociation work lies the quasicontinuum (QC) approach [6, 7]. The idea is to enclose\ntwo colliding atoms in a box, which has the effect of discretizing the dissociation continuum of the corresponding diatomic molecule. At the end of the calculations,\nthe quantization volume is taken to infinity. Aside from\nresolving certain mathematical difficulties, this method\nturns out to have the unexpected benefit that analysis of\nphotoassociation is reverted to analysis of few-level systems, as in quantum optics or laser spectroscopy. For\ninstance, studies of two-color photoassociation schemes\nmay draw from decades of experience in quantum optics\n\nand laser spectroscopy [7].\nHowever, in its initial form our QC approach does not\napply to a quantum degenerate sample. We sought to rectify this shortcoming by introducing a phenomenological\nsecond-quantized Hamiltonian for photoassociation [8].\nThis idea was developed at the same time independently\nby Drummond et al. [9], and mathematically closely related approaches to the Feshbach resonance are also under active study [10, 11, 12]. Comparison with the QC\napproach gives the transition matrix elements to insert\ninto our Hamiltonian.\nWe first considered a two-mode model that only takes\ninto account one C.M. wave function for atoms and\none for molecules, the modes containing the atomic and\nmolecular condensates [8]. The main finding was coherent photoassociation analogous to coherent transients in\nfew-level systems. For instance, the system may exhibit\na form of Rabi flopping between atoms and molecules.\nMoreover, by properly sweeping the frequency of the\nphotoassociating laser, in a process akin to rapid adiabatic passage the atomic condensate may be turned into\na molecular condensate [8]. In another development in\nthis direction, we have argued that two-color free-boundbound stimulated Raman adiabatic passage, STIRAP,\nis feasible starting from an atomic condensate [13]. We\nhave also gone beyond the two- and three-mode approximations, allowing for an arbitrary position dependence\nof the atomic and molecular condensates, albeit in a classical approximation similar to the one underlying the\nGross-Pitaevskii equation [14]. It then turns out that\nan equilibrium with both atomic and molecular condensates present together with the photoassociating light is\nunstable. The sample tends to collapse spontaneously\ninto clumps whose densities increase with time [14].\nThe primary purposes of the present paper are to\ndocument the numerous technical and physical details\nof our second-quantized approach to photoassociation\nthat could not be accommodated by the letter format\n\n\f2\nof Refs. [8], [13], and [14], and to extend our discussion\nin several directions that support those references. To\noffer a comprehensive account of the field theory version\nof our approach to coherent photoassociation, we have\nfound it necessary to analyze the dipole matrix element\nfor photoassociation in detail. This endeavor in effect\nconstitutes an alternative derivation (c.f. Ref. [7]) of\nour entire QC methodology. Second, we add an analysis\nof two-color photoassociation of a quantum-degenerate\nsample in a three-mode approximation that is to some\nextent complementary to the one in Ref. [13]. Much\nas expected, the two-color scheme provides a reprieve\nfrom spontaneous-emission losses from the primary photoassociated state. Third, we present a quantitative\nanalysis of \"rogue\" photodissociation from a molecular condensate to atomic modes outside the condensate.\nOur suggestion [8] that with increasing light intensity\nthe unwanted photodissociation may overtake coherent\ncondensate-condensate transitions is corroborated. We\nfind a minimum usable time scale proportional to the\nthe inverse of the recoil frequency of laser cooling.\nProbably the most prominent qualitative finding\nemerging from our work is the observation that it is Bose\nenhancement that ultimately facilitates coherent transients such as Rabi flopping, adiabatic following, and\nSTIRAP in photoassociation of a condensate [13, 15].\nThroughout this paper, we continue to demonstrate how\ncoherent optical transients come about in a condensate,\nand argue why they should be absent in a nondegenerate\ngas.\nThere has recently been a remarkable experiment on\ntwo-color photoassociation of a condensate [16]. Accordingly, we include a detailed discussions on the values of\nexperimental parameters in alkalis in general, and the parameters of Ref. [16] in particular. The analysis of the\nactual experiment demonstrates that there is still some\nway to go before genuinely coherent photoassociation is\nreached.\nIn Sec. II we give a walk-through of our secondquantized Hamiltonian, including a detailed discussion of\nthe dipole moment matrix element and both the momentum and position representation of the Hamiltonian. The\nspecial case with only one spatial mode for both atoms\nand molecules is the subject of Sec. III. The classical version of the field theory, but including all spatial modes,\nis the subject of Sec. IV. The numerous complications\nto our one color scheme that one is liable to encounter in\nreal experiments, as well as the experimental parameter\nvalues, are the subject of Sec. V. The brief remarks in\nSec. VI conclude the paper. There are also two appendices, A on the details of the relation of the dipole matrix\nelement between second-quantized and quasicontinuum\napproaches, and B on the role of atom-atom collisions in\nour development.\n\nII.\n\nFIELD THEORY FOR ATOMS AND\nMOLECULES\n\nThe task of the present section is to develop in detail\nthe second-quantized approach governing photoassociation of atoms into molecules in the prototype case of one\nlaser color only. Simple heuristic arguments based on\nRefs. [6, 7] could, and did, achieve most of our aims in\nRef. [8] where we dealt primarily with the momentum\nrepresentation, but the field theory of Ref. [14] calls for a\nfew additional angles. To support them, we present here\na partially new ab-initio discussion of our QC method.\nWe take the photoassociating atoms to be in precisely\none internal state, and similarly we assume that photoassociation leads to molecules with precisely one internal\nstate. These assumptions could be relaxed, but then one\nhas to follow the fate of the internal states as well. We do\nnot go into this, but in essence assume that (i) the atoms\nare polarized and that (ii) the photoassociation resonance\nin itself selects a unique final state for the molecule.\n\nA.\n\nTwo atoms\n\nWe begin with a pair of atoms, assumedly in the dissociation continuum of a given potential energy curve of\na diatomic molecule. As the atoms interact, their relative momentum need not be a constant of the motion.\nNonetheless, given a finite range for atom-atom interactions, in free space the wave functions of the relative motion φk (r) could still be characterized by the asymptotic\n(r → ∞) wave vector k.\nOn the other hand, in the spirit of the QC method [6,\n7], we assume that the relative motion of the atoms is\nconfined to a finite volume V . There are two basic questions in our two-atom analysis that must be considered.\nFirst, our phenomenological many-particle Hamiltonian\n(Ref. [8] and Eq. (12) below) is written down in terms of\nplane waves, yet it is more common to analyze photoassociation in terms of angular-momentum partial waves.\nHow do we make the connection? Second, in our quasicontinuum method we resort to a finite quantization\nvolume V , which tends to infinity only at the end of the\ncalculations. How should we handle the finite quantization volume?\nWe quantize the relative motion of the two atoms in a\nspherical box of radius R and volume V = 43 πR3 using reflecting boundary conditions. While angular momentum\nis still a constant of the motion, the usual eigenstates [7]\nof the relative motion cannot be characterized by a momentum vector, even asymptotically. Nonetheless, it is\nevidently possible to construct orthonormal superpositions φ̄k (r) of the eigenstates of the spherical box that in\nthe limit of a large box turn into the states φk (r), i.e.,\nstates that behave like plane waves at large distances.\nLet us first take the inner product of a true plane wave,\nnormalized to the volume V , with a spherically symmetric (real) test function f (r) with a finite range ≪ R. In\n\n\f3\nthe limit k → 0 we have\nZ R\nZ ∞\n1\n1\nd3 r eik*r f (r) ≃ √\n4πr2 dr f (r) .\nI1 = lim √\nk→0\nV 0\nV 0\n(1)\nNext we take the same inner product for the l = 0 partial\nwave of the plane wave eik*r , basically the spherical Bessel\nfunction j0 (kr) ∝ sin kr/r. We normalize this partial\nwave also in the spherical box, or equivalently, in the\nradial coordinate r with respect to the measure 4πr2 dr.\nIn the limit of small k we have the integral for the inner\nproduct\nI2\n\nZ R\nsin kr\n1\nf (r)\n4πr2 dr\n= √\nr\n2πR 0\nZ ∞\nk\n4πr2 dr f (r) .\n≃ √\n2πR 0\n\nr\n\n2πR\n,\nV\n\nThe notation φ̄0k (r) stands for the radial l = 0 wave function of the relative motion of the two atoms corresponding to the wave number k, and normalized to volume V\nas usual.\nA convenient qualitative model is provided by the limiting form\nφ̄0k (r) = √\n\n(2)\n\nObviously, the ratio of the two,\nI1\n1\nα(k) =\n=\nI2\nk\n\nthe wave function φ̄k (r) counts. Taking into account the\nweight from Eq. (3), we have\nr\nZ\n1 2πR R\n4πr2 dr ψ̄ ∗ (r)φ̄0k (r) .\n(5)\nd(k) = d\nk\nV\n0\n\n(3)\n\nis the expansion coefficient of the s-wave in the plane\nwave, given that both the plane wave and the s-wave are\nnormalized to the volume V . Actually, the k values of\nthe spherical eigenmodes are quantized, and the smallest\nvalue is k = π/R. We therefore have to be careful with\nthe limit k → 0 when applying Eq. (3).\nWhen atom-atom interactions are taken into account,\nthe radial eigenstates for a given angular momentum are\nnot just spherical Bessel functions, but also reflect the\nscattering phase shifts. Henceforth we assume that only\ns-wave scattering needs to be considered, as is usually\nthe case for bosons at sufficiently low temperatures. Obviously, even though the partial waves have phase shifts,\nby tweaking the phases of the partial waves it is still possible to make an asymptotic near-plane wave φ̄k (r) out\nof the eigenstates of the relative motion of the atoms in\nthe sphere. The adjustment of phases has no effect on\nthe weight of the s-wave component in φ̄k (r), which may\nstill be inferred from Eq. (3).\nLet us denote the wave function of the particular\nmolecular state we are aiming for by ψ̄(r), and make the\nstandard (albeit crude) approximation that the relevant\nelectronic dipole matrix element d is a constant independent of the relative coordinate r of the atoms comprising\nthe molecule. Then the QC dipole matrix element for\nphotoassociation and photodissociation characterizing a\nprocess in which the relative momentum of the colliding\natoms is h̄k reads simply\nZ\nd(k) = d d3 r ψ̄ ∗ (r)φ̄k (r) .\n(4)\nWe only consider s-wave collisions, and correspondingly\nset ψ̄(r) = ψ̄(r) as appropriate for a nonrotating J =\n0 molecule. Of course, only the l = 0 component of\n\n1\nsin k(r − a)\n,\nr\n2πR\n\n(6)\n\nwhere a is the s-wave scattering length. Combination of\n(5) and (6) gives\nZ R\n4π\nd(k) = d √\nr dr sin k(r − a)ψ̄ ∗ (r) .\n(7)\nk V 0\nThe form (6) is only valid outside the range of the atomatom interaction potential, and for small enough k so\nthat the scattering phase shift may be written as ka.\nEquation (7) is therefore quantitatively reliable only if\nthe vibrational bound-state wave function of the molecule\nψ̄(r) happens to reside outside the range of the atomatom interactions of the photoassociating atoms. In fact,\nthis is the case in some of the current photoassociation\nexperiments [17, 18].\nThe matrix element (7) is explicitly proportional to\nV −1/2 . In fact, the V −1/2 scaling of d(k) is a generic\nproperty of our QC approach, and does not depend on\nthe specific assumptions of Eq. (7). First, the almostplane wave φ̄k (r) is normalized to the volume V . No\nmatter what kind of (square integrable) structure occurs\naround r ∼ 0, the plane-wave form at large distances\nmakes the normalization constant proportional to V −1/2 .\nSecond, because of the finite range of the bounded molecular wave function ψ̄(r), its normalization coefficient does\nnot depend on V . Third, thanks to the same finite range,\nthe integral (4) effectively extends only over a finite, fixed\nvolume. The net result is that the matrix element indeed\nis proportional to the normalization constant of φ̄k (r),\n∝ V −1/2 .\nAnother important property of the matrix element (7),\nthat it tends to a constant as k → 0, is also a generic\nfeature of the physics. Namely, for small enough k, the\nform of the s-wave φ̄0k (r) indeed is sin k(r − a)/r, except\nwithin the range of atom-atom interactions. But within\nthis range, the shape of φ̄0k (r) is independent of k at small\nenough k. In order that the inner and the outer forms join\nsmoothly, the amplitude of the inner wave function must\nbe ∝ k for small k, just as is the amplitude of the outer\nwave function. So, for small enough k, the wave function\nφ̄0k (r) is ∝ k for all of those r for which the bound-state\nwave function ψ̄(r) is effectively nonzero. The matrix\nelements (4), (5) and (7) therefore all tend to a constant\nas k → 0.\n\n\f4\nIn order to prepare for the comparison between photoassociation and photodissociation, let us assume that\na laser field with the amplitude\nE(t) = 21 Ee−iωt + c.c.\n\n(8)\n\nis incident on a molecule. We denote the detuning of the\nlight above the photodissociation threshold by δ. Given\nthe reduced mass of the colliding atoms μ, the corresponding resonant wave number k0 and velocity v0 are\nsuch that h̄k02 /2μ = δ and v0 = h̄k0 /μ. Using the standard dipole and rotating-wave approximations as well as\nFermi's golden rule, we have the photodissociation rate\n\u0013\nZ\n2 \u0012\n2π\nd(k) * E\nh̄k 2\ndk D(k)\nΓ0 = 2\n−δ\nδ\n2\n2μ\nh̄\n=\n\nμ2 v0 V d(k0 ) * E\n2h̄\nπh̄2\n\n2\n\n,\n\n(9)\n\nk2 V\n2π 2\n\n(10)\n\nwhere\nD(k) =\n\nis the density of k states, whether in a cubic or in a\nspherical box [7, 19]. Equation (9) is fully compatible\nwith the development in Refs. [6] and [7], as it should.\nSince the dipole matrix element tends to a constant in\nthe limit k → 0, it is easy to see from (9) that the Wigner\nthreshold law holds; namely, that limv0 →0 Γ0 /v0 is finite,\nand nonzero except for an unlikely accident. As a matter\nof fact, our argument about the k → 0 limit of the dipole\nmatrix element was nothing but a recital of a standard\nargument for the Wigner threshold law. Nonetheless, it\nwill furnish a relevant piece of the puzzle when we are to\ndiscuss atom-molecule field theory below. To this end,\nwe note from Eqs. (5) and (9) the equality\nlim\n\nv0 →0\n\n=\n\nΓ0\nv0\nμ2 d * E\nlim\nh̄ k0 →0\nπh̄2\n\n√\nZ\n2πR\n4πr2 dr ψ̄ ∗ (r)φ̄0k0 (r)\nk0\n\n2\n\n.\n(11)\n\nB.\n\nMany atoms in momentum representation\n1.\n\nBasic Hamiltonian\n\nIn Ref. [8] we introduced a phenomenological secondquantized Hamiltonian for photoassociation of bosonic\natoms to (obviously) bosonic molecules,\n\u0015\n\u0013\n\u0012\nX \u0014 h̄k2 †\nδ0\nh̄k2\nH\na†k ak\n=\nbk bk + − +\nh̄\n4m\n2\n2m\nk\n\u0015\n\u0014\nX dkk′ * Eq †\nbk+ k′ +q ak ak′ + H.c. . (12)\n−\n4h̄\n′\nkk q\n\nHere m stands for the mass of the atom, m = 2μ. The\noperators ak and bk are boson annihilation operators for\natoms and molecules in the plane wave mode k. The\nHamiltonian trivially includes the kinetic energy of the\natoms and molecules. Here photoassociation takes place\nwith an absorption (as opposed to induced emission) of\na photon. By momentum conservation, atoms with wave\nvectors k and k′ plus a photon with wave vector q must\nthen make a molecule with wave vector k + k′ + q. This\nexplains the form of the cubic operator product; annihilate the atoms and a photon, create the molecule.\nAs is usual in quantum optics, we use a classical\nfield to represent the photons. Specifically, the positivefrequency part of the electric field reads\nX\nE+ (r) = 12\nEq eiq*r .\n(13)\nq\n\nBoth E+ (r) and the coefficients Eq may in principle be\nslowly varying functions of time, but the leading time dependence of the electric field ∝ e−iωt has been absorbed\ninto the detuning δ0 in a transformation to a rotating\nframe. The seemingly unexpected factor 21 in the detuning term correspond to the fact that upon photodissociation one molecule produces two atoms, both of which\ngenerally take away kinetic energy with them. The sign\nof the detuning is chosen in such a way that δ0 > 0 corresponds to tuning of the laser by the energy h̄δ0 above the\nphotodissociation threshold. A quick way to verify this is\nto consider the potential resonance when the (quasi) energy (in the rotating frame) for a system of one molecule\nand zero atoms would be the same as the energy for a system with zero molecules and two atoms, much like in the\nAppendix A. The total energy of the atoms must equal\nthe energy of the molecule plus h̄δ0 , which is compatible\nwith Eq. (12).\nWe assume that the optical transition responsible for\nphotoassociation is a dipole transition. In the dipole approximation, the electronic photodissociation and photoassociation transitions in a molecule do not (cannot!)\ndepend on the propagation direction of light, hence the\ndipole matrix elements dkk′ do not depend on photon momenta. Besides, by translational invariance, the\ndipole matrix elements must be functions of the difference k − k′ only. Because of the exchange symmetry of\nthe boson operators, the matrix element dkk′ may be\nchosen to be symmetric in the exchange of the momentum indices, hence, an even function of k − k′ . And\nfinally, since we consider s-wave photoassociation only,\nthe matrix element is a function of |k − k′ |.\nTo pin down the matrix elements dkk′ , in Ref. [8] we\ntook the limit of a dilute thermal gas. The known QC\nresults are recovered if one expresses the thus far undefined coefficients dkk′ in terms of the matrix elements (4)\nas\n√\n\u0001\ndkk′ ≡ 2 d 12 (k − k′ ) .\n(14)\n√\nThe 2 is a consequence of the Bose-Einstein statistics,\nand the factor 12 follows from the way that the relative\n\n\f5\nmomentum must be defined to make it the conjugate of\nthe conventional relative position. We have recently noticed that there is a subtlety associated with this identification having to do with the the statistics of the atoms.\nWe elaborate in Appendix A, but meanwhile continue\naccording to Eq. (14).\nIn sum, if one may treat the atoms and the molecules\nas bosons in their own right, then both the form of, and\neven the numerical coefficients in, the photoassociation\nHamiltonian are unambiguously determined by simple\nphysical considerations. Admittedly, we do not know of\nany conclusive ab initio argument for the bosonic nature\nof atoms and molecules in photoassociation. But neither\ndo we know of any for alkali atoms, which nonetheless\nseem to behave like good bosons in current BEC experiments.\n2.\n\nTwo-mode approximation\n\nWe now revisit the situation that was the focus of\nRef. [8]: an infinite, homogeneous condensate and one\nplane wave of light with photon momentum h̄q. By conservation of momentum, the molecules one may create\nby photoassociation all have the wave vector equal to q.\nOn the other hand, as far as momentum conservation is\nconcerned, a molecule with the wave vector q may photodissociate into two atoms, neither of which has zero\nmomentum. We will discuss such \"rogue photodissociation\" in more detail below, Sec. V A, and so far ignore\nit.\nAll told, we only retain the two modes of the model\nwith the annihilation operators a ≡ a0 and b ≡ bq . The\nHamiltonian reads\nH\nh̄q2 †\n=\nb b − 21 δ0 a† a − 21 κ(b† aa + ba† a† )\nh̄\n4m\nh̄q2 †\n≃\nb b − 21 δ0 a† a − 21 κ(b† aa + ba† a† )\n4m\nh̄q2\n−\n(2b† b + a† a)\n8m\n≡ − 21 δ a† a − 21 κ(b† aa + ba† a† ) .\n(15)\nIn the \"approximate\" equality we have added a constant\nof the motion to the Hamiltonian, a step that has no\neffect on the ensuing dynamics. The QC Rabi frequency\nreads\n√\n2\nκ =\nE * [ lim d(k)]\nk→0\n2h̄\ns\n2πh̄2 Γ0\n= lim\n,\n(16)\nv0 →0\nμ2 V v0\nwhere we have used Eq. (9). Without any loss of generality, we have chosen κ to be real and nonnegative.\nSeemingly alarmingly, the Rabi frequency still depends\non the quantization volume. We will return to this point\nin Sec. III. At present, our aim is just to set up the\n\nsecond-quantized Hamiltonian in the two-mode approximation. The task is completed by noting that\nδ = δ0 +\n\nh̄q2\n4m\n\n(17)\n\nis the detuning corrected for the photon recoil energy of\nthe molecule. From now on we will keep track of this distinction, so that δ always includes the appropriate recoil.\nIn fact, that was already implicitly the case in Eq. (9).\nC.\n\nMany-atom field theory\n\nOur phenomenological Hamiltonian (12) was written\ndown originally in momentum representation. Nevertheless, as in Refs. [8] and [14], it is fairly straightforward to\nconvert it into position representation, i.e., into a quantum field theory.\nLet us introduce atomic and molecular fields in a quantization volume V . A priori, this volume does not have\nto be the cavity of radius R, as in Sec. II A. Often it is\nactually more convenient to use a cubic box with periodic boundary conditions. On the other hand, when one\ndeals with two atomic fields, it is often expedient to write\nthe integrals in the theory in terms of center-of-mass and\nrelative coordinates. If the integral over the relative coordinates cuts off because the integrand tends to zero at\nlarge distances, it is immaterial what volume is used, as\nlong as it is large enough. Thus, when convenient, in\nsuch relative-coordinate integrals we may still imagine\nthe spherical potential well. The short of the story is\nthat the quantization volume V refers to the geometry\nthat is expedient in the particular context.\nWe write the atomic and molecular fields in terms of\nplane wave states as\n1 X ik*r\nφ(r) = √\ne ak ,\nV k\n\n1 X ik*r\nψ(r) = √\ne bk .\nV k\n(18)\nThe Hamiltonian (12) may be cast as a Hamiltonian density of a field theory for these fields. Using the standard\ncontinuum limit\nZ\nX\nV\nd3 k f (k) ,\n(19)\nf (k) ≃\n(2π)3\nk\n\nEq. (13), and the properties of Fourier integrals, the part\nof the Hamiltonian density depending on the dipole interaction becomes\nZ\nH(r)\nE+ (r) †\n=−\n*ψ (r) d3 r′ φ(r+12 r′ )d(r′ )φ(r−12 r′ )+. . . .\nh̄\n2h̄\n(20)\nThe dipole kernel of photoassociation d(r) is given in\nterms of the dipole matrix element of Eq. (4) as\n√\nZ\n2V\nd3 k e−ik*r d(k) .\n(21)\nd(r) =\n(2π)3\n\n\f6\nIt should be noted that our argument contains a subtle\ntrick, which is exposed in Appendix B.\nTo make further progress, we study the kernel using\nthe qualitative model for the dipole matrix element (7).\nSome more juggling with Fourier transforms gives\nd(r)\n√ θ(a+r)(a+r)ψ̄ ∗ (a+r)−θ(a−r)(a−r)ψ̄ ∗ (a −r)\n,\n2d\nr\n(22)\n\n=\n\nwhere θ is the Heaviside unit step function. This result\nis only as good as the assumptions of Eq. (7). In particular, as Eq. (7) is not valid for large k, Eq. (22) is\n\ndubious at short distances. Also, as we already pointed\nout with Eq. (7), even for small k the model is quantitatively accurate only if the vibrational wave function ψ̄(r)\nresides outside the range of the atom-atom interactions.\nIn spite of these caveats, Eq. (22) gives an exceedingly\nplausible idea of the range ∆r of the dipole interaction\nkernel; ∆r is of the order of the larger of the spatial extent of the vibrational state ψ̄(r) and the absolute value\nof the scattering length a.\nThe relevant length scale for the atomic field is larger\nthan ∆r if the energies of all of the atoms relevant for the\ntime evolution are smaller than ∼ h̄2 /m(∆r)2 . Henceforth we assume this to be the case. Then we may simplify the field-theory form of the integral as follows,\n\nZ\nZ\nH(r)\nE+ (r)\nE+ (r)\n= −\n* ψ † (r) d3 r′ φ(r + 12 r′ )d(r′ )φ(r − 21 r′ ) + . . . ≃ −\n* ψ † (r) φ(r)φ(r) d3 r′ d(r′ ) + . . .\nh̄\n2h̄\n2h̄\n\u0014 +\n\u0015\nE (r) √\n* 2V lim d(k) ψ † (r) φ(r)φ(r) + . . .\n= −\nk→0\n2h̄\n\"\n#\n√\nZ\n√ d * E+ (r)\n2πR\n2\nlim\n=\n4πr2 dr ψ̄ ∗ (r)φ̄0k (r) ψ † (r) φ(r)φ(r) + . . . .\n(23)\nk→0\n2h̄\nk\n\n\u0002\n\u0003\n− D(r)ψ † (r) φ(r)φ(r) + H.c. .\n\n(26)\n\nThe second equality follows from the assumedly slow dependence of the atomic field φ(r) on position r compared\nto d(r), the third from Eq. (21) and the properties of\nFourier transformations, and in the last equality we have\nsubstituted Eq. (5). Comparison with Eq. (11) then\ngives the contact interaction form of the photoassociation dipole interaction,\n\nWe consider the two-mode model, whose Hamiltonian\nwe reproduce here from Eq. (15),\n\nH(r)\n= −D(r)ψ † (r) φ(r)φ(r) + . . . ,\nh̄\n\nH\n= − 12 δ a† a − 12 κ(b† aa + ba† a† ) .\nh̄\n\n(24)\n\nwith\n+\n\nD(r) = ei arg[d*E\n\n(r)]\n\nlim\n\nv0 →0\n\ns\n\n2\n\n2πh̄ Γ0 (r)\n.\nv0 μ2\n\n(25)\n\nHere Γ0 (r) is the photodissociation rate as per the prevailing light intensity at position r, and the exponential\nrecords the phase of the dipole interaction term.\nFor reference, we summarize the contact-interaction\nversion of the Hamiltonian for photoassociation in terms\nof atomic and molecular fields. While at that, by adding\na suitable multiple of the conserved particle number completely analogously to the operation that we did in the\nchain of equations (15), we move the detuning term to\nthe molecules. The result is\nZ\nH =\nd3 r H(r);\n\u0013\n\u0012\n\u0013\n\u0012\nh̄∇2\nh̄∇2\nH(r)\n†\n†\nφ(r) + ψ (r) −\n= φ (r) −\n+ δ0 ψ(r)\nh̄\n2m\n4m\n\nIII.\n\nCOHERENCE IN TWO-MODE MODEL\n\nThis is the age-old Hamiltonian for second-harmonic generation, with atoms replacing the fundamental-frequency\nlight and molecules the second harmonic. Needless to say,\nthe literature on the model is extensive. We will cite a\nfew relevant examples below.\nLet us take the conserved particle number a† a + 2b† b\nto have the value N . The Hamiltonian (15) may then\nbe restricted to the space spanned by the states |ni ≡\n|niM |N −2niA with n = 0, . . . , N/2 molecules and N −2n\natoms, and is tridiagonal in that basis. It is easy to find\nboth the eigenstates of the Hamiltonian and the time evolution of any specified initial state numerically. We have\ndone so using inverse iteration, and a variation of the\nCrank-Nicholson method. While the problem considered\nin Ref. [20] is different, the numerical methods described\ntherein work equally well here.\nIn this way we have firstly [8, 21] found the fraction\nof atoms converted into molecules, given that the system\nstarts out at time t = 0 with everything in atoms and is\n\n\f7\ndriven by a resonant laser, δ = 0. We found a nonlinear\nanalog of Rabi flopping, the system oscillating between\natoms and molecules. Given that we have a quantum\nsystem where the spacing between the successive energy\neigenstates is not constant, it is not a surprise that the\noscillations collapse, and even revive [22].\nInteresting as these features are as a matter of principle, the drawback remains that Rabi oscillations of occupation probabilities are generally not robust, not even\nin quantum optics or laser spectroscopy. We foresee little experimental utility for nonlinear Rabi oscillations.\nOur main message of the analysis of Rabi oscillations in\nRef. [8] rather is that, for N ≫ 1, the characteristic frequency scale of the system is not the QC Rabi frequency\nκ but\ns\ns\n√\n2N πh̄2 Γ0\n2πh̄2 Γ0 ρ\n= lim\n.\nΩ = N κ = lim\n2\nv0 →0\nv0 →0\nμ V v0\nμ2 v0\n(27)\n√\nThe N is evidently a Bose enhancement factor. The implicit quantization volume has disappeared from the result. Instead we have the density of atoms if all molecules\nwere dissociated,\nρ=\n\nN\n,\nV\n\n(28)\n\nwhich is a true physical parameter for the system.\nBose enhancement highlights the role of statistics in\nour analysis. Suppose we were to deal with a nondegenerate gas. Then the occupation probability of each QC\nstate is much less than unity by definition, and there is\nno Bose enhancement. The frequency of Rabi flopping\nbetween a given QC state and a bound molecular states\nwould just be ∝ κ ∝ V −1/2 , and vanishes in the limit of\nlarge volume. It is not possible to have Rabi flopping in\nphotoassociation of an infinite and homogeneous nondegenerate gas, even in principle [15].\nThe photoassociation rate for a pair of atoms starting\nin a given QC state is ∝ κ2 ∝ 1/V , and also vanishes\nin the limit of a large volume. The saving grace [6, 7]\nis that, to keep the density constant, the atom number\nN and at the same time the number of candidate atoms\nto photoassociate with any given atom tends to infinity.\nAdding the probabilities for photoassociation due to all\ncolliders, the total rate of photoassociation for any given\natom is ∝ N κ2 ∝ ρ. This remains a constant in the\ncontinuum limit, which leads to a finite photoassociation\nrate ∝ ρ.\nIn contrast, in a BEC the atom number already ends\nup in the transition √\nmatrix element, giving the effective\n√\nRabi frequency Ω = N κ ∝ ρ. One does not add rates\n∝ κ2 due to different atoms, but all the condensate atoms\nact as a single state that has a finite matrix element for\nphotoassociation even in the limit of infinite quantization\nvolume. This ultimately facilitates coherence effects like\nRabi flopping.\nThe Hamiltonian (15) acts in a rotating frame, and\nthere is no manifest physical significance to its eigenval-\n\nFIG. 1:\nFraction of atoms forming molecules, f , in the\nground state of the atom-molecule condensate as a function\nof the detuning of the laser from photoassociation threshold,\nδ. The long-dashed and short-dashed lines are from the twomode quantum treatment for the respective atom numbers\nN = 10 and N = 100, the solid line is from the semiclassical\napproach embodied in the Gross-Pitaevskii equations.\n\nues. Nonetheless, let us call them energies, and the state\nwith the lowest energy the ground state. Qualitatively,\nwhen the laser is tuned far below the photodissociation\nthreshold, δ ≪ −Ω, the a† a term in the Hamiltonian becomes costly in energy. The ground state of the Hamiltonian should then tend to have the system mostly in\nmolecules. Conversely, for δ ≫ Ω, the ground state favors\natoms. We confirm these surmises explicitly in Fig. III by\nplotting the fraction of atoms converted into molecules,\nthe expectation value\nf=\n\n2hb† bi\n,\nN\n\n(29)\n\nfor the numerically obtained ground state. The difference\nbetween the dashed curves is the atom number, N = 10\nand N = 100.\nThe idea is near that, when the laser is swept from\na large above-threshold detuning to a large (in absolute\nvalue) below-threshold value, the system will follow adiabatically, and an atomic condensate is converted to a\nmolecular condensates [8]. Moreover, if Ω were the relevant frequency scale, adiabaticity means that the detuning must change by Ω in a time of the order or longer\nthan Ω−1 . In our model we assume that the detuning is\nswept as\nδ(t) = −ξΩ2 t .\n\n(30)\n\nWe expect adiabatic following when ξ <\n∼ 1.\nThis piece of intuition is correct. In Fig. 2 we reproduce the relevant figure from Ref. [8]. We fix N = 100.\nAt an initial time giving δ = −20 Ω, we start the system in its ground state, almost purely atoms, and integrate the time dependent Schrödinger equation numerically while sweeping the detuning at two rates ξ = 1 and\n\n\f8\nWe will study deviations from the two-mode picture,\nor the possibility that the (infinite) atomic and molecular\ncondensates are not spatially homogeneous. Here we use\nthe quantum field version of our photoassociation theory.\nBut solving nonlinear quantum field theories is generally\nnot a simple matter, and one must approximate. We will\nresort to classical field theory, the same way one proceeds\nwhen an alkali condensate is analyzed using the GrossPitaevskii equation.\n\n1.0\n0.8\nξ = 0.1\nξ= 1\n\nf\n\n0.6\n0.4\n0.2\n0.0\n20\n\n10\n\n0\nδ(t)/Ω\n\n-10\n\nA.\n\n-20\n\nFIG. 2: Fraction of atoms converted to molecules, f = 2hb† bi,\nas a function of instantaneous detuning, δ(t), when the detuning is swept linearly as a function of time according to\nδ(t) = −ξΩ2 t. The figure is for the atom number N = 100,\nfor the two sweep rates ξ = 0.1 and ξ = 1.\n\nGross-Pitaevskii equations\n\nTo derive the Gross-Pitaevskii equations (GPE) for\nthis problem, in the usual way we first amend the Hamiltonian by adding to it a multiple of the conserved particle\nnumber\nZ\nX †\nN=\n(ak ak +2b†k bk ) = d3 r [φ† (r)φ(r)+2ψ † (r)ψ(r)] .\nk\n\nξ = 0.1. The plot gives the fraction of atoms converted\nto molecules as a function of the instantaneous detuning.\nFor ξ = 1 we expect to be somewhere at the borderline\nof adiabaticity, and actually find a conversion efficiency\nof 0.8. When the laser tuning is swept ten times more\nslowly, ξ = 0.1, the conversion efficiency has reached 0.97.\nWe believe that we have discovered a feasible method\nfor preparing a molecular condensate: start with an\natomic condensate and a photoassociating laser, then\nsweep the frequency of the laser in a proper way, and\nobtain a molecular BEC. In the general manner of adiabatic methods, this \"rapid adiabatic passage\" should be\nrobust.\nBesides its potential utility, rapid adiabatic passage\nis another example of coherent phenomena that occur\nin a condensate but not in a nondegenerate gas. Once\nmore, in a nondegenerate gas the frequency scale for\nadiabaticity is κ, and the time scale is proportional to\nκ−1 ∝ V 1/2 . Even if nothing else went wrong, in the\nlimit of a large sample the time scale for adiabatic atommolecule conversion would tend to infinity. Once more,\nBose enhancement saves the day by turning the volume\ndependence of the relevant frequency scale into a density\ndependence [15].\n\nIV.\n\nFIELD THEORY FOR ALL MODES\n\nIf only one spatial mode has to be considered for both\nthe atomic and the molecular condensate, the two-mode\nHamiltonian (15) is all there is to it. Nonetheless, even\nif somehow the infinite homogeneous condensate could\nbe approximated in practice, for whatever reason there\nwould always be atoms and molecules present with momenta that are not included in the two-mode picture. As\nthe full Hamiltonian (12) mixes momenta nonlinearly, the\npossibility of instability arises and should be investigated.\n\n(31)\nInstead of the Hamiltonian density, we then use the\n\"Kamiltonian\" density\nK(r) = H(r) − μ[φ† (r)φ(r) + 2ψ † (r)ψ(r)]\n\n(32)\n\nin our calculations. This substitution has no effect on\nthe dynamics. At this point the real scalar μ is arbitrary.\nThough this piece of knowledge has no bearing on our\nanalysis, in the end the constant μ will be analogous to\nchemical potential in thermodynamics. Hence, μ is called\nthe chemical potential.\nUsing the standard commutators for boson fields, the\nHeisenberg equation of motion for the molecular field becomes\nZ\nK(r′ )\niψ̇(r) = [ψ(r), d3 r′\n]\nh̄\n\u0015\n\u0014\nμ\nh̄∇2\nψ(r) − 12 D(r)φ(r)φ(r) .\n+ δ0 − 2\n= −\n4m\nh̄\n(33)\nThe transformation to the classical field theory is effected\nby positing that the fields in the equations of motion are\nno longer boson fields, but commuting c-number fields.\nThe interpretation is that φ(r) and ψ(r) are the macroscopic wave functions for atomic and molecular condensates.\nFrom this point onward we again take the driving field\nto be a simple plane wave with the positive frequency\npart 21 Eeiq*r . Second, we scale the atomic and molecular\np\nfields with the square root of density, N/V . Third,\nwe incorporate the spatial variation of the electric field\ninto the definition of the molecular field. Altogether, we\ndefine new atomic and molecular fields Φ and Ψ as\nr\nr\nN\nN iq*r\nΦ,\nψ=\ne Ψ.\n(34)\nφ=\nV\nV\n\n\f9\nThe net results are four. First, the normalization of the\nfields now reads\nZ\n1\nd3 r (|Φ|2 + 2|Ψ|2 ) = 1 .\n(35)\nV\nSecond, the coefficient D gets multiplied by the square\nroot of the atom density that would prevail if all\nmolecules were to dissociate. Third, all explicit position dependence disappears from the equations of motion. The GPE for the rescaled atomic and molecular\nwave functions are\n\u0014\n\u0015\nh̄∇2\niΦ̇(r) = −\n− μ Φ(r) − e−iφ Ω Φ∗ (r)Ψ(r),(36)\n2m\n\u0015\n\u0014\nh̄\nμ\nh̄ 2\nΨ(r)\n∇ +i\nq*∇+δ−2\niΨ̇(r) = −\n4m\n2m\nh̄\n− 21 eiφ Ω [Φ(r)]2 .\n\n(37)\n\nNone other than our characteristic frequency scale for\nphotoassociation, Ω of Eq. (27), is now explicitly the frequency scale in the field equations as well. The phase\nfactor eiφ accounts for the phases of the electric field\nand dipole moment, and will soon prove inconsequential.\nFourth, a photon recoil term got added to the kinetic\nenergy of the molecules.\nWhile still using full dimensional units, we pause to\ndiscuss the mathematical symmetries of the GPE. First,\na trivial phase change of one of the fields, e.g., Φ →\ne−iφ/2 Φ, converts Eqs. (IV A) to the same equations, except that the phase factors vanish from atom-molecule\ninteraction terms. Therefore, we drop the phase in the\ninteraction term. Second, the GPE have a global gauge\ninvariance. If the fields Φ, Ψ are a solution, then so are\nthe fields Φeiφ , Ψe2iφ for an arbitrary fixed phase φ. In\nparticular, putting φ = 2π, one may see that the equations are invariant under the change of the sign of the\nfield Φ. Third, as a time dependent generalization of the\ngauge invariance, the GPE is invariant under the replacement\nΦ → Φei∆μt ,\nΨ → Ψe2i∆μt ,\nμ → μ + ∆μ .\n\n(38)\n(39)\n(40)\n\nFourth, the GPE is Galilei invariant, in that the replacements\n\u0012\n\u0013\nh̄k\nik*r\nΦ(r, t) → e Φ r −\nt, t ,\n(41)\nm\n\u0013\n\u0012\nh̄k\nt, t ,\n(42)\nΨ(r, t) → e2ik*r Ψ r −\nm\nh̄2 k2\n,\n2m\nh̄k\n*q\nδ → δ−\nm\n\nμ → μ+\n\n(43)\n(44)\n\nconvert a solution into another solution that corresponds\nto an added momentum h̄k per atom. The nontrivial\n\npart of the transformation, Eq. (44) is that, due to the\nDoppler shift, the effective detuning changes depending\non the overall motion of the atom-molecule system.\nFinally, we express the GPE (IV A) in a specific system\nof units,\nr\n1\nh̄\nt0 = , r0 =\n, m0 = m ,\n(45)\nΩ\nmΩ\nfor time, length and mass respectively. Technically, we\nshould rename the scaled variables and parameter; say,\nt = t̄ t0 , δ = δ̄/t0 . However, we eschew such a heavy\nnotation, and continue to use, e.g., the symbol δ for what\nnow stands for a dimensionless number and should be\nproperly denoted by δ̄ = δ/Ω. The result is\n\u0002\n\u0003\niΦ̇ = − 21 ∇2 − μ Φ − Φ∗ Ψ,\n(46)\n\u0003\n\u0002 1 2 1\n1 2\niΨ̇ = − 4 ∇ + 2 iq * ∇ + δ − 2μ Ψ − 2 Φ . (47)\nThe GPE equations are as stated in Ref. [14]. The\nplan now is to analyze them. Of course, equations of\nthe type (IV A) are standard fare in studies of secondharmonic generation. The literature once more is extensive, and we will only give a few specific pointers as we\ngo along.\nB.\n\nSteady state of GPE\n\nAtomic and molecular fields Φ and Ψ represent a stationary state, one in which the physics does not change\nwith time, if and only if their time evolution is solely in\nglobal (position independent) phase factors, possibly different ones for Φ and Ψ. Now consider fields of the form\nΦ(r, t) = Φ(r)e−iωt and Ψ(r, t) = Ψ(r)e−2iωt for any real\nω. One sees right away that for this type of evolution, at\nleast the exponential time dependence properly matches\non both sides of Eqs. (IV A). Although we have not been\nable to prove it mathematically, we conjecture that, assuming time independent parameters in Eqs. (IV A), this\ntype of time dependence is also the only possible case in\nwhich the physics is independent of time.\nBut then, by virtue of the transformation (IV A), by\nreadjusting the chemical potential one can always remove\nthe time dependence of the fields entirely in any stationary state. The chemical potential started its life as an\narbitrary parameter. From now on we make use of the\narbitrariness and choose the value in such a way that in\nsteady state the atomic and molecular fields are literally\nconstants in time.\nWe shall see shortly that, for any time independent detuning δ, one may pick a suitable value for the chemical\npotential μ so that the GPE (IV A) have solutions Φ0 , Ψ0\nthat are constants in both space and time. But by virtue\nof the Galilean transformation (IV A), we may then construct from Φ0 , Ψ0 a stationary solution corresponding\nto an arbitrary overall flow of atoms and molecules, solutions of the form Φ ∝ eik*r and Ψ ∝ e2ik*r . Conversely,\n\n\f10\nwe believe that all spatially homogeneous stationary solutions are such Galilean boosts of the once-and-for-all\nconstant solutions Φ0 , Ψ0 . As far as it comes to spatially\nhomogeneous steady states, we therefore may, and will,\nwithout any restriction on generality consider fields that\nare constants in space and time.\nIn the context of second-harmonic generation it is well\nknown that the GPE may have spatially inhomogeneous\nsolitary-wave type stationary solutions [23]. By applying\nthe Galilean transformation, one may find traveling solitary waves as well. Here we will make no effort to find,\nlet alone classify, solitary-wave solutions to our GPE, but\nproceed as if the homogeneous steady states were all there\nis to it.\nWithin the scope of the present paper, the stationary\nsolutions thus satisfy\n0 = −μΦ0 − Φ∗0 Ψ0 ,\n0 = (δ − 2μ)Ψ0 − 12 Φ20\n\n1 = |Φ0 |2 + 2|Ψ0 |2 ,\n\n(48)\n(49)\n(50)\n\nwhere the final equation originates from the normalization (35). Moreover, by virtue of the global gauge invariance, one may choose Φ0 real. Next, because of the\ninvariance of the GPE with respect to the sign change of\nΦ, we may always choose Φ0 to be nonnegative. Furthermore, if Φ0 > 0, then (48) shows that Ψ (like μ) must be\nreal. On the other hand, if Φ0 = 0, Ψ0 comes with an arbitrary phase, and may be chosen real. All told, we only\nneed to find the real solutions Φ0 , Ψ0 , μ to Eqs. (IV B),\nand besides only solutions with Φ0 ≥ 0 need be retained.\nThere are three distinct solutions. The trivial one\nreads\nΦ00 = 0,\nfor δ ≤\n\nΨ00 =\n\n√1 ,\n2\n\nμ0 = 21 δ ;\n\n(51)\n\n√\n2 we have\nΦ+\n0\nΨ+\n0\nμ\n\n+\n\np\n√\n6 − δ2 − δ 6 + δ2\n=\n,\n√ 3\n−δ − 6 + δ 2\n,\n=\n6\n= −Ψ+\n0 ;\n\n√\nand for δ ≥ − 2 we find\np\n√\n6 − δ2 + δ 6 + δ2\n−\nΦ0 =\n,\n√ 3\n−δ + 6 + δ 2\n,\nΨ−\n0 =\n6\n−\n−\nμ = −Ψ0 .\n\nquantum-mechanical two-mode model (15), and choose\nthe stationary solution so that [14]\n√\nδ < − 2 : Φ0 = Φ00 , Ψ0 = ψ00 , μ = μ0 ,\n√\n−\n−\n(54)\nδ ≥ − 2 : Φ0 = Φ−\n0 , Ψ0 = ψ0 , μ = μ .\nThe success is evident in Fig. III, where we plot side by\nside the fraction of atoms converted to molecules from\nthe quantum-mechanical two-mode model and the corresponding GPE approximation f = 2Ψ20 (solid line) as\na function of detuning. By comparing with the N = 10\nand N = 100 quantum results, it may be seen that the\nagreement between the GPE and the quantum approach\ngets better as the number of atoms is increased. Even\nfor an atom number as\n√ small as 100 and around the nonanalytic point δ = − 2 of the GPE approximation (54),\nthe difference is only on the order of one per cent.\nWe conclude by noting that Eqs. (51) and (52) together\ngive a stationary solution that is the exact mirror image\nof our choice (54) with the substitution δ → −δ. This\ncorresponds to the state with maximum energy for the\ntwo-mode quantum system. It is a stationary state just\nas is the minimum, and may be used for atom-molecule\nconversion. The difference is that, in the case of the\nmaximum, the detuning would be swept in the opposite\ndirection, from below to above the dissociation threshold. Otherwise rapid adiabatic passage should work essentially as before.\nC.\n\nSmall excitations of the system\n\nSo far, while analyzing the GPE, we have achieved\nnothing more than in our studies of the two-mode model;\nrather less, because in our classical field theory we lose\nquantum fluctuations. Nevertheless, we now have the\ntools to analyze the stability of the steady state, and see\nhow spatial inhomogeneities evolve in time.\nAs in Ref. [14], we linearize the GPE around a stationary solution, and then attempt to find eigenmodes for\nsmall deviations from the stationary case. Both of these\nsteps are achieved at once by inserting the Ansatz\n∗ −i(p*r−ω\nΦ(r, t) = Φ0 + uΦ ei(p*r−ωt) + vΦ\ne\n\n(52)\n\n(53)\n\nAt least two steady states\n√ are found√for each δ, and\nthree in the interval − 2 < δ <\n2. The question is, which one represents the desired physical steady\nstate. Here we attempt to mimic the ground state of the\n\n∗\n\nt)\n\n(55)\n\ninto the GPE, and only retaining the first-order terms in\nthe \"small\" coefficients uΦ , vΦ . Of course, the field Ψ\nis treated similarly. We need to mix plane waves p and\n−p because the GPE mixes fields and their complex conjugates. With our Ansatz we also retain the possibility\nthat the evolution frequency of an eigenmode could be\ncomplex.\nThe Ansatz succeeds if the as of yet unknown evolution\nfrequency ω satisfies the eigenvalue equations\n\u0002 1 2\n\u0003\n− 2 p + μ + ω uΦ + ψ0 vΦ + Φ0 uΨ = 0, (56)\n\u0002 1 2\n\u0003\n− 2 p + μ − ω vΦ + ψ0 uΦ + Φ0 vΨ = 0, (57)\n\u0002 1 2\n\u0003\n− 4 (p + 2p * q) + 2μ − δ̄ + ω uΨ + Φ0 uΦ = 0, (58)\n\u0003\n\u0002 1 2\n− 4 (p − 2p * q) + 2μ − δ̄ − ω vΨ + Φ0 vΦ = 0. (59)\n\n\f11\nThe characteristic equation is fourth order in ω, so in\nprinciple the solutions can always be written down analytically. However, here we use Mathematica [24] to\nproduce results directly numerically, and occasionally to\nextract analytical forms for special and limiting cases.\nThe dispersion relations of the excitation modes, ω =\nω(p), depend on the relative propagation directions of\nthe excitation and of light, and also on the size of the\nphoton recoil kick. We encompass these dependences into\na dimensionless parameter, which in terms of the original\ndimensional parameters reads\ns\nh̄(q * p)2\n.\n(60)\nη=\nmΩ p * p\nGiven the parameter η and the absolute value p of the\n(dimensionless) propagation vector p, the terms that depend on photon recoil in Eqs. (IV C) are replaced as follows,\n2\n1\n4 (p\n\n± 2p * q) → 14 (p2 ± 2ηp) .\n\n(61)\n\nFor fixed values of the parameters δ, η and p, there\nare four excitation modes with four (in general) different\nevolution frequencies ω. If a positive imaginary part is\nencountered in any one of the four frequencies, the corresponding mode grows exponentially and the steady state\nis unstable.\nLet us take the wave vector characterizing the smallexcitation mode to be perpendicular to the propagation\ndirection of light, η = 0. We begin with p = 0 and assume\n|Ψ0 |2 < 12 , a nontrivial mix of atoms and molecules. We\nfind the solutions to the characteristic equation for the\neigenvalue problem (IV C)\nω12 (0) = 0.\n\u0012\n2\nω2 (0) = 3 +\n\n(62)\n1\n2|Ψ0 |2\n\n\u0013\u0012\n\n1\n− |Ψ0 |2\n2\n\n\u0013\n\n.\n\n(63)\n\nWhen the wave number of the excitation moves away\nfrom p = 0, of the four frequencies the two evolving continuously from ±ω2 (0) remain real. Their dispersion re1\n2\nlations for small p are of the type ω2 (p) ≃ ω2 (0) + 2m\n∗p ,\n∗\nwith m ≥ 0, so that these excitations are akin to optical\nphonons. On the other hand, the remaining two excitation frequencies are either purely real or purely imaginary, and for small enough p they are always imaginary.\nSuch modes do not propagate at all, but grow or shrink\nin place exponentially.\nIn fact, in Fig. 3, which is transcribed from Ref. [14],\nwe plot the largest imaginary part among the four frequencies ω, |I[ω1 ]|, as a function of the detuning δ and\nthe wave number p of the excitation mode. As above,\nwe set√η = 0. It may be seen that, for any detuning\nδ > − 2, an unstable excitation mode is always found.\nThe largest imaginary part of an evolution frequency,\ni.e, the largest growth rate of an instability, is encountered at δ = −0.154496 and p = ±0.771324, and equals\nI(ω) = 0.24256.\n\nFIG. 3: Largest imaginary part among the four evolution\nfrequencies of small perturbations of the joint atom-molecule\ncondensate is plotted as a function of the laser detuning δ\nand the wave number of the plane-wave like perturbation p.\nIn this figure the excitation mode propagates perpendicularly\nto the propagation direction of light, so that ξ = 0.\n\nThe analogous instability is naturally known in secondharmonic generation, and goes under the rubric \"modulational instability\" [25, 26].\nWe next come to the effect of the direction of the wave\nvector of the mode on instability. In Fig. 4 we plot the\nlargest positive imaginary part of a mode frequency found\nfor any p as a function of the parameter η. The curves\nare labeled with their corresponding fixed detunings δ.\nIn our studies of this kind, the largest growth rate of the\ninstability was always found for η = 0. For a given detuning, the small excitations whose momentum direction\nis perpendicular to light propagation always present the\nmost unstable scenario.\nFinally consider the largest growth rate of the instability (among all p) as a function of the detuning. As may\nbe inferred from Fig. 3, with increasing detuning δ >\n∼ 1 it\ndecreases and occurs at smaller momenta, i.e., at larger\nsize scales. In fact, for δ ≫ 1, the maximum growth rate\n\n\f12\n0.25\n\nD.\nδ\nδ\nδ\nδ\nδ\nδ\n\nm ax{ Im [ω]}\n\n0.20\n\n= - 1/√2\n=0\n= 1/√2\n= √2\n= 2 √2\n= 4 √2\n\n0.15\n\n0.10\n\n0.05\n\n0.00\n0\n\n2\n\n4\n\n6\n\nη\n\nFIG. 4: Largest imaginary part in a small-excitation evolution frequency encountered for any value of the wave number\nof the excitation p is plotted against the parameter ξ that\ncharacterizes the component of the photon recoil momentum\nin the direction of the propagation vector of the small excitation p. The explicit definition of ξ is given in Eq. (60).\nDifferent curves are for different fixed detunings δ, as identified in the legend.\n\nof an instability R(δ) = max{I[ω(p, δ)]}p behaves as\nR(δ) ∼\n\n\u0014\n\n\u0015\n1\n1\n5\n− 3 + O( 5 ) ,\n2δ 4δ\nδ\n\n(64)\n\nand the corresponding position of the maximum pM (δ),\nthe value of the momentum such that I[ω(p, δ)] ≤\nI[ω(pM , δ)] for all p, goes like\npM (δ) ∼\n\nr\n\n\u0014\n\u0015\n1\n47\n1\n1\n1− 2 +\n+ O( 6 ) .\nδ\nδ\n16 δ 4\nδ\n\n(65)\n\nOf course, as the largest growth rate of the instability\nseems to occur for η = 0, this was our choice in Eqs. (64)\nand (65).\n√\nIn sum, we have found that for δ ≤ − 2 the steady\nstate of\n√ the atom-molecule system is stable, and for any\nδ > − 2 it is unstable. Although we have reported only\non a specific stationary solution (54), possibly one out of\nthree, the modes we have √not considered explicitly are\nall unstable. But √\nδ = − 2 is also the watershed, in\nthat below δ = − 2 the √\nsteady state is all molecules\n(Φ0 = 0), and above δ = − 2 some atoms are involved.\nAll told, the steady\n√ state with everything in molecules is\nstable for δ ≤ − 2, but any steady state involving atoms\nis always unstable. The most unstable situation occurs\naround δ ≃ 0, with about an equal mixture of atoms and\nmolecules. For δ ≫ 1 atoms take over, and the time scale\nfor the instability grows longer.\n\nFate of unstable system\n\nLinearized stability analysis has shown that a joint\natom-molecule condensate is unstable in the presence\nof photoassociating light, i.e., there are small-excitation\nmodes that grow exponentially. But when a small deviation from steady state grows exponentially, eventually\nit is not a small deviation anymore and the linearized\nanalysis breaks down. To investigate the fate of the system once the instability has set in, we integrate the full\nGPE numerically as in Ref. [14]. Our aim is a qualitative demonstration, so we proceed in 1 + 1 dimensions,\none spatial coordinate x and time t. However, there is\nnothing in our method that would not immediately work\nin higher spatial dimensions. The restriction is merely a\nmatter of computer time.\nSpecifically, in our algorithm we discretize a stretch L\nof the line into equidistant points xi , and seek to represent the fields at these discrete points only. For convenience, we use periodic boundary conditions, so that the\nvalue of all functions repeats over L. The GPE is integrated over a time step h in two moves. First we ignore\nthe position derivatives in the GPE altogether. This implies that the stripped-down version of the GPE is local;\nfor each xi , Φ(xi ) and Ψ(xi ) only couple to Φ(xi ) and\nΨ(xi ). We integrate the local version of the GPE over\nthe time h separately for each xi as two coupled differential equations using a second-order Runge-Kutta step.\nTo prevent a numerical drift of the norm, we complete\nthe initial step of the algorithm by normalizing the fields\nanalogously to Eq. (35). Second, we ignore anything but\nthe position derivatives in the GPE. The resulting partial version of the GPE is nonlocal, but in exchange it is\nlinear and does not mix the fields Φ and Ψ. To integrate\nover the same (sic!) time step as in the initial part of\nthe algorithm, we first take the Fourier transform of the\nresult from the first part using the Fast Fourier Transformation (FFT). In Fourier space position derivatives\nbecome local, so, to propagate the fields over the step h,\nwe simply multiply their Fourier transforms by what is\nnow the local, exact (within FFT), linear time evolution\noperator. Finally, in preparation for the next step, we\ntransform back to real space.\nThis split-step algorithm is an obvious variation of the\ntime honored split-operator methods for linear partial\ndifferential equations [27], and has been described before at least by the group of Firth [28]. Nonetheless, it\ncomes with a fair dose of heuristics. It is therefore gratifying that we have been able to verify a good rate of\nconvergence by using successively smaller time steps to\nintegrate over a fixed interval of time.\nWe present an example of our simulations in Fig. 5,\nshowing the absolute square of the atomic field |Φ|2 as\na function of position x and time t. We use 128 points\nxi . Because of the periodic boundary conditions, the left\nand right edges of x wrap around and are actually the\nsame. The plot is for the parameters δ = 0, η = 0, the\nrange of position x is 24.6282 (in units of r0 ) correspond-\n\n\f13\naround, and tend to join when they collide. As far as\nwe can tell, within the present model only one big, dense\nclump will remain in the end.\nOne might wonder what is the mechanism behind the\nclumping. We present a heuristic guess. We are not talking about a thermodynamic system, so minimization of\nenergy is a dubious principle to begin with; and besides,\nwe are dealing with quasienergies in a rotating frame, not\nreal energies. With these warnings out of the way, let us\nsurmise that the system nevertheless attempts to minimize its energy. The atomic and molecular condensates\nmake something akin to the two-level system in quantum\noptics. When light is added, one gets a dressed two-level\nsystem. The energy of the lower one of the two dressed\nstates decreases with increasing Rabi frequency, which is\nthe product of the electric field strength of the laser and\nthe dipole moment. But the analog of Rabi frequency\nfor the two-level system of atomic and molecular condensates, Ω, is also proportional to the square root of density,\nso the present system may also decrease its energy by increasing the density. Maybe this is what the instability\nis about.\n\nV.\n\nFIG. 5: An example to demonstrate the modulational instability of the joint atom-molecule condensate. Atom density\n|Φ|2 is plotted as a function of the spatial coordinate x and\ntime t, given that the system starts out at time t = 0 in the\nsteady state plus a small amount of random noise.\n\ning to three wavelengths of the most unstable excitation\nmode for these parameters, and time t runs from 0 to 127\n(in units of t0 ). The unit of |Φ|2 , atom density, is such\nthat for a homogeneous gas with everything in atoms,\nthe density would be |Φ|2 ≡ 1. The system starts at time\nt = 0 in the steady state appropriate for δ = 0, η = 0,\nexcept that we add a small amount of Gaussian noise to\neach of the points specifying the initial state. Figure 5\nis otherwise the same as Fig. 2 in Ref. [14], except that\na different seed was used for the random number generator that added the noise. As befits an instability, this\ninnocuous change has lead to a totally different quantitative result at long times.\nFrom the numerical simulations we see that the nature\nof the instability is such that the atoms and the molecules\ntogether combine into dense clumps. These clumps move\n\nEXPERIMENTAL CONSIDERATIONS\n\nThe models we have discussed until now have been\nrather rudimentary. We next take up two types of complications that may come up in experiments. First, in\nSec. V A enters an angle that is in principle included\nin our many-body Hamiltonian, although we have not\nyet considered it expressly: photodissociation of condensate molecules to states outside of the atomic condensate.\nIt turns out to limit the rate at which one can achieve\ncoherent atom-molecule conversion in adiabatic passage.\nSecond, in Sec. V B we discuss a number of aspects that\nhave so far been missing from our models: spontaneous\nemission from the photoassociated state, atom-atom interactions, trapping of atoms and molecules, and various\nlevel shifts. Spontaneous emission can be ameliorated by\nresorting to a two-color photoassociation scheme. Provided that photoassociation is speedy enough, which we\nbelieve is technically possible, the rest of these complications may be minor nuisances rather than dominant features of an experiment. What it takes to make photoassociation speedy enough is the subject of Sec. V C, where\nwe discuss the characteristic Rabi frequency for photoassociation Ω for various alkalis. Finally, in Sec. V D, we\nanalyze the published experiment of Ref. [16] from our\nviewpoint of coherent photoassociation.\n\nA.\n\nRogue photodissociation\n\nAs we noted already, in the case of photoassociation\nof an infinite homogeneous condensate, momentum conservation uniquely determines the state of the ensuing\nmolecule. The converse, however, does not hold. When\n\n\f14\na molecule photodissociates into two atoms, momentum\nconservation does not force the atoms to return to the\natomic condensate. Bose enhancement favors recombination of atoms with the condensate; the characteristic\nfrequency is Ω for both photoassociation and photodissociation between atomic and molecular condensates.\nNonetheless, atoms winding up elsewhere are lost for coherent photoassociation. We have coined the term \"rogue\nphotodissociation\" for photodissociation processes that\nsend atoms outside the atomic condensate.\nOne might think that energy conservation in the cycle of photoassociation and photodissociation is the additional constraint that guarantees that the atoms return\nto the condensate. But this need not be a compelling argument. Any time dependence in the system interferes\nwith energy conservation. For instance, suppose that\nphotodissociation proceeds to the noncondensate states\nat the same rate Γ0 (per atom) as it would in the case\nof a nondegenerate gas of molecules, so that after a time\n∼ Γ−1\ncoherent photoassociation ceases. The photodis0\nsociation rate Γ0 in itself furnishes a time scale such that\nenergy has to be conserved only to within h̄Γ0 . The time\nevolution involved in nonlinear Rabi flopping would also\ninterfere with energy conservation.\nWe present here a rudimentary model for rogue photodissociation for the special case when the detuning is\nswept in order to convert an atomic condensate to a\nmolecular condensate. The key assumption is that we\nmay employ the standard Markov approximation in the\nanalysis of photodissociation. This entails that rogue\nphotodissociation has no memory, but is characterized\nat each instant of time by a rate of exponential decay.\nSuch an assumption seems dubious in particular when\nthe laser is tuned to the close vicinity of the photodissociation threshold [29]. However, we know of no nearthreshold case of this kind in which the breakdown of the\nMarkov approximation has proven relevant in an experiment.\nEvidently, only the condensate mode, one of very many\natomic modes, is strongly affected by Bose enhancement.\nWe take rogue photodissociation to proceed at the rate\nthat would be appropriate for a nondegenerate gas at\nthe given detuning. Second, we model the dependence of\nthe photodissociation rate on detuning using the Wigner\nthreshold law, so that we write\nΓ(δ) = θ(δ)\n\nr\n\nδ\nΓ0 .\nΩ\n\n(66)\n\nFor convenience we have chosen the photoassociation frequency scale Ω as the reference detuning for photodissociation rate; Γ0 is the photodissociation rate for the\ndetuning δ = Ω. As the third quantitative element of\nthe model, we take the probability that a given atom is\nin the molecular condensate to be twice the square of\nthe molecular field amplitude as solved from the classical\nfield theory, and normalized as in (50). Explicitly, in dimensional units and for δ ≥ 0, this probability is found\n\nfrom Eq. (53) as\n\n\n\u0012 \u00132 2\n\u0012 \u0013 s\nδ \n1 \nδ\n+ 6+\n−\nPM (δ) =\n18\nΩ\nΩ\n\n(67)\n\nSuppose now that the detuning is swept as δ = −ξΩ2 t,\nas in our rapid adiabatic passage example. Ignoring the\ndepletion of the condensates due to the very same rogue\nphotodissociation, we find the total probability for rogue\nphotodissociation\nr\nZ\nδ(t)\nP =\ndt PM [δ(t)] Γ0\nΩ\nδ(t)≥0\n\u0014 3/4 Z ∞\n\u0010\n\u00112 \u0015\np\n√\nΓ0 2\n2\n=\n1+τ −τ\ndτ τ\nξΩ 31/4 0\nΓ0\n,\n(68)\n= α\nξΩ\nwhere the numerical constant has the value α = 4.03197.\nExcept for the numerical factor, this is the same expression we already used in a qualitative estimate in Ref. [8].\nSince the photodissociation rate grows linearly with\nlight intensity, ∝ I, and the photoassociation characteristic frequency\n√ Ω is proportional to the field strength of\nthe laser, ∝ I, in the end rogue photodissociation wins\nout as the light intensity is increased. Qualitatively, when\nP = 1, rogue photodissociation has overtaken coherent\nconversion of atoms to molecules. To study this borderline case, we first set P = 1 in Eq. (68) and solve Γ0 as\na function of Ω. We then insert the result into Eq. (27),\nthus eliminating Γ0 . Moreover, the velocity v0 in Eq. (27)\nis then the relative velocity of the dissociated atoms corresponding to the detuning of the laser that gave the\nphotoassociation rate Γ0 , in this case δ = Ω. Therefore\nwe have v02 /2μ = h̄Ω, and v0 may be eliminated as well.\nWe finally solve for the borderline value Ω as a function\nof the problem parameters. After simple manipulations\nthe ensuing characteristic frequency scale for photoassociation may be written\nΩ̂ =\n\n!2/3\n√\n8 2πξ\n(ρλ3 )2/3 ǫR .\nα\n\n(69)\n\nHere we have introduced λ, wavelength of the light divided by 2π, and the familiar recoil frequency for laser\ncooling\nǫR =\n\nh̄\n.\n2mλ2\n\n(70)\n\nThe main finding is that rogue photodissociation restricts the light intensity that one may profitably use for\nadiabatic atom-molecule conversion. This means that\nthere is also a maximum usable photoassociation frequency, or a minimum possible time scale for adiabatic\natom-molecule conversion. The way we have written our\n\n\f15\nestimate (69), the frequency scale is provided by the photon recoil frequency, and the corresponding time scale is\nin the ballpark of ǫ−1\nR . The density dependence of photoassociation is encapsulated in the parameter ρλ3 , the\nusual dimensionless parameter that governs the coupling\nof light with matter in a dense medium. For present-day\ncondensates ρλ3 ∼ 1 is a reasonable rule of thumb. Finally, we have a numerical constant that depends on the\nrate of sweeping of the detuning, but which may also be\nset equal to one in a rough estimate. Altogether, when\nin need of a qualitative number for the photoassociation\nfrequency Ω, we resort to Ω ∼ ǫR .\nAlthough our estimate of the minimum time scale for\ncoherent photoassociation was developed for rapid adiabatic passage, we believe that (with ξ ≃ 1) it also applies\nto Rabi flopping. This is because the dimensional parameters of the problem are the same in both cases. In\nfact, as it comes to dimensional quantities, the minimum\ntime scale for coherent photoassociation is equivalently\nwritten [30]\nτ∼\n\nm\n.\nh̄ρ2/3\n\n(71)\n\nThis is the essentially unique quantity with the dimension\nof time that can be put together using the quantities\ncharacterizing a homogeneous, noninteracting, quantum\nmechanical, zero-temperature BEC; density, atom mass,\nand h̄.\nB.\n\nPhysics missing from model\n1.\n\nSpontaneous emission\n\nWe have discussed a one-color model for photoassociation. The physical drawback is that, where there\nis a strong dipole matrix element for photoassociation/dissociation driven by external light, there is also\na strong dipole matrix element for spontaneous emission.\nFor instance, if a photon is absorbed in photoassociation, then there is also a reverse spontaneous decay of the\nmolecule. The molecule may end up in bound vibrational\nstates, either in the same electronic manifold where the\natoms started from, or in some other electronic manifold.\nAlternatively, the photoassociated molecule may decay\nback to a dissociation continuum in a process known as\nradiative escape. Either way, usually the probability is\nsmall that the system returns to the same two-atom state\nin which is started. After each process of spontaneous\nemission, two atoms are typically lost for any profitable\nuse.\nThe analogous problem of an unstable excited state\nis standard fare in quantum optics, and so is the solution: add another laser-driven transition from the spontaneously decaying state to a stable state. In the same\nway, two-color Raman photoassociation, a free-bound\ntransition followed by a bound-bound transition of the\nmolecule, may take place between (nearly) non-decaying\n\nb\nχ\n\n∆\n\nΓ+ Γs\n\ng\n\nκ\n\na\n\nδ\n\nFIG. 6: Schematic three-level scheme for photoassociation.\nThe levels a, b and g stand for atoms, primary photoassociated\nmolecules, and final stable molecules, respectively. The figure\nis drawn in the rotating frame, so that the Rabi frequencies\nκ and χ representing the laser fields are independent of time,\nand the intermediate and two-photon detunings ∆ and δ are\ndrawn as appropriate level energies.\n\natomic and molecular states [7, 32, 33]. Here we study\nRaman photoassociation as a means of achieving an effective two-mode scheme; genuine three-mode phenomena\nsuch as STIRAP are discussed elsewhere [13]\nOur present notation for this scheme is sketched in\nFig. 6. Suppose the first step of photoassociation takes\nplace with absorption of a photon, then one sets up another laser to force, say, induced emission from the primary photoassociated state to a (more) stable bound\nmolecular state. We call the Rabi frequency in the second\nstep χ, the detuning of the laser from resonance in the\nsecond transition ∆, and the spontaneous decay rate of\nthe primary photoassociation state Γs . In this context δ\nstands for the two-photon detuning, the total energy mismatch for light-induced transition from the initial atoms\nto the final stable molecular state, including appropriate\nphoton recoil corrections.\nLet us model our three-level Λ scheme using a variation\nof the two-mode model (15) as\nH\n= δ g † g + (∆+δ)b† b − χ(b† g+g † b) − 12 κ(b† aa+ba† a† ) ,\nh̄\n(72)\nwhere g, for \"ground\", is the annihilation operator for\nthe stable molecular state. Once more, we have added a\nmultiple of the conserved particle number, this time in\nsuch a way that the atoms have zero energy. The term\n∝ χ describes transitions between the bound molecular\nstates. Spontaneous losses from the intermediate state\nare ignored for the time being.\nThe Heisenberg equations of motion from Hamiltonian (72) are\nġ = −iδg + iχb,\n\nḃ = −i(∆ + δ)b + iχg +\n†\n\nȧ = iκa b .\n\n(73)\n1\n2 iκaa,\n\n(74)\n(75)\n\nWe next eliminate the intermediate state adiabatically\nwith the assumption that ∆ is the largest evolution frequency in the system. We thus formally set ḃ = 0, and\n\n\f16\nobtain\n\n2.\n1\n2 κaa\n\nχg +\n.\n(76)\n∆\nInserting this into Eqs. (73) and (75), we have\n\u0012\n\u0013\nκχ\nχ2\nġ = −i δ −\ng + 12 i\naa,\n(77)\n∆\n∆\nκ2\nκχ †\na g + 21 i a† aa .\n(78)\nȧ = i\n∆\n∆\nThese are Heisenberg equations of motion for the effective\nHamiltonian\n\u0013\n\u0012\nHeff\nχ2\nκ2\nκχ † †\ng † g− 14 a† a† aa− 21\n= δ−\n(a a g+g † aa) .\nh̄\n∆\n∆\n∆\n(79)\nThe effective Hamiltonian describes a two-level system\nwith the two-photon detuning δ and two-photon Rabi\nfrequency κχ/∆ in lieu of the usual detuning and Rabi\nfrequency. There are two additional twists to the story.\nFirst, the two-photon resonance experiences a light shift\n−χ2 /∆, an old acquaintance from quantum optics. Second, we have an effective atom-atom interaction proportional to κ2 /∆. An analogous interaction in a nondegenerate gas was discussed earlier in Ref. [31]. Other\nthan these tweaks, everything we have said about the\ntwo-mode model applies as before.\nThe adiabatic elimination (76) has a dark side hidden\nby a notational trick, namely, that it does not preserve\nboson commutators. Had we written the right-hand side\nin Eq. (75) as ba† instead of a† b and substituted (76), the\natom-atom interaction term in the effective Hamiltonian\nwould have displayed the operator ordering aaa† a† instead of a† a† aa. The difference is immaterial for a large\natom number, the limit we are studying anyway, but a\nmore careful investigation of the adiabatic elimination\nwould be in order if the atom number were not large.\nAs excessive care with operator products is not warranted, we write from the adiabatic assumption the number of atoms in the intermediate state b qualitatively as\n\u0010 κ \u00112\n\u0010 χ \u00112\ng†g +\n(a† a)2 .\n(80)\nb† b ∼\n∆\n2∆\n√\n√\nLet us scale the operators by N , i.e., write b = N β,\nand so forth. Then, within a factor of two, the quantum\nexpectation value hβ † βi is the probability that an atom\nis in the intermediate state, and so on. Equation (80)\nbecomes\n\u00132\n\u0012\n\u0010 χ \u00112\nΩ\nβ†β ∼\nγ †γ +\n(α† α)2 .\n(81)\n∆\n2∆\nb≃\n\nThe fraction of atoms lost per unit time to spontaneous emission from the intermediate state equals\n2Γs hβ † βi.The intermediate detuning ∆ suppresses losses\nby a factor ∝ 1/∆2 , whereas the effective Rabi frequency\nscales as 1/∆. In principle, and at the present level of\nthe physical model, it is possible to get rid of the harmful\nspontaneous emission to any desired degree by increasing\nthe intermediate detuning.\n\nInteractions between atoms and molecules\n\nAtoms interact among themselves, molecules interact\nwith molecules, and atoms even interact with molecules.\nFor a dilute gas, the atom-atom interaction is often described by the effective two-body potential\nU (r1 , r2 ) =\n\n4πh̄2 a\nδ(r1 − r2 ) ,\nm\n\n(82)\n\nwhere a is the s-wave scattering length for the atoms\nas before. One may write analogous models for atommolecule and molecule-molecule interactions. If atomatom interactions were suspected to be a factor, one could\nadd to the field theory the usual two-body atom-atom\ninteractions as\nHAA =\n\n2πh̄2 a †\nφ (r)φ† (r)φ(r)φ(r) ,\nm\n\n(83)\n\nand so on. Inelastic collisions, such as quenching of the\nmolecules by collisions, may also prove important. At a\nphenomenological level, they could be described by using\na complex scattering length for atom-molecule collisions.\nNonetheless, we have considered neither elastic nor inelastic collisions explicitly in this paper. The motivation\nis mainly pragmatic. Photoassociation is the novelty of\nthis work anyway. Second, at this point in time virtually\nnothing is known about the scattering lengths for cases\nother than atom-atom interactions. Third, as pointed\nout in Sec. V A, we anticipate a characteristic frequency\nscale for photoassociation, Ω, to be of the order of photon recoil frequency ǫR of laser cooling, say, ten kilohertz.\nThis is larger than a typical frequency scale associated\nwith collisions, 4πh̄aρ/m, in many of the present alkali\nexperiments. Photoassociation should dominate the action at least over short time scales.\nMore formally, we see from Eqs. (69) and (71) that the\nmaximum usable photoassociation frequency scales with\natom density as ρ2/3 , while the rate of binary collisions\nscales as ρ. In principle and at this level of modeling, it\nis always possible to make photoassociation win out by\ndecreasing the density.\nOf course, not all of our discussions are for short times\nonly. Notably, in the case of the instability of a joint\natom-molecule condensate, it may well happen that collisional interactions eventually play a role in the clumping. We plan to return to collisional effects in a future\npublication, inasmuch as something worthwhile emerges\nfrom this front.\n\n3.\n\nTrapping of atoms\n\nIn the current alkali vapor experiments one does not\nsee infinite homogeneous condensates, but the condensate is ordinarily confined to a magnetic trap with a\n(practically quadratic) potential V (r). This may be\n\n\f17\ntaken into account in the field theory by adding a term\nin the Hamiltonian density,\nHVA (r) = φ† (r)V (r)φ(r) .\n\n(84)\n\nA similar additional term would describe trapping of\nmolecules.\nIn fact, the beauty of the field theoretical formulation\nis that it does not depend on any given one-particle basis to describe the motion of the atoms and molecules.\nThe photoassociation term was originally discussed using plane-wave states, which makes the derivation easy,\nbut at the level of field theory there is no manifest vestige\nof plane waves anymore. Even if we add trapping potentials, there is no need to tamper with the photoassociation term. This should be contrasted with the more delicate situation that emerges if one tries to consider photoassociation directly using the eigenstates of the trap,\nor indeed some states that would take into account both\ntrapping and atom-atom interactions.\nOnce more, if the photoassociation frequency scale is\nof the order ǫR , it is still vastly larger than the typical frequency scales associated with magnetic trapping\nof atoms, and the corresponding length scale for photoassociation, λ, is far smaller than the size of a typical\ncondensate. Over short times the condensates behave locally as if they were homogeneous. One just applies the\ntheory of an infinite condensates at each local density,\nand averages the results over the trap.\nOn the other hand, there are cases in our formulation\nwhere the trapping will matter. For Ω ∼ ǫR the modulational instability may well set in as in a homogeneous\ncondensate, but the motion of the atoms and molecules\ndue to the trapping forces will certainly have a long-term\neffect on the atom-molecule clumps. We do not discuss\nthis issue here, but plan to return to trapping in a future\npublication.\n\n4.\n\namounts to a shift of the photodissociating state with respect to the continuum. The shift is proportional to light\nintensity, and in a qualitative estimate is comparable to\nthe photodissociation rate; see, e.g., Refs. [34].\nMoreover, there are additional shifts due to the presence of each and every discrete state dipole-coupled to\nthe initial state. The sum of all light shifts is actually finite only because the dipole coupling eventually tends to\nzero when one goes high enough in the energy of the coupled states. The implication is that, a priori, all dipole\ncoupled states, even those off resonance by perhaps several photon energies, have to be considered explicitly. If\none finds a significant contribution to the light shift from\none far-off resonance state, chances are that one has to\nconsider all of them.\nWe will not attempt to address continuum and nonresonant light shifts explicitly. Nonetheless, on the basis of the atomic case discussed in Refs. [34], we believe\nthat, at least above the photodissociation threshold, the\nlight shift should be reasonably independent of where exactly the laser is tuned. This would mean that, in the\nrapid adiabatic passage type atom-molecule conversion,\nthe light shift merely gives a constant bias to the detuning, and is virtually inconsequential.\nC.\n1.\n\nFrom rate to Rabi frequency\n\nOne-color photoassociation has been analyzed by various groups [35], in particular for alkalis at finite temperature. A typical outcome is the photoassociation rate Rv′\nA\n(in s−1 ) or the photoabsorption rate coefficient αP\nv ′ (in\n5\n′\ncm ) for a given bound level v of the excited electronic\nstate. The latter quantity is independent of two experimental parameters, namely atom density ρ and laser intensity I. The rate of photoassociation Rv′ is obtained\nvia\n\nLevel shifts\n\nWe have already mentioned a few mechanisms that can\nchange the position of the photoassociation resonance.\nAtom-atom and molecule-molecule interactions alter the\nenergy per atom or per molecule, and thereby modify\nthe resonance condition for photoassociation. Since the\natom-molecule ratio conversely depends on the detuning,\nthe makings of bistability and hysteresis are in principle there. We have also discussed the light shift and the\nmany-body shift in a two-color, three-mode configuration.\nOne more shift we have brought up before [6, 7], but\nnot yet in this paper, arises because the dissociation continuum is not flat. Given the initial state, the dipole matrix element (or more precisely, the square of the dipole\nmatrix element per unit energy) depends on the final\ncontinuum state. The result is that the photodissociation rate picks up an imaginary part. That, of course,\n\nNumerical examples\n\nA\nRv′ = ρφαP\nv′ ,\n\n(85)\n\nwhere the photon flux (photons/s cm2 ) is given by φ =\nI/h̄ωL , ωL being the photon frequency.\nBut we also know from our earlier work [6, 7] that\nthe photoassociation rate in a thermal sample is given in\nterms of our detuning δ, temperature T , and photoassociation rate Γ as\nRv′ = e\n\n− kh̄δT\nB\n\nρλ3D Γ ,\n\n(86)\n\n\u00131/2\n\n(87)\n\nwhere\nλD =\n\n\u0012\n\n2πh̄2\nμkB T\n\nis the usual thermal de Broglie wavelength, albeit calculated using the reduced mass of the colliding atoms.\nIn what follows, we write the detuning parameter for\n\n\f18\nphotoassociation as δ = ω∞ − ωL − ∆v′ , where h̄ω∞ is\nthe asymptotic energy difference between the electronic\ncurves and ∆v′ is the red-detuning of level v ′ from its\nasymptote. The binding energy of the molecular state is\nthus equal to h̄∆v′ . Combining Eqs. (85) and (86) with\nEq. (27), we have an expression for the characteristic frequency of coherent photoassociation to the level v ′ ,\ns\nA\nh̄δ\n2πh̄2 αP\nv ′ φρ\n.\n(88)\nΩv′ = e 2kB T\nvμ2 λ3D\nIn all of our discussion below we choose the detuning\nin such a way that h̄δ = 12 kB T , which gives the corp\nkB T /μ. Strictly\nresponding resonance velocity v =\nspeaking, Eq. (27) requires the limit v → 0, or equivalently, δ → 0. However, we always assume, without explicitly checking this assumption, that the temperature\nis already low enough to bring the system into the region\nof validity of the Wigner threshold law. The quotient\nΓ/v in Eq. (27) has then supposedly reached the v → 0\nlimit.\nWe have already introduced the usual density parameter for light-matter coupling λ3 ρ to characterize atom\ndensity, and the recoil frequency ǫR as the frequency\nscale. In the same vein, we write the Rabi frequency\nfor photoassociation as\ns\u0012 \u0013\nq\nΩv ′\nI\n(λ3 ρ) ,\n=\n(89)\nǫR\nIv′\nwhere Iv′ is the characteristic light intensity for coherent photoassociation. In explicit numbers, we find from\nEq. (88)\nIv′ =\n\nW\n1.46245 × 10−26\n\u0014\n\u0015\n,\n\u0002 m \u00032 h T i h λ i2 αP′A cm2\nv\nu\nK nm\ncm5\n\n(90)\n\nwhich also displays the units used to express atomic mass\nm, temperature T , wavelength of light λ, and photoabA\nsorption coefficient αP\nv′ .\n2.\n\nCalculated photoassociation rates\n\nOne can estimate the photoabsorption rate coefficient\nfor a pair of atoms. At low temperatures, only s-wave\nscattering contributes to the process, and one finds [17,\n36]\nA\nαP\nv ′ (ω, T ) ≃\n\n4π 2 ω 3 − kh̄δT\nλ e B |Dv′ (h̄δ)|2 ,\n3c D\n\n(91)\n\nIn the low-temperature limit, the dipole matrix element\n|Dv′ (h̄δ)|2 can be approximated by\n|Dv′ (E)|2 ≡ |hv ′ , J = 1|D|h̄δ, J = 0i ,\n\u0013\n\u0012\n2μk\n|D0 |2 (a − Rv′ )2 Sv2′\n≃\nπh̄2\n\n(92)\n\nA\n(in cm5 )\nTABLE I: Photoabsorption rate coefficients αP\nv′\n−2\nand characteristic intensities Iv′ (in W cm ) for levels v ′\nwith the best simultaneous Franck-Condon factors with the\ncontinuum and the highest-lying level of the lower electronic\nstate, and for levels corresponding to detunings near 1 cm−1 .\nThe vibrational number v ′ as well as the corresponding binding energy ∆v′ (in cm−1 ) are also given. Calculations were\nperformed for T=1 mK.\n\nsinglet\n6 Li\n\ntriplet\n7 Li\n\n6 Li\n\n7 Li\n\nv′\n70\n69\n51\n58\n∆v ′\n36.4\n86.7\n164\n122\nA 2.8 × 10−32 2.4 × 10−32 2.3 × 10−31 2.0 × 10−32\nαP\nv′\nIv ′\n32\n27\n3.9\n33\nv′\n87\n94\n79\n86\n∆v ′\n0.99\n0.99\n1.05\n0.87\nA 6.7 × 10−30 7.8 × 10−30 9.2 × 10−29 2.1 × 10−29\nαP\nv′\nIv ′\n0.13\n0.085\n0.0098\n0.032\n\nwith E = h̄2 k 2 /2μ = h̄δ, where D0 = |d| is the asymptotic dipole moment, a is the scattering length, Rv′ is the\nclassical outer turning point of the excited level v ′ , and\nSv′ is a dimensionless parameter representing the fraction of the bound wave function contained in the last\nnode [17, 36, 37].\nFor example, given 7 Li atoms in a triplet state at 1\nmK, a detailed calculation [37] showed that the excited\nlevel v ′ = 58 has the best Franck-Condon factor with\nthe continuum and the highest-lying bound level v ′′ =\nA\n10 of the lower triplet electronic state, with αP\nv ′ =58 =\n2.0 × 10−32 cm5 [38]. The corresponding characteristic\nintensity is Iv′ =58 = 33 W cm−2 .\nBeyond this, in Fig. 7 we give the calculated rate coefficients for high-lying vibrational states for both stable\nisotopes of Li, for both the singlet and the triplet excited\nstates. Correspondingly, Table I presents a few numerical examples of the rate coefficients and characteristic\nintensities.\nMuch larger photoassociation rates and correspondingly smaller characteristic intensities can be obtained\nif the excited levels v ′ are closer to the dissociation\nlimit (i.e., have smaller binding energies). In fact, the\nv ′ = 58 level is deeply bound, with a binding energy of\nh̄∆v′ =58 = 5.5 × 10−4 hartree (or 122.22 cm−1 [39]). For\nexample, v ′ = 86 with a binding energy of 0.87 cm−1\nA\nhas a rate coefficient 1050 times larger, namely αP\nv ′ =86 =\n2.1 × 10−29 cm5 , which gives the characteristic intensity\nIv′ =86 = 0.032 W cm−2 . The high-lying excited levels v ′\nhave larger rate coefficients because the overlap of the\nexcited bound wave function and the continuum ground\nwave function is larger. For high v ′ , the overlap scales\n\n\f19\n10\n10\n10\n10\n10\n\n7\n\n(a)\n\n-30\n\nLi singlet\n\n-32\n-34\n-36\n\n600\n\n500\n\n10\n\n300\n\n200\n\n100\n\n0\n\n6\n\n(b)\n10\n\n400\n\n-28\n\n5\n\nαv'PA (cm )\n\n10\n\n-28\n\nLi singlet\nLi singlet\n\n7\n\n-30\n\n-32\n\n-34\n\n10\n-28\n10\n10\n10\n10\n\n6\n\n(c)\n\nLi triplet\nLi triplet\n\n7\n\n-30\n\n-32\n\n-34\n\n140\n\n120\n\n100\n\n80\n\n60\n\n40\n\n20\n\n0\n\n∆ v' (cm-1)\nA\nFIG. 7: Variation of photoassociation rate coefficient αP\nv ′ for\n7\nhigh-lying vibrational states. In (a), the Li singlet transitions over a range of 600 cm−1 exhibit oscillations mapping\nthe nodal structure of the continuum wave function, with values varying over five orders of magnitude. Plots (b) and (c)\nshow a shorter range of detunings for singlet and triplet transitions, respectively. The singlet scattering lengths of both\nA\nisotopes are positive and αP\ndecays rapidly from its large\nv′\nvalues near ∆ ∼ 0 cm−1 , by nearly three orders of magnitude.\nA\nThe triplet scattering lengths are both negative, and αP\nv ′ decreases slowly for small detunings, until the first nodes of the\ncontinuum wave functions are reached.\n\n−1/2\n\nlike ∆v′ .\nSimilar results for sodium and cesium are available.\nA\nFor small binding energies, the rate coefficient αP\nat\nv′\n1 mK is of the order of 10−28 cm5 for Na, and 10−27\ncm5 for Cs [40]. These translate to characteristic intensities as small as μW cm−2 . Notice that for lithium, the\nrate coefficients for singlet transitions are smaller than\nfor triplet transitions, reflecting the sign of the scattering length: this is especially significant for 6 Li, where the\ntriplet scattering length is negative and enormous [18].\nOther expressions based on semi-classical treatment\nhave been developed [40, 41]. For example, in [41], the\nrate for s-wave contribution is\ns\nh̄δ\nπ2\n3 − kB T\nRv′ ≃ ρλD e\nsin2 [k(Rv′ − A(k))]κ2 ; (93)\n3δ∆v′\nwhere κ = d * E/2h̄ is the Rabi frequency of the laser of\nintensity I, A(k) represents a shift from the free solution,\nand ∆v′ (again) is the detuning of the level v ′ from the\ndissociation limit. This expression is valid for s-wave\nscattering and at low detunings. In the limit k → 0,\nA(kR ) → a, and the maximum of Rv′ is found to be at\nh̄δ ≃ kB T /2, so that\ns\n2π 2 μ2 p\nkB T (Rv′ − a)2 . (94)\nRv′ ≃ ρλ3D e−1/2 κ2\n3h̄3 ∆v′\n\nThis equation is similar to Eqs.(85)-(92). Notice that\n√\n−1/2\nfor\nsince λD ∝ 1/ T , the rate scales as 1/T and ∆v′\nsmall detuning. For lithium at 0.140 mK (corresponding to the Doppler temperature), assuming a laser intensity of 1000 W/cm2 (so that κ = 0.8 × 1010 s−1 : see\n[41] for details), and a detuning ∆v′ ∼ 1 cm−1 ≃ 30\nGHz (or 4.5 × 10−6 hartree), we have Rv′ = 135 a0 and\nλD = 1489 a0 = 7.875 × 10−6 cm. For a density ρ = 1011\ncm−3 , this gives ρλ3D = 4.88 × 10−5 and, neglecting the\nscattering length a, one gets Rv′ ∼ 9.6 × 104 s−1 . If we\nscale the rate to T = 1 mK, we get 1.3 × 104 s−1 , less\nthan twice the value 7140 s−1 obtained from Eq. (85)\nA\nusing the calculated value of αP\nv ′ =86 given above. Notice that many assumptions are made in these estimates:\nnonetheless, expression (94) gives good order of magnitude for the photoassociation rate for small detuning and\nlow temperatures.\nUsing the Doppler temperature as a typical temperature, and averaging the rate using a linewidth corresponding to 5 MHz [41], one finds typical rates for small\ndetunings by scaling the numbers of Table II with the\nappropriate temperature, density, laser intensity, and detunings, according to\nr\nI ρ T0 ∆0\n′\nRv ≃\nR.\n(95)\nI0 ρ0 T\n∆v′\nHere, I0 = 1000 W/cm2 , ρ0 = 1011 cm−3 , ∆0 = 1 cm−1 ,\nand T0 and R̄ are listed in Table II. Correspondingly,\nαP A scales as\nr\nT0 ∆0 P A\nA\nαP\nα\n.\n(96)\n≃\n′\nv\nT\n∆v′\nThe characteristic intensities should then scale with the\nsquare root of the detuning ∆v′ , so that we have\nr\n∆v′\nIv′ =\nI0 .\n(97)\n∆0\nThe values of λ, φ and αP A are listed in Table II.\nTo compare the rates for the various alkali metals, it\n\nTABLE II: Approximate scaled photoabsorption rates R and\nrate coefficients αP A for weakly bound molecular states. The\nvalues of R, and T0 are from Pillet et al. [41], I0 = 1000 W\ncm−2 , ρ0 = 1011 cm −3 , and ∆0 = 1 cm−1 .\nAtom\n\nLi\nNa\nK\nRb\nCs\n\nT0\nR\nλ\nφ\nmK 104 s−1 nm 1021 cm−2\n0.140\n0.240\n0.140\n0.140\n0.125\n\n45\n22\n25\n13\n10\n\n671\n589\n766\n780\n852\n\n3.4\n3.0\n3.9\n3.9\n4.3\n\nαP A\ncm5\n1.3 × 10−27\n7.3 × 10−28\n6.6 × 10−28\n3.3 × 10−28\n2.3 × 10−28\n\n\f20\nTABLE III: Approximate photoassociation rates R, rate coefficients αP A , and characteristic intensities Iv′ for the alkalis.\nThe fixed parameters are I0 = 1000 W/cm2 , ρ0 = 1011 cm−3 ,\n∆0 = 1 cm−1 , and T=100 μK,. Also listed are the reference\ndensities λ−3 (in cm−3 ) and frequencies ǫR (in 2π kHz).\nAtom\n\nRv′\n104 s−1\n\nA\nαP\nv′\ncm5\n\nIv ′\nmW cm−2\n\nλ−3\ncm−3\n\nǫR\n2π kHz\n\n7 Li\n\n63\n53\n35\n18\n12\n\n1.8 × 10−27\n1.7 × 10−27\n9.2 × 10−28\n4.6 × 10−28\n2.9 × 10−28\n\n3.7\n0.47\n0.18\n0.069\n0.039\n\n8.21 × 1014\n1.21 × 1015\n5.52 × 1014\n5.23 × 1014\n4.01 × 1014\n\n63.3\n25.0\n8.72\n3.77\n2.07\n\n23 Na\n39 K\n87 Rb\n133 Cs\n\nis convenient to express them for the same parameters.\nAssuming I0 = 1000 W/cm2 , ρ = 1011 cm−3 , T = 100\nμK, and ∆0 = 1 cm−1 , we obtain the values listed in\nTable III. The photoassociation rates vary between 1.2 ×\n105 s−1 (or αP A ∼ 2.9 × 10−28 cm5 ) for Cs and 6.3 ×\n105 s−1 (or αP A ∼ 1.8 × 10−27 cm5 ) for Li. From the\nexpressions for Rv′ , one expects the rates to scale like\n1/2μ. If we were to multiply the rates by M , the mass\nnumber, we notice that, except for Li, the scaled rates\nindeed are similar. The variations left are due to slightly\ndifferent Rabi frequencies [41].\nFinally, one has to be careful when using the values\nof Table III, in which the effect of scattering lengths are\nnot taken into account. These effects can be significant,\nlike in the case of 6 Li, 85 Rb or 133 Cs, where large negative scattering lengths induce larger rates. Also, at larger\ndetunings, one probes deeper region of the excited electronic state, and shorter distances of the lower state continuum wave function, where the exact nodal structure\nwill play an important role (see [17, 36, 37] and Fig. 7).\nAs already noted, the values for the saturation intensity in Table III are to be construed as estimates only.\nAlso, as they are, they apply to a very weakly bound\nmolecular state (∆v′ = 1 cm−1 ). Such high-lying states\nare likely to be easily perturbed by atom-molecule collisions, so that in practice one might resort to more bound\nmolecular states. Nonetheless, these saturation intensities are remarkably low, occasionally much lower than\nour initial generic estimate of 10 Wcm−2 [8, 14]. From\nthe experimental viewpoint this is encouraging, as the\nrequirements on laser intensity are greatly moderated.\nThe flip side is that the usable intensity appears to be\nlimited by rogue photoassociation; for densities such that\nλ3 ρ ∼ 1, the maximum photoassociation Rabi frequency\nis of the order of the recoil frequency ǫR . For heavier\nalkalis the saturation intensities may indeed be low, but\nsmall recoil frequency and slow coherent photoassociation are the prices to pay.\n\nD.\n\nDiscussion of an experiment\n\nIn the experiment of Wynar et al., Ref. [16], the authors studied photoassociation of a 87 Rb condensate in a\ntwo-color Raman configuration. From our standpoint,\nthe reported data fall into two categories. First, the\nwidth and shift of the two-photon resonance line was\nstudied as a function of the intensities of the two lasers.\nWe are going to use these measurements to estimate the\nbound-bound Rabi frequency. Second, the authors measured the width and the shift of the same resonance line\nas a function of the density of the condensate. At low intensities, elastic atom-atom and atom-molecule collisions\nturn out to have a major effect on the resonance parameters. However, these effects were modeled quantitatively\nin Ref. [16], and one may then get at the quantities pertaining to photoassociation. We use this type of data to\ndetermine the characteristic frequency of coherent photoassociation.\n\n1.\n\nAdapting the theory\n\nWe first cast our theoretical approach in a form that\nallows for direct juxtapositions with the analysis of experimental data in Ref. [16]. We ignore elastic collisions\nbecause a comparison with Ref. [16] turns out to be possible even without considering them explicitly, and inelastic collisions because their presence was not conclusively\nestablished in Ref. [16].\nWe begin by adding the spontaneous decay of the intermediate state at the rate Γs as a nonhermitian term in\nthe Hamiltonian for the Λ system, Eq. (72). This gives\nH\nΓs\n= δ g † g + (∆ + δ)b† b + . . . − i b† b .\nh̄\n2\n\n(98)\n\nIt is known in quantum optics that introducing an imaginary part to the energy of the decaying state gives correct\nresults as long as the unstable state decays irreversibly\nonly to states that are outside of the state space included\nin the model.\nWe then repeat much of the analysis of Sec. V B 1 for\nthe Hamiltonian (98), with a number of tricks and approximations. First, we take the limit of large intermediate detuning, |∆| ≫ Γs , |δ|. Second, we assume that the\nbound-bound Rabi frequency χ is much larger than the\nfree-bound Rabi frequency Ω. This implies that in the estimates of the line widths and decay rates, such as those\nfollowing from Eq. (81), only the χ2 terms need be kept.\nThird, we ignore light-induced atom-atom interactions.\n√\nFourth, we scale the the operators as before, a = N α,\netc., which brings out the photoassociation frequency Ω\nexplicitly. Fifth, after deriving the equations of motion\nfor the atomic operator α and final-state molecule operator γ by adiabatic elimination of the intermediate-state\noperate β, in the spirit of semiclassical approximation we\nreplace the operators α, β, and γ with c numbers. At this\n\n\f21\nstage we have, in analogy with Eqs. (77) and (78), the\nequations\n\u0013\n\u0012\nΓs χ2\nχ2\nΩχ 2\nγ−\nγ + 21 i\nα , (99)\nγ̇ = −i δ −\n∆\n2∆2\n∆\nΩχ ∗\nα̇ = i\nα γ.\n(100)\n∆\nTo develop the rate approximation, we first note that\nthe probability that an atom belongs to the stable state\ng, Pg = 2|γ|2 , satisfies the equation of motion\nṖg = −\n\nΓs χ2\nΩχ\nPg + i\n(C − C ∗ ) .\n2\n∆\n∆\n\n(101)\n\nThe \"coherence\" C = α2 γ ∗ has the equation of motion\nĊ = i\n\n\u0013\n\u0015\n\u0014 \u0012\nΓs χ2\nΩχ\nχ2\n−\nC , (102)\n[Pg Pa − 21 Pa2 ]+ i δ −\n∆\n∆\n2∆2\n\nwhere, in turn Pa = |α|2 is the probability that an atom\nremains in the system unassociated.\nWe could go on and derive a corresponding equation\nof motion for Pa . However, here we assume that Pa ∼\n1, and that correspondingly Pg ≪ 1. We solve for the\ncoherence C adiabatically by setting Ċ = 0, and insert\nthe result into Eq. (101) to obtain a rate equation for the\npopulation of the stable molecular state g,\nh\n\nΓs χ2\nṖg = − 2 Pg + h\n∆\nδ−\n\nΩχ\n∆\nχ2\n∆\n\ni2 h\ni2\n\n2\n\nΓs χ\n2∆2\n\n+\n\nh\n\ni\n\nΓs χ2\n2∆2\n\nχ2\n,\n∆\n\n2\ni2 Pa .\n\n(103)\n\n(104)\n\na linewidth\nΓs χ2\nγL\n,\n=\n2\n2∆2\n\nComparison with experiments\n\nWynar et al., Ref. [16], discuss the light shift of the resonance line. In their case the frequencies of the two lasers\nare quite close so that both of them cause line shifts and\nbroadenings, but this is included in their analysis. Translating back to our case with only one laser frequency on\nthe bound-bound transition, the comparison between our\nformulation and Ref. [16] reads\nχ2\nβI2\n,\n=\n∆\n∆1\n\n(105)\n\nand a corresponding direct decay of bound molecules at\nthe rate γL .\nWith the assumption Pg ≪ 1 we have made the rate\nequation (103) essentially one way, i.e., ignored transitions from molecules back to the atoms. The semiclassical approximation in general requires that there are many\nmolecules in a quantum state, so that the molecules make\na condensate. However, we believe that, by ignoring transitions from molecules back to atoms, we have divorced\nthe rate equation (103) from any coherence requirement\nfor the molecules. As the experiments do not claim a\nmolecular condensate, this is essential for the analysis\nthat follows.\n\n(106)\n\nwhere I2 is the intensity (in W cm−2 ) of the bound-bound\nlight, ∆1 ≡ ∆ = 2π × 150 MHz is the intermediate detuning, and β = 3.5 × 109 m2 W−1 s−2 is a parameter that we\ndeduce from their Fig. 3a. This gives the approximate\nformula\nr\nI2\nχ ≃ 0.94\n× 2π MHz .\n(107)\nWcm−2\nWynar et al., Ref. [16], also present an analysis of\nline shapes at low intensity. The rate coefficient for\ntwo-photon photoassociation on resonance, K0 = 9 ×\n10−14 cm3 s−1 , is one of the fitted parameters. The resonance photoassociation rate from our Eq. (103) and the\ncorresponding expression in Ref. [16], ignoring inelastic\nprocesses and with n ≡ ρ, boil down to\nΩ2\n= nK0 .\nΓs\n\nThis displays a shift of the ground state by\n∆εL =\n\n2.\n\n(108)\n\nGiven the spontaneous decay rate of this molecular level,\nΓs = 12 × 2π MHz [16], and noting that their cited value\nof K0 was for the intensity of the photoassociation laser\nI1 = 0.51 W cm−2 , we find the scaling formula\nr\nρ\nI1\nΩ ≃ 5.8\n× 2π kHz ,\n(109)\n1014 cm−3 Wcm−2\n=\nwhich gives the characteristic intensity Iv′\n0.08 Wcm−2 .\nIn the experiment, the binding energy of the primary\nphotoassociated state was 23 cm−1 . In contrast, for\n∆v′ = 1 cm−1 , Table III gives the characteristic intensity\n0.07 mWcm−2 . The theoretical and experimental characteristic intensities differ by three orders of magnitude,\nbut they are also for different binding energies. The difference in characteristics intensities is no cause for concern, as we do not know at all how the detuning 23 cm−1\nfor Rb is related to the minima of the photoassociation\nrates like those shown in Fig. 7 for Li.\n3.\n\nReaching coherence\n\nSuppose that the density of the 87 Rb gas equals ρ =\nλ , a factor of two larger than quoted in Ref. [16], the\n−3\n\n\f22\nlaser intensities are I1 = I2 = 10 W cm−2 , typical values in photoassociation experiments, and the intermediate detuning is as in Ref. [16]. Then the two-photon\nRabi frequency becomes Ωχ/∆ = 1 × 2π kHz, while the\neffective linewidth is χ2 Γs /2∆2 = 2 × 2π kHz. For coherent phenomena we need a Rabi frequency at least\ncomparable to the linewidth, a condition that is not\nquite satisfied. But if one were simply to take the intensities I1 = 100 W cm−2 for the photoassociating light\nand I2 = 1 W cm−2 for the bound-bound light, Rabi frequency remains unchanged and linewidth goes down by a\nfactor of 100. One is then in principle deep in the regime\nof coherent photoassociation. Also, the effective Rabi\nfrequency would be smaller than the recoil frequency, so\nthat rogue photoassociation need not yet be a fatal problem.\nOn the other hand, eyeballing from Fig. 2 of Ref [16],\nthe linewidth due to elastic atom-atom collisions would\nbe of the order of 5 × 2π kHz, so elastic collisions would\ninterfere with coherent photoassociation. Rabi oscillations would be seriously impeded, rapid adiabatic passage maybe less. One could compensate by lowering the\ndensity by two orders of magnitude and at the same time\nincreasing the intensity of the photoassociating laser by\nanother two orders of magnitude to keep the effective\nRabi frequency constant, but with lowering of the density one would wind up in trouble with rogue photoassociation.\nExperimentally, one can think of varying the intensity\nof the two lasers, the intermediate state, the intermediate\ndetuning, and the density of the sample. The conditions\none must watch out for are that effective Rabi frequency\nbe larger than the effective damping rate and line broadening due to elastic (and inelastic) collisions, yet not so\nlarge as to cause excessive rogue photoassociation. If the\nparameters could be varied freely, within our physical\nmodel a solution is always possible. Unfortunately, one\nmust live with some practical limitations on, say, laser\nintensities. The present experiment of Ref. [16] is tantalizingly close to coherent photoassociation, but to really\nget there may require a careful optimization of the experimental parameters and a solid understanding of what is\ntechnically feasible in a given experiment. We will not\nattempt to enter such discussions.\n\nVI.\n\nCONCLUDING REMARKS\n\nWe have developed theory for coherent photoassociation of a Bose-Einstein condensate of atoms, which typically leads to a Bose-Einstein condensate of molecules.\nPhenomena analogous to coherent optical transients in\nfew-level systems, such as Rabi flopping and rapid adiabatic passage between atomic and molecular condensates\nare expected. Coherent phenomena depend on the Bose\nenhancement of the dipole moment matrix element, and\ncannot occur in a nondegenerate gas, at least not in the\nthermodynamic limit. Bose-Einstein condensation and\n\nphotoassociation are both currently front-line research\nand the marriage thereof might still be a technological\nchallenge, but coherent optical transients in photoassociation should eventually be feasible in experiments.\n\nAcknowledgments\n\nThis work is supported in part by the NSF, Grant\nNo. PHY-9801888, and by NASA, Grant No. NAG81428. Additional support was provided by the Connecticut Space Grant College Consortium. One of us [JJ]\nthanks Sándor Varró for interesting discussions; in particular, for pointing out Ref. [19].\n\nAPPENDIX A: DIPOLE MATRIX ELEMENT\n\nIn our bare-bones example we consider the situation in\nwhich we either have one molecule at rest and no atoms,\nor no molecule and two atoms in states k and −k. Then\nthe relative momentum becomes h̄k. This peculiarity,\nand also the reason for the factor 21 in Eq. (14), is because\nthe relative momentum for two entities with momenta p1\nand p2 should be defined as 21 (p1 − p2 ) to make it the\nconjugate of the usual relative position r1 − r2 . We thus\nhave the possible state vectors\n!\nX\n†\n†\n|ψi = β b† +\nαk ak a−k |0i ,\n(A1)\nk\n\nwhere β and αk are complex amplitudes to be determined, and |0i stands for the vacuum of atoms and\nmolecules. The states for αk and α−k are the same, so\nthe sum over k runs only over half of the possible k values; say, those with kx > 0.\nFollowing Ref. [8], we write the time dependent\nSchrödinger equation from the Hamiltonian (12) in terms\nof the coefficients β and αk , assuming a plane wave of\nlight. In order to avoid an inessential complication, we\nignore photon recoil and simply set q = 0. The result is\n\u0012 2\n\u0013\nh̄k\nd∗ * E ∗\nα̇k = −i\n− δ0 αk + i\nβ,\n(A2)\n2μ\n2h̄\nXd*E\nαk .\n(A3)\nβ̇ = i\n2h̄\nk\n\nThe QC approach discussed in Refs. [6] and [7] displays precisely the same structure, evidently identifying\nd * E/2h̄ as the QC Rabi frequency κ of those papers.\nThere is a catch, however. Because of the BoseEinstein statistics, states with the relative momenta for\ntwo atoms k and −k are the same, so the density of states\nfor the relative motion is half of what it was for MaxwellBoltzmann atoms. To obtain the same photodissociation\nrate, we\n√ therefore have to make the matrix element a factor of 2 larger than in the case of distinguishable atoms.\n\n\f23\n√\nThis is the 2 in Eq. (14). The rate of photodissociation is proportional to the square of the matrix element\nand picks up a factor of two, which compensates for the\nmissing half of phase space density.\nThe second-quantized Hamiltonian is chosen so that\nit gives the right photodissociation rate. What we did\n√\nnot fully realize in Ref. [8] is that the same factor of 2\nalso leads to twice the photoassociation rate that one\nwould obtain for Maxwell-Boltzmann atoms, given the\nFranck-Condon factor from the standard calculations or\nas deduced from the photodissociation rate. It appears\nthat in the literature the rate for s-wave photoassociation is usually calculated low by a factor of two. Besides, by a simple extension of the statistics arguments,\np-wave photoassociation should vanish for bosons. Are\nthese problems?\nWe think not. In photoassociation experiments no particular care is usually taken to polarize the atoms. They\nare not all in the same internal state, and therefore not\nall photoassociation events are between indistinguishable\natoms. This should reduce the factor-of-two boson enhancement of the photoassociation rate for even partial\nwaves, and call forth odd partial waves. The remaining\ndiscrepancies with the conventional calculations may well\nbe within experimental and theoretical uncertainties.\nIt would be of some interest to investigate photoassociation of a polarized low-temperature gas experimentally.\nWe believe that the statistics effects are real, and should\nbe observable. After all, few colleagues seem to have a\nproblem with the assertion that there are no s-wave collisions for polarized fermions. Photoassociation experiments in a polarized gas should make an interesting test\nof our phenomenological Hamiltonian.\n\nfor states with a given wave vector. In the matrix element (B1) we should correspondingly use plane waves to\ndescribe the relative motion, as in\n′\n1\nφ̄k−k′ (r) = √ ei(k−k )*r .\n(B2)\nV\nHowever, in our derivation we did not not use plane\nwaves, but distorted plane waves that take into account atom-atom interactions, and only asymptotically\n(at large distances) corresponds to the relative momentum k − k′ .\nThis makes a difference. For instance, if the matrix\nelement (B1) is computed using pure plane waves, the\nfinal photoassociation kernel reads\n\nd(r) =\n\n√\n2 d ψ̄ ∗ (r) ,\n\n(B3)\n\nwhere ψ̄ is the bound-state molecular wave function and\nφ̄k−k′ describes the state of two atoms with the relative\nmomentum h̄(k−k′ ). Now, in the transformation to field\ntheory (18) we used plane waves as the wave functions\n\ninstead of something akin to (22). Depending on the\nvalue of the scattering length, there could be a substantial difference in the overall numerical factor also in\nthe contact-interaction form for atom-molecule coupling,\nEq. (24). The question is, which method is \"correct\";\npure or distorted plane waves?\nFirst of all, atoms do interact, which in general will\nhave an effect on photoassociation. One who wishes\nto analyze photoassociation quantitatively will have to\ntake atom-atom interactions into account. A field theorist pursuing pure plane waves would have to consider\natom-atom interactions explicitly, and work out the consequences in photoassociation ab initio. This is probably\na major chore. Our hope is that, with our distorted-plane\nwave trickery, we have phenomenologically captured most\nof the effect of atom-atom interactions on photoassociation.\nOn the other hand, if we use the distorted plane waves\nto calculate the photoassociation matrix element and\nin addition introduce a contact interaction model for\natoms as in (83), the suspicion arises that we are doublecounting atom-atom interactions. Further approximations, such as the contact-interaction form for photoassociation or classical field theory, could either exacerbate\nor ameliorate the double-counting.\nDisentangling atom-atom interactions and photoassociation might make an interesting theoretical exercise,\nbut we do not attempt it in this paper. Instead, we proceed with a model that allows for both distorted-plane\nwave matrix elements for photoassociation, and an explicit atom-atom interaction. In this way, we at least get\nthe limiting cases of photoassociation in a dilute gas and\natom-atom interactions in the absence of photoassociation basically right with little effor\n\n[1] H. R. Thorsheim, J. Weiner, and P. S. Julienne, Phys.\nRev. Lett. 58, 2420 (1987); R. Napolitano, J. Weiner, C.\nJ. Williams, and P. S. Julienne, Phys. Rev. Lett. 73, 1352\n\n(1994); P. D. Lett, P. S. Julienne, and W. D. Phillips,\nAnnu. Rev. Phys. Chem. 46, 423 (1995).\n[2] M. H. Anderson, J. R. Ensher, M. R. Matthews, C. E.\n\nAPPENDIX B: KERNEL FOR\nPHOTOASSOCIATION IN FIELD THEORY\n\nThe process we followed in the main text in deriving\nthe integral kernel d(r) [as in, e.g., Eq. (23)] was a phenomenological mix between formally pure field theory\nand collisional physics.\nIn fact, to obtain the dipole matrix elements dkk′ in\nEq. (12), we carry out an integral of the form\nZ\ndkk′ ≡ d(k − k′ ) = d d3 r ψ̄ ∗ (r)φ̄k−k′ (r) ,\n(B1)\n\n\f24\n\n[3]\n\n[4]\n[5]\n[6]\n[7]\n[8]\n[9]\n[10]\n[11]\n[12]\n[13]\n[14]\n[15]\n[16]\n[17]\n[18]\n\n[19]\n\nWieman, and E. A. Cornell, Science 269, 198 (1995);\nK. B. Davis, M. -O. Mewes, M. R. Andrews, N. J. van\nDruten, D. S. Durfee, D. M. Kurn, and W. Ketterle,\nPhys. Rev. Lett. 75, 3969 (1995); C. C. Bradley, C.\nA. Sackett, and R. G. Hulet, Phys. Rev. Lett. 78, 985\n(1997).\nE. R. I. Abraham, W. I. McAlexander, C. A. Sacket,\nand R. G. Hulet, Phys. Rev. Lett. 74, 1315 (1995); E.\nTiesinga, C. J. Williams, P. S. Julienne, K. M. Jones, P.\nD. Lett, and W. D. Phillips, J. Res. Natl. Inst. Stand.\nTechnol. 101, 505 (1996); C. C. Tsai, R. S. Freeland, J.\nM. Vogels, H. M. J. M. Boestan, B. J. Verhaar, and D.\nJ. Heinzen, Phys. Rev. Lett. 79, 1245 (1997).\nK. Burnett, P. S. Julienne, and K.-A. Suominen, Phys.\nRev. Lett. 77, 1416 (1997).\nP. S. Julienne, K. Burnett, Y. B. Band, and W. C. Stwalley, Phys. Rev. A 58, R797 (1998).\nJ. Javanainen and M. Mackie, Phys. Rev. A 58, R789\n(1998).\nM. Mackie and J. Javanainen, Phys. Rev. A 60, 3174\n(1999).\nJ. Javanainen and M. Mackie, Phys. Rev. A 59, R3186\n(1999).\nP. D. Drummond, K. V. Kheruntsyan, and H. He, Phys.\nRev. Lett. 81, 3055 (1998).\nP. Tommasini, E. Timmermans, M. Hussein, and A. Kerman; LANL preprint archive cond-mat/9804015.\nE. Timmermans, P. Tommasini, R. Côté, M. Hussein,\nand A. Kerman, Phys. Rev. Lett. 83, 2691 (1999).\nF. A. van Abeelen and B. J. Verhaar, Phys. Rev. Lett.\n83, 1550 (1999).\nM. Mackie, R. Kowalski, and J. Javanainen, Phys. Rev.\nLett. 84, 3803 (2000).\nJ. Javanainen and M. Kos̆trun, Optics Express 5, 188\n(1999).\nM. Mackie and J. Javanainen, J. Mod. Opt. xx, yyyy\n(2000).\nR. Wynar, R. S. Freeland, D. J. Han, C. Ryu, and D. J.\nHeinzen, Science 287, 1016 (2000).\nR. Côté, A. Dalgarno, Y. Sun, and R. G. Hulet, Phys.\nRev. Lett. 74, 3581 (1995)\nE. R. I. Abraham, W. I. McAlexander, J. M. Gerton, R.\nG. Hulet, R. Côté, and A. Dalgarno, Phys. Rev. A 53,\nR3173 (1996).\nThe \"well-known\" universality of the mode density, independently of the shape of the quantization volume, goes\nback at least to the work of Hermann Weyl in the beginning of the 20th century. See Selecta Hermann Weyl\n\n(Birkhäuser, Basel, 1956), pp. 59–110.\n[20] J. Javanainen and M. Ivanov, Phys. Rev. A 60, 2351\n(1999).\n[21] D. F. Walls and C. T. Tindle, J. Phys. A 5, 534 (1972).\n[22] G. Drobny and I. Jex, Phys. Rev. A 45, 1816 (1992).\n[23] H. He, M. J. Werner, and P. D. Drummond, Phys. Rev.\nE 54, 896 (1996).\n[24] S. Wolfram, The Mathematica Book, 3rd Ed. (Cambridge\nUniversity Press, New York, 1996).\n[25] S. Trillo and P. Ferro, Optics Lett. 20, 438 (1995).\n[26] H. He, P. D. Drummond, and B. A. Malomed, Optics.\nComm. 123 (1996).\n[27] M. D. Fleck and J. A. Feit, J. Chem. Phys. 78, 2578\n(1984); A. D. Bandrauk and H. Shen, Can. J. Chem. 70,\n555 (1992).\n[28] D. V. Skryabin and W. J. Firth, Optics Comm. 148, 79\n(1998).\n[29] K. Rzazewski, M. Lewenstein, and J. H. Eberly, J. Phys.\nB 15, L661 (1982).\n[30] D. Heinzen and W. Ketterle (unpublished) have developed the estimate (71) from completely different arguments.\n[31] P. O. Fedichev, Yu. Kagan, G. V. Shlyapnikov, and J. T.\nM. Walraven, Phys. Rev. Lett. 77, 2913 (1996).\n[32] J. L. Bohn and P. S. Julienne, Phys. Rev. A 54, R4637\n(1996).\n[33] J. L. Bohn and P. S. Julienne, Phys. Rev. A 60, 414\n(1999).\n[34] J. Javanainen, J. Phys. B 16, 1343 (1983); Optics Commun. 46, 175 (1983); Physica Scripta 31, 57 (1985).\n[35] See J. Weiner, V.S. Bagnato, S. Zilio, and P.S. Julienne,\nRev. Mod. Phys. 71, 1 (1999), and references therein.\n[36] R. Côté and A. Dalgarno, Phys. Rev. A 58, 498 (1998).\n[37] R. Côté and A. Dalgarno, J. Mol. Spect. 195, 236 (1999).\n[38] The rate coefficients listed in Refs. [36, 37] must be multiplied by (2π)5 , and we do not assume any hyperfine\nmixing (neglect ω0 in [36, 37]).\n[39] We determined the binding energy of level v ′ = 58 of 7 Li\ntriplet state to be 3666 ± 2 GHz by fitting the known\nlevels, and it was recently measured by R.G. Hulet and\nco-workers to be 3667 GHz.\n[40] P.S. Julienne, J. Res. Natl. Stand. Technol. 101, 487\n(1996); F. Masnou-Seeuws, O. Dulieu, A. Crubellier, and\nP. Pillet (private communication).\n[41] P. Pillet, A. Crubellier, A. Bleton, O. Dulieu, P. Nosbaum, I. Mourachko, and F. Masnou-Seeuws, J. Phys. B\n30, 2801 (1997).\n\n\f"}