{"id": "http://arxiv.org/abs/physics/0412067v1", "guidislink": true, "updated": "2004-12-11T08:24:56Z", "updated_parsed": [2004, 12, 11, 8, 24, 56, 5, 346, 0], "published": "2004-12-11T08:24:56Z", "published_parsed": [2004, 12, 11, 8, 24, 56, 5, 346, 0], "title": "Application of Multifractal Measures to Tehran Price Index", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=physics%2F0605069%2Cphysics%2F0412024%2Cphysics%2F0412048%2Cphysics%2F0412131%2Cphysics%2F0412074%2Cphysics%2F0412159%2Cphysics%2F0412153%2Cphysics%2F0412108%2Cphysics%2F0412063%2Cphysics%2F0412016%2Cphysics%2F0412117%2Cphysics%2F0412112%2Cphysics%2F0412033%2Cphysics%2F0412146%2Cphysics%2F0412066%2Cphysics%2F0412028%2Cphysics%2F0412070%2Cphysics%2F0412056%2Cphysics%2F0412129%2Cphysics%2F0412111%2Cphysics%2F0412116%2Cphysics%2F0412124%2Cphysics%2F0412099%2Cphysics%2F0412178%2Cphysics%2F0412014%2Cphysics%2F0412060%2Cphysics%2F0412174%2Cphysics%2F0412052%2Cphysics%2F0412170%2Cphysics%2F0412107%2Cphysics%2F0412003%2Cphysics%2F0412130%2Cphysics%2F0412022%2Cphysics%2F0412110%2Cphysics%2F0412180%2Cphysics%2F0412069%2Cphysics%2F0412018%2Cphysics%2F0412026%2Cphysics%2F0412102%2Cphysics%2F0412042%2Cphysics%2F0412053%2Cphysics%2F0412067%2Cphysics%2F0412043%2Cphysics%2F0412154%2Cphysics%2F0412011%2Cphysics%2F0412031%2Cphysics%2F0412032%2Cphysics%2F0412137%2Cphysics%2F0412062%2Cphysics%2F0412132%2Cphysics%2F0412004%2Cphysics%2F0412143%2Cphysics%2F0412088%2Cphysics%2F0412118%2Cphysics%2F0412005%2Cphysics%2F0412165%2Cphysics%2F0412182%2Cphysics%2F0412098%2Cphysics%2F0412013%2Cphysics%2F0412019%2Cphysics%2F0412097%2Cphysics%2F0412121%2Cphysics%2F0412050%2Cphysics%2F0412115%2Cphysics%2F0412080%2Cphysics%2F0412065%2Cphysics%2F0412078%2Cphysics%2F0412142%2Cphysics%2F0412120%2Cphysics%2F0412009%2Cphysics%2F0412105%2Cphysics%2F0412095%2Cphysics%2F0412010%2Cphysics%2F0412017%2Cphysics%2F0412164%2Cphysics%2F0412006%2Cphysics%2F0412040%2Cphysics%2F0412064%2Cphysics%2F0412155%2Cphysics%2F0412161%2Cphysics%2F0412002%2Cphysics%2F0412147%2Cphysics%2F0412021%2Cphysics%2F0412073%2Cphysics%2F0412083%2Cphysics%2F0412030%2Cphysics%2F0412091%2Cphysics%2F0412054%2Cphysics%2F0412086%2Cphysics%2F0412076%2Cphysics%2F0412020%2Cphysics%2F0412148%2Cphysics%2F0412039%2Cphysics%2F0412176%2Cphysics%2F0412127%2Cphysics%2F0412145%2Cphysics%2F0412081%2Cphysics%2F0412183%2Cphysics%2F0412057%2Cphysics%2F0412169%2Cphysics%2F0412072&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Application of Multifractal Measures to Tehran Price Index"}, "summary": "We report an empirical study of Tehran Price Index (TEPIX). To analyze our\ndata we use various methods like as, rescaled range analysis ($R/S$), modified\nrescaled range analysis (Lo's method), Detrended Fluctuation Analysis (DFA) and\ngeneralized Hurst exponents analysis. Based on numerical results, the scaling\nrange of TEPIX returns is specified, long memory effect or long range\ncorrelation property in this market is investigated, characteristic exponent\nfor probability distribution function of TEPIX returns is derived and finally\nthe stage of development in Tehran Stock Exchange is determined.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=physics%2F0605069%2Cphysics%2F0412024%2Cphysics%2F0412048%2Cphysics%2F0412131%2Cphysics%2F0412074%2Cphysics%2F0412159%2Cphysics%2F0412153%2Cphysics%2F0412108%2Cphysics%2F0412063%2Cphysics%2F0412016%2Cphysics%2F0412117%2Cphysics%2F0412112%2Cphysics%2F0412033%2Cphysics%2F0412146%2Cphysics%2F0412066%2Cphysics%2F0412028%2Cphysics%2F0412070%2Cphysics%2F0412056%2Cphysics%2F0412129%2Cphysics%2F0412111%2Cphysics%2F0412116%2Cphysics%2F0412124%2Cphysics%2F0412099%2Cphysics%2F0412178%2Cphysics%2F0412014%2Cphysics%2F0412060%2Cphysics%2F0412174%2Cphysics%2F0412052%2Cphysics%2F0412170%2Cphysics%2F0412107%2Cphysics%2F0412003%2Cphysics%2F0412130%2Cphysics%2F0412022%2Cphysics%2F0412110%2Cphysics%2F0412180%2Cphysics%2F0412069%2Cphysics%2F0412018%2Cphysics%2F0412026%2Cphysics%2F0412102%2Cphysics%2F0412042%2Cphysics%2F0412053%2Cphysics%2F0412067%2Cphysics%2F0412043%2Cphysics%2F0412154%2Cphysics%2F0412011%2Cphysics%2F0412031%2Cphysics%2F0412032%2Cphysics%2F0412137%2Cphysics%2F0412062%2Cphysics%2F0412132%2Cphysics%2F0412004%2Cphysics%2F0412143%2Cphysics%2F0412088%2Cphysics%2F0412118%2Cphysics%2F0412005%2Cphysics%2F0412165%2Cphysics%2F0412182%2Cphysics%2F0412098%2Cphysics%2F0412013%2Cphysics%2F0412019%2Cphysics%2F0412097%2Cphysics%2F0412121%2Cphysics%2F0412050%2Cphysics%2F0412115%2Cphysics%2F0412080%2Cphysics%2F0412065%2Cphysics%2F0412078%2Cphysics%2F0412142%2Cphysics%2F0412120%2Cphysics%2F0412009%2Cphysics%2F0412105%2Cphysics%2F0412095%2Cphysics%2F0412010%2Cphysics%2F0412017%2Cphysics%2F0412164%2Cphysics%2F0412006%2Cphysics%2F0412040%2Cphysics%2F0412064%2Cphysics%2F0412155%2Cphysics%2F0412161%2Cphysics%2F0412002%2Cphysics%2F0412147%2Cphysics%2F0412021%2Cphysics%2F0412073%2Cphysics%2F0412083%2Cphysics%2F0412030%2Cphysics%2F0412091%2Cphysics%2F0412054%2Cphysics%2F0412086%2Cphysics%2F0412076%2Cphysics%2F0412020%2Cphysics%2F0412148%2Cphysics%2F0412039%2Cphysics%2F0412176%2Cphysics%2F0412127%2Cphysics%2F0412145%2Cphysics%2F0412081%2Cphysics%2F0412183%2Cphysics%2F0412057%2Cphysics%2F0412169%2Cphysics%2F0412072&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We report an empirical study of Tehran Price Index (TEPIX). To analyze our\ndata we use various methods like as, rescaled range analysis ($R/S$), modified\nrescaled range analysis (Lo's method), Detrended Fluctuation Analysis (DFA) and\ngeneralized Hurst exponents analysis. Based on numerical results, the scaling\nrange of TEPIX returns is specified, long memory effect or long range\ncorrelation property in this market is investigated, characteristic exponent\nfor probability distribution function of TEPIX returns is derived and finally\nthe stage of development in Tehran Stock Exchange is determined."}, "authors": ["P. Norouzzadeh", "G. R. Jafari"], "author_detail": {"name": "G. R. Jafari"}, "author": "G. R. Jafari", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/j.physa.2005.02.046", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/physics/0412067v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/physics/0412067v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "19 pages, 6 figures", "arxiv_primary_category": {"term": "physics.data-an", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.data-an", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "q-fin.ST", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/physics/0412067v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/physics/0412067v1", "journal_reference": null, "doi": "10.1016/j.physa.2005.02.046", "fulltext": "arXiv:physics/0412067v1 [physics.data-an] 11 Dec 2004\n\nApplication of Multifractal Measures to Tehran\nPrice Index\n\nb\n\nP. Norouzzadeh a ∗and G.R. Jafari b †\na\nQuantitative Analysis Research Group,\nFarda Development Organization, Tehran, Iran\nDepartment of Physics, Sharif University of Technology,\nP.O. Box 11365-9161, Tehran, Iran\n22nd October 2018\n\nAbstract\nWe report an empirical study of Tehran Price Index (TEPIX). To\nanalyze our data we use various methods like as, rescaled range analysis (R/S), modified rescaled range analysis (Lo's method), Detrended\nFluctuation Analysis (DFA) and generalized Hurst exponents analysis. Based on numerical results, the scaling range of TEPIX returns\nis specified, long memory effect or long range correlation property in\nthis market is investigated, characteristic exponent for probability distribution function of TEPIX returns is derived and finally the stage of\ndevelopment in Tehran Stock Exchange is determined.\n\nKeywords: R/S analysis, Hurst exponent, Long memory, Detrended\nFluctuation Analysis, Multifractals, Lévy Distributions.\n\n1\n\nIntroduction\n\nFinancial markets have in recent years been at the focus of physicists's attempts to apply existing knowledge from statistical mechanics to economic\nproblems . These markets, though largely varying in details of trading rules\nand traded goods, are characterized by some generic features of their financial time series, called stylized facts. Multifractal processes and the deeply\nconnected mathematics of large deviations and multiplicative cascades have\nbeen used in many contexts to account for the time scale dependence of the\nstatistical properties. For example, recent empirical findings [1, 2, 3] suggest\nthat in rough surfaces, this framework is likely to be pertinent. The aim is\n∗\n†\n\ne-mail: noruzzadeh@farda.ir\ne-mail: r.jafari@mehr.sharif.edu\n\n1\n\n\fto characterize the statistical properties of the series with the hope that a\nbetter understanding of the underlying stochastic dynamics could provide\nuseful information to create new models able to reproduce experimental\nfacts. An important aspect concerns concepts as scaling and the scale invariance of height surface [3, 4]. There is an important volume of data and\nstudies showing self-similarity at short space scales and an apparent breakdown for longer spaces modeled in terms of distributions with truncated\ntails. Recent studies have shown that the traditional approach based on a\nBrownian motion picture [5, 6] or other more elaborated descriptions such\nas Lévy and truncated Lévy distributions [2], all of them relying on the idea\nof additive process, are not suitable to properly describe the statistical features of these fluctuations. In this sense, there are more and more evidences\nthat a multiplicative process approach is the correct way to proceed, and\nthis line of thought leads in a natural way to multifractality. In fact, this\nidea was already suggested some years ago when intermittency phenomena\nin return fluctuations was observed at different length scales which gave\nrise to some efforts to establish a link with other areas of physics such as\nturbulence [7, 8]. Nowadays, we know that there are important differences\nbetween both systems, as for instance the spectrum of frequencies, but the\ncomparison triggered an intense analysis of the existing data. Multifractal\nanalysis of a set of data can be performed in two different ways, analyzing\neither the statistics or the geometry. A statistical approach consists of denying an appropriate intensive variable depending on a resolution parameter,\nthen its statistical moments are calculated by averaging over an ensemble of\nrealizations and at random base points. It is said that the variable is multifractal if those moments exhibit a power-law dependence in the resolution\nparameter [9, 10]. On the other hand, geometrical approaches try to assess\na local power-law dependency on the resolution parameter for the same intensive variables at every particular point (which is a stronger statement\nthat just requiring some averagesthe momentsto follow a power law). While\nthe geometrical approach is informative about the spatial localization of selfsimilar (fractal) structures, it has been much less used because of the greater\ntechnical difficulty to retrieve the correct scaling exponents. However, in the\nlatest years an important effort to improve geometrical techniques has been\ncarried out, giving sensible improvement and good performance [11, 12]. We\nwill apply the geometrical approach in this paper as a valuable tool for the\nunderstanding of the price return fluctuations.\nThe main objective of this article is to investigate the characteristics of\nTehran Stock Exchange using some multifractal measures. Our purpose is\nto show how some relatively simple statistics gives us indications on the market situation. The paper is organized as follows. In Section 2 we describe\nour data. In Section 3, we review the rescaled range (R/S) analysis and it's\nmodified version, Lo's R/S analysis. The way of interpretation and empirical results for classical R/S analysis and Lo's R/S analysis are presented.\n2\n\n\fIn Section 4 a brief description of the Detrended Fluctuation Analysis is\ngiven. The results of this analysis for the TEPIX time series are shown in\nthis Section too. In Section 5 we explain the generalized Hurst exponents\nanalysis. Also its results is presented. In Section 6 the concept of characteristic exponent for a probability distribution and its relation to Hurst\nexponent is reviewed. Moreover, characteristic exponent of TEPIX returns\ndistribution is computed. Then, in Section 7, a simple explanation of long\nmemory process is mentioned and shown how we can use Lo's R/S analysis\nto find out presence of such process. The market stage of development and\nits relation to generalized Hurst exponent is studied in Section 8. Finally,\nconclusions are given in Section 9.\n\n2\n\nData Description\n\nWe analyze the values of the TEPIX for the period of almost 9 years: from\n20th may 1995 to 18th march 2004. Before 1995 the Tehran Price Index was\nrather fixed because of government controls. The data have been recorded at\neach trading day. So that our database consists of 2342 values and 2341 daily\nreturns. The sources of this data is the center of research and development\nof Iran capital market and the paper utilizes only the closing prices. In Fig.1\nwe present a time series corresponding to daily values of the TEPIX index.\nIt must be mentioned that TEPIX tracks the performance of more than 350\nlisted local firms.\n12000\n\n10000\n\nTehran Price Index\n\n8000\n\n6000\n\n4000\n\n2000\n\n0\n\n0\n\n500\n\n1000\n\n1500\n\n2000\n\n2500\n\nt ( in days)\n\nFigure 1: Daily closure TEPIX index history (1995-2004).\n\n3\n\n\fAlso, Table 1 provides summary statistics of logarithmic returns. According\nTable 1: Mean, standard deviation, skewness, and kurtosis of TEPIX returns.\nM ean\n0.0011\n\nStd.Dev.\n0.0046\n\nSkewness\n1.0619\n\nKurtosis\n20.827\n\nto data in Table 1, it is seen that, the probability distribution of TEPIX returns does not look like a Gaussian distribution and belongs to stable Lévy\ndistributions.\n\n3\n3.1\n\nRescaled Range (R/S) analysis\nClassical R/S Analysis\n\nThe Hurst rescaled range (R/S) analysis is a technique proposed by Henry\nHurst in 1951 [13] to test presence of correlations in empirical time series.\nThe main idea behind the R/S analysis is that one looks at the scaling\nbehavior of the rescaled cumulative deviations from the mean, or the distance the system travels as a function of time. This is compared to the\nnull-hypothesis of a random walk. For an independent system, the distance\ncovered increases, on average, by the square root of time. If the system\ncovers a larger distance than this, it cannot be independent by definition,\nand the changes must be influencing each other; they have to be correlated. Although there may be autoregressive process present that can cause\nshort-term correlations, we will see that when adjusting for such short-term\ncorrelations, there may be other forms of memory effects present which need\nto be examined.\nConsider a time series in prices of length P . This time series is then transformed into a time series of logarithmic returns of length N = P − 1 such\nthat\nPi+1\n),\ni = 1, 2, ..., P − 1.\n(1)\nNi = log(\nPi\nTime period is divided into m contiguous sub-periods of length n, such that\nm ∗ n = N . Each sub-period is labelled by Ia , with a = 1, 2, ...m. Then,\neach element in Ia is labelled by Nk , a such that k = 1, 2, ..., n. For each\nsub-period Ia of length n the average is calculated as\nτ\n\n1X\nNk, a\nMa =\nn\nk=1\n\n4\n\n(2)\n\n\fThus, Ma is the mean value of the Ni′ s contained in the sub-period Ia of\nlength n. Then, we calculate the time series of accumulated departures from\nthe mean (Xk, a ) for each sub-period Ia , defined as\nXk, a =\n\nk\nX\n(Ni, a − Ma ),\n\nk = 1, 2, ...n.\n\n(3)\n\ni=1\n\nAs can be seen from Eq. (3), the series of accumulated departures from the\nmean always will end up with zero. Now, the range that the time series\ncovers relative to the mean within each sub-period is defined as\nRIa = max(Xk, a ) − min(Xk, a ),\n\n1 < k < n.\n\n(4)\n\nThe next step is to calculate the standard deviation for each sub-period Ia ,\nv\nu n\nu1 X\n2\nSI a = t\n(Nk, a − Ma ).\n(5)\nn\nk=1\n\nThen, the range for each sub-period (RIa ) is rescaled by the corresponding\nstandard deviation (SIa ). Recall that we had m contiguous sub-periods of\nlength n. Thus, the average R/S value for length or box n is\nm\n\n(R/S)n =\n\n1 X RIa\n(\n).\nm\nSI a\n\n(6)\n\na=1\n\nNow, the calculations from Eqs. (1)-(6) must be repeated for different time\nhorizons. This is achieved by successively increasing n and repeating the\ncalculations until we have covered all integer ns. One can say that R/S\nanalysis is a special form of box-counting for time series. However, the\nmethod was developed long before the concepts of fractals. After having\ncalculated R/S values for a large range of different time horizons n, we plot\nlog(R/S)n against log(n). By performing a least-squares regression with\nlog(R/S)n as the dependent variable and log(n) as the independent one, we\nfind the slope of the regression which is the estimate of the Hurst exponent\nH. The Hurst exponent (H) and the fractal dimension Df are related as\n[14]\nDf = 2 − H.\n(7)\nIn theory, H = 0.5 means that the time series is independent, but as mentioned above the process need not be Gaussian. If H = 0.5, the process\nmay in fact be a non-Gaussian process as e.g. the Student-t or gama. If\nH ∈ (0.5, 1.0] it implies that the time series is persistent which is characterized by long memory effects on all time scales. For example, all daily\nprice changes are correlated with future daily price changes; all weekly price\n5\n\n\fchanges are correlated with all future weekly price changes and so on. This\nis one of the key characteristics of fractal time series. It is also a main\ncharacteristic of non-linear dynamical systems that there is a sensitivity to\ninitial conditions which implies that such a system in theory would have an\ninfinite memory. The persistence implies that if the series has been up or\ndown in the last period then the chances are that it will continue to be up\nor down, respectively, in the next period. This behavior is also independent\nof the time scale we are looking at. The strength of the trend-reinforcing\nbehavior, or persistence, increases as H approaches 1.0. This impact of the\npresent on the future can be expressed as a correlation function (C),\nC = 2(2H−1) − 1.\n\n(8)\n\nIn the case of H = 0.5 the correlation C equals zero, and the time series\nis uncorrelated. However, if H = 1.0 we see that C = 1, indicating perfect\npositive correlation. On the other hand, when H ∈ [0, 0.5) we have antipersistence. This means that whenever the time series have been up in the\nlast period, it is more likely that it will be down in the next period. Thus, an\nanti-persistent time series will be more choppier than a pure random walk\nwith H = 0.5. The R/S analysis can also uncover average non-periodic\ncycles in the system under study. If there is a long memory process at work,\nfor a natural system this memory is often finite, even though long memory processes theoretically are supposed to last forever, as was the case for\nmathematical fractals and the logistic map. When the long term memory is\nlost, or the memory of the initial conditions has vanished, the system begins\nto follow a random walk; this is also called the crossover point. Thus, a\ncrucial point in the estimation of the Hurst exponent is to use the proper\nrange for which there is non-normal scaling behavior. This is the range for\nwhich the scaling behavior is linear in the log(R/S)n versus log(n) plot.\nIf there is a crossover-point, this can be seen as a break in the plot where\nthe slope changes for a certain value, log(nmax ). If this is the case, it is an\nindication of a non-periodic cycle with average cycle length equal to nmax .\nA plot of the rescaled range R/S as a function of τ for the TEPIX\nreturns over the mentioned period is shown in the curve of Fig.2. The\ndata in this case show a scaling regime that goes from τ = 2 up to 7 (in\nlog scale) approximately. It is equal to 128 trading days or 180 days. A\nlinear regression in this region yields the value H = 0.79 ± 0.03. It must be\nmentioned that the Hurst method tends to overestimate the Hurst exponent\nfor time series of small sizes [15].\n\n3.2\n\nLo's Modified R/S Analysis\n\nThe classical R/S test has been proven to be too weak to indicate a true long\nmemory process, in fact it tends to indicate a time series has long memory\n6\n\n\f9\n\n8\n\n7\n\nLog(R/S)\n\n6\n\n5\n\n4\n\n3\n\n2\n\n1\n\n0\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\nLog(n)\n\n8\n\n9\n\n10\n\n11\n\n12\n\nFigure 2: Rescaled range R/S versus the time lag τ for the returns of the\nTEPIX in the period of 1995-2004.\nwhen it does not. In 1991 Lo [16] introduced a stronger test based on a\nmodified R/S statistics, which is known to be too strong to indicate a true\nlong memory process. Lo's modified R/S test is described in brief below.\nFor a given series Ni , i = 1, 2, ...n, Lo defines the modified R/S statistic\nas,\nQn =\n\n[max\n\nPk\n\nj=1 (Nj\n\n− N ̄n ) − min\nσn (q)\n\nPk\n\nj=1 (Nj\n\n− N ̄n )]\n\n,\n\nk = 1, n\n\n(9)\n\nwhere the denominator is expressed as,\nσn2 (q)\n\nq\nn\nk\nX\n1X\n2X\n2\n ̄\n=\n(Ni − N ̄n )(Ni−j − N ̄n )] (10)\n(Nj − Nn ) +\nwj (q)[\nn\nn\nj=1\n\ni=j+1\n\nj=1\n\n, in which\nwj (q) = 1 −\n\nj\n,\nq+1\n\nq<n\n\n(11)\n\n√\nLo finally standardizes the statistic Qn by dividing by n and is denoted as\nVn (q). The numerator of Vn (q) is the range of deviation from the approximate linear trend line in a given interval and the denominator is the sample\nvariance augmented with weighted autocovariances up to a lag determined\nq. For q = 0, this is same as the classical R/S statistic. This autocovariance\npart of the denominator is non zero for series exhibiting short term memory\n7\n\n\fand this makes the statistic robust to heteroscedasticity.\nTable 2 gives the results from the modified R/S statistic. R/S analysis\nis extremely sensitive to the order of truncation q and there is no statistical\ncriteria for choosing q in the framework of this statistic. Since there is no\ndata driven guidance for the choice of this parameter, we consider different\nvalues for q = 0, 2, 4, 6, 8, 10 and 15. More explanations related to long\nmemory effect and interpretation of data in Table 2 will be mentioned in\nSection 7. In brief, the starred values in Table 2 reject null hypothesis of\nshort memory.\nTable 2: Modified rescaled range (R/S) statistic for the returns, absolute\nand squared returns.\nLag order\nq\n0\n2\n4\n6\n8\n10\n15\n\n4\n\nR/S statistic\nreturns\n1.0513\n0.8219\n0.7475∗\n0.7156∗\n0.6964∗\n0.6807∗\n0.6724∗\n\nabsolute returns\n0.7857∗\n0.5393∗\n0.4475∗\n0.3952∗\n0.3608∗\n0.3362∗\n0.2972∗\n\nsquared returns\n0.9573\n0.7528∗\n0.6654∗\n0.6111∗\n0.5734∗\n0.5451∗\n0.4980∗\n\nDetrended Fluctuation Analysis\n\nDetrended fluctuation analysis (DFA) is a scaling analysis technique providing a simple quantitative parameter-the scaling exponent α-to represent\nthe correlation properties of a time series [17]. The advantage of DFA over\nmany techniques are that it permits the detection of long-range correlations\nembedded in seemingly non-stationary time series, and also avoids the spurious detection of apparent long-range correlations that are an artifact of\nnon-stationarity. Additionally, the advantages of DFA in computation of H\nover other techniques (for example, the Fourier transform) are:\n• inherent trends are avoided at all time scales;\n• local correlations can be easily probed.\n\n8\n\n\fTo implement the DFA, let us suppose we have a time series, N (i)(i =\n1, ..., Nmax ). We integrate the time series N (i):\ny(j) =\n\nj\nX\n[N (i) − hN i]\n\n(12)\n\nNX\nmax\n\n(13)\n\ni=1\n\nwhere:\nhN i =\n\n1\nNmax\n\nN (i).\n\nj=1\n\nNext we break up N (i) into K non-overlapping time intervals, In , of equal\nsize τ where n = 0, 1, ...K − 1 and K corresponds to the integer part of\nNmax /τ . In each box, we fit the integrated time series by using a polynomial\nfunction, ypol (i), which is called the local trend. For order-l DFA (DFA-1 if\nl=1, DFA-2 if l=2, etc.), the l-order polynomial function should be applied\nfor the fitting. We detrend the integrated time series y(i) in each box, and\ncalculate the detrended fluctuation function:\nY (i) = y(i) − ypol (i).\n\n(14)\n\nFor a given box size s, we calculate the root mean square fluctuation:\nv\nu\nmax\nu 1 NX\n[Y (i)]2\n(15)\nF (s) = t\nNmax\ni=1\n\nThe above computation is repeated for box sizes s (different scales) to provide a relationship between F (s) and s. A power law relation between F (s)\nand s indicates the presence of scaling: F (s) ∼ sα . The parameter α,\ncalled the scaling exponent or correlation exponent, represents the correlation properties of the signal: if α = 0.5, there is no correlation and the\nsignal is an uncorrelated signal [17]; if α < 0.5, the signal is anticorrelated; if\nα > 0.5, there are positive correlations in the signal. In the two latest cases,\nthe signal can be well approximated by the fractional Brownian motion law\n[15].\nIn Fig.3 we plot in double-logarithmic scale the corresponding fluctuation\nfunction F (s) against the box size s. Using the above procedure, we obtain\nthe following estimate for the Hurst exponent: H = 0.72 ± 0.01. Since\nH > 0.5 it is concluded that the TEPIX returns show persistence; i.e, strong\ncorrelations between consecutive increments. It is seen that for s ∼ 115 the\nempirical data deviate from the initial scaling behavior. This indicates that\nthe TEPIX tends to loose its memory after a period of about 162 days.\nBased on overestimating the Hurst exponent in the R/S analysis it may be\nexplained why the exponent H obtained via the Hurst method is usually\nlarger than that of the DFA method [18].\n9\n\n\f6\n\n10\n\n5\n\n10\n\n4\n\nF(s)\n\n10\n\n3\n\n10\n\n2\n\n10\n\n1\n\n10\n\n0\n\n10\n0\n10\n\n1\n\n10\n\n2\n\n3\n\n10\ns\n\n10\n\n4\n\n10\n\nFigure 3: Fluctuation Function F (s) as a function of box size for the returns\nof the TEPIX index in the period of 1994-2004.\n\n5\n\nGeneralized Hurst Exponents Approach\n\nA generalization of the approach proposed by Hurst should be associated\nwith the scaling behavior of statistically significant variables constructed\nfrom the time series [19]. Therefore we analyze the q-order moments of\nthe distribution of the increments which is a good characterization of the\nstatistical evolution of a stochastic variable P (t). The generalized Hurst\nexponents, Hq ≡ H(q), for a time series P (t)(t = 1, 2, ...) are defined by the\nscaling properties of its structure functions Sq (τ )\n1\n\nSq (τ ) = h|P (t + τ ) − P (t)|q iTq ∼ τ H(q)\n\n(16)\n\nwhere q > 0, τ is the time lag and averaging is over the time box (window)\nT ≫ τ , usually the largest time scale of the system. The function H(q)\ncontains information about averaged generalized volatilities at scale τ (only\nq = 1, 2 are used to define the volatility). In particular, the H(1) exponent\nindicates persistent (H(1) > 0.5) or anti-persistent (H(1) < 0.5) behavior\nof the trend. For the Brownian random walk one gets H(1) = 0.5. For the\npopular Lévy stable and truncated Lévy processes with parameter α, it has\nbeen found that H(q) = q/α for q < α and H(q) = 1 for q ≥ α. In this\nframework, we can distinguish between two kinds of processes:\n• a process where H(q) = H, constant independent of q;\n• a process with H(q) not constant.\n10\n\n\fThe first case is characteristic of unifractal processes where qH(q) is linear\nand completely determined by its index H. In the second case, when H(q)\ndepends on q, the process is commonly called multi-fractal and different exponents characterize the scaling of different q-moments of the distribution.\nEq. (13) is studied numerically in order to analyze the generalized qthorder Hurst exponents in the structure function Sq (τ ). Table 3 includes the\nvalues of the generalized Hurst exponents H(q) in the structure function for\nthe TEPIX. The values H(q) versus q for q = 1, ..., 10 are plotted in Fig. 3\nfor the TEPIX.\n0.95\n\n0.9\n\nGeneralized Hurst Exponents H(q)\n\n0.85\n\n0.8\n\n0.75\n\n0.7\n\n0.65\n\n0.6\n\n0.55\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\n9\n\n10\n\nq\n\nFigure 4: Generalized Hurst exponents versus the q for the returns of the\nTEPIX in the period of 1995-2004.\n\nTable 3: Values of the generalized qth-order Hurst exponents H(q) for the\nTEPIX.\nH(1)\n0.8622\nH(6)\n0.6340\n\nH(2)\n0.7935\nH(7)\n0.6149\n\nH(3)\n0.7373\nH(8)\n0.6001\n\nH(4)\n0.6929\nH(9)\n0.5885\n\nH(5)\n0.6592\nH(10)\n0.5792\n\nIt should be noted that the methods listed above, that is, R/S analysis,\nLo's R/S analysis and DFA can only extract a single scaling exponent from\na time series. However, it is possible that the given time series may be\ngoverned by more than one scaling exponents, in which case a single scaling\n11\n\n\fexponent would be unable to capture the complex dynamics inherent in the\ndata. Analysis using generalized Hurst exponents method, elucidates the\ndependence of H(q) on q, which is a hall mark of multifractal processes.\nSuch processes are far more than one exponent to characterize their scaling\nproperties [20].\n\n6\n\nCharacteristic Exponent\n\nPaul Lévy, the French mathematician, proposed a general approach with the\nGaussian as only a special case, to identify probability distributions which\ntheir sum has the same probability distribution. A stable Lévy distribution\nis represented by [21]\nZ\n1 ∞\nLα (N, △t) ≡\nexp(−γ△tq α ) cos(qN )dq\n(17)\nπ 0\nwhere α is the characteristic exponent 0 < α ≤ 2, N the return, γ the scale\nfactor, and △t the time interval.\nThis distribution obeys below scaling relations:\nN△t = Ns (△t)1/α\n\n(18)\n\nLα (Ns , △t) ≡ Lα (Ns , 1)(△t)−1/α .\n\n(19)\n\nand\nIf α = 2 the distribution is Gaussian, and there is a finite second moment.\nIf α = 1 we have the Cauchy distribution with both infinite first and second\nmoments. In the region for which 1 < α < 2, the second moment becomes\ninfinite, but with a stable mean. Lévy stable distributions are self-similar\nand this means that the probabilities of return are the same for all time\nintervals once we adjust for the time scale. Roughly speaking, an agent\nwith 1 min time interval faces the same risk as a 100 min agent in his\ntime interval when adjusted for scale. The α exponent takes this scaling\nrelationship into account.\nThe fractal dimension of the probability space, α, used in above Equations\nis related to the Hurst exponent of the time series as:\nα=\n\n1\n.\nH\n\n(20)\n\nIn this way, characteristic exponent for return distribution of TEPIX\ncan be calculated. α exponents derived by using all of above methods has\nbeen shown in Table 4.\nThese estimates of α are relatively close to each other. Based on α values, we observe a non-normal scaling behavior and all estimates indicate\nthat the process is different from a pure random walk. In fact, these results\n12\n\n\fTable 4: Values of the α exponents resulted from Hurst exponents.\nαR/S\n1.266\n\nαLo\n1.389\n\nαDF A\n1.163\n\nαGHE\n1.160\n\nare evidence of a non-linear chaotic system.\nThe distribution of TEPIX returns can be fitted by a stable Lévy distribution. For a better comparison of the return distribution with a Gaussian\nPDF and evaluating derived Hurst exponents, we have performed a maximum likelihood estimation of stable parameters. The parameters of this\nfitted Lévy distribution is presented in Table 5.\nAlpha is the same characteristic exponent. Beta is the skewness in the\nrange [-1,1] and gamma and delta are straightforward scale and shift parameters respectively. A probability distribution function of returns against\nGaussian distribution with the mean and standard deviation of fitted Lévy\ndistribution is depicted in Fig.5. Fitted Lévy distribution iself, is plotted in\nthe Fig.6. It can be seen from this figures that the the real distribution (or\nthe Lévy fitted ones) of returns is different from a Gaussian PDF (random\nwalk).\n\n0.999\n0.997\n0.99\n0.98\n0.95\n0.90\n\nProbability\n\n0.75\n0.50\n0.25\n0.10\n0.05\n0.02\n0.01\n0.003\n0.001\n\n−0.04\n\n−0.03\n\n−0.02\n\n−0.01\n\n0\n\n0.01\n\n0.02\n\n0.03\n\n0.04\n\n0.05\n\nReturn\n\nFigure 5: Probability distribution function of returns against a Gaussian\ndistribution .\nBased on maximum likelihood parameter estimation of Lévy distribution\n13\n\n\f0.5\n\n0\n\nLog of Probability Distribution Function\n\n−0.5\n\n−1\n\n−1.5\n\n−2\n\n−2.5\n\n−3\n\n−3.5\n\n−4\n\n−4.5\n−15\n\n−10\n\n−5\n\n0\nReturn\n\n5\n\n10\n\n15\n\nFigure 6: Probability Distribution Function(PDF) for daily returns of\nTEPIX (vertical axis is in log scale).\nTable 5: The parameters of the fitted Lévy distribution.\nα\nβ\nγ\nδ\n1.316 0.2049 0.0018 0.00076\n\n(direct estimation), the best characteristic exponent has been resulted by\nclassical R/S analysis and Lo's R/S analysis respectively.\n\n7\n\nLong Memory Process\n\nA random process is called a long memory process if it has an autocorrelation function that is not integrable. This happens, for example, when the\nautocorrelation function decays asymptotically as a power law of the form\nτ −α with α < 1. This is important because it implies that values from the\ndistant past can have a significant effect on the present, and implies anomalous diffusion. A process is defined as long memory if in the limit k → ∞\nγ(k) =∼ k−α L(k)\n\n(21)\n\nwhere 0 < α < 1 and L(x) is a slowly varying function at infinity. The\ndegree of long memory dependence is given by the exponent α; the smaller\nα, the longer the memory.\nThe Hurst exponent simply is related to α. For a long memory process\n\n14\n\n\fH = 1 − α2 or α = 2 − 2H. Short memory processes have H = 12 , and\nthe autocorrelation function decays faster than k−1 . A positively correlated\nlong memory process is characterized by a Hurst exponent in the interval\n(0.5, 1).\nAs an application of results provided by Lo's modified R/S statistic, it can\nbe said [22], at the 5% significance level, the null hypothesis of a short\nmemory process is rejected if the modified R/S statistic does not fall within\nthe confidence interval [0.809, 1.862]. For returns, the null hypothesis of\nshort memory is rejected at any lags, except for 0 and 2. For absolute and\nsquared returns, the null hypothesis of short memory is rejected for all lag\norders.\nBesides, the Hurst exponent is linked to the modified R/S statistic by\nlim E[RT /ST (q)]/(aT H ) = 1\n\nT →+∞\n\n(22)\n\nwith a > 0. With this link it is possible to obtain the following approximate\nrelationship:\nlog E[RT /ST (q)] ∼\n(23)\n= log(a) + H log(t)\nIn order to estimate the value of the Hurst exponent, H, we first determine a\nseries of estimates of the Hurst exponent by fitting an ordinary least squares\nregression between log[RT,l /ST,l (q)], l = 1, ..., j and log(l), l = 1, ..., j for every j = 2, ..., T ∗ , where RT,l and ST,l (q) are quantities related to RT and\nST (q), respectively. Then we choose the optimal estimate in this series. As a\nresult of such procedure, Hurst exponent has obtained equal to 0.721±0.001.\nTherefore, the Lo's method verifies long memory process in returns of the\nTEPIX, based on above discussions.\n\n8\n\nMarket Stage of Development\n\nBased on recent research for characterizing the stage of development of markets [23] it is shown that the exponent H(2) has sensitivity to the degree\nof development of the market. As far as Stock markets are concerned, the\ngeneralized Hurst exponents H(1), H(2) show remarkable differences between developed and emerging markets. At one end of the spectrum there\nare stocks like as the Nasdaq 100 (US), the S&P 500 (US), the Nikkei 225\n(Japan) and so on. Whereas , at the other end, there are Russian AK&M,\nthe Indonesian JSXC, the Peruvian LSEG, etc. This sensitivity of the scaling exponents to the market conditions provides a new and simple way of\nempirically characterizing the development of financial markets.\nRoughly speaking, emerging markets are associated with high value of H(1)\nand developed markets are associated with low values of H(1). Besides, it\nis found that all the emerging markets have H(2) ≥ 0.5 whereas all the\ndeveloped have H(2) ≤ 0.5.\n15\n\n\fConsidering all of above discussions and results, we notice that Tehran Stock\nExchange belongs to emerging markets category and it is far from an efficient and developed market. Hurst exponent calculated by R/S and DFA\nmethods in one hand and generalized Hurst exponents (H(1) and H(2)) in\nthe other hand, both present this fact.\nFor the sake of comparison between various stock markets, the two first generalized Hurst exponents are shown in Table 5. It must be noticed that all of\ndata in Table 6, except those corresponds to TEPIX, have been calculated\nduring 1997 to 2001 period [23], while those corresponds to TEPIX have\nbeen calculated in the time period from 1995 to 2004.\nTable 6: Hurst exponents H(1) and H(2) for stock market indices.\nStock Market indices\nNasdaq 100\nS&P 500\nNikkei 225\nAK&M\nJSXC\nLSEG\nTEPIX\n\nH(1)\n0.47\n0.47\n0.46\n0.65\n0.57\n0.61\n0.86\n\nH(2)\n0.45\n0.44\n0.43\n0.51\n0.53\n0.58\n0.79\n\nThese results indicate that, financial market characteristics in Iran do\nnot show developed situations. In fact, Tehran Stock Exchange belongs to\nthe category of emerging financial markets.\n\n9\n\nConclusions\n\nIn this paper the concept of multifractality has been applied to Tehran Stock\nExchange data. This market show a fractal scaling behavior significantly\ndifferent from what a random walk would produce. For TEPIX time series\nwe have obtained a Hurst exponent greater than 0.5, indicating that the\nTEPIX has long term dependence (persistence). This memory effect seems\nto last for up to about 6 months (115-128 trading days). Analysis using\ngeneralized Hurst exponents method, indicates the dependence of H(q) on\nq, which is an evidence of multifractal processes. Also, we show that based\non generalized Hurst exponents, financial market characteristics in Iran do\nnot indicate a developed market. In other words, we are dealing with an\nemerging capital market. These findings imply that there are patterns, or\ntrends in returns that persist over time. This provides a theoretical platform\nsupporting the use of technical analysis to produce above average returns.\nThe findings may be used to improve the current models or to make new\n16\n\n\fones which use the concept of fractal scaling.\n\n10\n\nAcknowledgment\n\nWe thank A.T. Rezakhani for reading manuscript and giving helpful comments.\n\n17\n\n\fReferences\n[1] R. Mantegna, H.E. Stanley, An Introduction to Econophysics, Cambridge University Press, Cambridge, 2000.\n[2] J.-P. Bouchaud, M. Potters, Theory of Financial Risks, Cambridge University Press, Cambridge, 2000.\n[3] J.D. Farmer, Computing in Science and Engineering, NovemberDecember, pp. 26-39 (1999).\n[4] M.M. Dacorogna, R. Gençay, U. Müller, R.B. Olsen, O.V. Pictet, An Introduction to High-Frequency Finance, Academic Press, London, 2001.\n[5] R. Cont, J.-P. Bouchaud, Macroecon. Dyn. 4 (2000), 170.\n[6] T. Lux, M. Marchesi, Nature 397 (1999), 498.\n[7] P. Jefferies, M.L. Hart,\ncond-mat/9910072.\n\nP.M. Hui,\n\nN.F. Johnson,\n\npreprint,\n\n[8] D. Challet et al., Quant. Fin. 1 (2001), 168. CMZ01.\n[9] D. Challet, M. Marsili, Y.-C. Zhang, Physica A 294 (2001), 514.\n[10] I. Giardina, J.-P. Bouchaud, M. Mzard, Physica A 299 (2001), 28.\n[11] J.D. Farmer, Santa Fe Institute working paper 98-12-117.\n[12] P. Jefferies, M.L. Hart, P.M. Hui, N.F. Johnson, Eur. Phys. J. B 20\n(2001), 493.\n[13] H.E. Hurst, Trans. Am. Soc. Civ. Eng. 116 (1951) 770; H.E. Hurst,\nR.P. Black, and Y.M. Simaika, Long-Term Storage: An Experimental\nStudy, Constable, London, 1965.\n[14] E.E. Peters, Fractal Market Analysis, Wiley, New York, 1991.\n[15] J. Feder , Fractals, Plenum, New-York, 1988, p.170\n[16] A.W. Lo, Econometrica, 59(5), (1991) 1279.\n[17] C.K. Peng, S.V. Buldyrev, S. Havlin, M. Simmons, H.E. Stanley and\nA.L. Goldberger, Phys. Rev. E 49, 1685 (1994).\n[18] P. Grau-Carles, Physica A 287 (2000) 396.\n[19] A-L. Barabasi, T. Vicsek, Phys. Rev. A44, 2730 (1991).\n[20] P.Ch. Ivanov, L. Amaral, A. Goldberger, S. Havlin, M.G. Rosenblum,\nZ.R. Struzik and H.E. Stanley, Nature 399 (1999) 461-465.\n18\n\n\f[21] R.N. Mantegna, H.E. Stanley, Nature 376 (1995) 46-49.\n[22] A.W. Lo, Working Paper, No.2984, National Bureau of Economic Research.\n[23] T.Di Matteo, T. Aste, M.M. Dacorogna, cond-mat/0403681.\n\n19\n\n\f"}