{"id": "http://arxiv.org/abs/physics/0401165v1", "guidislink": true, "updated": "2004-01-30T07:03:52Z", "updated_parsed": [2004, 1, 30, 7, 3, 52, 4, 30, 0], "published": "2004-01-30T07:03:52Z", "published_parsed": [2004, 1, 30, 7, 3, 52, 4, 30, 0], "title": "Absolute frequency measurements of the $D_2$ line and fine-structure\n  interval in $^{39}$K", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=physics%2F0401025%2Cphysics%2F0401143%2Cphysics%2F0401061%2Cphysics%2F0401124%2Cphysics%2F0401068%2Cphysics%2F0401037%2Cphysics%2F0401166%2Cphysics%2F0401094%2Cphysics%2F0401045%2Cphysics%2F0401048%2Cphysics%2F0401133%2Cphysics%2F0401081%2Cphysics%2F0401027%2Cphysics%2F0401131%2Cphysics%2F0401042%2Cphysics%2F0401043%2Cphysics%2F0401078%2Cphysics%2F0401158%2Cphysics%2F0401057%2Cphysics%2F0401108%2Cphysics%2F0401156%2Cphysics%2F0401137%2Cphysics%2F0401020%2Cphysics%2F0401109%2Cphysics%2F0401129%2Cphysics%2F0401059%2Cphysics%2F0401089%2Cphysics%2F0401070%2Cphysics%2F0401116%2Cphysics%2F0401102%2Cphysics%2F0401033%2Cphysics%2F0401072%2Cphysics%2F0401049%2Cphysics%2F0401032%2Cphysics%2F0401041%2Cphysics%2F0401071%2Cphysics%2F0401123%2Cphysics%2F0401155%2Cphysics%2F0401039%2Cphysics%2F0401062%2Cphysics%2F0401099%2Cphysics%2F0401007%2Cphysics%2F0401015%2Cphysics%2F0401145%2Cphysics%2F0401087%2Cphysics%2F0401140%2Cphysics%2F0401040%2Cphysics%2F0401130%2Cphysics%2F0401008%2Cphysics%2F0401064%2Cphysics%2F0401127%2Cphysics%2F0401044%2Cphysics%2F0401076%2Cphysics%2F0401066%2Cphysics%2F0401112%2Cphysics%2F0401005%2Cphysics%2F0401001%2Cphysics%2F0401105%2Cphysics%2F0401149%2Cphysics%2F0401154%2Cphysics%2F0401034%2Cphysics%2F0401144%2Cphysics%2F0401164%2Cphysics%2F0401014%2Cphysics%2F0401159%2Cphysics%2F0401157%2Cphysics%2F0401125%2Cphysics%2F0401118%2Cphysics%2F0401138%2Cphysics%2F0401010%2Cphysics%2F0401095%2Cphysics%2F0401002%2Cphysics%2F0401162%2Cphysics%2F0401024%2Cphysics%2F0401088%2Cphysics%2F0401073%2Cphysics%2F0401046%2Cphysics%2F0401084%2Cphysics%2F0401097%2Cphysics%2F0401141%2Cphysics%2F0401142%2Cphysics%2F0401011%2Cphysics%2F0401160%2Cphysics%2F0401115%2Cphysics%2F0401106%2Cphysics%2F0401080%2Cphysics%2F0401147%2Cphysics%2F0401019%2Cphysics%2F0401017%2Cphysics%2F0401013%2Cphysics%2F0401134%2Cphysics%2F0401051%2Cphysics%2F0401111%2Cphysics%2F0401114%2Cphysics%2F0401063%2Cphysics%2F0401031%2Cphysics%2F0401050%2Cphysics%2F0401052%2Cphysics%2F0401135%2Cphysics%2F0401165%2Cphysics%2F0401016&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Absolute frequency measurements of the $D_2$ line and fine-structure\n  interval in $^{39}$K"}, "summary": "We report a value for the $D_2$-line frequency of $^{39}$K with 0.25 ppb\nuncertainty. The frequency is measured using an evacuated ring-cavity resonator\nwhose length is calibrated against a reference laser. The $D_2$ line presents a\nproblem in identifying the line center because the closely-spaced energy levels\nof the excited state are not resolved. We use computer modelling of the\nmeasured spectrum to extract the line center and obtain a value of 391 015\n578.040(75) MHz. In conjunction with our previous measurement of the $D_1$\nline, we determine the fine-structure interval in the $4P$ state to be 1 729\n997.132(90) MHz. The results represent significant improvement over previous\nvalues.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=physics%2F0401025%2Cphysics%2F0401143%2Cphysics%2F0401061%2Cphysics%2F0401124%2Cphysics%2F0401068%2Cphysics%2F0401037%2Cphysics%2F0401166%2Cphysics%2F0401094%2Cphysics%2F0401045%2Cphysics%2F0401048%2Cphysics%2F0401133%2Cphysics%2F0401081%2Cphysics%2F0401027%2Cphysics%2F0401131%2Cphysics%2F0401042%2Cphysics%2F0401043%2Cphysics%2F0401078%2Cphysics%2F0401158%2Cphysics%2F0401057%2Cphysics%2F0401108%2Cphysics%2F0401156%2Cphysics%2F0401137%2Cphysics%2F0401020%2Cphysics%2F0401109%2Cphysics%2F0401129%2Cphysics%2F0401059%2Cphysics%2F0401089%2Cphysics%2F0401070%2Cphysics%2F0401116%2Cphysics%2F0401102%2Cphysics%2F0401033%2Cphysics%2F0401072%2Cphysics%2F0401049%2Cphysics%2F0401032%2Cphysics%2F0401041%2Cphysics%2F0401071%2Cphysics%2F0401123%2Cphysics%2F0401155%2Cphysics%2F0401039%2Cphysics%2F0401062%2Cphysics%2F0401099%2Cphysics%2F0401007%2Cphysics%2F0401015%2Cphysics%2F0401145%2Cphysics%2F0401087%2Cphysics%2F0401140%2Cphysics%2F0401040%2Cphysics%2F0401130%2Cphysics%2F0401008%2Cphysics%2F0401064%2Cphysics%2F0401127%2Cphysics%2F0401044%2Cphysics%2F0401076%2Cphysics%2F0401066%2Cphysics%2F0401112%2Cphysics%2F0401005%2Cphysics%2F0401001%2Cphysics%2F0401105%2Cphysics%2F0401149%2Cphysics%2F0401154%2Cphysics%2F0401034%2Cphysics%2F0401144%2Cphysics%2F0401164%2Cphysics%2F0401014%2Cphysics%2F0401159%2Cphysics%2F0401157%2Cphysics%2F0401125%2Cphysics%2F0401118%2Cphysics%2F0401138%2Cphysics%2F0401010%2Cphysics%2F0401095%2Cphysics%2F0401002%2Cphysics%2F0401162%2Cphysics%2F0401024%2Cphysics%2F0401088%2Cphysics%2F0401073%2Cphysics%2F0401046%2Cphysics%2F0401084%2Cphysics%2F0401097%2Cphysics%2F0401141%2Cphysics%2F0401142%2Cphysics%2F0401011%2Cphysics%2F0401160%2Cphysics%2F0401115%2Cphysics%2F0401106%2Cphysics%2F0401080%2Cphysics%2F0401147%2Cphysics%2F0401019%2Cphysics%2F0401017%2Cphysics%2F0401013%2Cphysics%2F0401134%2Cphysics%2F0401051%2Cphysics%2F0401111%2Cphysics%2F0401114%2Cphysics%2F0401063%2Cphysics%2F0401031%2Cphysics%2F0401050%2Cphysics%2F0401052%2Cphysics%2F0401135%2Cphysics%2F0401165%2Cphysics%2F0401016&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We report a value for the $D_2$-line frequency of $^{39}$K with 0.25 ppb\nuncertainty. The frequency is measured using an evacuated ring-cavity resonator\nwhose length is calibrated against a reference laser. The $D_2$ line presents a\nproblem in identifying the line center because the closely-spaced energy levels\nof the excited state are not resolved. We use computer modelling of the\nmeasured spectrum to extract the line center and obtain a value of 391 015\n578.040(75) MHz. In conjunction with our previous measurement of the $D_1$\nline, we determine the fine-structure interval in the $4P$ state to be 1 729\n997.132(90) MHz. The results represent significant improvement over previous\nvalues."}, "authors": ["Ayan Banerjee", "Vasant Natarajan"], "author_detail": {"name": "Vasant Natarajan"}, "author": "Vasant Natarajan", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevA.70.052505", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/physics/0401165v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/physics/0401165v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "4 pages, 3 figures", "arxiv_primary_category": {"term": "physics.atom-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.atom-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/physics/0401165v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/physics/0401165v1", "journal_reference": "Physical Review A 70, 052505 (2004)", "doi": "10.1103/PhysRevA.70.052505", "fulltext": "Absolute frequency measurements of the D2 line and\n\narXiv:physics/0401165v1 [physics.atom-ph] 30 Jan 2004\n\nfine-structure interval in\n\n39\n\nK\n\nAyan Banerjee and Vasant Natarajan∗\nDepartment of Physics, Indian Institute of Science, Bangalore 560 012, INDIA\n\nAbstract\nWe report a value for the D2 -line frequency of\n\n39 K\n\nwith 0.25 ppb uncertainty. The frequency is\n\nmeasured using an evacuated ring-cavity resonator whose length is calibrated against a reference\nlaser. The D2 line presents a problem in identifying the line center because the closely-spaced\nenergy levels of the excited state are not resolved. We use computer modelling of the measured\nspectrum to extract the line center and obtain a value of 391 015 578.040(75) MHz. In conjunction\nwith our previous measurement of the D1 line, we determine the fine-structure interval in the 4P\nstate to be 1 729 997.132(90) MHz. The results represent significant improvement over previous\nvalues.\nPACS numbers: 06.30.Ft, 42.62.Eh, 32.10.Fn\n\n∗\n\nElectronic address: vasant@physics.iisc.ernet.in\n\n1\n\n\fI.\n\nINTRODUCTION\n\nPrecise measurements of atomic energy levels continue to play an important role in the\ndevelopment of physics. The energy levels of alkali atoms are particularly important because\nthese atoms can be laser cooled to ultra-low temperatures for subsequent use in precision\nspectroscopy experiments. For example, precise measurements of the D1 line in Cs [1], Rb\nor K [2], in conjunction with photon-recoil shift measurements in an atom interferometer [3],\ncould yield an independent value of the fine-structure constant α. In addition, a precise value\nof the frequency of the D2 line in Cs [4] is required for atom-interferometric measurements\nof the local gravitational acceleration [5].\nWe have recently developed a technique for measuring the absolute frequencies of optical\ntransitions with sub-MHz precision [6, 7]. The frequency is measured using a ring-cavity\nresonator whose length is calibrated against a reference laser locked to the D2 line of\n\n87\n\nRb.\n\nThe frequency of the reference laser is known to an accuracy of 10 kHz [8]. We have already\nused this technique to measure the D1 lines in the alkali atoms 39 K, 85 Rb, and 87 Rb with 0.13\nppb uncertainty [2], to facilitate measurements of α. In this paper, we apply this technique to\nmeasure the D2 line of 39 K with an uncertainty of 0.25 ppb. This represents an improvement\nof more than two orders of magnitude over tabulated values [9]. Furthermore, in combination\nwith our previous measurement of the D1 line, we obtain the fine-structure interval in the\n4P state of\n\n39\n\nK with very high precision. Knowledge of fine-structure intervals is useful in\n\nthe study of atomic collisions and relativistic calculations of atomic energy levels. Indeed, a\ncombination of improved methods of calculation and increasingly precise measurements of\natomic fine and hyperfine structure (e.g. in Li [10]) can lead to a precise value of α [11].\nThe D2 line in K presents a problem in determining the line center because transitions\nto individual hyperfine levels of the excited state are not resolved in conventional saturatedabsorption spectroscopy. This is because the various hyperfine levels in the 4P3/2 state lie\nwithin 30 MHz of each other [12], while the natural linewidth is 6 MHz. We have recently\ndemonstrated a technique to resolve such closely-spaced transitions [13], however, in this\nwork we use computer simulation of the measured spectrum to extract the line center with\nan accuracy of ∼100 kHz.\n\n2\n\n\fII.\n\nEXPERIMENTAL DETAILS\n\nThe experimental schematic is shown in Fig. 1 and has been described extensively in a\nprevious publication [2]. The four-mirror ring-cavity is placed inside a vacuum chamber and\nevacuated to a pressure of ∼10−2 torr to eliminate frequency shifts due to dispersion of air.\nLasers 1 and 2 are standard external-cavity diode lasers stabilized using optical feedback\nfrom a piezo-mounted grating [14]. The reference laser (Laser1) is locked to the D2 line of\n87\n\nRb using saturated-absorption spectroscopy in a vapor cell, and the cavity is locked to the\n\nreference laser. In general, the frequency of the laser to be measured (Laser2) will be offset\nfrom the nearest cavity resonance. This offset is compensated by using an acousto-optic\nmodulator (AOM) between Laser2 and the cavity. The AOM is locked to this frequency\ndifference and its frequency is read using a counter. The exact mode number of the cavity\nis determined by measuring the cavity's free-spectral range using different lock points of the\nreference laser, as described in Ref. [6]. The mode number and the AOM offset together\nyield the frequency of Laser2. A second AOM kept between the reference laser and its\nsaturated-absorption spectrometer allows us to vary the reference frequency continuously so\nthat the AOM offset measured for Laser2 is always close to a given value. This eliminates\npotential systematic errors due to changes in the direction of the beam entering the cavity.\nThe error signals needed for locking the diode lasers are produced by modulating the injection current at a frequency of 20–50 kHz. The error signal is obtained from the saturatedabsorption signal by phase-sensitive detection at the third harmonic of the modulation frequency [15]. This produces narrow dispersive signals that are free from effects due to the\nunderlying Doppler profile or intensity fluctuations. The error signal for locking the cavity\nis only a first-derivative signal since the cavity modes appear against a flat background.\nThe spectroscopy on\n\n39\n\nK is performed in an ultrahigh vacuum glass cell maintained at a\n\npressure below 10−8 torr by an ion pump. K vapor is produced by heating a getter source\n[16] with a current of 2.6 A. The ultrahigh vacuum environment is necessary to minimize\nlinewidth broadening arising as a result of background collisions. The getter source also\ngives us control over the amount of K vapor in the cell, which we optimized to obtain the\nnarrowest linewidth.\nFig. 2 shows a typical saturated-absorption spectrum of the D2 line covering the two\nground-hyperfine levels. Each peak is actually a convolution of six peaks. However, the\n3\n\n\findividual hyperfine transitions are not resolved because the different hyperfine levels of the\nexcited state lie within 30 MHz of each other. To determine the line center, we therefore\nperformed computer simulations of the spectrum. We first fixed the locations of the 6 peaks\n(with respect to the line center) according to the known hyperfine shifts [12]. We then set\nthe peak amplitudes to correspond to those obtained in saturated-absorption spectroscopy.\nWe further assumed that the linewidth of all the transitions is the same. We calculated the\nspectrum for a given value of the line center and linewidth.\nFig. 3 shows a close-up of the measured spectrum (open circles) for F = 2 → F ′ transitions. The solid curve is a best fit to the spectrum, obtained with a linewidth of 12.3\nMHz. In order to check that this linewidth is reasonable, we tuned the diode laser to the\nD1 line of K (at 770 nm), where the individual hyperfine transitions are clearly resolved.\nThe linewidth obtained for those transitions was 14 MHz, close to the fit value for the D2\nline. To check the linewidth further, we changed the linewidth for the calculated spectrum\nand held it constant during the fitting. The best-fit calculated spectra for a linewidth of 15\nMHz is also shown in Fig. 3. Even with this small change, the lineshape deviates from the\nmeasured data. The fit linewidth of 12.3 MHz, however, is larger than the natural linewidth\nof 6 MHz. The primary causes for this increase are power broadening due to the pump beam\nand a small angle between the counterpropagating pump and probe beams. The effect of\nstray magnetic fields and background collisions is negligible.\nWith the best fit to the spectrum in Fig. 3, we found that its maximum lies 2.60(10) MHz\nabove the line center. Similar modelling for transitions starting from the F = 1 ground level\nshows that the maximum in the spectrum lies 12.03(10) MHz below the line center.\n\nIII.\n\nERROR ANALYSIS\n\nThe errors in our frequency measurement technique have been discussed extensively in\nearlier publications [2, 6, 7]. We present here a brief overview for the sake of completeness.\nThere are two classes of potential systematic errors that we consider. The first class of\nerrors comes from systematic shifts in the laser frequencies. For the reference laser, changes\nin the lineshape of the peaks due to optical pumping effects are taken care of by carefully\nadjusting the pump and probe beam intensities in the saturated-absorption spectrometer (to\na ratio of about 3). Shift in its lock point due to peak pulling from neighboring transitions,\n4\n\n\fthe underlying Doppler profile, or phase shifts in the feedback loop are minimized by thirdharmonic detection for the error signal. Collisional shifts in the Rb vapor cell and the effect\nof stray magnetic fields are negligible.\nThe second class of systematic errors is inherent to our technique because we are really\ncomparing the wavelength (and not the frequency) of the two lasers. The most important\nsource of error is dispersion inside the cavity, which is eliminated by using an evacuated\ncavity. However, there could be wavelength-dependent phase shifts at the dielectric coated\nmirrors used in the cavity. Such errors can be corrected by repeating the measurement at\ndifferent cavity lengths. We have shown earlier [2] that this error is negligible when the\nunknown laser differs from the reference laser by up to 25 nm. In the current work, the\nwavelength difference was only 13 nm, therefore the measurements were done at a single\ncavity length of ∼178 mm.\n\nIV.\n\nRESULTS\n\nThe results of our measurements are listed in Table I. Each value is an average of 50–\n100 individual measurements, and the quoted error includes our estimate of the systematic\nerror. To check for long-term variations, we repeated these measurements over a period of\nseveral weeks. In addition, we used two different lock points of the reference laser, namely\nthe F = 2 → F ′ = (2, 3) transition and the F = 1 → F ′ = (1, 2) transition. The frequencies\nfor these transitions differ by 6622.886 MHz. The consistency of our values for the two cases\nacts as a check on our ability to determine the correct cavity mode number since the cavity\nfree-spectral range is only about 1.7 GHz. Another check on our results is that the measured\nfrequencies for the two transitions should differ by the ground hyperfine splitting in\n\n39\n\nK.\n\nOur value of 461.569(210) MHz overlaps very well with the accepted value of 461.720 MHz\n[12].\nThe values in Table I can be combined to yield the hyperfine-free frequency of the D2\nline in K\n4P3/2 − 4S1/2 :\n\n391 015 578.040(75) MHz\n\nThis value is consistent with the value of 391 015 585(30) MHz from the National Institute of\nStandards and Technology energy-level tables [9], but the accuracy is improved by more than\n5\n\n\ftwo orders of magnitude. The above result can be combined with our earlier measurement\nof the D1 line [2] to yield the fine-structure interval in the D line in K\n4P3/2 − 4P1/2 :\n\n1 729 997.132(90) MHz\n\nThis value overlaps at the 1σ level with our earlier measurement of the fine-structure interval\nusing a home-built wavemeter [17]: 1 729 993 (5) MHz, but again the accuracy is improved\nconsiderably.\n\nV.\n\nCONCLUSION\n\nIn conclusion, we have measured the D2 -line frequency and fine-structure interval in\n\n39\n\nK\n\nwith uncertainty less than 100 kHz. The measurement is complicated by the fact that the\nclosely-spaced hyperfine transitions in the line are not resolved in conventional saturatedabsorption spectroscopy. We use computer simulation of the measured spectrum to extract the line center. The frequency is measured using a Rb-stabilized ring-cavity resonator\nthat has general applicability to precise frequency measurement of optical transitions [6].\nThe only other technique of measuring optical frequencies with comparable precision is the\nfrequency-comb method [1]. By comparison, our technique is low-cost and easier to implement. In the future, we plan to measure the D lines and fine-structure interval of other\nalkali atoms such as Li, Na, and Cs. These measurements could play an important role in\nQED-independent determinations of the fine-structure constant α.\nThis work was supported by the Board of Research in Nuclear Sciences (DAE), and the\nDepartment of Science and Technology, Government of India.\n\n[1] T. Udem, J. Reichert, R. Holzwarth, and T. W. Hänsch, Phys. Rev. Lett. 82, 3568 (1999).\n[2] A. Banerjee, D. Das, and V. Natarajan, Europhys. Lett. 65, 172 (2004).\n[3] D. S. Weiss, B. C. Young, and S. Chu, Phys. Rev. Lett. 70, 2706 (1993).\n[4] T. Udem, J. Reichert, T. W. Hänsch, and M. Kourogi, Phys. Rev. A 62, 031801R (2000).\n[5] A. Peters, K. Y. Chung, and S. Chu, Nature 400, 849 (1999).\n[6] A. Banerjee, D. Das, and V. Natarajan, Opt. Lett. 28, 1579 (2003).\n[7] A. Banerjee, U. D. Rapol, D. Das, and V. Natarajan, Europhys. Lett. 63, 340 (2003).\n\n6\n\n\f[8] J. Ye, S. Swartz, P. Jungner, and J. L. Hall, Opt. Lett. 21, 1280 (1996).\n[9] The latest energy levels are available from the National Institute of Standards & Technology\nwebsite –\nhttp://physics.nist.gov/PhysRefData\n[10] J. Walls, R. Ashby, J. Clarke, B. Lu, and W. van Wijngaarden, Eur. Phys. J. D 22, 159\n(2003).\n[11] W. E. Frieze, E. A. Hinds, V. W. Hughes, and F. M. J. Pichnick, Phys. Lett. A 78, 322 (1980).\n[12] E. Arimondo, M. Inguscio, and P. Violino, Rev. Mod. Phys. 49, 31 (1977).\n[13] A. Banerjee and V. Natarajan, Opt. Lett. 28, 729 (2003).\n[14] A. Banerjee, U. D. Rapol, A. Wasan, and V. Natarajan, Appl. Phys. Lett. 79, 2139 (2001).\n[15] A. J. Wallard, J. Phys. E. 5, 926 (1972).\n[16] SAES Getters, Viale Italia 77-1-20020, Lainate (MI), Italy.\n[17] A. Banerjee, D. Das, and V. Natarajan, J. Opt. Soc. Am. B 21, 79 (2004).\n\n7\n\n\fTABLE I: Measured frequencies for the center of different transitions in the D2 line of\n\n39 K.\n\nThe\n\nfrequencies were measured with two lock points of the reference laser: Ref. f1 denotes the F =\n2 → F ′ = (2, 3) transition and Ref. f2 denotes the F = 1 → F ′ = (1, 2) transition.\nMeasured\n\nFrequency\n\nFrequency\n\ntransition\n\n(MHz) Ref. f1\n\n(MHz) Ref. f2\n\nF = 2 → F ′ 391 015 404.938(150) 391 015 404.994(150)\nF = 1 → F ′ 391 015 866.574(150) 391 015 866.495(150)\n\n8\n\n\fErr sig\nCurrent\nLIA Mod\nDemod\n\nPZT\ndriver\n\nPZT\ndriver\n\nGrating\n\nGrating\n\nLaser1\n\nLaser2\n\nSat. abs.\nspectrometer\n\nBS\n\n(Rb D2 line)\n\nAOM\ndriver\nvco\n\nFreq\ncounter\nErr sig\nCurrent\nMod LIA\nDemod\n\nErr sig\nLaser2\nDemod LIA\n\nSat. abs.\nspectrometer\n\nBS\n\nLaser1\nDemod LIA\nErr sig\n\n(K D2 line)\n\nAOM\nPD\n\nM\n\nBS\n\nVacuum\n\nPZT\ndriver\n\nPZT\n\nFIG. 1: Schematic of the experiment. PZT, piezoelectric transducer; AOM, acousto-optic modulator; vco, voltage-controlled oscillator; LIA, lock-in amplifier; Sat. abs., saturated absorption; BS,\nbeam splitter; PD, photodiode; M, mirror.\n\n9\n\n\fProbe transmission (a.u.)\n\nF = 2 → F'\nF = 1 → F'\n\nF = (1,2) → F'\n0\n\n100\n\n200\n\n300\n\n400\n\n500\n\nProbe detuning (MHz)\nFIG. 2: Typical saturated-absorption spectrum of the D2 line in\n\n39 K\n\nshowing all three sets of\n\ntransitions. The inverted peak in the center is a ground crossover resonance.\n\n10\n\n\fProbe transmission (a.u.)\n\nF = 2 → F'\n\n-20\n\n-10\n0\n10\nProbe detuning (MHz)\n\n20\n\nFIG. 3: Measured and calculated spectra for F = 2 → F ′ transitions. The measured spectrum,\nshown as open circles, is a convolution of 6 peaks. The solid curve is the best fit obtained with a\nlinewidth of 12.3 MHz. The dotted curve is the calculated spectrum with a linewidth of 15 MHz.\nEven with such a small change in linewidth, the curve does not fit the measured spectrum very\nwell.\n\n11\n\n\f"}