{"id": "http://arxiv.org/abs/physics/0602167v1", "guidislink": true, "updated": "2006-02-24T11:38:57Z", "updated_parsed": [2006, 2, 24, 11, 38, 57, 4, 55, 0], "published": "2006-02-24T11:38:57Z", "published_parsed": [2006, 2, 24, 11, 38, 57, 4, 55, 0], "title": "The Weakness of the Scientific Assessments: A Praise of Silence", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=physics%2F0501136%2Cphysics%2F0501017%2Cphysics%2F0501023%2Cphysics%2F0501100%2Cphysics%2F0501099%2Cphysics%2F0501123%2Cphysics%2F0501116%2Cphysics%2F0501072%2Cphysics%2F0501107%2Cphysics%2F0501134%2Cphysics%2F0501150%2Cphysics%2F0501110%2Cphysics%2F0501093%2Cphysics%2F0501048%2Cphysics%2F0501073%2Cphysics%2F0501063%2Cphysics%2F0501024%2Cphysics%2F0501088%2Cphysics%2F0501003%2Cphysics%2F0501071%2Cphysics%2F0501055%2Cphysics%2F0501103%2Cphysics%2F0501009%2Cphysics%2F0501077%2Cphysics%2F0501046%2Cphysics%2F0501058%2Cphysics%2F0501152%2Cphysics%2F0501030%2Cphysics%2F0501066%2Cphysics%2F0501001%2Cphysics%2F0501129%2Cphysics%2F0501074%2Cphysics%2F0501018%2Cphysics%2F0501097%2Cphysics%2F0501067%2Cphysics%2F0501056%2Cphysics%2F0501165%2Cphysics%2F0501041%2Cphysics%2F0501015%2Cphysics%2F0501158%2Cphysics%2F0501051%2Cphysics%2F0501054%2Cphysics%2F0501141%2Cphysics%2F0501132%2Cphysics%2F0602110%2Cphysics%2F0602116%2Cphysics%2F0602073%2Cphysics%2F0602105%2Cphysics%2F0602086%2Cphysics%2F0602096%2Cphysics%2F0602108%2Cphysics%2F0602106%2Cphysics%2F0602144%2Cphysics%2F0602157%2Cphysics%2F0602015%2Cphysics%2F0602185%2Cphysics%2F0602079%2Cphysics%2F0602150%2Cphysics%2F0602131%2Cphysics%2F0602089%2Cphysics%2F0602160%2Cphysics%2F0602151%2Cphysics%2F0602077%2Cphysics%2F0602013%2Cphysics%2F0602042%2Cphysics%2F0602001%2Cphysics%2F0602067%2Cphysics%2F0602050%2Cphysics%2F0602007%2Cphysics%2F0602043%2Cphysics%2F0602127%2Cphysics%2F0602068%2Cphysics%2F0602101%2Cphysics%2F0602190%2Cphysics%2F0602139%2Cphysics%2F0602103%2Cphysics%2F0602167%2Cphysics%2F0602084%2Cphysics%2F0602023%2Cphysics%2F0602172%2Cphysics%2F0602028%2Cphysics%2F0602097%2Cphysics%2F0602004%2Cphysics%2F0602113%2Cphysics%2F0602137%2Cphysics%2F0602112%2Cphysics%2F0602130%2Cphysics%2F0602029%2Cphysics%2F0602074%2Cphysics%2F0602003%2Cphysics%2F0602126%2Cphysics%2F0602169%2Cphysics%2F0602158%2Cphysics%2F0602063%2Cphysics%2F0602111%2Cphysics%2F0602016%2Cphysics%2F0602094%2Cphysics%2F0602091%2Cphysics%2F0602052%2Cphysics%2F0602184%2Cphysics%2F0602161&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Weakness of the Scientific Assessments: A Praise of Silence"}, "summary": "This article aims to show the weakness of the current scientific assessments,\nbased on a set of contradictory pseudo-axioms. The six pseudo-axioms are deeply\nanalysed. From the analysis are derived several conclusions. In spite of the\nserious efforts of the scientists to establish a ranking of honors in order to\nget funds or to control the academic and higher education institutions, the\nScience doesn't exists in itself, but different kinds of knowledge. Therefore,\nthe scientists don't control the Science; they are mere experts in a field of\nknowledge, which could be expressed in many valid ways. This variety determines\nthe existence of many models of academic curricula, based on heterogeneous ways\nof valuation that change along the History.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=physics%2F0501136%2Cphysics%2F0501017%2Cphysics%2F0501023%2Cphysics%2F0501100%2Cphysics%2F0501099%2Cphysics%2F0501123%2Cphysics%2F0501116%2Cphysics%2F0501072%2Cphysics%2F0501107%2Cphysics%2F0501134%2Cphysics%2F0501150%2Cphysics%2F0501110%2Cphysics%2F0501093%2Cphysics%2F0501048%2Cphysics%2F0501073%2Cphysics%2F0501063%2Cphysics%2F0501024%2Cphysics%2F0501088%2Cphysics%2F0501003%2Cphysics%2F0501071%2Cphysics%2F0501055%2Cphysics%2F0501103%2Cphysics%2F0501009%2Cphysics%2F0501077%2Cphysics%2F0501046%2Cphysics%2F0501058%2Cphysics%2F0501152%2Cphysics%2F0501030%2Cphysics%2F0501066%2Cphysics%2F0501001%2Cphysics%2F0501129%2Cphysics%2F0501074%2Cphysics%2F0501018%2Cphysics%2F0501097%2Cphysics%2F0501067%2Cphysics%2F0501056%2Cphysics%2F0501165%2Cphysics%2F0501041%2Cphysics%2F0501015%2Cphysics%2F0501158%2Cphysics%2F0501051%2Cphysics%2F0501054%2Cphysics%2F0501141%2Cphysics%2F0501132%2Cphysics%2F0602110%2Cphysics%2F0602116%2Cphysics%2F0602073%2Cphysics%2F0602105%2Cphysics%2F0602086%2Cphysics%2F0602096%2Cphysics%2F0602108%2Cphysics%2F0602106%2Cphysics%2F0602144%2Cphysics%2F0602157%2Cphysics%2F0602015%2Cphysics%2F0602185%2Cphysics%2F0602079%2Cphysics%2F0602150%2Cphysics%2F0602131%2Cphysics%2F0602089%2Cphysics%2F0602160%2Cphysics%2F0602151%2Cphysics%2F0602077%2Cphysics%2F0602013%2Cphysics%2F0602042%2Cphysics%2F0602001%2Cphysics%2F0602067%2Cphysics%2F0602050%2Cphysics%2F0602007%2Cphysics%2F0602043%2Cphysics%2F0602127%2Cphysics%2F0602068%2Cphysics%2F0602101%2Cphysics%2F0602190%2Cphysics%2F0602139%2Cphysics%2F0602103%2Cphysics%2F0602167%2Cphysics%2F0602084%2Cphysics%2F0602023%2Cphysics%2F0602172%2Cphysics%2F0602028%2Cphysics%2F0602097%2Cphysics%2F0602004%2Cphysics%2F0602113%2Cphysics%2F0602137%2Cphysics%2F0602112%2Cphysics%2F0602130%2Cphysics%2F0602029%2Cphysics%2F0602074%2Cphysics%2F0602003%2Cphysics%2F0602126%2Cphysics%2F0602169%2Cphysics%2F0602158%2Cphysics%2F0602063%2Cphysics%2F0602111%2Cphysics%2F0602016%2Cphysics%2F0602094%2Cphysics%2F0602091%2Cphysics%2F0602052%2Cphysics%2F0602184%2Cphysics%2F0602161&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "This article aims to show the weakness of the current scientific assessments,\nbased on a set of contradictory pseudo-axioms. The six pseudo-axioms are deeply\nanalysed. From the analysis are derived several conclusions. In spite of the\nserious efforts of the scientists to establish a ranking of honors in order to\nget funds or to control the academic and higher education institutions, the\nScience doesn't exists in itself, but different kinds of knowledge. Therefore,\nthe scientists don't control the Science; they are mere experts in a field of\nknowledge, which could be expressed in many valid ways. This variety determines\nthe existence of many models of academic curricula, based on heterogeneous ways\nof valuation that change along the History."}, "authors": ["Jose Carlos Bermejo Barrera"], "author_detail": {"name": "Jose Carlos Bermejo Barrera"}, "author": "Jose Carlos Bermejo Barrera", "arxiv_comment": "19 pages, 1 figure", "links": [{"href": "http://arxiv.org/abs/physics/0602167v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/physics/0602167v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "physics.soc-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.soc-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/physics/0602167v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/physics/0602167v1", "journal_reference": null, "doi": null, "fulltext": "THE WEAKNESS OF THE SCIENTIFIC ASSESSMENTS:\nA PRAISE OF SILENCE\n\nJosé Carlos Bermejo Barrera\nUniversity of Santiago de Compostela\n\nAbstract\nThis article aims to show the weakness of the current scientific assessments,\nbased on a set of contradictory pseudo-axioms. The six pseudo-axioms are deeply\nanalysed. From the analysis are derived several conclusions. In spite of the serious\nefforts of the scientists to establish a ranking of honors in order to get funds or to\ncontrol the academic and higher education institutions, the Science doesn't exists in\nitself, but different kinds of knowledge. Therefore, the scientists don't control the\nScience; they are mere experts in a field of knowledge, which could be expressed in\nmany valid ways. This variety determines the existence of many models of academic\ncurricula, based on heterogeneous ways of valuation that change along the History.\nKeywords: Science, Scientist, Knowledge, Curriculum, Research.\n------\n\nSince some decades in the industrialized world has been developed a system or a\nseries of systems designed to set up a collection of parameters in order to value\nobjectively or even to quantify the progress of the knowledge or of the Science (always\nstarting from the supposition that the knowledge is scientific by definition). Setting up\nthese parameters is very important, because on one hand they are aimed at arranging\nthe funding of the investigation called scientific and on the other hand the foundation of\nresearch and teaching institutions and, consequently, the money for the staff of\nresearchers. That determines the professional and living future of a very big group of\nwho we can consider «professionals of knowledge».\nWe intend to point out below that the main systems of scientific assessment are\nbased on a set of assumptions or pseudo-axioms in contradiction. And we are going to\nhold also that, if this happens, it is not due to the lack of intelligence of who establishes\nthose systems, but to his ill will or, in other words, to the aim of developing an strategy\n\n1\n\n\fof fundraising and taking up of the higher education institutions and research centres in\nfavour of certain scientific communities and to the detriment of almost everyone else.\nThese pseudo-axioms are the following:\n1. Only the scientists have the ability of assessing the development\nof their own subject and the overall system -institutional,\npolitical and economic- of production of the knowledge.\n2. The production of knowledge is a formalized process, even\nquantifiable, according to some parameters of universal validity.\n3. Just like any process of quantifying, it is essential establish a unit\nof measure, and that unit of measure must be a publication of any\nkind.\n4. The publications are arranged in order of importance, according\nto criteria easily objectivable.\n5. The publications have an average lifespan that depends on the\ndynamic of the fast discovering, which characterizes the most of\nthe fields of the scientific research.\n6. That dynamic of the fast discovering allows that the Science\ncould do systematically without its past and forecast its own\nfuture.\n\nLet`s see the weakness of these pseudo-axioms.\nWeakness of 1:\nA Science could be defined in this way: We call Science to a limited field of the\nknowledge that must have, first, an object or a group of objects defining its contents;\nand secondly, a method or a group of methods for examining, analysing and creating\nprinciples about those objects.\nThe objects of the called Natural Sciences -Physics, Chemistry, Biology,\nGeology...- have a physical existence and are outer to the subject or the subjects\nstudying them -to whom we call «scientific communities»-. In the Formal Sciences\n-Mathematics, Logic...-, those objects have not physical existence, but we could say\nthat they are outer to the subject and contain a reality of some kind that only can be\nknown through a big effort.\nThe scientists, or a scientific community, Cc (x) are gifted with the ability to\nanalyse a sector of the reality and, consequently, they can produce principles about that\n2\n\n\fsector of the reality. By knowing a certain kind of objects and having a good grasp of\nthe method of analysis, they can speak with authority about them, but only about them.\nThey cannot speak with authority about another kind of objects because they have not\nthe instruments for watching them and are not fluent in the language for speaking about\nthem -in the case of the Physic Science, for example, different branches of the\nMathematics-.\nIf it is true that the scientist has competence only to speak with authority within\nthe limits of his own field, it will be also true that he cannot speak with authority about\nthe overall system of the production of knowledge, because that is not the object of his\nScience and he doesn't know the proper method to speak about it.\nAnd if this is true about the general system of knowledge, it will be most when\ndealing with the overall systems -institutional, political and economical-. Because\nthey develop the material and institutional conditions that make feasible the elaboration\nof the knowledge or of the Science.\nWe could say that the scientist is the speaker of a language. The speakers of a\nlanguage have linguistic competence, and this allows them to express themselves and to\nlive into the social framework of spreading of that language, but they are not\nspontaneous grammarians. Of course, they maybe ignore the syntactic or phonological\nstructures of that language, although they are able to use it. The Science that deals with\nthe language is the Linguistics, and the Sciences dealing with the different languages are\nthe different Grammars. The knowledge of these Sciences calls for a big effort and\ndemands a specialization, which gives to the linguists the ability of speaking with\nauthority about the language or the different languages, but not about other issues.\nAccording to that, we could define a scientist as the speaker of a language with a\nlinguistic competence in order to express himself and develop his profession and his life\ninto the strictly fenced field of his scientific community. Whenever the scientist goes\nout of this field, he loses his specific competence and, therefore, he is not qualified to\nspeak with authority about other issues different to his own field of knowledge.\nWhen a scientist speaks about Science, the research or the research or teaching\ninstitutions, he has not more authority than any other scientist. Moreover, we could say\nthat he has not more authority than other citizens not scientist. A scientist, when\nspeaking about Science or research, is only expressing his opinions.\nThey could speak with authority about Science or the scientific research only if\nthere were a Science of the Science or, just the same thing, a metalanguage to analyse\n3\n\n\fevery language. In that case, the role would be represented by the Philosophy or the\nPhilosophy of Science. But this is not the case, because the Philosophy of Science,\nalthough developed by an academic community, is not able to create such a consensus\nto make an agreement about the object and the method among the practising ones.\nIn the Philosophy of Science there are schools of thought linked to the\nmetaphysical, political or even moral assumptions of its developers, for which reason\nwe can say that, although the philosophers of Science have much more authority than\nthe scientists to speak in general terms about Science, they have two serious limitations:\nfirst, they don't practice any Science, and because of that, sometimes they ignore the\nspecific process of the research; and secondly, they cannot create a consensus among\ntheir schools and tendencies, and so, they are also expressing their opinions.\nThe fact that the philosophers of Science are not practising scientists and their\ndependence on the traditionally called Philosophy -namely, its metaphysical or moral\nassumptions-, leads many of them to develop a certain inferiority complex. This gets\nthem to come closer to the called scientists, to whom many times they offer themselves\nas an alibi in the strategies developed by the scientific communities in order to take\nfunds and monopolize the academic institutions.\nConsequently, we believe that it could be said that nobody has the specific\nability to speak in general of Science, the scientific research or the institutions\nconnected with this or with the higher education, which is indispensable for the training\nof scientists. On this overall level there are only opinions. The opinions are formulated\nfrom different places, but chiefly from two: from inside the scientific system and from\noutside the scientific system. Taking into account the general characteristics of the\nhuman groups, we could suppose that a fellow pertaining to a group will develop an\nopinion in favour of his own group in order to get funds or institutional power, and so,\nhe will limit himself to defend the interests of his own group. Given that in the\nacademic or research framework the institutional or economical interests cannot be\ndefended openly -that happens only partly in the fields of Politics or Economy-, the\nscientist will develop arguments ad hoc to defend his strategy. Being used to employ the\nargument of authority -argumentum ad baculum-, derived from his own competence\nas scientist, he will employ that authority -that he has not in this case- for hiding his\nreal interests under the cover of a scientific pseudo-reasoning.\nAnd so, we could finish the analysis of the weakness of A saying that: nobody\ncan speak with unappealable authority about the Science, the research or the higher\n4\n\n\feducation institutions. The persons taking part in them or funding them or the\npoliticians governing in a certain moment can only express opinions.\nAll of this demonstrates that the discussions about the Science, the research or\nthe higher education institutions are not «scientific» discussions, but ethical and\npolitical. And in those discussions there is nobody with an unappealable authority\nspringing from his competence in a fenced and institutionally accepted field of the\nresearch.\nWeakness of 2:\nWhat is usually called knowledge is really a very heterogeneous reality. The fact\nthat a group of subjects are taught or researched in the universities doesn't mean that\nthey must have necessarily a common internal structure. What they share is an\ninstitutional framework: they are explained by professors, namely, persons classified\nsocially in that way. Those professors may develop their activity in similar frameworks\n(universities, institutes of research), have common patterns of social or academic\npromotion (curriculum standard), but their intellectual activity is radically\nheterogeneous.\nIt is generally stated a priori that everything made in these institutions is\nScience. Of course, who says such a thing cannot establish demarcation criteria between\nthe Science and other kinds of knowledge, and starts from a principle: the knowledge\nthat can be called Science has only an attribute, it is an unappealable knowledge,\nendorsed by the existence of a scientific community and the institution that receives it.\nWe will give some examples. The methods of observation, measure and analysis\nmanaged by a physicist have nothing no to do with those used by a zoologist, who\nestablish the systematization of the different animal species, or with those used by an\nanatomist or a histologist. And even less with the way of working of an historian, a\nphilologist or a penologist jurist.\nThose methods of observation are not even common into a field as Physics. Who\nworks in the theory of the superstrings knows that his supposed objects are not\nobservable, because they are confined. And it could happen that other physicists despise\nthis kind of physicist, considering him to be too speculative, almost philosophical. The\nsame thing could be said about what a certain class of physicians think about the\npsychiatrists\n\n-or\n\nabout\n\nthe\n\nstrains\n\nbetween\n\nbiological\n\nand\n\npsychological\n\npsychiatrists-, or about the strains between surgeons and other kind of physicians, due\nto different notions of the pathological process.\n5\n\n\fThese same differences occur in fields like the Philology, where the level of\nabstraction of the general Linguistics has nothing to do with the love for the\ninsignificant details shown by the lexicographer or the historian of language.\nIf we take into account that there is not unity in the methods of observation and\nanalysis into the same field, stating even that Sciences like the Biology work with three\nsystems hardly compatible -the genetic, the evolutionist and the morphological one-,\nit is clear that the subject will become more complicated when establishing the\nlanguages spoken by the scientist.\nA theoretical physicist must know branches of Mathematics very specific and\nvery difficult to manage; other physicists don't need them and their level of\nmathematical formulization is much lesser. The mathematical knowledge of almost all\nthe chemists is very dim, not to mention the biologists, which main mathematical\ninstrument is Statistics and no always.\nThe use of Mathematics is important in the economical theory, but lesser in the\napplied Economy. The Sociology uses Mathematics lesser than the Economy -limiting\nitself to Statistics-; and History, if not is strictly economical History, manages them on\na very elementary level and only as a complement of its narrations. The Law doesn't\nneed Mathematics at all, the same that another fields of knowledge. We cannot say\nanymore, like Galileo Galilei, that we read the book of Nature using the mathematical\ncharacters. And we cannot believe either that Science is the only well done language, as\nCondillac said and the neopositivists believed.\nThere is not the Science, but only the knowledge, by definition heterogeneous in\nthe methods of getting the information, systematizing and expressing it. The different\nkinds of knowledge cannot be reduced to a unity. Many theories are incompatible\namong themselves, even into the same field -as we have seen in the case of Biology,\nand it happens also in Physics, where the unification of the four basic kinds of strength\nis only a desideratum-.\nGiven this, it is clear that the knowledge and its process of elaboration cannot be\nformalizable, even lesser quantifiable, and that there is not any parameter of universal\nvalidity for measuring the knowledge and establishing economical or political patterns\nof funding and planning of such a thing on the overall level.\n\n6\n\n\fWeakness of 3 and 4:\nIn all the processes of evaluation is established as a fundamental criterion that\nthere is a unit from which could be stated the intellectual capital of a scientist. This unit\nis usually the paper or article, both published in a magazine or read in a congress.\nThose atoms of intellectual capital are arranged according to a series of criteria\nwhich could be considered externalist. Namely: according to the ranking of the\nmagazine, the importance of the congress, and even into this we must take into account\nthe institutional ranking: a poster, a paper, a report or a lecture.\nIf we examine this fact, something attracts widely our attention, and it is that no\ncriterion of the exposed above values the contents of those contributions, but it limits\nitself to establish a level of distinction against the anonymous mass of the investigators\nas a whole.\nWe call distinction to the sociological fact of establishing some kind of social\nranking based on the possession of a certain class of property: material -money or real\nstate- and symbolic -sacred, artistic, intellectual or military prestige-. These\nsymbolic properties shape an honors system, which has only validity into the social\ngroup that recognizes it. And so, the military honors are only recognized by who\nbelieves in them -the military communities-, and the same happens with the religious\nhonors and, in our case, with the scientific ones.\nConsequently, we see that the evaluation of the scientific knowledge in itself\ndoesn't exist, because the contents are not valued, but only the external signs. The\nevaluation of the scientific knowledge is only an inner matter of the scientific\ncommunities, through which they define their rankings and establish their positions for\ndeveloping their strategies of fundraising and of the control of the research and\nacademic institutions. The existence of these depends, as a last resort, on the funds\nprovided by the State or the industries.\nNow we must make clear that it is true the premise established by us, according\nto which the knowledge is not really valued, but the external signs of it, which is a result\nof an honors system.\nA paper or an article -we will take that unit to simplify- is not a unit of\nknowledge, but a rhetorical unit. If we take the article as a unit of measure, we favour a\nliterary criterion against a scientific criterion. The «Science» has a rhetoric analysed,\namong others, by A.G. Gross (1990). An article must have some formal and stylistic\nconventions. It is usually assumed that one cannot speak in first person, the data must be\n7\n\n\fpresented in a certain way, and be analysed similarly, obtaining the conclusions\nsometimes with the mathematical formalism and other times without it. The authors of\nan article cannot have a style of their own, but they must use an impersonal language,\nsimilar to the any other article. This language will respect all the conventions about\nbibliography and the seek of it in the publications socially accepted by the community,\nwhich are those with a property called quality. That property cannot be defined. A\npublication must contain truthful principles, and for having quality those principles\nmust be admitted by the respective scientific community, and moreover, they must get\nenough rank of honour. As a matter of fact, that rank of honour is called «quality».\nThe rhetorical unit is confused with unit of knowledge, because to a certain\nextent there is nothing for it, because there are not units of knowledge.\nA Science is not a group of atomic principles that can be numbered (Bermejo\nBarrera, 2006). On the contrary, a Science is a system of connected propositions\nbuilding a system or a scientific theory, which is usually called paradigm, term too\nmuch misused from the work of T.S. Kuhn (1962).\nIt could be also that a scientific theory depends on other, as for example\nGenetics on Biochemistry or the theoretical Physics on certain branches of\nMathematics, and so, we must value two levels of connection: the level of connection\ninto a theory and the level of connection between two or more theories.\nGiven that a scientific theory has an architecture, or with the same words, it is an\nstructure, we cannot establish a simple arithmetical criterion to define the elements that\nmake it up, and even lesser to express it with a whole number or to insist on discover\ndefinite factors of classification, like the called factor h, exposed enthusiastically by\nRicardo García, professor of research of Microelectronics in an article published in the\nnewspaper El País (21 December 2005). This factor is defined in this way: «The factor\nh is a number assigned to each scientist and it establishes the number of articles of that\nauthor with so many or more quotations than his factor h».\nIn that definition, used for the scientific assessment in the twentyfirst century\n(sic), there is no doubt about the article as a unit of measure, the number of articles as a\nwhole number and the quality of the article not considered from its contribution to the\nknowledge, or epistemic contribution, but from the number of quotations.\nBut, ¿what is a quotation? A quotation is a sign of recognition made by a\nmember of a scientific community Cc (x) to other member of that scientific community,\nmeaning that the first one grants him authority in the statement or statements made by\n8\n\n\fthe author of the paper in the text or in its contents. A quotation is a sign of mutual\nrecognition and the establishment of a criterion of reliability shared by two authors,\nthrough which the author of the quotation A recognizes to B his authority to tell the\ntruth.\nBeing a social process, the more persons confirm the recognition, the better.\nMoreover, it is being used unconsciously the notion of symbolic capital, ignored by the\nscientist, and people think that gather a certain number of quotations is equal to\ngathering a certain quantity of euros or dollars.\nSaying that the factor h is the number of papers of the author with so many or\nmore quotations than his average is only a liking for the symmetry, or even could be\ncalled a kind of mathematical pomposity, because it shows nothing. We equally could\nsay that «the most important brick of a house is the brick in contact with more bricks».\nWe don't think that the future of the architecture depends on that «theorem».\nA Science depends on the existence of one or several theories (as in the case of\nthe Biology). In a Science there are two kinds of development and progress of the\nknowledge: the cumulative one, which occurs into the theory itself and could be\nquantifiable; and the overall one, also known as «scientific revolution», which involves\na general reorganization of a field of knowledge. The overall changes are minimal and\nthey cannot be planned, by definition, for the next reasons:\n1. A scientist works inside the framework of a theory. That means that he\naccepts its principles, uses the methods established by his community and gets\nsome results admitted by the group of scientists who share those principles, use\nthe same methods and show them according to the usual conventions, in the\napproved publications or in the institutional frameworks valued by all of them.\n2. A scientific revolution involves to change the principles (all of them or partly)\nand the methods, to get unexpected results which could be shown in new forms,\nfor example using other mathematical formulisms, and to split up with the\nranking of honors of the scientific community, because those who gather the\nprevious scientific capital will lose most of it when they must reformulate all the\nsystem of knowledge. By definition, the number of quotations of preceding\nauthors made by the authors of that «revolution» will be minimal and,\nconsequently, it will be also very small the recognition of the established\nauthority, authority that works through a system of quotations, as T. Grafton\n(1997) said in his study about the footnotes in the field of Humanities.\n9\n\n\fFurthermore, the authors often quote and are quoted according to definite data\nand findings, but never when are established general principles. It happens so the\nparadox of that the fundamental things shouldn't be quoted, because they are accepted\nas principles. By this reason, the aim of R. García of stating the correlation between the\nfactor h and the Nobel Prize verges on the nonsense by reasons of strictly scientific kind\nand because the award of the Nobel Prize is a social and political process made by a\ndefinite institution. It is very important for the scientists only because symbolizes the\ntop of the whole «system of honors».\nWe think that from above said it is clear that there is not the unit of measurement\nof the scientific knowledge, because that knowledge is formed by very complex\nstructures and the ranking of those supposed units of measurement -the papers- is\nonly a part of a process of inner organization of certain social groups, the scientific\ncommunities. They have almost nothing to do with the ranking of knowledge. And then,\n¿Why the scientists use them? According to two kinds of reasons, sociological and\npsychological ones.\nSociologically it is necessary to use them because all the human communities\nneed establish their own rankings. In the case of the scientists, their academic promotion\nand the fundraising for the research depend on the existence of rankings. That academic\npromotion and that fundraising involve to establish the control of the academic and\nresearch institutions and also the development of rhetorical strategies to persuade the\npoliticians and the businessmen of the need of making investments for promoting the\nscientific knowledge.\nIn those strategies could be used sometimes only economical arguments of\nbusiness profitability. But those arguments are not always useful. Moreover, putting\nthem into practice in a consistent way will endanger the existence of the academic\ninstitutions and reduce the Science and the research to the development of a simple\ntechnology in the service of the companies.\nThe scientists are aware of that danger, and therefore, they combine wisely the\nargumentum ad denarium with the supposed criteria of excellence and quality, which\nare only the development of a system of honors and, consequently, of a strategy of\nranking oriented to the control of the economic sources and the authority over the\ninstitutions.\n\n10\n\n\fThe psychological need has been analysed by Randall Collins (1998). He says\nthat it is necessary to take into account three factors to understand the scientific work:\n1. Emotional energy, necessary for making constantly the big effort of\nthe intellectual work.\n2. Accumulation of cultural -or scientific- capital.\n3. Institutional recognition.\nA scientist must focus his emotional energy in the achievement of his cultural\ncapital and of his recognition. These two achievements are usually interrelated, although\nsometimes the recognition and the capital don't happen simultaneously. Scientists with\nless intellectual capital than others could be recognized by social or political reasons.\nMoreover, the strategies for obtaining these two parameters use to be clearly\ndistinguished. And so, there are scientists with a great managerial capacity and skills in\nthe social relations, which have lesser cultural capital than other socially awkward\nscientists. Bill Readings (1996) calls the first ones urban or courtiers and the second\nones rural or monks. Of course, the problem rises because the courtiers, due to their\nability of accumulating resources and controlling the institutions, could corner or let die\nthe monks of starvation, in symbolic terms. The scientific communities have two\ncharacteristics that define the living creatures: they reproduce and tend to take up the\nwhole space for the development of life. A living creature may take up that space and\nget a balance with the environment or, on the contrary, hasten his extinction due to his\noverdevelopment. In the life it is obtained a balance when there is a complex system of\nbalance among different living creatures, as states S. J. Gould (2002). In the field of\nScience maybe would be good to get a provisional balance like that occurring with the\nviruses, funguses and bacteria.\nAccording to the criteria of weakness of the pseudo-axioms 3 and 4, we think\nthat the scientific evaluation could be defined as a social and political process of\nfundraising and of control of institutions developed by the scientific communities. That\nprocess is unavoidable, but it is corrupted because the prevailing communities impose,\nby economical or political reasons, their evaluation criterion in order to marginalize the\nothers and corner the academic and research field.\nHowever, the weakness doesn't finish here, not only because in these evaluation\nprocesses are not considered another forms of exposing the knowledge, like the books\n-we won't deal with this-, but also because are established the two last pseudoaxioms, totally unwitting.\n11\n\n\fWeakness of 5 and 6:\nIt is usually accepted without any argument that the average life of an article is\nfive years. In fact, many times, when a scientist must present a curriculum, he will limit\nhimself to his publications and activities in the last five years.\nThis is supposedly the time in which each article is quoted; afterwards, it will\nfall into oblivion. If we want to understand how works this system, we should to make a\ncorrection on one hand, and on the other, to reveal the existence of the two main ideas\nused, of which the scientific assessor are not aware.\nThe correction would be the next: the index of impact of an article cannot be\nconsidered equal to the number of its quotations by several reasons.\nFirst, because we tend to believe that a quotation is positive by definition.\nNamely, an article is quoted in order to recognize its validity, and that is not true in all\nthe fields of knowledge. In the fields of the Social and Law Sciences and in the\nHumanities many quotations are negative. They are criticisms against what is said in the\nbook or the article and, consequently, refusals of recognition, and no the opposite thing.\nAnd so, for example, the book more reviewed and quoted in the field of classic studies\nin USA is Martin Bernal`s book Black Athena (Bernal, 1987). There are more than two\nhundred reviews of this book, but most of them are negative and show the\nuntenableness of his thesis, which intends to split up with the western historiographic\ntradition by discovering, supposedly, the African origin of the Greek Culture.\nThe book was very widely received, due to its political implications, but it was\nalmost unanimously rejected by the specialists. Others published books only for\ncriticizing it (Lefkowitz and McLean, 1996).\nIntroducing this corrective factor -take away the negative quotations from the\npositive ones- is not always easy, because some parts of a work can be criticized and\nothers accepted. The scientific criticism hardly tells right from wrong, but it gets an\nintermediate position.\nAlthough this taking away were possible, to measure the truthful impact we\nshould divide the number of quotations by the corpus of all the works in a definite field.\nSo, the impact of the article would be:\nI (a) = N (c) / N (t) in C (x)\nBeing N (c) the number of quotations and N (t) in C (x) the total number of\nworks in a definite field.\n\n12\n\n\fWe find unnecessary to say that a work quoted ten times in a field in which are\npublished one hundred articles per annum has more impact than other with the same\nnumber of quotations in a field in which are published ten thousand articles.\nHowever, the truly important thing is not this, but the assessors work with two\npairs of parameters not well formulated, namely:\n•\n\nSingularity versus anonymity.\n\n•\n\nLanguage versus silence.\n\nThe quotations are important, but not because they measure the scientific\nknowledge. Taking into account the thousands of works published each year in the\nfields of the big Sciences and, according to our formula, the impact is minimal. They\nare important because satisfy the psychological need of recognition of the scientists,\nreward them for the big efforts made in education and work and because they are a\nsocially useful way of establishing social rankings.\nSome years ago, a French physicist and great historian of Science, Gaston\nBachelard (1951; 1953) showed that the Physics and the Chemistry are more and more\nan anonymous knowledge. The groups of work are increasingly bigger and the results\nobtained become a common asset little by little. The scientist makes efforts to leave the\nanonymity and the silence, to be quoted, and to get into the world of language and stand\nout as a public figure against the anonymity. He needs do it to feel satisfaction and to\nhave a cultural capital or, in other words, honors and prestige to perform a social role in\nthe framework of his scientific community.\nA scientist develops an academic and research career. The scientific careers are\nvery different, as Tony Becher and Paul R. Trowler (1996) have analysed. The number\nof articles varies; it is higher in the case of the chemists and the physicists and much\nlesser in the case of the mathematicians -in them it should be distinguished among\ndifferent fields-. The philosophers, philologists and historians write hardly books. The\nwork and the logic of writing a book are very different from the production of an article.\nIn the Social Sciences and the Humanities, almost all the works belong to only\none author. In the field of Physics and Chemistry almost never; on the contrary, they use\nto be works of very large groups. A great philosopher or historian must have his own\nliterary style. None natural scientific has it because he doesn't need have it, and the\nrhetorical conventions of his discipline don't allow either. A philosopher or an historian\nmust read, think, write and develop a work, at least in a certain part of the cases. A\nnatural scientist doesn't read books or long texts, but basically he does research. He\n13\n\n\fdoesn't write, but produces articles; he doesn't think -in the sense of questioning the\nfundamentals of his own discipline-, and he never have work, but only curriculum.\nThere are very different academic patterns in keeping with the various kinds of\ncurricula. In the Becher and Trowler`s book could be seen the big differences, not only\nwith regard to the quantities of the publications, but also considering another very\nimportant factors, for example the creativity. There are maybe young physicists very\ncreative, but that is impossible in the field of Philosophy -except Schelling-. The\ngreat works of Philosophy have been written by mature men, even with more than sixty\nyears, an age in which a physicist is no more productive. We could think that imposing\nto all of them the same pattern is a result of the ignorance. Nevertheless, given that the\nacademicians and researchers are not, by definition, ignorant; it is really the aim of\nprivileging some kinds of curricula over others in the framework of the academic fight\nfor the fundraising and the control of the institutions.\nAccording to the pseudo-axiom 5, an article casts a cone of light due to the\nlanguage that fills a space and persists in the time, as shows the sketch of the figure 1.\nWhen that cone of light, merely rhetorical, goes out, the scientist falls into\noblivion and his contribution to the development of knowledge becomes a common\nasset.\nAn article leaves the cone of light of the quotations and falls into oblivion due\ntwo reasons: because it is not of interest, it is obsolete and nobody quotes it. Or because\nwhat stated in the article is so important that becomes a part of the essential common\nasset in the definition of a Science. We could systematize the situation establishing\nthree stages:\n1. An article is fundamental and has a large number of quotations.\n2. The article is not quoted, but the author will be part of the history\nof the discipline, with a law or theorem from his name: Fermat`s\ntheorem, Maxwell`s equations... The author becomes so a main\ncharacter in the history of his Science.\n3. The discovering is so important that the author is not named,\nbecause what he said is accepted as a fact: Gravity Law and not\nIsaac Newton`s Law.\n\nAccording to this pattern, we could formulate the fundamental paradox of the\nscientific evaluation: A scientist is truly important when nobody quotes his works. His\n14\n\n\fworks are not quoted because the importance of his discoverings is so great that his\nname is enough to identify them and, in the future, his name will not be necessary\neither.\nThe simplest way of going out the anonymity is accumulating quotations. But,\naccording to our paradox, that formula nullifies itself. One is truly important when it is\nnot yet necessary to quote him. And the definite importance is falling into oblivion\nbecause what one has discovered becomes a fact of universal validity.\nFinally, and with regard to what could be called «theory of the perishable\nknowledge», which is created and destroyed in a very short term, we must show two\ninconsistencies.\nThe first one is saying that the magical value of the number 5 is not endorsed by\nany historical study. We have choose the number 5 because it is the half of 10 and we\nwork in a system of base 10, and because it could be good as an approximation. No\nreason endorses a whole number, instead of a fraction.\nThis inconsistency is related with other one, expressed in the pseudo-axiom 6,\nnamely, the next:\nIf an article loses its value after five years, we may generalize saying that the\nScience destroys its own past and the scientists don't need know the history of their\ndiscipline. However, they can forecast its future, which is contradictory.\nThe scientists don't need know the history of their discipline because they work\nwith a unique theoretical and methodological pattern in which they are trained, being\nunable of understanding and practising the patterns of the past. Moreover, they think\nthat this fact is justified by the bigger effectiveness of their pattern. Nevertheless, the\nscientists will think that they can do without the past of their science, but that is not\nnecessarily true, because we have already established in the analysis of weakness 1 that\na scientist may speak with authority about the facts studied by his Science, but not about\nhis Science and even less about the Science in general. A mathematician may not know\nabout Genetics, but that doesn't mean that he has not genes.\nThe scientists are not aware of the role of the past in the Science of nowadays,\nbecause the best researches of the ancient scientists become admitted facts. An\nastronomer doesn't need show that the Earth is not in the middle of the Universe,\nbecause that was already shown by Copernico. And a chemist needn't formulate the\natomic theory or build the periodic system, because both things were made by their\nancestors, etc.\n15\n\n\fThe scientists receive the legacy of the Science in passing, but they are not\naware of it, because they don't know that what now are the facts, in other time were\nonly theories and because many times they don't realize the limitations of their\nknowledge. And so, for example, before the problem of the «dark matter» any person\nshould understand that the knowledge of the present Physics is only a provisional\nsolution and that the Science, as K. S. Popper said, is not more than a «search without\nend» and not a closed system.\nThe scientists think that they can forecast the future of their discipline because\nthey are not aware of their limitations. Undoubtedly, they can plan their research in the\nshort term. But, if following the pseudo-axiom 5, the knowledge expires after five\nyears; we will find a difficulty: the results obtained will destroy the value of the criteria\nfor planning the research, and this has not much sense, because the Science would be so\nthe only system that plans its own destruction. We say destruction and not renovation,\nbecause for speaking about renovation we must suppose that the Science with more than\nfive years is not destroyed, but it is cumulated, and this contradicts the pseudo-axiom 5.\nMoreover, and this is fundamental, a scientist may establish the prediction of a\nfact (h) when that fact goes into the field of study of his own science. An astronomer\nmay forecast an eclipse and a physician the death of a patient. Those predictions are not\nalways accurate; they use to be probabilistic, and with the development of the theory of\nchaos sometimes there is not even a clear statistical regularity. The predictions could be\neither mechanical or probabilistic, but it is obvious that they must be always included\ninto the field of study of a given Science managed by the scientist.\nA scientist cannot forecast the future of his own science and even less of the\nScience in general, because the scientists don't study their science, but a sector of the\nreality. The Science is not their object. They haven't a method for studying it, and\ntherefore, they cannot forecast its future, not mechanically or probabilistically.\nIf there were a «science of the Science», its specialists could forecast the future\nof the sciences or of the Science. But, as there is not an agree about the existence of\nsuch a science, we cannot deify the philosophers of the science as platonic kingsphilosophers, owners of the knowledge and the government.\nThe future of the Science is not predictable. The Science can only be planned in\nshort or medium-term. Although the scientists insist that they have such a capacity of\nprediction, the fact is not true. They need develop that strategy in order to fundraising\nmoney for their current research and to control the academic and research institutions,\n16\n\n\fessential requirement for surviving in a world in which the scientific communities\ncompete a lot. Sometimes, unfortunately, we must add the satisfaction of their vanity, of\ntheir ambitions of power and even of economical profit.\nAfter stating the weakness of the pseudo-axioms that endorse the processes of\nscientific evaluation, we think that it could be said that, while such an evaluation is\nnecessary, because it is impossible to fund everything, the patterns of «measurement»\nshould to be changed according to the next ideas:\n1. The Science doesn't exist, but different kinds of knowledge.\n2. There isn't one, but many ways of producing knowledge.\n3. The ways of exposing the knowledge are very different. There isn't a\nunity of production of the knowledge.\n4. There is not only a model of academic curriculum, but many.\n5. The diversity of curricula demands absolutely heterogeneous ways of\nvaluation.\n6. Those valuations must determine both the funding of the research and of\nthe researchers.\n7. The ranking of sciences may be epistemic, but not political and\neconomical, and the science of most epistemic rank doesn't need more\nfunding due to it.\n8. The heterogeneous production of knowledge is related to different\nsystems of values: technical, economical or human -with values as the\nHealth or the moral and political values-.\n9. The pyramid of values is not established by the scientists, but in a given\nhistorical period the values are arranged in a certain way.\n10. In the present historical time, the Science, understood as a provisional\nsearch without end, must be subordinated to the values of the Declaration\nof Human Rights, recognized by the democratic systems.\n11. The democratic systems are only an approximation to the shaping of\nthose values, in the same way that the Science is only an approximation\nto the conquest of knowledge.\n\nCoda\nIn the sixteenth century a shoemaker called Jakob Böhme lived in a village of\nGermany near to the town of Görlitz. Böhme didn't speak Latin and was the firs\n17\n\n\fphilosopher that wrote in German. Because of that Hegel named him, proudly,\nphilosophus teutonicus.\nJakob strolled around the fields with a physician that spoke Latin, and he\nanswered him the Latin name of the plants, because he thought that there was a strong\nconnection between the «scientific» name of a plant and its nature. In that time the Latin\nexplained everything, nowadays it is the Science.\nIn the ancient times there were authors that thought that the parts of the things\nshould to match up with the letters of the words for naming them. Our present scientists\nmake something similar when they believe in the omnipotence of the Science and in its\ncapacity for explaining everything, explaining the Science in itself and explaining even\nthemselves. But Jakob Böhme (Reguera, 2003) had a virtue that the scientists have not:\nthe humbleness. Jakob was a mystic that had some intuitions similar to the current\nPhysics, like many others mystics -which has been proved by Fritjof Capra, 1975). He\nthought that our origin was the void and we should go back to it. The great\nmathematician Blaise Pascal was afraid of «the eternal silence of the infinite spaces».\nBut Jakob Böhme wasn`t, because he considered that it was our origin. The prestige of\nthe great scientists dies in the silence, when first their quotations expire, then their\nfigure, and finally they disappear under the facts. In that eternal silence of the infinite\nspaces we will find some day the Einstein`s ironic smile or our humble shoemaker\nstrolling around the fields, and nobody will assess their curriculum.\n\nFigure 1\n\n18\n\n\fBibliography:\n\nBachelard, Gaston (1951), Activité rationaliste de la physique contemporaine,\nParis, Presses universitaires de France.\nBachelard,\n\nGaston\n\n(1953),\n\nLe\n\nmatérialisme\n\nrationne,.\n\nParis,\n\nPresses\n\nuniversitaires de France.\nBecher, Tony and Paul R. Trowler (1996), Academic Tribes and Territories,\nPhiladelphia, Open University Press, 2nd. Edition.\nBermejo Barrera, José Carlos (2006), Ciencia, ideología y mercado, Madrid,\nAkal.\nBernal, Martín (1987), Black Athena: The Afroasiatic Roots of Classical\nCivilization, London, Free Association Books.\nCapra, Fritjof (1975), The Tao of physics: an exploration of the parallels\nbetween modern physics and eastern mystics, Berkeley, Shambhala.\nCollins, Randall (1998), The sociology of philosophies: a global theory of\nintellectual change, Cambridge, Mass., Belknap Press of Harvard University Press.\nGarcía, Ricardo (2005), «El factor h, la clasificación de los científicos del siglo\nXXI», El País, 21 – XII – 2005.\nGould, Stephen Jay (2002), The structure of evolutionary theory, Cambridge,\nMass., Belknap Press of Harvard University Press.\nGrafton, Anthony (1997), The Footnote: a curious history, London, Faber and\nFaber.\nGross, Alan G. (1990), The Rhetoric of Science, Harvard, Harvard University\nPress.\nKuhn, Thomas S. (1962). The structure of scientific revolution, Chicago,\nUniversity of Chicago Press.\nLefkowitz, Mary R. y Guy MacLean (1996), Black Athena Revisited, Chapel\nHill, University of North Carolina Press.\nReadings, Bill (1996), The University in Ruins, Harvard, Harvard University\nPress.\nReguera, Isidoro (2003), Jakob Böhm, Madrid, Siruela.\n\n19\n\n\f"}