{"id": "http://arxiv.org/abs/physics/0406085v2", "guidislink": true, "updated": "2005-07-06T23:50:00Z", "updated_parsed": [2005, 7, 6, 23, 50, 0, 2, 187, 0], "published": "2004-06-18T18:32:43Z", "published_parsed": [2004, 6, 18, 18, 32, 43, 4, 170, 0], "title": "Electrodynamics of a Magnet Moving through a Conducting Pipe", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=physics%2F0406065%2Cphysics%2F0406101%2Cphysics%2F0406091%2Cphysics%2F0406007%2Cphysics%2F0406069%2Cphysics%2F0406112%2Cphysics%2F0406153%2Cphysics%2F0406052%2Cphysics%2F0406143%2Cphysics%2F0406119%2Cphysics%2F0406008%2Cphysics%2F0406039%2Cphysics%2F0406061%2Cphysics%2F0406094%2Cphysics%2F0406134%2Cphysics%2F0406074%2Cphysics%2F0406082%2Cphysics%2F0406159%2Cphysics%2F0406055%2Cphysics%2F0406145%2Cphysics%2F0406059%2Cphysics%2F0406126%2Cphysics%2F0406073%2Cphysics%2F0406088%2Cphysics%2F0406041%2Cphysics%2F0406086%2Cphysics%2F0406142%2Cphysics%2F0406129%2Cphysics%2F0406024%2Cphysics%2F0406012%2Cphysics%2F0406029%2Cphysics%2F0406053%2Cphysics%2F0406064%2Cphysics%2F0406127%2Cphysics%2F0406023%2Cphysics%2F0406017%2Cphysics%2F0406103%2Cphysics%2F0406018%2Cphysics%2F0406011%2Cphysics%2F0406006%2Cphysics%2F0406108%2Cphysics%2F0406095%2Cphysics%2F0406036%2Cphysics%2F0406046%2Cphysics%2F0406020%2Cphysics%2F0406136%2Cphysics%2F0406084%2Cphysics%2F0406116%2Cphysics%2F0406075%2Cphysics%2F0406085%2Cphysics%2F0406140%2Cphysics%2F0406050%2Cphysics%2F0406158%2Cphysics%2F0406100%2Cphysics%2F0406010%2Cphysics%2F0406072%2Cphysics%2F0406122%2Cphysics%2F0002003%2Cphysics%2F0002034%2Cphysics%2F0002031%2Cphysics%2F0002009%2Cphysics%2F0002016%2Cphysics%2F0002042%2Cphysics%2F0002029%2Cphysics%2F0002004%2Cphysics%2F0002045%2Cphysics%2F0002010%2Cphysics%2F0002043%2Cphysics%2F0002052%2Cphysics%2F0002013%2Cphysics%2F0002011%2Cphysics%2F0002019%2Cphysics%2F0002036%2Cphysics%2F0002035%2Cphysics%2F0002039%2Cphysics%2F0002040%2Cphysics%2F0002038%2Cphysics%2F0002051%2Cphysics%2F0002001%2Cphysics%2F0002047%2Cphysics%2F0002026%2Cphysics%2F0002046%2Cphysics%2F0002007%2Cphysics%2F0002030%2Cphysics%2F0002017%2Cphysics%2F0002041%2Cphysics%2F0002022%2Cphysics%2F0002025%2Cphysics%2F0002020%2Cphysics%2F0002028%2Cphysics%2F0002044%2Cphysics%2F0002048%2Cphysics%2F0002053%2Cphysics%2F0002049%2Cphysics%2F0002005%2Cphysics%2F0002050%2Cphysics%2F0002018%2Cphysics%2F0002014%2Cphysics%2F0002015%2Cphysics%2F0002012%2Cphysics%2F0002027&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Electrodynamics of a Magnet Moving through a Conducting Pipe"}, "summary": "The popular demonstration involving a permanent magnet falling through a\nconducting pipe is treated as an axially symmetric boundary value problem.\nSpecifically, Maxwell's equations are solved for an axially symmetric magnet\nmoving coaxially inside an infinitely long, conducting cylindrical shell of\narbitrary thickness at nonrelativistic speeds. Analytic solutions for the\nfields are developed and used to derive the resulting drag force acting on the\nmagnet in integral form. This treatment represents a significant improvement\nover existing models which idealize the problem as a point dipole moving slowly\ninside a pipe of negligible thickness. It also provides a rigorous study of\neddy currents under a broad range of conditions, and can be used for precision\nmagnetic braking applications. The case of a uniformly magnetized cylindrical\nmagnet is considered in detail, and a comprehensive analytical and numerical\nstudy of the properties of the drag force is presented for this geometry.\nVarious limiting cases of interest involving the shape and speed of the magnet\nand the full range of conductivity and magnetic behavior of the pipe material\nare investigated and corresponding asymptotic formulas are developed.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=physics%2F0406065%2Cphysics%2F0406101%2Cphysics%2F0406091%2Cphysics%2F0406007%2Cphysics%2F0406069%2Cphysics%2F0406112%2Cphysics%2F0406153%2Cphysics%2F0406052%2Cphysics%2F0406143%2Cphysics%2F0406119%2Cphysics%2F0406008%2Cphysics%2F0406039%2Cphysics%2F0406061%2Cphysics%2F0406094%2Cphysics%2F0406134%2Cphysics%2F0406074%2Cphysics%2F0406082%2Cphysics%2F0406159%2Cphysics%2F0406055%2Cphysics%2F0406145%2Cphysics%2F0406059%2Cphysics%2F0406126%2Cphysics%2F0406073%2Cphysics%2F0406088%2Cphysics%2F0406041%2Cphysics%2F0406086%2Cphysics%2F0406142%2Cphysics%2F0406129%2Cphysics%2F0406024%2Cphysics%2F0406012%2Cphysics%2F0406029%2Cphysics%2F0406053%2Cphysics%2F0406064%2Cphysics%2F0406127%2Cphysics%2F0406023%2Cphysics%2F0406017%2Cphysics%2F0406103%2Cphysics%2F0406018%2Cphysics%2F0406011%2Cphysics%2F0406006%2Cphysics%2F0406108%2Cphysics%2F0406095%2Cphysics%2F0406036%2Cphysics%2F0406046%2Cphysics%2F0406020%2Cphysics%2F0406136%2Cphysics%2F0406084%2Cphysics%2F0406116%2Cphysics%2F0406075%2Cphysics%2F0406085%2Cphysics%2F0406140%2Cphysics%2F0406050%2Cphysics%2F0406158%2Cphysics%2F0406100%2Cphysics%2F0406010%2Cphysics%2F0406072%2Cphysics%2F0406122%2Cphysics%2F0002003%2Cphysics%2F0002034%2Cphysics%2F0002031%2Cphysics%2F0002009%2Cphysics%2F0002016%2Cphysics%2F0002042%2Cphysics%2F0002029%2Cphysics%2F0002004%2Cphysics%2F0002045%2Cphysics%2F0002010%2Cphysics%2F0002043%2Cphysics%2F0002052%2Cphysics%2F0002013%2Cphysics%2F0002011%2Cphysics%2F0002019%2Cphysics%2F0002036%2Cphysics%2F0002035%2Cphysics%2F0002039%2Cphysics%2F0002040%2Cphysics%2F0002038%2Cphysics%2F0002051%2Cphysics%2F0002001%2Cphysics%2F0002047%2Cphysics%2F0002026%2Cphysics%2F0002046%2Cphysics%2F0002007%2Cphysics%2F0002030%2Cphysics%2F0002017%2Cphysics%2F0002041%2Cphysics%2F0002022%2Cphysics%2F0002025%2Cphysics%2F0002020%2Cphysics%2F0002028%2Cphysics%2F0002044%2Cphysics%2F0002048%2Cphysics%2F0002053%2Cphysics%2F0002049%2Cphysics%2F0002005%2Cphysics%2F0002050%2Cphysics%2F0002018%2Cphysics%2F0002014%2Cphysics%2F0002015%2Cphysics%2F0002012%2Cphysics%2F0002027&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The popular demonstration involving a permanent magnet falling through a\nconducting pipe is treated as an axially symmetric boundary value problem.\nSpecifically, Maxwell's equations are solved for an axially symmetric magnet\nmoving coaxially inside an infinitely long, conducting cylindrical shell of\narbitrary thickness at nonrelativistic speeds. Analytic solutions for the\nfields are developed and used to derive the resulting drag force acting on the\nmagnet in integral form. This treatment represents a significant improvement\nover existing models which idealize the problem as a point dipole moving slowly\ninside a pipe of negligible thickness. It also provides a rigorous study of\neddy currents under a broad range of conditions, and can be used for precision\nmagnetic braking applications. The case of a uniformly magnetized cylindrical\nmagnet is considered in detail, and a comprehensive analytical and numerical\nstudy of the properties of the drag force is presented for this geometry.\nVarious limiting cases of interest involving the shape and speed of the magnet\nand the full range of conductivity and magnetic behavior of the pipe material\nare investigated and corresponding asymptotic formulas are developed."}, "authors": ["M. Hossein Partovi", "Eliza J. Morris"], "author_detail": {"name": "Eliza J. Morris"}, "author": "Eliza J. Morris", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1139/P06-065", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/physics/0406085v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/physics/0406085v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "20 pages, 3 figures; computer program posted to\n  http://www.csus.edu/indiv/p/partovimh/magpipedrag.nb Submitted to the\n  Canadian Journal of Physics", "arxiv_primary_category": {"term": "physics.class-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.class-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.ed-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/physics/0406085v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/physics/0406085v2", "journal_reference": "Can. J. Phys. 84, 253 (2006)", "doi": "10.1139/P06-065", "fulltext": "Electrodynamics of a Magnet Moving through a Conducting Pipe\nM. Hossein Partovi∗ and Eliza J. Morris†\n\narXiv:physics/0406085v2 [physics.class-ph] 6 Jul 2005\n\nDepartment of Physics and Astronomy,\nCalifornia State University, Sacramento, California 95819-6041\n(Dated: February 2, 2008)\n\nAbstract\nThe popular demonstration involving a permanent magnet falling through a conducting pipe\nis treated as an axially symmetric boundary value problem. Specifically, Maxwell's equations\nare solved for an axially symmetric magnet moving coaxially inside an infinitely long, conducting\ncylindrical shell of arbitrary thickness at nonrelativistic speeds. Analytic solutions for the fields are\ndeveloped and used to derive the resulting drag force acting on the magnet in integral form. This\ntreatment represents a significant improvement over existing models which idealize the problem as\na point dipole moving slowly inside a pipe of negligible thickness. It also provides a rigorous study\nof eddy currents under a broad range of conditions, and can be used for precision magnetic braking\napplications. The case of a uniformly magnetized cylindrical magnet is considered in detail, and\na comprehensive analytical and numerical study of the properties of the drag force is presented\nfor this geometry. Various limiting cases of interest involving the shape and speed of the magnet\nand the full range of conductivity and magnetic behavior of the pipe material are investigated and\ncorresponding asymptotic formulas are developed.\n\n∗\n†\n\nElectronic address: hpartovi@csus.edu\nElectronic address: eliza.morris@gmail.com\n\n1\n\n\fI.\n\nINTRODUCTION\nA.\n\nBackground and Significance\n\nThis work is based on the popular experiment which demonstrates magnetic damping\nby means of a permanent magnet falling through a conducting pipe [1, 2, 3, 4]. Such\nan arrangement has long been a favorite for demonstrating such topics as Faraday's law\nof induction, Lenz's law, eddy currents, inductive heating and magnetic damping. The\nunderlying physical process is induction heating: the moving magnet creates a changing\nmagnetic flux in its vicinity which induces circulating eddy currents within the pipe wall,\nthereby causing ohmic dissipation and generating a drag force on the magnet by virtue of\nenergy conservation. The force itself is of course manifested as the action of the magnetic\nfield generated by the eddies on the permanent magnet, with its retarding nature understood\nas a manifestation of Lenz's law. A particularly vivid picture of this mechanism emerges\nif one views the magnet as an assembly of circulating atomic currents moving through the\npipe. Lenz's law then implies that the induced eddies in the pipe wall counter-circulate\nahead of the moving magnet and co-circulate behind it. But this implies that the moving\nmagnet is repelled in front and attracted in rear, hence acted upon by a retarding force.\nThe main contribution to the literature on this subject is Saslow's paper [2] in which he\ntreated the problem of eddy currents in thin conducting sheets quite generally, and as an\nexample provided an approximate calculation of the drag force on a magnet falling inside a\nconducting pipe. MacLatchy et al. [3] used other methods to derive Saslow's result for the\nterminal speed and pointed out a sizable discrepancy between the predictions of this result\nand their measured values. These authors introduced a numerical modeling of the magnet\nwhich significantly improved the agreement. Following Saslow's calculation [2], analytical\ntreatments of the magnet-pipe problem have considered the magnet as a point dipole moving\nat low speeds and the pipe as infinitely thin-walled and long. These assumptions imply that\nthe only significant length parameter in the problem is the interior diameter of the pipe,\nand lead to a simple expression for the drag force. We will refer to this limit as the idealized\nmodel and derive it as a limiting case of our general solution in appendix B. The main\nsources of inaccuracy in this model are the point-dipole and thin-wall assumptions, with the\nlow-speed approximation a potential source of inaccuracy as well.\nB.\n\nObjectives and Limitations\n\nOur objective in this work is to develop a rigorous formulation of the magnet-pipe system\nthat avoids the approximations of the idealized model. To that end, we treat the case of\nan axially symmetric permanent magnet moving coaxially inside an infinitely long, conducting cylindrical shell of arbitrary thickness. By an axially symmetric magnet we mean a\npermanent magnet whose magnetization vector has an axially (or azimuthally) symmetric\nmagnitude and a uniform direction parallel to the symmetry axis. Since any practical realization of this model will likely involve magnet speeds far smaller than the speed of light, we\nwill restrict our treatment to nonrelativistic speeds, v/c ≪ 1, where v is the magnet speed\nand c is the speed of light. On the other hand, we are including the possibility of the magnet\nbeing projected into the pipe thus allowing much higher speeds than can be attained by a\nmagnet that starts to fall from rest under gravity. The restriction to nonrelativistic speeds\nimplies that we are dealing with quasi-static sources and fields where displacement currents\n2\n\n\fcan be neglected [5]. This is so not only in the interior of the pipe where the inclusion of\nthe displacement currents would amount to a minute correction of the order of (v/c)2 , but\nalso within the pipe wall where conduction currents dominate displacement currents. To\nprovide a basis for the latter assertion, we note that the basic time scale generated by the\nmotion of the magnet is of the order of R1 /v, where R1 is the inner radius of the pipe. This\ntime scale corresponds to a frequency of the order of v/R1 , which implies that the ratio of\ndisplacement to conduction currents is of the order of ǫ0 v/σR1 where σ is the conductivity\nof the pipe wall [6]. For common metals and with 1 ≤ R1 ≤ 10 cm, this ratio is in the\n3(10−7 − 10−10 )v/c range. Since v/c ≪ 1 by assumption, the ratio in question is seen to be\nvanishingly small.\nThe assumption of an infinitely long pipe is unavoidable if a manageable solution is\ndesired. The error resulting from this assumption, on the other hand, is small if the magnet\nis not close to the pipe ends. To provide a basis for this assertion, one can use the idealized\nsolution, appendix B, to estimate the dissipated power within the pipe segment that extends\nfrom its actual end to its idealized end (which is infinitely far). The ratio of this quantity\nto the total dissipated power is then an estimate of the leading finite-length correction to\nthe drag force. This ratio is found to be of the order of (R1 /D)7 , where D is the distance\nfrom the magnet to the near end of the pipe and R1 is the pipe's interior diameter. For\nR1 /D . 1/4, for example, the expected correction would be of order 10−4 which is quite small\nas claimed. Similarly, the quasi-static approximation implies that the radiated power from\nthe magnet-pipe assembly is negligible. To get an idea of the magnitude of such radiation,\nconsider a permanent magnet with a magnetic dipole moment m moving longitudinally (i.e.,\nparallel to m) through free space at nonrelativistic speeds. The radiated power from such\na source can be calculated and is found to be μ0 m2 v̈ 2 /30πc5 where v̇ and v̈ are the first\nand second time derivatives of the magnet's speed. This quantity should be compared to\nthe ohmic dissipation in the pipe wall which for this purpose may be estimated using the\nidealized model. Using the solution to the idealized model given in appendix B, we estimate\nthe ohmic dissipation rate to be 45μ20 m2 v 2 σs/1024R14 where s is the thickness of the pipe\nwall. For reasonable values of the parameters, the radiated power is totally dominated by\nthe ohmic dissipation rate hence confirming the expectation that radiation is completely\nnegligible in this problem.\nThe case of a uniformly magnetized cylindrical magnet is considered in detail, and a comprehensive analytical and numerical study of the properties of the drag force is presented\nfor this case. Various limiting cases of interest are explored and appropriate asymptotic formulas are developed. The results reported here are supplemented with a computer program\nposted on the web [7] which can be used to compute the drag force for this case.\nThe rest of this paper is organized as follows: section II A deals with the characterization\nof the source currents of a permanent cylindrical magnet in axial motion, and II B with\nthe vector potential of such a magnet in the quasi-static limit. The electromagnetic fields\nof the magnet-pipe system are found in section III and the magnetic drag force is derived\nIV. Section V presents the results of numerical computations of the drag for the case of a\nuniformly magnetized cylinder as well as a detailed discussion of its dependence on magnet\nshape and speed, and also on the material properties of the pipe. Concluding remarks\nare presented in section VI. Several limiting cases of the drag force are considered in the\nappendices and corresponding asymptotic formulas are derived.\n\n3\n\n\fII.\n\nSOURCES AND FIELDS OF A MAGNET MOVING IN FREE SPACE\n\nThe first step in our analysis is the calculation of the electromagnetic fields of an axially\nsymmetric permanent magnet moving along its axis of symmetry in free space as input for\nthe magnet-pipe configuration.\nA.\n\nSource currents of a moving magnet\n\nBy a permanent (or hard ) magnet is meant a ferromagnetic material whose magnetization does not change when immersed in external fields, electromagnetic or gravitational.\nIn practice, this requirement is met for moderate electromagnetic or gravitational fields.\nSince, according to the equivalence principle, the physical effects of acceleration are locally\nindistinguishable from those of gravity [8], we see that a permanent magnet is unaffected by\n(moderate) acceleration. This conclusion allows us to characterize the accelerating magnet\nby means of equivalent sources in a reference frame S ′ (with cylindrical space coordinates\nρ′ , φ′, z ′ ) in which it is instantaneously at rest, then transform this to the laboratory frame\nS (with coordinates ρ, φ, z). In the laboratory frame, the origin of S ′ is specified by the\ncoordinates [0, 0, zM (t)], where zM (t) is the z-coordinate of the center of mass of the magnet\nand żM (t)ẑ its velocity. Here and throughout, a caret denotes a unit vector.\nThe magnetization vector of an axially symmetric magnet may be represented as\nM′ (ρ′ , z ′ ) = mP (ρ′ , z ′ )ẑ′ in its instantaneous rest frame S ′ , where M′ is the magnetization,\nmẑ′ is the magnetic dipole moment, and P (ρ′ , z ′ ) is an indefinite density function whose\nintegral is normalized to unity. It is important to realize that in general the magnet is in\naccelerated motion, so that this equation embodies the stipulation that the magnetization\nof a permanent magnet is unaffected by acceleration. The effective (or \"bound\") current\ndensity corresponding to the above magnetization is given by JM =∇ × M [9]. Therefore,\nwe find J′ M (ρ′ , φ′ , z ′ ) = −m[∂P (ρ′ , z ′ )/∂ρ′ ]φ̂′ in the rest frame of the magnet. This quantity\nmust now be transformed to the laboratory frame.\nAt this juncture we recall that the charge and current density together transform as a 4vector under a Lorenz transformation [10]. Here the charge density of the magnet vanishes in\nits rest frame, and since the current density vector is transverse with respect to the direction\nof relative motion, the charge density in the laboratory frame must vanish as well. As a result\nthe transformation equations reduce to the simple result that JM (ρ, z, φ, t) = J′ M (ρ′ , φ′ , z ′ ).\nNote the emergence of the time dependence in JM (ρ, φ, z, t), which originates in the fact\nthat z ′ depends on time as well as on z. Indeed for nonrelativistic speeds the coordinates\ntransform as in ρ = ρ′ , φ = φ′ , and z ′ = z − zM (t), and we find\nJM (ρ, φ, z) = −m\n\n∂p[ρ, z − zM (t)]\nφ̂,\n∂ρ\n\n(1)\n\nwhich expresses the effective current density of the magnet in the laboratory frame S. We\nnote here that the restriction to nonrelativistic speeds in Eq. (1) can be removed by simply\n−1/2\nsetting z ′ = γ[z − zM (t)], where γ=[1 − v 2 /c2 ]\nand v = żM (t).\nThe case of a uniformly magnetized cylindrical magnet which will be studied in detail\nlater corresponds to P (ρ, z) = Θ( L2 − |z|)Θ(a − ρ)/(πa2 L), where a and L are the radius and\nlength of the cylinder respectively and Θ is the standard step function. Using Eq. (1), we\n\n4\n\n\ffind\n\nm\nL\nΘ( − |z − zM (t)|)δ(a − ρ)φ̂\n(2)\n2\nπa L 2\nfor the effective current density of a uniformly magnetized cylindrical magnet in the laboratory frame.\nJuni\nM (ρ, φ, z, t) =\n\nB.\n\nVector Potential of the Moving Magnet\n\nOur task here is the calculation of the vector potential corresponding to the current\ndensity distribution of the moving magnet given in Eq. (1). Since this current density is\ntransverse (or divergenceless) and the charge density vanishes, the Lorenz and Coulomb\ngauges are equivalent here, with the common gauge condition given by ∇ * AM = 0, where\nAM is the vector potential of the moving magnet. The electromagnetic fields of the magnet\nare obtained from B = ∇ × A and E = −∂A/∂t. The azimuthal symmetry of the current\ndensity, on the other hand, allows us to write AM (ρ, φ, z, t) = AM (ρ, z, t)φ̂. Thus, like\nthe current density, the vector potential has an azimuthal (φ̂) component only that does\nnot depend on the azimuthal coordinate φ. This implies that (a) the electric field is also\npurely azimuthal, and (b) the magnetic field has a radial (ρ̂) as well as a longitudinal (ẑ)\ncomponent. It is the radial component of the magnetic field arising from sources external\nto the magnet that exerts the drag force on the moving magnet.\nUsing the standard solution for the vector potential in the quasi-static limit [12], we find\nZ\n1\nμ0\n2\n2 −\nAM (ρ, z, t) =\ndz ′ dφ′ρ′ dρ′ [ρ2 + ρ′ − 2ρρ′ cos(φ − φ′ ) + (z − z ′ ) ] 2\n4π\n×JM (ρ′ , z ′ , t) cos(φ − φ′ ),\n(3)\nwhere we have used φ̂ * φ̂′ = cos(φ − φ′ ).\nNext we substitute JM from Eq. (1) into Eq. (3) while making use of the representation\n[13]\nZ\n1\n2 +∞\n2\n′2\n′\n′\n′ 2 −2\n[ρ + ρ − 2ρρ cos(φ − φ ) + (z − z ) ] =\ndk exp[ik(z − z ′ )]\nπ −∞\nX∞\n1\ncos[n(φ − φ′ )]In (|k|ρ′ )Kn (|k|ρ)},\n(4)\n×{ I0 (|k|ρ′ )K0 (|k|ρ) +\nn=1\n2\nwhich is valid for ρ ≥ ρ′ . For 0 ≤ ρ ≤ ρ′ , ρ and ρ′ must be interchanged in Eq. (4).\nThe above substitution leads to\nZ\n∂P (ρ′ , z ′ ) ′\nmμ0\ndz ′ dρ′ dk exp{ik[z − zM (t) − z ′ ]}\nρ I1 (|k|ρ′ )K1 (|k|ρ), (5)\nAM (ρ, z, t) = −\n2π\n∂ρ′\n\nwhere the k-integral ranges over (−∞, +∞) as before. A more convenient form of this\nequation obtains if we use the Fourier representations\nZ +∞\n−1/2\nP (ρ, z) = (2π)\ndk exp{ikz}p̃(ρ, k)\n(6)\n−∞\n\nand\nAM (ρ, z, t) = (2π)\n\n−1/2\n\nZ\n\n+∞\n−∞\n\ndk exp{ik[z − zM (t)]}ÃM (ρ, k).\n5\n\n(7)\n\n\fUsing these representations, we find from Eq. (5)\nZ +∞\n∂ p̃(ρ′ , k) ′\nÃM (ρ, k) = −μ0 m\ndρ′\nρ I1 (|k|ρ′ )K1 (|k|ρ).\n′\n∂ρ\n0\n\n(8)\n\nWe recall here that for 0 ≤ ρ ≤ ρ′ , ρ and ρ′ must be interchanged in Eq. (8).\nIt will prove convenient to define a function b0 (k) by setting ÃM (ρ, k) = b0 (k)K1 (|k|ρ).\nThus we have from Eq. (8),\nZ +∞\n∂ p̃(ρ′ , k) ′\nb0 (k) = −μ0 m\ndρ′\nρ I1 (|k|ρ′ ).\n(9)\n′\n∂ρ\n0\nFor the case of a uniformly magnetized cylinder, we find from Eqs. (1), (2), (6), and (9),\nbuni\n0 (k)=\nIII.\n\nmμ0\n1/2 sin(kL/2)\n(2π)\nI1 (|k|a).\n2aπ 2\n(kL/2)\n\n(10)\n\nELECTROMAGNETIC FIELDS OF THE MAGNET-PIPE SYSTEM\n\nHaving developed the fields of the moving magnet in free space, we now turn to finding\nthe fields of the magnet-pipe system. We do this by developing the general solution followed\nby the imposition of continuity conditions.\nA.\n\nGeneral Solution\n\nOur first task here is finding the governing equations for the vector potential in the three\nregions (i) a ≤ ρ ≤ R1 , (ii) R1 ≤ ρ ≤ R2 , and (iii) R2 ≤ ρ, where R1 and R2 are the inner\nand outer radii of the pipe, respectively [16]. We will actually treat the case of a medium\nwith permeability μ [17] and conductivity σ corresponding to region (ii). For regions (i) and\n(iii), we will simply replace μ and σ with μ0 and 0, respectively. Recall from our discussion\nin section I B that the fields of the magnet-pipe system can be safely calculated in the quasistatic limit where displacement currents are neglected. Therefore the equation obeyed by\nthe vector potential in the Lorenz (or radiation) gauge reduces to\n(∇2 − μσ∂/∂t)A = 0.\n\n(11)\n\nAs we saw in section II B, the azimuthal symmetry of the system allows us to represent the\nvector potential in the form A(ρ, φ, z, t) = A(ρ, z, t)φ̂. Moreover, A(ρ, z, t) is conveniently\nrepresented as a Fourier integral following the example of Eq. (7):\nZ +∞\n−1/2\nA(ρ, z, t) = (2π)\ndk exp{ik[z − zM (t)]}Ã(ρ, k).\n(12)\n−∞\n\nUsing this representation in Eq. (11), we find\n(\n\n1 ∂\n1\n∂2\n− 2 − k 2 + ikμσv)Ã(ρ, k) = 0.\n2 +\nρ ∂ρ ρ\n∂ρ\n6\n\n(13)\n\n\f√\n√\n2 ρ) and K ( κ2 ρ), where\nThe general solution of Eq. (13) is a linear combination\nof\nI\n(\nκ\n1\n1\n√\nκ2 = k 2 − iμσvk [18]. Here and below we will use ξ to denote that root of ξ which has a\npositive real part when ξ does. Of course\n√ when ξ is real and positive, this notation reduces\nNote also that\nto the\n√ standard convention whereby ξ stands for the positive root of ξ. √\nK1 ( κ2 ρ) is singular at ρ = 0 and vanishes exponentially as ρ → ∞, while I1 ( κ2 ρ) vanishes\nat ρ = 0 but diverges exponentially as ρ → ∞. Using this information, we construct the\nsolution to Eq. (13) in the three regions as follows:\nÃ(i) (ρ, k) = ÃM (ρ, k) + b1 (k)I1 (|k|ρ),\n\n(14)\n\n√\n√\nÃ(ii) (ρ, k) = b2 (k)K1 ( κ2 ρ) + b3 (k)I1 ( κ2 ρ),\n\n(15)\n\nÃ(iii) (ρ, k) = b4 (k)K1 (|k|ρ),\n\n(16)\n\nwhere, it may be recalled, ÃM (ρ, k) = b0 (k)K1 (|k|ρ) is the term corresponding to the potential of the moving magnet in free space and b0 (k) is given in Eq. (9). Above, Ã(n) (ρ, k)\nrepresents the solution of Eq. (13) in the nth region. Note that we have set σ = 0 for regions\n(i) and (iii) as stipulated.\nUsing the analogy of waves, one may interpret the terms appearing in Eqs. (14-16) as\n\"reflections\"and \"transmissions\" resulting from the \"incident\" term ÃM (ρ, k). This source\nterm representing the contribution of the moving magnet is incident upon the inner surface\nof the pipe. The second term in region (i) is the reflection from the inner surface of the\npipe into the interior. The two terms in region (ii) correspond to a linear combination of\nthe transmitted term from region (i) and the reflected term from the outer surface of the\npipe. In region (iii) we only have the transmitted term from region (ii), since there will\nbe no reflection from \"the surface at infinity.\" From a mathematical point of view, on the\nother hand, one starts with a linear combination of the solutions of Eq. (13) in each region\nand proceeds to impose the required boundary conditions. Thus in region (i), the singular\nterm [K1 (|k|ρ), singular at ρ = 0] is normalized to represent the contribution of the moving\nmagnet, while in region (iii), the singular term [I1 (|k|ρ), singular at ρ = ∞] is excluded\nto ensure that the fields vanish far from the magnet-pipe system. Of course the physical\nsources of all six terms are the (bound) magnetization currents in the magnet and in the\npipe wall as well as the conduction currents in the pipe wall.\nB.\n\nContinuity Conditions\n\nOur next task is the formulation of continuity conditions across the two boundary surfaces,\nthe inner and outer surfaces of the pipe wall. We recall from above that the electric field\nis purely azimuthal, while the magnetic field has radial and longitudenal components. We\nwill denote these Eφ (= φ̂ * E), Bρ (= ρ̂ * B), and Bz (= ẑ * B), respectively. Now the\nboundary conditions require the continuity of Eφ (Faraday's law), Bρ (absence of magnetic\nmonopoles), and Hz (the Ampère-Maxwell law and absence of surface currents) across the\ntwo boundary surfaces, where H = B/μ0 in regions (i) and (iii), and H = B/μ in region\n(ii). When expressed in terms of A, the first two of these conditions require the continuity\nof A while the third condition requires the continuity of μ−1 ∂(ρA)/∂ρ. An inspection of\nEq. (10) shows that these conditions must also be obeyed by Ã. This gives us the continuity\n7\n\n\fequations that must be imposed on the solutions of Eq. (11). Recall that we must also apply\nthe conditions κ → k and μ → μ0 in regions (i) and (iii).\nUpon imposing the above-stated continuity conditions on the solutions given in Eqs. (1216) at the boundary surfaces ρ = R1 and ρ = R2 , we find the following set of equations:\n√\n√\nb0 (k)K1 (|k|R1 ) + b1 (k)I1 (|k|R1 ) = b2 (k)K1 ( κ2 R1 ) + b3 (k)I1 ( κ2 R1 ),\n√\n√\nb2 (k)K1 ( κ2 R2 ) + b3 (k)I1 ( κ2 R2 ) = b4 (k)K1 (|k|R2 ),\n√\n√\n√\nκ2\n|k|\n[−b0 (k)K0 (|k|R1 ) + b1 (k)I0 (|k|R1 )] =\n[−b2 (k)K0 ( κ2 R1 ) + b3 (k)I0 ( κ2 R1 )],\nμ0\nμ\n√\n2\n√\n√\nκ\n|k|\n[−b2 (k)K0 ( κ2 R2 )] + b3 (k)I0 ( κ2 R2 )] =\n[−b4 (k)K0 (|k|R2 )].\n(17)\nμ\nμ0\nThis linear set can be solved by standard methods to find the unknown coefficients b1 (k)\nthrough b4 (k). To avoid unnecessary writing, we will only record the solution for b1 (k), since\nthis is the coefficient that will be needed for the calculation of the drag force in section V:\nb1 (k) = {[K0 (|k|R1 )K0 (|k|R2 )T11 + βK0 (|k|R1 )K1 (|k|R2 )T10\n−βK1 (|k|R1 )K0 (|k|R2 )T01 − β 2 K1 (|k|R1 )K1 (|k|R2 )T00 ]\n÷[I0 (|k|R1 )K0 (|k|R2 )T11 + βI0 (|k|R1 )K1 (|k|R2 )T10\n+βI1 (|k|R1 )K0 (|k|R2 )T01 + β 2 I1 (|k|R1 )K1 (|k|R2 )T00 ]}b0 (k),\n\n(18)\n\nwhere\nT00\nT01\nT10\nT11\n\n=\n=\n=\n=\n\nK0 (α|k|R1 )I0 (α|k|R2 ) − I0 (α|k|R1 )K0 (α|k|R2 )\nK0 (α|k|R1 )I1 (α|k|R2 ) + I0 (α|k|R1)K1 (α|k|R2)\nK1 (α|k|R1 )I0 (α|k|R2 ) + I1 (α|k|R1)K0 (α|k|R2)\nK1 (α|k|R1 )I1 (α|k|R2 ) − I1 (α|k|R1 )K1 (α|k|R2 ),\n\n(19)\n\nand\n√\n\nr\nμ0 μrel σv\nα = κ2 /|k| = 1 − i\n,\nk\nr\nα\n1\nμ0 μrel σv\n1−i\nβ =\n=\n.\nμrel\nμrel\nk\n\n(20)\n\nHere μrel = μ/μ0 represents the relative permeability of the pipe material. It is worth noting\nthat α and β have positive real parts by construction.\nWith the coefficients given in Eqs. (18-20), we have in Eqs. (9), (12), and (14-16) a\ncomplete solution to the magnet-pipe system in all regions.\nIV.\n\nDRAG FORCE ON THE MOVING MAGNET\n\nWe are now in position to calculate the braking force exerted on the moving magnet.\nRecall that the density of magnetic force exerted at a point r of a current distribution J(r)\n\n8\n\n\fis given by J(r) × B(r), where B(r) is the magnetic field strength at the point in question.\nThus the force exerted on the moving magnet is given by\nZ\nF = d3 r JM (r, t) × B(r),\n(21)\nwhere JM (r, t) is the effective current density of the magnet given in Eq. (1). Note that B(r)\ncan be replaced with Bext (r) in Eq. (21), where the latter is the magnetic field produced in\nregion (i) by sources external to the magnet. Using Eqs. (12) and (14), we find\nZ +∞\n−1/2\next\nB (r) = ∇ × (2π)\ndk exp{ik[z − zM (t)]}b1 (k)I1 (|k|ρ)φ̂.\n(22)\n−∞\n\nCombining Eqs. (1), (6), and (22), and performing a few straightforward operations, we find\nfrom Eq. (21)\nZ +∞\nZ +∞\n∂ p̃(ρ, −k)\nF = −2πimẑ\nkdk\nρdρb1 (k)I1 (|k|ρ)\n.\n(23)\n∂ρ\n−∞\n0\nAt this juncture we use Eq. (9) to rewrite this result in the form\nZ +∞\n−1\nF = 2πiμ0 ẑ\nkdkb0 (−k)b1 (k).\n\n(24)\n\n−∞\n\nThe quantity b1 (k) was defined in Eqs. (18-20) et seq, and can conveniently be expressed\nas b1 (k) = Q(k)b0 (k). An inspection of Eqs. (18-20) shows that the real and imaginary parts\nof Q(k) so defined are even and odd functions of k, respectively. On the other hand, Eqs. (9)\nand (6) show that b0 (k) = b∗0 (−k). These properties allow us to rewrite Eq. (24) as\nZ +∞\n−1\nF = −4πμ0 v̂\nkdk|b0 (k)|2 Im[Q(k)],\n(25)\n0\n\nwhere we have also replaced ẑ by v̂ to make the retarding nature of the force manifest. This\nequation gives the drag force acting on the moving magnet and is a central result of our\nanalysis.\nUsing Eq. (10) which gives buni\n0 (k) corresponding to the uniformly magnetized magnet,\nwe find from Eq. (25)\n\u00152 \u0014\n\u00152\n\u0014\nZ\nI1 (ka)\nμ0 m2 +∞\n3 sin(kL/2)\nuni\ndkk\nIm[Q(k)].\n(26)\nF = −v̂\n2π 2\n(kL/2)\n(ka/2)\n0\nThis equation gives the drag force acting on the moving magnet for the case of a uniformly\nmagnetized cylinder.\nIt is instructive to rederive the drag force formula in Eq. (25) from energy conservation.\nLet us consider the magnet-pipe system at a moment the magnet is moving through the pipe\nwith velocity v. Under the quasi-static conditions stipulated in the section I B, ohmic power\ndissipation in the pipe wall must be balanced by a decrease in the kinetic energy of the moving\nmagnet, since the power flow into the electromagnetic field configuration, including radiation,\nis negligible. But the decrease in kinetic energy corresponds to a resistive force according\nto the work-energy theorem, Pohm = −F * v, where Pohm is the rate of ohmic dissipation (or\n9\n\n\fJoule heating). Needless to say, the magnet may be experiencing non-electromagnetic forces\nsuch as gravity or air drag which would have their own power contributions. Now Poynting's\ntheorem assures us that the dissipated power equals the flux of Poynting's vector into the\npipe wall through its inner surface. Putting these two observations together, we arrive at\nZ\nρdφdzS * ρ̂,\n(27)\nF*v =−\nρ=R1\n\nwhere S is Poynting's vector, given by = μ−1\n0 E × B. Since by symmetry F must have an\naxial direction, we can rewrite Eq. (27) as\n\u0014\n\u0015\nZ\n1\n∂A\nρdφdz ρ̂ *\nF = −v̂\n× (∇ × A) ,\n(28)\nμ0 v ρ=R1\n∂t\nwhere we have used B = ∇ × A and E = −∂A/∂t.\nAt this juncture we use Eq. (12) to substitute the Fourier representation of A(i) into\nEq. (28). This allows us to perform all implied integrations except one, with the result\n#\n\"\nZ ∞\n(i)\n∂\nÃ\n(ρ,\n−k)\n.\n(29)\nF = −2πiR1 μ−1\nkdk Ã(i) (ρ, k)\n0 v̂\n∂ρ\n−∞\nρ=R1\n\nNext, we use Eq. (14) to replace Ã(i) (ρ, k) with its expression in terms of modified Bessel\nfunctions. Of the resulting four terms inside the square brackets, two are even in k and make\nno contribution to the integral in Eq. (29). The other two terms equal |k|b0 (k)b1 (−k)W ,\nwhere W = 1/|k|R1 is the Wronskian of K1 (|k|R1 ) and I1 (|k|R1 ) [18]. Upon replacing b1 (−k)\nwith b0 (−k)Q(−k) in Eq. (29), and recalling that the real and imaginary parts of Q(k) are\neven and odd functions of k respectively, we recover Eq. (25). This completes the derivation\nof the magnetic drag force from energy conservation.\nV.\n\nPROPERTIES OF THE DRAG FORCE\n\nThe remainder of this paper is devoted to a detailed discussion of the properties of the\ndrag force for the case of a uniformly magnetized cylinder, given in Eq. (26). It should be\nremembered, however, that the magnetization distribution of a typical magnet depends on\nits type and manufacturing method, and almost certainly deviates from uniformity. The\nfollowing study is thus intended to provide a benchmark that typifies general properties.\nWe shall begin our study by characterizing the main features of the drag force here,\nincluding its dependence on the shape and speed of the magnet as well as the material\nproperties of the pipe wall. In the appendices, we will derive asymptotic expressions for the\ndrag force of Eq. (26) in a number of physically interesting limiting cases.\nA.\n\nDependence on Magnet Shape\n\nLet us start by examining the dependence of the drag force on the dimensions of the\nmagnet. We have already arranged Eq. (26) in such a way as to isolate and highlight the\ndependence of the drag force on the relevant parameters. The force is opposite the velocity\n10\n\n\f[19] and it is scaled by the square of the magnet's dipole moment [20]. For a fixed value of\nthe dipole moment, the dependence of the force on the dimensions of the magnet is entirely\ncontained in the two bracketed factors in Eq. (26), the first of which depends on the magnet\nlength L and the second on its radius a. Each of these factors has been normalized to unity\nat the point-dipole limit, the first at L = 0 and the second at a = 0. An inspection of the\nsecond factor shows that it increases monotonically with increasing a, which is expected as\nsuch an increase brings the source currents in the magnet closer to the eddy currents in the\npipe wall thus increasing the interaction force. On the other hand, the envelope of the first\nfactor clearly decreases with increasing magnet length, suggesting a corresponding decrease\nin the drag force with increasing magnet length. This is in fact confirmed by our numerical\nresults, and reflects the weakening of the external magnetic field with increasing magnet\nlength (with a fixed magnetic dipole moment as stipulated), which field eventually vanishes\nas L/a → ∞, just as it would for an ideal solenoid. It must be remembered, however, that a\ncan at most equal R1 , and L must remain small compared to the distance from the magnet\nto the pipe ends. It is convenient in this regard to define an ordered pair of dimensionless\nparameters, (L/2a, a/R1 ), characterizing the inverse aspect ratio of the magnet and the\ntightness of its fit inside the pipe, respectively. Thus for a given dipole strength, the pair\n(0, 1.00) corresponds to a wafer-shaped magnet that would just fit inside the pipe while\n(1, 0.60) describes a \"square cylinder\" filling 36% of the interior cross section of the pipe.\nNumerical results were obtained from Eq. (26) using a Mathematica program developed\nfor this purpose [7]. Figure 1 shows a plot of the drag force versus magnet speed for m = 1.00\nA m2 , μrel = 1.00, σ = 5.00 × 107 Ω−1 m−1 , R1 = 10.0 mm, R2 = 11.0 mm, and five different\nshapes, (a) (typical cylinder, loose fit) ⇒ ( 12 , 0.60), (b) (\"square\" cylinder, loose fit) ⇒\n( 11 , 0.60), (c) point-like cylinder ⇒ ( 11 , ≃ 0), (d) (short cylinder, snug fit) ⇒ ( 85 , 0.96) (e)\n(circular wafer, loose fit) ⇒ (≃ 0, 0.60). The dashed line, on the other hand, represents the\nidealized model limit derived in appendix B, Fidl = −v̂45μ20 m2 vσs/1024R14 , with the pipe\nthickness s set equal to R2 − R1 = 1.0 mm in order to facilitate comparison to the exact\nresults.\nThe five cases shown in Fig. 1 demonstrate the effect of the shape of the magnet on\nthe drag force. A comparison of cases (a) and (b) in Fig. 1 clearly shows that for fixed\nvalues of the dipole moment and speed, the drag force increases as the magnet is shortened.\nComparing cases (b) and (d), or (c) and (e), on the other hand, we see an increase in\nthe drag force with increasing magnet diameter. These five cases clearly demonstrate the\nstrong influence of the shape of the magnet on the drag force. In particular, they clearly\ndemonstrate the quantitative inadequacy of the point-dipole approximation, case (c), across\na broad range of speeds, as discussed in section I A.\nThe dashed line representing the idealized model corresponds to augmenting the pointdipole approximation by the thin-wall assumption, (R2 − R1 )/R1 → 0 [21]. A comparison of\nthe dashed line and curve (c) in Fig. 1 shows a relative deviation of about 10% in the lowspeed regime. This deviation should be compared with the ratio (R2 −R1 )/R1 characterizing\nthe relative thickness of the pipe, which equals 0.100 for all cases in Fig. 1. It is clear that the\nerror caused by the thin-wall assumption is, in general, unacceptably large for a reasonable\nagreement with measurement results under typical conditions. Exceptions can of course\noccur: for case (d) corresponding to a short cylindrical magnet fitting snugly inside the\npipe, the errors caused by the point-dipole and thin-wall approximations nearly cancel one\nanother in the low-speed regime.\nIt is appropriate at this juncture to compare the prediction of our analysis to the measured\n11\n\n\f10\n\ne\n8\n\nDrag Force HNL\n\nd\n6\nc\nb\n4\na\n2\n\n20\n\n40\n\n60\n\n80\n\n100\n\nVelocity Hm s-1 L\n\nFIG. 1: Plot of the drag force versus the magnet speed for a fixed value of the dipole moment and\nfour different shape parameters (L/2a, a/R1 ) (see the text for definitions): (a) typical cylinder,\n( 12 , 0.60), (b) \"square\" cylinder, ( 11 , 0.60), (c) \"point-like cylinder\" ( 11 , ≃ 0), (d) short cylinder\n( 85 , 0.96), and (e) circular wafer, (≃ 0, 53 ). The dashed line represents the idealized limit.\n\nresults of MacLatchy et al. [3], bearing in mind the important caveat that the magnetization\ndistribution in their experiment was not uniform. Using the parameter values reported by\nthese authors, namely m = 0.67 A m2 , σ = 5.08 × 107 Ω−1 m−1 , R1 = 7.29 mm, R2 = 7.96\nmm, L = 6.4 mm, and a = 6.3 mm, and equating their reported magnet (plus tape) weight\nof 0.060 N to the magnetic drag force of Eq. (26) as well as setting μrel = 1.00 appropriate\nfor copper, we find a magnet speed of 11.9 ± 0.5 cm s−1 . MacLatchy et al. reported a\nmeasured terminal speed of 12.7 ± 0.4 cm s−1 , and compared this to the prediction of the\nidealized model, 17.8 cm s−1 . Note that in this comparison we are neglecting air drag on\nthe magnet, estimated by the authors to be less than 0.1% of the magnetic drag force hence\ndeemed negligible. The quoted error of 0.5 cm s−1 in our calculated result is estimated on\nthe basis of the (implied) precision level of the measured values given by MacLatchy et al.\nfor L, a, m, R2 − R1 , and the magnet weight. Keeping in mind that the magnetization\ndistribution of the \"button\" magnet used in the experiment was not uniform, and the fact\nthat the drag force is rather sensitive to this distribution as demonstrated by the numerical\nmodeling of MacLatchy et al., we conclude that our predicted value of the magnet speed\nagrees with the measured value within the uncertainties.\nThe circular wafer (L = 0) geometry merits special attention since, in that case, the drag\nforce grows without limit as a → R1 . In other words, the shape characterized by (0, 1) is\na singular limit where the magnetic drag force diverges. This behavior may be understood\nas follows. In the limit of (0, 1) geometry, the effective (or \"bound\") source currents of the\n12\n\n\fmagnet are concentrated in a single current ring of radius R1 . However, such a source would\ninduce similarly concentrated eddy current rings in the pipe wall on its interior surface,\ni.e., at zero distance from the source itself, thus causing infinite interaction forces due to\noverlapping current rings. This situation is analogous to the divergence of the image force\non a point charge as it approaches the surface of a conductor. It is worth remarking that\nwhile the limit itself is unphysical, the sharp increase in the magnetic drag force for L ≪ a\nand a → R1 is very real and already discernible from a comparison of cases (c) and (e) in\nFig. 1. In practice, this sharp increase in the magnetic drag would be accompanied by a\nparallel increase in the air drag force caused by the unavoidable constriction in the flow of\nair around the magnet [22].\nThe effect just discussed can also be understood in reference to Eq. (26). Using the asymptotic properties of the modified Bessel functions [18], we find that Im[Q(k)] → exp(−2kR1 )/k\nas k → ∞. Now for L/a → 0 and a → R1 , the shape factors in Eq. (26) behave like\nexp(2kR1 )/k 3 as k → ∞. Putting these two statements together, we conclude that the integrand in Eq. (26) behaves like k −1 for large k, which implies a logarithmic divergence at the\nupper limit of the integral. Recalling that k is the Fourier conjugate of z [cf. Eq. (26)], so\nthat large values of k are associated with short values of z, we conclude that this divergence\nis a short-distance effect. This is of course the conclusion we reached above on physical\ngrounds.\nB.\n\nDependence on Magnet Speed\n\nThe dependence of the drag force on the speed of the magnet is contained in Q(k)\nthrough the combination μσv and is more involved than the dependence on its shape. It\nproves expedient to discuss this dependence in terms of a length parameter defined by\nl0 = (μ0 σv)−1 . As discussed below, l0 represents the penetration depth of the fields into the\npipe wall under appropriate conditions. The two distinguished ranges of v, which we will\nrefer to as \"low\" and \"high\" speed [23], correspond to l0 ≫ R1 and l0 ≪ R1 , respectively\n[24]. We will first consider the low-speed regime, as it is the relevant one in practice. In this\n−1\nspeed range, we have α ≃ 1 − i/(μ−1\nrel l0 k), so that αkR1 ≃ kR1 − i(R1 /μrel l0 ), and similarly\nfor αkR2 . Thus the imaginary part of the argument of various modified Bessel functions\nis much smaller than the corresponding real part. This would in turn imply that, to the\nleading order, the imaginary part of those functions is linear in R1 /l0 and R2 /l0 . This fact\nimplies the same for Q, to wit, that in the low-speed regime the imaginary part of Q is linear\nin R1 /l0 (and R2 /l0 ), hence proportional to σv [25]. This confirms the expectation that in\nthe low-speed regime where l0 ≫ R1 , the braking force is a linear drag proportional to the\nconductivity of the pipe wall.\nThe linear nature of the drag force in the low-speed regime is in evidence for all cases in\nFig. 1. In typical demonstration setups, one would expect terminal speeds of the order of\n1 ms−1 or less, which corresponds to the neighborhood of the origin in Fig. 1 where the drag\nforce is closely proportional to the magnet speed. Indeed from the the low-speed condition\nμσvR1 ≪ 1 given above, we can estimate the relative deviation from linearity to be of the\n2\norder of (μσvR1 )2 . For case (d) of Fig. 1, this estimate of deviation gives (0.63v[m s−1 ]) ,\nwhich amounts to about 2.5% at a terminal speed of 25 m s−1 .\nIn the high-speed regime (which would require the projection of the magnet into the pipe\n1\n\n2\nwith a suitably high initial speed) where l0 ≪ R1 , we have α ≃ (1 − i)/(2μ−1\nrel l0 k) for values\n\n13\n\n\fof kR1 ≈ 1 which provide the main contribution to the integral in Eq. (26). This implies\n1\n\n1\n\n2\nthat αkR1 ≃ (1 − i)(kR1 /2) 2 (R1 /μ−1\nrel l0 ) , and similarly for αkR2 . Since R1 /l0 , R2 /l0 ≫ 1\nin this speed range, the arguments of the modified Bessel functions in Q which involve α\n1\n1\nwill scale as (R1 /l0 ) 2 or (R2 /l0 ) 2 for kR1 ≈ 1. Since these functions behave exponentially\nfor large values of their argument, the said scaling behavior results in an overall suppression\nIm(Q) in the high speed regime, corresponding to a decrease in the drag force. In other\nwords, the drag force is a decreasing function of σv in the high-speed regime. Physically, a\npronounced skin effect which suppresses the penetration of the field into the pipe wall takes\nhold at high speeds, thereby reducing the eddy currents and the drag force resulting from\nthem. Indeed, recalling from section I B that the dominant time scale in the magnet-pipe\nsystem is R1 /v, which corresponds to a frequency ω ≈ v/R1 , we see that the high speed\n1\ncondition l0 ≪ R1 is equivalent to the inequality (μσω)− 2 ≪ R1 [24]. But this last condition\nstates that the skin depth corresponding to the dominant time scale is much smaller than\nR1 and, barring unusually thin-walled pipes, much smaller than R2 − R1 as well. In other\n1\nwords, we have (μσω)− 2 ≪ R2 − R1 in this limit, which is the condition for a pronounced\nskin effect [5]. It is appropriate to repeat here that the high speed limit is not likely to occur\nin typical arrangements of the magnet-pipe demonstration.\nThe nonlinear behavior of the drag force at intermediate speeds and its eventual drop\nat high speeds deduced above are clearly in evidence for all cases displayed in Fig. 1. Note\nthat the high-speed decline in the drag force becomes sharper as the source currents in the\nmagnet are more highly concentrated. Recalling our discussion of the singular geometry\nabove, we see the reason for this behavior: as source currents become more concentrated,\nshort-distance, equivalently high-k, contributions become more important, a feature that\nruns contrary to the high-speed situation where high k values are relatively less important.\n\nC.\n\nDependence on Conductivity and Susceptibility\n\nRecall that the drag force dependence on the magnet speed is through the combination\nμσv. This implies that the drag force behavior versus σ follows the same pattern as for\nv. In particular, higher conductivity makes for a larger drag force at low speeds hence the\nuse of copper tubes for demonstration purposes. At high speeds, however, the drag force\ndecreases with pipe conductivity, just as it does with magnet speed. An interesting conclusion, therefore, is that the drag force vanishes for a perfect conductor which, as explained\nabove, is simply a consequence of a strong skin effect. This behavior is displayed in Fig. 2,\nwhich is a plot of the drag force versus σ for case (d) of section V A at a magnet speed\nof 0.10 m s−1 . It is important to note that the decline of the drag force for high values\nof σ is not directly applicable to practical arrangements which usually correspond to the\nlow-speed (or possibly intermediate-speed) regime . Also to be noted is the fact that the\ndesignation \"perfect conductor\" here implies electric conduction without resistance, and is\nto be distinguished from \"superconductor\" which in addition implies a distinct magnetic\nbehavior as noted below. Of course inasmuch as a superconductor has zero resistance, the\nabove argument shows that the magnetic drag force vanishes for a superconducting pipe.\nNeedless to say, this conclusion as well as the one above for a perfect conductor, directly\nfollow from the energy conservation principle, which in this case asserts that there can be\nno drag force without a corresponding dissipation of power in the pipe.\nThis brings us to the question of how the magnetic properties of the pipe wall affect the\n14\n\n\fDrag Force @ND\n\n10\n8\n6\n4\n2\n2\n\n4\n\n6\n\n8\n\n10\n\nConductivity @1010 HWmL-1 D\n\nFIG. 2: Plot of the drag force versus the conductivity of the pipe for case (d) with v = 0.10 m s−1\n.\n\ndrag force [17]. Thus far we have assumed a linear magnetic material of relative permeability\nμrel for the pipe wall. Inasmuch as the magnetic susceptibility of non-ferromagnetic common\nmetals differs little from that of the vacuum, one can set μrel ≃ 1 for practical purposes, as we\ndid for the cases displayed in Fig. 1. However, it is physically interesting and meaningful to\nconsider the extreme cases of μrel → 0 and μrel → ∞, corresponding to perfect diamagnetism\nand perfect paramagnetism, respectively. Perfect diamagnetic behavior is exemplified by a\n(type I) superconductor which would exclude any magnetic field from its interior (save for\na very small penetration depth). This phenomenon, known as the Meissner effect, is not a\nmere consequence of perfect conductivity and serves to distinguish a superconductor from a\nmaterial that conducts electricity without dissipation [26]. Perfect paramagnetism, on the\nother hand, is approximately realized by \"soft\" ferromagnetic materials which have a narrow\nhysteresis loop and can be idealized as highly susceptible, linear magnetic materials.\nAn inspection of Eq. (26) shows that relative permeability occurs in the quantities α\nand β = α/μrel through the combination μrel μ0 σv in α, and in addition, β is inversely\nproportional to μrel . Leaving the latter aside for the moment, we conclude that the drag\nforce dependence on μrel is much like its dependence on the magnet speed. Thus the drag\nforce must vanish for both μrel → 0 and μrel → ∞, corresponding to strongly diamagnetic\nand paramagnetic limits. As further discussed in appendix D, the additional dependence\nof β on μrel does not change these qualitative features. Thus the drag force corresponding\nto a superconductor vanishes not only because of its perfect conductivity but also due\nto its perfect diamagnetism. Similarly, the drag force is seen to be small for a strongly\nparamagnetic conductor, or soft ferromagnetic alloys that behave like one. The asymptotic\nbehavior of the drag force for μrel ≪ 1 and μrel ≫ 1 is analyzed in appendices D and E,\nrespectively, where the foregoing conclusions are explicitly confirmed.\nFigure 3 shows a plot of the drag force versus μrel for case (d) of section V A at a magnet\nspeed of 1.0 m s−1 , where the features deduced above are in evidence.\nVI.\n\nCONCLUDING REMARKS\n\nThe treatment of the magnet-pipe system in this paper has been based on axial symmetry. Therefore, any deviation of the magnet from a linear, axially centered motion such as\nwobbling or tumbling would violate this underlying assumption and cause a departure from\n15\n\n\fDrag Force HNL\n\n0.5\n0.4\n0.3\n0.2\n0.1\n1\n\n100\n\n10000\n\nRelative Permeability HΜrelL\n\nFIG. 3: Plot of the drag force versus the relative permeability of the pipe for case (d) with v = 1.0\nm s−1\n.\n\nthe predicted results [25]. Where necessary, the magnet can be placed inside an electromagnetically inactive casing with an optimum profile for stability. This procedure would also\nserve to maintain a fixed air drag coefficient when comparing magnets of different profile.\nSimilarly, the analysis in this paper assumes an infinitely long pipe, so that in practice the\nmagnet ends must be many times the interior pipe diameter away from the pipe ends when\nmeasurements are taken.\nThe results of this paper can be used for precision magnetic braking studies and applications. The computer program provided for use with this paper [7] has been written for\nthe case of uniform magnetization, but can readily be modified to deal with the general case\nusing Eq. (25). For precision studies, it may be preferable to use an electromagnet instead of\na permanent magnet, since the former allows a more convenient characterization of sources\nand fields.\nAcknowledgments\n\nWe would like to thank David Jackson for reading the manuscript and making helpful\nsuggestions. MHP's work was supported in part by a research grant from California State\nUniversity, Sacramento.\nAPPENDIX A: LOW MAGNET SPEED\n\nHere and in the following we will outline the development of a few limiting expressions\nfor the drag force given in Eq. (26). The methods used are those of approximation and\nasymptotic analysis of integrals, the details of which would take us beyond the scope of this\npaper [27].\nAs a preliminary step we recall that in all cases except for appendix D the main contributions to the integral of Eq. (26) originate from the region k ≃ R1−1 . This fact makes it\nconvenient to rescale the integration variable therein according to k = u/R1 . Effecting this\n\n16\n\n\fsubstitution, we obtain\nuni\n\nF\n\nμ0 m2\n= −v̂ 2 4\n2π R1\n\nZ\n\n+∞\n\nduu\n0\n\n3\n\n\u0014\n\nsin(uL/2R1 )\n(uL/2R1 )\n\n\u00152 \u0014\n\nI1 (ua/R1 )\n(ua/2R1 )\n\n\u00152\n\nIm[Q(u, s/R1 , R1 /l0 , μrel)],\n\n(A1)\nwhere we have explicitly defined the dependence of Q on three dimensionless parameters\nwhich characterize the dimensions and material properties of the pipe as well as the magnet\nspeed. Note that s stands for the thickness of the pipe wall here. We shall use this representation to derive asymptotic expressions for the drag force in a number of interesting\nlimiting cases.\nThe low-speed regime is defined by the condition R1 /l0 ≪ 1 [24]. To establish the fact\nthat Funi is linear in v in the low-speed limit, as discussed in Sec. V B, we note that\nQ(u, s/R1 , 0, μrel) is real at v = 0 (corresponding to the vanishing of the drag force at zero\nspeed), so that an expansion of Im(Q) about v = 0 using the asymptotic properties of the\nmodified Bessel functions [18] yields Im[Q(u, s/R1 , R1 /l0 , μrel )] ∼\n= LR1 /l0 for small R1 /l0 .\nThe quantity L equals Im[∂Q(u, s/R1 , 0, μrel)/∂(R1 /l0 )], and is given by a long expression\nwhich need not be reproduced here. Substituting the approximate form of Im(Q) in Eq. (A1),\nwe immediately obtain the linear drag behavior in the low-speed limit:\nFlsp ∼\n= −Cσvv̂ (μrel μ0 σvR1 ≪ 1),\n\n(A2)\n\nwhere C depends on all parameters other than σ and v.\nAPPENDIX B: THE IDEALIZED MODEL\n\nThe idealized model involves three assumptions: (a) the point-dipole limit, L/R1 →\n0, a/R1 → 0, (b) the low-speed approximation, R1 /l0 ≪ 1, and (c) the thin-wall approximation, s/R1 ≪ 1. The point-dipole limit is readily implemented by setting the two shape\nfactors equal to unity. Items (b) and (c), on the other hand, require applying the thinwall approximation to the quantity C introduced in Eq. (A2). Using the properties of the\nmodified Bessel functions, we find from Eqs. (18-20) that C → (s/R1 )u[K1 (u)]2 . Therefore,\nQidl = iμ0 (s/R1 )u[K1 (u)]2 σv,\n\n(B1)\n\nwhere Qidl represents Q in the ideal limit. Substituting this result in Eq. (A1) (with the\nshape factors set to unity), we find\nFidl = −\n\n45μ20 m2 s\nσvv̂,\n1024R1 4\n\n(B2)\n\nin agreement with previous results [2].\nAPPENDIX C: HIGH MAGNET SPEED\n\nAs stated in Sec. V B, in the high-speed regime where l0 /R1 ≪ 1, the quantity α in\nEqs. (18-20) has a large magnitude which forces the respective modified Bessel functions to\ntheir asymptotic range. Since the four quantities Tij in Eqs. (19) have the same asymptotic\n17\n\n\flimit [18], they cancel out of Eq. (18). The remaining terms can then be simplified using\nthe properties of the modified Bessel functions, leaving the result\nIm(Q) ∼\n=\n\n1\n−Im(β)\n(μrel μ0 σv ≫ R1 ).\n2\nkR1 [I0 (|k|R1 )] + |β|2[I1 (|k|R1 )]2\n\n(C1)\n\nThe remaining v dependence in Eq. C1 resides in β = α/μrel . Recalling from Sec. V B that\n1\n\n2\nα → (1 − i)/(2μ−1\nrel l0 k) in the high-speed limit, we can reduce the above equation to [24]\n√\nμrel\n∼\nIm(Q) = √\n2kμ0 σvR1 [I1 (|k|R1 )]2\n√\nμrel\n(μrel μ0 σv ≫ R1 ).\n(C2)\n= p\n2uR1 /l0 [I1 (u)]2\n\nUpon substituting this expression in Eq. A1, we find\nhsp\n\nF\n\n=−\n\n0.274m2\n9/2\nR1\n\nF1 (a/R1 , L/R1 )\n\nr\n\nμ\nv̂,\nσv\n\n(C3)\n\nwhere F1 is a form factor which depends on the dimensions of the magnet as fractions of\nthe interior diameter of the pipe. It is defined by\nF1 (a/R1 , L/R1 ) =\n\nG1 (a/R1 , L/R1 )\n,\nG1 (0, 0)\n\n(C4)\n\nwhere\nG1 (a/R1 , L/R1 ) =\n\nZ\n\n+∞\n\nduu\n0\n\n5/2\n\n\u0014\n\nsin(uL/2R1 )\n(uL/2R1 )\n\n\u00152 \u0014\n\nI1 (ua/R1 )\n(ua/2R1 )\n\n\u00152\n\n[I1 (u)]−2 .\n\n(C5)\n\nNote that the form factor F1 has been normalized to unity at the point-dipole limit.\nThe asymptotic formula in Eq. (C3) is valid in the high-speed limit μrel μ0 σv ≫ R1 and\ndescribes the behavior of the drag force for very high magnet speed or pipe wall conductivity\n[24].\nAPPENDIX D: HIGHLY DIAMAGNETIC PIPE\n\nThis is the limit μrel → 0, which is appropriate to a highly diamagnetic pipe wall material. In this limit the factor β, which occurs in Q, grows large and severely suppresses\nthe magnitude of Im(Q) in Eq. (A1), and in addition limits its contributions to very small\nvalues of u. This mathematical behavior reflects the physical phenomenon of magnetic flux\nexpulsion that accompanies the approach to perfect diamagnetism.\nSince only small values of u are important in Eq. (A1), we can replace all modified Bessel\nfunctions by their asymptotic values in the small argument limit [18]. This leads to the\nfollowing approximate expression for Q:\nQ=−\n\nα2 ln(R2 /R1 )\n. (u ≪ 1)\nμrel + 21 u2 ln(R2 /R1 )α2\n18\n\n(D1)\n\n\fNext, we find Im(Q) and change the variable of integration in Eq. (A1) according to w =\n−1\n\n1\n\nμrel2 ln(R2 /R1 ) 2 u. After some calculation and simplification, we find\nZ +∞\n1 −2\nhdm\nF\n= −K\ndζ ζ 2[1 + ζ 2] v̂,\n2\n0\n\n(D2)\n\nwhere\n\nμ20 m2 σv\n− 21 3/2\n[ln(R\n/R\n)]\nμrel .\n(D3)\n2\n1\n2π 2 R13\nFinally, we carry out the integral in Eq. (D2) to arrive at the asymptotic behavior of the\ndrag force:\n1 3/2\nμ2 m2 σv\n(D4)\nFhdm = − 0√ 3 [ln(R2 /R1 )]− 2 μrel v̂.\n2π 2R1\nThe above formula is valid in the limit μrel → 0, and is appropriate to a highly diamagnetic pipe.\nK=\n\nAPPENDIX E: HIGHLY PARAMAGNETIC PIPE\n\nHere we are considering the limit μrel → ∞ appropriate to a highly susceptible pipe\nwall material[17]. Recall from V C that the dependence of Q on μrel occurs through the\ncombination μrel μ0 σv in α, and in addition through β = α/μrel. Consequently, Eq. C1\nwhich is appropriate in the high-speed regime holds here as well. Recalling further that\n1\nβ → (1 − i)/(2μrel l0 k) 2 in this limit, we find\nIm(Q) ∼\n=p\n\n1\n\n√\n2u3l0 /R1 [I0 (u)]2 μrel\n\n(μrel ≫ 1).\n\n(E1)\n\nAt this point we follow the steps subsequent to Eq. (C1) to find\nr\nσv\n0.0536μ20 m2\nhpm\nv̂,\nF\n=−\nF0 (a/R1 , L/R1 )\n7/2\nμ\nR1\n\n(E2)\n\nwhere F0 is a form factor which depends on the dimensions of the magnet as fractions of\nthe interior diameter of the pipe. It is defined by\nF0 (a/R1 , L/R1 ) =\nwhere\nG0 (a/R1 , L/R1 ) =\n\nZ\n\n+∞\n\nduu\n0\n\n3/2\n\n\u0014\n\nG0 (a/R1 , L/R1 )\n,\nG0 (0, 0)\n\nsin(uL/2R1 )\n(uL/2R1 )\n\n\u00152 \u0014\n\nI1 (ua/R1 )\n(ua/2R1 )\n\n(E3)\n\n\u00152\n\n[I0 (u)]−2 .\n\n(E4)\n\nNote that the form factor F0 has been normalized to unity at the point-dipole limit.\nThe asymptotic formula given in Eq. (E1) is valid in the limit μrel ≫ 1 and describes the\nbehavior of the drag force for a highly susceptible pipe.\n\n[1] J. A. M. Clack and T. P. Toepker, Phys. Teach. 28, 236 (1990).\n\n19\n\n\f[2]\n[3]\n[4]\n[5]\n[6]\n[7]\n\n[8]\n[9]\n[10]\n[11]\n[12]\n[13]\n[14]\n[15]\n\n[16]\n\n[17]\n\n[18]\n[19]\n[20]\n\n[21]\n\n[22]\n[23]\n[24]\n\n[25]\n\nW. M. Saslow, Am. J. Phys. 60, 693 (1992).\nC. S. Maclatchy, P. Backman, and L. Bogan, Am. J. Phys. 61, 1096 (1993).\nK. D. Hahn, E. M. Johnson, A. Brokken, and S. Baldwin, Am. J. Phys. 66, 1066 (1998).\nJ. D. Jackson, Classical Electrodynamics, 3rd ed. (John Wiley, New York, 1999), pp. 218-220.\nThe SI system of units will be used throughout this paper.\nA Mathematica program for computing the drag force as a function of velocity\nfrom Eq. (26) is provided for this purpose and may be downloaded from this URL:\nhttp://www.csus.edu/indiv/p/partovimh/magpipedrag.nb.\nS. Weinberg, Gravitation and Cosmology (John Wiley, New York, 1972), pp. 67-70.\nSee Jackson [5], p. 192.\nIbid., p. 554 et seq.\nD. J. Griffiths, Introduction to Electrodynamics (Prentice Hall, New Jersey, 1999), third ed.,\np. 531.\nRecall the discussion in the Sec. I B concerning the quasi-static limit.\nSee Jackson [5], p. 126.\nIbid., Chapter 9.\nThe dipole radiation can be found from the magnetic dipole radiation formula, (μ0 /6πc3 )M̈2 ,\nwhere M is the dipole moment in question. Using this formula, and recalling that the magnet's\n2\ndipole moment in the laboratory frame equals m/γ, we find the result (μ0 m2 /6πc7 )(v̇ 2 + vv̈) .\nThis quantity is in general smaller than the quadrupole radiation by a factor of order (v/c)2 .\nThere is a zeroeth region, (0), defined by 0 ≤ ρ ≤ a, which we have not included here.\nThe potential in this region is obtained from that in region (i) by substituting the appropriate\nrepresentation of Ã(i) (ρ, k) valid for 0 ≤ ρ ≤ a. The latter is defined in the paragraph following\nEq. (4).\nIt should be noted here that any deviation of μrel from unity implies a repulsive (for μrel < 1)\nor attractive (for μrel > 1) radial force on the magnet should it deviate from a strictly axial\nmotion. In the latter case (e.g., in the case of a magnet moving in an iron pipe), this force\ncan easily destabilize the magnet unless it is constrained to move axially. We are grateful to\nDavid Jackson for reminding us of the practical importance of this effect.\nG. B. Arfken and H. J. Weber, Mathematical Methods for Physicists, 5th ed. (Academic Press,\nSan Diego, CA, 2001), Chapter 11.\nThe imaginary part of Q is positive, a fact that is not readily obvious from its definition.\nAn analogus situation obtains for the electrostatic force exerted on a charged object by its\nimage with respect to a conducting or (linear) dielectric medium. Such a force would scale\nwith the square of the real charge.\nIn effect the thin-wall approximation assumes uniform fields and eddy currents within the\npipe wall thus ignoring the inevitable fall-off of all disturbances away from the axis. This is\nthe reason why the thin-wall approximation in general overestimates the drag force.\nAir drag effects can of course be eliminated by placing the pipe-magnet system in an evacuated\nchamber.\nRecall that we have already restricted v to nonrelativistic values.\nHere we are implicitly assuming that μrel is of the order of unity. We will consider departures\nfrom this assumption in V C, and more specifically, the possibilites of μrel ≪ 1 and μrel ≫ 1\nin appendices D and E, respectively.\nBecause the dependence of Q on μ is not just through the Bessel functions, this argument\nfails to give the full dependence of the force on μ.\n\n20\n\n\f[26] N. W. Ashcroft and N. D. Mermin, Solid State Physics ((Holt, Rinehart, and Winston, New\nYork, 1976), p. 731.\n[27] A general reference for asymptotic analysis is Norman Bleistein and Richard A. Handelsman, Asymptotic Expansions of Integrals (Dover Publications, New York, 1986); see also the\ntextbook by Arfken and Weber [18].\n[28] This is essentially the method of Green's function for solving boundary value problems associated with linear systems; see, e.g., the textbook by Arfken and Weber [18], or Jackson [5],\nfor a detailed description of this method.\n\n21\n\n\f"}