{"id": "http://arxiv.org/abs/physics/0302014v1", "guidislink": true, "updated": "2003-02-05T12:26:48Z", "updated_parsed": [2003, 2, 5, 12, 26, 48, 2, 36, 0], "published": "2003-02-05T12:26:48Z", "published_parsed": [2003, 2, 5, 12, 26, 48, 2, 36, 0], "title": "Transform-limited pulses are not optimal for resonant multiphoton\n  transitions", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=physics%2F0302072%2Cphysics%2F0302081%2Cphysics%2F0302097%2Cphysics%2F0302042%2Cphysics%2F0302006%2Cphysics%2F0302100%2Cphysics%2F0302048%2Cphysics%2F0302012%2Cphysics%2F0302019%2Cphysics%2F0302014%2Cphysics%2F0302063%2Cphysics%2F0302045%2Cphysics%2F0302022%2Cphysics%2F0302076%2Cphysics%2F0302007%2Cphysics%2F0302080%2Cphysics%2F0302036%2Cphysics%2F0302103%2Cphysics%2F0302074%2Cphysics%2F0302001%2Cphysics%2F0302010%2Cphysics%2F0302018%2Cphysics%2F0302064%2Cphysics%2F0302102%2Cphysics%2F0302077%2Cphysics%2F0302020%2Cphysics%2F0302096%2Cphysics%2F0302062%2Cphysics%2F0302057%2Cphysics%2F0302054%2Cphysics%2F0302034%2Cphysics%2F0302040%2Cphysics%2F0302015%2Cphysics%2F0302085%2Cphysics%2F0302031%2Cphysics%2F0302021%2Cphysics%2F0302023%2Cphysics%2F0302025%2Cphysics%2F0302043%2Cphysics%2F0302038%2Cphysics%2F0302026%2Cphysics%2F0302084%2Cphysics%2F0302053%2Cphysics%2F0302070%2Cphysics%2F0302027%2Cphysics%2F0302049%2Cphysics%2F0302008%2Cphysics%2F0302011%2Cphysics%2F0302046%2Cphysics%2F0302037%2Cphysics%2F0302005%2Cphysics%2F0302056%2Cphysics%2F0302058%2Cphysics%2F0302041%2Cphysics%2F0302086%2Cphysics%2F0302029%2Cphysics%2F0302017%2Cphysics%2F0302082%2Cphysics%2F0302068%2Cphysics%2F0302059%2Cphysics%2F0302090%2Cphysics%2F0302083%2Cphysics%2F0302050%2Cphysics%2F0302099%2Cphysics%2F0302093%2Cphysics%2F0302044%2Cphysics%2F0007033%2Cphysics%2F0007096%2Cphysics%2F0007062%2Cphysics%2F0007090%2Cphysics%2F0007054%2Cphysics%2F0007053%2Cphysics%2F0007083%2Cphysics%2F0007076%2Cphysics%2F0007028%2Cphysics%2F0007081%2Cphysics%2F0007073%2Cphysics%2F0007079%2Cphysics%2F0007071%2Cphysics%2F0007008%2Cphysics%2F0007052%2Cphysics%2F0007078%2Cphysics%2F0007047%2Cphysics%2F0007063%2Cphysics%2F0007075%2Cphysics%2F0007040%2Cphysics%2F0007026%2Cphysics%2F0007015%2Cphysics%2F0007018%2Cphysics%2F0007058%2Cphysics%2F0007035%2Cphysics%2F0007065%2Cphysics%2F0007029%2Cphysics%2F0007044%2Cphysics%2F0007005%2Cphysics%2F0007059%2Cphysics%2F0007038%2Cphysics%2F0007086%2Cphysics%2F0007024%2Cphysics%2F0007017%2Cphysics%2F0007085&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Transform-limited pulses are not optimal for resonant multiphoton\n  transitions"}, "summary": "Maximizing nonlinear light-matter interactions is a primary motive for\ncompressing laser pulses to achieve ultrashort transform limited pulses. Here\nwe show how, by appropriately shaping the pulses, resonant multiphoton\ntransitions can be enhanced significantly beyond the level achieved by\nmaximizing the pulse's peak intensity. We demonstrate the counterintuitive\nnature of this effect with an experiment in a resonant two-photon absorption,\nin which, by selectively removing certain spectral bands, the peak intensity of\nthe pulse is reduced by a factor of 40, yet the absorption rate is doubled.\nFurthermore, by suitably designing the spectral phase of the pulse, we increase\nthe absorption rate by a factor of 7.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=physics%2F0302072%2Cphysics%2F0302081%2Cphysics%2F0302097%2Cphysics%2F0302042%2Cphysics%2F0302006%2Cphysics%2F0302100%2Cphysics%2F0302048%2Cphysics%2F0302012%2Cphysics%2F0302019%2Cphysics%2F0302014%2Cphysics%2F0302063%2Cphysics%2F0302045%2Cphysics%2F0302022%2Cphysics%2F0302076%2Cphysics%2F0302007%2Cphysics%2F0302080%2Cphysics%2F0302036%2Cphysics%2F0302103%2Cphysics%2F0302074%2Cphysics%2F0302001%2Cphysics%2F0302010%2Cphysics%2F0302018%2Cphysics%2F0302064%2Cphysics%2F0302102%2Cphysics%2F0302077%2Cphysics%2F0302020%2Cphysics%2F0302096%2Cphysics%2F0302062%2Cphysics%2F0302057%2Cphysics%2F0302054%2Cphysics%2F0302034%2Cphysics%2F0302040%2Cphysics%2F0302015%2Cphysics%2F0302085%2Cphysics%2F0302031%2Cphysics%2F0302021%2Cphysics%2F0302023%2Cphysics%2F0302025%2Cphysics%2F0302043%2Cphysics%2F0302038%2Cphysics%2F0302026%2Cphysics%2F0302084%2Cphysics%2F0302053%2Cphysics%2F0302070%2Cphysics%2F0302027%2Cphysics%2F0302049%2Cphysics%2F0302008%2Cphysics%2F0302011%2Cphysics%2F0302046%2Cphysics%2F0302037%2Cphysics%2F0302005%2Cphysics%2F0302056%2Cphysics%2F0302058%2Cphysics%2F0302041%2Cphysics%2F0302086%2Cphysics%2F0302029%2Cphysics%2F0302017%2Cphysics%2F0302082%2Cphysics%2F0302068%2Cphysics%2F0302059%2Cphysics%2F0302090%2Cphysics%2F0302083%2Cphysics%2F0302050%2Cphysics%2F0302099%2Cphysics%2F0302093%2Cphysics%2F0302044%2Cphysics%2F0007033%2Cphysics%2F0007096%2Cphysics%2F0007062%2Cphysics%2F0007090%2Cphysics%2F0007054%2Cphysics%2F0007053%2Cphysics%2F0007083%2Cphysics%2F0007076%2Cphysics%2F0007028%2Cphysics%2F0007081%2Cphysics%2F0007073%2Cphysics%2F0007079%2Cphysics%2F0007071%2Cphysics%2F0007008%2Cphysics%2F0007052%2Cphysics%2F0007078%2Cphysics%2F0007047%2Cphysics%2F0007063%2Cphysics%2F0007075%2Cphysics%2F0007040%2Cphysics%2F0007026%2Cphysics%2F0007015%2Cphysics%2F0007018%2Cphysics%2F0007058%2Cphysics%2F0007035%2Cphysics%2F0007065%2Cphysics%2F0007029%2Cphysics%2F0007044%2Cphysics%2F0007005%2Cphysics%2F0007059%2Cphysics%2F0007038%2Cphysics%2F0007086%2Cphysics%2F0007024%2Cphysics%2F0007017%2Cphysics%2F0007085&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Maximizing nonlinear light-matter interactions is a primary motive for\ncompressing laser pulses to achieve ultrashort transform limited pulses. Here\nwe show how, by appropriately shaping the pulses, resonant multiphoton\ntransitions can be enhanced significantly beyond the level achieved by\nmaximizing the pulse's peak intensity. We demonstrate the counterintuitive\nnature of this effect with an experiment in a resonant two-photon absorption,\nin which, by selectively removing certain spectral bands, the peak intensity of\nthe pulse is reduced by a factor of 40, yet the absorption rate is doubled.\nFurthermore, by suitably designing the spectral phase of the pulse, we increase\nthe absorption rate by a factor of 7."}, "authors": ["Nirit Dudovich", "Barak Dayan", "S. M. G. Faeder", "Yaron Silberberg"], "author_detail": {"name": "Yaron Silberberg"}, "author": "Yaron Silberberg", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevLett.86.47", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/physics/0302014v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/physics/0302014v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "4 pages, 3 figures", "arxiv_primary_category": {"term": "physics.atom-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.atom-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/physics/0302014v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/physics/0302014v1", "journal_reference": "Phys. Rev. Lett. 86, 47 (2001)", "doi": "10.1103/PhysRevLett.86.47", "fulltext": "Transform-limited pulses are not optimal for resonant multiphoton transitions\nNirit Dudovich,∗ Barak Dayan,† S.M.G. Faeder, and Yaron Silberberg‡\n\narXiv:physics/0302014v1 [physics.atom-ph] 5 Feb 2003\n\nDepartment of Physics of Complex Systems,\nWeizmann Institute of Science,\nRehovot 76100, Israel\nMaximizing nonlinear light-matter interactions is a primary motive for compressing laser pulses\nto achieve ultrashort transform limited pulses. Here we show how, by appropriately shaping the\npulses, resonant multiphoton transitions can be enhanced significantly beyond the level achieved by\nmaximizing the pulse's peak intensity. We demonstrate the counterintuitive nature of this effect\nwith an experiment in a resonant two-photon absorption, in which, by selectively removing certain\nspectral bands, the peak intensity of the pulse is reduced by a factor of 40, yet the absorption rate\nis doubled. Furthermore, by suitably designing the spectral phase of the pulse, we increase the\nabsorption rate by a factor of 7.\nPACS numbers: numbers: 32.80.Qk, 32.80.Wr, 42.65.Re\n\nThe ability to steer quantum systems by coherently\nmanipulating the interacting light (coherent quantum\ncontrol), has been proposed [1, 2, 3, 4] and recently\ndemonstrated [5, 6, 7, 8, 9, 10] for manipulating both\nsimple and complex systems such as atoms, molecules\nand semiconductors. Weiner et al. [11] demonstrated\nselectivity among Raman transitions excited by shaped\npulses. They showed that by splitting an initially\ntransform limited pulse into a pulse sequence with\na specific repetition rate, a certain vibrational mode\nof a molecular crystal was excited. Meshulach and\nSilberberg [12, 13] demonstrated that by manipulating\nthe spectral phase of the exciting laser pulse, one could\nreduce and even annihilate the two photon absorption\n(TPA) rate. Nevertheless, it has been established [13]\nthat these processes are maximized by transform-limited\npulses, and cannot be enhanced beyond that level by\nshaping the pulses. Here we show that for transitions\nthat involve an intermediate resonant state, this limit\nis no longer valid. By shaping the pulses in a way\nthat exploits the spectral response of the interaction\naround the resonance we enhanced the resonant TPA\nrate in Rb vapor by a factor of 7, even though their\npeak intensity was reduced. In another experiment we\nenhanced the TPA rate by 100% simply by blocking all\nthe red-detuned frequencies of the pulse, although the\npeak intensity of the pulse was reduced by a factor of\n40.\nConsider a TPA in an atomic system, induced by a\nweak femtosecond laser pulse with an electric field ε(t).\nThe amplitude of the excited state is predicted by the\nsecond order time dependent perturbation theory:\nZ t Z t1\n1 X\naf (t) = − 2\nε(t1 )ε(t2 )\nμf n μng\n~ n\n−∞ −∞\n× exp(iωf n t1 ) exp(iωng t2 )dt2 dt1 ,\n\n(1)\n\nwhere μf n and μng are the dipole moment matrix el-\n\nements, with |gi,|ni and |f i the ground, intermediate,\nand final levels, ωij ≡ (Ei − Ej )/~, and the summation is\nperformed over all possible intermediate states of the unperturbed atom. The pulse duration is assumed here to\nbe considerably shorter than all lifetimes involved. In a\nnonresonant TPA, all the intermediate levels of the atom\nare considerably far from the pulse frequency spectrum.\nThe nonresonant excited state amplitude can then be approximated by [13]:\n1 X μf n μng\ni~2 n ωng − ωf g /2\nZ ∞\nE(ω)E(ωf g − ω)dω .\n×\n\nanr\nf ≈ −\n\n(2)\n\n−∞\n\nwhere E(ω) is the Fourier transform of ε(t), and the\npulse spectrum is taken to be centered on ωf g /2. Equation (2) reflects the fact that two-photon transitions occur for all pairs of photons with frequencies that additively give the final transition energy. As is evident from\nEq. (2), the nonresonant TPA rate is maximized by a\ntransform limited pulse, where all the spectral elements\nof E(ω) have the same phase, and therefore add constructively.\nIn the case of a resonant TPA, some intermediate (resonant) levels are within the spectral range of the pulse.\nThe contribution to the excited state amplitude due to\na transition through an intermediate resonant level |ii is\ngiven by:\n\narf\n\n\u0014\n1\nμf i μig iπE(ωig )E(ωf g − ωig )\n≈ −\ni~2\n\u0015\nZ ∞\nE(ω)E(ωf g − ω)\n+ ℘\ndω .\nωig − ω\n−∞\n\n(3)\n\nwhere ℘ is the principle value of Couchy, and\nωig , ωf g − ωig = ωf i are the resonance frequencies. As\nis evident from Eq. (3), the resonant process exhibits\n\n\f2\na different spectral behavior from that of the nonresonant one. In cases where a single resonant level exists\nclose to the two-photon frequency ωf g /2 (compared to\nthe spectral bandwidth of the pulse), the contribution of\nthe nonresonant process is negligible, therefore Eq. (3)\ndescribes the total TPA rate.\nThe first term in Eq. (3) depends only on the spectral\ncomponents of the pulse at the resonance frequencies,\nwhereas the second term integrates over the contributions of all other spectral components of the pulse. The\nbroad spectral dependence of the second term originates\nfrom the short time (∼ 10−13 sec) the atom spends at\nthe intermediate level before absorbing the second photon, which according to the uncertainty principle allows\nfor some detuning between the exciting photons and the\nresonance frequencies. Nevertheless, the larger the detuning, the lower the probability the atom will stay at\nthe intermediate level long enough to absorb a second\nphoton, hence the ωig1−ω factor. Due to the considerably\nlonger time the atom remains at the final level, the frequencies of all the photon pairs must sum to ωf g , and\nhence the dependence on E(ω)E(ωf g − ω) in Eqs. (2)\nand (3). As expected for a harmonically driven system,\nthe first term (the on-resonance contribution) is shifted\nby π/2 compared with the second term(the off-resonance\ncontributions). Also, the spectral components below and\nabove the resonance excite the system in-phase and π\nout-of-phase, respectively. We shall utilize these phase\nrelations to enhance the nonlinear response.\nUsing the above derivation, we can predict the TPA\nrate for various pulses with different spectra. When\nthe atom is subjected to a transform limited pulse, the\nsecond term in Eq. (3) integrates over both negative and\npositive contributions, and becomes negligible as the\nspectral width of the exciting pulse grows larger than\n|ωig − ωf g /2|. In other words, a transform limited pulse\ninduces a destructive quantum interference between\nthe events in which the first exciting photon is red\ndetuned and those in which it is blue detuned. A simple,\nalthough counterintuitive, way to enhance the transition\nprobability is to prevent this destructive interference\nby blocking all red (or blue) detuned photons, despite\nthe fact that this will reduce the pulse's peak intensity\n(due to both attenuation of the power and broadening\nof the pulse). Larger enhancement can be achieved\nby applying a phase function that inverts the sign\nof E(ω)E(ωf g − ω) about the resonance, so that all\nphoton pairs interfere constructively, and the transition\nprobability is maximized. Since the integrand in Eq.\n(3) approaches its maximum absolute value around the\nsingular point at ωig , this enhancement depends on the\nactual spectral resolution of the phase function, which\nlimits the sharpness of the sign inversion around ωig .\nTo demonstrate these enhancements experimentally,\nwe considered the resonant TPA in Rubidium gas be-\n\nFIG. 1: (a) Energy levels diagram of a resonant TPA in Rb.\nThe frequencies of the 5S-5P (ωig ) and 5P-5D (ωf i ) resonant\ntransitions correspond to 780.2 nm and 776.0 nm, respectively. The pulse spectrum is centered on the two-photon\ntransition frequency (ωf g /2) at 778.1 nm, with a bandwidth\nof △ω =18 nm (FWHM). The excited atoms spontaneously\ndecay to the ground level through the 6P, emitting a fluorescence signal at ω f lr (≈ 420 nm). (b) The experimental\nsetup. Femtosecond laser pulses were modified in a computercontrolled 4-f pulse shaper. The pulse shaper is composed of\na pair of diffraction gratings and a pair of achromat lenses.\nA programmable SLM with 128 computer controlled discrete\nelements is placed at the Fourier plane and is used to apply\nphase masks to the spectrum of the pulse. The shaped pulses\nwere focused into the Rb cell, and the fluorescence signal was\nmeasured with a photomultiplier tube and a lock-in amplifier.\n\ntween the 5S and the 5D states, which is dominated by\nresonant transitions through the 5P level (Fig. 1a). The\nTPA was induced by pulses with a bandwidth of 18 nm\n(corresponding to 50 fs transform limited pulses), produced by a mode-locked Ti:sapphire laser with an average power of 150 mW and repetition rate of 80 MHz.\nThe spectrum, centered on the two-photon transition\nfrequency ωf g /2 (778 nm), overlapped with the 5S-5P\nand the 5P-5D resonant transitions at ωig and ωf i corresponding to 780 nm and 776 nm, respectively. As excited\natoms decay spontaneously to the ground level through\nthe 6P level, the TPA intensity is evaluated by measuring\nthe fluorescence at 420 nm. We adjusted the spectral\nphase of the pulse with a programmable pulse shaper,\nwhich includes a liquid crystal spatial light modulator\n(SLM) at its Fourier plane [14, 15, 16]. The shaper enables both cancellation of dispersion, as well as the application of any desired additional spectral phase mask by\napplying different phase shifts to the spatially separated\nspectral components of the pulse. Our setup (Fig. 1b)\nwas almost identical to the one in [12], except that the\ninput laser beam was expanded in order to improve the\nspectral resolution to less than 0.3 nm.\nIn the first experiment we demonstrate enhancement\nof the TPA rate by blocking parts of the spectrum of the\nexciting pulse. To achieve that, we placed an adjustable\nslit at the shaper's Fourier plane, and used it to block\nspectral bands of the pulse symmetrically around ωf g /2\n(Fig. 2a). The SLM was used here only for dispersion\n\n\f3\n\nFIG. 2: Experimental and calculated results for enhancement\nof resonant TPA in Rb by selectively blocking parts of the\nspectrum. (a) An adjustable slit was used to block spectral\nbands of the exciting pulse symmetrically around ωf g /2. (b)\nThe average power transmitted through the slit (diamonds)\ntogether with the experimental (circles) and calculated (line)\nnormalized fluorescence intensity as a function of the higher\ncutoff wavelength. When the cutoff wavelengths approached\nthe resonant transitions wavelengths (to within the spectral\nresolution of our setup), the average power was reduced by\n71%, whereas the TPA rate was doubled. (c) Calculated temporal intensities of the optimal shaped pulse (solid) and the\ninitial 50 fs FWHM transform limited pulse (dashed). The optimal pulse is wider by almost a factor of 8 (390 fs FWHM),\nand its peak intensity is reduced by a factor of 38.\n\ncancellation in order to produce transform-limited\npulses at the Rubidium gas cell. We measured both the\nfluorescence signal and the average power transmitted\nthrough the slit as a function of the \"cutoff wavelengths\"\n(i.e. the shortest and longest wavelengths that passed\nthe slit; see Fig. 2a).\nThe experimental results are presented in Fig. 2b\ntogether with the theoretical curve calculated by Eq.\n(3).\nWhen the cutoff frequencies approached the\nfrequencies of the resonant transitions, we observed a\nsteep enhancement of the fluorescence signal, reaching a\nfactor of 2, while the power of the pulse at that point\nwas reduced by 71%. The maximum signal was achieved\nwhen the cutoff frequency was shifted from ωig by the\nspectral resolution of the system. Closing the slit further\ndecreased the fluorescence rapidly, which approached\nzero when the slit closed completely.\nFigure 2c illustrates the calculated temporal intensities of the optimal shaped pulse and the initial, unshaped\ntransform-limited pulse, showing both the drastic reduction of the intensity and the broadening of the pulse.\nThese results demonstrate the counterintuitive nature of\nthis enhancement. The 71% reduction in the average\npower and the 8-fold broadening of the pulse (to 390 fs)\n\nFIG. 3: Experimental and calculated results for enhancement\nof resonant TPA in Rb by scanning a 4 nm π/2 phase window\nover the spectrum of the pulse. (a) The applied phase mask at\nits optimal position, centered on ωf g /2, its leading and trailing edges close to the resonance frequencies. (b) Experimental\n(circles) and calculated (line) normalized fluorescence intensity as function of the spectral position of the phase window.\nMaximum enhancement of 600% occurred when the window\nwas centered on ωf g /2 (778.1 nm, dashed line), as described\nin (a), performing the desired sign inversion about ωig . (c)\nCalculated temporal intensities of the optimal shaped pulse\n(solid) and the initial transform-limited pulse (dashed), showing a 26% reduction of the peak intensity due to the broadening of the pulse.\n\nresult in a reduction of the peak intensity by a factor of\n38, yet the TPA rate was increased by 100%.\nThe goal of the next experiment was to achieve maximum enhancement of the TPA rate by inverting the sign\nof E(ω)E(ωf g − ω) about the resonance. Therefore we\nused the SLM as a phase filter to apply a phase shift of\nπ/2 to a 4 nm spectral window, and scanned that window over the pulse's spectrum. The 4 nm width of the\nphase window was chosen to fit the difference between\nresonant transitions at 780 nm and 776 nm, respectively.\nFigure 3b shows the measured fluorescence intensity vs.\nthe spectral position of the phase window, together with\na theoretical curve calculated by Eq. (3). Maximum enhancement by a factor of 7 was achieved when the phase\nwindow was centered on ωf g /2, its leading and trailing\nedges close to the frequencies of the resonant transitions\n(Fig. 3a). Substituting the phase window at that position in Eq. (3) will show that it performs the desired sign\ninversion about the resonance for a spectral region of 8\nnm around ωig , thus inducing a constructive instead of a\ndestructive interference in that region. Figure 3c shows\nthe calculated temporal intensities of the optimal shaped\npulse and the initial, unshaped transform-limited pulse.\nThe same enhancement factor (and a similar phase\nwindow) was achieved when we performed an adaptive\noptimization [17, 18, 19, 20] of the phase function, using\nthe fluorescence intensity as a feedback signal.\n\n\f4\n†\n\nIn conclusion, we have shown that resonant multiphoton transitions can be significantly enhanced by exploiting the general spectral response of the interaction\naround resonance. When the interaction involves an intermediate resonant state, maximizing the peak intensity\nby obtaining a transform-limited pulse does not maximize the transition rate (as is the case with nonresonant\ninteractions), and pulses with significantly lower intensities can be more effective. By properly designing the\nspectral amplitude and phase of the exciting pulse, we\nhave demonstrated large enhancements of resonant TPA,\nin excellent agreement with the theory. Unlike other experiments in coherent quantum control, where selectivity\nbetween a few processes is the primary goal, we achieved\nan enhancement of the absolute rate of a single, simple\nnonlinear process. Since this enhancement is based on\nthe general behavior of any system around resonance,\nwe believe this mechanism may have played a role in\nenhancing more complex nonlinear interactions [18, 19],\nand could be applied to enhance other resonant nonlinear\nprocesses.\n\n‡\n\n[1]\n[2]\n[3]\n[4]\n[5]\n[6]\n[7]\n[8]\n[9]\n[10]\n[11]\n[12]\n[13]\n[14]\n[15]\n[16]\n[17]\n[18]\n[19]\n[20]\n\n∗\n\nNirit.Dudovich@Weizmann.ac.il\n\nBarak.Dayan@Weizmann.ac.il\nwww.weizmann.ac.il/home/feyaron/\nD. J. Tannor and S. A. Rice, J. Chem. Phys. 83, 5013\n(1985).\nM. Shapiro and P. Brumer, J. Chem. Phys. 84, 4103\n(1986).\nD. J. Tannor, R. Kosloff and S. A. Rice, J. Chem. Phys.\n85, 5805 (1986).\nW. S. Warren, H. Rabitz and M. Dahleh, Science 259,\n1581 (1993).\nS. A. Rice, Science 258, 412 (1992).\nE. D. Potter et al., Nature 355, 66 (1992).\nB. Kohler et al., Phys. Rev. Lett. 74, 3360 (1995).\nA. Haché et al., Phys. Rev. Lett. 78, 306 (1997).\nR. N. Zare, Science 279, 1875 (1998).\nD. C. Clary, Science 279, 1879 (1998).\nA. M. Weiner et al., Science 247, 1317 (1990).\nD. Meshulach and Y. Silberberg, Nature 396, 239 (1998).\nD. Meshulach and Y. Silberberg, Phys. Rev. A 60, 1287\n(1999).\nA. M. Weiner and J. P. Heritage, Rev. Phys. Appl. 22,\n1619 (1987).\nA. M. Weiner et al., Opt. Lett. 15, 326 (1990).\nA. M. Weiner, Prog. Quantum Electron. 19, 161 (1995).\nR. S. Judson and H. Rabitz, Phys. Rev. Lett. 68, 1500\n(1992).\nA. Assion et al., Science 282, 919 (1998).\nR. Bartels et al., Nature (to be published).\nH. Rabitz et al., Science 288, 824 (2000).\n\n\f"}