{"id": "http://arxiv.org/abs/physics/0501025v1", "guidislink": true, "updated": "2005-01-06T16:06:44Z", "updated_parsed": [2005, 1, 6, 16, 6, 44, 3, 6, 0], "published": "2005-01-06T16:06:44Z", "published_parsed": [2005, 1, 6, 16, 6, 44, 3, 6, 0], "title": "Booster 6-GeV Study", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=physics%2F0501037%2Cphysics%2F0501145%2Cphysics%2F0501161%2Cphysics%2F0501044%2Cphysics%2F0501162%2Cphysics%2F0501020%2Cphysics%2F0501109%2Cphysics%2F0501149%2Cphysics%2F0501061%2Cphysics%2F0501039%2Cphysics%2F0501139%2Cphysics%2F0501082%2Cphysics%2F0501120%2Cphysics%2F0501047%2Cphysics%2F0501143%2Cphysics%2F0501117%2Cphysics%2F0501163%2Cphysics%2F0501045%2Cphysics%2F0501021%2Cphysics%2F0501095%2Cphysics%2F0501128%2Cphysics%2F0501022%2Cphysics%2F0501038%2Cphysics%2F0501053%2Cphysics%2F0501089%2Cphysics%2F0501007%2Cphysics%2F0501115%2Cphysics%2F0501004%2Cphysics%2F0501094%2Cphysics%2F0501140%2Cphysics%2F0501131%2Cphysics%2F0501164%2Cphysics%2F0501079%2Cphysics%2F0501144%2Cphysics%2F0501133%2Cphysics%2F0501081%2Cphysics%2F0501040%2Cphysics%2F0501119%2Cphysics%2F0501153%2Cphysics%2F0501060%2Cphysics%2F0501127%2Cphysics%2F0501059%2Cphysics%2F0501070%2Cphysics%2F0501035%2Cphysics%2F0501118%2Cphysics%2F0501006%2Cphysics%2F0501090%2Cphysics%2F0501014%2Cphysics%2F0501146%2Cphysics%2F0501033%2Cphysics%2F0501050%2Cphysics%2F0501154%2Cphysics%2F0501016%2Cphysics%2F0501121%2Cphysics%2F0501142%2Cphysics%2F0501111%2Cphysics%2F0501049%2Cphysics%2F0501104%2Cphysics%2F0501012%2Cphysics%2F0501101%2Cphysics%2F0501124%2Cphysics%2F0501122%2Cphysics%2F0501091%2Cphysics%2F0501084%2Cphysics%2F0501159%2Cphysics%2F0501062%2Cphysics%2F0501108%2Cphysics%2F0501042%2Cphysics%2F0501005%2Cphysics%2F0501068%2Cphysics%2F0501034%2Cphysics%2F0501137%2Cphysics%2F0501032%2Cphysics%2F0501019%2Cphysics%2F0501085%2Cphysics%2F0501098%2Cphysics%2F0501031%2Cphysics%2F0501106%2Cphysics%2F0501080%2Cphysics%2F0501064%2Cphysics%2F0501087%2Cphysics%2F0501151%2Cphysics%2F0501114%2Cphysics%2F0501052%2Cphysics%2F0501086%2Cphysics%2F0501043%2Cphysics%2F0501029%2Cphysics%2F0501112%2Cphysics%2F0501155%2Cphysics%2F0501057%2Cphysics%2F0501025%2Cphysics%2F0501096%2Cphysics%2F0501076%2Cphysics%2F0501078%2Cphysics%2F0501008%2Cphysics%2F0501027%2Cphysics%2F0501036%2Cphysics%2F0501148%2Cphysics%2F0501147%2Cphysics%2F0501065%2Cphysics%2F0501069&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Booster 6-GeV Study"}, "summary": "Since a wider aperture has been obtained along the Booster beam line, this\nopens the opportunity for Booster running a higher intensity beam than ever\nbefore. Sooner or later, the available RF accelerating voltage will become a\nnew limit for the beam intensity. Either by increasing the RFSUM or by reducing\nthe accelerating rate can achieve the similar goal. The motivation for the\n6-GeV study is to gain the relative accelerating voltage via a slower\nacceleration.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=physics%2F0501037%2Cphysics%2F0501145%2Cphysics%2F0501161%2Cphysics%2F0501044%2Cphysics%2F0501162%2Cphysics%2F0501020%2Cphysics%2F0501109%2Cphysics%2F0501149%2Cphysics%2F0501061%2Cphysics%2F0501039%2Cphysics%2F0501139%2Cphysics%2F0501082%2Cphysics%2F0501120%2Cphysics%2F0501047%2Cphysics%2F0501143%2Cphysics%2F0501117%2Cphysics%2F0501163%2Cphysics%2F0501045%2Cphysics%2F0501021%2Cphysics%2F0501095%2Cphysics%2F0501128%2Cphysics%2F0501022%2Cphysics%2F0501038%2Cphysics%2F0501053%2Cphysics%2F0501089%2Cphysics%2F0501007%2Cphysics%2F0501115%2Cphysics%2F0501004%2Cphysics%2F0501094%2Cphysics%2F0501140%2Cphysics%2F0501131%2Cphysics%2F0501164%2Cphysics%2F0501079%2Cphysics%2F0501144%2Cphysics%2F0501133%2Cphysics%2F0501081%2Cphysics%2F0501040%2Cphysics%2F0501119%2Cphysics%2F0501153%2Cphysics%2F0501060%2Cphysics%2F0501127%2Cphysics%2F0501059%2Cphysics%2F0501070%2Cphysics%2F0501035%2Cphysics%2F0501118%2Cphysics%2F0501006%2Cphysics%2F0501090%2Cphysics%2F0501014%2Cphysics%2F0501146%2Cphysics%2F0501033%2Cphysics%2F0501050%2Cphysics%2F0501154%2Cphysics%2F0501016%2Cphysics%2F0501121%2Cphysics%2F0501142%2Cphysics%2F0501111%2Cphysics%2F0501049%2Cphysics%2F0501104%2Cphysics%2F0501012%2Cphysics%2F0501101%2Cphysics%2F0501124%2Cphysics%2F0501122%2Cphysics%2F0501091%2Cphysics%2F0501084%2Cphysics%2F0501159%2Cphysics%2F0501062%2Cphysics%2F0501108%2Cphysics%2F0501042%2Cphysics%2F0501005%2Cphysics%2F0501068%2Cphysics%2F0501034%2Cphysics%2F0501137%2Cphysics%2F0501032%2Cphysics%2F0501019%2Cphysics%2F0501085%2Cphysics%2F0501098%2Cphysics%2F0501031%2Cphysics%2F0501106%2Cphysics%2F0501080%2Cphysics%2F0501064%2Cphysics%2F0501087%2Cphysics%2F0501151%2Cphysics%2F0501114%2Cphysics%2F0501052%2Cphysics%2F0501086%2Cphysics%2F0501043%2Cphysics%2F0501029%2Cphysics%2F0501112%2Cphysics%2F0501155%2Cphysics%2F0501057%2Cphysics%2F0501025%2Cphysics%2F0501096%2Cphysics%2F0501076%2Cphysics%2F0501078%2Cphysics%2F0501008%2Cphysics%2F0501027%2Cphysics%2F0501036%2Cphysics%2F0501148%2Cphysics%2F0501147%2Cphysics%2F0501065%2Cphysics%2F0501069&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Since a wider aperture has been obtained along the Booster beam line, this\nopens the opportunity for Booster running a higher intensity beam than ever\nbefore. Sooner or later, the available RF accelerating voltage will become a\nnew limit for the beam intensity. Either by increasing the RFSUM or by reducing\nthe accelerating rate can achieve the similar goal. The motivation for the\n6-GeV study is to gain the relative accelerating voltage via a slower\nacceleration."}, "authors": ["Xi Yang", "Charles M. Ankenbrandt", "William A. Pellico", "James Lackey", "Rene Padilla", "J. Norem"], "author_detail": {"name": "J. Norem"}, "author": "J. Norem", "arxiv_comment": "17 pages, 5 figures", "links": [{"href": "http://arxiv.org/abs/physics/0501025v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/physics/0501025v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "physics.acc-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.acc-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/physics/0501025v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/physics/0501025v1", "journal_reference": null, "doi": null, "fulltext": "FERMILAB-TM-2283-AD\n\nBooster 6-GeV Study\nXi Yang, Charles M. Ankenbrandt, William A. Pellico, James Lackey, and Rene Padilla\nFermi National Accelerator Laboratory\nBox 500, Batavia IL 60510\nJ. Norem\nArgonne National Laboratory\n9700 S. Cass Ave, Argonne, IL, 60439\n\nAbstract\nSince a wider aperture has been obtained along the Booster beam line, this opens the\nopportunity for Booster running a higher intensity beam than ever before. Sooner or\nlater, the available RF accelerating voltage will become a new limit for the beam\nintensity. Either by increasing the RFSUM or by reducing the accelerating rate can\nachieve the similar goal. The motivation for the 6-GeV study is to gain the relative\naccelerating voltage via a slower acceleration.\n\nIntroduction\nAfter the Booster-lattice distortion caused by the edge focusing of dogleg magnets in\nextraction sections of long 3 and long 13 was largely removed via the rearrangement of\nspacing the magnets out, one expects that a much wider aperture will be available for the\nacceleration of higher intensity Booster beams. Also, since the collimator has been\neffectively reducing the radiation loss (RL) after its installation, the chance that the RL\nbecomes the limit for the highest beam intensity (HBI) is very small. Sooner or later, the\nRF accelerating voltage (RFSUM) (VRF) from all the Booster RF stations,[1] especially at\nthe transition crossing (TC), will become a crucial factor for determining the HBI. The\n\n1\n\n\freason is because the effective accelerating voltage (Veff) is equal to the sum of two parts\n(Va and VL), and it is the accelerating voltage seen by the beam, as shown by eq.1.\nVeff =V a+VL\n\n(1)\n\n= VRF × sin(φ s ).\n\nHere, φs is the synchronous phase, which is the phase difference between the RFSUM\nand the centroid of the circulating beam bunch (CB).[2]\nVa is the accelerating voltage required by the rate of change of the Booster\nmagnetic field (dB/dt) in a cycle, and is independent of the beam intensity. VL is the\nbeam energy loss, which is caused by the real impedance of the ring, and is dependent\nupon the beam current.[3] The higher the beam current is, the higher the beam energy\nloss is. It is clear that Veff is limited by VRF. The HBI is achieved whenever VL reaches\nthe difference between VRF and Va in a cycle. From past experience in the normal 8-GeV\noperation, this usually happens at the TC when 'VRF -Va' reaches its minimum while VL\nreaches its peak value. This is because dB/dt reaches its peak at the TC, while the peak\ncurrent of the beam reaches its maximum as a result of the shortest bunch length.\nEither by increasing the RFSUM or by reducing the accelerating rate, the\nallowable energy loss, which is the difference between VRF and Va, will be increased, and\nalso the HBI should be increased. It is obvious that the maximum number of RF stations,\nwhich can be installed in Booster, together with the output of each station, constrain the\nupper limit of VRF. Another way of increasing 'VRF -Va' is to reduce Va via a slower\nacceleration, and this is the motivation for the 6-GeV study.\nExperimental Result and Analysis\nAll the relevant Booster ramps, which include the magnet ramp, the RF frequency ramp,\nthe bias ramp, etc., were rescaled to the 6-GeV acceleration. Also, some routine tunings,\nwhich include the injection tuning, RF curve tuning, quad ramp tuning, etc., had been\nperformed before Booster reached a standard running condition.\nAfterwards, for the purpose of finding the relationship between the phase jump at\nthe TC and the beam intensity, the synchronous phase detector was used to measure the\nφs right before the TC and right after the TC, and their difference gives the phase jump\n(∆φs). Here, the Linac beam was injected at 0 ms, and the TC gate was set at 20.7 ms.\n\n2\n\n\fThe same measurement was repeated for several extracted beam intensities and also at\ntwo different RFSUM curves, RFSUM 1 and RFSUM 2. The results were compared to\nthe data which were taken at the 8-GeV operation.[5]\n\nRFSUM 1, RFSUM 2, and\n\nRFSUM for the 8-GeV acceleration are shown as the black, red, and green curves in Fig.\n1(a) respectively. Their corresponding ∆φs vs. the extracted beam intensity and linear-fit\nresults are shown in Fig. 1(b). The operational region with extracted beam intensities,\nwhich are less than or equal to 6×1012 protons, is indicated by the red rectangular in Fig.\n1(b).\nThe accelerating voltages required by dB/dt for the 6-GeV acceleration and 8GeV acceleration are shown as the black and red curves in Fig. 2(a) respectively.[2] The\nsynchronous phase and RFSUM were measured at extracted beam intensities of 4.1×1012\nprotons, 3.6×1012 protons, 1.9×1012 protons, 0.35×1012 protons when Booster was\noperated at RFSUM 1, and they are shown in Figs. 2(b) and 2(c). And their effective\naccelerating voltages (Veff) per beam turn (BT), which were calculated using eq.1, are\nshown in Fig. 2(d). The black, red, green, and blue curves in each plot represent the\nresults for the several intensities from highest to lowest respectively. The magenta curve\nin Fig. 2(d) is the same with the black curve in Fig. 2(a). The intensity dependent part\n(IDP) of the Veff, which is equivalent to the IDP of the VL, can be estimated from\ndifferences between the black and blue curves, the red and blue curves, the green and\nblue curves in Fig. 2(d). Furthermore, by taking the difference, the error coming from the\noffset of signals VRF and φs can be minimized, and their differences are shown as the\nblack, red, and green curves in Fig. 2(e) respectively. The same procedure was applied to\nthe situation when Booster was operated at RFSUM 2. The Veff at extracted beam\nintensities of 4.7×1012 protons, 3.8×1012 protons, 2.1×1012 protons, and 0.39×1012 protons\nare shown as the black, red, green and blue curves in Fig. 2(f) respectively, and the\nmagenta curve is the same with the one in Fig. 2(d). Differences between the black and\nblue curves, the red and blue curves, the green and blue curves in Fig. 2(f) are shown as\nthe black, red, and green curves in Fig. 2(g). The IDP of VL in the RFSUM 1 situation, as\nshown in Fig. 2(d), are similar to those in the RFSUM 2 case, as shown in Fig. 2(g). This\nis what one expects, since there is an approximately linear relationship between the IDP\nof VL and the beam intensity. Unless when the CB gets too short or the shape of the\n\n3\n\n\fbunch is no longer smooth, high frequency components of the beam current couldn't be\nneglected any more.\nThe Veff difference between operations of RFSUM 1 and RFSUM 2 for the similar\nextracted beam intensity can give us some ideas of how to choose the optimal RFSUM\ncurve in a cycle. The smaller the Veff is, the less the effective VL is. The Veff differences\nbetween RFSUM 1 and RFSUM 2 at extracted beam intensities of 3.7×1012 protons and\n0.36×1012 protons are shown as the black and red curves in Fig. 3(a). It is clear that\nRFSUM 1 is better than RFSUM 2 before the TC and is worse after the TC. The green\ncurve with arrows in Fig. 3(b) indicates what the likely optimal RFSUM curve might be.\nAll data were taken under similar conditions with the extracted beam intensity\nabout 5.1×1012 protons when Booster was operated at RFSUM 2 of 6 GeV. The method\nfor determining the lower limit for RFSUM is to reduce it to the value at which the beam\nloss starts.[6] In the experiment, the RFSUM limit was measured at 3.5 ms, 6.5 ms, 9.5\nms, 12.5 ms, 15.5 ms, 18.5 ms, 21.5 ms, 24.5 ms, and 27.5 ms separately. The RFSUM,\nthe RFSUM limit, the Veff, and the Va are shown as the black, red, green, and blue curves\nrespectively in Fig. 4(a). The data at the 8-GeV operation for the similar beam intensity\nare shown in Fig. 4(b) for the purpose of comparison.[6] It is clear that in the 6-GeV\nacceleration, there are more RF voltages that are available for the compensation of the\nbeam energy loss, especially for the high intensity beam.\nRF bucket reduction for acquiring information about the particle distribution in\nlongitudinal phase space was applied for the extracted beam intensity of 4.3×1012\nprotons.[7] We chose eight points, 3.5 ms, 6.5 ms, 9.5 ms, 12.5 ms, 18.5 ms, 21.5 ms,\n24.5 ms, and 27.5 ms in a Booster cycle to do the measurement. At 3.5 ms, RFSUM was\nreduced to nine different values, as shown in Fig. 5(a), and their corresponding charges,\nwhich were left in the RF bucket, were recorded as Fig. 5(b). Also, the synchronous\nphase was recorded at three different RFSUM values, and they were used to find the\nrelationship between the RFSUM value and synchronous phase via the 2nd order\npolynomial fit, and the result is shown in Fig. 5(c). The RFSUM and the synchronous\nphase vs. charge are shown as the black and blue curves respectively in Fig. 5(d). Eq.2 is\nused to calculate the bucket area (A) in unit of eV×s.[8]\n\n4\n\n\fA=\n\ne ⋅ VRF ⋅ E s\n16 ⋅ β\n⋅\n⋅ α (φ s ).\n2 ⋅ π ⋅ f rf\n2 ⋅π ⋅ h ⋅ η\n\n(2)\n\nHere, β is the Lorentz's relativistic factor, frf is the RF frequency, η is the phase slip\nfactor, Es is the kinetic energy, h is the harmonic number of the rf frequency, e is the\nelectron charge, and α(φs) is the ratio of the bucket area with φs relative to the stationary\nbucket area (either φs=0°, or φs=180°).[8] The charge vs. bucket area is shown in Fig.\n5(e). The differentiation of the charge over the bucket area gives the charge density in\nthe bucket area, as shown in Fig. 5(f). The same procedure was applied for getting the\nrelationship between the charge density and the bucket area at the rest time of the cycle,\nand the results are shown in Figs. 5(g)-5(m). The charge-density fluctuation inside the\nbucket area appeared strongly right after the TC, as shown in Fig. 5(k), lasted till 24.5\nms, and was smoothed at 27.5 ms.\nComment\nThe effective accelerating voltage was reduced at the 6-GeV acceleration since the\naccelerating rate was reduced in the 6-GeV cycle compared to the 8-GeV cycle.\nHowever, the intensity-dependent part of the energy loss, or called the AC component of\nthe energy loss, does not vary significantly from 8-GeV acceleration to 6-GeV\nacceleration and from one RFSUM curve to another, as shown in Fig. 2(e) and Fig. 2(g).\nThe intensity-independent part of the energy loss, or called the DC component of the\nenergy loss, does depend upon the RFSUM curve, as shown in Fig. 3(a). So optimizing\nthe RFSUM curve still will be helpful for reducing the DC component of the energy loss.\nThe strong charge density fluctuation in the bucket right after the TC, which is likely\ncaused by the mismatch of the beam in the bucket before and after the TC, might be the\nintrinsic property of the Booster RF system, including LLRF and HLRF, and this only\ncan be fixed by upgrading the RF system or commissioning the γt jump system for the\npurpose of making the TC faster.\nAcknowledgement\nAuthors give special thanks to Craig Drennan for the instruction of how to use the new\nparaphrase module.\n\n5\n\n\fReferences:\n[1] X. Yang and J. MacLachlan, \"Implications of beam phase and RFSUM measured near\ntransition\", FERMILAB-TM-2238.\n[2] X. Yang and J. MacLachlan, \"Energy Loss Estimates at Several Beam Intensities in\nthe Fermilab Booster\", FERMILAB-TM-2244.\n[3] X. Yang, \"Numerical Reconstruction of the Linac Beam De-bunching in the DCoperated Booster\", FERMILAB-TM-2269.\n[4] X. Yang and R. Padilla, 'A Synchrotron Phase Detector for the Fermilab Booster\",\nFERMILAB-TM-2234.\n[5] X. Yang and J. MacLachlan, \"Applying Synchrotron Phase Measurement to the\nEstimation of Maximum Beam Intensity in the Fermilab Booster\", FERMILAB-TM-2231.\n[6] X. Yang, C. Ankenbrandt, and J. Norem, \"Experimental Estimate of Beam Loading\nand Minimum rf Voltage for Acceleration of High Intensity Beam in the Fermilab\nBooster\", FERMILAB-TM-2237.\n[7] X. Yang and C. Ankenbrandt, \"RF Bucket Reduction as an Experimental Tool for\nBeam Diagnostics and Manipulation\", FERMILAB-TM-2232.\n[8] D. A. Edwards and M. J. Syphers, An Introduction to the Physics of High Energy\nAccelerators, 1993, John Wiley & Sons, Inc.\n\n6\n\n\f1000\n900\n800\n\nRFSUM (kV)\n\n700\n600\n500\n\n6-GeV at RFSUM 1\n6-GeV at RFSUM 2\n8-GeV\n\n400\n300\n200\n100\n0\n0\n\n5\n\n10\n\n15\n\n20\n\n25\n\n30\n\nTime (ms)\nFig. 1(a)\n\n120\n\n6-GeV at RFSUM 1\n6-GeV at RFSUM 2\n8-GeV\n\n110\n100\n\n∆φs at TC (degree)\n\n90\n80\n70\n60\n50\n40\n30\n20\n\nOperational Region\n\n10\n0\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\n9\n\n10\n\n11\n\n12\n\nCharge at Extraction (e12)\nFig. 1(b)\n\nFig. 1(a) RFSUM 1 and RFSUM 2 for the 6-GeV acceleration and RFSUM for the 8GeV acceleration are shown as the black, red, and green curves respectively.\nFig. 1(b) their corresponding ∆φs vs. the extracted beam intensity of Fig. 1(a).\n\n7\n\n\f6G eV\n8G eV\n\n600\n\n500\n\nVa (kV)\n\n400\n\n300\n\n200\n\n100\n\n0\n0\n\n5\n\n10\n\n15\n\n20\n\n25\n\n30\n\nT im e ( m s )\nF ig . 2 ( a )\n\n180\n160\n140\n\nφs (degree)\n\n120\n100\n80\n60\n40\n20\n\n4.1 e1 2, 3.6 e1 2, 1.9 e1 2, 0.3 5e 12\n\n0\n0\n\n5\n\n10\n\n15\n\n20\n\n25\n\n30\n\nT im e (m s)\nF ig . 2 (b )\n\n1000\n\n900\n\nVRF (kV)\n\n800\n\n700\n\n600\n\n500\n\n4.1e12, 3.6e12, 1.9e12, 0.35e12\n400\n0\n\n5\n\n10\n\n15\n\n20\n\nTim e (m s)\nFig. 2(c)\n\n8\n\n25\n\n30\n\n\f6 G eV at R FSU M 1\n\n600\n\n500\n\nVeff (kV)\n\n400\n\n300\n\n200\n\n100\n\n4.1e12, 3.6e12,1.9e12, 0.35e12,\nVa\n\n0\n0\n\n5\n\n10\n\n15\n\n20\n\n25\n\n30\n\nTim e (m s)\nFig. 2(d)\n\n6 GeV at RFSUM 1\n\nV eff(4.1e12)-V eff(0.35e12)\nV eff(3.6e12)-V eff(0.35e12)\nV eff(1.9e12)-V eff(0.35e12)\n\n200\n\n∆Veff (kV)\n\n150\n\n100\n\n50\n\n0\n\n-50\n0\n\n5\n\n10\n\n15\n\n20\n\n25\n\n30\n\nTime (ms)\nFig. 2(e)\n\n600\n\n6GeV at RFSUM 2\n\n500\n\nVeff (kV)\n\n400\n\n300\n\n200\n\n100\n\n4.7e12, 3.8e12, 2.1e12, 0.39e12,\nV acc\n\n0\n0\n\n5\n\n10\n\n15\n\n20\n\nTim e (m s)\nFig. 2(f)\n\n9\n\n25\n\n30\n\n\f6 GeV at RFSUM 2\n\nVeff(4.7e12)-Veff(0.39e12)\nVeff(3.8e12)-Veff(0.39e12)\nVeff(2.1e12)-Veff(0.39e12)\n\n200\n\n∆Veff (kV)\n\n150\n\n100\n\n50\n\n0\n\n-50\n0\n\n5\n\n10\n\n15\n\n20\n\n25\n\n30\n\nTime (ms)\nFig. 2(g)\n\nFig. 2(a) the accelerating voltages required by dB/dt for the 6-GeV acceleration and 8GeV acceleration are shown as the black and red curves respectively.\nFig. 2(b) the synchronous phase vs. time in a cycle taken at extracted beam intensities of\n4.1×1012 protons (the black curve), 3.6×1012 protons (the red curve), 1.9×1012 protons\n(the green curve), 0.35×1012 protons (the blue curve).\nFig. 2(c) RFSUM vs. time.\nFig. 2(d) the effective accelerating voltage Veff vs. time.\nFig. 2(e) the Veff differences between the black and blue curves, the red and blue curves,\nthe green and blue curves in Fig. 2(d) are shown as the black, red, and green curves\nrespectively.\nFig. 2(f) Veff at extracted beam intensities of 4.7×1012 protons, 3.8×1012 protons, 2.1×1012\nprotons, and 0.39×1012 protons are shown as the black, red, green and blue curves\nrespectively when Booster operated at RFSUM 2.\nFig. 2(g) the Veff differences between the black and blue curves, the red and blue curves,\nthe green and blue curves in Fig. 2(f) are shown as the black, red, and green curves\nrespectively.\n\n10\n\n\f150\n\n3.7e12, 0.36e12\n\n100\n\n∆Veff (kV)\n\n50\n\n0\n\n-50\n\n-100\n0\n\n5\n\n10\n\n15\n\n20\n\n25\n\n30\n\nTime (ms)\nFig. 3(a)\n\n1000\n\n6-GeV at RFSUM 1\n\n900\n800\n\n6-GeV at RFSUM 2\n\n700\n\nVRF (kV)\n\n600\n500\n400\n\nBefore TC\n\n300\n\nAfter TC\n\n200\n100\n0\n0\n\n5\n\n10\n\n15\n\n20\n\n25\n\n30\n\nTime (ms)\nFig. 3(b)\n\nFig. 3(a) the Veff differences between RFSUM 1 and RFSUM 2 at extracted beam\nintensities of 3.7×1012 protons and 0.36×1012 protons are shown as the black and red\ncurves respectively.\nFig. 3(b) RFSUM 1 and RFSUM 2 are shown as the black and red curves separately. The\ngreen curve indicates where the optimal RFSUM curve might be.\n\n11\n\n\f1000\n\n6 GeV\n\nRFSUM\nRFSUM limit\nV*Sin(φs)\nVa\n\n900\n800\n\nRF Voltage (kV)\n\n700\n600\n500\n400\n300\n200\n100\n0\n0\n\n5\n\n10\n\n15\n\n20\n\n25\n\n30\n\nTime (ms)\nFig. 4(a)\n\n1000\n\nRFSUM\nRFSUM limit\nV*Sin(φs)\nVa\n\n8 GeV\n\n900\n800\n\nRF Voltage (KV)\n\n700\n600\n500\n400\n300\n200\n100\n0\n0\n\n5\n\n10\n\n15\n\n20\n\n25\n\n30\n\n35\n\nTime (ms)\nFig. 4(b)\n\nFig. 4(a) the black curve represents RFSUM in a Booster cycle, the red curve represents\nthe lower limit for RFSUM, the green curve represents the effective accelerating voltage,\nand the blue curve represents the accelerating voltage required by the magnet ramp, all\ndata were taken under closely similar conditions at the extracted beam intensity of\n5.1×1012 protons when Booster was operated at the 6 GeV.\nFig. 4(b) the same situation with Fig. 4(a), except the data were taken when Booster was\noperated at the 8 GeV.\n\n12\n\n\fFig. 5(a)\n\nFig. 5(b)\n80\n\n3 .5 m s\n\n70\n\n50\n\ns\n\nφ (degree)\n\n60\n\n40\n\n30\n\n200\n\n300\n\n400\n\n500\n\nV R F (k V )\nF ig . 5 ( c )\n\n13\n\n600\n\n700\n\n800\n\n\f68\n\n3.5 m s\n\n700\n\n64\n\n600\n\n60\n\n500\n\n56\n\n44\n\n200\n\n40\n36\n\n100\n\n32\n0\n0 .0\n\n0 .5\n\n1.0\n\n1 .5\n\n2.0\n\n2 .5\n\n3.0\n\n3 .5\n\n4 .0\n\n4 .5\n\n5 .0\n\nC h a rg e (e 1 2 )\nF ig . 5 (d )\n\n5\n\n3 .5 m s\n\nCharge (e12)\n\n4\n\n3\n\n2\n\n1\n\n0\n0 .0 0 0\n\n0 .0 0 5\n\n0 .0 1 0\n\n0 .0 1 5\n\n0 .0 2 0\n\n0 .0 2 5\n\n0 .0 3 0\n\n0 .0 3 5\n\nB u c k e t A re a (e V *s )\nF ig . 5 ( e )\n\n500\n\n3 .5 m s\n\n400\n\ndNp/dA (e12/eV*s)\n\nVRF (kV)\n\n48\n300\n\n300\n\n200\n\n100\n\n0\n0.000\n\n0.005\n\n0.010\n\n0.015\n\n0.020\n\n0.025\n\nB ucket A rea (e V *s)\nF ig . 5 (f)\n\n14\n\n0.030\n\n0.035\n\nφs (degree)\n\n52\n400\n\n\f350\n\n6.5 m s\n\n300\n\ndNp/dA (e12/eV*s)\n\n250\n\n200\n\n150\n\n100\n\n50\n\n0\n0.000\n\n0.005\n\n0.010\n\n0.015\n\n0.020\n\n0.025\n\n0.030\n\n0.035\n\n0.040\n\nB ucket A rea (eV *s)\nF ig. 5(g)\n\n250\n\n9 .5 m s\n\ndNp/dA (e12/eV*s)\n\n200\n\n150\n\n100\n\n50\n\n0\n0.00\n\n0.01\n\n0.02\n\n0.03\n\n0.04\n\n0.05\n\n0.06\n\nB ucket A rea (e V *s)\nF ig . 5 (h )\n\n200\n\n1 2 .5 m s\n\n180\n160\n\ndNp/dA (e12/eV*s)\n\n140\n120\n100\n80\n60\n40\n20\n0\n0 .0 0\n\n0 .0 1\n\n0 .0 2\n\n0 .0 3\n\n0 .0 4\n\nB u c k e t A re a (e V *s )\nF ig . 5 (i)\n\n15\n\n0 .0 5\n\n0 .0 6\n\n0 .0 7\n\n\f200\n\n1 8 .5 m s\n\ndNp/dA (e12/eV*s)\n\n150\n\n100\n\n50\n\n0\n0 .0 0\n\n0 .0 5\n\n0 .1 0\n\n0 .1 5\n\n0 .2 0\n\nB u cke t A re a (e V *s)\nF ig . 5 (j)\n\n35\n\n2 1 .5 m s\n30\n\ndNp/dA (e12/eV*s)\n\n25\n\n20\n\n15\n\n10\n\n5\n\n0\n0.0\n\n0.1\n\n0.2\n\n0.3\n\n0.4\n\nB ucket A rea (e V *s)\nF ig . 5 (k)\n\n100\n\n24.5 m s\n\ndNp/dA (e12/eV*s)\n\n80\n\n60\n\n40\n\n20\n\n0\n0.00\n\n0.05\n\n0.10\n\n0.15\n\nBucket Area (eV*s)\nFig. 5(l)\n\n16\n\n0.20\n\n0.25\n\n\f27.5 ms\n\ndNp/dA (e12/eV*s)\n\n400\n\n300\n\n200\n\n100\n\n0\n0.0\n\n0.1\n\n0.2\n\n0.3\n\n0.4\n\nBucket Area (eV*s)\nFig. 5(m)\n\nFig. 5(a) at 3.5 ms, RFSUM was reduced to nine different values.\nFig. 5(b) the corresponding charge signal of Fig. 5(a).\nFig. 5(c) φs vs. VRF at 3.5 ms.\nFig. 5(d) VRF and φs vs. charge at 3.5 ms are shown as the black and blue curves\nrespectively.\nFig. 5(e) the charge vs. bucket area at 3.5 ms.\nFig. 5(f) the charge density vs. bucket area at 3.5 ms.\nFig. 5(g) the charge density vs. bucket area at 6.5 ms.\nFig. 5(h) the charge density vs. bucket area at 9.5 ms.\nFig. 5(i) the charge density vs. bucket area at 12.5 ms.\nFig. 5(j) the charge density vs. bucket area at 18.5 ms.\nFig. 5(k) the charge density vs. bucket area at 21.5 ms.\nFig. 5(l) the charge density vs. bucket area at 24.5 ms.\nFig. 5(m) the charge density vs. bucket area at 27.5 ms.\n\n17\n\n\f"}