{"id": "http://arxiv.org/abs/physics/0305095v1", "guidislink": true, "updated": "2003-05-21T16:26:53Z", "updated_parsed": [2003, 5, 21, 16, 26, 53, 2, 141, 0], "published": "2003-05-21T16:26:53Z", "published_parsed": [2003, 5, 21, 16, 26, 53, 2, 141, 0], "title": "Visualizing the Mass and Width Spectrum of Unstable Particles", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=physics%2F0506231%2Cphysics%2F0506013%2Cphysics%2F0506044%2Cphysics%2F0506064%2Cphysics%2F0506060%2Cphysics%2F0506042%2Cphysics%2F0506134%2Cphysics%2F0506228%2Cphysics%2F0506180%2Cphysics%2F0506014%2Cphysics%2F0506067%2Cphysics%2F0506136%2Cphysics%2F0506198%2Cphysics%2F0506080%2Cphysics%2F0506065%2Cphysics%2F0506165%2Cphysics%2F0506139%2Cphysics%2F0506108%2Cphysics%2F0506216%2Cphysics%2F0506025%2Cphysics%2F0506218%2Cphysics%2F0506087%2Cphysics%2F0305051%2Cphysics%2F0305111%2Cphysics%2F0305088%2Cphysics%2F0305130%2Cphysics%2F0305034%2Cphysics%2F0305118%2Cphysics%2F0305089%2Cphysics%2F0305052%2Cphysics%2F0305087%2Cphysics%2F0305071%2Cphysics%2F0305063%2Cphysics%2F0305090%2Cphysics%2F0305129%2Cphysics%2F0305076%2Cphysics%2F0305045%2Cphysics%2F0305054%2Cphysics%2F0305003%2Cphysics%2F0305061%2Cphysics%2F0305092%2Cphysics%2F0305123%2Cphysics%2F0305099%2Cphysics%2F0305037%2Cphysics%2F0305068%2Cphysics%2F0305135%2Cphysics%2F0305106%2Cphysics%2F0305083%2Cphysics%2F0305124%2Cphysics%2F0305122%2Cphysics%2F0305137%2Cphysics%2F0305074%2Cphysics%2F0305114%2Cphysics%2F0305032%2Cphysics%2F0305049%2Cphysics%2F0305030%2Cphysics%2F0305066%2Cphysics%2F0305014%2Cphysics%2F0305025%2Cphysics%2F0305001%2Cphysics%2F0305097%2Cphysics%2F0305055%2Cphysics%2F0305029%2Cphysics%2F0305036%2Cphysics%2F0305031%2Cphysics%2F0305133%2Cphysics%2F0305128%2Cphysics%2F0305078%2Cphysics%2F0305056%2Cphysics%2F0305019%2Cphysics%2F0305046%2Cphysics%2F0305113%2Cphysics%2F0305119%2Cphysics%2F0305096%2Cphysics%2F0305077%2Cphysics%2F0305033%2Cphysics%2F0305009%2Cphysics%2F0305094%2Cphysics%2F0305053%2Cphysics%2F0305004%2Cphysics%2F0305132%2Cphysics%2F0305105%2Cphysics%2F0305015%2Cphysics%2F0305022%2Cphysics%2F0305107%2Cphysics%2F0305121%2Cphysics%2F0305073%2Cphysics%2F0305098%2Cphysics%2F0305120%2Cphysics%2F0305126%2Cphysics%2F0305091%2Cphysics%2F0305127%2Cphysics%2F0305131%2Cphysics%2F0305043%2Cphysics%2F0305109%2Cphysics%2F0305110%2Cphysics%2F0305095%2Cphysics%2F0305023%2Cphysics%2F0305136%2Cphysics%2F0305115%2Cphysics%2F0305007&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Visualizing the Mass and Width Spectrum of Unstable Particles"}, "summary": "Several graphical representations of the mass and width spectrum of unstable\nsubatomic particles are presented. Such plots are useful tools for introducing\nstudents to the particle zoo and provide students an alternate way to organize\nconceptually what can seem like an overwhelming amount of data. In particular,\nsuch graphs highlight phenomenological features of unstable particles\ncharacteristic of different energy and time scales.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=physics%2F0506231%2Cphysics%2F0506013%2Cphysics%2F0506044%2Cphysics%2F0506064%2Cphysics%2F0506060%2Cphysics%2F0506042%2Cphysics%2F0506134%2Cphysics%2F0506228%2Cphysics%2F0506180%2Cphysics%2F0506014%2Cphysics%2F0506067%2Cphysics%2F0506136%2Cphysics%2F0506198%2Cphysics%2F0506080%2Cphysics%2F0506065%2Cphysics%2F0506165%2Cphysics%2F0506139%2Cphysics%2F0506108%2Cphysics%2F0506216%2Cphysics%2F0506025%2Cphysics%2F0506218%2Cphysics%2F0506087%2Cphysics%2F0305051%2Cphysics%2F0305111%2Cphysics%2F0305088%2Cphysics%2F0305130%2Cphysics%2F0305034%2Cphysics%2F0305118%2Cphysics%2F0305089%2Cphysics%2F0305052%2Cphysics%2F0305087%2Cphysics%2F0305071%2Cphysics%2F0305063%2Cphysics%2F0305090%2Cphysics%2F0305129%2Cphysics%2F0305076%2Cphysics%2F0305045%2Cphysics%2F0305054%2Cphysics%2F0305003%2Cphysics%2F0305061%2Cphysics%2F0305092%2Cphysics%2F0305123%2Cphysics%2F0305099%2Cphysics%2F0305037%2Cphysics%2F0305068%2Cphysics%2F0305135%2Cphysics%2F0305106%2Cphysics%2F0305083%2Cphysics%2F0305124%2Cphysics%2F0305122%2Cphysics%2F0305137%2Cphysics%2F0305074%2Cphysics%2F0305114%2Cphysics%2F0305032%2Cphysics%2F0305049%2Cphysics%2F0305030%2Cphysics%2F0305066%2Cphysics%2F0305014%2Cphysics%2F0305025%2Cphysics%2F0305001%2Cphysics%2F0305097%2Cphysics%2F0305055%2Cphysics%2F0305029%2Cphysics%2F0305036%2Cphysics%2F0305031%2Cphysics%2F0305133%2Cphysics%2F0305128%2Cphysics%2F0305078%2Cphysics%2F0305056%2Cphysics%2F0305019%2Cphysics%2F0305046%2Cphysics%2F0305113%2Cphysics%2F0305119%2Cphysics%2F0305096%2Cphysics%2F0305077%2Cphysics%2F0305033%2Cphysics%2F0305009%2Cphysics%2F0305094%2Cphysics%2F0305053%2Cphysics%2F0305004%2Cphysics%2F0305132%2Cphysics%2F0305105%2Cphysics%2F0305015%2Cphysics%2F0305022%2Cphysics%2F0305107%2Cphysics%2F0305121%2Cphysics%2F0305073%2Cphysics%2F0305098%2Cphysics%2F0305120%2Cphysics%2F0305126%2Cphysics%2F0305091%2Cphysics%2F0305127%2Cphysics%2F0305131%2Cphysics%2F0305043%2Cphysics%2F0305109%2Cphysics%2F0305110%2Cphysics%2F0305095%2Cphysics%2F0305023%2Cphysics%2F0305136%2Cphysics%2F0305115%2Cphysics%2F0305007&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Several graphical representations of the mass and width spectrum of unstable\nsubatomic particles are presented. Such plots are useful tools for introducing\nstudents to the particle zoo and provide students an alternate way to organize\nconceptually what can seem like an overwhelming amount of data. In particular,\nsuch graphs highlight phenomenological features of unstable particles\ncharacteristic of different energy and time scales."}, "authors": ["N. L. Harshman"], "author_detail": {"name": "N. L. Harshman"}, "author": "N. L. Harshman", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1119/1.1586264", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/physics/0305095v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/physics/0305095v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "16 pages, 5 figures, accepted by Am. J. Phys., higher quality figures\n  will appear in that publication and web address for color figures will appear\n  shortly", "arxiv_primary_category": {"term": "physics.ed-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.ed-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/physics/0305095v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/physics/0305095v1", "journal_reference": "Am. J. Phys. 71 (2003), 984-989", "doi": "10.1119/1.1586264", "fulltext": "arXiv:physics/0305095v1 [physics.ed-ph] 21 May 2003\n\nVisualizing the Mass and Width Spectrum of Unstable\nParticles\nN.L. Harshman\nFormerly: Department of Physics and Astronomy\nRice University\nHouston, TX\nCurrently: Department of Computer Science, Audio Technology and Physics\nAmerican University\nWashington, DC\nAugust 22, 2018\nAbstract\n\nSeveral graphical representations of the mass and width spectrum of unstable\nsubatomic particles are presented. Such plots are useful tools for introducing\nstudents to the particle zoo and provide students an alternate way to organize\nconceptually what can seem like an overwhelming amount of data. In particular,\nsuch graphs highlight phenomenological features of unstable particles characteristic of different energy and time scales.\n\n1\n\nIntroduction\n\nWhen confronting the vast array of subatomic particles detected and created in particle\nphysics experiments, new students (and old researchers) may become overwhelmed with the\n1\n\n\fvolume of descriptive information. The purpose of this note is to present a visual tool to\nsupplement other schemes used to organize the diversity of unstable particles. The idea is\nsimple: what does a plot of width versus mass of subatomic particles look like and what\ninformation does it convey about the kinematics and dynamics of these particles? I hope\nthat instructors of particle physics may find it useful when introducing new visitors to the\nparticle zoo and that practitioners may find an alternate perspective stimulating.\nThe most useful feature of these graphs is not that they summarize information about\nthe spectrum or structure of unstable particles, but that they highlight the distinctions\nbetween the phenomenological signatures of unstable particles at different energy and time\nscales. These graphs provide a natural way of grouping together particles, not by their\nphysical content, but by how they are produced, how they decay, and how their characteristic\nparameters are measured. This alternate taxonomy distinguishes three classes of unstable\nparticles: decaying states, which decay via the weak interaction and whose exponential decay\nrate can be measured, resonance states, which decay primarily through the strong interaction\nand are measured as features in the cross section, and a middle class of \"platypus\" states,\nwhose instability parameters require more subtle measurements to determine. Also, these\ngraphs can be used to call attention to how the limitations and prejudices of past experiments\naffect what is known about the mass and width spectrum of particles.\n\n2\n\nWhich Unstable Particles?\n\nFigure 1 depicts the mass M and width Γ of 139 unstable particles, with mass plotted\nlogarithmically on the horizontal axis and width plotted logarithmically vertically. The\nshape of each plotted point indicates the type of particle it is (gauge boson, e.g.) and for\nthe hadrons the style (black, gray, or hollow) indicates some information about the quark\ncontent.\nThe data for the 139 unstable particles come from the 2002 edition of The Review of Particle Physics [1], and in particular the list of well-known, reasonably well-measured unstable\nparticles from the \"Summary Tables of Particle Properties\" therein. Not every particle in\nthe \"Summary Table\" has been included; only those particles found in the file [2] that the\nParticle Data Group tabulates, of the mass and width data, for use in Monte Carlo event\ngenerators and detector simulators. For unstable particles whose lifetimes τ are quoted in\nthe Review [1] and not their widths, the width values in the Monte Carlo file are found using\nthe Weisskopf-Wigner relation Γ = ~/τ (more will be said about this later).\nThe list of particles from the Monte Carlo file [2] has been modified and applied in the\nfollowing way in Fig. 1 and subsequent figures:\n1. The stable particles, the proton, electron, photon and neutrinos, are excluded.\n2\n\n\f2. The nearly-stable neutron is neglected for reasons of scale.\n3. The Monte Carlo file includes some particles for which only an upper bound of the\nwidth has been measured. They have been excluded. Examples include some light\nunflavored meson resonances like the f0 (980), other meson resonances such as the Ds∗±\nand χb0 (1P ), and a few baryon resonances like the Σc (2520)+ .\n4. The top quark, not truly an independent particle like the others in the list, is not\nincluded.\n5. The symbol plotted for a particle also represents its antiparticle, except for the neutral\nK-mesons. For these, the mass eigenstates KS0 and KL0 are plotted instead of the flavor\neigenstates K 0 and K̄ 0 .\n6. A single symbol is plotted for all different charge-species of a baryon unless different\nmasses for different charges have been measured. For example, each point representing\na ∆ baryon represents all four charge species {++, +, 0, −} corresponding to quark\ncontents {uuu, uud, udd, ddd}.\nThen what unstable particles are included? The weak gauge bosons W and Z are at the\nhigh energy extreme and the muon is at the low energy extreme. The other unstable lepton,\nthe tau, is in the middle, along with a host of hadrons made up of five out of the six quarks:\nup, down, strange, charm and bottom. While the gauge bosons and leptons are to our best\nknowledge structureless; the hadrons are composite. Subsequent references to particles refer\njust to this set of well-established, well-measured unstable particles, and therefore should not\nbe taken to refer to all possible particles that have or have not been observed or theorized.\nLooking at Figure 1, it may be tempting to ask if there is a functional dependence of\nthe width on the mass. In principle the widths of unstable particles are calculable from the\nmasses of the quarks and leptons and other Standard Model parameters, although in practice\nsuch calculations are difficult or impossible, especially for hadrons. For the purposes of this\narticle, the width and mass are considered independent phenomenological parameters to be\ndetermined from experiment.\nFigure 1 does make apparent the general trend of increasing width with increasing mass,\nwhich is explained by phase space effects. The decay rate is roughly proportional to the\nphase space of the decay products and the more massive the unstable particle, the more\ndecay channels are available.\nTo better elucidate the properties of the scattered distribution in Figure 1, several other\npartitions or sections of the data are included below. Figure 2 plots the masses of the 139\nunstable particles in order of increasing mass, i.e. in rank order from the least massive to\n3\n\n\fthe most massive. Figure 3 is similar, except it plots them in rank order of increasing width.\nFigure 4 plots the unitless ratio of width to mass in increasing order. These different graphs\ngive further clues about the structure of the mass and width spectrum and how to identify\nphenomenologically-similar groups of unstable particles.\n\n3\n\nMass Spectrum\n\nA striking feature of Figure 1 is that while the widths run over a range of 18 orders of magnitude, the masses are constrained within three decades, with most of them between 1 GeV\nand 10 GeV. This fact says more about the types of experiments that have been performed\nthan about the \"essential nature\" of the mass spectrum. Far more particle searches have\nfocussed on this energy range for a variety of historical and practical reasons.\nAnother perspective on the mass spectrum can be gained from Figure 2. Qualitatively,\ngaps in the plot indicate how quark composition affects (and effects) the mass spectrum of\nhadrons. For example, at the low end, twelve of the first thirteen points are mesons consisting\nof the three light quarks: up, down and strange. The non-meson among the thirteen is the\nmuon, the lightest unstable particle, which historically was mistaken for a meson. The twelve\nmesons have masses less than the lightest (undepicted) baryons, the proton and neutron at\nabout 940 MeV. There is a gap between the first three points, which represent the muon,\nπ 0 and π ± , and the next set, which include the lightest mesons composed of strange quarks,\nthe K ± , KS0 , KL0 and η.\nAt the high end of the mass spectrum, except for the gauge bosons, the points are\ndominated by hadrons containing heavy quarks. The lightest hadron containing a charm\nquark, the D 0 , is eighty-fifth on the list with a mass of 1865 MeV and the lightest hadrons\ncontaining a bottom quark are the B-mesons B ± and B 0 with ranks of 127 and 128 and\nmasses of 5279 MeV. Similar to the strange quark mass threshold jump seen at the lower\nenergies, here there are slight jumps at 117, the lightest particle with two charm quarks ηc ,\nat 127, the lightest particle with one bottom quark B ± , and at 132, the lightest particle with\ntwo bottom quarks Υ(1S).\nThe fact that above number 109 all points represent hadrons containing charm or bottom\nquarks does not mean that unstable particles containing only light quarks are not found in\nthis mass range. It only indicates that such resonances have not been the focus of experimental searches in that energy range. Also, at such high energies production of light mesons\nis so copious that wide, light-meson resonances get lost in the background.\nFinally, the true heavy-weights, the gauge bosons, with masses near 100 GeV, stand alone\nat the far sides of Figure 1 and Figure 2. Their isolation is again an artifact of experimental\nparticle physics history, not of some fundamental nature of the mass spectrum of particles.\n4\n\n\fTo make precise measurements of these particles entailed building experiments with far more\nenergy and at a far greater cost. To better explore the physics at this scale and to search\nfor potentially heavier particles such as the Higgs boson will require the next generation of\nparticle accelerators.\n\n4\n\nWidth Spectrum\n\nUnlike the mass spectrum, the width spectrum (i.e., the plot of the widths of the 139 unstable\nparticles in increasing order) depicted in Figure 3 is not as dependent on the energy scales\nof experiments that have been performed. Figure 3 spans many decades of the width, and\neven the most massive particles can have very small or very large widths. For example, the\nΛb baryon, with mass and width (5.62 GeV, 5.36 × 10−13 GeV), has a mass rank of 130 out of\n139, but a width rank of 15. It is considered unlikely that we will discover any more stable\nor extremely long-lived subatomic particles, so future discoveries will likely either fit into\nthis graph or, perhaps for new ultra-massive particles like the Higgs boson, be appended to\nthe end, beyond the gauge bosons. Therefore the shape of this graph is unlikely to change\nmuch as unstable particles are added, whereas new particle discoveries will probably smooth\nout the high energy, quark-mass threshold gaps in the mass spectrum Figure 2.\nLooking at Figure 3, it seems natural to roughly break the graph into three parts: particles\nwith widths Γ < 10−8 MeV, 10−5 MeV < Γ < 10 MeV, and Γ > 10 MeV. This division\nbecomes even more sensible when Figure 4, which lists the particles in order of the widthto-mass ratio Γ/M, is considered. The first 40 particles in both Figures 3 and 4 have nearly\nthe same order; only after that is there a substantial reshuffling. In Figure 4 a heuristic\ndivision between nearly the same three classes of particles could be made at Γ/M < 10−10 ,\n10−8 < Γ/M < 10−2.5 and Γ/M > 10−2.5.\n\n4.1\n\nFirst Class: Decaying States\n\nThe interesting thing about these classes is that they have physical significance. In Figure 1,\nthis first class of particles is the arc of leptons, mesons and baryons along the lower part of\nthe graph. From the point of view of fundamental interactions, what these particles have in\ncommon is that they decay via the weak interaction, and consequently they are long-lived.\nLong-lived is of course a relative term, but widths Γ < 10−8 MeV correspond to lifetimes\nτ > 10−14 s. In terms of phenomenology, that means for particles in this first class the\nexponential decay rate can be measured directly. This measurement involves finding the\ndistance traveled between the production location and the decay vertex. This information,\ncombined with kinematic information of mass, momentum, energy and/or speed, can be\n5\n\n\fused to find the time-of-flight in the rest frame of the particle. A histogram of all the\ntime-of-flights for a certain particle type can be fit to an exponential to get the lifetime.\nLong life makes this first class seem like the most \"particle-like\" of all the unstable\nparticles. In many calculations they can be approximated as stable because they are stable\nwith respect to the much shorter time scales dictated by the strong and electromagnetic\ninteractions. Their width/mass ratios Γ/M are so small that any mass uncertainty can be\nneglected in kinematic calculations.\n\n4.2\n\nThird Class: Resonances\n\nIn contrast, particles in the third class have widths Γ > 10 MeV, corresponding to particles\nwith lifetimes τ < 10−22 , and to a width-to-mass ratio Γ/M greater than a part in a thousand. Because of this mass uncertainty, they can be produced in experiments with energies\nsubstantially lower or higher than their central (quoted) mass value. This class of particles decays primarily through strong interactions and the vast lifetime difference separating\nthem from the first class is attributable to the strength of the strong interaction and the\nmassiveness of the weak gauge bosons.\nIt may seem unjustified to consider these short-lived unstable particles as the same kind\nof object as long-lived unstable particles, so vast are the differences in their instability parameters. The distinction between these two classes is sometimes codified in the language\nof particle physics: the long-lived particles are called decaying states and the short-lived are\ncalled resonances. This distinction arises because of the different ways that decaying states\nand resonances are observed experimentally.\nParticle resonances are detected as rapid variations (usually peaks) in the cross section.\nAs the center-of-mass energy of a collision is scanned over some range, there may appear an\nenhancement of the elastic cross section or the cross section into a particular set of inelastic\nchannels. After extracting the background and accounting for uncertainties in the preparation and detection apparatuses and other effects (such as radiative corrections), the resonant\ncross section σR as a function of center-of-mass energy (or center-of-mass energy squared s)\ncan be extracted. This process can become more complicated if there are multiple resonances\nin the same energy region, interfering resonances, or background-resonance interference.\nNeglecting these complications, the resonance cross section σR (or resonance lineshape or\nlinewidth) can be fit to a theoretical function and the mass and width extracted. Typically,\nthe function used is the Breit-Wigner or Lorentzian function, which can be parameterized\nin terms of mass and width as\n1\nσ(s) ∝\ns − (M − iΓ/2)2\n6\n\n2\n\n,\n\n(1)\n\n\for by several other parameterizations. This functional form for the resonance lineshape can\nbe derived by associating the resonance to a pole in the scattering S-matrix [3, 4]. Alternate functions exist; for example, in perturbative quantum field theory, the on-mass shell\nrenormalization scheme leads to a different definition for mass and width (for a discussion\nof this as applied to the Z-boson, see [5]). For some resonances, such as the ∆ baryons,\nthe Review [1] cites values for mass and width corresponding to both the Breit-Wigner and\nperturbation theory definitions.\nTo measure the resonance cross section accurately and to extract a value for mass and\nwidth, whichever function and parameterization are used, requires experimental energy resolution precise enough to trace out the lineshape. Practically, this means the energy resolution\nshould be smaller than the ratio Γ/M for that particular resonance. As a result, the lineshapes of particles in the first class, with Γ/M < 10−10 , cannot be measured in this way.\nMeasurements of width and lifetime are physically very distinct processes that apply to\nphenomena at very different energy scales.\nThe width and lifetime of a particle are related theoretically by the Weisskopf-Wigner\nformula τ = ~/Γ, which was originally proposed in the context of atomic electronic lineshapes [6]. This relation is considered so standard as to appear to be a definition or identity\nor direct consequence of the uncertainty principle, but to the best knowledge of this author, this relationship has never been verified experimentally in the regime of subatomic\nphysics [7]. The Wigner-Weisskopf relation between the width and decay rate or inverse\nlifetime Γ/~ is derived as an approximation in non-relativistic scattering in many textbooks\n(for example [3, 11]), and can be proven identically in the non-relativistic and relativistic\ncase for the mathematical object called a Gamow vector [12].\n\n4.3\n\nMiddle Class: Troublemakers\n\nThe middle class of particles on the chart, with widths roughly between 10−5 MeV < Γ < 10\nMeV and width-to-mass ratios 10−8 < Γ/M < 10−2.5, are awkwardly placed from an experimental point of view. Their lifetimes are so short that direct measurement of exponential\ndecay is extremely difficult or impossible; their widths are so narrow that few experiments\nhave the energy resolution to accurately trace their lineshape. While the middle class is easily distinguishable from the decaying states in Figure 1, they blend into the bottom of the\nresonance states. There is no clear gap characteristic of the difference in strength between\nelectromagnetically- and strongly-decaying states.\nPhysically, what do states in this middle class have in common? Some of these states\nhave substantial branching ratios into electromagnetic decay channels like the π 0 and Σ0\nand do not decay via the strong interaction. Some, like the D ∗ (2020)± are barely above\nthe energy threshold of for their primary decay channels and their decays are therefore\n7\n\n\fphase-space suppressed. All the mesons in this class (except the D ∗ (2020)± ) are unflavored,\ni.e. composed of quarks and antiquarks of the same flavor (or superpositions of same-flavor\nquark/antiquark pairs) and are not energetic enough to decay into strongly-favored channels.\nNeither decaying states nor resonances by the definitions described above, how are the\nwidths of these states measured? Below, the experimental determinations of some of these\nparticles' widths are described to give a flavor for some of the other tools at the disposal of\nparticle physicists.\n• With a lifetime of (8.4±0.6)×10−17 s, the exponential decay rate of the π 0 is very hard\nto measure. The π 0 decays almost exclusively into a pair of photons via the electromagnetic interaction. A precision experiment by Atherton, et al. [13], fit an exponential to\nthree data points extracted from the distance between the production and the decay of\nthe π 0 into two photons. The measurement agrees (within error) with another method\nused to measure widths and lifetimes: the Primakoff effect [14]. Bombarding heavy\nnuclei with gamma rays, an interaction between the incoming photon and a virtual\nphoton can produce the π 0 ; this process is called photo-production. One can measure\nthe cross section for this process and relate it theoretically via the transition amplitude\nto the partial width or decay rate Γ2γ for the process π 0 → γγ. From this, the total\nwidth is determined by dividing the partial width Γ2γ by the independently-measurable\nbranching ratio B2γ into the two photon decay channel, i.e., Γ = Γ2γ /B2γ .\n• The Primakoff effect has also been used to measure the lifetime of the Σ0 baryon as\n(7.4 ± 0.7) × 10−20 s. The Σ0 decays almost exclusively to Λγ.\n• For the cc̄ resonances J/ψ and ψ(2S) and the bb̄ resonances Υ(1S), Υ(2S) and Υ(3S)\nthe partial width Γee is extracted from the integrated cross section, for example, in the\nelastic process e+ e− → J/ψ → e+ e− . Then the ratio of the elastic cross section to the\ntotal cross section independently provides the branching ratio Bee . The total width\n(as above) is Γ = Γee /Bee .\n• Both the above method and the Primakoff effect have been applied to the η meson\ngiving consistent results and a value for the width of Γ = 1.18 ± 0.11 keV.\n• Finally, the D∗0 (2010)± , with a width of Γ = 96 ± 4 ± 22 keV, has a mass just above the\nthreshold for its main decay channels D 0 π ± and D ± π 0 . Its width cannot be measured\ndirectly, but can be extracted from fitting to simulations of the the energy distribution\nof decay products [15].\n\n8\n\n\f5\n\nSummary and Further Considerations\n\nThe mass-width spectrum in Figure 1 does not reveal as much information about unstable\nparticles as Hertzsprung-Russell diagrams reveal about stellar composition and evolution [16].\nThese graphs do not contribute to finding a perturbative, renormalizable, elegant theory for\npredicting masses and widths of hadrons based on standard model parameters. Nonetheless, Figure 1 and subsequent partitions of it do show some structures that correspond to\nsignificant phenomenological features. As a result, I think these graphs provide an excellent\ntool (or at least a starting point) for instructing students of particle physics about a host of\nphysical phenomena and experimental procedures. A partial list of these features or ideas\nwould include:\n• Relative strengths of the fundamental interactions.\n• Connection of the transition amplitude and scattering matrix to measurable quantities.\n• Experimental measurement of exponential decay.\n• Resonance production and decay.\n• Cross section measurements.\n• Phase space dependence of width and decay rate.\nAdditionally, not just the viewing of these graphs, but the production of these kinds\nof plots would be an excellent exercise for students, undergraduate or graduate. While\nfamiliarizing themselves with the particle zoo, they could also practice using graphing and\ndata management software. As an example of other kinds of plots possible, Fig. 5 depicts\nthe width versus mass of just the mesons on a linear scale.\nFinally, visualizing the mass and width spectrum of unstable particles with such graphs\nmakes the task of conceptually organizing the physical data of hundreds of unstable particles a little easier. It provides an alternate way to group them into phenomenologicallymeaningful families, complimenting standard organization schemes according to flavor and/or\nquark content. Many physicists have some biological, taxonomical part of their brains to\nwhich I hope these graphs appeal.\n\n9\n\n\fReferences\n[1] K. Hagiwara et al., \"The Review of Particle Physics,\" Phys. Rev. D 66, 010001 1-974\n(2002).\n[2] http://pdg.lbl.gov/rpp/mcdata/mass_width_02.mc\n[3] For example, see M. L. Goldberger, K. M. Watson, Collision Theory (Wiley, New York,\n1964), chap. 8.\n[4] See also, Arno Bohm, \"Quantum Mechanics: Foundations and Applications,\" (Springer,\nNew York, 1994), 3rd ed., chap. 18.\n[5] Arno R. Bohm and N.L. Harshman, \"On the mass and width of the Z-boson and other\nrelativistic resonances,\" Nucl. Phys. B 581, 91-115 (2000).\n[6] V. Weisskopf and E. P. Wigner, \"Berechnung der natürlichen Linienbreite auf Grund\nder Diracsichen Licht theorie,\" Z. f. Physik 63, 54-73 (1930) and \"Uber die natürlich\nLinienbreite in der Strahlung des harmonischen Oszillators,\" 65, 18-27 (1930).\n[7] The Wigner-Weisskopf relation has been verified some time ago for some nuclear unstable states [8,9] using the Mössbauer effect to achieve the required energy resolution and\nmore recently for one atomic unstable state [10] using ultra-cold atoms for the same\npurpose.\n[8] For example, see H. Frauenfelder, The Mössbauer Effect (W.A. Benjamin, New York,\n1962), pp. 50-51.\n[9] P.A. DeYong, P.L. Jolivette, and N. Rouze, \"Experimental verification of the Heisenberg\nuncertainty principle-an advanced undergraduate laboratory,\" Am. J. Phys. 61 (6),\n560-563 (1993).\n[10] U. Volz, M. Majerus, H. Liebel, A. Schmitt, and H. Schmoranzer, \"Precision Lifetime\nMeasurements on NaI 3p2 P1/2 and 3p2 P 3/2 by Beam-Gas-Laser Spectroscopy,\" Phys.\nRev. Lett. 76, 2862-2865 (1996); C.W. Oates, K.R. Vogel, and J.L. Hall, \"High Precision\nLinewidth Measurement of Laser-Cooled Atoms: Resolution of the Na 3p2 P3/2 Lifetime\nDiscrepancy,\" Phys. Rev. Lett. 76, 2866-2869 (1996).\n[11] For a more elementary discussion than that in [3] based on time-dependent perturbation\ntheory, see Eugen Merzbacher, Quantum Mechanics (Wiley, New York, 1970), 2nd\ned., chap. 18, which includes the quotation \"To obtain nonreversing transitions and a\n10\n\n\fprogressive depletion of the initial state it is essential that the discrete initial state be\ncoupled to a very large number of states with similar frequencies. However, the fact\nremains that the exponential decay law, for which we have so much empirical support\nin radioactive processes, is not a rigorous consequence of quantum mechanics but the\nresult of somewhat delicate approximations,\" pp. 484-485.\n[12] Gamow was the first to use eigenfunctions of the Hamiltonian with complex energy\nfor a heuristic description of unstable states in G. Gamow, \"Zur Quantentheorie der\nAtomkernes,\" Z. Phys. 51, 204-218 (1928). For a modern non-relativistic treatment,\nsee chap. 21 of [4]; for a relativistic discussion, see [5]; also, A. Bohm, N.L. Harshman\nand H. Walther, \"Relating the Lorentzian and exponential: Fermi's approximation, the\nFourier transform, and causality,\" Phys. Rev. A 66, 012107 1-11 (2002).\n[13] H.W. Atherton et al., \"Direct measurement of the lifetime of the neutral pion,\" Phys.\nLett. 15B, 81-84 (1985).\n[14] H. Primakoff, \"Photo-production of neutral mesons in nuclear electric fields and the\nmean life of the neutral meson,\" Phys. Rev. 81, 899 (1951).\n[15] A. Anastassov et al. (CLEO Collaboration), \"First measurement of Γ(D ∗ + ) and precision measurement of mD∗ + − mD0 ,\" Phys. Rev. D 65, 032003 1-11 (2002).\n[16] M. Zeilik, S. A. Gregory, E. v. P. Smith, Introductory Astronomy and Astrophysics,\nThird Edition, (Harcourt Brace Javanovich, Fort Worth, 1992), p. 249-267.\n\n11\n\n\fFig. 1. Log-log plot of Mass/MeV versus Width/MeV. Choice of 139 unstable particles\nplotted described in text. Key: hollow circles-gauge bosons; black stars-leptons; black\ntriangles-light unflavored mesons; gray triangles-strange mesons; hollow triangles-flavored\ncharmed mesons (including charmed-strange mesons); black diamonds-unflavored charmed\n(cc̄) mesons; gray diamonds-flavored bottom mesons (including bottom-strange and bottomcharmed mesons); hollow diamonds-unflavored bottom (bb̄) mesons; black squares-N\nand ∆ baryons; gray squares-strange baryons (including Λ, Σ, Ξ and Ω baryons); hollow squares-charmed and bottom baryons.\n\n12\n\n\fFig. 2. Log-linear plot of Mass/MeV versus particle rank in order of increasing mass (out of\n139 selected particles). Key is same as in Fig. 1.\n\n13\n\n\fFig. 3. Log-linear plot of Width/MeV versus particle rank in order of increasing width (out\nof 139 selected particles). Key is same as in Fig. 1.\n\n14\n\n\fFig. 4. Log-linear plot of width-to-mass ratio Γ/M versus rank in order of increasing widthto-mass ratio (out of 139 selected particles). Key is same as in Fig. 1.\n\n15\n\n\fFig. 5. Linear plot of width versus mass of unstable mesons. Key: black diamonds-light,\nunflavored mesons, black stars-strange mesons; black triangles-charm-flavored mesons\n(including charmed/strange-flavored mesons); hollow triangles-cc̄-mesons; black squares-\nbottom-flavored mesons (including bottom/strange- and bottom/charmed-flavored mesons);\nhollow squares-bb̄-mesons.\n\n16\n\n\f"}