{"id": "http://arxiv.org/abs/physics/0702243v1", "guidislink": true, "updated": "2007-02-27T18:57:53Z", "updated_parsed": [2007, 2, 27, 18, 57, 53, 1, 58, 0], "published": "2007-02-27T18:57:53Z", "published_parsed": [2007, 2, 27, 18, 57, 53, 1, 58, 0], "title": "Interferometry of a Single Nanoparticle Using the Gouy Phase of a\n  Focused Laser Beam", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=physics%2F0001036%2Cphysics%2F0001062%2Cphysics%2F0001073%2Cphysics%2F0001045%2Cphysics%2F0001061%2Cphysics%2F0001018%2Cphysics%2F0001064%2Cphysics%2F0001048%2Cphysics%2F0702198%2Cphysics%2F0702099%2Cphysics%2F0702088%2Cphysics%2F0702006%2Cphysics%2F0702086%2Cphysics%2F0702232%2Cphysics%2F0702092%2Cphysics%2F0702185%2Cphysics%2F0702160%2Cphysics%2F0702231%2Cphysics%2F0702002%2Cphysics%2F0702143%2Cphysics%2F0702129%2Cphysics%2F0702018%2Cphysics%2F0702226%2Cphysics%2F0702004%2Cphysics%2F0702068%2Cphysics%2F0702193%2Cphysics%2F0702158%2Cphysics%2F0702053%2Cphysics%2F0702141%2Cphysics%2F0702072%2Cphysics%2F0702019%2Cphysics%2F0702005%2Cphysics%2F0702184%2Cphysics%2F0702035%2Cphysics%2F0702221%2Cphysics%2F0702051%2Cphysics%2F0702020%2Cphysics%2F0702240%2Cphysics%2F0702067%2Cphysics%2F0702015%2Cphysics%2F0702115%2Cphysics%2F0702082%2Cphysics%2F0702163%2Cphysics%2F0702201%2Cphysics%2F0702200%2Cphysics%2F0702118%2Cphysics%2F0702083%2Cphysics%2F0702186%2Cphysics%2F0702034%2Cphysics%2F0702017%2Cphysics%2F0702028%2Cphysics%2F0702134%2Cphysics%2F0702222%2Cphysics%2F0702039%2Cphysics%2F0702014%2Cphysics%2F0702031%2Cphysics%2F0702196%2Cphysics%2F0702225%2Cphysics%2F0702126%2Cphysics%2F0702215%2Cphysics%2F0702137%2Cphysics%2F0702253%2Cphysics%2F0702217%2Cphysics%2F0702243%2Cphysics%2F0702045%2Cphysics%2F0702112%2Cphysics%2F0702109%2Cphysics%2F0702128%2Cphysics%2F0702029%2Cphysics%2F0702169%2Cphysics%2F0702224%2Cphysics%2F0702205%2Cphysics%2F0702149%2Cphysics%2F0702156%2Cphysics%2F0702052%2Cphysics%2F0702117%2Cphysics%2F0702170%2Cphysics%2F0702223%2Cphysics%2F0702054%2Cphysics%2F0702013%2Cphysics%2F0702245%2Cphysics%2F0702188%2Cphysics%2F0702132%2Cphysics%2F0702207%2Cphysics%2F0702050%2Cphysics%2F0702003%2Cphysics%2F0702062%2Cphysics%2F0702007%2Cphysics%2F0702102%2Cphysics%2F0702131%2Cphysics%2F0702075%2Cphysics%2F0702180%2Cphysics%2F0702066%2Cphysics%2F0702043%2Cphysics%2F0702065%2Cphysics%2F0702208%2Cphysics%2F0702049%2Cphysics%2F0702219%2Cphysics%2F0702202%2Cphysics%2F0702089%2Cphysics%2F0702022&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Interferometry of a Single Nanoparticle Using the Gouy Phase of a\n  Focused Laser Beam"}, "summary": "We provide a quantitative explanation of the mechanism of the far-field\nintensity modulation induced by a nanoparticle in a focused Gaussian laser\nbeam, as was demonstrated in several recent direct detection studies. Most\napproaches take advantage of interference between the incident light and the\nscattered light from a nanoparticle to facilitate a linear dependence of the\nsignal on the nanoparticle volume. The phase relation between the incoming\nfield and the scattered field by the nanoparticle is elucidated by the concept\nof Gouy phase. This phase relation is used to analyze the far-field\nsignal-to-noise ratio as a function of exact nanoparticle position with respect\nto the beam focus. The calculation suggests that a purely dispersive\nnanoparticle should be displaced from the Gaussian beam focus to generate a\nfar-field intensity change.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=physics%2F0001036%2Cphysics%2F0001062%2Cphysics%2F0001073%2Cphysics%2F0001045%2Cphysics%2F0001061%2Cphysics%2F0001018%2Cphysics%2F0001064%2Cphysics%2F0001048%2Cphysics%2F0702198%2Cphysics%2F0702099%2Cphysics%2F0702088%2Cphysics%2F0702006%2Cphysics%2F0702086%2Cphysics%2F0702232%2Cphysics%2F0702092%2Cphysics%2F0702185%2Cphysics%2F0702160%2Cphysics%2F0702231%2Cphysics%2F0702002%2Cphysics%2F0702143%2Cphysics%2F0702129%2Cphysics%2F0702018%2Cphysics%2F0702226%2Cphysics%2F0702004%2Cphysics%2F0702068%2Cphysics%2F0702193%2Cphysics%2F0702158%2Cphysics%2F0702053%2Cphysics%2F0702141%2Cphysics%2F0702072%2Cphysics%2F0702019%2Cphysics%2F0702005%2Cphysics%2F0702184%2Cphysics%2F0702035%2Cphysics%2F0702221%2Cphysics%2F0702051%2Cphysics%2F0702020%2Cphysics%2F0702240%2Cphysics%2F0702067%2Cphysics%2F0702015%2Cphysics%2F0702115%2Cphysics%2F0702082%2Cphysics%2F0702163%2Cphysics%2F0702201%2Cphysics%2F0702200%2Cphysics%2F0702118%2Cphysics%2F0702083%2Cphysics%2F0702186%2Cphysics%2F0702034%2Cphysics%2F0702017%2Cphysics%2F0702028%2Cphysics%2F0702134%2Cphysics%2F0702222%2Cphysics%2F0702039%2Cphysics%2F0702014%2Cphysics%2F0702031%2Cphysics%2F0702196%2Cphysics%2F0702225%2Cphysics%2F0702126%2Cphysics%2F0702215%2Cphysics%2F0702137%2Cphysics%2F0702253%2Cphysics%2F0702217%2Cphysics%2F0702243%2Cphysics%2F0702045%2Cphysics%2F0702112%2Cphysics%2F0702109%2Cphysics%2F0702128%2Cphysics%2F0702029%2Cphysics%2F0702169%2Cphysics%2F0702224%2Cphysics%2F0702205%2Cphysics%2F0702149%2Cphysics%2F0702156%2Cphysics%2F0702052%2Cphysics%2F0702117%2Cphysics%2F0702170%2Cphysics%2F0702223%2Cphysics%2F0702054%2Cphysics%2F0702013%2Cphysics%2F0702245%2Cphysics%2F0702188%2Cphysics%2F0702132%2Cphysics%2F0702207%2Cphysics%2F0702050%2Cphysics%2F0702003%2Cphysics%2F0702062%2Cphysics%2F0702007%2Cphysics%2F0702102%2Cphysics%2F0702131%2Cphysics%2F0702075%2Cphysics%2F0702180%2Cphysics%2F0702066%2Cphysics%2F0702043%2Cphysics%2F0702065%2Cphysics%2F0702208%2Cphysics%2F0702049%2Cphysics%2F0702219%2Cphysics%2F0702202%2Cphysics%2F0702089%2Cphysics%2F0702022&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We provide a quantitative explanation of the mechanism of the far-field\nintensity modulation induced by a nanoparticle in a focused Gaussian laser\nbeam, as was demonstrated in several recent direct detection studies. Most\napproaches take advantage of interference between the incident light and the\nscattered light from a nanoparticle to facilitate a linear dependence of the\nsignal on the nanoparticle volume. The phase relation between the incoming\nfield and the scattered field by the nanoparticle is elucidated by the concept\nof Gouy phase. This phase relation is used to analyze the far-field\nsignal-to-noise ratio as a function of exact nanoparticle position with respect\nto the beam focus. The calculation suggests that a purely dispersive\nnanoparticle should be displaced from the Gaussian beam focus to generate a\nfar-field intensity change."}, "authors": ["Jaesuk Hwang", "W. E. Moerner"], "author_detail": {"name": "W. E. Moerner"}, "author": "W. E. Moerner", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/j.optcom.2007.08.032", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/physics/0702243v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/physics/0702243v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "physics.optics", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.optics", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.class-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/physics/0702243v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/physics/0702243v1", "arxiv_comment": null, "journal_reference": null, "doi": "10.1016/j.optcom.2007.08.032", "fulltext": "Manuscript\n\nInterferometry of a Single Nanoparticle Using the\nGouy Phase of a Focused Laser Beam\nJaesuk Hwang a,b,+, W. E. Moerner a\na\nb\n\nDepartment of Chemistry, Stanford University, Stanford, CA 94305 USA\n\nDepartment of Applied Physics, Stanford University, Stanford, CA 94305 USA\n\nAbstract: We provide a quantitative explanation of the mechanism of the far-field\nintensity modulation induced by a nanoparticle in a focused Gaussian laser beam, as was\ndemonstrated in several recent direct detection studies. Most approaches take advantage\nof interference between the incident light and the scattered light from a nanoparticle to\nfacilitate a linear dependence of the signal on the nanoparticle volume. The phase relation\nbetween the incoming field and the scattered field by the nanoparticle is elucidated by the\nconcept of Gouy phase. This phase relation is used to analyze the far-field signal-to-noise\nratio as a function of exact nanoparticle position with respect to the beam focus. The\ncalculation suggests that a purely dispersive nanoparticle should be displaced from the\nGaussian beam focus to generate a far-field intensity change.\n\n+\n\nCurrent Address: Laboratory for Physical Chemistry, ETH Zuerich, Switzerland\n\n\fUltrasensitive optical spectroscopy of condensed phases in fields ranging from physical\nchemistry1, 2 to single-molecule biophysics3, 4 often make use of emission from highly\nfluorescent guest molecules such as organic dyes5, 6 , or autofluorescent proteins7.\nAlthough for a number of reasons fluorescence methods are currently widely used in\nsingle-molecule studies, sensitive detection of fluorescence in condensed matter also\npresents several experimental issues, most notably the need to count single photons while\nrigorously excluding counts from impurity fluorescence or Raman scattering from\ntrillions of host molecules. These issues are even more challenging in non-artificial\nexperimental environments such as inside cells or turbid hosts. An alternative detection\nmethod is direct measurement of absorption, in which the absorption events are not\ndetected by recording subsequent fluorescence but by the change in the power or phase of\na laser beam probing the sample. In this case, any spurious emission from the sample or\nsubstrate is not critical, and all the photons in the entire laser beam probing the sample\ncan be used to sense the signal of interest. Frequency-modulation (FM) spectroscopy8\nwas the first method to allow detection of the absorption of single molecules in\ncondensed matter9, and low temperatures were required to provided narrow absorption\nlines. At room temperature, a new type of absorption spectroscopy based on Sagnac\ninterferometry10 demonstrated detection sensitivity down to a few absorbing molecules.\nIn both of these measurements, interference between the forward signal portion of the\nbeam and the local oscillator beam played a key role in linearizing the response from the\nsmall signal to overcome electronic noise of the detection system.\nRecently, various direct detection schemes were introduced that take advantage of\ninterference between the forward scattered light from a nanoparticle and the incident\n\n\flight. Via common-path interference, a better signal-to-noise ratio than the conventional\nscattering measurement11-16 was achieved mainly because the signal was proportional to\nthe volume of the nanoparticle rather than the volume squared. Figure 1 illustrates the\nreflection and transmission geometries of such experiments. This type of single beam\ninterferometry of small particles was first suggested by Batchelder and Taubenblatt17.\nAlthough the basics of the method relies on interference phenomena, the detailed\nexplanation can be subtle due to non-trivial phase behavior near the waist of a focused\nlaser beam. Traditionally, the measurements of light scattered from a small particle have\nbeen performed at an angle that avoids the collection of the original excitation light18, 19 .\nFor this reason, the theoretical approaches paid little attention to the phase because most\nof the experiments measured only the intensity of the scattering and few experiments\nwere performed to measure the amplitude and phase of the scattering in all directions θ\nand φ . However, for interference measurements, a definite phase relation between the\nincident and the scattered beam is a key requirement to fully interpret the signal.\nTherefore, it is the goal of this paper to theoretically study the phase aspects of the\ninterference between a focused Gaussian laser beam and the scattered beam from a\nnanoparticle placed therein. It will be shown that the exact phase relation between the\ntwo is mainly governed by the geometrical extent of each beam and also that the\nphenomena of absorption and phase shift are merely the manifestations of the phase\nrelation in coherent addition of scattered light and incident light. In elucidating the\nphysical origins of these phenomena, the concept of Gouy phase20 plays a key role. This\napproach will facilitate the prediction of the far-field signal-to-noise ratio behavior\n\n\finduced by a nanoparticle in a focused Gaussian beam as a function of the exact\nnanoparticle position with respect to the waist.\nWe generalize the argument by including the phaseshift φ of the probe beam\ncaused by the nanoparticle as well as the absorption, characterized by the absorption\ncross section divided by the spot size of the laser beam σ / A . The optical theorem18, 19\ndictates that the extinction is composed equally of scattering and absorption, and also that\nthe apparent absorption, which is the attenuation of the excitation beam in the far-field, is\nonly the result of the destructive interference between the scattered beam and the forward\npropagating excitation beam. So by adopting a general cross section σ = σ abs = σ sca , the\nformalism will be developed emphasizing on the interference of the scattering with the\nincident beam. From here on σ / A will quantify the strength of scattering, rather than\nabsorption. Then it will be shown later that the scattering indeed leads to absorption in\nthe far-field. In the small-signal limit, the on-axis electric field after interaction with the\nobject with phase shift φ can be written as\nE ( z ) = E 0 exp(ikz )(1 +\n≅ E 0 exp(ikz )(1 +\n≅ E 0 exp(ikz ) +\n\nσ\n\nσ\nA\n\nA\n\nσ\nA\n\n) exp(iφ )\n\n)(1 + iφ )\n\n(1)\n\nE 0 exp(ikz ) + iφE0 exp(ikz )\n\nHere, the time-varying factor e −iωt is assumed. We pay careful attention to the\nphase development of each portion of the beam as the geometry deviates from the plane\nwave, such as near the focus (waist). Therefore, rewriting Equation (1) considering the\ndifferent phase factors that develop on each portion of the beam:\n\n\fE out ≅ E0 exp(ikz + iφG ,inc ( z )) +\n∆φG ( z ) = φsc ( z) − φG ,inc ( z)\n\nσ\nA\n\nE0 exp(ikz + iφ sc ( z )) + iφE0 exp(ikz + iφ sc ( z ))\n\n(2)\nwhere φG ,inc ( z) is the Gouy phase of the incident probe beam, φ sc (z) the phase shift of the\nscattered beam, all compared to that of the plane wave propagation. These phase factors\nreflect the fact that the incident beam and the scattered beam will propagate in different\nspatial modes with respect to each other with increasing z. The intensity detected in the\nfar-field is given by\n*\nE out E out\n( z) = E02 (1 + 2\n\nσ\nA\n\ncos ∆φ ( z) − 2φ sin ∆φ ( z ))\n\n(3)\n\nwhere ∆φ = φsc − φG ,inc , which is the phase difference far from the focus. One can\nsee that ∆φ is a crucial factor that determines the far-field behavior of the signal. We will\nfrom now on evaluate φG,inc and φ sc in more detail.\nThe Gouy phase shift for the incident beam φG ,inc ( z ) from the focus z = 0 , where\nthe radius of curvature is infinite, to the distance z (z is positive for an advance in the\nlaser propagation direction) on axis is given by − tan −1\n\nλz\nπω0 2\n\n, where ω 0 is the beam\n\n21\n\nradius at the focus (waist). The quantity πω 02/λ is the usual confocal parameter, equal to\nhalf of the Rayleigh range 2zR. This phase shift approaches a constant value of -π/2 at a\nlarge distance. The physical origin of the Gouy phase22 can be explained as follows:\nTransverse spatial confinement of any shape, through the uncertainty principle, causes a\nspread in the transverse momenta, which changes the expectation value of the axial\npropagation constant. The corresponding phase shift is called the Gouy phase. Consider a\n\n\fmonochromatic wave of frequency ω and wave number k =\n\nω\nc\n\npropagating along the z\n\ndirection. For an infinite plane wave, the momentum is z directed and has no transverse\ncomponents. The spread in transverse momentum is zero and hence, by the uncertainty\nprinciple, the spread in transverse position is infinite. A finite beam, however, will have a\nspread in transverse momentum. The Gouy phase shift is the expectation value of the\naxial phase shift owing to the transverse momentum spread. This Gouy phase shift is well\nknown as the −\n\ndπ\naxial phase shift that a converging Gaussian beam experiences as it\n2\n\npasses through its focus. The dimension d equals 1 for a line focus, and equals 2 for a\npoint focus.\nFor the scattered beam, φ sc (z) is +\n\nπ\n2\n\nboth in the far-field and the near-field.\n\nThis can be understood via the Babinet's principle18 23. Let us consider a screen with an\naperture much smaller than the wavelength of the excitation. As was discussed in the last\nparagraph, this small aperture acts as a tight transverse confinement, and the diffraction\nemerging from the opening will develop −\n\nπ\n2\n\nphase shift. How quickly this phase\n\ndevelops in space depends on the size of the aperture. For the case of an infinitely small\naperture, −\n\nπ\n2\n\nis immediately reached and the simple factor − i can describe the phase\n\njump. It was recently remarked22 that this explains the reason for additional − i factor in\nfront of the Kirchoff integral23; also the reason that the point source diffraction function\n(Huygens wavelet) is not exactly a spherical wave but a spherical wave with − i phase\nshift contrary to the common belief19. According to Babinet's principle, if\n\n\fE ( z ) = −iEdiff\n\nexp(ikz)\nis the electric field at z when the aperture is present, the field\nkz\n\nsatisfies\nE ( z) + E ( z ) = E inc ( z )\n\n(4)\n\nwhere E (z) is the electric field at z when the complimentary obstacle is in place, and\nE inc (z ) is the incident field18. Then,\nE ( z) = Einc ( z) − E ( z) = exp(ikz + iφG ,inc ) − ( −i) Ediff\n= exp(ikz + iφG ,inc ) + iE diff\n\nexp(ikz )\nkz\n\nexp(ikz )\nkz\n\n(5)\n\nwhere the first term is only the incident field. This demonstrates that the scattered field\nfrom a point obstacle should have +\n−\n\nπ\n2\n\nπ\n2\n\nphase shift instead of that of a point aperture,\n\n.\nWe now evaluate ∆φ = φsc − φG ,inc for a general case where the nanoparticle is\n\nplaced at distance z from the focus on axis. This is illustrated in Figure 2. Starting from\nthe position of the nanoparticle z, and measured at the detector, which is placed at\nsufficiently long distance, the Gouy phase shift of the Gaussian probe beam φG ,inc ( z ) is\n−\n\nπ\n2\n\n+ tan −1\n\nλz\nπ\n. The scattered beam undergoes a Gouy phase shift of φ sc ( z) = .\n2\n2\nπω0\n\nTherefore, phase difference ∆φ (z) is given by\n∆φ ( z) = π − tan −1\n\nλz\n.\n2\nπω0\n\n(6)\n\n\fFinally the general expression of far-field intensity as a function of the nanoparticle\nposition can be written\n\n\n\nσ\nλz \nλz  \n*\nE out E out\n( z) = E02 1 + 2 cos π − tan −1\n2φ sin  π − tan −1\n−\n2\n2\n\n\n\nA\nπω 0 \nπω 0  \n\n\n\n(7)\n\n\n\n\n\n\nσ\nλ\nz\nλ\nz\n − 2φ sin  tan −1\n\n= E02 1 − 2 cos tan −1\n2 \n2 \n\n\nA\nπω0 \nπω0  \n\n\n\nAs a simplest case example, if the nanoparticle is placed exactly at the focus\n(z=0), the incident field will develop -π/2 and scattered field will develop π/2 phase shift\nin the far-field, hence ∆φG (∞) = π . Then according to Equation (7),\n\nσ\n\n*\nE out E out\n( z) = E02 (1 − 2 )\nA\n\n(8)\n\nThis confirms that the coherent addition of the scattered and transmitted beams leads to\nan effective attenuation of the laser beam in the far-field, as the optical theorem predicts.\nThis also shows the far-field signal is purely from the absorption of the nanoparticle\nwhen the nanoparticle is placed at z = 0. Also, this argument suggests that in order to\nobtain an intensity change from the phase shift induced by the nanoparticle, it has to be\ndisplaced from focus. According to Equation (3), the signal is purely from the phase shift\nfrom the nanoparticle when ∆φG (∞ ) =\n\nπ\n2\n\nor −\n\nπ\n2\n\n. As a whole, this system resembles a\n\nSmartt-type interferometer24 where the two arms follow exactly the same path. Due to\nthis common path nature, the common-mode rejection of various nonideal noise sources\nsuch as laser phase noise is improved compared to other types of interferometers.\nHowever, this interferometer is inevitably a bright-fringe system, as can be seen from\nEquation (3), where a small intensity change must be detected on a large DC background.\n\n\fWe now describe how the far-field signal changes depending on the position of\nthe nanoparticle near the focus. The signal-to-noise ratio (SNR) in the shot-noise-limit is\nproportional to ((σ A) cos ∆φ ( z) − 2φ sin ∆φ ( z)) P0 / hvB with P0 the total laser power at\nthe detector, and B the bandwidth according to Equation (3). To reflect the case where the\nnanoparticle is displaced from the focus, we can let φ =\n\nφ0\n λz \n1 +  2 \n πω0 \n\n2\n\n,σ A =\n\n(σ A) 0\n λz\n1 +  2\n πω0\n\n\n\n\n\n2\n\n.\n\nThis is because the signals due to the phase shift and the absorption of a single\nnanoparticle are inversely proportional to the probe beam spotsize area at z, and the probe\nbeam area changes with z are assumed to be that of a Gaussian beam. Therefore, the\ndependence of the SNR on the position z of nanoparticle on axis is proportional to the\nfollowing:\n\nσ \nSNR ( z ) ∝   cos(∆φ ( z )) − φ sin( ∆φ ( z)) =\n A\n\n −1 λ z \n\nλz \nσ \n + φ 0 sin  tan −1\n\n  cos tan\n2 \nπω 0 \nπω02 \n A 0\n\n\n λz \n1 +  2 \n πω0 \n\n2\n\n(9)\nThis is depicted graphically in Figure 3, where the SNR is represented in arbitrary units.\nThe position of the nanoparticle z is varied from -2πω 02/λ to 2πω02/λ. Assuming for\nsimplicity φ +\n\nσ\nA\n\n= 1,\n\nσ\nA\n\nis varied from 0 to 1 to cover a wide range of both absorption\n\nand phase shift. This method of plotting is chosen because in the case of a metal\nnanoparticle or semiconductor quantum dot, the extinction and phase shift at a given\nwavelength cannot be described accurately by a single transition (where φ and\n\nσ\nA\n\nare\n\n\fconnected by Kramers-Kronig relation25). Figure 3 (b) presents three special cases:\ni: (φ , σ A) = (1,0) , ii: (φ , σ A) = (0.5,0.5) , iii: (φ , σ A) = (0,1)\nCase i: (φ , σ A) = (1,0) This pure phase shift situation is an interesting limit,\nwhich can be found in photothermal detection schemes15 for example. In photothermal\ndetection, the change in refractive index of the sample matrix (or the sample itself for the\ncase of a homogeneous sample) induced by the heat deposited by laser excitation is\ndetected. Therefore, in the case where the heat deposition is modulated in time, the farfield signal detected at the modulation frequency is mainly due to phase shift.\nFurthermore, if the heat is accumulated around the laser focus by the sample thermal\nproperties, the larger temperature can give an enhanced phase shift. If the thermal\ndiffusivity of the sample matrix is sufficiently low, there can even exist a limit where the\nsignal due to absorption from a nanoparticle is negligible compared to the signal due to\nphaseshift26. In curve i of Fig. 3 (b), the signal is maximum at zmax = ±0.71πω 02/λ. This\nresult is interesting compared with photothermal lensing spectroscopy26, 27 , where the\nmaximum signal occurs when the homogeneous 2-dimensional sample is placed at zmax =\n±πω 02/λ. In the case that a diffraction-limited spot is achieved, zmax is around 150nm in\nthe visible. This means that in the presence of phase shifting nanoparticles in a very thin\nlayer sample, the far field image will appear to be two parallel planes that are ~300nm\napart axially around the focus. If a second laser such as heating laser is used, since the\nsignal is now also proportional to the second laser intensity, φ =\n\nφ0\n  λz  2 \n1 + \n \n  πω 02  \n\n\n\n2\n\nshould\n\n\fbe used instead of φ =\n\nφ0\n λz\n1 +  2\n πω0\n\n\n\n\n\n2\n\n. This assumes for simplicity that the difference\n\nbetween the foci and the beam radii of the two lasers are negligible. In this particular\ncase, the optimal position is given by zmax = ±0.5πω 02/λ. This calculation would predict\nthat there would be a discrepancy between the concurrent acquisition of the fluorescence\nimage and the photothermal image since the two measurements will appear to arise from\ndifferent layers in z of the same sample.\nCase ii: (φ , σ A) = (0.5,0.5) In the case of equal phase and absorption\nperturbations, curve ii of Fig. 3 (b) shows that the maximum signal is obtained when the\nparticle is placed at positive z (z = 0.43πω 02/λ ). As can be seen in Fig. 3 (a), as the\ncontribution from the absorption signal increases, the peak closer to the laser (negative z)\ndecreases in magnitude, while position of the peak closer to the detector approaches the\nfocus. This is because the signal due to extinction interferes destructively with the signal\ndue to phase shift for z < 0.\nCase iii: (φ , σ A) = (0,1) This is the case when the laser wavelength is on\nresonance with an absorption line, and no phase shift occurs. Only in this case does the\nfar-field signal behave like one might initially expect: maximized at focus, and\ndecreasing as z moves away from 0.\nIn conclusion, we have studied the mechanism of the far-field intensity\nmodulation induced by a nanoparticle in a focused Gaussian laser beam. In particular, we\nhave described the exact phase relation of the incident and scattered beam on the optical\naxis from near-field to far-field. In this analysis, the concept of Gouy phase played a key\nrole in analyzing the behavior of the far-field signal as a function of the nanoparticle\n\n\fposition near the focus. One notable result was that a purely dispersive nanoparticle\nshould be displaced from the Gaussian beam focus to generate a far-field intensity\nchange. To comment on the assumptions and consequent limitations of this calculation,\nfirst, a transmission geometry in free space was assumed throughout the calculation. The\neffects of the sample matrix and interfaces with different refractive index are to be further\nincorporated suiting each experimental situation. Especially, the incident beam can go\nthrough another π phase shift in a reflection geometry depending on the refractive index\ncontrast. Second, in modern microscopy often a high numerical aperture objective is used,\nand the focal spot often deviates from Gaussian. In that case, Equation (6) should be\nmodified to an empirical function that saturates faster than tangent hyperbolic.\nConsidering possible applications, Equation (7) shows that common-path\ninterferometry can be used for measuring the real and imaginary part of the polarizability\nof a nanoparticle with the capability of obtaining spectra as in Refs. 12 28, 29. If the\nspectral lineshape of an emitter is well-understood such as in low temperature singlemolecule spectroscopy30, the measurement of the interference signal as in Equation (7)\ncombined with frequency scanning can be used to identify the axial position with an\nexcellent z-resolution. Also, it is worth noting that the concept of Gouy phase is robust in\nthe sense that it is valid for any kind of transversely confined beam, such as light from a\nnear-field aperture. Studying the phase aspect in detail of the scattering of a nanoparticle\nin the optical near-field29-31\n\n32\n\nwould be a worthwhile future effort.\n\n\fFigure Captions\nFigure 1. Schematic of reflection and transmission geometries where the\nscattering from the nanoparticle interferes with the reflected and transmitted beam,\nrespectively.\n\nFigure 2. Schematic of the waist region of a Gaussian beam, showing the position\nof the waist and the nanoparticle, with the phase accumulations shown at the upper right.\n\nFigure 3. (a) Surface plot of the SNR in arbitrary units as a function of\nnormalized nanoparticle position and the fractional absorption, σ /A. (b) Plot of SNR as a\nfunction of normalized nanoparticle position for the three limiting cases described in the\ntext.\n\nReferences\n1\n\nX. S. Xie and J. K. Trautman, Ann. Rev. Phys. Chem. 49, 441 (1998).\n\n2\n\nW. E. Moerner, J. Phys. Chem. B 106, 910 (2002).\n\n3\n\nS. Nie, D. T. Chiu, and R. N. Zare, Science 266, 1018 (1994).\n\n4\n\nS. Weiss, Science 283, 1676 (1999).\n\n5\n\nM. Orrit and J. Bernard, Phys. Rev. Lett. 65, 2716 (1990).\n\n6\n\nT. Basché, W. E. Moerner, M. Orrit, et al.,, (Verlag-Chemie, Munich, 1997).\n\n7\n\nR. M. Dickson, A. B. Cubitt, R. Y. Tsien, et al., Nature 388, 355 (1997).\n\n8\n\nG. C. Bjorklund, Opt. Lett. 5, 15 (1980).\n\n\f9\n\nW. E. Moerner and L. Kador, Phys. Rev. Lett. 62, 2535 (1989).\n\n10\n\nJ. Hwang, M. M. Fejer, and W. E. Moerner, Phys. Rev. A Rapid Commun. 73, 021802R1 (2006).\n\n11\n\nM. A. van Dijk, M. Lippitz, and M. Orrit, Phys. Rev. Lett. 95, 267406 (2005).\n\n12\n\nK. Lindfors, T. Kalkbrenner, P. Stoller, et al., Phys. Rev. Lett. 93 (2004).\n\n13\n\nV. Jacobsen, P. Stoller, C. Brunner, et al., Optics Express 14, 405 (2005).\n\n14\n\nF. V. Ignatovich and L. Novotny, Phys. Rev. Lett. 96, 013901 (2006).\n\n15\n\nS. Berciaud, L. Cognet, G. A. Blab, et al., Phys. Rev. Lett. 93, 257402 (2004).\n\n16\n\nA. Arbouet, D. Christofilos, N. Del Fatti, et al., Phys. Rev. Lett. 93, 127401 (2004).\n\n17\n\nJ. S. Batchelder and M. A. Taubenblatt, Appl. Phys. Lett. 55, 215 (1989).\n\n18\n\nC. F. Bohren and D. R. Huffman, Absorption and Scattering of Light by Small Particles (John\nWiley & Sons, Inc., 1983).\n\n19\n\nH. C. Van de Hulst, Light Scattering By Small Particles (Dover Publications, Inc, New York,\n1981).\n\n20\n\nC. R. Gouy, Acad. Sci. Paris 110, 1251 (1890).\n\n21\n\nA. E. Siegman, Lasers (University Science, Mill Valley, Calif., 1986).\n\n22\n\nS. Feng and H. G. Winful, Optics Letters 2, 485 (2001).\n\n23\n\nJ. D. Jackson, Classical Electrodynamics (John Wiley & Sons, Inc, New York, 1998).\n\n24\n\nR. N. Smartt and W. H. Steel, Japan. J. Appl. Phys. 14, 14 (1975).\n\n25\n\nA. Yariv, Optical Electronics in Modern Communications (Oxford University Press, New York,\n1997).\n\n26\n\nS. E. Bialkowski, Photothermal Spectroscopy Methods for Chemical Analysis (John Wiley &\nsons, Inc., New York, 1996).\n\n27\n\nK. Uchiyama, A. Hibara, H. Kimura, et al., Jpn. J. Appl. Phys. 39, 5316 (2000).\n\n28\n\nP. Stoller, V. Jacobsen, and V. Sandoghdar, Opt. Lett. 31, 2474 (2006).\n\n29\n\nA. A. Mikhailovsky, M. A. Petruska, M. I. Stockman, et al., Opt. Lett. 28, 1686 (2003).\n\n30\n\nT. V. Plakhotnik and V. Palm, Phys. Rev. Lett. 87, 183602 (2001).\n\n31\n\nI. Gerhardt, G. Wrigge, P. Bushev, et al., Phys. Rev. Lett. 98, 033601 (2007).\n\n32\n\nT. V. Plakhotnik, Molecular Spectroscopy 79, 747 (1995).\n\n\fFigure(s) 1-3\n\nFigure 1\n\nReflection\n\nTransmission\nTo\nDetector\n\nobjective\n\nobjective\n\nobjective\n\nFrom\nLaser\nTo\nDetector\n\nFrom\nLaser\n\n\fFigure 2\n− tan − 1\n\nlaser\n\nz\n\nλz\nπω02\n\nπ\n2\n\n−\n\nπ\n2\n\n+ tan −1\n\nλz\nπω0 2\n\ndetector\n\n\f(a)\nSNR (arb. unit)\n1\n0.75\n0.5\n0.25\n0\n- 2\n\n1\n0.8\n0.6\n0.4\n\n- 1\n\n0\n\nz/(πωo2/λ)\n\nSNR\nunit)\nSNR (arb.\narb. u\nnit\n\nHL\n\n(b)\n\n0.2\n\n1\n\nσ/A\n\n2 0\n\n1\n\niii\n\n0.8\n\nii\n\n0.6\n\ni\n\n0.4\n0.2\n0\n\n-2\n\n-1\n\n0\n\nz/(πωo2/λ)\n\n1\n\n2\n\n\f"}