{"id": "http://arxiv.org/abs/physics/0410076v2", "guidislink": true, "updated": "2005-10-09T03:41:34Z", "updated_parsed": [2005, 10, 9, 3, 41, 34, 6, 282, 0], "published": "2004-10-12T15:46:11Z", "published_parsed": [2004, 10, 12, 15, 46, 11, 1, 286, 0], "title": "Multifractal Analysis of Human Retinal Vessels", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=physics%2F0410052%2Cphysics%2F0410255%2Cphysics%2F0410236%2Cphysics%2F0410040%2Cphysics%2F0410164%2Cphysics%2F0410159%2Cphysics%2F0410174%2Cphysics%2F0410076%2Cphysics%2F0410005%2Cphysics%2F0410125%2Cphysics%2F0410268%2Cphysics%2F0410073%2Cphysics%2F0410148%2Cphysics%2F0410185%2Cphysics%2F0410177%2Cphysics%2F0410186%2Cphysics%2F0410099%2Cphysics%2F0410190%2Cphysics%2F0410079%2Cphysics%2F0410023%2Cphysics%2F0410257%2Cphysics%2F0410270%2Cphysics%2F0410265%2Cphysics%2F0410173%2Cphysics%2F0410044%2Cphysics%2F0410130%2Cphysics%2F0410020%2Cphysics%2F0410098%2Cphysics%2F0410123%2Cphysics%2F0410055%2Cphysics%2F0410119%2Cphysics%2F0410078%2Cphysics%2F0410260%2Cphysics%2F0410184%2Cphysics%2F0410063%2Cphysics%2F0410249%2Cphysics%2F0410224%2Cphysics%2F0410139%2Cphysics%2F0410007%2Cphysics%2F0410133%2Cphysics%2F0410248%2Cphysics%2F0410195%2Cphysics%2F0410096%2Cphysics%2F0410087%2Cphysics%2F0410049%2Cphysics%2F0410112%2Cphysics%2F0410244%2Cphysics%2F0410160%2Cphysics%2F0410258%2Cphysics%2F0410208%2Cphysics%2F0410231%2Cphysics%2F0410205%2Cphysics%2F0410238%2Cphysics%2F0410172%2Cphysics%2F0410132%2Cphysics%2F0410134%2Cphysics%2F0410028%2Cphysics%2F0410014%2Cphysics%2F0410016%2Cphysics%2F0410204%2Cphysics%2F0410202%2Cphysics%2F0410048%2Cphysics%2F0410085%2Cphysics%2F0410222%2Cphysics%2F0410155%2Cphysics%2F0410090%2Cphysics%2F0410058%2Cphysics%2F0410113%2Cphysics%2F0410203%2Cphysics%2F0410106%2Cphysics%2F0410279%2Cphysics%2F0410061%2Cphysics%2F0410018%2Cphysics%2F0410097%2Cphysics%2F0410237%2Cphysics%2F0410217%2Cphysics%2F0410047%2Cphysics%2F0410191%2Cphysics%2F0410122%2Cphysics%2F0410180%2Cphysics%2F0410246%2Cphysics%2F0410149%2Cphysics%2F0410226%2Cphysics%2F0410157%2Cphysics%2F0410276%2Cphysics%2F0410095%2Cphysics%2F0410127%2Cphysics%2F0410158%2Cphysics%2F0410124%2Cphysics%2F0410206%2Cphysics%2F0410152%2Cphysics%2F0410094%2Cphysics%2F0410194%2Cphysics%2F0410089%2Cphysics%2F0410012%2Cphysics%2F0410212%2Cphysics%2F0410051%2Cphysics%2F0410213%2Cphysics%2F0410147%2Cphysics%2F0410064%2Cphysics%2F0610108&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Multifractal Analysis of Human Retinal Vessels"}, "summary": "In this work it is shown that vascular structures of the human retina\nrepresent geometrical multifractals, characterized by a hierarchy of exponents\nrather then a single fractal dimension. A number of retinal images from the\nSTARE database (www.parl.clemson.edu/stare) are analyzed, corresponding to both\nnormal and pathological states of the retina. In all studied cases a clearly\nmultifractal behavior is observed, where capacity dimension is always found to\nbe smaller then the information dimension, which is in turn always smaller then\nthe correlation dimension, all the three being significantly lower then the DLA\n(Diffusion Limited Aggregation) fractal dimension. We also observe a tendency\nof images corresponding to the pathological states of the retina to have lower\ngeneralized dimensions and a shifted spectrum range, in comparison with the\nnormal cases.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=physics%2F0410052%2Cphysics%2F0410255%2Cphysics%2F0410236%2Cphysics%2F0410040%2Cphysics%2F0410164%2Cphysics%2F0410159%2Cphysics%2F0410174%2Cphysics%2F0410076%2Cphysics%2F0410005%2Cphysics%2F0410125%2Cphysics%2F0410268%2Cphysics%2F0410073%2Cphysics%2F0410148%2Cphysics%2F0410185%2Cphysics%2F0410177%2Cphysics%2F0410186%2Cphysics%2F0410099%2Cphysics%2F0410190%2Cphysics%2F0410079%2Cphysics%2F0410023%2Cphysics%2F0410257%2Cphysics%2F0410270%2Cphysics%2F0410265%2Cphysics%2F0410173%2Cphysics%2F0410044%2Cphysics%2F0410130%2Cphysics%2F0410020%2Cphysics%2F0410098%2Cphysics%2F0410123%2Cphysics%2F0410055%2Cphysics%2F0410119%2Cphysics%2F0410078%2Cphysics%2F0410260%2Cphysics%2F0410184%2Cphysics%2F0410063%2Cphysics%2F0410249%2Cphysics%2F0410224%2Cphysics%2F0410139%2Cphysics%2F0410007%2Cphysics%2F0410133%2Cphysics%2F0410248%2Cphysics%2F0410195%2Cphysics%2F0410096%2Cphysics%2F0410087%2Cphysics%2F0410049%2Cphysics%2F0410112%2Cphysics%2F0410244%2Cphysics%2F0410160%2Cphysics%2F0410258%2Cphysics%2F0410208%2Cphysics%2F0410231%2Cphysics%2F0410205%2Cphysics%2F0410238%2Cphysics%2F0410172%2Cphysics%2F0410132%2Cphysics%2F0410134%2Cphysics%2F0410028%2Cphysics%2F0410014%2Cphysics%2F0410016%2Cphysics%2F0410204%2Cphysics%2F0410202%2Cphysics%2F0410048%2Cphysics%2F0410085%2Cphysics%2F0410222%2Cphysics%2F0410155%2Cphysics%2F0410090%2Cphysics%2F0410058%2Cphysics%2F0410113%2Cphysics%2F0410203%2Cphysics%2F0410106%2Cphysics%2F0410279%2Cphysics%2F0410061%2Cphysics%2F0410018%2Cphysics%2F0410097%2Cphysics%2F0410237%2Cphysics%2F0410217%2Cphysics%2F0410047%2Cphysics%2F0410191%2Cphysics%2F0410122%2Cphysics%2F0410180%2Cphysics%2F0410246%2Cphysics%2F0410149%2Cphysics%2F0410226%2Cphysics%2F0410157%2Cphysics%2F0410276%2Cphysics%2F0410095%2Cphysics%2F0410127%2Cphysics%2F0410158%2Cphysics%2F0410124%2Cphysics%2F0410206%2Cphysics%2F0410152%2Cphysics%2F0410094%2Cphysics%2F0410194%2Cphysics%2F0410089%2Cphysics%2F0410012%2Cphysics%2F0410212%2Cphysics%2F0410051%2Cphysics%2F0410213%2Cphysics%2F0410147%2Cphysics%2F0410064%2Cphysics%2F0610108&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In this work it is shown that vascular structures of the human retina\nrepresent geometrical multifractals, characterized by a hierarchy of exponents\nrather then a single fractal dimension. A number of retinal images from the\nSTARE database (www.parl.clemson.edu/stare) are analyzed, corresponding to both\nnormal and pathological states of the retina. In all studied cases a clearly\nmultifractal behavior is observed, where capacity dimension is always found to\nbe smaller then the information dimension, which is in turn always smaller then\nthe correlation dimension, all the three being significantly lower then the DLA\n(Diffusion Limited Aggregation) fractal dimension. We also observe a tendency\nof images corresponding to the pathological states of the retina to have lower\ngeneralized dimensions and a shifted spectrum range, in comparison with the\nnormal cases."}, "authors": ["T. Stosic", "B. Stosic"], "author_detail": {"name": "B. Stosic"}, "author": "B. Stosic", "arxiv_comment": "5 pages, 4 figures, 2 tables", "links": [{"href": "http://arxiv.org/abs/physics/0410076v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/physics/0410076v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "physics.bio-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.bio-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/physics/0410076v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/physics/0410076v2", "journal_reference": null, "doi": null, "fulltext": "Multifractal Analysis of Human Retinal Vessels\nTatijana Stošić and Borko D. Stošić∗\n\narXiv:physics/0410076v2 [physics.bio-ph] 9 Oct 2005\n\nDepartamento de Estatı́sica e Informática, Universidade Federal Rural de Pernambuco,\nRua Dom Manoel de Medeiros s/n, Dois Irmãos, 52171-900 Recife-PE, Brasil\n(Dated: October 26, 2018)\nIn this work it is shown that vascular structures of the human retina represent geometrical multifractals, characterized by a hierarchy of exponents rather then a single fractal dimension. A\nnumber of retinal images from the STARE database (www.parl.clemson.edu/stare) are analyzed,\ncorresponding to both normal and pathological states of the retina. In all studied cases a clearly\nmultifractal behavior is observed, where capacity dimension is always found to be smaller then the\ninformation dimension, which is in turn always smaller then the correlation dimension, all the three\nbeing significantly lower then the DLA (Diffusion Limited Aggregation) fractal dimension. We also\nobserve a tendency of images corresponding to the pathological states of the retina to have lower\ngeneralized dimensions and a shifted spectrum range, in comparison with the normal cases.\nPACS numbers: 05.40.-a, 61.43.Hv, 87.57.-s, 87.57.Nk\n\nOver the past decade, there have been several attempts\n[1, 2, 3, 4, 5, 6] in the direction of employing the fractal dimension as a measure for quantifying the \"state\" of\nhuman retinal vessel structures (considered as geometrical objects), with the expectation that such analysis may\ncontribute to automatic detection of pathological cases,\nand therefore to computerization of the diagnostic process. While this is certainly a valid question with possibly high impact on real world diagnostic issues, there\nare some issues that should be addressed before such investigations may prove useful for the standard clinical\npractice. First, the fact that retinal vessels represent \"finite size\" realizations of a fractal growth process, imposes\nquestions about how exactly should one go about measuring the fractal dimension of a particular instance (e.g.\nan electronic image of a retinal vessel structure, taken\nfrom a given angle, with a given resolution and lightning conditions). A related question is to what extent\nthese calculations may correspond to the limiting fractal\n(which would have been attained if the growth process\ncould have been extended to infinity), or equivalently, to\nwhat degree they may be compared with calculations on\nother such finite instances. Although various issues related to these questions have already been addressed (for\na current review see e.g. [6]), it seems that many of them\nremain open for further investigation. Second, some of\nthese works [3, 4] address the point that the retinal vessels may have different properties in different regions, and\ndo indeed find different characteristics depending on the\nlocale of measurement, although the procedures adopted\nin these works are only remotely related to established\nconcepts of multifractality, and the corresponding commonly accepted procedures for its measurement (see e.g.\n[7, 8, 9, 10, 11, 12] and references therein).\nIn this work we concentrate on the latter of the above\nissues, that is, we show that the human retinal vessel\n\n∗ Electronic\n\naddress: borko@ufpe.br\n\nstructures are geometrical multifractals, characterized by\na hierarchy of exponents rather then a single fractal dimension. We analyze a number of retinal images from\nthe STARE database [13], corresponding to both normal and pathological states of the retina. In all cases\nwe find clearly multifractal behavior. The capacity (or\nbox counting) dimension is always found to be smaller\nthen the information (or Shannon) dimension, which is\nin turn always smaller then the correlation dimension. In\nall cases the observed values of the capacity dimension\nwere significantly lower then the DLA (Diffusion Limited\nAggregation) fractal dimension, which has been considered in earlier works [1, 2, 6] as the primary model relevant for the phenomenon at hand. It is also found that\nimages corresponding to pathological cases tend to have\nlower generalized dimensions, as well as a shifted spectrum range, in comparison with the normal cases.\nIn contrast to regular fractals (or monofractals), multifractals are characterized by a hierarchy of exponents,\nrather then a single fractal dimension. A well known example of multifractality is the growth probability distribution during the DLA growth process, which has been\nshown to exhibit multifractal scaling [14, 15, 16, 17].\nGeometrical (or mass) multifractals represent a special\ncase when the measure of interest is homogeneously distributed over the observed structure, so that only the\nnumber of particles (Lebesgue measure) contributes to\nthe measure within a given region of the fractal [8, 9].\nConsidering a structure with mass (number of pixels)\nM0 and linear size L, covered with a grid of boxes of\nlinear size l, the generalized dimension Dq for the mass\ndistribution is defined by\nX \u0012 Mi \u0013q\ni\n\nM0\n\n\u0012 \u0013(q−1)Dq\nl\n,\n∼\nL\n\n(1)\n\nwhere Mi is the mass (number of pixels) within the ith box, and q is a continuous (adjustable) variable that\nmakes it possible to single out fractal properties of the object at different scales (equivalent of inverse temperature\n\n\f2\nin thermodynamics). The generalized dimensions D0 , D1\nand D2 correspond to the capacity (or box-counting) dimension, information (or Shannon) dimension, and correlation dimension, respectively. Finally, D−∞ and D∞\nrepresent the limits of the generalized dimension spectrum (for monofractals, all the generalized dimensions\ncoincide, being equal to the unique fractal dimension).\nIt turns out that the direct application of (1) in practice is hindered by the fact that for q < 0 the boxes\nthat contain a small number of particles (because they\nbarely overlap with the cluster) give anomalously large\ncontribution to the sum on the left hand side of (1). To\nalleviate this problem and perform the multifractal analysis of the retinal vessel structures, we adopt the generalized sand box method [9, 10], which has been successfully used do demonstrate geometric multifractality\nof DLA [9]. This procedure consists in randomly selecting N points belonging to the structure, and counting for\neach such point i the number of pixels Mi (R) that belong\nto the structure, inside boxes of growing linear dimension\nR, centered at the selected pixels. The left hand side of\nequation (1) can now be interpreted as the average of the\nq−1\nquantity (Mi (R)/M0 )\naccording to probability distribution Mi (R)/M0 . When the box centers are chosen randomly, the averaging should be made over the chosen set,\nand the equivalent of (1) becomes\n*\u0012\n\u0013q−1 + \u0012 \u0013(q−1)Dq\nM (R)\nR\n.\n(2)\n∼\nM0\nL\nThe practical advantage of this method is that the boxes\nare centered on the structure, so that by construction\nthere are no boxes with too few particles (pixels) inside.\nTo verify whether human retinal vessel structures\ndemonstrate geometrical multifractal scaling properties,\nwe have used a set of forty retinal images from the\nSTARE database [13], manually segmented by two different observers (herefrom referred to by initials AH and\nVK as in [13]) from twenty original retinal scans (containing ten normal and ten pathological cases), for the\npurpose of studies on automatic image segmentation and\ndiagnostics [18]. The images segmented by observers AH\nand VK differ in level of detail, and the resulting set,\ntotaling forty segmented images, is available for download from the STARE project [13] in ppm file format,\nwith resolution of 700x605 pixels. As recently it has been\nargued [19] that fractal analysis may be more sensitive\nto changes in vascular patterns when skeletal images of\nvascular trees are considered, rather then the original\nsegmented images (which contain the vessel width information), in order to verify whether the vessel width\ninformation indeed does exert influence on the multifractal analysis, we have also performed skeletonization of the\ntwo downloaded sets using the eight connected Rosenfeld\nalgorithm [20], to produce two additional sets of twenty\nimages each. A typical normal and a pathological image, segmented by observers AH and VK (where images\nsegmented by observer VK demonstrate a substantially\n\na)\n\nb)\n\nc)\n\nd)\n\ne)\n\nFIG. 1: Image of a typical normal retinal vessel structure\n(image files im0162.ah.ppm from the STARE database [13]),\nsegmented by a) observer AH and b) observer VK, together\nwith their skeletonized versions c) and d), respectively, and a\ntypical pathological structure (image file im0001.ah.ppm, diagnosed with Background Diabetic Retinopathy), segmented\nby observer AH.\n\nhigher level of detail), respectively, together with their\nskeletonized versions using the Rosenfeld algorithm, are\nshown in Fig. 1.\nFor all of the four sets (containing twenty images\neach), we have performed measurements (calculations)\naccording to (2), selecting 1000 random points on each\nstructure (typical structure size M0 is approximately\n30000 pixels, and the typical linear size L is 600 pixels), and counting number Mi of pixels inside boxes centered at selected points. These numbers were then used\nto extract generalized dimension Dq , for different values of q (−10 < q < 10), as slopes of the lines obtained\n(minimum squares fitting) of\nE\nD through regression\nq−1\n/(q − 1), as a function of log(R/L).\nlog [M (R)/M0 ]\nThe whole procedure was repeated 100 times (with different random choices of the 1000 random points), for\neach image, and for each value of q. The final values of\nDq were calculated as averages over these repetitions.\nA word is due on calculations for the special case\nq = 1, corresponding to information dimension D1 . As\nthe above formulas are non-analytic for q = 1, we perform calculations at q = 1±ǫ, for ǫ = 0.001, and assuming\n\n\f3\n\n2.0\n\nDq\n\n1.9\n\n1.8\n\n1.7\n\n1.6\n\n1.5\n\n1.4\n-10\n\n-5\n\n0\n\n5\n\n10\n\nq\n\nFIG. 2: The generalized dimension spectrum, Dq versus q,\nfor a typical normal retinal image (image file im0162.ah.ppm\n[13]), averaged over 100 random choices of 1000 points each\n(see text for details). The error bars indicate the largest\nand smallest values encountered within the 100 runs, and the\ncurve connecting the points serves as a guide to the eye. The\npoints corresponding to the capacity dimension D0 = 1.647,\nthe information dimension D1 = 1.594 and the correlation dimension D2 = 1.552 are represented by full circles, while the\ndotted lines serve to emphasize their position.\n\nlinearity of the function D(q) in this (short) interval, we\ninterpolate D1 ≈ (D1−ǫ + D1+ǫ ) /2 (in fact, the difference between the values of Dq calculated on both sides\nof q = 1 was found to be only slightly larger then the\nstatistical fluctuations induced by random choice of the\nset of measurement points on the structure).\nResults of a typical calculation are shown in Fig. 2,\nwhere it is seen that the observed retinal vessel structure\nclearly demonstrates multifractal scaling, rather then being a simple monofractal (there is a significant difference between generalized dimensions). In particular, the\ncapacity dimension D0 , the information dimension D1\nand the correlation dimension D2 are all different, satisfying D0 > D1 > D2 . Also, all the three values remain substantially lower then the DLA fractal dimension estimate, commonly accepted in the literature, of\nDq=2 ≃ 1.71 (which is in fact underestimated by commonly used methods) [9], in contrast with previous findings [1, 2, 6].\nNumerical corresonding to Fig. 2 (for the set of twenty\nimages from the STARE database segmented by observer AH) are given in Tab. I. The first column lists\nthe image names, while the second column indicates image classification status as \"Pathological\" or \"Normal\"\n[21]. The values of generalized dimensions Dq are given\nfor q = −10, 0, 1, 2, 10, where as already mentioned D0 ,\nD1 and D2 correspond to the capacity, information and\ncorrelation dimension, respectively, while D−10 and D10\nindicate the range of the general dimension spectrum.\nIt is seen from Tab. I that all of the values calculated\nfor the capacity dimension (which corresponds to box\n\nTABLE I: Generalized dimensions Dq for q = −10, 0, 1, 2, 10,\nfor the twenty analyzed images from the STARE database.\nThe second column indicates classification status for each of\nthe images (pathological and normal).\nImage\nStatus D−10 D0\nD1\nD2\nD10\nim0001.ah\nP\n1.968 1.540 1.494 1.462 1.361\nim0002.ah\nP\n1.930 1.548 1.498 1.460 1.370\nim0003.ah\nP\n1.877 1.509 1.469 1.443 1.380\nim0004.ah\nP\n1.777 1.522 1.492 1.465 1.367\nim0005.ah\nP\n1.900 1.589 1.560 1.538 1.474\nim0044.ah\nP\n1.886 1.541 1.493 1.459 1.363\nim0077.ah\nN 1.911 1.576 1.528 1.496 1.426\nim0081.ah\nN 1.917 1.555 1.514 1.487 1.421\nim0082.ah\nN 1.981 1.578 1.518 1.476 1.404\nim0139.ah\nP\n1.904 1.565 1.516 1.481 1.413\nim0162.ah\nN 1.968 1.647 1.594 1.552 1.459\nim0163.ah\nN 1.998 1.642 1.587 1.550 1.476\nim0235.ah\nN 1.945 1.597 1.548 1.514 1.442\nim0236.ah\nN 1.868 1.584 1.544 1.514 1.448\nim0239.ah\nN 1.945 1.587 1.549 1.520 1.437\nim0240.ah\nN 1.918 1.593 1.564 1.543 1.494\nim0255.ah\nN 1.944 1.633 1.604 1.583 1.521\nim0291.ah\nP\n1.819 1.516 1.482 1.454 1.348\nim0319.ah\nP\n1.703 1.443 1.409 1.382 1.299\nim0324.ah\nP\n1.923 1.567 1.520 1.486 1.399\n\ncounting method), and indeed the correlation dimension\n(corresponding to methods such as radius of gyration or\nthe density-density correlation function), are significantly\nlower then the DLA fractal dimension Dq=2 ≃ 1.71 [9].\nTherefore, our results show that retinal vessel structures\nare geometrical multifractals, and that the overall fractal\ndimension is lower then that of the DLA.\nResults of the multifractal analysis for the other three\nsets of images (STARE database images segmented by\nobserver VK, and the skeletonized versions of AH and\nVK) all yield qualitatively similar results, all of them\nclearly demonstrating multifractal behavior. In Table II\nwe present the results for the capacity (box counting)\ndimension D0 , for all of the four sets of images. It follows from Table II that the process of skeletonization\n(removal of vessel width information from the image)\nslightly reduces the fractal dimension, while this effect\nis much weaker in comparison with the effect of the level\nof detail present in the segmentation process, as found\nbetween the two current observers. However, when the\nresults are compared consistently within each group separately, the mean fractal dimension is found to be lower\nfor the pathological images then for the normal cases, for\nall of the four groups. Although this finding can hardly\nbe considered conclusive from the statistical viewpoint,\nit is nevertheless encouraging from the point of view that\nfractal spectrum analysis could be employed for quantification of the retinal vessel state, in order to contribute\nto automatic diagnostics. To this end, far more detailed\nstudies of images corresponding to specific deseases and\nnormal cases, are needed. Assuming that each of the observers consistently applied his own criteria in segmentation, it follows that the fractal dimension results may be\n\n\f4\nTABLE II: Capacity(or box counting) dimension D0 for the\ntwo sets of images from the STARE database segmented by\nobservers AH and VK, together with their skeletonzied versions. The second column indicates classification status for\neach of the images (pathological and normal), and the last\nthree lines present averages for the pathological, normal and\nall images, respectively.\nImage Status AH AH-S VK VK-S\nim0001\nP\n1.540 1.545 1.583 1.593\nim0002\nP\n1.548 1.524 1.574 1.568\nim0003\nP\n1.509 1.500 1.593 1.608\nim0004\nP\n1.522 1.508 1.573 1.598\nim0005\nP\n1.589 1.554 1.680 1.663\nim0044\nP\n1.541 1.538 1.668 1.661\nim0077\nN 1.576 1.591 1.658 1.662\nim0081\nN 1.555 1.551 1.668 1.671\nim0082\nN 1.578 1.585 1.665 1.680\nim0139\nP\n1.565 1.564 1.679 1.678\nim0162\nN 1.647 1.638 1.714 1.700\nim0163\nN 1.642 1.612 1.684 1.646\nim0235\nN 1.597 1.588 1.685 1.675\nim0236\nN 1.584 1.581 1.658 1.662\nim0239\nN 1.587 1.597 1.655 1.655\nim0240\nN 1.593 1.563 1.677 1.663\nim0255\nN 1.633 1.634 1.696 1.693\nim0291\nP\n1.516 1.491 1.604 1.578\nim0319\nP\n1.443 1.446 1.555 1.561\nim0324\nP\n1.567 1.503 1.642 1.617\nAverage\nP\n1.534 1.517 1.615 1.612\nN 1.599 1.594 1.676 1.671\nAll 1.567 1.556 1.646 1.642\n\ncompared only between images segmented by the same\nobserver, either skeletonized or not, but should be normalized before making comparisons of results from different groups.\nWhen addressing multifractality, numerous works deal\nwith the so-called f (α) spectrum (see e.g. [7, 8, 22] and\nreferences therein), where\nN (α) = L−f (α) ,\n\n(3)\n\nrepresents the number of boxes N (α) where the probability Pi of finding a particle (pixel) within a given region\ni scales as\nPi = Lαi ,\n\n(4)\n\nand f (α) may be understood as the fractal dimension\nof the union of regions with singularity strenghts between α and α + dα. The exponent α takes values\nfrom the interval [−∞, ∞], and the function f (α) is\nusually a single humped function with a maximum at\ndf (α(q))/dα(q) = 0. The relationship between the D(q)\nspectrum and the f (α) spectrum is made via the Legendre transform\nf (α (q)) = qα (q) − τ (q) ,\n\n(5)\n\nwhere\nα (q) =\n\ndτ (q)\n,\ndq\n\n(6)\n\nf(α)\n\n1.8\n1.6\n1.4\n1.2\n1.0\n0.8\n0.6\n0.4\n1.2\n\n1.4\n\n1.6\n\n1.8\n\n2.0\n\n2.2\n\n2.4\n\nα\n\nFIG. 3: The f (α) spectrum for the twenty images from the\nSTARE database [13], segmented by observer AH. Curves corresponding to normal retinal images are represented by open\ncircles, and those corresponding to pathological images [21]\nare represented by full symbols. It is seen that pathological\nimage curves tend to be shifted to the lower α range and have\nlower maxima, in comparison with the normal images (see\ntext for more details).\n\nand\nτ (q) ≡ (q − 1)Dq\n\n(7)\n\nis the mass correlation exponent of the q th order. To\ncalculate the derivatives in (6), we have performed calculations at pairs of points q and q + ǫ with ǫ = 0.001,\nso that derivatives were calculated as dτ (q)/dq ≈ (τ (q +\nǫ) − τ (q))/ǫ, except at point q = 1, where we have used\ndτ (q)/dq ≈ (τ (1 + ǫ) − τ (1 − ǫ))/(2ǫ).\nIn Fig. 3 we show detailed results of our calculations,\nperformed on the STARE database images segmented by\nobserver AH, with respect to the f (α) spectrum. While\nthe current set of images is not particularly adequate for\ntesting the effects of a given type of pathology (there\nare only ten normal images, and ten pathological images\naffected by not necessarily the same disease, see [21]), it\nis seen that pathological case images tend to have lower\nmaxima, occasionally more narrow spectrum range, and\na shift in the spectrum position, in comparison with the\nnormal cases.\nFinally, in Fig. 4 we present results of the f (α) spectrum averaged separately for the normal and the pathological images for all of the four sets, where it is seen\nthat the previous observation holds for both observers,\nindependent of skeletonization. The skeletonized images\npresent more narrow f (α) spectrum then the original segmented images (which contain the vessel width information) for both observers, which may explain the conclusion of [19] that fractal analysis after skeletonization may\nbe more sensitive to changes in vascular patterns. More\nprecisely, since monofractals have infinitely narrow f (α)\nspectrum (a single fractal dimension), the above results\n\n\f5\n\n1.8\n\n1.8\n\nAH Patho.\nAH Normal\n\n1.6\n\n1.6\n\n1.4\n\n1.4\n\nf(α)\n\nVK Patho.\nVK Normal\n\n1.2\n\nf(α)\n\n1.2\n\n1.0\n\n1.0\n\n0.8\n\n0.8\n\n0.6\n\n0.6\n1.4\n\n1.6\n\n1.8\n\n2.0\n\n1.4\n\n2.2\n\n1.6\n\nAH-S Patho.\nAH-S Normal\n\n1.8\n\n2.0\n\n1.8\n\n1.6\n\n2.2\n\nVK-S Patho.\nVK-S Normal\n\n1.6\n\n1.4\n\nf(α)\n\n1.8\n\nα\n\nα\n\n1.4\n\n1.2\n\nf(α)\n\n1.0\n\n1.2\n\n1.0\n\n0.8\n\n0.8\n\n0.6\n\n0.6\n1.4\n\n1.6\n\n1.8\n\nα\n\n2.0\n\n2.2\n\n1.4\n\n1.6\n\n1.8\n\n2.0\n\n2.2\n\nα\n\nFIG. 4: The f (α) spectrum for the twenty images from the\nSTARE database [13], segmented by observer AH. Curves corresponding to normal retinal images are represented by open\ncircles, and those corresponding to pathological images [21]\nare represented by full symbols. It is seen that pathological\nimage curves tend to be shifted to the lower α range and have\nlower maxima, in comparison with the normal images (see\ntext for more details).\n\nshow that skeletonized structures may be more closely\napproximated as monofractals (when a single dimension\nis calculated rather then the whole spectrum). As the\ngeneral properties of the spectrum are preserved through\nskeletonizatin, another advantage of using such images\nmay be considered the fact that they contain far fewer\npixels, and therefore the calculations require less com-\n\n[1] F. Family, B.R. Masters and D.E. Platt, Physica D 38\n98 (1989).\n[2] M.A. Mainster, Eye 4 235 (1990).\n[3] G. Landini, P.I. Murray and G.P. Misson, Invest. Ophtal.\nVis. Sci. 36 2749 (1995).\n[4] A. Avakian, R.E. Kalina, H.E. Sage, A.H. Rambhia,\nK.E. Elliott, E.L. Chuang, J.I. Clark, J-N. Hwang and\nP. Parsons-Wingerter, Curr. Eye. Res. 24 274 (2002).\n[5] V. Lakshminanarayanan, A. Raghuram, J. W. Myerson,\nS. Varadharajan, Jour. Mod. Opt. 50 1701 (2003).\n[6] B.R. Masters, Ann. Rev. Bio. Eng. 6 427 (2004).\n[7] J. Feder, Fractals (Plenum Press, New York, 1988).\n[8] T. Vicsek, Fractal Growth Phenomena, 2nd edn (World\nScientific, 1993)\n[9] T. Vicsek, F. Family and P. Meakin, Europhys. Lett. 12\n217 (1990).\n[10] T. Tél, Á. Füllöp and T. Vicsek, Physica A 159 155\n(1989).\n[11] A. Chhabra and R.V. Jensen, Phys. Rev. Lett. 62 (1989).\n[12] A.B. Chhabra, C. Meneveau, R.V. Jensen and K.R.\nSreenivasan, Phys. Rev. A 40 (1989).\n\nputer time.\nThe results of calculations of the f (α) spectrum presented in Figs. 3-4 again may be considered encouraging\nfrom the point of view of the objective of turning the\ndiagnostic process automatic, although further more detailed studies are necessary to determine their statistical significance, and whether the observed differences in\nmultifractal scaling behavior may be exploited for discerning normal images from images with certain types of\npathologies. More precisely, the current work is primarily concerned with establishing the fact that retinal vessel\nimages represent geometrical multifractals, nevertheless,\nour calculations suggest that there may be grounds for\nautomatic differentiating between normal images and certain pathological cases.\nIn conclusion, we show in this work that vascular structures of the human retina represent geometrical multifractals, characterized by a hierarchy of exponents, rather\nthen a single fractal dimension. We analyze twenty retinal images from the STARE database [13], where half of\nthe images correspond to normal states of the retina, and\nhalf to different pathological states [21], together with\ntheir skeletonized versions. In all studied cases we find\nclearly multifractal behavior, with capacity dimension\nconsiderably lower then the DLA value. We also observe\na tendency of normal images of having higher generalized dimensions and a shift of the f (α) spectrum range\ntowards higher singularity strength values, in comparison\nwith the pathological cases. While the last observations\nare hardly conclusive from a statistical standpoint, they\nmay prove relevant in the quest of automatic diagnostic\nprocedures.\n\n[13] The STructured Analysis of the Retina (STARE)\nproject, www.parl.clemson.edu/stare/probing. Last seen\non September 4, 2005.\n[14] C. Amitrano, A. Coniglio and F. di Liberto, Phys. Rev.\nLett. 57 1016 (1986).\n[15] Y. Hayakawa, S. Sato and M. Matsushita, Phys. Rev. A\n36 1963 (1987).\n[16] J. Nittmann, H.E. Stanley, E. Torboul and G. Daccord,\nPhys. Rev. Lett. 58 619 (1987).\n[17] S. Ohta and H. Honjo, Phys. Rev. Lett. 60 611 (1988).\n[18] A. Hoover, V. Kouznetsova and M. Goldbaum, IEEE\nTrans. Med. Imag., 19 203 (2000).\n[19] P. Parsons-Wingerter, K. E. Elliott, J.I. Clark and A.G.\nFarr, Arteriosler. Thromb. Vasc. Biol., 20 1250 (2000).\n[20] S. Stefanelli and A. Rosenfeld,J.ACM 18 255 (1971);\n[21] See www.parl.clemson.edu/stare/diagnoses for more details on the diagnostic procedure used for classification\nof images.\n[22] T.C. Halsey, M.H. Jensen, L.P. Kadanoff, I. Procaccia\nand B.I. Shraiman, Phys.Rev. A 33 1141 (1986).\n\n\f"}