{"id": "http://arxiv.org/abs/physics/0702143v1", "guidislink": true, "updated": "2007-02-16T18:12:29Z", "updated_parsed": [2007, 2, 16, 18, 12, 29, 4, 47, 0], "published": "2007-02-16T18:12:29Z", "published_parsed": [2007, 2, 16, 18, 12, 29, 4, 47, 0], "title": "Testing Gravity with Muonium", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=physics%2F0001036%2Cphysics%2F0001062%2Cphysics%2F0001073%2Cphysics%2F0001045%2Cphysics%2F0001061%2Cphysics%2F0001018%2Cphysics%2F0001064%2Cphysics%2F0001048%2Cphysics%2F0702198%2Cphysics%2F0702099%2Cphysics%2F0702088%2Cphysics%2F0702006%2Cphysics%2F0702086%2Cphysics%2F0702232%2Cphysics%2F0702092%2Cphysics%2F0702185%2Cphysics%2F0702160%2Cphysics%2F0702231%2Cphysics%2F0702002%2Cphysics%2F0702143%2Cphysics%2F0702129%2Cphysics%2F0702018%2Cphysics%2F0702226%2Cphysics%2F0702004%2Cphysics%2F0702068%2Cphysics%2F0702193%2Cphysics%2F0702158%2Cphysics%2F0702053%2Cphysics%2F0702141%2Cphysics%2F0702072%2Cphysics%2F0702019%2Cphysics%2F0702005%2Cphysics%2F0702184%2Cphysics%2F0702035%2Cphysics%2F0702221%2Cphysics%2F0702051%2Cphysics%2F0702020%2Cphysics%2F0702240%2Cphysics%2F0702067%2Cphysics%2F0702015%2Cphysics%2F0702115%2Cphysics%2F0702082%2Cphysics%2F0702163%2Cphysics%2F0702201%2Cphysics%2F0702200%2Cphysics%2F0702118%2Cphysics%2F0702083%2Cphysics%2F0702186%2Cphysics%2F0702034%2Cphysics%2F0702017%2Cphysics%2F0702028%2Cphysics%2F0702134%2Cphysics%2F0702222%2Cphysics%2F0702039%2Cphysics%2F0702014%2Cphysics%2F0702031%2Cphysics%2F0702196%2Cphysics%2F0702225%2Cphysics%2F0702126%2Cphysics%2F0702215%2Cphysics%2F0702137%2Cphysics%2F0702253%2Cphysics%2F0702217%2Cphysics%2F0702243%2Cphysics%2F0702045%2Cphysics%2F0702112%2Cphysics%2F0702109%2Cphysics%2F0702128%2Cphysics%2F0702029%2Cphysics%2F0702169%2Cphysics%2F0702224%2Cphysics%2F0702205%2Cphysics%2F0702149%2Cphysics%2F0702156%2Cphysics%2F0702052%2Cphysics%2F0702117%2Cphysics%2F0702170%2Cphysics%2F0702223%2Cphysics%2F0702054%2Cphysics%2F0702013%2Cphysics%2F0702245%2Cphysics%2F0702188%2Cphysics%2F0702132%2Cphysics%2F0702207%2Cphysics%2F0702050%2Cphysics%2F0702003%2Cphysics%2F0702062%2Cphysics%2F0702007%2Cphysics%2F0702102%2Cphysics%2F0702131%2Cphysics%2F0702075%2Cphysics%2F0702180%2Cphysics%2F0702066%2Cphysics%2F0702043%2Cphysics%2F0702065%2Cphysics%2F0702208%2Cphysics%2F0702049%2Cphysics%2F0702219%2Cphysics%2F0702202%2Cphysics%2F0702089%2Cphysics%2F0702022&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Testing Gravity with Muonium"}, "summary": "Recently a new technique for the production of muon ($\\mu^+$) and muonium\n($\\mu^+e^-$) beams of unprecedented brightness has been proposed. As one\nconsequence and using a highly stable Mach-Zehnder type interferometer, a\nmeasurement of the gravitational acceleration $\\bar{g}$ of muonium atoms at the\nfew percent level of precision appears feasible within 100 days of running\ntime. The inertial mass of muonium is dominated by the mass of the positively\ncharged - antimatter - muon. The measurement of $\\bar{g}$ would be the first\ntest of the gravitational interaction of antimatter, of a purely leptonic\nsystem, and of particles of the second generation.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=physics%2F0001036%2Cphysics%2F0001062%2Cphysics%2F0001073%2Cphysics%2F0001045%2Cphysics%2F0001061%2Cphysics%2F0001018%2Cphysics%2F0001064%2Cphysics%2F0001048%2Cphysics%2F0702198%2Cphysics%2F0702099%2Cphysics%2F0702088%2Cphysics%2F0702006%2Cphysics%2F0702086%2Cphysics%2F0702232%2Cphysics%2F0702092%2Cphysics%2F0702185%2Cphysics%2F0702160%2Cphysics%2F0702231%2Cphysics%2F0702002%2Cphysics%2F0702143%2Cphysics%2F0702129%2Cphysics%2F0702018%2Cphysics%2F0702226%2Cphysics%2F0702004%2Cphysics%2F0702068%2Cphysics%2F0702193%2Cphysics%2F0702158%2Cphysics%2F0702053%2Cphysics%2F0702141%2Cphysics%2F0702072%2Cphysics%2F0702019%2Cphysics%2F0702005%2Cphysics%2F0702184%2Cphysics%2F0702035%2Cphysics%2F0702221%2Cphysics%2F0702051%2Cphysics%2F0702020%2Cphysics%2F0702240%2Cphysics%2F0702067%2Cphysics%2F0702015%2Cphysics%2F0702115%2Cphysics%2F0702082%2Cphysics%2F0702163%2Cphysics%2F0702201%2Cphysics%2F0702200%2Cphysics%2F0702118%2Cphysics%2F0702083%2Cphysics%2F0702186%2Cphysics%2F0702034%2Cphysics%2F0702017%2Cphysics%2F0702028%2Cphysics%2F0702134%2Cphysics%2F0702222%2Cphysics%2F0702039%2Cphysics%2F0702014%2Cphysics%2F0702031%2Cphysics%2F0702196%2Cphysics%2F0702225%2Cphysics%2F0702126%2Cphysics%2F0702215%2Cphysics%2F0702137%2Cphysics%2F0702253%2Cphysics%2F0702217%2Cphysics%2F0702243%2Cphysics%2F0702045%2Cphysics%2F0702112%2Cphysics%2F0702109%2Cphysics%2F0702128%2Cphysics%2F0702029%2Cphysics%2F0702169%2Cphysics%2F0702224%2Cphysics%2F0702205%2Cphysics%2F0702149%2Cphysics%2F0702156%2Cphysics%2F0702052%2Cphysics%2F0702117%2Cphysics%2F0702170%2Cphysics%2F0702223%2Cphysics%2F0702054%2Cphysics%2F0702013%2Cphysics%2F0702245%2Cphysics%2F0702188%2Cphysics%2F0702132%2Cphysics%2F0702207%2Cphysics%2F0702050%2Cphysics%2F0702003%2Cphysics%2F0702062%2Cphysics%2F0702007%2Cphysics%2F0702102%2Cphysics%2F0702131%2Cphysics%2F0702075%2Cphysics%2F0702180%2Cphysics%2F0702066%2Cphysics%2F0702043%2Cphysics%2F0702065%2Cphysics%2F0702208%2Cphysics%2F0702049%2Cphysics%2F0702219%2Cphysics%2F0702202%2Cphysics%2F0702089%2Cphysics%2F0702022&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Recently a new technique for the production of muon ($\\mu^+$) and muonium\n($\\mu^+e^-$) beams of unprecedented brightness has been proposed. As one\nconsequence and using a highly stable Mach-Zehnder type interferometer, a\nmeasurement of the gravitational acceleration $\\bar{g}$ of muonium atoms at the\nfew percent level of precision appears feasible within 100 days of running\ntime. The inertial mass of muonium is dominated by the mass of the positively\ncharged - antimatter - muon. The measurement of $\\bar{g}$ would be the first\ntest of the gravitational interaction of antimatter, of a purely leptonic\nsystem, and of particles of the second generation."}, "authors": ["K. Kirch"], "author_detail": {"name": "K. Kirch"}, "author": "K. Kirch", "arxiv_comment": "3 pages, 1 figure", "links": [{"href": "http://arxiv.org/abs/physics/0702143v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/physics/0702143v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "physics.atom-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.atom-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.gen-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/physics/0702143v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/physics/0702143v1", "journal_reference": null, "doi": null, "fulltext": "Testing Gravity with Muonium\nK. Kirch∗\n\narXiv:physics/0702143v1 [physics.atom-ph] 16 Feb 2007\n\nPaul Scherrer Institut (PSI), CH-5232 Villigen PSI, Switzerland\n(Dated: July 10, 2018)\nRecently a new technique for the production of muon (μ+ ) and muonium (μ+ e− ) beams of unprecedented brightness has been proposed. As one consequence and using a highly stable MachZehnder type interferometer, a measurement of the gravitational acceleration ḡ of muonium atoms\nat the few percent level of precision appears feasible within 100 days of running time. The inertial\nmass of muonium is dominated by the mass of the positively charged - antimatter - muon. The\nmeasurement of ḡ would be the first test of the gravitational interaction of antimatter, of a purely\nleptonic system, and of particles of the second generation.\nPACS numbers:\n\nThe gravitational acceleration of antimatter has not\nbeen measured so far. An experiment with antiprotons\n(see [1] and references therein) did not succeed because\nof the extreme difficulty to sufficiently shield the interaction region from electromagnetic fields. For a similar reason, results of measurements with electrons [2] are\ndiscussed very controversial and the plan to eventually\ncompare with positrons was never realized. Not affected\nby these problems are neutral systems like antihydrogen\nand, consequently, considerable effort today is devoted\nto the preparation of suitable samples of antihydrogen\n(compare [1]). A possibility to measure the effect of gravitation on neutral particles is via a phase acquired in the\ngravitational potential in a suitably built interferometer,\ndemonstrated in the classic Colella–Overhauser–Werner\n(COW) experiment [3]. In case of limited source performance, when one has to deal with extended sources,\ncomparatively large beam divergence and poor energy\ndefinition, Mach-Zehnder type interferometers have striking advantages [4]. Their performance has been demonstrated, among others, with neutrons [5] and atoms [6].\nThe idea to apply interferometry to the measurement\nof an antimatter system was inspired by the COWexperiments and dates back, as far as I know, to the\n1980s [7] but was put into print, with explicit mentioning of antihydrogen, positronium and antineutrons, first\nin 1997 [8]. Common problems of the species are the quality of the particle beams and the availability of suitable,\nsufficiently large gratings. The case of positronium was\nfurther elaborated suggesting the use of standing light\nwaves as diffraction gratings [9] but the realization of an\nexperiment appears still very challenging. In the meantime also other experimental approaches to measure the\ngravitational interaction have been proposed for antihydrogen and positronium, see [1] for an overview.\nNo discussion about a gravity experiment using muonium atoms (M = μ+ e− ) appeared in the literature yet\nand the original idea of using M atoms for testing antimatter gravity is again by Simons [7]. The suitability of\n\n∗ klaus.kirch@psi.ch\n\nM atoms comes from the fact that the inertial mass of\nthe muon is some 207 times larger than the one of the\nelectron, thus, muonium is almost completey, to 99.5%,\nantimatter. An interesting feature is that M atoms are\nalmost exclusively produced at thermal energies by stopping μ+ in matter which they often leave again as thermalized, hydrogen-like, M atom. However, up to until recently, a gravitational experiment with muonium would\nhave been science fiction. The reason for this publication\nis, that there is now the real chance to perform such an\nexperiment within the next few years.\nAn experiment with M atoms would constitute the\nfirst test of the gravitational interaction of antimatter\nwith matter. It would also be the first and probably\nunique test of particles of the second generation. While\nit would also be the first test in a purely leptonic system\none should note that tests of the equivalence principle\nproving at a high level of precision that the gravitational\ninteraction is independent of composition of test masses\nalso in principle prove (to still impressive precision) that\nelectrons fall in the same way as the rest of the material.\nFor a recent review on tests of the equivalence principle\nsee [10].\nAs a first measurement, the determination of the sign\nof interaction could be already interesting (for a discussion of antigravity see [11], but also, e.g, [12]), however, a\nreasonable first goal for such an experiment would be to\ndetermine ḡ to better than 10%. One should add here,\nthat it is not at all obvious that there could be a discrepancy between the gravitational interaction of matter\nand antimatter, see [13]. But the universality of [13] has\nbeen disputed and possible scenarios have been sketched\nin [11]. Anyhow, an experimentalist will probably favor\nthe direct measurement (and this, again, not only with\nrespect to antimatter but also to a lepton of the second\ngeneration) over the discussion of models. The following quote from [11] for antiprotons holds equally well for\nmuonium atoms: \"It would be the first test of gravity, i.e.\ngeneral relativity, in the realm of antimatter. Even if the\nexperiment finds exactly what one expects, namely that\nantimatter falls toward the earth just as matter does, it\nwould be, 'A classic, one for the text books.' .... Of\ncourse, if a new effect were found in the antiproton grav-\n\n\fity experiment, then there would be no telling what exciting physics could follow.\"\nThe muonium experiment appears feasible now because of two recent inventions: (i) a new technique to\nstop, extract and compress a high intensity beam of positive muons, to reaccelerate the muons to 10 keV and focus them into a beam spot of 100 μm diameter or even\nless [14]; and (ii) a new technique to efficiently convert\nthe muons to M atoms in superfluid helium at or below\n0.5 K in which they thermalize and from which they get\nboosted by 270 K perpendicular to the surface when they\nleave into vacuum [15].\nAssuming an existing surface muon beam of highest\nintensity as input, see e.g. [16], it should be possible\nto obtain an almost monochromatic beam of M atoms\n(∆E/E ≈ 0.5/270) with a velocity of about 6300 m/s\n(corresponding to 270 K or a wavelength\nλ ≈ 5.6Å) and\np\na 1-dimensional divergence of ∆E/E ≈ 43 mrad at a\nrate of about 105 s−1 M atoms [15]. This is a many orders\nof magnitude brighter beam than available up to now.\nFollowing the approach of [5, 6, 8, 9] a Mach-Zehnder\ntype interferometer should be used in the muonium experiment. The principle with the source, the three grating interferometer and the detection region is sketched\nin Fig. 1. We assume here three identical gratings and\nuse the first two for setting up the interference pattern\nwhich is scanned by moving the third grating. The setup\nis rather short, because the decay length of the M atoms\nis about 1.4 cm only (τμ = 2.2 μs). The whole system\nfrom source to detection may be 4 decay lengths long,\nand without further collimation the source illuminates a\ncross section of less than 5 mm over the length of the\ninterferometer. The three free-standing gratings can be\nmade sufficiently large with existing, proven technology\nwith a period of 100 nm [17, 18] resulting in a diffraction angle θ = λ/d ≈ 5.6 mrad. The optimum distance\nL between two gratings is slightly larger than one decay\nlength; however, for simplicity here L = 1.4 cm. Assuming another length L each, for distances of the source and\nthe detector to the nearest interferometer grating, results\nin 4 decay lenghts. Decay and transmission loss by the\nthree 50% open ratio gratings reduces the initial M rate\nby a factor 2 × 10−3 , yielding N0 = 200 s−1 detected M.\nBecause only the indicated first order diffraction carries\nthe desired information but essentially all transmitted M\nare detected, the interference pattern has a reduced contrast of somewhat below 4/9. Assuming a contrast of\nC = 0.3 and using eqn. (3) of [9] yields the statistical\nsensitivity of the experiment:\n1\nd 1\n√\nC N0 2π τ 2\np\n≈ 0.3 g per #days\n\nS =\n\n(1)\n(2)\n\nwhich means that the sign of ḡ is fixed after one day and\n3% accuracy can be achieved after 100 days of running.\nWith the quite satisfactory statistics, the next important issues are the alignment and stability of the inter-\n\nL ~ 1.4 cm\n~ 43 mrad\n\nx\n\n2\n\nΘ\n\nw<100 μm\nd~100 nm\n\nSource\n\nInterferometer\n\nDetection\n\nFIG. 1: Scheme of the experimental setup: the M beam comes\nfrom the cryogenic μ+ beam target on the left hand side,\nenters and partially traverses the interferometer and reaches\nthe detection region on the right hand side. The dimensions\nare not to scale and the diffraction angle θ is in reality smaller\nthan the divergence.\n\nferometer. The gravitational phase shift to be observed\nis (using the notation of [9])\nΦg =\n\n2π\ng τ 2 ≈ 0.003.\nd\n\n(3)\n\nThis is rather small but still an order of magnitude larger\nthan the phase shift due to the acceleration induced\nby the rotation of the earth (Sagnac effect: 4πτ 2 v/d ×\nωearth ≈ 3 × 10−4 ). Other accelerations of the system\nas a whole, e.g. from environmental noise, mainly affect the contrast and must therefore be suppressed. The\nsame is true for misalignments of the gratings and their\ndrifts. The effects must be kept below the phase shift,\nfor example, for an unwanted translation ∆x of the third\n(scanning) grating perpendicular to the M beam and the\nlines of the grating one requires\n2π\n\n∆x\n≤ Φg\nd\n\n(4)\n\nand consequently\n∆x < 0.5 Å = 50 pm.\n\n(5)\n\nRotational misalignment of the gratings around the M\nbeam must be much less than the period over beam\nheight ratio, 100 nm/5 mm, or 20 μrad and corresponding\ndrifts must not exceed 20 nrad. In a similar way, limits\nfor all other static or dynamic deviations from the perfect alignment of the three identical, equidistant, parallel\ngratings can be obtained.\nThe relatively small size of the interferometer is a\nmajor advantage for the stabilization. As in previous\nmatter interferometry experiments [5, 6] the muonium\nexperiment must use (multiple) laser interferometry for\nalignment, monitoring and feedback position stabilization. The gratings for the laser interferometry are ideally\nintegrated in the M atom gratings as perfect alignment\nis required. State of the art piezo systems can be used\nfor positioning the gratings and for scanning of the third\n\n\f3\ngrating with a step precision of 50 pm or better. Because\nit will not be possible to perform a comparative experiment with the (μ− e+ ) system, the gravitational effect on\nthe M atoms will be calibrated with a laser interferometer: In case of a vertical separation of the beam paths\nin the inteferometer, as in Fig. 1, the M fringes will be\nshifted by gravity with respect to the laser interference\npattern. By a π/2 rotation of the setup around the beam\naxis the gravity shift can be removed from the M interference while the laser stays unaffected (the gravitational\nredshift effects can be safely neglected at the level of precision required here). Of course, the Sagnac effect has\nto be taken into account, which does not affect the interference in the vertical but will do so in the horizontal\nposition. Given the possible sensitivity of the experiment it might be just at the edge, but in principle can be\nmeasured by horizontal measurements at π/2 and −π/2\nrotations of the setup, respectively. Also a setup with a\nvertical M beam would allow studying the Sagnac effect\nand the stability of the interferometer. This could also\nbe a first stage of the experiment because for practical\nreasons the M beam development would probably first\nproduce a vertical beam [15].\nThe muonium detection itself is straight forward: the\ne+ from the μ+ decay must be detected in a way that the\nposition of the M atom can be determined to be behind\nthe interferometer. A coincidence signal from the detection system is desirable in order to suppress background\ncoming from the 3 orders of magnitude more muon decays upstream of the third grating. One way to achieve\n\nthis is to detect both, the decay e+ and the remaining\natomic e− from the M atom decay in flight. The e+ (energies up to 53 MeV) could be detected in a scintillation\ndetector which is segmented along the beam axis and surrounds the M beam. The e− (energies of 10 eV) will be\nelectrostatically accelerated out of the decay region onto,\ne.g., a microchannel plate.\nIn conclusion, a muonium gravity experiment appears\nfeasible today. The development of the required M beam\ncould be done within a few years and the interferometer\nset up in parallel and tested with its lasers interferometry offline. It appears possible to have the gravitational\nacceleration of M atoms measured to better than 10%\nwithin the next 5 years.\n\n[1] M. H. Holzscheiter, M. Charlton, M. M. Nieto, The route\nto ultra-low energy antihydrogen\n[2] F. C. Witteborn and W. M. Fairbank, Experimental comparison of the gravitational force on freely falling electrons and metallic electrons, Phys. Rev. Lett. 19, 1049\n(1967).\n[3] R. Colella, A. W. Overhauser, S. A. Werner, Observation\nof gravitationally induced quantum interference, Phys.\nRev. Lett. 34, 1472 (1975).\n[4] B. J. Chang, R. Alferness, E. N. Leith, Space-invariant\nachromatic grating interferometers: theory, Appl. Optics\n14, 1592 (1975)\n[5] M. Gruber et al., A phase-grating interferometer for very\ncold neutrons, Phys. Lett. A 140, 363 (1989).\n[6] D. W. Keith et al., An interferometer for atoms, Phys.\nRev. Lett. 66, 2693 (1991).\n[7] L. M. Simons, private communication, 1995.\n[8] T. J. Phillips, Antimatter gravity studies with interferometry, Hyp. Int. 109, 357 (1997).\n[9] M. K. Oberthaler, Anti-matter wave interferometry with\npositronium, Nucl. Instr. and Meth. B 192, 129 (2002).\n[10] J. H. Gundlach, Laboratory tests of gravity, New J. Phys.\n7, 205 (2005).\n[11] M. M. Nieto and T. Goldman, The arguments against\n\n\"antigravity\" and the gravitational acceleration of antimatter, Phys. Rep. 205, 221 (1991). Erratum, Phys. Rep.\n216, 343 (1992).\nM. Kowitt, Gravitational repulsion and Dirac antimatter,\nInt. J. Theo. Phys. 35, 605 (1996).\nE. G. Adelberger et al., Does antimatter fall with the\nsame acceleration as ordinary matter?, Phys. Rev. Lett.\n66, 850 (1991).\nD. Taqqu, Compression and extraction of stopped muons,\nPhys. Rev. Lett. 97, 194801 (2006).\nD. Taqqu, to be published, private communication and\ncontribution to Workshop on \"Precision Measurements\nat Low Energy\", pmle.web.psi.ch, 2007.\nT. Prokscha et al., The new high-intensity surface muon\nbeam μE4 for the generation of low-energy muons at PSI,\nPhysica B 374-375, 460 (2006).\nT. A. Savas et al., Large-area achromatic interferometric\nlithography for 100 nm period gratings and grids, J. Vac.\nSci. Technol. B 14, 4167 (1996).\nR. E. Grisenti et al., He-atom diffraction from nanostructure transmission gratings: The role of imperfections,\nPhys. Rev. A 61, 033608 (2000).\n\nAcknowledgements\n\nI am indebted to L. M. Simons who, inspired by the\nColella-Overhauser-Werner experiments, put forward the\nidea of measuring the gravitational interaction of antimatter with a Mach-Zehnder interferometer at a conference in the 1980s. He has also repeatedly argued that\nmuonium would be almost completely antimatter and\nthus be a reasonable target for an experimental test of\nits gravitational interaction - suffering only from insufficient source strength. I am also thankful to D. Taqqu for\ndiscussions and explanations concerning the production\nof a suitable muonium beam.\n\n[12]\n[13]\n[14]\n[15]\n\n[16]\n[17]\n\n[18]\n\n\f"}