{"id": "http://arxiv.org/abs/physics/0503132v1", "guidislink": true, "updated": "2005-03-16T10:17:35Z", "updated_parsed": [2005, 3, 16, 10, 17, 35, 2, 75, 0], "published": "2005-03-16T10:17:35Z", "published_parsed": [2005, 3, 16, 10, 17, 35, 2, 75, 0], "title": "General students' misconceptions related to Electricity and Magnetism", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=physics%2F0503170%2Cphysics%2F0503193%2Cphysics%2F0503157%2Cphysics%2F0503088%2Cphysics%2F0503011%2Cphysics%2F0503028%2Cphysics%2F0503128%2Cphysics%2F0503057%2Cphysics%2F0503036%2Cphysics%2F0503048%2Cphysics%2F0503230%2Cphysics%2F0503228%2Cphysics%2F0503165%2Cphysics%2F0503006%2Cphysics%2F0503020%2Cphysics%2F0503096%2Cphysics%2F0503075%2Cphysics%2F0503079%2Cphysics%2F0503095%2Cphysics%2F0503073%2Cphysics%2F0503142%2Cphysics%2F0503199%2Cphysics%2F0503234%2Cphysics%2F0503035%2Cphysics%2F0503063%2Cphysics%2F0503164%2Cphysics%2F0503117%2Cphysics%2F0503043%2Cphysics%2F0503113%2Cphysics%2F0503167%2Cphysics%2F0503089%2Cphysics%2F0503229%2Cphysics%2F0503004%2Cphysics%2F0503194%2Cphysics%2F0503173%2Cphysics%2F0503130%2Cphysics%2F0503177%2Cphysics%2F0503124%2Cphysics%2F0503051%2Cphysics%2F0503100%2Cphysics%2F0503127%2Cphysics%2F0503077%2Cphysics%2F0503010%2Cphysics%2F0503195%2Cphysics%2F0503121%2Cphysics%2F0503002%2Cphysics%2F0503155%2Cphysics%2F0503132%2Cphysics%2F0503034%2Cphysics%2F0503227%2Cphysics%2F0503182%2Cphysics%2F0503171%2Cphysics%2F0503012%2Cphysics%2F0503060%2Cphysics%2F0503050%2Cphysics%2F0503099%2Cphysics%2F0503108%2Cphysics%2F0503061%2Cphysics%2F0503220%2Cphysics%2F0503217%2Cphysics%2F0503090%2Cphysics%2F0503160%2Cphysics%2F0503105%2Cphysics%2F0503081%2Cphysics%2F0503140%2Cphysics%2F0503120%2Cphysics%2F0503001%2Cphysics%2F0503242%2Cphysics%2F0503129%2Cphysics%2F0503238%2Cphysics%2F0503107%2Cphysics%2F0503072%2Cphysics%2F0503198%2Cphysics%2F0503014%2Cphysics%2F0503027%2Cphysics%2F0503236%2Cphysics%2F0503162%2Cphysics%2F0503114%2Cphysics%2F0503215%2Cphysics%2F0503207%2Cphysics%2F0503101%2Cphysics%2F0503143%2Cphysics%2F0503136%2Cphysics%2F0503045%2Cphysics%2F0503175%2Cphysics%2F0503208%2Cphysics%2F0503203%2Cphysics%2F0503064%2Cphysics%2F0503065%2Cphysics%2F0503180%2Cphysics%2F0503110%2Cphysics%2F0411128%2Cphysics%2F0411207%2Cphysics%2F0411171%2Cphysics%2F0411179%2Cphysics%2F0411123%2Cphysics%2F0411085%2Cphysics%2F0411139%2Cphysics%2F0411111%2Cphysics%2F0411163%2Cphysics%2F0411155&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "General students' misconceptions related to Electricity and Magnetism"}, "summary": "Electromagnetism, being much less intuitive than mechanics, where a lot of\nsources of misconceptions have been documented, has in addition to the common\nsources of misconceptions borrowed from mechanics other sources related to the\nabstract new concepts of electric and magnetic fields. This paper is the first\ngeneral overview of the most important documented misconceptions related to\nE&M. New sources of misconceptions are also suggested. The shape of Lorentz\nlaw, tempting analogies between magnetic and electric fields, the connection\nbetween the Maxwell's equations and the derived laws (Ampere's law, the\nBiot-Savart law, Faraday's law and the Coulomb's law for the electric forces)\nand mathematics related misconceptions are among the suggested areas of\nmisconceptions. A possible explanation of some student E&M related\nmisconceptions using p-prims is given in the end of the paper.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=physics%2F0503170%2Cphysics%2F0503193%2Cphysics%2F0503157%2Cphysics%2F0503088%2Cphysics%2F0503011%2Cphysics%2F0503028%2Cphysics%2F0503128%2Cphysics%2F0503057%2Cphysics%2F0503036%2Cphysics%2F0503048%2Cphysics%2F0503230%2Cphysics%2F0503228%2Cphysics%2F0503165%2Cphysics%2F0503006%2Cphysics%2F0503020%2Cphysics%2F0503096%2Cphysics%2F0503075%2Cphysics%2F0503079%2Cphysics%2F0503095%2Cphysics%2F0503073%2Cphysics%2F0503142%2Cphysics%2F0503199%2Cphysics%2F0503234%2Cphysics%2F0503035%2Cphysics%2F0503063%2Cphysics%2F0503164%2Cphysics%2F0503117%2Cphysics%2F0503043%2Cphysics%2F0503113%2Cphysics%2F0503167%2Cphysics%2F0503089%2Cphysics%2F0503229%2Cphysics%2F0503004%2Cphysics%2F0503194%2Cphysics%2F0503173%2Cphysics%2F0503130%2Cphysics%2F0503177%2Cphysics%2F0503124%2Cphysics%2F0503051%2Cphysics%2F0503100%2Cphysics%2F0503127%2Cphysics%2F0503077%2Cphysics%2F0503010%2Cphysics%2F0503195%2Cphysics%2F0503121%2Cphysics%2F0503002%2Cphysics%2F0503155%2Cphysics%2F0503132%2Cphysics%2F0503034%2Cphysics%2F0503227%2Cphysics%2F0503182%2Cphysics%2F0503171%2Cphysics%2F0503012%2Cphysics%2F0503060%2Cphysics%2F0503050%2Cphysics%2F0503099%2Cphysics%2F0503108%2Cphysics%2F0503061%2Cphysics%2F0503220%2Cphysics%2F0503217%2Cphysics%2F0503090%2Cphysics%2F0503160%2Cphysics%2F0503105%2Cphysics%2F0503081%2Cphysics%2F0503140%2Cphysics%2F0503120%2Cphysics%2F0503001%2Cphysics%2F0503242%2Cphysics%2F0503129%2Cphysics%2F0503238%2Cphysics%2F0503107%2Cphysics%2F0503072%2Cphysics%2F0503198%2Cphysics%2F0503014%2Cphysics%2F0503027%2Cphysics%2F0503236%2Cphysics%2F0503162%2Cphysics%2F0503114%2Cphysics%2F0503215%2Cphysics%2F0503207%2Cphysics%2F0503101%2Cphysics%2F0503143%2Cphysics%2F0503136%2Cphysics%2F0503045%2Cphysics%2F0503175%2Cphysics%2F0503208%2Cphysics%2F0503203%2Cphysics%2F0503064%2Cphysics%2F0503065%2Cphysics%2F0503180%2Cphysics%2F0503110%2Cphysics%2F0411128%2Cphysics%2F0411207%2Cphysics%2F0411171%2Cphysics%2F0411179%2Cphysics%2F0411123%2Cphysics%2F0411085%2Cphysics%2F0411139%2Cphysics%2F0411111%2Cphysics%2F0411163%2Cphysics%2F0411155&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Electromagnetism, being much less intuitive than mechanics, where a lot of\nsources of misconceptions have been documented, has in addition to the common\nsources of misconceptions borrowed from mechanics other sources related to the\nabstract new concepts of electric and magnetic fields. This paper is the first\ngeneral overview of the most important documented misconceptions related to\nE&M. New sources of misconceptions are also suggested. The shape of Lorentz\nlaw, tempting analogies between magnetic and electric fields, the connection\nbetween the Maxwell's equations and the derived laws (Ampere's law, the\nBiot-Savart law, Faraday's law and the Coulomb's law for the electric forces)\nand mathematics related misconceptions are among the suggested areas of\nmisconceptions. A possible explanation of some student E&M related\nmisconceptions using p-prims is given in the end of the paper."}, "authors": ["Cristian Raduta"], "author_detail": {"name": "Cristian Raduta"}, "author": "Cristian Raduta", "arxiv_comment": "37 pages", "links": [{"href": "http://arxiv.org/abs/physics/0503132v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/physics/0503132v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "physics.ed-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.ed-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.class-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/physics/0503132v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/physics/0503132v1", "journal_reference": null, "doi": null, "fulltext": "General Students' Misconceptions\nRelated to\nElectricity and Magnetism\n\nCristian Raduta\nPhysics Department\nThe Ohio State University\n\nAdvisor: Prof. Gordon Aubrecht\n\n1\n\n\fTable of Contents\n1) Introduction\n2) Misconceptions related to electricity and magnetism\nA. Students' misconceptions related to application of Faraday's law\nB. Misconceptions related to the interaction between the magnetic field and\nelectric charges\nC. Students failure to recognize important ideas from E&M\nD. Students perception that the electric and magnetic fields are \"static\" in nature\nE. Misconceptions related to erroneous interpretation of a symbol or due to\nambiguous presentations from the textbooks\nF. Misconceptions related to the direction of the Lorentz force and to the\napplication of the right hand rule\nG. E&M misconceptions related to mechanics misconceptions\n3) Suggested areas of \"misconceptions\" related to magnetism and electromagnetism that\nmay have been missed by the current research\nA. Mathematics related misconceptions\nB. Another possible source of misconceptions: tempting analogies between the\nelectric and magnetic fields\nC. Do students make the connection between the Maxwell's equations and the\nderived laws (Ampère's law, the Biot-Savart law, Faraday's law and the\nCoulomb's law for the electric forces)?\nD. Shape of the Lorentz law-another possible source of misconceptions\n4) Commonalities among the incorrect or insufficient ideas students have about magnetic\nfield\nA. Analogies between the electric and magnetic fields are common to a lot of\nstudents' misconceptions\nB. Mathematics related misconceptions generate many of the E&M related\nmisconceptions\nC. Textbooks are also a source of E&M related misconceptions\nD. Mechanics-related misconceptions are reflected in some of the E&M-related\nmisconceptions\n2\n\n\f5) Examples of methods from the literature that have been used to address these\nincorrect or insufficient ideas\n6) Possible explanation of student ideas using p-prims\n7) Conclusions\n\n3\n\n\f1) Introduction\nElectromagnetism, being much less intuitive than mechanics (where a lot of sources\nof misconceptions have been documented), has in addition to the common sources of\nmisconceptions borrowed from mechanics other sources related to the abstract new\nconcepts of electric and magnetic fields. Some Physics Education research intended to\ndetect the major areas of misconceptions in the field of magnetism and electromagnetic\nrelated phenomena has been done.\nThis paper has several purposes: to\na) give an overview of the major areas of misconceptions covered in the literature;\nb) suggest other areas of misconceptions not covered in the literature, and\nc) suggest possible reasons for these misconceptions;\nd) speak about the methodologies of the research that have been focused on\nidentifying these problems of understanding, and also to give some examples from the\nliterature that have been used to address these incorrect or insufficient ideas;\ne) determine what, if anything, there is in common about the insufficient ideas\nstudents have about magnetic concepts; and\nf) discuss whether a p-prim approach or some other way would be a better way to\nthink of these results.\n\n4\n\n\f1) Misconceptions related to electricity and magnetism\nStudents have a lot of misconceptions about Physics even in the field of mechanics,\nwhich is much more intuitive and understandable than the field of electricity and\nmagnetism. First, I am going to present some of the research that has been done to\naddress some of the most important misconceptions related to E&M.\nA. Students' misconceptions related to applying Faraday's law\nFor example, many students have difficulties in understanding the induced emf and\nhow it is produced. Let's take the circuits shown below:\n\nFig.1. Equivalent three-bulb circuits; in a) the bulbs are arranged symmetrical about the source of emf; in b) the bulbs\nare arranged asymmetrically.\n\nP.C. Peter (Ref. 1) has shown that although these are entirely equivalent circuits,\nmany students state that the two bulbs on the left side of the asymmetric circuit will be\ndimmer, reasoning incorrectly that the emf on the left side, ξ/2, drives two bulbs in series,\nwhile the emf on the right side, also ξ/2, drives only one bulb.\nThe right answer, that all the bulbs are equally bright, requires an understanding of\nthe fact that the total induced emf drives the bulbs in series, however they are\n\n5\n\n\fgeometrically placed around the solenoid, and whatever the shape of the circuit\n(triangular or rectangular, etc). He showed also that, just using batteries, bulbs and a\nsolenoid, we could create an almost endless number of problems that could uncover other\nstudents' misconceptions in this field. For example, let's take the circuits shown below:\n\nFig 2. a) two-bulb two circuit with a solenoid that generates a constant emf;\nb) two-bulb circuit shorted around the right side.\n\nAsking the students how the brightness of each bulb changes after connecting a wire\nbetween A and B as shown above, Peter (Ref.1) noticed a lot of confusion among the\nstudents. In general these kind of two-loop circuits in which we have in addition an\ninduced emf are very confusing for the students. The important point here, as observed by\nRomer (Ref. 2), is that the topology of the circuit is very important when there are\ninduced emf's, unlike the case of ordinary dc circuits, which can be deformed in any\nmanner, as long as the ordering of the elements remain the same.\nAnother misconception that was documented by Bagno's study (Ref.6) is that\nstudents have difficulty in determining the direction of the induced emf (actually the \"-\"\nsign from Lenz law: dΦ/dt = -ξ). It is suggested that the major source of difficulty has to\n\n6\n\n\fdo with fuzzy encoding. An examination of the relevant textbooks suggests that sentences\nsuch that \"the induced current resists its cause\" are too vague. Students could very easily\ninterpret these sentences incorrectly. For example, \"oppose the change\" could be easily\ninterpreted as meaning \"being in the opposite direction\".\nB. Misconceptions related to the interaction between the magnetic field and electric\ncharges\nStudents' difficulties in understanding the interactions of electric charges with\nmagnetic fields have been documented by Maloney (Ref. 3). He suggested that this may\nbe caused, at least in part by an alternate idea (a p-prim). Giving the students the figure\nbelow, and requiring the students to rank these situations from the strongest attraction to\nthe strongest repulsion, on the basis of the force exerted by the magnet on the charge, he\nfound several interesting misconceptions.\n\nFig. 3. Different electric charges placed close to the north and south magnetic poles of some permanent magnets\n\nMost of the students answered this survey taking the N pole as being, or acting as though\nit were, positively charged. He implies that a lot of students think of magnetic pole as\nbeing electrically charged: \"Magnet of opposite charge will pull electrons.\" A second\ncategory of the students surveyed by Maloney, spoke of the effect of the poles as\nattractive or repulsive, but they made no statement about the poles' charge. An example\n\n7\n\n\fin this sense is the answers of most students related to the figure from below: \"a negative\ncharge will be attracted to the N pole and a positive charge to\n\nthe S pole.\"\nFig 4. An electric charge coming with velocity between the north and south poles of a permanent magnet.\n\nThe tendency of students to calculate the magnetic force for situations where the\ncharges are not moving, or are moving parallel or anti-parallel to the field, is known to\nanyone who has taught this topic.\nAnother misconception in this sense is that magnetic poles exert forces on electric\ncharges in the plane of the charge and magnet, regardless of whether the charge was\nmoving or not (D. Maloney, Ref.3)). What is interesting to notice is that this\nmisconception prevailed both before and after instruction of the E&M course. Even\nstudents who have not studied the topic, used strategies in answering the questions that\ncan be inferred to be rooted in a \"magnetic poles are charged\" alternate idea.\nC. Students fail to recognize the important ideas from E&M\nIn a study done by Bagno and Eylon (Ref. 4), they asked the students to\nsummarize in a few sentences qualitatively the main ideas of electromagnetism,\naccording to their order of importance, and found the following interesting results. A high\nproportion of the students considered Ohm's law to be one of the most important ideas of\n\n8\n\n\felectromagnetism, which is actually consistent with previous findings (5), which the\nauthor labeled humorously: \"The three principles of electromagnetism: V = IR, I = V/R,\nR = V/I.\" Also, the symmetry that exists between the electric and magnetic fields was not\nreflected in the student' summaries. Fewer than 5% of the students surveyed mentioned\nthe production of magnetic field by a changing electric field (∇xH = J + ∂D/∂tMaxwell's first equation; ∆E/∆t→B-Maxwell's second equation). Even though some of\nthe students surveyed by Bagno remembered the correct formula, only 10% of the\nstudents who remembered the correct formula claimed that a change in the magnetic field\nis accompanied by an electric field. This is another proof of the fact that students do not\nrelate the labels \"Lenz's law\" or \"induced emf\" to the production of an electric field.\nIn a survey done with university level students in France and Sweden (S. Raison\net al., Ref. 16), difficulties arise out of two issues: (i) a causal interpretation of some\nrelationships, (ii) the students' need for an effect, motion of some kind, to allow them to\naccept the existence of a field. Students accept the existence of a cause only when they\ncan imagine an effect. In response to a question involving insulators, many students gave\nan argument that: \"charges cannot move in an insulator, therefore there is no electric\nfield.\"\nAlso students interpret formulas as if the quantities mentioned to the right of\nequal sign were the cause of those mentioned to the left. In the case of Gauss's theorem,\nthis suggests a response such as \"to calculate the electric field, I only need the internal\ncharges,\" or \"the electric field is due only to the internal charges.\" But the students fail\nto say anything about the charges situated in the exterior of a symmetrically charged\nsphere (more than 80% of students' responses were attributed this kind of reasoning).\n\n9\n\n\fTheir study also concluded that for most of the students, electrostatics and electric\ncircuits are two unconnected subjects. A lot of students think that current is the cause of\nthe field, reversing the cause and the effect. Rainson et al. ( Ref. 16) conclude that the\nabove misconceptions (\"field if mobility\"-in order to accept the existence of a field the\nstudent needs to see a motion; \"cause in the formula\"-an erroneous interpretation of a\nmathematical relationship: the quantities on the right side of one relation are seen as the\ncause for the quantities from the left side) are determinant for the difficulties that\nstudents have with a very basic principle of physics, the superposition of electric and\nmagnetic fields.\nD. Students see the electric and magnetic fields as having a \"static\" nature\nAn important misconception to notice is that many students consider the electric\nfield to have a static nature, in the sense that the field exists in the space and applies\nforces on charges, and it does not change even when a new charged particle enters the\nregion. Indeed, from an interview by Bagno et al, when the students were given the\nstatement \"A charged particle enters a region with a constant electric field. The field in\nthis area changes because of the new charge,\" 40% of the students answered incorrectly,\nfrom which 82% of them were saying that \"the electric field is a \"property\" of the\nregion-its task is to apply force on a charge in it.\" The authors (Bagno et al., Ref. 4)\nexplain this misconception by reference to the presentations of the most textbooks, which\nsupport this perception of the students, since the electric field, a difficult and nonintuitive concept, is presented merely as a force applier. They also notice that in general\nproblems from the textbooks deal with static situations such as: \"four charges are fixed in\nthe four corners of a rectangle; find the resultant electric field,\" and do not illustrate the\n\n10\n\n\fdynamic nature of the electric field. Even in the problems in which charged particles are\nentering a region with a constant electric field, students are almost never asked about the\nnew field (they are usually asked about the path of the particle, its velocity, etc). Chabay\nand Sherwood (Ref.6) have made an attempt to develop a dynamic conception of electric\nfields in their recent instructional materials (they included and emphasized also problems\nin which the students are required to find the new electric field after an electric charge\nentered into a region with a constant electric field).\nE. Misconceptions related to erroneous interpretation of a symbol or due to ambiguous\npresentations from the textbooks\nWhen the students surveyed by Bogno et al. were asked whether the statement \"at\nthe point where the electric field is zero, the electric potential is also zero\" is true or not,\n62% of the students chose incorrect answers. The authors offer several explanations for\nthis. It seems that many students don't differentiate between concepts of potential and\npotential difference (student reasoning: E = 0, V(voltage) = ∫E*dr=0, P(potential) = 0).\nAnother source of this misconception could be an erroneous interpretation of a symbol.\nAs usual, textbooks are also a source for misconceptions. The authors explain that the\npresentations from textbooks suggest the possibility that the proximity of introducing the\nelectric field and electric potential, as well as the similarity of the formulas of their\ncalculation, may lead to the confusion of the terms. They say that the problems from\ntextbooks lead to the same impression.\nS. Tornkvist et. al. (Ref. 18) in one of their interviews asked the students to draw\nthe field lines that can account for a given force vector in a given point (see Fig. 5).\n\nP\n11\n\n\fFig.5\n\nOnly 13% of the students considered an inhomogeneous field as the answer to this\nquestion, although they have been given such fields in previous questions. 79% of the\nstudents drew straight equidistant field lines. The authors think that an explanation for\nthis could be the heavy emphasis in textbooks on the homogeneous electric field between\ntwo parallel capacitor plates.\nHarrington in one of his papers (Ref. 19) found that a lot of students (28% of the\ninterviewed students) gave answers to his E&M related questions consistent with the idea\nthat an object that is neutral can be considered negatively charged. Indeed, one of his\nstudents stated: \"It is negative charge because it is not charged. Isn't that what negative\nmeans?\" Another student stated: \"Doesn't positive mean yes, and negative means no?\"\nThese misconceptions could be explained also by the textbooks, which don't repeatedly\nemphasize the distinction among positive, negative and neutral charges.\nF. Misconceptions related to the direction of the Lorentz force and to the application of\nthe right hand rule\nGiving the students the statement, \"the velocity of a charged particle moving in a\nmagnetic field is always perpendicular to the direction of the field,\" 37% of the students\nagreed, out of which group (those students who answered incorrectly) 81% gave answers\nsimilar to: \"v, B, and F are always perpendicular to each other according to the left hand\nor right screw law.\" The authors suggest that the difficulty of the students with this\nstatement is caused by the fact that most of the problems in electromagnetism deal with\ncharged particles whose initial direction is perpendicular to the direction of the magnetic\nfield. This may lead the students to incorrect generalization that the path of a charged\nparticle in a magnetic field is always circular. And, indeed, this is what is happening,\n12\n\n\fbecause, when asked whether the statement \"the path of a charged particle moving in a\nmagnetic field is circular\" is true or false, 60% of the students considered it to be correct.\nG. E&M misconceptions related to mechanics misconceptions\nThe same authors (Bogno et al) showed that misconceptions in one field\n(mechanics) may cause difficulties in another (magnetism). When they asked the students\nwhether or not the statement \"a constant magnetic field never changes the speed\n(magnitude of velocity) of a charged particle which moves in it\" is true, 46% answered it\nincorrectly. Forty percent of the students who gave incorrect answers, attached\nacceleration only to a change in the magnitude of velocity and not in its direction, a well\ndocumented misconception in mechanics.\nGalili (7) studied students' misconceptions from E&M related to the well known\nmechanical misconceptions, thus demonstrating their persistence on the one hand, and\nindicating the relevance of mechanical misconceptions beyond mechanics, on the other\nhand. The students were given the pictures from below and were asked to choose the\ncorrect answer (the relative angular locations of the suspended charges).\n\nFig.6. A double pendulum with two different charges of equal masses\n\nThe straightforward application of Newton's third law (the masses of the two charges are\nthe same) could immediately have provided the correct answer (a symmetrical angular\n\n13\n\n\fdisplacement). However, only a third of the students gave the right answer. They\napparently considered an \"electrical\" question using only \"electrical\" tools, which some\nof them applied correctly, some not. Their reasoning which could sound like, \"the bigger\nthe charge, the bigger the force\" (a p-prim), was wrongly considered, and would lead to\nthe violation of a basic principle, supposed to have been mastered in mechanics: the\nsymmetry of the force interaction (the action-reaction principle, the third Newton law).\nAnother two examples of students' failing to apply the principles of mechanics to\nthe E&M problems are given below.\n\na)\n\nb)\nFig. 7.\n\nThe answers of the students show once again that they tend to miss the general\nconsiderations of action-reaction principle. Indeed, they seem to think in terms of \"field\non charge action\" (indeed, 75% of the students answered in the way shown in figure\n7(a)).\n\n14\n\n\fFig. 8.\n\nThe same failure to apply Newton's third law was observed even more clearly to the next\nquestion given to the students associated with Fig.6 (b), which was actually very similar\nto the first question, only that it was formulated in the context of a magnetic field. Only\nabout 3% of all the students showed a force applied to the magnet due to the currentcarrying wire.\nWork-energy considerations in the presence of electromagnetic fields represent\nanother important aspect of students' understanding. Galili (Ref.7) surveys in this sense\nshow that this is also a critical point. When students were asked about the sources of the\nkinetic energy increase of the electric charge placed in an electric field (Fig. 6 (a)), less\nthan a third of the students answered correctly. But even among the students who\nanswered correctly, few of them have gone beyond the general statement of \"energy\ntransformation,\" which does not mean necessarily that that the students understand the\nprocess. So, Galili's research proves one more time the difficulty of the students have in\nincluding the concept of \"field\" within the mechanics framework previously acquired in\nthe physics courses.\n\n15\n\n\fStudent answers to another question given by Galili (Fig. 8) pointed out the\ndifficulty that the students have when they have to deal simultaneously with both\nmechanics and E&M\n\nFig.9. The students were asked to draw the trajectory of the negatively charged particle in the field created by a positive charge;\n\nOnly two of the students interviewed gave the correct answer. Most of the others\nanswered the question either as in Fig.8 (a) or as in Fig.8 (b). They have the same welldocumented mechanics misconception of confusing the trajectory with the force-line. The\nauthor explains these difficulties of the students by the change of the tools needed to treat\nthe interaction, namely the introduction of a field concept. The field concept presents a\ntopic of high conceptual difficulty for the students. It is commonly introduced through the\nformal operational definition and it could influence in a wrong way the understanding of\nother problematic general principles previously assimilated by students while studying\nmechanics (among them we discussed about Newton's third law, commonly referred the\naction and reactionlaw, and about the work-energy interrelations-which actually by\nthemselves are complicated problems in learning mechanics-e.g. Brown and Clement\n1987, Brown 1989, Lawson and McDermott 1987).\nThe same misconception of confusing the trajectory of a charged particle with the\nfield lines was documented by Tornkvist et. al. (Ref.18). He asked the students to draw a\nlikely trajectory for a particle with zero initial velocity in a given point in a given field\n\n16\n\n\f(see Fig. 10).\n\nFig. 10\n\n76% of the students made the trajectory follow the field line. 7% drew it toward the\nsupposed pole (assumed, implied one), and 6% were completely confused. Only 11% of\nthe students offered reasonable trajectories.\n\n17\n\n\f3) Suggested areas of \"misconceptions\" related to magnetism and\nelectromagnetism that may have been missed by the current research\nCompared to other areas of physics such as mechanics, electricity,\nthermodynamics, etc, where we have a lot of results of Physics Education research\navailable, the field of magnetism and electromagnetism has been much less explored in\nthis sense. So, there should be a lot of areas of misconceptions not yet detected.\nA. Mathematics related misconceptions\nOne very big source of misconceptions in electromagnetism is of course the\nmathematical tools involved, which are a little more sophisticated than those used, let's\nsay, in mechanics. The students should be used to working on a regular basis with vector\nproducts, derivatives, gradients, etc. Let's take for example the Lorentz force:\nF = qvxB;\n\nF = qvBsin(v, B)\n\n(1)\n\nStudents have been taught in almost all the books to find the sense and direction of the\nLorenz force using the \"right hand rule.\" But this is very easy to forget: \"What hand\nshould I use, right or left? But what if the charge is negative?\" The students should learn\nto use the vector product that will appear a lot in the field of electromagnetism. A\ncommon misconception that was noted earlier is that a lot of students think that in the\nLorentz force expression, the velocity and the magnetic field must be perpendicular to\neach other. This is partly, as we said earlier, because most of the applications in\nmagnetism deal with a charged particle coming into a region containing a magnetic field\nwith the velocity being perpendicular to the magnetic field. But this is also because the\nstudents do not know how to handle the vector products. From relation (1), using the\nvector product, it is much clearer than using the right hand rule that the Lorentz force is\n\n18\n\n\fperpendicular to the plane made by v and B, and also that the angle between v and B is\nnot necessarily equal to 90 degrees.\nAnother mathematics source of misconceptions could be the scalar product which\nis involved in the calculation of the electric and magnetic flux. Let's take, for example\nFaraday's law:\n∫ ∫Edr= ξ=-dφ/dt;\n\nφ=∫ ∫BdS\n\n(2)\n\nAs in the case where the students assumed that for the Lorentz force, the velocity and the\nmagnetic field are perpendicular to each other, also here they could very easily implicitly\nassume that the magnetic flux density B is always perpendicular on the surface through\nwhich they calculate the magnetic flux; but situations such as the one from Fig.9 shows\nus that this is not always true.\n\nFig.11\n\nSuch mathematics-related misconceptions could generate a lot of misconceptions\nin the field of magnetism and electromagnetism.\n\n19\n\n\fB. Another possible source of misconceptions: the analogies between the electric and\nmagnetic fields that students are tempted to make\nAnother big source of misconceptions in the field of magnetism could be given by\nthe analogies the students are tempted to make between the electric and magnetic fields,\nanalogies that are not always correct. For example (as in the misconception noted earlier\nin which the students were thinking that magnets could attract electric charges initially at\nrest), it is very easy for them to make the next connection: \"If the electric field is created\nby electric charges, than also the magnetic field should be created by magnetic charges.\"\nBut from the Maxwell relation, div B = 0 (unlike div D = ρ) we know that we don't have\nmagnetic charges (magnetic monopoles).\nC. Do the students make the connection between Maxwell' equations and the derived\nlaws (Ampère's law, the Biot-Savart law, Faraday's law and Coulomb law for the\nelectric forces)?\nOther sources of misconceptions could be very easily the Ampère and the Biot-Savart\nlaws:\n∫H*dS = Ienclosed (Ampère's law);\n\ndB = μ0I(dlxr)/4πr3\n\n(3)\n\nOne source of misconceptions here is of course the one generated by mathematics (we\ndiscussed this earlier). But, if we would ask the students let's say about the magnetic field\ncreated by a long straight current at a distance r, maybe a lot of students would come up\nwith the correct magnetic field shape or sense, or even with the correct quantitative\nformula memorized like a poem. But I am sure that very few of them would make any\nconnection between the shape and magnitude of the magnetic field that they memorize\nand the Ampère or Biot-Savart laws. If we would ask them further more how the Biot-\n\n20\n\n\fSavart or Ampère laws were derived, from which of Maxwell's equations (1-st Maxwell\nlaw ∇xH=J+∂D/∂t), I'm sure that we would create even bigger confusion.\nWe would create the same confusion if we would ask them about the relation\nbetween the second law of Maxwell (∇xE=-∂B/∂t) and the Faraday's law (∫E*dS=dΦ/dt), or the relation between the fourth law of Maxwell (∇*D=ρ) and the Coulomb law\n(F21=q1q2r/4πε0 r3). It is very possible that they won't make any connection between\nthese laws, considering them as independent.\nD. Shape of Lorentz force--another possible source of misconceptions\nA big source of misconceptions in the field of magnetism, I think is the shape of\nthe Lorentz force: F=qvxB. For the first time in their studies in Physics students\nencounter something totally different. Up to that moment, the forces that they have\nlearned were always along the direction of the two objects (in mechanics), or, where it\nwas also included a field (as in electrostatics or with the gravitational field), the forces\nwere along the direction of the field. Now, the situation is different. The direction of the\nforce is perpendicular to the magnetic field and the velocity of the particle, and so is\nsomething totally different from what they used to see.\nOf course there are more areas of misconceptions related to electromagnetism that\nI haven't touched in this paper. The suggested areas of misconceptions that I gave above,\nof course, are at this moment just speculations (assuming that they have not already been\ntaken into account by others). But by designing specific surveys focused on these aspects,\nwe could see how serious these potential areas of misconceptions are.\n\n21\n\n\f4) Common things about the incorrect or insufficient ideas students have\nabout magnetic concepts\nA. Analogies between the electric and magnetic fields are common to a lot of students'\nmisconceptions\nOne thing in common about many of their misconceptions is the fact that they are\ntempted to make analogies between the electric and magnetic fields, analogies that, many\ntimes do not work properly. As we discussed earlier, they are tempted to think that\nmagnets interact with static charges (the N pole attracts negative charges and the S polo\nattracts positive charges). They are also tempted to think that because we have electric\ncharges, we should definitely have magnetic charges. They do not feel too comfortable\nwith the direction of the Lorentz force, and they are tempted to think that it should be in\nthe same plane with the magnetic field and the charge. Probably they don't feel too\ncomfortable with the idea that the magnetic field is produced by moving electric charges,\nwhile in the case of electric field, the charges do not necessarily have to move in order to\ncreate an electric field.\nB. Mathematics related misconceptions generate many of the E&M related\nmisconceptions\nAnother thing in common about their incorrect or insufficient ideas about the\nmagnetic concepts is their poor understanding of the vector and scalar products. These\nproducts appear almost anywhere in the field of magnetism: in the Lorentz force, in the\nmagnetic flux, in Ampère's law or in the Biot-Savart law. If they will not be able to be\nmore confident with these simple products, they will have basic problems with a lot of\nconcepts from magnetism. For example, an incorrect understanding of one magnetic\n\n22\n\n\fconcept, (such as the magnetic flux, which the student might get correct up to a cosine of\nan angle), could generate incorrect answers in a chain (for example, he will write\nFaraday's law correctly again up to a cosine). In the same way, if the student does not\nmaster sufficiently well the vector products, he (or she) will not apply correctly the BiotSavart law, the Lorenz force or Maxwell's second equation (∇xE = -∂B/∂t) from which is\nderived Faraday's law. So, these mathematics-related misconceptions will be reflected in\nE&M misconceptions.\nC. Textbooks are also a source of E&M related misconceptions\nA big source of a lot of misconceptions that students have in the field of\nelectromagnetism is the way that textbooks present the subject. As Bagno noticed, in\nmost of the textbooks, Ohm's law is central, and this is happening in the presentation of\nthe theory and also in the exercises associated to the theory. So, it is not surprising that\nOhm's law was found in Bagno's surveys to be considered by students one of the most\ncentral laws of electromagnetism. Bagno et al also observed that most of the textbooks do\nnot emphasize the idea that a change in the magnetic field is related to the production of\nan electric field, while the idea of induced emf is emphasized in the theory and the\nassociated exercises. So, it is not surprising that students do not associate labels such as\n\"Lenz's law\" or \"induced emf\" with the production of the electric field.\nD. Mechanics-related misconceptions are reflected in some of the E&M-related\nmisconceptions\nAlso, misconceptions that students have from mechanics could generate other\nmisconceptions in the field of E&M (I gave several examples earlier). But we could have\nconcepts from mechanics which the student seems to understand pretty well in the\n\n23\n\n\fcontext of mechanics, that, when integrated in the context of E&M could create a lot of\nmisconceptions.\nFor example in the problem associated with Fig.6-a double pendulum with two\ndifferent charges of equal masses-it is likely that a high percentage of the students who\ngave a wrong answer to the question related to the angular displacement of the two\npendula, would have answered this type of question-involving the 3-rd principle of\nMechanics-correctly in the field of mechanics. It seems that for some of the students it's\ndifficult to deal simultaneously with concepts from both fields (Mechanics and E&M).\n\n24\n\n\f5) Examples of methods from the literature that have been used to address\nthese incorrect or insufficient ideas\nSurveys and interviews are the most common way in which researchers in Physics\nEducation try to detect the students' misunderstandings. For example, Maloney (Ref. 3),\nwanted to determine whether or not the students were thinking of magnetic poles as\nexerting forces directly on the electric charges, in a manner similar to the behavior of\nelectrostatic charges. He gave the students two problem situations, presented in different\nformats. Both formats were designed so that he could determine the strategies the\nstudents applied to the problems.\nOne of the problem situations had an electric charge moving at a right angle to the\nfield between the pole faces of a two permanent magnets, in the plane of the magnetic\nfield. Changing the polarities of the two magnets and the sign of the charge, as in the\ntable below, several similar problems could be given to the students.\nTable 1.\nProblem type\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n\nPolarities\nBoth N\nBoth N\nBoth S\nBoth S\nBoth N\nBoth N\nBoth S\nBoth S\nOpposite\nOpposite\n\nStrengths\nEqual\nEqual\nEqual\nEqual\nDifferent\nDifferent\nDifferent\nDifferent\nEqual\nEqual\n\nCharge\n+\n+\n+\n+\n+\n-\n\nBy analyzing their answers, the author could detect the strategies used by students . The\nstudent's sequence and the sequence of an identified strategy were considered to match\nwhen there were no more than three differences between the two sequences. The students\nwere asked the same question for all the similar problems: \"Which way will the electric\n\n25\n\n\fcharge be pushed as it moves through the area between the poles? \" (the possible answers\nwere that \"the charge will move toward magnet A,\" or \"the charge will move toward\nmagnet B,\" or \"the charge will go straight from this view\" –see Fig. 4). The most popular\nindividual strategy was the one that took the N-pole as being, or acting as though it were,\npositively charged. Discounting the people who were not consistent (the muddlers), the\nnext most popular strategy had both types of charges being attracted to the stronger\nmagnetic pole, whatever its polarity. The results of the survey could be seen in Table 2.\nTable 2. Percentages of students using each rule for particles in a magnetic field\nRule\n+ to N, - to S\n- to N, + to S\n+ and – both to\nstronger (weaker)\nMuddle\nMiscellaneous\nAll equal\nNo fit\n\nClass of Spr 84\n8\n28\n21\n\nClass of Sum 84\n14\n29\n19\n\n19\n14\n7\n4\n\n14\n14\n10\n0\n\nThe second problem situation (the \"ranking task\") that Maloney gave to the students had\nan electric charge sitting at rest near one pole of a permanent magnet. (see Fig3). The\nstudents were asked to rank the interactions between the magnets and the charges from\nthe strongest to the weakest. He gave the \"ranking task\" problem to four classes, among\nwhich two hadn't had any college level instruction on electromagnetism. The results of\nthe survey were summarized in the table 3 from below:\nTable 3. Percentage of students using specified rule on ranking task.\nClass\n202 Spr 84\n202 Sum 84\n204 Spr 84\n204 Sum 84\n\nN attr 50\n59\n42\n55\n\nN attr +\n14\n27\n13\n20\n\nAll same\n0\n0\n11\n15\n\n26\n\nMisc\n12\n0\n7\n0\n\nNo fit\n24\n14\n26\n10\n\nn\n58\n22\n114\n20\n\n\fWhat is important to notice here, is the similarity between the pre-instruction and postinstruction results. We notice also the similarities within the pre-test and post-test groups.\nFor all classes the strategy that treats the N pole as being positive is the most popular.\nAnalyzing all these results, Maloney could come up with all the suggestions that we've\ndiscussed earlier in the section of misconceptions.\nPeter, trying to detect the students' misconceptions related to the double-loop\ncircuits, in which there is also an induced emf due to a solenoid, gave to the students the\nnext problem (see also Fig. 10.)\n\nFig.12.\n\nIn the circuit shown in the diagram, the current in the solenoid ( a long solenoid oriented\nperpendicular to the figure) is in the direction shown and is increasing linearly with time.\nThe battery has a voltage equal to the emf of a loop around the solenoid. The bulbs are all\nthe same, and for calibration, one bulb connected to the battery has brightness B1, two\nbulbs in series connected to the battery have brightness B2, three B3, etc. The internal\nresistance of the battery is much less than the resistance of the bulbs.\na) Give the brightness of each bulb for the circuit as shown.\n\n27\n\n\fFor each of the following parts, give the brightness of each bulb when the indicated\nalteration is made on the original circuit:\nb) Bulb #1 is unscrewed.\nc) Bulb #2 is unscrewed.\nd) The wire is cut at C.\ne) The circuit is shorted from A to B by a wire around the left side of the circuit.\nf) The circuit is shorted from A to B by a wire around the left side of the circuit.\nOut of fifty students answering the questions, the percentages of correct answers for each\npart were: a) 13%, b) 46%, c) 69%, d) 81%, e) 26% and f) 61%. The author explains that\nquestion a) had the lowest rate of success also because it requires looking at two different\nloops in order to obtain the answer. Also, questions b), c) and d) being simple one-loop\ncircuits have a higher rate of success.\nBagno in one of her papers (4) uses a diagnostic survey that looked into students'\nknowledge representation in the domain of electromagnetism. Her investigation\nexamined three questions:\n1) Which ideas students view as central in electromagnetism? Are their key\nrelationships summarized by Maxwell's equations?\n2) Under what form do students represent the main ideas? Do they give also a\nqualitatively representation of the relations or only a mathematical one?\n3) Do the students understand the key relations in electromagnetism? Do they know\nto apply the relations in solving problems?\nHaving these three questions as a central point of the investigation, Bagno designed the\nsurvey meant to detect the students' main ideas in electromagnetism as follows:\n\n28\n\n\fa) Free recall: \"Summarize in a few sentences the main ideas of electromagnetism\naccording to the order of their importance. Don't use formulas!\"\nb) Cued recall: The cues were labels, intended to facilitate access. The task\nsounded in the following manner: \"Next to each of the following concepts, write as many\nrelationships as possible that include the concept: (i) Electric Field (ii) Magnetic Field.\"\nIn order to test the form of representation for the electromagnetism key relationships,\neach statement was categorized into one of the following:\n1) A qualitative verbal statement about a relationship or property of a concept. For\nexample: \"An electric charge produces an electric field.\"\n2) A verbal translation of a formula. Example: \"Current equals charge over time.\"\n3) A mathematical formula: Example: F=qvxB.\n4) A label. Example: \"Gauss's law,\" \"electric field.\" See Table 4.\nTable 4.\nAverage performance of the various categories of form in the diagnostic study (N=250)\nForm\n(a) qualitative\n(b) \"verbal\" formula\n(c) formula\n(d) label\n\n% out of total\nnumber of statements\n45%\n20%\n0%\n18%\n\nTo test the conceptual understanding related to electromagnetism, Bagno gave her\nstudents several statements (e.g., \"A constant magnetic field never changes the speed\n(magnitude of velocity) of a charged particle which moves in it.\") for which the students\nhad to answer whether or not they are correct. I analyzed several of those statements and\nstudents' answers in the section related to students' misconceptions to electromagnetism.\n\n29\n\n\f6)\n\nPossible explanation of students' ideas using p-prims\nP-prims or \"phenomenological primitives\" could be another explanation for some\n\nof the students' misconceptions related to E&M. P-prims are relatively minimal\nabstractions (diSessa, (9)) of simple common phenomena. They are explanations that the\nstudents used to explain all kind of phenomena from the surroundings before learning any\nphysics at all. Physics-naive students have a large collection of these p-prims in terms of\nwhich they see the world and to which they appeal as self-contained explanations for\nwhat they see. In the process of learning physics, some of these p-prims cease being\nprimitives (and are seen by being explained by other notions), and some may even cease\nbeing recognized at all. Some of these p-prims could be the cause of some of students'\nmisconceptions in E&M. In the table below we have a list of a few well-known p-prims.\nTable5. A list of some well-known p-prims\n1) Ohm's p-prims\n\n2) Rolling and Pivoting\n3) Dying Away\n\n4) Force as a mover\n(false intuition)\n5) cause as a center, as a\nnucleus (not confirmed yet)\n\n--it comprises of three elements: impetus, a resistance and a result;\n--qualitative correlations: increase in impetus implies an increase in result; increase in\nresistance means a decrease in result; etc\n--very commonly used, high priority p-prim\n--context of application: ex; pushing harder in order to make objects move faster\n--Ohm's P-prim becomes profitably involved with the physical Ohm's Law as a model\nof causality and qualitative relations compatible with it;\n--I think the definition want to look more savant than it really is. I would condense\nbetter this definition in :\"More is more, or bigger cause implies bigger effect\"\n--a p-prim? I think is to narrow the spectrum of contexts in which this could be applied\n--rolling and pivoting, especially the latter one, are sometimes confusing for students\nAristotel explicitly cited the dying away of certain actions like the dying away of sound\nfrom a bell as a primitive element of analysis that one does not seek to explain but\nsimply is so;\nContext of application: students assume a constant force is needed to maintain a\nconstant velocity;\n--force causes motion in the direction of the force, ignoring the effect of the previous\nmotion;\n--students see the causes that produces a lot of effects as being condensed in a center, in\na nucleus, like the Sun, electric charges, etc.\n\n30\n\n\fFor instance, in the article by Maloney (Ref.3), we have seen that before and after\nthe instruction, most of the students thought that magnets interact with electric charges at\nrest; most of them took the N-pole as being, or acting as though it were, positively\ncharged, etc. This is definitely an example of a p-prim, which was so strong rooted into\nthe students' minds, that even after the E&M instruction it couldn't be eliminated. This\ngeneral p-prim could be written as: \"opposites attract and likes repel each other.\"\nThe terms \"magnetism\" and \"magnetization\" were heard by the students even\nbefore they came for the first time in contact with physics or E&M, in contexts totally not\nrelated with electromagnetism. A lot of times, we've all heard expressions such as: \"this\nactor has a certain magnetism, a certain charisma\", or \"I feel magnetized by her or by\nhim\". So, even before taken the course of E&M most of the students had their own vague\nidea (explained by a p-prim) about magnetism, or magnetization. Making also the\nanalogy with what they see happening between a magnet and a piece of metal (or\nbetween the cinema stars and the fans-attraction), they are tempted to infer that the same\nhappens between magnets and static electric charges. Also, if we analyze the expressions\nabove, we can conclude that is very easy for the students to make the connection that it\nhas to be a source for the magnetic field (the actor, or the man or woman in our example)\nsimilar to the one for the electric field, like some point or some place, which emits the\nmagnetic field. Also, the lines of the field that they are inclined to think about should be\nradial, from the actor to the fans, like the rays of the Sun (from the Sun to Earth, from the\nmagnetic charge to the electric charge). This is probably why they are also tempted to\nthink even after the instruction that it should be a magnetic charge, which is responsible\nfor the magnetic field. This could also explain why they don't feel comfortable with the\n\n31\n\n\fshape of the Lorenz force, which is not \"along the ray\" as they would like to think about\nit. So, these are the first intuitive images that the students are tempted to think about, and\nwhich came perhaps naturally to most of us in our imagination when we wanted to\nheuristic explain the term of \"magnetization\" before learning E&M. All these things\ncould be explained by general p-prims like: \"every effect (thing) should have a clear\ncause (source)\"-this is why the students think that it should be some kind of magnetic\ncharge responsible for the magnetic field. Another p-prim could be: \"The interaction\nbetween things is happening in a radial way.\" This is why they don't feel comfortable\nwith the shape of Lorentz force. Still another p-prim could be: \"cause as a center, as a\nnucleus.\" Students see the cause that produces a lot of effects, as being condensed in a\ncenter, in a \"nucleus,\" like the Sun, electric charges, etc.\nAnother example of a p-prim emerges from the survey done by Galili (Ref. 7-see\nFig. 5) Their reasoning that could sound like, \"the bigger the charge, the bigger the\nforce\" is definitely a p-prim. They totally forgot about the basic principle of Mechanics\n(Newton's third law), or about the symmetry of the electric force of Coulomb. Their\nstrong idea that in general \"something bigger should cause something also bigger,\" (in\nour case a bigger force and a bigger angle), lead them to forget about whatever other\nprinciples that they have learned along their physics studies. Something that is rooted for\nlong time in their thinking structure, in their own way of seeing the things, of course that\nshould be stronger than some rules (physics laws) that they have learned by heart,\nwithout having any resonance with their way of feeling and thinking. This p-prim that\ncould have caused this kind of reasoning could sound like: \"more implies more, or bigger\ncause implies bigger effect.\"\n\n32\n\n\fIt is important to know about a naive physics student repertoire of p-prims related to\nE&M. Knowing their p-prims, we could make all kind of analogies related to their pprims when trying to teach them more advanced physics concepts.\n\n33\n\n\f7) Conclusions\nEven though, not so much Physics Education research has been done in the field of\nmagnetism and electromagnetism, many important students' misconceptions have already\nbeen detected. A lot of them appear to have their roots in the textbook presentations of\nthe subject. Sometimes, things that should have been emphasized and stated several times\nin order to insure the successful understanding of the concepts, are just written very\nbriefly in a way that tempts students to think that are not worth learning (or even\nremembering).\nOther times the textbooks wording is very ambiguous, with double meanings\npossible, leading the students to understand something else than they should understand.\nAlso the examination, by myself, of the textbooks shows that there is no emphasis on the\nqualitative analysis and verbal statement of relationships. Also, although some of the\ntextbooks attempt to organize the information locally (e.g., within a single chapter) by\nmaking a summary or a table, there are no comprehensive attempts to organize the\ninformation at a global level (which would facilitate students connections between\ndifferent concepts of electromagnetism-instead of seeing just the trees, to see the whole\nforest, relating the trees from the south with the ones from the north, and so on).\nAnother big source for students' misconceptions is also the mathematical tools\nthat they must learn to handle while they are learning the subject of electromagnetism. A\nlot of students have difficulties with vector or scalar products, which are fundamental for\nthe successful understanding of magnetism and thus electromagnetism. They probably\nhave even more difficulties with gradients, divergences or laplacians.\n\n34\n\n\fPrevious misconceptions from mechanics or the analogies that students make\nbetween the electric and magnetic field are other important sources of misconceptions.\nAnd why not admit that one of the biggest sources of misconceptions is the small amount\nof time allotted (and most of the time in a rush with the eyes on the watch) by the\nstudents to learning electromagnetism (and in general in college). Probably, the rush for\ngetting the credits, for making so many other assignments for other classes that they take,\nfor getting their degree done one way or another, is killing their real interest for deeper\nstudy of electromagnetism's concepts.\nMaxwell's equations (and, in general the whole field of E&M) are constructed out\nof deep concepts that have been developed after a lot of thought done by brilliant\nPhysicists along the history of Physics. That's probably why E&M cannot be totally\nsuccessfully covered in a few hours per week, done in a rush by most of the students just\nfor getting done the homework.\nProbably we should do something to awaken their real interest for physics, for\ndiscovering the unknown in general, for wanting to probe deeper into the concepts of\nmagnetism. Maybe a redesigning of the way the classes are taught, and the way homeworks are treated would be a good first step. Maybe more analogies with things that they\nunderstand (and probably like) would be another idea. Or maybe raising the level at\nwhich they study magnetism in high-school a bit (for example, see Bagno (Ref. 4)- the\nlevel at which electromagnetism is done in high-schools in Israel is similar to the one\ndone in the first year in US colleges; and this is happening in a lot of other countries-most\ncountries from Europe) would be another idea. The difference between the level at which\n\n35\n\n\fthe magnetism was done in high-school and the one from the colleges is maybe to big to\nbe so easily and fast assimilated by the students in such a short amount of time.\n\nAcknowledgement: I would like to thank Prof. Gordon Aubrecht for the help that he\nhas given me all along my studies in Physics Education.\n\nReferences\n1) P. C. Peters, Am. J. Phys., 52, (1984).\n2) R. H. Romer, Am.J.Phys. 50, (1982).\n3) D.P. Maloney, Phys. Educ. 20, (1985).\n4) E. Bagno and Bat-Sheva Eylon, Am J. Phys. 65, (1997).\n5) \"The three laws of electricity,\" (Cover), Phys. Today, 36, (1983).\n6) R. Chabay and B. Sherwood, Electric and Magnetic Interactions (Wiley, New York,\n1995).\n7) I. Galili, Int. J. Sci. Educ. 17, (1995).\n8) Monica G.M. Ferguson-Hessler and Ton de Jong, Am. J. Phys. .55, (1987).\n9) Andrea A. diSessa, \"Phenomenology and the Evolution of Intuition,\" Mental Models.\n10) J. Evans, Phys. Teach. 16, (1980).\n11) N. Fredette and J. Lochhead, Phys. Teach. 18, (1980).\n12) J. Clement, Am. J. Phys. 50, (1982)\n13) D.E.Brown, Physics Education, 24, (1989).\n14) A. Arons, Phys. Teach. 22, (1984).\n15) A. Arons, Phys. Teach. 22, (1984).\n\n36\n\n\f16) S. Raison et al., Am. J. Phys. 62, (1994).\n17) R. Gutierrez and J. Ogborn, Int. J. Sci. Educ. 14, (1992).\n18) S. Tornkvist, K. A. Pettersson, and G. Transtromer, Am. J. Phys. 61, (1993).\n19) R. Harrington, Am. J. Phys. Suppl. 67, (1999) (Phys. Educ. Res. Suppl.).\n\n37\n\n\f"}