{"id": "http://arxiv.org/abs/physics/0001015v1", "guidislink": true, "updated": "2000-01-06T16:35:19Z", "updated_parsed": [2000, 1, 6, 16, 35, 19, 3, 6, 0], "published": "2000-01-06T16:35:19Z", "published_parsed": [2000, 1, 6, 16, 35, 19, 3, 6, 0], "title": "Using atomic interference to probe atom-surface interaction", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=physics%2F0411213%2Cphysics%2F0411106%2Cphysics%2F0411076%2Cphysics%2F0411162%2Cphysics%2F0411108%2Cphysics%2F0411096%2Cphysics%2F0411246%2Cphysics%2F0411012%2Cphysics%2F0411239%2Cphysics%2F0411068%2Cphysics%2F0411245%2Cphysics%2F0411064%2Cphysics%2F0411138%2Cphysics%2F0411252%2Cphysics%2F0411230%2Cphysics%2F0411181%2Cphysics%2F0411026%2Cphysics%2F0411177%2Cphysics%2F0411161%2Cphysics%2F0411086%2Cphysics%2F0411073%2Cphysics%2F0411240%2Cphysics%2F0411041%2Cphysics%2F0411065%2Cphysics%2F0411165%2Cphysics%2F0411121%2Cphysics%2F0411194%2Cphysics%2F0411235%2Cphysics%2F0411204%2Cphysics%2F0411193%2Cphysics%2F0411243%2Cphysics%2F0411237%2Cphysics%2F0411084%2Cphysics%2F0411112%2Cphysics%2F0411107%2Cphysics%2F0411210%2Cphysics%2F0411192%2Cphysics%2F0411045%2Cphysics%2F0411151%2Cphysics%2F0001031%2Cphysics%2F0001013%2Cphysics%2F0001071%2Cphysics%2F0001030%2Cphysics%2F0001033%2Cphysics%2F0001051%2Cphysics%2F0001035%2Cphysics%2F0001060%2Cphysics%2F0001049%2Cphysics%2F0001025%2Cphysics%2F0001043%2Cphysics%2F0001057%2Cphysics%2F0001020%2Cphysics%2F0001021%2Cphysics%2F0001027%2Cphysics%2F0001010%2Cphysics%2F0001019%2Cphysics%2F0001041%2Cphysics%2F0001042%2Cphysics%2F0001004%2Cphysics%2F0001037%2Cphysics%2F0001022%2Cphysics%2F0001002%2Cphysics%2F0001059%2Cphysics%2F0001053%2Cphysics%2F0001023%2Cphysics%2F0001072%2Cphysics%2F0001066%2Cphysics%2F0001017%2Cphysics%2F0001005%2Cphysics%2F0001028%2Cphysics%2F0001003%2Cphysics%2F0001068%2Cphysics%2F0001054%2Cphysics%2F0001069%2Cphysics%2F0001006%2Cphysics%2F0001038%2Cphysics%2F0001008%2Cphysics%2F0001044%2Cphysics%2F0001029%2Cphysics%2F0001056%2Cphysics%2F0001047%2Cphysics%2F0001040%2Cphysics%2F0001001%2Cphysics%2F0001067%2Cphysics%2F0001015%2Cphysics%2F0001063%2Cphysics%2F0001012%2Cphysics%2F0001050%2Cphysics%2F0001052%2Cphysics%2F0001024%2Cphysics%2F0001046%2Cphysics%2F0001016%2Cphysics%2F0001039%2Cphysics%2F0001065%2Cphysics%2F0001058%2Cphysics%2F0001011%2Cphysics%2F0001032%2Cphysics%2F0001014%2Cphysics%2F0001007%2Cphysics%2F0001009%2Cphysics%2F0001070&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Using atomic interference to probe atom-surface interaction"}, "summary": "We show that atomic interference in the reflection from two suitably\npolarized evanescent waves is sensitive to retardation effects in the\natom-surface interaction for specific experimental parameters. We study the\nlimit of short and long atomic de Broglie wavelength. The former case is\nanalyzed in the semiclassical approximation (Landau-Zener model). The latter\nrepresents a quantum regime and is analyzed by solving numerically the\nassociated coupled Schroedinger equations. We consider a specific experimental\nscheme and show the results for rubidium (short wavelength) and the much\nlighter meta-stable helium atom (long wavelength). The merits of each case are\nthen discussed.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=physics%2F0411213%2Cphysics%2F0411106%2Cphysics%2F0411076%2Cphysics%2F0411162%2Cphysics%2F0411108%2Cphysics%2F0411096%2Cphysics%2F0411246%2Cphysics%2F0411012%2Cphysics%2F0411239%2Cphysics%2F0411068%2Cphysics%2F0411245%2Cphysics%2F0411064%2Cphysics%2F0411138%2Cphysics%2F0411252%2Cphysics%2F0411230%2Cphysics%2F0411181%2Cphysics%2F0411026%2Cphysics%2F0411177%2Cphysics%2F0411161%2Cphysics%2F0411086%2Cphysics%2F0411073%2Cphysics%2F0411240%2Cphysics%2F0411041%2Cphysics%2F0411065%2Cphysics%2F0411165%2Cphysics%2F0411121%2Cphysics%2F0411194%2Cphysics%2F0411235%2Cphysics%2F0411204%2Cphysics%2F0411193%2Cphysics%2F0411243%2Cphysics%2F0411237%2Cphysics%2F0411084%2Cphysics%2F0411112%2Cphysics%2F0411107%2Cphysics%2F0411210%2Cphysics%2F0411192%2Cphysics%2F0411045%2Cphysics%2F0411151%2Cphysics%2F0001031%2Cphysics%2F0001013%2Cphysics%2F0001071%2Cphysics%2F0001030%2Cphysics%2F0001033%2Cphysics%2F0001051%2Cphysics%2F0001035%2Cphysics%2F0001060%2Cphysics%2F0001049%2Cphysics%2F0001025%2Cphysics%2F0001043%2Cphysics%2F0001057%2Cphysics%2F0001020%2Cphysics%2F0001021%2Cphysics%2F0001027%2Cphysics%2F0001010%2Cphysics%2F0001019%2Cphysics%2F0001041%2Cphysics%2F0001042%2Cphysics%2F0001004%2Cphysics%2F0001037%2Cphysics%2F0001022%2Cphysics%2F0001002%2Cphysics%2F0001059%2Cphysics%2F0001053%2Cphysics%2F0001023%2Cphysics%2F0001072%2Cphysics%2F0001066%2Cphysics%2F0001017%2Cphysics%2F0001005%2Cphysics%2F0001028%2Cphysics%2F0001003%2Cphysics%2F0001068%2Cphysics%2F0001054%2Cphysics%2F0001069%2Cphysics%2F0001006%2Cphysics%2F0001038%2Cphysics%2F0001008%2Cphysics%2F0001044%2Cphysics%2F0001029%2Cphysics%2F0001056%2Cphysics%2F0001047%2Cphysics%2F0001040%2Cphysics%2F0001001%2Cphysics%2F0001067%2Cphysics%2F0001015%2Cphysics%2F0001063%2Cphysics%2F0001012%2Cphysics%2F0001050%2Cphysics%2F0001052%2Cphysics%2F0001024%2Cphysics%2F0001046%2Cphysics%2F0001016%2Cphysics%2F0001039%2Cphysics%2F0001065%2Cphysics%2F0001058%2Cphysics%2F0001011%2Cphysics%2F0001032%2Cphysics%2F0001014%2Cphysics%2F0001007%2Cphysics%2F0001009%2Cphysics%2F0001070&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We show that atomic interference in the reflection from two suitably\npolarized evanescent waves is sensitive to retardation effects in the\natom-surface interaction for specific experimental parameters. We study the\nlimit of short and long atomic de Broglie wavelength. The former case is\nanalyzed in the semiclassical approximation (Landau-Zener model). The latter\nrepresents a quantum regime and is analyzed by solving numerically the\nassociated coupled Schroedinger equations. We consider a specific experimental\nscheme and show the results for rubidium (short wavelength) and the much\nlighter meta-stable helium atom (long wavelength). The merits of each case are\nthen discussed."}, "authors": ["R. Marani", "L. Cognet", "V. Savalli", "N. Westbrook", "C. I. Westbrook", "A. Aspect"], "author_detail": {"name": "A. Aspect"}, "author": "A. Aspect", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevA.61.053402", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/physics/0001015v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/physics/0001015v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "11 pages, including 6 figures, submitted to Phys. Rev. A, RevTeX\n  source", "arxiv_primary_category": {"term": "physics.atom-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.atom-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/physics/0001015v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/physics/0001015v1", "journal_reference": "R. Marani et al., Phys. Rev. A, 61, (2000), 053402", "doi": "10.1103/PhysRevA.61.053402", "fulltext": "Using atomic interference to probe atom-surface interaction\nRoberta Marani, Laurent Cognet, Veronique Savalli, Nathalie Westbrook, Christoph I. Westbrook, Alain Aspect\n\narXiv:physics/0001015v1 [physics.atom-ph] 6 Jan 2000\n\nLaboratoire Charles Fabry de l'Institut d'Optique, Unité Mixte du CNRS n◦ 8501, BP 147, 91403 Orsay CEDEX, France\n(November 19, 2018)\nWe show that atomic interference in the reflection from two suitably polarized evanescent waves is\nsensitive to retardation effects in the atom–surface interaction for specific experimental parameters.\nWe study the limit of short and long atomic de Broglie wavelength. The former case is analyzed\nin the semiclassical approximation (Landau-Zener model). The latter represents a quantum regime\nand is analyzed by solving numerically the associated coupled Schrödinger equations. We consider\na specific experimental scheme and show the results for rubidium (short wavelength) and the much\nlighter meta-stable helium atom (long wavelength). The merits of each case are then discussed.\n\nI. INTRODUCTION\n\nThe interaction between a ground–state atom and a dielectric or conducting wall has been investigated theoretically\n( [1], [2], [3], [4], [5], [6], [7], [8], [9], [10]) and experimentally ( [11], [12], [13], [14]). Theoretical studies have been\nperformed on different levels, from a simple model of a dipole–dipole interaction of the atom and its mirror image, to\nthe full QED relativistic quantum treatment. Interesting in particular are the long–range Casimir interactions [6] that\nwere recently observed in cavity QED experiments [13], [14]. When the atom–wall distance z is not small compared\nto the wavelength of the dominant atomic transitions, the z −3 law associated with the instantaneous electrostatic\ninteraction is no longer valid. The full QED treatment leads to the famous long distance z −4 law.\nRecent experimental developments enable precise manipulation of cold atoms by lasers, see e.g. Ref. [15]. Small and\nwell defined velocities of the atoms can be achieved using advanced cooling and launching techniques and a detuned\nlaser field can be used to create controlled and adjustable potentials for the atoms. Under these conditions, atoms\ncan be used to explore the atom–surface potential, for example using evanescent–wave mirrors. Classical reflection\nfrom such an atomic mirror was used to measure the van der Waals force between a dielectric surface and an atom\nin its ground state [11]. This experiment though, could not fully discriminate between the electrostatic and the QED\nexpressions. Segev et al. [16] considered a similar experiment in the quantum regime (atoms undergoing above–\nbarrier, classically forbidden reflection). Unlike classical reflection, which can only be used to identify thresholds and\nto measure the height of the potential barrier, quantum probabilities are determined by the complete potential curve,\nand are sensitive to the short- and long–range behavior of the potential. It was found that, for velocities of the order\nof the recoil speed, the quantum reflection probabilities are indeed sensitive to the long–range (Casimir) interaction.\nIn this work we study how the form of the atom–surface interaction can be observed using atomic interference of\nthe type reported in [17]. We consider atoms with multiple ground state sub-levels, which feel different potentials\nin the evanescent radiation field. These potentials can be probed by using stimulated Raman transitions within the\nevanescent wave. These transitions exhibit interference effects whose phases depend on the atomic trajectories and on\nthe entire potential, as in quantum reflection. An important aspect of the effects we discuss here is that they occur\nfor higher incident velocities than those considered in [16] and may therefore be experimentally easily accessible.\nFurthermore, even for small velocities (near the recoil velocity) the effects are more dramatic than those shown by\nquantum reflection.\nAs discussed in Refs. [18] and [17], the experiment is analogous to an atom interferometer whose size is of the\norder of a fraction of the evanescent wave decay length, κ−1 . We will focus on three experimental cases: in the first,\nthe atomic de Broglie wavelength λdB ≪ κ−1 . This leads to interference fringes analogous to those in any other\ninterferometer. It corresponds to the experiment described in Ref. [17] in which rubidium (Rb) atoms are dropped\nfrom a height of about 2 cm. Second, we will repeat the situation of the first case, but with Rb replaced by meta-stable\nhelium (He*). In this case we have λdB /2π ≃ a few κ−1 , which allows for only a few interference fringes. This allows\nus to illustrate how the signal changes when only the atomic species is changed. Finally, we will examine the case\nwhere λdB /2π ≃ κ−1 , taking He* atoms at the recoil velocity as our example. No fringes are present, but a strong\ndependence on the nature of the atom-wall potential is demonstrated. To simplify the discussion, we work with a\ntwo-level model, between the initial atomic state and the adjacent one in the ground state manifold, thus neglecting\nthe populations of the other ground state sub-levels as well as the excited levels. For the atom-wall interaction we\nwill use the published values for each atom.\n\n1\n\n\fIn the short λdB limit, the motion of the atom can be treated semi-classically. We thus calculate the transition\nprobability between the two atomic levels according to the Landau-Zener model for adiabatic transitions. In the other\ncases, the study of the atomic motion requires a fully quantum mechanical treatment. We study these cases by solving\nthe associated coupled Schrödinger equations numerically.\nIn Sec.II we describe the physical system and the theory for atomic interference. In Sec.III the results are presented.\nDiscussion and conclusions are given in Sec.IV.\nII. MODEL FOR INTERFERENCE OF MULTIPLE GROUND STATE SUB-LEVELS\n\nWe will focus on an experimental setup along the lines of Fig. 1. Here, a strong laser beam with frequency ω\nand transverse magnetic (TM) polarization (i.e. magnetic field perpendicular to the plane of incidence) creates an\nevanescent wave, which is nearly σ − circularly polarized with respect to the y-axis. A second weak laser beam with\nfrequency ω − ∆ω and transverse electric (TE) polarization (i.e. electric field perpendicular to the plane of incidence)\ncreates another evanescent wave with π polarization along the y-axis.\nAtoms normally incident on the evanescent wave move in an effective optical potential V̂light (which in general\ndepends on the internal state of the atom) and an attractive atom–wall interaction V̂wall . The total potential is given\nby\nÛ (z) = V̂light (z) + V̂wall (z).\n\n(1)\n\nA. Optical potential\n\nLet us consider an atom in the evanescent field and assume for simplicity that the σ − polarized wave is strong\ncompared to the π wave. The σ − component lifts the magnetic (Zeeman) degeneracy of the atomic ground state\n(the quantization axis is in the ŷ direction), so that each magnetic sub-level feels a different optical potential. To\nfirst order, the π polarized wave produces a coupling between the atomic sub-levels via a Raman transition: for\nexample, starting from the sub-level mi , the atom absorbs a σ − polarized photon and emits a stimulated photon with\nπ polarization. The atom thus ends up in the mi − 1 sub-state with its total energy increased by h̄∆ω. This transition\nis resonant when h̄∆ω is equal to the energy difference between the magnetic sub-levels. If the two evanescent waves\nare counter-propagating, in the reference frame moving with the optical grating, the situation corresponds to grazing\nincidence diffraction [17]. For a review of the theoretical understanding of atomic diffraction and interference from\nevanescent waves, see [19].\nIn the limit of low saturation and a detuning δ large compared to both the frequency difference ∆ω and the\nnatural linewidth, the excited state manifold may be eliminated adiabatically, and, for a ground state of total angular\nmomentum (including nuclear spin) Jg , the atomic wave function is described by the 2Jg + 1 Zeeman components\n|m >, m = −Jg , ..., +Jg . An atom at a distance z from the surface of the mirror is subject to an optical potential\nV̂light (z) whose matrix elements are of the form [we suppose that the frequency difference ∆ω and Zeeman shift are\nnegligible compared to the detuning δ and the hyperfine structure of the excited level]\n< m|V̂light (z)|m′ >=\n\nd2\nh̄δ\n\nX\n\nEq∗ (z)Eq′ (z)(Jg m; 1q|Je me )(Je me |Jg m′ ; 1q ′ ),\n\n(2)\n\nq,q′ ,me ,Je\n\nwhere a product of Clebsch–Gordon–coefficients appears on the rhs, the electric field polarization is expanded in the\nusual spherical basis with coefficients Eq , (q = −1, 0, +1) and d is the reduced dipole moment. The optical potential\ncouples different Zeeman sub-levels if the field is not in a pure polarization state with respect to this basis, as in the\nsetup considered in this work. The optical potential due to the two evanescent waves can then be written as\n< m|V̂light (z)|m′ >=\n\nd2\nCmm′ exp(−2κz),\nh̄δ\n\n(3)\n\nwhere the Cmm′ coefficients are given by the Clebsch-Gordon coefficients times the field amplitudes at the surface\nz = 0 (see Eq. 2). The inverse decay length κ is κ = k[(n sin θ)2 − 1)]1/2 , where k = ω/c is the free field wave vector,\nassumed to be the same for each laser, n is the refraction index of the prism and θ is the angle of incidence of the\nlasers with the surface. In our calculations we will always use n = 1.87 and θ = 53◦ . The wave-vector k is different\nfor each atom.\n2\n\n\fB. Atom–wall potential\n\nThe simplest model for the interaction of a ground state atom and a wall of dielectric constant ǫ considers the\ninteraction between a dipole d and its mirror image and yields the Lennard–Jones potential,\n!\n2\n2\nǫ − 1 C (3)\nǫ − 1 < dk > +2 < d⊥ > 1\nLJ\n≡−\n,\n(4)\nVwall (z) = −\n3\nǫ+1\n64πǫ0\nz\nǫ + 1 z3\nwhere < d2k > and < d2⊥ > are the expectation values of the squared dipole parallel and perpendicular to the surface\n[1], [20]. This expression for the potential is approximately valid for ǫ independent of frequency and kz much smaller\nthan unity.\nIf we take into account retardation effects, the Casimir-Polder potential is obtained, where the finite propagation\ntime between the dipole and its image results in a different power-law behavior for large z [2],\nCP\nlim Vwall\n(z) ∝ z −4 .\n\nz→∞\n\n(5)\n\nIn the complete QED theory the interaction potential between an atom of polarizability α(ω) at a distance z from\na dielectric wall can be written as [5]:\n\u0012Z 1\nZ ∞\nZ i∞ \u0013\nh̄\nQED\n3\nVwall (z) = − 2 3\ndωω α(ω) ×\ndp +\ndp H(p, ǫ) exp(−2ipωz/c)\n(6)\n8π c 0\n0\n0\nwith\np\np\nǫ − 1 + p2 − p\nǫ − 1 + p2 − ǫp\n2\nH(p) = p\n+ (1 − 2p ) p\n.\n2\nǫ−1+p +p\nǫ − 1 + p2 + ǫp\n\n(7)\n\nThe numerical values of the constant C (3) for Rb and He* atoms used in this paper are given in Table I, as well\nas the numerical values of some other important parameters. Since the atom is in a ground state with l = 0, the\nvalue of C (3) is the same for any magnetic or hyperfine sub-level. The detailed interaction between a ground state Rb\nor meta-stable He atom and a dielectric surface were recently calculated. For the van der Waals potential we have\nused data from [21] for Rb and from [22] for He*. In the former work an interpolation formula for the van der Waals\nQED\nLJ\npotential is given as Vwall\n(z) = Vwall\n(z)0.987[(1 + 1.098z)−1 − 0.00493z(1 + 0.00987z 3 − 0.00064z 4)−1 ] where z is\nexpressed in units of the laser wavelength λ/(2π). This formula approximates the numerical calculation with a 0.6%\naccuracy between 0 and 10λ/(2π).\nC. Population transfer\n\nIn this work we will consider only population transfer from the incident sub-level i to the final one f (mf = mi − 1),\nthat is only two levels. This is a good approximation if the coupling is weak enough for the population of the other\nlevels to be negligible. An example of the total interaction potential from Eq. 1 is shown in Fig.2. The Uf f potential\ncurve has been shifted vertically by −h̄∆ω, corresponding to the kinetic energy change. Then the two (adiabatic)\npotential curves cross at the point of resonance. The coupling turns the exact crossing into an avoided crossing. An\nincoming wave function in the mi channel is split in two parts that are subsequently reflected from their respective\nrepulsive potentials and recombined after the second passage at the crossing. Thus, the evanescent wave realizes a\n\"Michelson interferometer\" with a single beam splitter and two mirrors.\nWhen the atomic λdB is short, the avoided crossing can be treated by means of the semi-classical Landau–Zener\nmodel for non–adiabatic transitions [23]. Assuming that the atom moves through the crossing with a constant velocity\nvc (fixed by energy conservation), the Landau–Zener formula allows one to compute the probability amplitude for the\ntwo atomic levels after the crossing. The transition probability wif from the initial sub-level i to the final sub-level f\nis given by\nwi,f = 4TLZ RLZ cos2 (δφ),\n\n(8)\n\nwhere RLZ = 1 − TLZ and the transmission coefficient is TLZ = exp(−πΛ), with Λ = 2| < i|Û |f > |2 /(h̄2 κ∆ωvc ).\nThe phase difference δφ is given by the difference in the phase shifts between the crossing and the turning points\nin the semi-classical approximation, plus a correction term [24]:\n3\n\n\f1\nδφ =\nh̄\n\n\"Z\n\nzc\n\nzc\n\n#\n\nπ\nΛ\ndzpi (z) + + log\ndzpf (z) −\n4\n2\nzi,r\nzf,r\nZ\n\n\u0012\n\nΛ\n2e\n\n\u0013\n\n\u0012 \u0012\n\u0013\u0013\nΛ\n+ arg Γ 1 − i\n,\n2\n\n(9)\n\nwhere zc is the position of the crossing point, zn,r the classical return point for an atom in the n-th level, pn (z) its\nmomentum and Γ the Gamma function.\nChanging the frequency difference ∆ω/(2π) causes a change in the length of one of the interferometer arms, thus\na change in the phase difference δφ between the two paths. As a consequence we expect the transition probability to\nshow oscillations in ∆ω (Stückelberg oscillations). We will see in the next section that δφ is very sensitive to the exact\nshape of the potential. The amplitude of the oscillations also depends on ∆ω both explicitly and implicitly through\nvc (the crossing point moves with changing ∆ω).\nThe Landau–Zener model is a good approximation only when the atom speed is approximately constant during the\ncrossing. In particular it is not valid when the classical return point and the crossing are close to each other or when\nthe de Broglie wavelength of the atom is of the order of the width of the interaction region. In order to explore this\nlong-wavelength regime, we have to forgo the semi-classical Landau-Zener model and solve numerically the coupled\nSchrödinger equations for the system. Since atoms that cross the potential barrier stick to the dielectric surface, the\nappropriate boundary conditions at the surface are those for a running wave propagating downward (z → −∞), while\nfor z → ∞ the solution is a superposition of downward (incident) and upward (reflected) waves. We have integrated\nthe system of Schrödinger equations using the renormalized Numerov method [25]. To avoid the singularity at the\nsurface we have modified the potential to be a large negative constant near the interface and verified that the transition\nprobability does not change by varying the value of the constant.\n\nIII. RESULTS\n\nWe will present our calculations in two parts. First we discuss the short wavelength regime, and point out various\nexperimental strategies to observe retardation effects. Then we discuss two cases in which the de Broglie wavelength\nis not small compared to the evanescent wave decay length (the \"long wavelength regime\"), in which a numerical\nintegration of the Schrödinger equation is necessary.\nA. Short wavelength regime\n\nFig. 3 shows a calculation of the population transfer wif as a function of the frequency difference ∆ω for the\nLennard–Jones (LJ) and QED model of the van der Waals interaction. The value of the light potential is the same\nfor the two curves (i.e. the laser intensity is the same), and the incident momentum is 115h̄k, which corresponds to\nRb atoms dropped from a height of 2.3 cm. We use the Landau-Zener approach to calculate the transfer probability\n(see Eq. 8). As in [18] and [17], we observe Stückelberg oscillations in the transfer probability. These oscillations\ncan be understood as the variations in the accumulated phase difference between the two different paths taken by the\natoms after the level crossing shown in Fig.2. The de Broglie wavelength λdB is such that several fringes appear as\nthe position of the level crossing is moved through its possible range. The last oscillation at the higher frequencies\nis where the crossing point and the classical return point are very close to each other and the Landau-Zener model\nbreaks down. We have set the probability to zero beyond this limit. In reality, the transition probability falls roughly\nexponentially with frequency, as one finds solving the Schrödinger equations numerically (see next subsection).\nIn general, we find that the dephasing between the two curves (with and without retardation effects) is greatest\nwhen the atoms are incident at an energy close to the top of the potential barrier. Note that the height of the barrier\nis greater when retardation effects are included, since these reduce the strength of the atom-surface interaction. The\neffect of retardation is roughly to shift these fringes by half a fringe to the left. The major cause of this shift is\nthe increase in the height of the total potential which is greater for the i level than the f level. A 10% increase in\nthe value of the light-shift potential would exhibit nearly the same shift. Therefore, since it is not possible to turn\nretardation on and off, it would be necessary to measure absolutely the light-shift potential to better than 10% in\norder to distinguish a retardation effect. Experimentally this is rather difficult. Instead of attempting to measure\nthe absolute light shift, one could rather measure the absolute height of the potential by observing the threshold of\nreflection as in [11], and using the known kinetic energy of the atoms to get an absolute calibration of the height. Let\nus assume then that the barrier height, instead of the light intensity, is known. In Fig.4a we show the result with the\nsame parameters as in Fig.3 except for the light intensity in the LJ model, which has been changed so as to have the\nsame barrier height as the QED model. In this case the shift is much smaller, about 1/5 of a fringe. We have verified\n\n4\n\n\fthat even taking into account an experimental uncertainty of a few % in the height of the corresponding potentials,\nthe two models are still clearly resolved.\nThis approach seems feasible, but a third method of observing the effects of retardation is possible if one uses more\nof the information available in the oscillation curve. Fig. 4b shows the same curves as Fig. 4a but with the QED\ncurve numerically shifted so as to coincide with the LJ curve at its maximum. One sees that the period of these\noscillations is not the same. It decreases with decreasing detuning, faster for the full QED potential, so that there is\na difference in the spacing of the minima in the population transfer. Thus with fringes with sufficiently high signal\nto noise, one can distinguish retardation while leaving the absolute barrier height as a free parameter in a fit to the\ndata. It seems to us that a viable experimental method is to use a combination of the second two approaches. Careful\nmeasurements of the barrier height can be used to cross check a fit to the Stückelberg oscillations with the barrier\nheight as a free parameter.\nThe incident energy, momentum and barrier height used in Figs. 3 and 4a were arbitrarily chosen to correspond to\nthe experiment in [17], but it would be interesting to know how Figs. 3 and 4a would change, especially for different\nincident momenta (de Broglie wavelengths). We studied this question by repeating the calculation of Fig. 4a, for\ndifferent incident momenta, while always keeping the barrier height 10% above the incident kinetic energy. We find\nthat, roughly speaking, the number of oscillations increases as the incident momentum. This is because the number\nof fringes in the interferogram increases with decreasing wavelength. The accumulated phase difference between the\noscillations in the LJ and QED models, over the corresponding frequency range, also increases approximately linearly\nwith incident momentum. Thus if we consider the fringe shift divided by the fringe period as a figure of merit, the\nsensitivity of the experiment to retardation effects increases with increasing incident momentum.\nB. Long wavelength regime\n\nWe now examine the large de Broglie wavelength limit, where the semi-classical model breaks down since the atomic\nwavelength is not small compared to the interferometer size. We first consider the case of He* atoms dropped from\na height of a few cm as for Rb. We show the results in Fig. 5. For an initial distance of 2.3 cm from the mirror,\nthe incident momentum of He* is 7.4h̄k, much lower than for Rb. Again we will chose the intensities of the strong\nσ − wave so as to have the same barrier height for the two potentials, about 10% above the incident kinetic energy.\nIn this regime, to observe interference, the detuning between the evanescent waves must be of only a few MHz, in\nfact, beyond about 10MHz the crossing point is closer to the surface than the return point. One only sees one or\ntwo Stückelberg oscillations since the momentum involved is small and the atoms do not accumulate enough phase\ndifference to show more oscillations. The two potentials give similar results (Fig.5), the main difference being in the\nshape and height of the big peak.\nWe have also looked at even lower incident momenta. Near the recoil limit, one can expect interference only for\ndetunings of less than one MHz and the accumulated phase difference is too small in this range to show any Stückelberg\noscillations. Both for He* and Rb one obtains a big peak in the transition probability and no Stückelberg oscillations,\nas expected. The difference between the van der Waals potential and the full QED potential still shows up in the\ndifferent shape and height of the peaks (Fig.6). Here the width of the curve is delimited by the frequency for which\nthe classical return point and the crossing point coincide.\nFinally we note that the qualitative features of the short and long λdB limit are the same for Rb and He*, e.g. He*\nwith an incident momentum of about 100h̄k gives the same type of oscillation pattern as Rb.\nIV. CONCLUSIONS\n\nIn summary, we have proposed an experiment to probe van der Waals like surface interactions by exploiting\ninterference mechanisms for well defined Zeeman sub-levels of atoms moving in two evanescent waves. Retardation\ncan be resolved using atoms incident at speeds which are easily obtained in free fall over a few centimeters. The\ncontrolling parameter is here the detuning between the two evanescent waves. One then measures the fraction of the\natoms which have undergone a change of magnetic sub-level as a function of this detuning.\nFor the situation in which the atomic de Broglie wavelength is sufficiently small the experiment resembles typical\ninterferometry experiments. The theoretical description is semi-classical, employing well defined atomic trajectories,\nwhile experimentally, one seeks a particular (non sinusoidal) fringe pattern as a signature of retardation. This should\nbe possible with an improved version of the experiment of Ref. [17].\nAnother approach is to investigate the interaction of atoms whose de Broglie wavelength is not small compared\nto the length scale of the interferometer. In this regime most of the information is to be found in the shape of the\n\n5\n\n\fpopulation transfer curve, since there are very few or zero interference fringes. Note though, that we have assumed\nthroughout that the incident atoms are mono-energetic. This means that the velocity spread of the incident atoms\nmust be small compared to the atomic recoil. Nevertheless this may be worth the effort, because the predicted effect\nof retardation is quite dramatic.\nFor a quantitative comparison however, the presence of all the sub-levels (which give rise to the multiple crossing\nof the dressed potentials at the same distance zc from the surface) and, possibly, losses from spontaneous emission\nhave to be taken into account, but the results are not qualitatively different.\nV. ACKNOWLEDGMENTS\n\nR. M. acknowledges support from the Training and Mobility of Researchers (European Union, Marie–Curie Fellowship contract n. ERBFMBIC983271) and would like to thank Paul Julienne and Olivier Dulieu for their help with\nthe numerical code, and J. Babb for providing the data for the atom-wall interaction for meta-stable helium. This\nwork was also supported by the Région Ile de France.\n\n[1]\n[2]\n[3]\n[4]\n[5]\n[6]\n[7]\n[8]\n[9]\n[10]\n[11]\n[12]\n[13]\n[14]\n[15]\n[16]\n[17]\n[18]\n[19]\n[20]\n[21]\n[22]\n[23]\n[24]\n[25]\n\nL. E. Lennard-Jones, Trans. Faraday Soc. 28, 333 (1932).\nH. B. G. Casimir and D. Polder, Phys. Rev. 73, 360 (1948).\nI. E. Dzyaloshinskii, E. M. Lifshitz, and L. P. Pitaevskii, Adv. Phys. 10, 165 (1961).\nL. Spruch and Y. Tikochinsky, Phys. Rev. A 48, 4213 (1993).\nY. Tikochinsky and L. Spruch, Phys. Rev. A 48, 4223 (1993).\nL. Spruch, Science 272, 1452 (1996).\nM. Fichet, F. Schuller, D. Bloch, and M. Ducloy, Phys. Rev. A 51, 1553 (1995), and references therein.\nJ. M. Wylie and J. E. Sipe, Phys. Rev. A 30, 1185 (1984).\nJ. M. Wylie and J. E. Sipe, Phys. Rev. A 32, 2030 (1985).\nC. Mavroyannis, Mol. Phys. 6, 593 (1963).\nA. Landragin et al., Phys. Rev. Lett. 77, 1464 (1996).\nM. Kasevich et al., in Atomic Physics 12, Vol. 233 of AIP Conf. Proc. No. 233, edited by J. C. Zorn and R. R. Lewis (AIP,\nNew York, 1991), p. 47.\nC. I. Sandoghdar, V. Sukenik, E. A. Hinds, and S. Haroche, Phys. Rev. Lett. 68, 3432 (1992).\nC. I. Sukenik et al., Phys. Rev. Lett. 70, 560 (1993).\nS. Chu, C. N. Cohen-Tannoudji, and W. D. Phillips, Rev. Mod. Phys. 70, 685 (1998).\nB. Segev, R. Côté, and M. G. Raizen, Phys. Rev. A 56, R3350 (1997).\nL. Cognet et al., Phys. Rev. Lett. 81, 5044 (1998).\nC. Henkel, K. Molmer, R. Kaiser, and C. I. Westbrook, Phys. Rev. A 56, R9 (1997).\nC. Henkel et al., Appl. Phys. B 69, 277 (1999).\nR. Côté, B. Segev, and M. G. Raizen, Phys. Rev. A 58, 3999 (1998).\nA. Landragin, Ph.D. thesis, Université de Paris–Sud, 1997.\nZ.-C. Yan and J. F. Babb, Phys. Rev. A 58, 1247 (1998).\nC. Zener, Proc. Roy. Soc., Ser. A 137, 696 (1932).\nA. P. Kazantsev, G. A. Ryabenko, G. Surdutovich, and V. Yakovlev, Phys. Rep. 129, 75 (1985).\nB. R. Johnson, J. Chem. Phys. 67, 4086 (1977).\n\n6\n\n\fParameter\nλ\nΓ\nEr\nC (3)\nstate i\nstate f\nCii\nCf f\nCif\n\nRb\n780 × 10−9 m\n2π5.9 × 106 s−1\n6.4 × 10−4 h̄Γ\n0.113h̄Γ/λ3\n5S1/2 , F = 2, mF = 2\n5S1/2 , F = 2, mF = 1\n|E−1 (0)|2 1/3\n|E−1 (0)|2 1/2 √\nE−1 (0)∗ E0 (0) 2/3\n\nHe*\n1083 × 10−9 m\n2π1.6 × 106 s−1\n2.6 × 10−2 h̄Γ\n0.125h̄Γ/λ3\n23 S1 , J = 1, mJ = 1\n23 S1 , J = 1, mJ = 0\n|E−1 (0)|2 1/6\n|E−1 (0)|2 1/2\nE−1 (0)∗ E0 (0)1/3\n\nTABLE I. Values of parameters used in the text for Rb and He*: laser wavelength λ, atomic transition width Γ, recoil\nenergy Er , van der Waals coefficient C (3) (see Eq.4). Definition of the initial and final atomic state (i and f ). Optical potential\ncoefficients Cij (see Eq.3). We assume here that the σ − wave (E−1 ) is much stronger than the π wave (E0 ). The dielectric\nconstant of the wall is ǫ = 3.49 and κ = 1.52k.\n\n7\n\n\fAtoms before\nthe bounce\n\nProbe beam\nAtoms after\nthe bounce\n\nz\n\nσ -, π\n\nωL\n\ny\n\nx\n\nTM\n\nTE\n\nωL −∆ω\nFIG. 1. Typical experimental setup. The atoms are released from a MOT above the prism. Two slightly detuned laser beams\nof polarizations TM (and frequency ω/(2π)) and TE (and frequency (ω − ∆ω)/(2π)) form evanescent waves on the surface of\nthe prism of polarizations σ − and π respectively (y is the quantization axis). The reflected atoms are detected by a detection\nbeam.\n\n800\n\n600\n\n400\n\nEnergy/Er\n\nincident energy\n\n200\n\nstate i\n0\n\nstate f\n−200\n\nUii\nUff−∆ω h/2π\n−400\n\n0\n\n0.5\n\n1\n\n1.5\n\n2\n\n2.5\n\nz/λ\nFIG. 2. Typical potential curves experienced by the atoms during reflection. The potential for state f is shifted by the\nRaman energy −h̄∆ω. The atoms approach the potential barrier in state i, pass through the curve crossing twice and can end\nup on either state i or f . For each final situation, two paths are possible (between the crossing and the turning points) and\ncan interfere producing fringes as a function of the location of the crossing.\n\n8\n\n\f1\n0.9\n\nLJ\nQED\n\nPopulation transfer\n\n0.8\n0.7\n0.6\n0.5\n0.4\n0.3\n0.2\n0.1\n0\n0\n\n5\n\n10\n15\n20\nFrequency difference (MHz)\n\n25\n\n30\n\nFIG. 3. Population transfer from state i to state f after reflection (wif from Eq. 8) vs frequency difference ∆ω/(2π) for\nrubidium atoms, released 2.3 cm above the mirror, (i.e. with incident momentum 115h̄k). The solid line is for the QED model\nand the dashed line for the Lennard–Jones (LJ) model. The coupling coefficients defined in Eq. 3 are |Cif | = 859ErRb and\n|Cii | = 3.8 × 104 ErRb\n\n.\n\n9\n\n\f1\n0.9\nLJ\nQED\n\nPopulation transfer\n\n0.8\n0.7\n0.6\n0.5\n0.4\n0.3\n0.2\n0.1\n0\n0\n\n5\n\n10\n\n15\n\n20\n\n25\n\n30\n\n1\n0.9\n\nPopulation transfer\n\n0.8\n\nLJ\nQED\n\n0.7\n0.6\n0.5\n0.4\n0.3\n0.2\n0.1\n0\nFrequency difference (MHz)\n\nFIG. 4. Upper figure: population transfer wif (see Eq. 8) vs frequency difference ∆ω/(2π) for rubidium atoms released 2.3\ncm above the mirror (i.e. with incident momentum 115h̄kRb ). The solid line is for the QED model and the dashed line for the\nLeenard–Jones (LJ) model. The height of the potential barrier is 1.48 × 104 ErRb , i.e. the intensity of the strong laser beam has\nbeen adjusted to give the same barrier height for both models. The light–shift coefficients for the QED model are the same as\nfor Fig. 3, while for the LJ model |Cii | = 4.11 × 104 ErRb and |Cif | = 890ErRb . Lower figure: same parameters as in the previous\nfigure with the LJ curve artificially shifted 0.79 MHz to the left in order to show the changes in fringe spacing.\n\n10\n\n\f0.2\nLJ\nQED\n\n0.18\n\nPopulation transfer\n\n0.16\n0.14\n0.12\n0.1\n0.08\n0.06\n0.04\n0.02\n0\n0\n\n2\n\n4\n6\n8\n10\nFrequency difference (MHz)\n\n12\n\n14\n\nFIG. 5. Population transfer wif (see Eq. 8) vs frequency difference ∆ω/(2π) for meta-stable helium atoms released 2.3 cm\nabove the mirror (i.e. with incident momentum 7.4h̄kHe ). The solid line is for the QED model and the dashed line for the\nLennard–Jones (LJ) model. The height of the potential barrier is 61ErHe , i.e. the intensity of the strong laser beam has been\nadjusted to give the same barrier height for both models ( 10% above the incident kinetic energy). The light–shift coefficients\nfor the QED model are |Cii | = 252ErHe |Cif | = 20.8ErHe while for the LJ model |Cii | = 303ErHe and |Cif | = 22.7ErHe .\n\n0.07\nLJ\nQED\n\nPopulation transfer\n\n0.06\n0.05\n0.04\n0.03\n0.02\n0.01\n0\n0\n\n0.2\n\n0.4\n0.6\n0.8\n1\n1.2\nFrequency difference (MHz)\n\n1.4\n\n1.6\n\nFIG. 6. Population transfer wif vs frequency difference ∆ω/(2π) for meta-stable helium atom with incident momentum\nh̄kHe . The solid line is for the QED model and the dashed line for the Lennard–Jones (LJ) model. The height of the potential\nbarrier is 1.28ErHe , i.e. the intensity of the strong laser beam has been adjusted to give the same barrier height for both models.\nThe light–shift coefficients for the QED model are |Cii | = 0.8ErHe |Cif | = 0.16ErHe while for the LJ model |Cii | = 1.47ErHe and\n|Cif | = 0.29ErHe .\n\n11\n\n\f"}