{"id": "http://arxiv.org/abs/q-bio/0612043v1", "guidislink": true, "updated": "2006-12-22T14:04:27Z", "updated_parsed": [2006, 12, 22, 14, 4, 27, 4, 356, 0], "published": "2006-12-22T14:04:27Z", "published_parsed": [2006, 12, 22, 14, 4, 27, 4, 356, 0], "title": "Hybridization to surface-bound oligonucleotide probes: Influence of\n  point defects", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=q-bio%2F0612040%2Cq-bio%2F0612022%2Cq-bio%2F0612020%2Cq-bio%2F0612007%2Cq-bio%2F0612012%2Cq-bio%2F0612033%2Cq-bio%2F0612010%2Cq-bio%2F0612011%2Cq-bio%2F0612004%2Cq-bio%2F0612016%2Cq-bio%2F0612008%2Cq-bio%2F0612026%2Cq-bio%2F0612027%2Cq-bio%2F0612032%2Cq-bio%2F0612003%2Cq-bio%2F0612025%2Cq-bio%2F0612047%2Cq-bio%2F0612018%2Cq-bio%2F0612001%2Cq-bio%2F0612014%2Cq-bio%2F0612024%2Cq-bio%2F0612005%2Cq-bio%2F0612031%2Cq-bio%2F0612028%2Cq-bio%2F0612042%2Cq-bio%2F0612006%2Cq-bio%2F0612037%2Cq-bio%2F0612036%2Cq-bio%2F0612023%2Cq-bio%2F0612009%2Cq-bio%2F0612043%2Cq-bio%2F0612045%2Cq-bio%2F0612019%2Cq-bio%2F0612015%2Cq-bio%2F0612013%2Cq-bio%2F0612029%2Cq-bio%2F0612041%2Cq-bio%2F0612002%2Cq-bio%2F0612044%2Cq-bio%2F0612046%2Cq-bio%2F0612021%2Cq-bio%2F0612035%2Cq-bio%2F0612038%2Cq-bio%2F0612017%2Cq-bio%2F0612034%2Cq-bio%2F0311026%2Cq-bio%2F0311014%2Cq-bio%2F0311035%2Cq-bio%2F0311031%2Cq-bio%2F0311020%2Cq-bio%2F0311027%2Cq-bio%2F0311039%2Cq-bio%2F0311005%2Cq-bio%2F0311011%2Cq-bio%2F0311022%2Cq-bio%2F0311013%2Cq-bio%2F0311016%2Cq-bio%2F0311006%2Cq-bio%2F0311023%2Cq-bio%2F0311033%2Cq-bio%2F0311029%2Cq-bio%2F0311001%2Cq-bio%2F0311019%2Cq-bio%2F0311021%2Cq-bio%2F0311034%2Cq-bio%2F0311028%2Cq-bio%2F0311012%2Cq-bio%2F0311018%2Cq-bio%2F0311038%2Cq-bio%2F0311024%2Cq-bio%2F0311037%2Cq-bio%2F0311008%2Cq-bio%2F0311010%2Cq-bio%2F0311030%2Cq-bio%2F0311003%2Cq-bio%2F0311017%2Cq-bio%2F0311036%2Cq-bio%2F0311032%2Cq-bio%2F0311025%2Cq-bio%2F0311015%2Cq-bio%2F0311009%2Cq-bio%2F0311002%2Cq-bio%2F0311007%2Cq-bio%2F0311004%2Cq-bio%2F0409028%2Cq-bio%2F0409024%2Cq-bio%2F0409009%2Cq-bio%2F0409029%2Cq-bio%2F0409026%2Cq-bio%2F0409031%2Cq-bio%2F0409014%2Cq-bio%2F0409019%2Cq-bio%2F0409007%2Cq-bio%2F0409006%2Cq-bio%2F0409034%2Cq-bio%2F0409032%2Cq-bio%2F0409027%2Cq-bio%2F0409002%2Cq-bio%2F0409010%2Cq-bio%2F0409012%2Cq-bio%2F0409039&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Hybridization to surface-bound oligonucleotide probes: Influence of\n  point defects"}, "summary": "Microarray-based genotyping is based on the high discrimination capability of\noligonucleotide probes. For detection of Single Nucleotide Polymorphisms (SNPs)\nsingle-base discrimination is required. We investigate how various\npoint-mutations, comprising single base mismatches (MMs), insertions and\ndeletions, affect hybridization of DNA-DNA oligonucleotide duplexes. Employing\nlight-directed in situ synthesis we fabricate DNA microarrays with\ncomprehensive sets of cognate point-mutated probes, allowing us to\nsystematically investigate the influence of defect type, position and nearest\nneighbor effects. Defect position has been identified as the dominating\ninfluential factor. This positional effect which is almost identical for the\ndifferent point-mutation types, is biased from the local sequence environment.\nThe impact of the MM type is largely determined by the type of base pair\n(either AT or CG) affected by the mismatch. We observe that single base\ninsertions next to like-bases result in considerably larger hybridization\nsignals than insertions next to nonidentical bases. The latter as well as the\ndistinct position dependence could be explained by a kinetic zipper model in\nwhich point defects represent a barrier for the rapid closure of the DNA\nduplex.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=q-bio%2F0612040%2Cq-bio%2F0612022%2Cq-bio%2F0612020%2Cq-bio%2F0612007%2Cq-bio%2F0612012%2Cq-bio%2F0612033%2Cq-bio%2F0612010%2Cq-bio%2F0612011%2Cq-bio%2F0612004%2Cq-bio%2F0612016%2Cq-bio%2F0612008%2Cq-bio%2F0612026%2Cq-bio%2F0612027%2Cq-bio%2F0612032%2Cq-bio%2F0612003%2Cq-bio%2F0612025%2Cq-bio%2F0612047%2Cq-bio%2F0612018%2Cq-bio%2F0612001%2Cq-bio%2F0612014%2Cq-bio%2F0612024%2Cq-bio%2F0612005%2Cq-bio%2F0612031%2Cq-bio%2F0612028%2Cq-bio%2F0612042%2Cq-bio%2F0612006%2Cq-bio%2F0612037%2Cq-bio%2F0612036%2Cq-bio%2F0612023%2Cq-bio%2F0612009%2Cq-bio%2F0612043%2Cq-bio%2F0612045%2Cq-bio%2F0612019%2Cq-bio%2F0612015%2Cq-bio%2F0612013%2Cq-bio%2F0612029%2Cq-bio%2F0612041%2Cq-bio%2F0612002%2Cq-bio%2F0612044%2Cq-bio%2F0612046%2Cq-bio%2F0612021%2Cq-bio%2F0612035%2Cq-bio%2F0612038%2Cq-bio%2F0612017%2Cq-bio%2F0612034%2Cq-bio%2F0311026%2Cq-bio%2F0311014%2Cq-bio%2F0311035%2Cq-bio%2F0311031%2Cq-bio%2F0311020%2Cq-bio%2F0311027%2Cq-bio%2F0311039%2Cq-bio%2F0311005%2Cq-bio%2F0311011%2Cq-bio%2F0311022%2Cq-bio%2F0311013%2Cq-bio%2F0311016%2Cq-bio%2F0311006%2Cq-bio%2F0311023%2Cq-bio%2F0311033%2Cq-bio%2F0311029%2Cq-bio%2F0311001%2Cq-bio%2F0311019%2Cq-bio%2F0311021%2Cq-bio%2F0311034%2Cq-bio%2F0311028%2Cq-bio%2F0311012%2Cq-bio%2F0311018%2Cq-bio%2F0311038%2Cq-bio%2F0311024%2Cq-bio%2F0311037%2Cq-bio%2F0311008%2Cq-bio%2F0311010%2Cq-bio%2F0311030%2Cq-bio%2F0311003%2Cq-bio%2F0311017%2Cq-bio%2F0311036%2Cq-bio%2F0311032%2Cq-bio%2F0311025%2Cq-bio%2F0311015%2Cq-bio%2F0311009%2Cq-bio%2F0311002%2Cq-bio%2F0311007%2Cq-bio%2F0311004%2Cq-bio%2F0409028%2Cq-bio%2F0409024%2Cq-bio%2F0409009%2Cq-bio%2F0409029%2Cq-bio%2F0409026%2Cq-bio%2F0409031%2Cq-bio%2F0409014%2Cq-bio%2F0409019%2Cq-bio%2F0409007%2Cq-bio%2F0409006%2Cq-bio%2F0409034%2Cq-bio%2F0409032%2Cq-bio%2F0409027%2Cq-bio%2F0409002%2Cq-bio%2F0409010%2Cq-bio%2F0409012%2Cq-bio%2F0409039&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Microarray-based genotyping is based on the high discrimination capability of\noligonucleotide probes. For detection of Single Nucleotide Polymorphisms (SNPs)\nsingle-base discrimination is required. We investigate how various\npoint-mutations, comprising single base mismatches (MMs), insertions and\ndeletions, affect hybridization of DNA-DNA oligonucleotide duplexes. Employing\nlight-directed in situ synthesis we fabricate DNA microarrays with\ncomprehensive sets of cognate point-mutated probes, allowing us to\nsystematically investigate the influence of defect type, position and nearest\nneighbor effects. Defect position has been identified as the dominating\ninfluential factor. This positional effect which is almost identical for the\ndifferent point-mutation types, is biased from the local sequence environment.\nThe impact of the MM type is largely determined by the type of base pair\n(either AT or CG) affected by the mismatch. We observe that single base\ninsertions next to like-bases result in considerably larger hybridization\nsignals than insertions next to nonidentical bases. The latter as well as the\ndistinct position dependence could be explained by a kinetic zipper model in\nwhich point defects represent a barrier for the rapid closure of the DNA\nduplex."}, "authors": ["Thomas Naiser", "Oliver Ehler", "Timo Mai", "Wolfgang Michel", "Albrecht Ott"], "author_detail": {"name": "Albrecht Ott"}, "author": "Albrecht Ott", "arxiv_comment": "12 pages, 12 figures", "links": [{"href": "http://arxiv.org/abs/q-bio/0612043v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/q-bio/0612043v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "q-bio.BM", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "q-bio.BM", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "q-bio.GN", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/q-bio/0612043v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/q-bio/0612043v1", "journal_reference": null, "doi": null, "fulltext": "Hybridization to Surface-bound Oligonucleotide Probes:\nInfluence of Point Defects\n\narXiv:q-bio/0612043v1 [q-bio.BM] 22 Dec 2006\n\nThomas Naiser ∗ , Oliver Ehler, Timo Mai, Wolfgang Michel,\nand Albrecht Ott\nExperimentalphysik I, Universität Bayreuth, D-95440 Bayreuth, Germany\n\n29 October 2018\nABSTRACT\nMicroarray-based genotyping is based on the high discrimination capability of oligonucleotide probes. For\ndetection of Single Nucleotide Polymorphisms (SNPs) single-base discrimination is required. We investigate\nhow various point-mutations, comprising single base mismatches (MMs), insertions and deletions, affect hybridization of DNA-DNA oligonucleotide duplexes. Employing light-directed in situ synthesis we fabricate\nDNA microarrays with comprehensive sets of cognate point-mutated probes, allowing us to systematically\ninvestigate the influence of defect type, position and nearest neighbor effects. Defect position has been identified as the dominating influential factor. This positional effect which is almost identical for the different\npoint-mutation types, is biased from the local sequence environment. The impact of the MM type is largely\ndetermined by the type of base pair (either A*T or C*G) affected by the mismatch. We observe that single\nbase insertions next to like-bases result in considerably larger hybridization signals than insertions next to\nnonidentical bases. The latter as well as the distinct position dependence could be explained by a kinetic\nzipper model in which point defects represent a barrier for the rapid closure of the DNA duplex.\nKey words:\nhybridization, defect, mismatch, in situ synthesis, zipper\nrunning title: Impact of point defects on DNA hybridization\n\nINTRODUCTION\nDNA microarray technology relies on the highly specific\nhybridization of complementary nucleic acid strands. Singlestranded DNA molecules are employed as probes for the\ndetection of complementary target sequences, which are contained within a complex mixture of nucleic acids. Fluorescent\nlabels enable the detection of target molecules captured by\ntheir surface-bound counterparts. High specifity of probetarget hybridization is required in expression profiling to\nreduce cross-hybridization from often very similar target\nsequences. A high discrimination ability is particularly important in genotyping applications, where Single Nucleotide\nPolymorphisms (SNPs), mutations of single bases, are the\nsubject of interest. SNPs largely determine genetic individuality, but also the individual susceptibility to genetically\n\n∗ Corresponding author.\nEmail address:\nthomas.naiser@ep1.uni-bayreuth.de (Thomas\nNaiser).\n\ncaused diseases, and are therefore of great interest not only\nfor genetic research but also for medical diagnostics.\nSNPs can be detected by hybridization with short oligonucleotide probes,where already a single mismatching base pair\ncan result in a significant decrease of duplex stability [1].\nThe hybridization characteristics of mismatched duplexes\nare governed by many parameters including the position of\nthe defect, type of mismatch, influence of neighboring bases,\ninfluence of labeling, secondary structure and surface effects\n[2,3,4,5,6].\nA recent study by Pozhitkov et al. [6] reveals a poor correlation between predicted and actual hybridization signal (HS)\nintensities, implying that the thermodynamic properties of\noligonucleotide hybridization are by far not yet understood.\nOur study is a comprehensive approach to understand how\npoint defects affect the hybridization of fluorescently labeled\nDNA oligonucleotide targets to surface-bound probe oligonucleotides. Applying light-directed in situ synthesis [7,8] with\na digital micromirror display (DMDT M , Texas Instruments)\nbased maskless synthesis apparatus [9,10,11,12,13,14,15]\ndeveloped in-house [16] we have fabricated DNA chips comprising probe sets with various single base mismatches and\nother point-mutations with respect to the set of fixed probe\nsequence motifs employed in this study.\n\n\fTable 1\nFluorescently labeled oligonucleotide targets used in this study\nName\n\nTarget sequence (5'→3')\n\nLabel\n\nLength (nt)\n\nURA\n\nACTACAAACTTAGAGTGCAG...\n\n5'-Cy3\n\n38\n\n(comprising between 64 and 400 features) is arranged as\na closely spaced feature block (Figure 1) which during the\nanalysis can easily be imaged as a whole. Compact arrangement reduces position-dependent systematic errors that can\noriginate from gradients introduced during synthesis and/or\nhybridization (see below). DNA chips produced for this\nstudy typically comprise about 2000-3000 features. A relatively large feature size of 21 μm (6×6 DMD pixels) is used\nfor improved quantitativity.\n\n...CAGAGGGGAGTGGAATTC\nNIE\n\nACTCGCAAGCACCACCCTATCA\n\n3'-Cy3\n\n22\n\nLBE\n\nGTGATGCTTGTATGGAGGAA...\n\n3'-Cy3\n\n30\n\n...TACTGCGATT\nPET\n\nACATCAGTGCCTGTGTACTAGGAC\n\n3'-Cy3\n\n24\n\nBEI\n\nACGGAACTGAAAGCAAAGAC\n\n3'-Cy3\n\n20\n\nCOM\n\nAACTCGCTATAATGACCTGGACTG\n\n5'-Cy3\n\n24\n\nNCO\n\nTAGTGGGAGTTGTTAGTGATGTGA\n\n3'-Cy3\n\n24\n\nReal-time monitoring of DNA hybridization\nHybridization of fluorescently labeled targets to surfacebound probes is carried out in a temperature-controlled\nhybridization chamber. The chip, synthesized on a 20 mm diameter cover glass (glue-fixed onto a stainless steel support),\nconstitutes a window into the chamber. The chamber volume\nof 150 μl is formed by a cutout in a 1.5 mm sheet of PDMS\nsilicone rubber. Temperature is controlled with a foil heater\nattached to a stainless steel plate composing the backside of\nthe hybridization chamber. Relative intensities within the\nprobe sets are largely independent of the hybridization time,\nchosen to be 10 minutes, typically. Probe sequence motifs\nwith small hybridization affinities are hybridized for up to 30\nminutes to achieve a sufficiently large HS/background ratio.\nHybridization temperature for 16mer probes was typically\n30◦ C. An increased hybridization temperature of 40◦ C has\nbeen applied for probes complementary to the target URA.\nAt 30◦ C these, due to their large hybridization affinity, hybridize with reduced defect discrimination. Probes with a\nlength of 20 and more bases are hybridized at 40◦ C. Hybridization is monitored in real-time on an Olympus IX81\nfluorescence microscope. Thereby the microarray remains in\nthe hybridization solution. A 10×0.4NA UPlanApo objective provides a sufficiently large field of view. An electron\nmultiplying CCD camera (Hamamatsu EM-CCD 9102) with\na 1000×1000 pixel resolution is used for image acquisition.\nDuring image acquisition flat field correction is performed\nto compensate for intensity inhomogeneities in fluorescence\nexcitation.\n\nFollowing hybridization with labeled targets we determined\nthe relative intensities using fluorescence microscopy. In order\nto identify the different factors determining the impact of a\ndefect, we first focused on the strong positional influence [5,6]\nwhich can be extracted using a comprehensive set of pointmutated probes. More subtle effects originating from defect\ntype and neighboring bases can be studied after subtraction\nof the overlying positional dependence. We used a large set\nof hybridization signals (normalized and combined from different probe motifs) to analyze characteristics depending on\ndefect type and neighborhood. We further investigate how\nthe positional arrangement of multiple point-defects affects\nhybridization behaviour.\n\nMATERIALS AND METHODS\nReagents\nHybridization buffer: 5×SSPE with 0.1% SDS, pH 7.4. Cy3labeled target oligonucleotides - see Table 1 - were synthesized\nby MWG Biotech (Ebersberg, Germany) and by IBA Nucleic\nAcids Synthesis (Göttingen, Germany). Oligonucleotide target concentration in the experiments was 1 nM.\n\nImage analysis\nDNA microarray fabrication\n\nImage analysis software developed in-house reads the intensities of hundreds of features simultaneously. By selecting\ncorner-points a readout-grid is placed manually onto the image of the hybridized chip. Field distortions are compensated\nby the trapezoidal arrangement of the grid points (which is\ndetermined by the placement of the four corner points). At\nthe grid points pixel intensities are integrated over an area\ntypically 10×10 pixels wide, thus excluding the relatively inhomogeneous edge regions of the 21 μm sized features (Figure\n1). The feature raw intensities IF need to be corrected for the\nsolution background intensity Isol , which is superimposed on\nthe surface hybridization intensity. To determine the local solution background the read-out grid points are slightly shifted\nfor placement on the gaps between the features. The pure surface hybridization signal Ihyb,surf is obtained by subtraction\nof the solution background from the measured feature intensity. Subsequent normalization (equation 1) through division\n\nOligonucleotide microarrays tailor-made for our experiments were fabricated in-house employing light-directed in\nsitu synthesis [7,8]. The DMD based synthesis apparatus\n[9,10,11,12,13,14,15] is described in Naiser et al. [16]. Microarrays were synthesized on a phosphorus dendrimer substrate\n[17]. For compatibility with phosphoramidite chemistry the\nsubstrates aldehyde moieties were reduced (in 3.5 mg/ml\naqueous solution of sodium borohydride for 3h) to hydroxyl\ngroups. A photoreactive monolayer is created by coupling\nof NPPOC-dT-phosphoramidite. Subsequent light-directed\nsynthesis was performed with NPPOC-phosphoramidites\n[18,19]. Probe sets for the experiments are derived from\n16-25mer probe sequence motifs that are complementary to\nthe set of fluorescently labeled target sequences (Table 1)\navailable for this study. On the DNA Chip each probe set\n\n2\n\n\ffeatures are arranged in groups of four, corresponding to the\nfour possible substituent bases (A, C, G and T) at a particular base position. A group comprises three mismatch probes\nplus one perfect match probe (PM) used for control. Sixteen\nof these feature groups (one for each base position) are arranged in a square feature block comprising in total 64 features (Figures 1 and 2A).\nb) Single base bulges\nSingle base insertions and deletions, due to an extra unpaired\nbase result in bulged duplexes with reduced stability. A comprehensive study on the impact of single base insertions was\nperformed. The experiment comprised about 1000 single base\ninsertion probes (insertion base type and position systematically varied) derived from twelve 20 to 25mer probe sequence\nmotifs.\nc) Comparison of different point-defects\nAn experiment allowing for a direct comparison of PM, MM,\nsingle base insertion and deletion probes has been performed.\nProbe sets were derived from 16mer probe sequence motifs,\ncomplementary to the targets in Table 1. For each of the 16\npossible defect positions a set of 9 probes (comprising four\nsingle base insertions, one base deletion, three MMs and one\nPM probe) has been created. To avoid that a regular arrangement of the probe features could possibly affect the measurement (e.g. by introducing a bias due to increased target depletion near a PM probe), the sets of nine probes were randomly arranged in 3×3 matrices.\nd) Influence of the positional distribution of multiple defects\nTo investigate how the distribution of two or more defects\naffects duplex stability we followed two approaches: We designed a probe set comprising all two-deletion mutations of a\n20mer probe sequence motif: Deletions D1 and D2 (as shown\nin Figure 2C) were introduced at positions x and y. The positions of the defects were independently varied from base positions 1 to 20, resulting in a 20×20 matrix (Figures 2D and\n11) of 400 probes comprising all two-deletion probes in duplicate (plus 20 single deletion probes - for x and y coinciding).\nTo extract the pure influence of the defect configuration on\nthe HS, averaging was performed over a set of nine different\n20mer motifs to eliminate sequence specific bias.\nFor larger numbers of defects we applied a statistical approach. Based on a 20mer probe motif we created sets of randomly mutated probes containing a fixed number of one to\nfive base deletions at random positions.\n\nA\nC\nG\n\n1\n\nT\nA\nC\nG\n\n2\n\nT\n\nFigure 1. Fluorescence micrograph of hybridized features in\nthe 16mer mismatch experiment. The shading-corrected image\nshows two feature blocks corresponding to two different 16mer\nprobe sequence motifs (3'-TTGAGCGATATTACTG-5' - to the\nleft, 3'-TATTACTGGACCTGAC-5' - to the right) both hybridizing with the fluorescently labeled target sequence COM\n(5'-Cy3-AACTCGCTATAATGACCTGGACTG-3'). Feature size\nis 21 μm. Each feature block comprises all single base mismatches\nof the particular probe sequence. Groups of four features (as indicated by the marked groups 1 and 2) correspond to each one\nthe 16 possible mismatch base positions. As indicated by the letters between the feature blocks the uppermost row of features in\neach group corresponds to an A base at the corresponding base\nposition, followed by probes with C, G and T (see also Figure\n2A). The brightest feature within each group corresponds to the\nperfect matching probe. Nonhybridized targets in the hybridization solution contribute to the background intensity between the\nfeatures. Mismatch intensity profiles for the probe sequence motif\n3'-TATTACTGGACCTGAC-5' are shown in Figure 3.\n\nby the background intensity reduces intensity variations due\nto lamp flicker.\nIhyb,surf =\n\nIF − Isol\nIsol\n\n(1)\n\nExperiments\nThe flexibility of the in situ synthesis and the excellent spot\nhomogeneity simplifies a comprehensive comparative analysis\nwith the capability to detect subtle differences of the probe\naffinities. The experiments mainly differ in selection and spatial arrangement of the probe sequences. Particular experiments focus on the extraction of the positional dependence,\nthe comparison of different defect types and on the identification of further influential parameters.\nSpatial variations of the photodeprotection intensity and optical aberrations affecting the imaging contrast can result in\ngradients (as indicated in Figure 2B) of the probe DNA quality (due to a varying number of synthesis errors). Thus, for\na reliable determination of subtle differences in hybridization\naffinities, probes to be compared directly should be closely\nspaced on the microarray. In the following we describe the\ndesign of the individual experiments:\na) Single base mismatch study\nTo investigate the positional dependence of single base mismatches and the impact of the mismatch type, we designed\nmicroarrays containing comprehensive sets of MM probes derived from a series of 25 16mer probe sequence motifs. Position and type of the mismatch base pair were systematically\nvaried, allowing us later to distinguish between the dominating positional dependence and other influential factors. The\n\nRESULTS\nInfluence of the point defect position\nFrom the profile plots (plots of the normalized hybridization\nsignal vs. defect position - cf. Figures 3 and 6) we see that the\nmost influential parameter determining hybridization intensity is the position of the defect. We observe that the intensities of the particular mismatch probes (Figure 3) are lined-up\nalong the mean profile, which can be roughly approximated\nby a second degree polynome.\nDefects in the middle of the probes are most destabilizing.\nFor 16 mer duplexes a single MM in the center typically results in 0-40% of the PM hybridization signal. Whereas de-\n\n3\n\n\fA\n\nB\n\nC C C\n\nC\n\n0.3\nHybridization\nsignal (a.u.)\n\nC\n\n0.35\n\n1\n\n1 3 5 7 9 11 13 15\nA A A A A A A A\nC C\n\nC\n\nG G G G G G G G\nT\n\nT\n\nT\n\nT\n\nT\n\nT\n\nT\n\n0.4\n\nA\n\nT\n\nA A A A A A A A\nC C\n\nC\n\nC C C\n\nC\n\n0.25\n0.2\n0.15\n0.1\n\nC\n\n0.05\n\nG G G G G G G G\nT\n4\n\nT\n6\n\nT T T T T\n8 10 12 14 16\n\n16\n\nD\n\nC\n\ny\n\ny\nD1\nL1\n\nD2\nL2\n\n5\n10\nMismatch base position\n\n15\n\n5\n10\nMismatch base position\n\n15\n\n0.05\n0\n\n−0.05\n\nx\n3'\n\n0\n\nB\nDeviation from\nthe mean (a.u.)\n\nT\n2\n\n0\n\n5'\nL3\n\nC\n\nhigher\nlower\nT\n\nx\n0\n\nFigure 2. Microarray feature arrangements (A) for the single\nbase mismatch experiment (compare with Figure 1) and (B) for\nthe comparison of various defect types. The gradient indicated in\n(B) demonstrates that the erroneous variation within the closely\nspaced feature set belonging to a particular defect position (as depicted with dashed boxes for positions 1 and 16) is significantly\nsmaller than features located far apart. (C) In the two-defect-experiment defects D1 and D2 at varying positions x and y divide\nthe sequence into three subsequences of length Li . (D) The probe\nset comprising all configurations of the two defects is arranged in\nmatrix form. Compare with the results in Figure 11.\n\nA T\n\nT\n\nA C T G G A C C T\n5\n10\nMismatch base position\n\nG A C\n15\n\nFigure 3. Mismatch intensity profile (A) (HS vs. defect base position) obtained from the hybridization signals of the feature block\nshown in the right part of Figure 1. The probe sequence motif\n3'-TATTACTGGACCTGAC-5' is complementary to the target\noligonucleotide COM. Markers depict the substituent base type\n(A red crosses; C green circles; G blue stars; T cyan triangles).\nThe black line indicates the mean profile (moving average of all\nmismatch HS over positions p-2 to p+2). PM probes, included as\ncontrol to detect erroneous bias, have the largest HS (at a level of\nabout 0.38 a.u.). The variation of the PM probe intensities also\nprovides an estimate for the error of the measurement. Errors between distant features, due to gradient effects, are expected to be\nlarger than errors between the compactly arranged features corresponding to a particular defect position. (B) Deviation profile.\nThe strong position dependent component of the HS is eliminated\nby subtraction of the mean profile. (C) Comparison of mean mismatch HS (average of the three mismatch HS at a particular defect\nposition) at the sites of C*G base pairs to mean MM hybridization\nsignals at the site of adjacent A*T base pairs. A marker (red star:\nA*T; blue circle C*G)is set in the upper row if the HS of the mismatches at the corresponding site is higher than that at the adjacent site; otherwise a marker is set in the lower row. We noticed\nthat mismatches substituting a C*G base pair usually have systematically lower HS than mismatches substituting a neighboring\nA*T base pair.\n\nfects near the edges only have a small effect. Nonpositional\nfactors (e.g. mismatch type and nearest neighbor effects) have\nsignificantly smaller influence on the HS than the defect position. Variation of the intensity profiles due to mismatch type\nand other nonpositional factors is usually less than 20% of\nthe PM intensity level. The discrimination between PM and\npoint-mutated probes depends on the stability of the particular probe sequence. Shorter 16mer sequences (Figures 3A and\n9) are more discriminative than the more stable 25mer probes\n(shown in Figure 6). Increased stability can also be achieved\nwith a high CG content of the probes. Probe sequence motif\n4 in Figure 4 demonstrates that a high CG content results in\nincreased perfect match HS (due to normalization not noticeable here), albeit with reduced discrimination. The positional\ninfluence observed in the mean profiles is largely determined\nby the defect-to-end distance, but it is furthermore superimposed by a sequence dependent contribution. The variation\nof the shapes of the mean insertion profiles in Figure 4 indicates that the impact of a defect is affected by the stability\nof the local sequence environment.\n\nfocus on the separation of the different influential factors.\nEffect of the mismatch type\nFor the analysis of MM type and nearest-neighbor influences\nthe positional influence was eliminated by subtraction of the\nmean profile. The resulting 'deviation profile' (comprising\nnonpositional influences) is shown in Figure 3B.\nIn the following we use the notation of the mismatch base\npair X*Y consisting of the mismatching base X in the probe\nsequence and the base Y in the target sequence. A pairwise\ncomparison of the averaged mismatch HS (mean value of the\nhybridization signals of the three MM probes corresponding\n\nWe observe the same strong positional dependence for single base insertions (Figure 6) and deletions (Figure 9). For a\nsystematic study of other influential parameters (e.g. defect\ntype and defect neighborhood) the dominating positional influence has to be eliminated. Design (selection and arrangement of probes) and analysis of our experiments therefore\n\n4\n\n\fHybridization signal (a.u.)\n\n1\n\n4\n\n2\n\n0.8\n\n3\n\n1\n0.6\n\n0.4\n\n0.2\nT GA T GT T T GA A T CT CA CGT CGT CT CCCCT CA CCT T A A G\n0\n0\n\n5\n\n10\n\n15\n\n20\n25\nInsertion base position\n\n30\n\n35\n\n40\n\nFigure 4. The impact of defects is also affected by the local sequence environment. Normalized single base insertion profiles (hybridization\nsignal plotted versus the insertion base position) of four 25mer probe sequence motifs complementary to the same target URA. The\nprobe motifs 1 to 4 hybridize at different sections of the target oligonucleotide. Mean profiles (thick lines) were obtained from the\nmoving average of the particular insertion profiles (particular HS are shown as faint symbols - profile 4 is shown in detail in Figure 6A).\nThe mean profiles 1 to 3 have a distinct minimum between base positions 15 to 20. The stabilizing CG-rich region following after base\nposition 20 results in increased HS in profile 4.\n\nto a particular defect position - see Figure 3B) at directly\nadjacent defect positions reveals that mismatches affecting\nC*G base pairs decrease the intensities significantly more than\nmismatches affecting a neighboring A*T base pair (Figure\n3C). The magnitude of this effect is typically at 5 to 10% of\nthe perfect match HS. To investigate how the various MMtypes X*Y affect duplex stability we use data from 25 different probe sequence motifs. The PM hybridization signals of\nthe different 16mer probe sequence motifs display a strong\nvariation (up to a factor of 20), and are therefore not directly\ncomparable. Since the relative intensities (of the various MM\nprobes) within the probe sets are largely unaffected by this\nvariation, we can normalize the 'deviation profiles' by division\nwith their standard deviation. The resulting database comprising normalized hybridization signals (with the positional\ninfluence eliminated) from about 1000 different single MM\nprobe sequences, is categorized according to mismatch type.\nThe boxplot representation of this data (Figure 5) shows that\nMM-types affecting C*G base pairs (A*C, C*C, T*C and A*G,\nG*G, T*G) systematically have lower median hybridization\nsignal values than those MM-types affecting A*T base pairs\n(A*A, C*A, G*A and C*T, G*T, T*T).\nA mismatch base substituting C or G is statistically more\ndestabilizing than a MM base replacing A or T, indicating\nthat C*G base pairs are more crucial for duplex stabilization\nthan A*T base pairs. This leads to obvious differences between the distributions A*C/C*A, A*G/G*A, T*C/C*T and\nT*G/G*T. Although the mismatch types X*Y and Y*X may\nbe thought to be equivalent (because the bases involved are\nthe same), they result in different PM/MM hybridization signal ratios, depending on the type of base pair (A*T or C*G)\naffected by the mismatch. For example, the impact of the MM\nA*C affecting an A*T base pair is (on average) smaller than\nthe impact of the MM C*A affecting a C*G base pair. Thus\nthe ratio of MM to PM hybridization signals, i.e. the relative\n\nGA\nTT\nGT\nAG\nCT\nCA\nAA\nTG\nCC\nTC\nAC\nGG\n−1 −0.5\n0\n0.5\n1\n1.5\n2\nMismatch type dependent contributions\nto intensities [a.u.]\n\nFigure 5. Boxplot representation of the hybridization signal distributions for the individual mismatch types, arranged according\nto the median values (depicted by the vertical line at the notch).\nBoxes indicate the interquartile range (from the 25th to 75th percentile) containing 50% of the data. Whiskers extend to a maximum value of 1.5 times the interquartile range from the boxes\nends. Values beyond are classified as outliers. If the notches of two\nboxes do not overlap the medians values differ significantly with\na 95 percent confidence. The mismatch types with the lowest hybridization signals are those (T*G, C*C, T*C, A*C, G*G) where C*G\nbase pairs are affected by the mismatch defect. The only exception\nis A*G. The positive tails of this and other distributions seem to\noriginate from stabilizing C*G base pairs next to the defect.\n\n5\n\n\fstability of the MM duplex in comparison to the corresponding PM duplex is larger for the mismatch A*C than for the\nmismatch C*A:\n\nA\n\nHSM M =A*C\nHSM M =C*A\n>\nHSP M =A*T\nHSP M =C*G\n\nHybridization\nsignal (a.u.)\n\n1\n0.9\n0.8\n0.7\n0.6\n0.5\n\nNearest neighbor influence\nIntensity\nIntensity\ndeviation (a.u.) deviation (a.u.)\n\nB\n\nThe distribution of HS of the mismatch type A*G which\nhas a distinct maximum at negative values (i.e. HS values\nbelow the average, cf. Figure 5) extends also far towards the\npositive side, indicating many occurrences of increased HS\nvalues. This tail of increased hybridization signals largely\ncorresponds to A*G mismatches with nearest neighbors\n(right and left to the mismatch base) CC, CT and TC. For a\nsystematic study the mismatch HS data is now categorized\nnot only for the mismatch type (as discussed above), but\nalso for the nearest neighbor bases (i.e. the bases next to the\nmismatching base). There are 16 neighborhood categories\nfor each of the 12 mismatch types. Since our database is too\nsmall for a detailed analysis of all neighborhood categories,\nwe simplified the neighborhood classification to only three\nneighborhood categories: A*T base pairs only, C*G base pairs\nonly and mixed neighborhoods of A*T and G*C base pairs.\nFor 9 of the 12 mismatch types the HS are significantly increased if the base pairs adjacent to the defect comprise at\nleast one C*G base pair. Exceptions are the mismatches G*T,\nC*T and A*A. We also noticed a tendency that mismatches\nwith two C*G-neighbors have larger HS than such with only\none C*G-neighbor, but, to be significant, this result needs to\nbe corroborated with more data.\nThe largest neighborhood-related variations are observed\nfor X*G - mismatches (with X=A,G or T), whereas X*Tmismatches consistently show the smallest neighborhoodrelated variations.\n\nC\n\n0\n\n5\n\n10\n\n15\n\n20\n\n25\n\n20\n\n25\n\nInsertion base position\n0.2\n0\n−0.2\n0\n\n5\n\n10\n\n15\n\nInsertion base position\n0.2\n0\n−0.2\n0\n\nCA C GT C GT C T CCC CT C A CC T T A A G\n5\n10\n15\n20\n25\n\nInsertion base position\n\nFigure 6. (A) Single base insertion profile (hybridization signal\nplotted versus insertion base position) of the probe sequence motif\n3'-CACGTCGTCTCCCCTCACCTTAAG-5' (complementary to\nthe target URA). Symbols correspond to insertion bases (A red\ncrosses; C green circles; G blue stars; T cyan triangles). The mean\nprofile (black line), obtained from the moving average (including\nall 4 insertion types) over positions p-2 to p+2 shows the common\npositional dependence. Insertions to the left and to the right of an\nidentical base (Group II bulges - see text) result in identical probe\nsequences. (B) and (C) Deviation profiles. Positional influence is\nelimated by subtraction of the mean profile. Elevated intensities\nare observed for Group II bulges (e.g. C insertions at positions\n11 to 15, 6 to 7 and 18 to 20 or G insertions at positions 4 to 5\nand 7 to 8). A very distinct increase of the HS is observed for C\ninsertions into the subsequence TCCCCT. Group II bulges (red\nmarkers) have significantly higher intensities compared to Group\nI bulges (blue markers).\n\ndle of 16mer probes hybridization signals approaching that of\nthe corresponding perfect match probe are not unusual. Figure 6C demonstrates the systematically increased stability of\nGroup II bulges. A statistical analysis with a larger dataset\n(Figure 7) comprising HS data from 1000 different probes indicates the general validity of the result. The median HS values of Group I insertions do not significantly differ with the\nbase inserted. Compared to these results, in a similar experiment with 16mer probes (cf. Figure 7) the HS of Group I C\ninsertions were significantly increased, whereas HS of Group\nI A insertions were reduced to that of mismatches. The lower\nhybridization temperature of 30◦ C (compared to 40◦ C for the\nlonger 20-25mers) could be responsible for the difference [4].\nLargest differences in the 25mer experiment (corresponding\nto about 20% of the PM hybridization signal) between Group\nI and Group II bulges are observed for G-insertions , whereas\na significantly smaller difference (of only 5%) is found for Tinsertions. At the ends of the duplex the average difference\nbetween Group I/Group II HS is reduced to about 50% of\nthe value that is observed for defects in the middle of the duplex. In case of single base deletions (e.g. in Figure 9, orange\ndashed line) HS for Group II bulges are increased, albeit the\ndifference between Group I and Group II bulges unexpectedly\nis distinctly smaller than for insertion defects. Interestingly,\n\nSingle base bulge defects\nSingle base insertions and deletions result in bulged duplexes\nwith reduced stability. In duplexes with single base insertion\nprobes the bulged base is located on the surface-bound probe\nstrand, whereas for single base deletion probes the bulged\nbase is located on the target strand. The positional dependence of the insertion intensity profiles (Figure 6A) is very\nsimilar to the mismatch intensity profile in Figure 3, though\nthe individual insertion profiles (for example the profile of\nC-insertions - green circles in Figure 6) show large deviations from the mean (moving average) profile. Hybridization\nsignals are significantly increased over two or more consecutive defect positions. These defects, corresponding to base\ninsertions next to identical bases, result in relatively stable\nduplexes. This effect was previously described by Ke et al.\n[20]. In the notation of Zhu et al. [21] bulged bases without\nan identical neighboring base are defined as Group I bulges,\nwhereas bulges with at least one identical neighboring base\nare referred to as Group II bulges. We found the stabilizing\neffect of Group II bulges (in respect to Group I bulges) to be\nsurprisingly large. For Group II bulges located near the mid-\n\n6\n\n\fthe deletion profiles are well confined within the HS range\nspanned by the various mismatch defects.\n\nIC−IA\n25\nNumber of probes\n\nNumber of probes\n\n0.3\n\n20\n15\n10\n5\n\n0.2\n\n0\n−0.4\n\n0.1\n\n25\n\n20\n15\n10\n5\n0\n−0.4\n\n−0.2\n0\n0.2\n0.4\nIntensity difference (a.u.)\n\n−0.2\n0\n0.2\n0.4\nIntensity difference (a.u.)\n\n0\n−0.1\n\n20\n15\n10\n5\n0\n−0.4\n\n−0.2\n\nIT−IA\nNumber of probes\n\nIG−IC\nNumber of probes\n\nIntensity deviation (a.u.)\n\nIG−IA\n\n25\n\n25\n20\n15\n10\n5\n0\n−0.4\n\n−0.2\n0\n0.2\n0.4\nIntensity difference (a.u.)\n\n−0.2\n0\n0.2\n0.4\nIntensity difference (a.u.)\n\nIT−IC\nA II\n\nCI\n\nC II\n\nGI\n\nG II\n\nTI\n\nT II\n\nInsertion type\nFigure 7. Boxplots show the hybridization signal deviations (from\nthe mean profile) for the different insertion base types, which are\ndifferentiated according to affiliation to bulge Group I/II. The\nstatistical analysis includes about 1000 normalized hybridization\nsignals from 12 different 20 to 25mer probe sequence motifs.\n\nIT−IG\n\n25\n\nNumber of probes\n\nAI\n\nNumber of probes\n\n−0.3\n\n20\n15\n10\n5\n0\n−0.4\n\n25\n20\n15\n10\n5\n0\n−0.4\n\n−0.2\n0\n0.2\n0.4\nIntensity difference (a.u.)\n\n−0.2\n0\n0.2\n0.4\nIntensity difference (a.u.)\n\nFigure 8. Histograms of hybridization signal differences IX-IY (X\nand Y denote the different insertion bases in otherwise identical\nprobe sequences) reveal correlations between the HS of different\ninsertion types. To exclude the impact of systematically increased\nintensities of Group II insertions only Group I insertions are regarded here. Between T- and G-insertions (and between C- and\nA-insertions) a correlation, as indicated by a narrow distribution\nwith a pronounced peak near zero, is observed. The broad distribution of HS differences between G and A insertions doesn't show\na distinct peak, indicating that there is no correlation but rather\nan anticorrelation for insertions of A and G.\n\nHybridization signal (a.u.)\n\nSystematically increased HS are not restricted to Group II\nbase bulges. For G-insertions next to a T base (e.g. in Figure\n6 at base position 15) HS are often significantly increased,\nsimilar as with Group II bulges.\nWe have further investigated the degree of correlation between probes with different insertion bases (Figure 8). A distinct correlation is seen between T- and G-insertions, and,\nthough less distinct, between A- and C-insertions. In contrast\nto that our results indicate an anticorrelation between G- and\nA-insertions.\nComparison of single base insertion, deletion and mismatch defects\nA direct comparison of HS of different point defects (Figure\n9) reveals that the positional influence is largely independent\nof the defect type.\nSingle base insertion probes provide distinctly larger hybridization signals than MM probes (Figure 10). This is partly\ndue to the reduced number of binding base pairs in the mismatched duplexes, but also due to the significantly increased\nHS of Group II insertions. Hybridization signals of MMs inserted into C*G base pairs are about 25% smaller than those\nof MMs inserted into A*T base pairs. Similarly, single base\ndeletions affecting C*G base pairs result in about 30% smaller\nHS than deletions affecting A*T base pairs. This can also be\nobserved in the deletion profile in Figure 9 (orange dashed\nline), where HS from deletions in C*G/A*T base pairs result\nin lower/higher HS. The fact, that the same effect has been\nobserved for MMs suggests, that in both cases the defecttype-dependent impact on the hybridization signal is largely\ndetermined by the type of base pair affected by the pointmutation.\n\n0.2\n\n0.15\n\n0.1\n\n0.05\n\n0\n0\n\nT\n\nT\n2\n\nG A\n4\n\nC\n\nT\n6\n\nT\n\nT\n8\n\nC\n\nG T T T C T G\n10\n12\n14\n16\n\nDefect position\n\nFigure 9.\nComparison of single base mismatches, insertions and deletions. The 16mer probe sequence motif\n3'-TTGACTTTCGTTTCTG-5' is complementary to the target\nBEI. Normalized mismatch probe intensities with substituent\nbases A (red crosses), C (green circles), G (blue stars), T (cyan\ntriangles), running average of mismatch intensities (black line);\nnormalized single base insertion probes (solid lines) with insertion\nbases A (red), C (green), G (blue), T (cyan). Hybridization signals\nof single base deletions (orange dashed line) are comparable to\nthat of mismatches at the same position. Increased HS of certain\ninsertion defects are due to positional degeneracy (see discussion)\nof base bulges.\n\n7\n\n\fHS\nI−TII\n\n20\n\nI−TI\n\n18\n\n0.9\n0.8\n\ny ( base position of deletion D2)\n\nI−GII\nI−GI\nI−CII\nI−CI\nI−AII\nI−AI\nD@CG\nD@AT\n\n16\n0.7\n14\n0.6\n12\n0.5\n10\n0.4\n8\n0.3\n6\n0.2\n\nD\n\n4\n0.1\n\nM@CG\n\n2\n\nM@AT\n\n2\n\n4\n\n6\n\n8\n\n10\n\n12\n\n14\n\n16\n\n18\n\n20\n\nx (base position of deletion D1)\n\nM−T\nM−G\n\nFigure 11. Hybridization signals of 20mer probes (normalized in\nrespect to the maximum HS) with two single base deletion defects\nD1 and D2 at varying positions x and y (compare to 2D). Averaging over data sets obtained from 9 different probe sequence motifs\nhas been performed to eliminate nonpositional contributions (e.g.\ndifferences resulting from deletions affecting either A*T or C*G\nbase pairs) from the HS. The resulting data set shows the influence of the defect distribution on the hybridization signal. Defects\nat the probe 3'-end (base position 1) affect the HS slightly less\nthan defects at the 5'-end.\n\nM−C\nM−A\n0\n\n0.2\n\n0.4\n0.6\n0.8\n1\nHybridization signal (a.u.)\n\n1.2\n\n1.4\n\nFigure 10. Comparison of the hybridization signals of different\npoint mutation types. To minimize positional influence the statistics include only defect positions 5 to 12, located in the center of\nthe 16mer probes. The 1200 probe sequences were derived from 17\nprobe sequence motifs. HS are normalized in respect to the perfect\nmatch HS. Defect categories: mismatch M-X (X: substituent base);\nmismatches at A*T and C*G sites M@AT, M@CG; single base deletion D; deletions at A*T and C*G sites D@AT, D@CG; single base\ninsertion I-XI/II (X: insertion base, I/II: Group I/Group II base\nbulge). Hybridization signals from insertion probes (about 50% of\nthe PM hybridization signal for Group I; 65% for Group II - median values) are significantly higher than that of MM probes (at\nabout 30%). Mismatches at A*T sites result in about 25% larger\nHS than MMs at C*G sites. Deletion probes have a median hybridization signal that is slightly lower than the median MM hybridization signal. Group I base bulges with the exception of I-AI\n(33%) have HS of about 50% of the PM hybridization signal. Hybridization signals of Group II base bulges are significantly higher\n(about 100% for A insertions, and only 5% for T insertions) than\nthat of the corresponding Group I bulges.\n\nTherein Li denote the lengths of defect-free subsequences - a\nand b are free parameters. To account for the fact that longer\nsubsequences contribute disproportionately more to the HS\nthan shorter ones, the exponent ν is introduced, putting a\nlength dependent weighting factor to the particular lengths\nLi . In Figure 12A the HS of the two-deletion experiment were\nplotted versus the parameter f from equation (2). As shown\nin Figure 12A equation (2) also predicts HS for probes with\na larger number of deletions.\n\nMultiple defects - influence of defect distance\n\nDISCUSSION\n\nIn two-deletion experiments (Figures 2C and 11) we determined the HS of 20mer probes with systematically varied arrangements of two single-base deletions. The HS is largest\nwhen both defects are located close to one or both ends. Lowest hybridization intensities are observed for defect configurations dividing the sequence into three roughly equally long\nsubsequences. Closely spaced defects (with a distance of less\nthan 4 bases - located near the diagonal of the plot) result\nin increased hybridization signals approaching that of single\nbase deletions as the distance between the defects is reduced.\nHybridization signals of multi-defect probes can be described\n\nInfluence of synthesis errors originating from the\nlight-directed in situ synthesis process\n\nby equation (2).\nf =a*\n\nX\n\nLνi + b\n\n(2)\n\nLight directed in situ synthesis, due to stray light and incomplete coupling reactions, introduces point mutations (MMs,\ninsertions an deletions) in the probe sequences. A large fraction (we estimate about 80% [16]) of the probes contains at\nleast one point defect. Our experiments demonstrate that\nprobes with point defects do contribute significantly to the\nHS. The distribution of various point defects contained within\na microarray feature results in broadening of the melting tran-\n\n8\n\n\fA\n\n1\n\n0.8\n\nHybridization signal (a.u.)\n\nHybridization signal (a.u.)\n\n1\n\n0.6\n\n0.4\n\nf=\n\nP\n\nL1i .4\n\n0.2\n\nB\n\n0.8\n0.6\n0.4\n\nf=\n\n0.2\n\nP\n\nL1i .4\n\n0\n0\n35\n\n40\n\n45\n50\n55\nFitting parameter f\n\n60\n\n65\n\n30\n\n35\n\n40\n45\n50\n55\nFitting parameter f\n\n60\n\n65\n\nFigure 12. Fitting of the hybridization signals of multiple-defect\nprobes. (A) Hybridization signals obtained from the two-deletion\nP 1.4\nexperiment are plotted versus the fitting parameter f =\nLi (Li : length of defect-free subsequences - see Figure 2C) (two deletions:\nblue crosses; single deletion - for x and y coinciding: red circles). The fit can further be improved by correction for the 3'-bias observed\nin Figure 11. (B) Similar experiment with a varying number of deletions (at randomly chosen positions) in the 20mer probe sequence\nmotif 3'-TAGTCACGGACACATGATCC-5'. Marker types indicate the number of deletions: 1 red cross; 2 green cross ;3 blue star;\n4 cyan square; 5 black circle). Because only data from a single probe sequence motif was available, non-positional (sequence related)\ncontributions couldn't be eliminated, thus resulting in increased scattering of the HS.\n\nport a 0.5 kcal/mol stabilization increment per each base position that the defect is closer to the helix end. A positional\ninfluence was observed for U*U and A*A, whereas G*G MM\nstability was largely unaffected by the position. Dorris et al.\n[24] found a similar positional influence for 2-base MM and 3base MM probes on CodeLink 3D gel arrays. They observed\na strong correlation between solution-phase melting temperatures and microarray hybridization signals of the MM duplexes. More recently Wick et al. [5] and Pozhitkov et al. [6]\nreported a strong influence of the defect position on the HS of\nsurface-bound single base MM probes (fabricated by in situ\nsynthesis). They present averaged profiles showing a similar\npositional influence as observed in our experiments with individual probe sequence motifs. In accordance with [6] we have\nidentified MM position (relative to the duplex ends) as the\nstrongest influential factor on the HS, when compared to MM\ntype and nearest neighbors. Position dependence is in contrast to the nearest-neighbor model of DNA duplex thermal\nstability, where the thermodynamics of internal mismatches\nis treated as independent of the MM position [25].\nFor single base bulges we observed the same position dependence as for MMs. Also, the magnitudes of the impacts of the\ndifferent point-mutations on the HS are very similar (with\nthe exception of Group II bulges, which have significantly\nhigher HS). These coincidences suggest a common origin of\nthe positional influence, which is independent of the defect\ntype. Focusing on individual probe sequence motifs, we discovered, that the positional influence does not only depend on\nthe defect-to-end distance, but also has a sequence-dependent\ncontribution. This indicates that the impact of a defect is af-\n\nsition. This effect has also been observed for mixtures of truncated probe sequences [22]. Experiments where we systematically varied the degree of UV deprotection (results not shown)\nto introduce a varying number of deletion defects show that\nduplex stability, melting temperature and hybridization signal intensity are reduced as the number of defects increases.\nThe statistical nature of the synthesis errors and the large\nnumber of different defect types (for a 20mer probe sequence\nthere are about 160 different single base defects) prevents a\nbias towards a particular type of defect. Our experimental results demonstrate that despite a large fraction of probes containing random defects, a high discrimination of single base\ndefects can be achieved. The discrimination between PM and\nsingle base defect hybridization signals is determined by duplex length and CG content. With increasing overall duplex\nstability the relative destabilizing impact of single base defects is reduced.\nInfluence of the defect position\nWe found a dominating influence of the defect position on\nduplex stability. Hybridization signals are largely determined\nby a smoothly varying function of defect position. Defects\nin the middle of the duplex have significantly smaller HS\nthan defects at the ends of the duplex, which usually result\nin small or insignificant decreases compared to the PM hybridization signal. Strong positional influence, has also been\nreported by other authors: From optical melting studies (on\n7mer RNA/RNA duplexes in solution) Kierzek et al. [23] re-\n\n9\n\n\fIt is uncertain whether defects can lower the threshold for\nbubble formation so much that denaturation bubbles in short\nduplexes (in our experiments 25 bases) become relevant in\ncomparison to partial denaturation from the end. The very\nsimilar impact of various mismatch and bulge defects on the\nHS also doesn't favor the idea of bubble formation, as distinct differences in the impacts of the defect types might be\nexpected. Also, the surprisingly large HS of Group II single\nbulges, which from a static point of view do not differ from\nGroup I bulges, could be better explained with a kinetic zipper model of the DNA duplex (the latter effect is discussed\nfurther below).\nWe suggest that defects may act as kinetic barriers, preventing the rapid zipping of the strands. In PM duplexes,\nat temperatures below the PM melting temperature, complete unzipping of the duplex can be regarded as a very rare\nstochastic event, since the zipping rate k+ is 4 to 9 times\nlarger [32] than the unzipping rate k− . A defect, due to its\nunsuitable conformation, may significantly reduce the zipping rate k+ at the defect site. Since the duplex is kinetically\ntrapped in a weakly hybridized state with only few remaining base pairs, the probability for a complete dissociation,\nand thus the dissociation rate, is increased in comparison to\nthe PM duplex.\nThe destabilizing effect is expected to be position-dependent.\nIts impact is largest if the defect is located in the middle of\nthe duplex, since then, in the kinetically trapped conformation, the duplex is unzipped by more than 50%. Depending\non the position of the defect the dynamic equilibrium of continuous partial melting and renaturation is shifted towards\nthat of shorter effective duplex lengths, with an increased\nprobability for complete strand dissociation.\nSterical crowding at the surface [35] could possibly introduce\na positional dependence on the HS of defect probes. Reduced\naccessibility of the probes surface-bound 3'-ends can in principle decrease the impact of defects located near the 3'-end,\nand thus result in increased hybridization signals of the\ncorresponding probes. This runs contrary to the largely symmetrical intensity profiles observed (cf. Figure 3) and does\ntherefore not provide an explanation for the impact of defect\nposition. Pozithkov et al. [6] report increased HS from probes\nwith MM defects near the surface-bound 3'-end. This bias is\nin accordance with results from our two-deletion-experiment\n(Figure 11). In our case the bias could also originate from\na rather limited set of 9 probe sequence motifs. In other\nexperiments, focussing on single defects, we didn't notice\nsystematically increased HS for 3'-located defects.\n\nfected by the stability of the local sequence environment (beyond the nearest neighbors). A similar sequence-dependence\nof the base pair closure probability has been predicted in zipper models of the DNA [26,27].\nIn the following we discuss our results in the context of the\nopening and closing dynamics of a molecular zipper model of\nthe DNA duplex [28,29,30,31,32,33]. Due to partial melting\npropagating from the ends (a high initiation barrier prevents\nthe formation of denaturation bubbles in the interior of the\nrelatively short oligonucleotide duplexes), the base pair closure probability is reduced towards the duplex ends.\nIn a very simple model the influence of defect position on the\nhybridization signal HSdef (x) could be described by equation\n(3), in which the PM hybridization signal HSP M is reduced\nby the position-dependent impact of the defect. The latter is\ndetermined by the base pair closure probability Pcl (x) and\nthe (defect type dependent) impact Idef .\nHSdef (x) = HSP M − Pcl (x) ∗ Idef\n\n(3)\n\nIn the following we assume that a duplex dissociates once\nit is completely unzipped. Then a parabola-like positiondependence, as observed in our experiments, with relatively\nlarge base pair opening probabilities Pop (x) = (1 − Pcl (x))\nnear the middle of the duplex, implies an unrealistically large\nduplex dissociation rate. In fact Pop (x) is expected to decay\nexponentially, approaching a value close to zero in the middle\nof the duplex. A fast decay of the opening probability (with\ntypically Pop (x) > 0.1 only for the two or three outermost\nbase pairs) is required for a realistic duplex dissociation rate.\nShort duplexes coexist with single strands in a bimolecular\nequilibrium with only a very small proportion of partially\nunzipped duplexes present [29,30,32]. Since the base pair closure probability Pop must be very close to one in a bimolecular equilibrium of duplexes and single strands, we must\nconclude that the above model (equation 3) is too simplistic.\nThe results of the two-deletion experiments show that the\nlonger defect-free subsequences contribute disproportionately to the HS signal. For adjacent defects, separated by less\nthan 5 base positions, hybridization signals are increased. HS\nof directly adjacent defects (here a merged two-base bulge is\nexpected) are close to that of single base bulges and significantly larger than the smallest HS which are observed for\ndefect distances of 5 to 6 base positions (cf. Figure 11). Thus\nthe effect of 2 deletions on the HS is not additive but depends\nstrongly on the positional distribution of the defects. The\nHS of probes with two deletions is well fitted by equation 2\n(cf. Figure 12), basically the weighed sum of the lengths of\ndefect-free subsequences of the duplex.\nThe connection between the hybridization signal and the\nlength of defect free sub-sequences suggests that defects\nmainly affect the zippering of the DNA strands. Zeng and\nZocchi [34] observed an essentially two-state melting process\nfor short single MM oligonucleotide duplexes. They propose\ntwo mechanisms how mismatch defects could affect duplex\nstability. 1. Defects may lower the barrier for bubble formation. 2. A defect could introduce 'extra ends' in the middle of\nthe duplex, thus resulting in two separate, effectively shortened duplexes, with reduced stabilities.\n\nMM type and nearest neighbor influence\nWe observed that single-base MMs introduced at the site of\na C*G base pair result in a larger decrease of the hybridization signal (in respect to the PM hybridization signal) than\nMM defects affecting A*T base pairs. The same effect is seen\nfor single base deletions. This indicates that the individual\nC*G base pairs are significantly more important for duplex\nstability than A*T base pairs. The effect seems to largely\ndetermine the impact of the different MM types X*Y on the\nHS. Our experimental results, in accordance with nearestneighbor thermodynamic parameters for Watson-Crick base\n\n10\n\n\fpairs [25], reflect the increased base stacking and hydrogen\nbonding interactions of C*G base pairs.\nThe type-specific impact of MMs is shown in the following\nseries (see also Figure 5), which is ordered according to median hybridization signals obtained from 16mer single base\nMM duplexes (DNA/DNA). The largest hybridization signal, corresponding to the least impact, is observed for G*A.\nG*A>T*T≥G*T>A*G≥C*T≈C*A>A*A≈T*G≈C*C≈T*C\n≥A*C≥G*G. This order is in good agreement with a similar\norder of normalized HS determined by Wick et al. [5]. A significant difference is the mismatch base pair G*G which Wick\nand also Sugimoto et al. [36] have identified as a relatively\nstable MM base pair. Interestingly, in accordance with our\nresults, Pozithkov et al. [6] have recently reported G*G to be\namong the least stable mismatch base pairs.\nWe find that (with the exception of A*G) mismatch types affecting C*G base pairs result in lower HS than those affecting\nA*T base pairs. The difference between mismatch types X*Y\nand Y*X (a similar observation with RNA/DNA duplexes has\nbeen described in [6]) is introduced by the comparison (due to\nnormalization) with the corresponding PM hybridization signal. Here we find again that defects affecting C*G base pairs\nresult in a larger decrease of the HS (in respect to the PM\nhybridization signal) than defects affecting A*T base pairs.\nCategorization of mismatch types into two groups affecting\neither A*T or C*G base pairs (this also separates the MM\ntypes X*Y and Y*X) results in two equivalent orders of MM\naffinities: GA>GT>CT≈CA and AG>TG≥TC≥AC\nThe variation of the HS observed for the particular MM\ntypes is largely due to nearest neighbor effects. C*G base\npairs next to the MM defects (for most MM types) result in\nsignificantly increased HS. This 'closing base pair effect' has\nalso been described in [25].\n\nnaturation) of the duplex. Frameshift due to the additional\nbase doesn't allow hybridization beyond that point, resulting\n- depending on the defect position - in a weakly bound partially zipped duplex. Duplex closure can only progress if the\nsurplus base is making room (forming a looped out or stacked\nconformation), thus allowing the subsequent base to form a\nWatson-Crick base pair with the complementary base in the\ntarget strand. From this point zipping can continue rapidly.\nFor Group II sequences there is an important difference: The\nzipping is interrupted at the defect site, which is located at\nthe end of the group of degenerate (identical) bases. As with\nGroup I sequences, at the barrier partial unzipping is likely\nto occur. There is now an increased probability that one of\nthe degenerate bases makes way (i.e. goes into bulge conformation) and allows the subsequent base to form a base pair.\nThen, as the frameshift is now compensated, the rapid zipping, resulting in a stabilized duplex, can continue. Duplex\nformation for Group I bulges is expected to be slower because\nfor Group I bulges it is necessary that the particular (nondegenerate) surplus base gets into the suitable conformation.\nWith Group II insertions the barrier, which is trapping the\nduplex in a weakly bound partially zipped state, can be overcome faster, resulting in increased stability.\n\nStabilization of Group II single base bulges\n\n[2] Urakawa, H., El Fantroussi, S., Smidt, H., Smoot, J. C.,\nTribou, E. H., Kelly, J. J., Noble, P. A., and Stahl, D. A. (2003)\nOptimization of single-base-pair mismatch discrimination\nin oligonucleotide microarrays. Applied and environmental\nmicrobiology, 69(5), 2848–2856.\n\nREFERENCES\n[1] Wallace, R. B., Shaffer, J., Murphy, R. F., Bonner, J.,\nHirose, T., and Itakura, K. (1979) Hybridization of synthetic\noligodeoxyribonucleotides to phi-chi-174 dna effect of single\nbase pair mismatch. Nucleic Acids Research, 6(11), 3543–\n3557.\n\nWe observe significantly increased HS of single-base insertion\ndefects in which the insertion base is placed next to a likebase. Increased stability of Group II bulges in comparison\nwith Group I bulges is well known [20,21,37]. According to\nKe and Wartell [20] the increased stability of Group II bulges\noriginates from positional degeneracy of the extra unpaired\nbase. Additional conformational freedom, entailaing higher\nentropy, results in lowered duplex free energy. According to\nZhu et al. [21] position degeneracy accounts for an average\nstabilization of -0.3 to -0.4 kcal/mol (in good agreement with\nthe theoretical estimate of -RT ln 2 = -0.43 kcal/mol at 37◦ C)\nfor a two position degeneracy. Znosko et al. [37] reported that\nGroup II duplexes are on average δ∆G37 =-0.8 kcal/mol more\nstable than Group I duplexes. We find that the insertion of G\nnext to T often results in relatively high duplex stability, comparable to a Group II insertion. This observation correlates\nwell with the relatively high stability observed for G*A mismatches, suggesting that the G*A mismatch base pair could\nbe degenerate with the neighboring A*T base pairs.\nFor explanation of the high stability of Group II duplexes we\npropose the following mechanism based on a molecular zipper\nmodel of the duplexes: After nucleation or partial unzipping\nof the duplex, extending beyond the defect site, the surplus\nbase might act as barrier, interrupting the rapid zipping (re-\n\n[3] Lee, I., Dombkowski, A. A., and Athey, B. D.\n(2004) Guidelines for incorporating non-perfectly matched\noligonucleotides into target-specific hybridization probes for\na dna microarray. Nucleic Acids Research, 32(2), 681–690.\n[4] Karaman, M. W., Groshen, S., Lee, C. C., Pike, B. L., and\nHacia, J. G. (2005) Comparisons of substitution, insertion and\ndeletion probes for resequencing and mutational analysis using\noligonucleotide microarrays. Nucleic Acids Research, 33(3),\ne33.\n[5] Wick, L. M., Rouillard, J. M., Whittam, T. S., Gulari, E.,\nTiedje, J. M., and Hashsham, S. A. (2006) On-chip nonequilibrium dissociation curves and dissociation rate constants\nas methods to assess specificity of oligonucleotide probes.\nNucleic Acids Research, 34(3), e26.\n[6] Pozhitkov, A., Noble, P. A., Domazet-Loso, T., Nolte, A. W.,\nSonnenberg, R., Staehler, P., Beier, M., and Tautz, D.\n(2006) Tests of rrna hybridization to microarrays suggest\nthat hybridization characteristics of oligonucleotide probes\nfor species discrimination cannot be predicted. Nucleic Acids\nResearch, 34(9), e66.\n[7] Fodor, S. P. A., Read, J. L., Pirrung, M. C., Stryer,\nL.and Lu, A. T., and Solas, D. (1991) Light-directed, spatially\naddressable parallel chemical synthesis. Science, 251(4995),\n767–773.\n\n11\n\n\f[8] McGall, G. H., Barone, A. D., Diggelmann, M., Fodor, S. A.,\nGentalen, E., and Ngo, N. (1997) The efficiency of lightdirected synthesis of dna arrays on glasssubstrates. Journal\nof the American Chemical Society, 119(22), 5081–5090.\n\n[22] Jobs, M., Fredriksson, S., Brookes, A. J., and Landegren,\nU. (2002) Effect of oligonucleotide truncation on sing lenucleotide distinction by solid-phase hybridization. Analytical\nChemistry, 74(1), 199–202.\n\n[9] Singh-Gasson, S., Green, R. D., Yue, Y. J., Nelson, C.,\nBlattner, F., Sussman, M. R., and Cerrina, F. (1999) Maskless\nfabrication of light-directed oligonucleotide microarrays using\na digital micromirror array. Nature Biotechnology, 17(10),\n974–978.\n\n[23] Kierzek, R., Burkard, M. E., and Turner, D. H. (1999)\nThermodynamics of single mismatches in rna duplexes.\nBiochemistry, 38(43), 14214–14223.\n[24] Dorris, D. R., Nguyen, A., Gieser, L., Lockner, R., Lublinsky,\nA., Patterson, M., Touma, E., Sendera, T. J., Elghanian, R.,\nand Mazumder, A. (2003) Oligodeoxyribonucleotide probe\naccessibility on a three-dimensional dna microarray surface\nand the effect of hybridization time on the accuracy of\nexpression ratios. BMC Biotechnology, 3, 6.\n\n[10] Gao, X. L., LeProust, E., Zhang, H., Srivannavit, O., Gulari,\nE., Yu, P. L., Nishiguchi, C., Xiang, Q., and Zhou, X. C.\n(2001) A flexible light-directed dna chip synthesis gated by\ndeprotection using solution photogenerated acids. Nucleic\nAcids Research, 29(22), 4744–4750.\n\n[25] SantaLucia, J. and Hicks, D. (2004) The thermodynamics\nof dna structural motifs. Annual Review of Biophysics and\nBiomolecular Structure, 33, 415–440.\n\n[11] Nuwaysir, E. F., Huang, W., Albert, T. J., Singh, J., Nuwaysir,\nK., Pitas, A., Richmond, T., Gorski, T., Berg, J. P., Ballin,\nJ., McCormick, M., Norton, J., Pollock, T., Sumwalt, T.,\nButcher, L., Porter, D., Molla, M., Hall, C., Blattner, F.,\nSussman, M. R., Wallace, R. L., Cerrina, F., and Green, R. D.\n(2002) Gene expression analysis using oligonucleotide arrays\nproduced by maskless photolithography. Genome Research,\n12(11), 1749–1755.\n\n[26] Deutsch, J. M., Liang, S., and Narayan, O. (2004) Modelling of\nmicroarray data with zippering. Preprint q-bio.BM/0406039\nv1,.\n[27] Binder, H. (2006) Thermodynamics of competitive surface\nadsorption on dna microarrays. Journal of Physics-Condensed\nMatter, 18(18), S491–S523.\n\n[12] Luebke, K. J., Balog, R. P., Mittelman, D., and Garner, H. R.\n(2002) Digital optical chemistry: A novel system for the rapid\nfabrication of custom oligonucleotide arrays. Microfabricated\nSensors, Application of Optical Technology for DNA Analysis,\nRichard Kordal, Author Usmani and Wai Tak Law, editors,\nAmerican Chemical Society Publications, 815, 87–106.\n\n[28] Gibbs, J. H. and Dimarzio, E. A. (1959) Statistical mechanics\nof helix-coil transitions in biological macromolecules. Journal\nof Chemical Physics, 30(1), 271–282.\n[29] Zimm, B. H. (1960) Theory of melting of the helical form in\ndouble chains of the dna type. Journal of Chemical Physics,\n33(5), 1349–1356.\n\n[13] Cerrina, F., Blattner, F., Huang, W., Hue, Y., Green,\nR., Singh-Gasson, S., and Sussman, M. (2002) Biological\nlithography: development of a maskless microarray synthesizer\nfor dna chips. Microelectronic Engineering, 61-2, 33–40.\n\n[30] Applequist, J. and Damle, V. (1965) Thermodynamics\nof helix-coil equilibrium in oligoadenylic acid from\nhypochromicity studies. Journal of the American Chemical\nSociety, 87(7), 1450–&.\n\n[14] Kim, C., Li, M., Venkataramaia, N., Richmond, K., Kaysen,\nJ., and Cerrina, F. (2003) Dna microarrays: an imaging study.\nJournal of Vacuum Science & Technology B, 21, 2946.\n\n[31] Kittel, C. (1969) Phase transition of a molecular zipper.\nAmerican Journal of Physics, 37(9), 917–&.\n\n[15] Baum, M., Bielau, S., Rittner, N., Schmid, K., Eggelbusch, K.,\nDahms, M., Schlauersbach, A., Tahedl, H., Beier, M., Guimil,\nR., Scheffler, M., Hermann, C., Funk, J. M., Wixmerten, A.,\nRebscher, H., Honig, M., Andreae, C., Buchner, D., Moschel,\nE., Glathe, A., Jager, E., Thom, M., Greil, A., Bestvater, F.,\nObermeier, F., Burgmaier, J., Thome, K., Weichert, S., Hein,\nS., Binnewies, T., Foitzik, V., Muller, M., Stahler, C. F., and\nStahler, P. F. (2003) Validation of a novel, fully integrated\nand flexible microarray benchtop facility for gene expression\nprofiling. Nucleic Acids Research, 31(23), e151.\n\n[32] Craig, M. E., Crothers, D. M., and Doty, P. (1971)\nRelaxation kinetics of dimer formation by self complementary\noligonucleotides. Journal of Molecular Biology, 62(2), 383–&.\n[33] Ambjornsson, T. and Metzler, R. (2005) Blinking statistics\nof a molecular beacon triggered by end-denaturation of dna.\nJournal of Physics-Condensed Matter, 17(49), S4305–S4316.\n[34] Zeng, Y. and Zocchi, G. (2006) Mismatches and bubbles in\ndna. Biophysical Journal, 90(12), 4522–4529.\n[35] Peterson, A. W., Wolf, L. K., and Georgiadis, R. M. (2002)\nHybridization of mismatched or partially matched dna at\nsurfaces. Journal of the American Chemical Society, 124(49),\n14601–14607.\n\n[16] Naiser, T., Mai, T., Michel, W., and Ott, A. (2006) Versatile\nmaskless microscope projection photolithography system and\nits application in light-directed fabrication of dna microarrays.\nReview of Scientific Instruments, 77(6), 063711.\n\n[36] Sugimoto, N., Nakano, M., and Nakano, S. (2000)\nThermodynamics-structure relationship of single mismatches\nin rna/dna duplexes. Biochemistry, 39(37), 11270–11281.\n\n[17] Le Berre, V., Trevisiol, E., Dagkessamanskaia, A., Sokol, S.,\nCaminade, A. M., Majoral, J. P., Meunier, B., and Francois,\nJ. (2003) Dendrimeric coating of glass slides for sensitive dna\nmicroarrays analysis. Nucleic Acids Research, 31(16), e88.\n\n[37] Znosko, B. M., Silvestri, S. B., Volkman, H., Boswell, B.,\nand Serra, M. J. (2002) Thermodynamic parameters for an\nexpanded nearest-neighbor model for the formation of rna\nduplexes with single nucleotide bulges. Biochemistry, 41(33),\n10406–10417.\n\n[18] Hasan, A., Stengele, K. P., Giegrich, H., Cornwell, P., Isham,\nK. R., Sachleben, R. A., Pfleiderer, W., and Foote, R. S. (1997)\nPhotolabile protecting groups for nucleosides: Synthesis and\nphotodeprotection rates. Tetrahedron, 53(12), 4247–4264.\n[19] Beier, M. and Hoheisel, J. D. (1999) Versatile derivatisation of\nsolid support media for covalent bondon on dna-microchips.\nNucleic Acids Research, 27, 1970–1977.\n[20] Ke, S. H. and Wartell, R. M. (1995) Influence of neighboring\nbase-pairs on the stability of single-base bulges and base-pairs\nin a dna fragment. Biochemistry, 34(14), 4593–4600.\n[21] Zhu, J. and Wartell, R. M. (1999) The effect of base\nsequence on the stability of rna and dna single base bulges.\nBiochemistry, 38(48), 15986–15993.\n\n12\n\n\f"}