{"id": "http://arxiv.org/abs/q-bio/0411029v1", "guidislink": true, "updated": "2004-11-12T23:50:27Z", "updated_parsed": [2004, 11, 12, 23, 50, 27, 4, 317, 0], "published": "2004-11-12T23:50:27Z", "published_parsed": [2004, 11, 12, 23, 50, 27, 4, 317, 0], "title": "Neurokinematic Modeling of Complex Swimming Patterns of the Larval\n  Zebrafish", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=q-bio%2F0504011%2Cq-bio%2F0504009%2Cq-bio%2F0504023%2Cq-bio%2F0504014%2Cq-bio%2F0504031%2Cq-bio%2F0504027%2Cq-bio%2F0504002%2Cq-bio%2F0504028%2Cq-bio%2F0504007%2Cq-bio%2F0504022%2Cq-bio%2F0504012%2Cq-bio%2F0504013%2Cq-bio%2F0503039%2Cq-bio%2F0503037%2Cq-bio%2F0503027%2Cq-bio%2F0503001%2Cq-bio%2F0503006%2Cq-bio%2F0503009%2Cq-bio%2F0503003%2Cq-bio%2F0503004%2Cq-bio%2F0503016%2Cq-bio%2F0503034%2Cq-bio%2F0503018%2Cq-bio%2F0503025%2Cq-bio%2F0503035%2Cq-bio%2F0503022%2Cq-bio%2F0503015%2Cq-bio%2F0503019%2Cq-bio%2F0503017%2Cq-bio%2F0503023%2Cq-bio%2F0503036%2Cq-bio%2F0503013%2Cq-bio%2F0503005%2Cq-bio%2F0503008%2Cq-bio%2F0503031%2Cq-bio%2F0503032%2Cq-bio%2F0503030%2Cq-bio%2F0503040%2Cq-bio%2F0503029%2Cq-bio%2F0503021%2Cq-bio%2F0503041%2Cq-bio%2F0503026%2Cq-bio%2F0503024%2Cq-bio%2F0503010%2Cq-bio%2F0503038%2Cq-bio%2F0503007%2Cq-bio%2F0503020%2Cq-bio%2F0503014%2Cq-bio%2F0503011%2Cq-bio%2F0503033%2Cq-bio%2F0503028%2Cq-bio%2F0503012%2Cq-bio%2F0503002%2Cq-bio%2F0411007%2Cq-bio%2F0411048%2Cq-bio%2F0411051%2Cq-bio%2F0411020%2Cq-bio%2F0411028%2Cq-bio%2F0411046%2Cq-bio%2F0411029%2Cq-bio%2F0411034%2Cq-bio%2F0411013%2Cq-bio%2F0411011%2Cq-bio%2F0411019%2Cq-bio%2F0411027%2Cq-bio%2F0411026%2Cq-bio%2F0411009%2Cq-bio%2F0411053%2Cq-bio%2F0411037%2Cq-bio%2F0411017%2Cq-bio%2F0411015%2Cq-bio%2F0411042%2Cq-bio%2F0411025%2Cq-bio%2F0411041%2Cq-bio%2F0411018%2Cq-bio%2F0411005%2Cq-bio%2F0411014%2Cq-bio%2F0411010%2Cq-bio%2F0411040%2Cq-bio%2F0411044%2Cq-bio%2F0411016%2Cq-bio%2F0411052%2Cq-bio%2F0411021%2Cq-bio%2F0411035%2Cq-bio%2F0411032%2Cq-bio%2F0411033%2Cq-bio%2F0411012%2Cq-bio%2F0411039%2Cq-bio%2F0411008%2Cq-bio%2F0411002%2Cq-bio%2F0411004%2Cq-bio%2F0411050%2Cq-bio%2F0411006%2Cq-bio%2F0411024%2Cq-bio%2F0411003%2Cq-bio%2F0411047%2Cq-bio%2F0411031%2Cq-bio%2F0411049%2Cq-bio%2F0411043%2Cq-bio%2F0411045%2Cq-bio%2F0411038&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Neurokinematic Modeling of Complex Swimming Patterns of the Larval\n  Zebrafish"}, "summary": "Larval zebrafish exhibit a variety of complex undulatory swimming patterns.\nThis repertoire is controlled by the 300 neurons projecting from brain into\nspinal cord. Understanding how descending control signals shape the output of\nspinal circuits, however, is nontrivial. We have therefore developed a\nsegmental oscillator model (using NEURON) to investigate this system. We found\nthat adjusting the strength of NMDA and glycinergic synapses enabled the\ngeneration of oscillation (tail-beat) frequencies over the range exhibited in\ndifferent larval swim patterns. In addition, we developed a kinematic model to\nvisualize the more complex axial bending patterns used during prey capture.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=q-bio%2F0504011%2Cq-bio%2F0504009%2Cq-bio%2F0504023%2Cq-bio%2F0504014%2Cq-bio%2F0504031%2Cq-bio%2F0504027%2Cq-bio%2F0504002%2Cq-bio%2F0504028%2Cq-bio%2F0504007%2Cq-bio%2F0504022%2Cq-bio%2F0504012%2Cq-bio%2F0504013%2Cq-bio%2F0503039%2Cq-bio%2F0503037%2Cq-bio%2F0503027%2Cq-bio%2F0503001%2Cq-bio%2F0503006%2Cq-bio%2F0503009%2Cq-bio%2F0503003%2Cq-bio%2F0503004%2Cq-bio%2F0503016%2Cq-bio%2F0503034%2Cq-bio%2F0503018%2Cq-bio%2F0503025%2Cq-bio%2F0503035%2Cq-bio%2F0503022%2Cq-bio%2F0503015%2Cq-bio%2F0503019%2Cq-bio%2F0503017%2Cq-bio%2F0503023%2Cq-bio%2F0503036%2Cq-bio%2F0503013%2Cq-bio%2F0503005%2Cq-bio%2F0503008%2Cq-bio%2F0503031%2Cq-bio%2F0503032%2Cq-bio%2F0503030%2Cq-bio%2F0503040%2Cq-bio%2F0503029%2Cq-bio%2F0503021%2Cq-bio%2F0503041%2Cq-bio%2F0503026%2Cq-bio%2F0503024%2Cq-bio%2F0503010%2Cq-bio%2F0503038%2Cq-bio%2F0503007%2Cq-bio%2F0503020%2Cq-bio%2F0503014%2Cq-bio%2F0503011%2Cq-bio%2F0503033%2Cq-bio%2F0503028%2Cq-bio%2F0503012%2Cq-bio%2F0503002%2Cq-bio%2F0411007%2Cq-bio%2F0411048%2Cq-bio%2F0411051%2Cq-bio%2F0411020%2Cq-bio%2F0411028%2Cq-bio%2F0411046%2Cq-bio%2F0411029%2Cq-bio%2F0411034%2Cq-bio%2F0411013%2Cq-bio%2F0411011%2Cq-bio%2F0411019%2Cq-bio%2F0411027%2Cq-bio%2F0411026%2Cq-bio%2F0411009%2Cq-bio%2F0411053%2Cq-bio%2F0411037%2Cq-bio%2F0411017%2Cq-bio%2F0411015%2Cq-bio%2F0411042%2Cq-bio%2F0411025%2Cq-bio%2F0411041%2Cq-bio%2F0411018%2Cq-bio%2F0411005%2Cq-bio%2F0411014%2Cq-bio%2F0411010%2Cq-bio%2F0411040%2Cq-bio%2F0411044%2Cq-bio%2F0411016%2Cq-bio%2F0411052%2Cq-bio%2F0411021%2Cq-bio%2F0411035%2Cq-bio%2F0411032%2Cq-bio%2F0411033%2Cq-bio%2F0411012%2Cq-bio%2F0411039%2Cq-bio%2F0411008%2Cq-bio%2F0411002%2Cq-bio%2F0411004%2Cq-bio%2F0411050%2Cq-bio%2F0411006%2Cq-bio%2F0411024%2Cq-bio%2F0411003%2Cq-bio%2F0411047%2Cq-bio%2F0411031%2Cq-bio%2F0411049%2Cq-bio%2F0411043%2Cq-bio%2F0411045%2Cq-bio%2F0411038&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Larval zebrafish exhibit a variety of complex undulatory swimming patterns.\nThis repertoire is controlled by the 300 neurons projecting from brain into\nspinal cord. Understanding how descending control signals shape the output of\nspinal circuits, however, is nontrivial. We have therefore developed a\nsegmental oscillator model (using NEURON) to investigate this system. We found\nthat adjusting the strength of NMDA and glycinergic synapses enabled the\ngeneration of oscillation (tail-beat) frequencies over the range exhibited in\ndifferent larval swim patterns. In addition, we developed a kinematic model to\nvisualize the more complex axial bending patterns used during prey capture."}, "authors": ["Scott A. Hill", "Xiao-Ping Liu", "Melissa A. Borla", "Jorge V. Jose", "Donald M. O'Malley"], "author_detail": {"name": "Donald M. O'Malley"}, "author": "Donald M. O'Malley", "arxiv_comment": "7 pages with five embedded figures. Presented at \"Computational\n  Neuroscience 2004\" conference in Baltimore, Maryland. To be published in\n  conference proceedings in Neurocomputing", "links": [{"href": "http://arxiv.org/abs/q-bio/0411029v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/q-bio/0411029v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "q-bio.NC", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "q-bio.NC", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/q-bio/0411029v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/q-bio/0411029v1", "journal_reference": null, "doi": null, "fulltext": "arXiv:q-bio/0411029v1 [q-bio.NC] 12 Nov 2004\n\nNeurokinematic Modeling of Complex Swimming Patterns of the\nLarval Zebrafish\nScott A. Hill a,b , Xiao-Ping Liu c , Melissa A. Borla c , Jorge V. José a,b,∗ , and\nDonald M. O'Malley a,c\na Center\n\nfor Interdisciplinary Research in Complex Systems, Northeastern University, Boston MA USA\nb Department of Physics, Northeastern University, Boston MA USA\nc Department of Biology, Northeastern University, Boston MA USA\n\nAbstract\nLarval zebrafish exhibit a variety of complex undulatory swimming patterns. This repertoire is controlled by\nthe 300 neurons projecting from brain into spinal cord. Understanding how descending control signals shape\nthe output of spinal circuits, however, is nontrivial. We have therefore developed a segmental oscillator model\n(using NEURON) to investigate this system. We found that adjusting the strength of NMDA and glycinergic\nsynapses enabled the generation of oscillation (tail-beat) frequencies over the range exhibited in different larval\nswim patterns. In addition, we developed a kinematic model to visualize the more complex axial bending patterns\nused during prey capture.\nKey words: zebrafish, swimming, locomotion, CPG, spinal cord\n\n1. Introduction\nThe spinal cords of vertebrate animals contain segmental oscillators, or central pattern generators\n(CPGs), that can produce rhythmic movements. The operations of these spinal CPGs are best understood in lower vertebrates, such as lamprey and Xenopus, where they are used for undulatory swimming\n(Roberts, 1998; Buchanan, 1999; Grillner, 2003). Control signals descending from brainstem to spinal cord\nhave also been studied extensively in these and other lower vertebrates, such as goldfish and zebrafish.\nTheir lack of a corticospinal tract avoids a degree of complexity that is present in mammals. The functioning of descending control systems in higher vertebrates has been difficult to understand. Studies of\nlower vertebrates should reveal conserved principles by which these systems operate. The larval zebrafish\ntakes vertebrate simplicity to an extreme: the decreased numbers of neurons allows exact identification of\n∗ Corresponding author: jjv@neu.edu.\nPreprint submitted to Neurocomputing\n\n30 October 2018\n\n\fmany cell types in both brainstem and spinal cord (Kimmel et al., 1982, 1985; Liu and Westerfield, 1988;\nBernhardt et al., 1990); this in turn provides major experimental and modeling advantages.\nOne important aspect of lower vertebrate locomotion is the regulation of swimming speed, which is often\ncorrelated with the frequency of alternating left and right contractions of the axial muscles of the trunk or\ntail, termed tail-beat frequency (TBF). In a steady-swimming fish TBF is generally equal to the oscillation\nfrequency of the spinal CPGs, so by understanding the modulation of CPG frequency in spinal cord we\ncan understand a major element of the control of swim speed. In goldfish, lamprey, and other fishes,\nswim frequency can be modulated by stimulation of the midbrain locomotor region or bath application\nof NMDA; It is also known that serotonin, acetylcholine, dopamine, and other neurotransmitters also\ninfluence the CPG's oscillation frequency. However, the identities and locations (in brainstem or spinal\ncord) of the cells involved in swim frequency control are unknown. Larval zebrafish may provide insights\ninto this problem because they exhibit distinct swim patterns that span a broad range of tail beat\nfrequencies, ranging from 25 to 75 Hz (Budick and O'Malley, 2000). A critical unknown is whether or\nnot the distinct larval swim patterns (slow, burst, and capture) are controlled by distinct control systems\nand/or specific neurotransmitters(Borla et al., 2002; O'Malley et al., 2003). Modeling the different types\nof swimming behavior using a combined neural and kinematic model can shed light onto the presence\nand relevance of different motor control elements.\nThe functioning of spinal networks that underlie locomotion in fishes and tadpoles has been extensively\nmodeled (see e.g. Roberts and Tunstall, 1990; Dale, 1995, 2003; Grillner, 2003). We created a zebrafish\nneural model, based on previous Xenopus spinal network models, of the CPGs in the larval zebrafish spinal\ncord, incorporating known properties of the oscillators underlying swimming (Tunstall et al., 2002). The\nspinal interneuron types in zebrafish (Hale et al., 2001) are likely homologous to those in both Xenopus\nand lamprey (Fetcho, 1992). We explored the control of tail-beat frequency, and found that by altering\nthe strengths of AMPA, NMDA and glycinergic-like synapses (all known to be present in lower vertebrate\nspinal cords), we were able to generate TBFs that spanned the range of speeds observed during burst\nand slow swimming behaviors. We also created a simple mechanical or \"kinematic\" model (that can be\ndriven by the neural model) to visualize how the spinal neural activity might be transformed into larval\nbehaviors. Our ultimate goal in creating this neurokinematic model is to introduce a tool for testing\ntheories of descending motor control in the larval zebrafish.\n\n2. Methods\nFigure 1 shows the structure of our neural model, which is a simplification of the larval spinal circuitry (Hale et al., 2001) incorporating the minimal elements required to generate rhythmic, propagating\nalternating activity. Each segmental oscillator consists of two neurons, with NMDA and AMPA-like autosynapses, which are connected by glycinergic synapses. An oscillator can be triggered with a single\nexcitatory pulse to one cell, followed by a single pulse to the other cell several milliseconds later (7 ms\nin our simulations). Individual oscillators are connected into a 25-segment chain (corresponding to the\napproximately 25 segments in the zebrafish spinal cord), with nearest-neighbor descending excitatory\nsynaptic connections; the entire chain can be started merely by triggering the head segment.\nWe use cells with the standard Hodgkin-Huxley channels provided by the NEURON software package:\npersistent potassium (ḡK = 0.036 S/cm2, EK = −77 mV), transient sodium (ḡNa = 0.12 S/cm2 , ENa =\n50 mV), and leak (gL = 0.0003 S/cm2, EL = −54.3 mV) channels. Our synapses are modeled using the\ndifference of two exponentials, with rise time τ1 (= 1 ms) and fall time τ2 . See Dayan and Abbott (2001,\np. 182) for details. The three types of synapses we used were AMPA (τ2 = 6 ms, E = 0 mV), NMDA\n(τ2 = 80 ms, E = 60 mV), and glycine (τ2 = 2 ms, E = −80 mV).\n2\n\n\fFig. 1. Schematic diagram of the neural oscillator model. The squares represent neurons, and each line indicates one of three\ntypes of synaptic connection: glycinergic (fast inhibitory), AMPA-like (fast excitatory), or NMDA-like (slow excitatory).\nOnly the first two segments of a 25-segment chain are shown.\n\nOur kinematic model is meant to translate the neural signals from the spinal circuitry into observable\nkinematic behaviors. To do so, we use a relatively simple transformation of putative neural output into\neffects on the radius of curvature of a line segment representing the trunk of the larva. This model does\nnot take into account the full physics (e.g., elasticity and hydrodynamics) of the situation; nevertheless,\nit does approximate the observed axial kinematics recorded experimentally with a high-speed camera.\nSuppose that each segment x is receiving a neural signal Fs (x, t) at time t from the spinal circuitry:\nFs > 0 for a signal to the right side of the segment, Fs < 0 for a signal to the left. We suppose that this\nsignal is integrated through exponential synapses, so that the signal passing to the muscles is\nFm (x, t) =\n\nZt\n\n′\n\n′\n\nFs (x, t′ )[e(t −t)/τ2 − e(t −t)/τ1 ]dt′ ,\n\n(1)\n\n−∞\n\nwhere τ1 and τ2 are the growth and decay time constants of the synapse (we use τ1 = 6 ms and τ2 = 8 ms\nin our calculations.) Assuming that the muscle contracts linearly as a function of Fm , it follows that the\nradius of curvature of segment x is\nR(x, t) = W (x)/Fm (x, t)\n\n(2)\n\nW (x) is a function describing the stiffness, or resistance to bending, of segment x. It takes into account\nthe width of the body (the tail is more flexible, and bends more than the rostral trunk).\nWe can feed the output of our neural model directly into this system, but it is also useful to introduce\na (more) artificial signal. We build this signal out of three components: an oscillatory signal Fosc (x, t),\nwhich is a series of delta functions propagating caudally; a bending signal Fbend , which is a tonic signal\napplied to one side of all segments at once; and a rostral stiffening signal, which reduces the signal to\nthe first xinh rostral segments by a factor finh . The first two pieces are responsible for swimming and\nturning, respectively. The stiffening signal is seen in larvae during prey capture, where the fish keeps its\nhead relatively still while adjusting its orientation with its tail. We can write our artificial neural signal\nas\n\u001a\nfinh , x ≤ xinh\n,\n(3)\nFs (x, t) = (Fosc (x, t) + fbend ) ×\n1,\nx > xinh\nwhere fbend is a constant and\n3\n\n\fFig. 2. Instantaneous TBF in a single segmental oscillator, for several values of gNMDA . Each point represents the iTBF for\nthe left neuron; the corresponding points from the right side gives near-identical results. Oscillators approach a steady-state\nfrequency only after an initial \"wind-up\" period.\n\n\nx ≡ 2πνt (mod λ)\n 1,\nFosc (x, t) = fosc −1, x ≡ 2πνt + λ/2 (mod λ)\n\n0,\notherwise\n\n(4)\n\nThe parameter ν is the tail-beat frequency, and λ is the length (in number of segments) of the resulting\nwave which propagates down the fish.\n\n3. Results and Discussion\nWe began by studying a single segment of the neural model shown in Fig. 1. A transient trigger\npulse to this model initiates sustained alternating activity, mimicking Xenopus spinal cord, where a\ntransient stimulus produces a sustained bout of swimming (Roberts and Tunstall, 1990). The first larvalzebrafish specific task was to generate the range of tail-beat frequencies (TBFs) used in different swimming\nbehaviors. The frequency of oscillation was calculated on a half-cycle basis (termed \"instantaneous\"\nTBF in Borla et al., 2002). Figure 2 shows how instantaneous TBF varies with time, with each trace\nrepresenting the frequency profile for a specific value of the NMDA synaptic conductance. In all cases,\nthere is an initial transient period, 15 to 20 cycles long, where the TBF increases by about a third before\nsettling into an indefinite steady state with constant frequency. We subsequently re-inspected behavioral\nsequences, and found varying degrees of wind-up in some, but not all, experimentally recorded swim bouts\n(Borla et al., 2002). It is unknown whether the biological and simulational wind-up behaviors are related,\nbut the phenomenon lasts much longer in the model than in the lab.\nTo evaluate the range of oscillator or tail-beat frequencies that might be generated with this simple\nmodel, we tested different combinations of synaptic strengths (conductances). Varying the strengths of\nthe NMDA and glycinergic synapses was found to alter the steady-state oscillator frequency (Fig. 3):\nincreasing the NMDA conductance increased TBF, whereas increasing the glycinergic conductance decreased it. The AMPA conductance can also affect TBF, but to a lesser extent. Different combinations\nof conductances could give rise to the entire range of TBFs observed in different larval swim patterns,\nfrom the slow swim (25 to 40 Hz) to burst swim (45 to 75 Hz; Budick and O'Malley, 2000). This is just\n4\n\n\fFig. 3. A density plot showing the steady-state frequency of a single oscillator as we modify the synaptic conductances\ngNMDA and gINH , fixing gAMPA = 10−4 . All conductances are in μS, and all frequencies are in Hz. The missing regions in\nthe upper-right and lower-left corners represent non-oscillatory states.\n\nFig. 4. Rastergram for a chain of 25 segmental oscillators. Each horizontal line corresponds to a single oscillator; ticks drawn\nbelow each line are for action potentials on the left, and above for those on the right. Parameters: gAMPA = 10−4 μS,\ngNMDA = 6 × 10−4 μS, gINH = 10−2 μS, gdescending = 10−2 μS.\n\none potential means of varying oscillator frequency (or TBF), implemented in a reduced system (i.e. a\ntwo-cell model), but it illustrates how a minimal model of larval zebrafish spinal cord, with just a few\nessential conductances, can give rise to a range of outputs relevant to the larval behaviors. In this model,\neach crossed inhibitory signal results in one post-inhibitory rebound firing of a single action potential, but\nto more completely capture slow and burst swims we will need to incorporate mechanisms that regulate\nthe strength of output of the motoneuron pools.\nWe next extended the model to a 25-segment chain of oscillators, creating a kind of artificial spinal\ncord that should facilitate quantitative analyses of the influences of descending signals on spinal network\nactivity. The firing pattern of the model spinal cord is illustrated in Fig. 4. The firing of segment number 1 shows an alternating left-right pattern over the duration of the simulation. In successively more\ncaudal segments, the firing is delayed, matching the general pattern of undulatory swimming. As in the\nsingle segment model, each segment along the chain showed a frequency wind-up period. In this model a\nfixed intersegmental time-delay (nominally a synaptic delay) was used to establish the phase relationship\nbetween segments, but a more realistic model might include ascending and descending connections of\nvarying strengths and lengths, as in lamprey (Kotaleski et al. 1999, and see Dale 2003).\nThe kinematic model of the larval trunk is a complementary tool for exploring theories of descending\nmotor control. Preliminary work (Hill et al., 2003) assumed that the fish was equally flexible from trunk\n5\n\n\fFig. 5. Comparison of a 7-day old larval zebrafish with our kinematic model during a slow swim (left) and a J-turn (right).\n\nto tail (W (x) = 1 in Eq. 2), with partial success. By accounting for the increased flexibility of the tail\n(e.g. by making W (x) linear), however, we can better simulate the trunk kinematics observed during\nslow swims and J-turns (Fig. 5). J-turns are unique locomotive maneuvers that contribute to the larval\nprey-capture behavior (Borla and O'Malley, 2002). They require repetitive, asymmetric and far-caudal\ncontractions of axial musculature. This might in principle be achieved by sending an asymmetric excitatory\nbrainstem signal exclusively to far-caudal spinal cord; however, a survey of the spinal outputs of zebrafish\nreticulospinal neurons revealed no neurons with the requisite arborization pattern (Gahtan and O'Malley,\n2003). Alternatively, neurons that selectively arborize in rostral spinal cord (which were observed) might\nbe activated bilaterally to stiffen the rostral musculature. In conjunction with such signals, other neurons\nthat arborize along the entire length of spinal cord could then generate far-caudal contraction. In our\nmodel, this is implemented as a bilateral \"inhibitory\" rostral signal, but this is kinematically equivalent\nto stiffening the rostral end of the larva by bilateral excitation of rostral motoneurons.\nFuture Directions\nAs we extend the neural model's capabilities to produce dynamically varying bend amplitudes, we\nhope to produce an increasingly realistic \"artificial spinal cord\" that can be used to test ideas of how the\nlarval locomotive repertoire is generated. The kinematic model is useful here because it provides a first\napproximation of how complex neural model outputs might affect axial kinematics. Further extensions\nof this model should incorporate known constraints of the larval CNS, such as the diversity of brainstem\nand spinal systems involved in swimming and turning behaviors (O'Malley et al., 1996; Hale et al., 2001;\nRitter et al., 2001), and the wide distribution of activity during escape behaviors (Bosch et al., 2001;\nGahtan et al., 2002). By incorporating such constraints, the combined neurokinematic model should\nbecome increasingly useful in generating experimentally-testable hypotheses of descending and spinal\ncontrol of vertebrate locomotion.\n\n4. Acknowledgements\nSupport for this work was provided by NIH-NS37789 (DMO) and by the Center for Interdisciplinary\nResearch in Complex Systems (CIRCS) at Northeastern University (SAH, JVJ).\n\n5. References\nR.R. Bernhardt, A.B. Chitnis, L. Lindamer, J.Y. Kuwada, Identification of spinal neurons in the embryonic and larval zebrafish, J. Comp. Neurol. 302 (1990) 603-616.\nM.A. Borla and D.M. O'Malley, High-speed imaging of tracking swims used in the larval zebrafish prey\ncapture behavior, Soc. Neurosci. Abs. 28 (2002) 361.18.\n6\n\n\fM.A. Borla, B. Palecek, S.A. Budick, and D.M. O'Malley, Prey capture by larval zebrafish: evidence for\nfine axial motor control, Brain Behav. Evol.. 60 (2002) 207-229.\nT.J. Bosch, S. Maslam, B.L. Roberts, Fos-like immunohistochemical identification of neurons active during\nthe startle response of the rainbow trout, J. Comp. Neurol. 439 (2001) 306-314.\nJ.T. Buchanan, Contributions of identifiable neurons and neuron classes to lamprey vertebrate neurobiology, Prog. Neurobiol. 63 (1999) 441-466.\nS.A. Budick and D.M. O'Malley, Locomotive repertoire of the larval zebrafish: swimming, turning, and\nprey capture, J. Exp. Biol. 203 (2000) 2565-2579.\nP. Dayan and L.F. Abbott, Theoretical Neuroscience, MIT Press, Cambridge MA, 2001.\nN. Dale, Experimentally derived model for the locomotor pattern generator in the Xenopus embryo,\nJ. Physiol. 489.2 (1995) 489-510.\nN. Dale, Coordinated motor activity in simulated spinal networks emerges from simple biologically plausible rules of connectivity, J. Comput. Neurosci. 14 (2003) 55-70.\nJ.R. Fetcho, The spinal motor system in early vertebrates and some of its evolutionary changes. Brain Behav. Evol. 40 (1992) 82-97.\nE. Gahtan and D.M. O'Malley, Visually-guided injection of identified reticulospinal neurons in zebrafish,\nJ. Comp. Neurol. 459 (2003) 186-200.\nE. Gahtan, N. Sankrithi, J.B. Campos, and D.M. O'Malley, Evidence for a widespread brainstem escape\nnetwork in larval zebrafish, J. Neurophysiol. 87 (2002) 608-614.\nS. Grillner, The motor infrastructure: from ion channels to neuronal networks, Nature Rev. Neurosci. 4\n(2003) 573-586.\nM.E. Hale, D.A. Ritter, and J.R. Fetcho, A confocal study of spinal interneurons in living larval zebrafish,\nJ. Comp. Neurol. 437 (2001) 1-16.\nS.A. Hill, M.A. Borla, J.V. José, and D.M. O'Malley, Modeling the neural control of zebrafish locomotive\nbehaviors, Soc. Neurosci. Abs. 29 (2003) 278.10.\nC.B. Kimmel, S.L. Powell, and W.K. Metcalfe, Brain neurons which project to the spinal cord in young\nlarvae of the zebrafish, J. Comp. Neurol. 205 (1982) 112-127,\nC.B. Kimmel, W.K. Metcalfe, and E. Schabtach, T-reticular interneurons: a class of serially repeating\ncells in the zebrafish hindbrain, J. Comp. Neurol. 233 (1985) 365-376.\nJ.H. Kotaleski, S. Grillner, and A. Lansner, Neural mechanisms potentially contributing to the intersegmental phase lag in lamprey: I. Segmental oscillations dependent on reciprocal inhibition, Biol. Cybern.\n81 (1999) 317-330.\nD.W. Liu and M. Westerfield, Function of identified motoneurons and coordination of primary and secondary motor systems during zebrafish swimming, J. Physiol. (Lond.) 403 (1988) 73-89.\nD.M. O'Malley, Y.-H. Kao, and J.R. Fetcho, Imaging the functional organization of zebrafish hindbrain\nsegments, Neuron 17 (1996) 1145-1155.\nD.M. O'Malley, Q. Zhou, and E. Gahtan. Probing Neural Circuits in the Zebrafish: A Suite of Optical\nTechniques. Methods 30 (2003) 49-63.\nD.A. Ritter, D.H. Bhatt, and J.R. Fetcho, In vivo imaging of zebrafish reveals difference in the spinal\nnetworks for escape and swimming movements, J. Neurosci. 21 (2001) 8956-8965.\nA. Roberts, S.R. Soffe, E.S. Wolf, M. Yoshida, and F.-Y. Zhao, Central circuits controlling locomotion in\nyoung frog tadpoles, Annals NY Acad. Sci. 860 (1998) 19-34.\nA. Roberts and M.J. Tunstall, Mutual re-excitation with post-inhibitory rebound: a simulation study on\nthe mechanisms for locomotor rhythm generation in the spinal cord of Xenopus embryos, Euro. J. Neurosci. 2 (1990) 11-23.\nM.J. Tunstall, A. Roberts, S.R. Soffe, Modelling inter-segmental coordination of neuronal oscillators:\nsynaptic mechanisms for uni-directional coupling during swimming in Xenopus tadpoles, J. Comput. Neurosci. 13 (2002) 143-158.\n7\n\n\f"}