{"id": "http://arxiv.org/abs/q-bio/0602020v1", "guidislink": true, "updated": "2006-02-16T13:15:14Z", "updated_parsed": [2006, 2, 16, 13, 15, 14, 3, 47, 0], "published": "2006-02-16T13:15:14Z", "published_parsed": [2006, 2, 16, 13, 15, 14, 3, 47, 0], "title": "Demographic Homeostasis and the Evolution of Senescence", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=q-bio%2F0602027%2Cq-bio%2F0602004%2Cq-bio%2F0602008%2Cq-bio%2F0602018%2Cq-bio%2F0602019%2Cq-bio%2F0602009%2Cq-bio%2F0602007%2Cq-bio%2F0602005%2Cq-bio%2F0602025%2Cq-bio%2F0602022%2Cq-bio%2F0602017%2Cq-bio%2F0602015%2Cq-bio%2F0602003%2Cq-bio%2F0602024%2Cq-bio%2F0602013%2Cq-bio%2F0602014%2Cq-bio%2F0602010%2Cq-bio%2F0602021%2Cq-bio%2F0602026%2Cq-bio%2F0602012%2Cq-bio%2F0602002%2Cq-bio%2F0602023%2Cq-bio%2F0602001%2Cq-bio%2F0602020%2Cq-bio%2F0602016%2Cq-bio%2F0602006%2Cq-bio%2F0611038%2Cq-bio%2F0611010%2Cq-bio%2F0611021%2Cq-bio%2F0611043%2Cq-bio%2F0611086%2Cq-bio%2F0611014%2Cq-bio%2F0611035%2Cq-bio%2F0611076%2Cq-bio%2F0611093%2Cq-bio%2F0611068%2Cq-bio%2F0611095%2Cq-bio%2F0611074%2Cq-bio%2F0611019%2Cq-bio%2F0611075%2Cq-bio%2F0611054%2Cq-bio%2F0611015%2Cq-bio%2F0611009%2Cq-bio%2F0611042%2Cq-bio%2F0611031%2Cq-bio%2F0611029%2Cq-bio%2F0611078%2Cq-bio%2F0611004%2Cq-bio%2F0611051%2Cq-bio%2F0611046%2Cq-bio%2F0611047%2Cq-bio%2F0611041%2Cq-bio%2F0611055%2Cq-bio%2F0611066%2Cq-bio%2F0611058%2Cq-bio%2F0611071%2Cq-bio%2F0611090%2Cq-bio%2F0611008%2Cq-bio%2F0611084%2Cq-bio%2F0611025%2Cq-bio%2F0611011%2Cq-bio%2F0611064%2Cq-bio%2F0611050%2Cq-bio%2F0611070%2Cq-bio%2F0611026%2Cq-bio%2F0611049%2Cq-bio%2F0611020%2Cq-bio%2F0611028%2Cq-bio%2F0611030%2Cq-bio%2F0611056%2Cq-bio%2F0611006%2Cq-bio%2F0611077%2Cq-bio%2F0611069%2Cq-bio%2F0611067%2Cq-bio%2F0611045%2Cq-bio%2F0611062%2Cq-bio%2F0611032%2Cq-bio%2F0611024%2Cq-bio%2F0611023%2Cq-bio%2F0611065%2Cq-bio%2F0611083%2Cq-bio%2F0611081%2Cq-bio%2F0611060%2Cq-bio%2F0611079%2Cq-bio%2F0611073%2Cq-bio%2F0611053%2Cq-bio%2F0611059%2Cq-bio%2F0611088%2Cq-bio%2F0611007%2Cq-bio%2F0611091%2Cq-bio%2F0611037%2Cq-bio%2F0611094%2Cq-bio%2F0611044%2Cq-bio%2F0611017%2Cq-bio%2F0611063%2Cq-bio%2F0611034%2Cq-bio%2F0611072%2Cq-bio%2F0611036%2Cq-bio%2F0611018%2Cq-bio%2F0611061%2Cq-bio%2F0611092&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Demographic Homeostasis and the Evolution of Senescence"}, "summary": "Existing theories for the evolution of aging and death treat senescence as a\nside-effect of strong selection for fertility. These theories are\nwell-developed mathematically, but fit poorly with emerging experimental data.\nThe data suggest that aging is an adaptation, selected for its own sake. But\naging contributes only negatively to fitness of the individual. What kind of\nselection model would permit aging to emerge as a population-level adaptation?\nI explore the thesis that population dynamics is inherently chaotic, and that\naging is selected for its role in smoothing demographic fluctuations. The\nlogistic equation provides a natural vehicle for this model because it has\nplayed a central role in two sciences: Population growth in a resource-limited\nniche has long been modeled by the differential LE; and, as a difference\nequation, the LE is a canonical example of the emergence of chaos. Suppose that\nfeedback about depleted resources generally arrives too late to avoid a wave of\nunsupportable population growth; then logistic population dynamics is subject\nto chaotic fluctuations. It is my thesis that aging is an evolutionary\nadaptation selected for its stabilizing effect on chaotic population dynamics.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=q-bio%2F0602027%2Cq-bio%2F0602004%2Cq-bio%2F0602008%2Cq-bio%2F0602018%2Cq-bio%2F0602019%2Cq-bio%2F0602009%2Cq-bio%2F0602007%2Cq-bio%2F0602005%2Cq-bio%2F0602025%2Cq-bio%2F0602022%2Cq-bio%2F0602017%2Cq-bio%2F0602015%2Cq-bio%2F0602003%2Cq-bio%2F0602024%2Cq-bio%2F0602013%2Cq-bio%2F0602014%2Cq-bio%2F0602010%2Cq-bio%2F0602021%2Cq-bio%2F0602026%2Cq-bio%2F0602012%2Cq-bio%2F0602002%2Cq-bio%2F0602023%2Cq-bio%2F0602001%2Cq-bio%2F0602020%2Cq-bio%2F0602016%2Cq-bio%2F0602006%2Cq-bio%2F0611038%2Cq-bio%2F0611010%2Cq-bio%2F0611021%2Cq-bio%2F0611043%2Cq-bio%2F0611086%2Cq-bio%2F0611014%2Cq-bio%2F0611035%2Cq-bio%2F0611076%2Cq-bio%2F0611093%2Cq-bio%2F0611068%2Cq-bio%2F0611095%2Cq-bio%2F0611074%2Cq-bio%2F0611019%2Cq-bio%2F0611075%2Cq-bio%2F0611054%2Cq-bio%2F0611015%2Cq-bio%2F0611009%2Cq-bio%2F0611042%2Cq-bio%2F0611031%2Cq-bio%2F0611029%2Cq-bio%2F0611078%2Cq-bio%2F0611004%2Cq-bio%2F0611051%2Cq-bio%2F0611046%2Cq-bio%2F0611047%2Cq-bio%2F0611041%2Cq-bio%2F0611055%2Cq-bio%2F0611066%2Cq-bio%2F0611058%2Cq-bio%2F0611071%2Cq-bio%2F0611090%2Cq-bio%2F0611008%2Cq-bio%2F0611084%2Cq-bio%2F0611025%2Cq-bio%2F0611011%2Cq-bio%2F0611064%2Cq-bio%2F0611050%2Cq-bio%2F0611070%2Cq-bio%2F0611026%2Cq-bio%2F0611049%2Cq-bio%2F0611020%2Cq-bio%2F0611028%2Cq-bio%2F0611030%2Cq-bio%2F0611056%2Cq-bio%2F0611006%2Cq-bio%2F0611077%2Cq-bio%2F0611069%2Cq-bio%2F0611067%2Cq-bio%2F0611045%2Cq-bio%2F0611062%2Cq-bio%2F0611032%2Cq-bio%2F0611024%2Cq-bio%2F0611023%2Cq-bio%2F0611065%2Cq-bio%2F0611083%2Cq-bio%2F0611081%2Cq-bio%2F0611060%2Cq-bio%2F0611079%2Cq-bio%2F0611073%2Cq-bio%2F0611053%2Cq-bio%2F0611059%2Cq-bio%2F0611088%2Cq-bio%2F0611007%2Cq-bio%2F0611091%2Cq-bio%2F0611037%2Cq-bio%2F0611094%2Cq-bio%2F0611044%2Cq-bio%2F0611017%2Cq-bio%2F0611063%2Cq-bio%2F0611034%2Cq-bio%2F0611072%2Cq-bio%2F0611036%2Cq-bio%2F0611018%2Cq-bio%2F0611061%2Cq-bio%2F0611092&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Existing theories for the evolution of aging and death treat senescence as a\nside-effect of strong selection for fertility. These theories are\nwell-developed mathematically, but fit poorly with emerging experimental data.\nThe data suggest that aging is an adaptation, selected for its own sake. But\naging contributes only negatively to fitness of the individual. What kind of\nselection model would permit aging to emerge as a population-level adaptation?\nI explore the thesis that population dynamics is inherently chaotic, and that\naging is selected for its role in smoothing demographic fluctuations. The\nlogistic equation provides a natural vehicle for this model because it has\nplayed a central role in two sciences: Population growth in a resource-limited\nniche has long been modeled by the differential LE; and, as a difference\nequation, the LE is a canonical example of the emergence of chaos. Suppose that\nfeedback about depleted resources generally arrives too late to avoid a wave of\nunsupportable population growth; then logistic population dynamics is subject\nto chaotic fluctuations. It is my thesis that aging is an evolutionary\nadaptation selected for its stabilizing effect on chaotic population dynamics."}, "authors": ["Josh Mitteldorf"], "author_detail": {"name": "Josh Mitteldorf"}, "author": "Josh Mitteldorf", "arxiv_comment": "9 pages, 7 figures An updated version using a variant of this model\n  published in Evol Ecol Res 8:1-14 (2006)", "links": [{"href": "http://arxiv.org/abs/q-bio/0602020v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/q-bio/0602020v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "q-bio.PE", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "q-bio.PE", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/q-bio/0602020v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/q-bio/0602020v1", "journal_reference": null, "doi": null, "fulltext": "Demographic Homeostasis and the Evolution of Senescence\nAbstract. Existing theories for the evolution of aging and death treat\nsenescence as a side-effect of strong selection for fertility. These\ntheories are well-developed mathematically, but fit poorly with\nemerging experimental data. The data suggest that aging is an\nadaptation, selected for its own sake. But aging contributes only\nnegatively to fitness of the individual. What kind of population model\nwould permit aging to emerge as a population-level adaptation? I\nexplore the thesis that population dynamics is inherently chaotic, and\nthat aging is selected for its role in smoothing demographic\nfluctuations. The logistic equation provides a natural vehicle for this\nmodel because it has played a central role in two sciences: Population\ngrowth in a resource-limited niche has long been modeled by the\ndifferential LE; and, as a difference equation, the LE is a canonical\nexample of the emergence of chaos. Suppose that feedback about\ndepleted resources generally arrives too late to avoid a wave of\nunsupportable population growth; then logistic population dynamics is\nsubject to chaotic fluctuations. It is my thesis that aging is an\nevolutionary adaptation selected for its stabilizing effect on chaotic\npopulation dynamics.\n\n1 Introduction: biological evidence demands a new theory\nA broad body of biological evidence supports the notion that senescence is an\nadaptation, created and regulated by natural selection for its own sake1. However,\nevolutionary theorists have been skeptical of this evidence because the adaptive benefit of\nsenescence is so diffuse, and its cost, born by the individual that carries senescence genes,\nso direct and immediate. For almost half a century, the biological evidence has been\nevaluated within the framework of prevailing theory: that senescence is a side-effect of\ngenes selected because they enhance fertility2,3.\nsustain.\n\nBut accumulating evidence makes this viewpoint more and more difficult to\n\ny\n\nLaboratory animals bred for longevity fail to show depressed fertility4.\n\ny\n\nSome mechanisms of aging appear to be conserved over vast stretches of\nevolutionary time5.\n\nPage 1 of 9\n\n\fDemographic homeostasis & evolution of senescence\n\ny\n\nIn caloric restriction experiments, animals evince the ability simultaneously to\nforestall aging and increase stress resistance and immune function, even while under\ndietary stress6.\n\ny\n\nGenes have been discovered in wild populations of mice7, worms8 and flies9 that\nappear to have no other function than to hasten the onset of senescence. When such\ngenes are knocked out or artificially disabled, experimental animals live longer, and\nwithout apparent cost.\n\nIn light of this evidence, the need for an adaptive theory of senescence is\napparent. But the group benefits generally associated with senescence (enhanced\npopulation diversity; greater efficiency of evolutionary selection) act too slowly to rescue\nsenescence from its direct, short-term individual cost. Hence a quantitative theory for the\nemergence of senescence as a group-level adaptation has thus far eluded evolutionary\ntheorists.\nHowever, it becomes feasible to construct a model in which senescence emerges\nas an adaptation if account is taken of the tendency of predator-prey population dynamics\nto cause demographic swings, with unsustainable peaks and valleys that flirt with\nextinction. My thesis here is that demographic stability is a major target of selection at\nthe population level, and that this explains the evolutionary provenance of senescence:\nsenescence has been selected for its contribution to damping population cycles. In\ncommon with mechanisms previously explored, senescence is considered here as a form\nof blind, local altruism, with benefit that accrues to population members locally regardless\nof their kinship to the individual bearing senescence genes; however, the other\nmechanisms require evolutionary time scales to operate, whereas the time scale for the\noperation of demographic volatility is far shorter. (For example, population diversity may\nbe increased by senescence in a few generations, but diversity itself carries no direct\nfitness benefit. Diversity can enhance the probability that good gene combinations\nemerge, and spread through a population. Only then has senescence produced a\npopulation with a fitness advantage.) Demographic instability can be lethal to a\npopulation within a few generations, and this is the primary reason that it provides a\nplausible path to selection of senescence genes, while population diversity and enhanced\nefficiency of selection do not.\n2.1 Demographic Stability in Nature\nMany ecosystems are observed to be tolerably stable, persisting over many\ngenerations with limited levels of population volatility that do not threaten constituent\nspecies with extinction. But there is no a priori necessity that this should be the case.\nIndeed, naive models of multispecies population dynamics (e.g. Lotka-Voltera equation10)\npredict deep population swings that are exceptional in our observations of nature. It is my\n\nPage 2 of 9\n\n\fDemographic homeostasis & evolution of senescence\npremise that demographic stability is an evolved feature of ecosystems, deriving from\nselective local extinctions. Co-evolution of symbionts, territoriality, and predatory and\nreproductive restraint may be examples of selection related to demographic stability.\n2.2 The Logistic Equation\nThe logistic equation is the oldest and simplest model of a population's approach\nto a steady-state level.\nd ln x\ndt\n\u0001\n\nb 1 \u0010 x/x ss\n\nwhere d ln(x)/dt is the logarithmic population growth rate, b is the maximal growth rate in\nthe absence of intraspecific competition, and xss is the steady state population level. It is\nwell-known that populations governed by the logistic equation are extremely\nwell-behaved: x approaches xss asymptotically from either above or below, without\novershooting10.\nBut the logistic equation is equally prominent in another context entirely: as a\ndifference equation, it is the canonical example used to study dynamic chaos. The\nbehavior of the logistic equation with finite time increments may be either smooth or\nchaotic, depending on the size of \u0004t. For small \u0004t (compared to the timescale 1/b), the\nbehavior is very much like the differential equation; for larger \u0004t, there are cycles in\nwhich x overshoots xss, and if \u0004t is increased further, the behavior undergoes a transition\nto dynamic chaos, such that x jumps wildly about xss from one time step to the next11.\nOf course, natural population systems cannot afford this kind of dynamic; they\nwould soon fluctuate to levels too low for the population to ever recover. But from a\ntheoretical perspective, the behavior with finite \u0004t may be a more plausible model for the\nbehavior of real populations than the smooth differential version.\n\n3 Why do we expect real ecosystems to provide delayed feedback?\nSteady-state population level reflects limits to the size of a population that can\nbe supported in a given ecosystem. For animal species, one limit is set by the rate at\nwhich species lower on the food chain can regenerate and provide nourishment. Other\nlimits come from predator species (higher on the food chain) that may bloom as their prey\napproach high densities, from limited physical space for habitat, and from diseases that\nthrive in crowded conditions. Each of these limits requires time to feed back to either\nbirth or death rates in the target species. If the population of species B grows to the point\nwhere it depletes stores of species A on which it depends, then species A may require\nmultiple B generations to recover. And the growth of predator (or parasitic) population C\nmay require many generations to adjust to a higher B population level, so that it can be an\n\nPage 3 of 9\n\n\fDemographic homeostasis & evolution of senescence\neffective restraining force. Once the C population has been established at a high level, it\nmay continue to deplete population B long after B has shrunk below its steady-state level.\nSo the time-delayed logistic equation is a plausible model for population dynamics.\nLogistic population growth with delayed feedback\nFor small time delay, population approaches a\nsteady-state level; but for larger time delays, population\nis subject to cycles of ever greater severity. At delay\nlevels that cannot be ruled out in nature, the population\ndrops exponentially close to zero, and remain there for\na substantial fraction of the cycle.\n\nFor large time delays, the shape of the population curve is reminiscent of Lotka-Voltera\npopulation dynamics, rising in a spike, then dropping exponentially close to zero for a\nportion of each cycle.\n\n4 Individual-based model\nOur model for a population dynamic in which senescence can evolve is an\nindividual-based version of the time-delayed logistic equation. In each time step, each\nindividual has a constant probability b of reproducing. The act of reproduction simply\ncreates a copy of the individual, with zero age. In each time step, each individual suffers\n\nPage 4 of 9\n\n\fDemographic homeostasis & evolution of senescence\na probability of death proportional to (1-x/xss), where population x is measured at a time\n\u0004t before the present.\nThis simple situation is sufficient to observe the salutary effect of senescence on\npopulation volatility; however, to actually see senescence genes selected, a population\nstructure must be imposed. Senescence cannot evolve in a panmictic population.\nResults from the un-structured model show a population volatility that increases\nwith the time delay. If the mortality rate is increased simply by increasing the constant\nthat multiplies (1-x/xss), this decreases the steady state population without adding to\nstability. If an extra term is added for probability of \"accidental death\" unrelated to\ncrowding, this is equivalent to decreasing the birth rate b, and again the steady state\npopulation is reduced without any benefit to volatility. But true senescence is the increase\nof mortality with age. If a Gompertz term is included in the model, so that the probability\nof death, already proportional to collective crowding, also grows exponentially with age\nof the individual, then population volatility is damped, and the demography can be\nstabilized at somewhat higher values of the time delay than are possible without\nsenescence.\n\nAging damps population fluctuations\nPopulation volatility (measured by the ratio of standard deviation to average population)\nincreases with time delay. But adding Gompertz aging to the model has a stabilizing\neffect. (Time delays and age rates are in natural units of the population's exponential\ngrowth period for free expansion.)\n\n5 Adding spatial structure: evolving senescence\nTo see genes for senescence selected over genes for no senescence requires a\nstructured population. One kind of model divides the population into groups connected\nby low levels of migration, enabling the groups to maintain different gene frequency\nprofiles; in another kind of model, the population is arrayed one-per-site on a viscous\n\nPage 5 of 9\n\n\fDemographic homeostasis & evolution of senescence\ngrid, and group structure is an emergent property. The first kind of model must succeed\nin evolving senescence, at least for a proper choice of parameter values, because there are\nvalues of the delay for which populations without senescence are too volatile to persist.\nSites where the population is dominated by non-aging individuals will fluctuate to\nextinction, and migrants from neighboring sites will bring in \"founders\" that re-seed the\nsite with aging types. Results from this group-array model will be presented elsewhere.\nMeanwhile, I explore here an example of the second type, based on a viscous\ngrid. On a Cartesian grid of 256*256 sites, each site may be empty, or may be occupied\nby an individual. Individuals have two genes: one for a constant mortality m, independent\nof age; one for a Gompertz rate of aging, g. In each time step, an individual has a\nconstant probability b of reproducing into an empty neighboring site (if a site vacancy\nexists). There is also a probability of death, equal to m plus a crowding factor, all\nmultiplied by the Gompertz aging factor.\n\nmortality\n\nm \u000e c crowding exp g age\n\nThe constant c scales the contribution of crowding to mortality. How should a local value\nof crowding be measured? I have used a sum over occupancy of neighboring sites,\nregarding each site as the center of its own neighborhood. Contributions to crowding are\nweighted by 1/r2, where r2=\u0004x2+\u0004y2 is the Pythagorean distance between the central site\nand the site whose contribution is being computed:\n\ncrowding\n\u0002\n\nx2\n\n1\n\u0002\n\n\u0003\n\ny2\n\n(with summation over occupied sites at time delay before the present)\n\nI find that with delay set to zero, a uniform, stable level of occupancy can be\nmaintained without aging. When g is left to evolve, it assumes a low value such that 3%\nof all deaths are senescent deaths.\nPopulation modulation with instantaneous feedback\nWhen delay is set to zero, population regulates itself\nhandily, and senescence is not necessary. Population\ndistribution is uniform on scales larger than a few grid\nsites.\n\nPage 6 of 9\n\n\fDemographic homeostasis & evolution of senescence\nHowever, when delay is increased, the population wants to oscillate with a period equal to\ndelay, but different regions of the grid find their own schedules. At any given time,\nregions of dense occupancy exist as islands in seas of empty sites. For values of delay\nthat are sufficiently high, fluctuations may extinguish the population entirely. For\nintermediate values of delay, the population grows into areas where the memory of a low\npopulation density persists, only to fade from places where there is a memory of high\ndensity.\n\nPopulation moves into regions where there is a memory of low density\nAfter a near-extinction, population grows into space where memory of a low population\ndensity persists. Regions of high density expand into surrounding space, but then they are\nemptied from the inside out, as the memory of high densities at the core extinguishes\npopulation in an expanding hole.\n\nWhen g and m are freed to evolve with large values of delay, m falls to zero, but\ng evolves to high levels, such that a substantial fraction of all deaths are senescent deaths.\n(This is my criterion for the evolution of a significant level of aging.)\nAging evolves in a viscous population\ngoverned by delayed logistic population\ngrowth\n\nEvolved rate of aging rises with time delay\nPercentage of senescent deaths\n\n30.0%\n25.0%\n20.0%\n15.0%\n10.0%\n5.0%\n0.0%\n0\n\n5\n\n10\nTime delay\n\n15\n\nAging evolves as a mechanism to stabilize\npopulation dynamics, as regions without aging\nexperience wide extremes, and fluctuate to\nextinction. Aging is programmed as an\nexponential (Gompertz) increase of death rate\nwith age, beginning at an age 2/b, where b is the\nrate of reproduction. The exponential rate of\nincrease is governed by a gene g. For large time\ndelays, I observe evolved rates of aging\nsufficient to account for a substantial proportion\nof all deaths.\n\nPage 7 of 9\n\n\fDemographic homeostasis & evolution of senescence\nFor small values of delay (p4), the evolutionary process seems stochastic and\nindeterminate. A range of values for agerate seems equally able to compete with no\naging.\n\n6 Summary\nExperimental evidence compels the conclusion that aging is an adaptation; but\ntheorists have been reluctant to accept this paradigm because aging carries a cost to the\nindividual, and no group-level adaptive value for aging has been identified that acts\npromptly and powerfully enough to counterbalance the individual cost. I suggest here\nthat aging has been selected for the contribution it makes to demographic stability.\nThe time-delayed logistic equation is an appropriate model for population\nfluctuations, rooted as it is both in population genetics and chaos theory. In order to turn\nthe logistic equation into an individual-based model that can support the evolution of\nsenescence, two things are necessary: a spatially structured population, and a reasonable\ndefinition of crowding. Providing these in a straightforward way, I find that a gene for\naging emerges readily, without need for special assumptions or tuning of parameter\nvalues. The principal assumption is that the time delay for population feedback is\nsufficiently high that demographic instabilities pose a significant risk of extinction.\nUnder these circumstances, senescence (defined as an increase in mortality with age)\nstabilizes population swings in a way that neither a lower birth rate nor a higher mortality\nrate can. (The latter led only to lower steady-state population levels, but not decreased\nvolatility.)\n\nReferences\n1. Mitteldorf, J: Pleiotropic Theories of Aging and their Empirical Foundation.\n\nForthcoming. Preprint available as http://www.mathforum.org/~josh/plei1lab.pdf\n\n2. Williams, G: Pleiotropy, natural selection, and the evolution of senescence.\nEvolution. 11:398-411. (1957)\n\n3. Rose, M. R: Evolutionary iology of Aging. New York. Oxford U. Press. 1991\n4. Leroi, A. M., Chippindale , A. K., Rose, M. R: Long-term laboratory evolution of a\ngenetic life-history tradeoff in Drosophila melanogaster. 1. The role of\ngenotype-by-environment interaction. Evolution. 48:1244-1257. (1994)\n\nPage 8 of 9\n\n\fDemographic homeostasis & evolution of senescence\n\n5. Kenyon, C., Guarente, L: Genetic pathways that regulate ageing in model organisms.\nNature 408:255-262 (2000)\n\n6. Weindruch, R, Walford, R. The Retardation of Aging and Disease by Dietary\nRestriction. Thomas, Springfield, IL. (1986)\n\n7. Migliaccio E., M. Giorgio, S. Mele, G. Pelicci, P. Reboldi, and P. Pandolfi: The\n\np66shc adaptor protein controls oxidative stress response and life span in mammals.\nNature 402:309-313 (1999)\n\n8. Dillin, A, Crawford, D, Kenyon, C: Timing requirements for insulin/IGF1 signaling\nin C. Elegans. Science. 298:830-834. (2002)\n\n9. Lin, Y.J, Seroude, L, Benzer, S: Extended life-span and stress resistance in the\nDrosophila mutant methuselah. Science 282:943-946 (1998)\n\n10. Abrams, P.A. The evolution of predator-prey interactions: Theory and evidence.\nAnnual Review of Ecology and Systematics. 31:79-105. (2000)\n\n11. Bar-Yam, Y: Dynamiics of Complex Systems. Perseus, Reading, MA (1997)\n\nPage 9 of 9\n\n\f"}