{"id": "http://arxiv.org/abs/quant-ph/0403044v1", "guidislink": true, "updated": "2004-03-04T23:35:21Z", "updated_parsed": [2004, 3, 4, 23, 35, 21, 3, 64, 0], "published": "2004-03-04T23:35:21Z", "published_parsed": [2004, 3, 4, 23, 35, 21, 3, 64, 0], "title": "Entanglement beyond subsystems", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=quant-ph%2F0409212%2Cquant-ph%2F0409085%2Cquant-ph%2F0409093%2Cquant-ph%2F0403001%2Cquant-ph%2F0403114%2Cquant-ph%2F0403221%2Cquant-ph%2F0403019%2Cquant-ph%2F0403228%2Cquant-ph%2F0403151%2Cquant-ph%2F0403061%2Cquant-ph%2F0403179%2Cquant-ph%2F0403010%2Cquant-ph%2F0403051%2Cquant-ph%2F0403011%2Cquant-ph%2F0403071%2Cquant-ph%2F0403135%2Cquant-ph%2F0403067%2Cquant-ph%2F0403180%2Cquant-ph%2F0403167%2Cquant-ph%2F0403037%2Cquant-ph%2F0403047%2Cquant-ph%2F0403032%2Cquant-ph%2F0403093%2Cquant-ph%2F0403090%2Cquant-ph%2F0403170%2Cquant-ph%2F0403190%2Cquant-ph%2F0403086%2Cquant-ph%2F0403175%2Cquant-ph%2F0403184%2Cquant-ph%2F0403181%2Cquant-ph%2F0403005%2Cquant-ph%2F0403233%2Cquant-ph%2F0403116%2Cquant-ph%2F0403107%2Cquant-ph%2F0403127%2Cquant-ph%2F0403120%2Cquant-ph%2F0403129%2Cquant-ph%2F0403076%2Cquant-ph%2F0403161%2Cquant-ph%2F0403057%2Cquant-ph%2F0403012%2Cquant-ph%2F0403050%2Cquant-ph%2F0403119%2Cquant-ph%2F0403219%2Cquant-ph%2F0403060%2Cquant-ph%2F0403124%2Cquant-ph%2F0403073%2Cquant-ph%2F0403029%2Cquant-ph%2F0403144%2Cquant-ph%2F0403046%2Cquant-ph%2F0403078%2Cquant-ph%2F0403053%2Cquant-ph%2F0403222%2Cquant-ph%2F0403109%2Cquant-ph%2F0403033%2Cquant-ph%2F0403100%2Cquant-ph%2F0403101%2Cquant-ph%2F0403055%2Cquant-ph%2F0403026%2Cquant-ph%2F0403169%2Cquant-ph%2F0403105%2Cquant-ph%2F0403007%2Cquant-ph%2F0403224%2Cquant-ph%2F0403020%2Cquant-ph%2F0403206%2Cquant-ph%2F0403201%2Cquant-ph%2F0403208%2Cquant-ph%2F0403134%2Cquant-ph%2F0403039%2Cquant-ph%2F0403074%2Cquant-ph%2F0403004%2Cquant-ph%2F0403230%2Cquant-ph%2F0403035%2Cquant-ph%2F0403056%2Cquant-ph%2F0403141%2Cquant-ph%2F0403174%2Cquant-ph%2F0403072%2Cquant-ph%2F0403045%2Cquant-ph%2F0403096%2Cquant-ph%2F0403216%2Cquant-ph%2F0403018%2Cquant-ph%2F0403165%2Cquant-ph%2F0403204%2Cquant-ph%2F0403198%2Cquant-ph%2F0403210%2Cquant-ph%2F0403137%2Cquant-ph%2F0403168%2Cquant-ph%2F0403063%2Cquant-ph%2F0403122%2Cquant-ph%2F0403014%2Cquant-ph%2F0403163%2Cquant-ph%2F0403196%2Cquant-ph%2F0403044%2Cquant-ph%2F0403031%2Cquant-ph%2F0403215%2Cquant-ph%2F0403227%2Cquant-ph%2F0403082%2Cquant-ph%2F0403125%2Cquant-ph%2F0403191%2Cquant-ph%2F0403013%2Cquant-ph%2F0403155&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Entanglement beyond subsystems"}, "summary": "We present a notion of generalized entanglement which goes beyond the\nconventional definition based on quantum subsystems. This is accomplished by\ndirectly defining entanglement as a property of quantum states relative to a\ndistinguished set of observables singled out by Physics. While recovering\nstandard entanglement as a special case, our notion allows for substantially\nbroader generality and flexibility, being applicable, in particular, to\nsituations where existing tools are not directly useful.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=quant-ph%2F0409212%2Cquant-ph%2F0409085%2Cquant-ph%2F0409093%2Cquant-ph%2F0403001%2Cquant-ph%2F0403114%2Cquant-ph%2F0403221%2Cquant-ph%2F0403019%2Cquant-ph%2F0403228%2Cquant-ph%2F0403151%2Cquant-ph%2F0403061%2Cquant-ph%2F0403179%2Cquant-ph%2F0403010%2Cquant-ph%2F0403051%2Cquant-ph%2F0403011%2Cquant-ph%2F0403071%2Cquant-ph%2F0403135%2Cquant-ph%2F0403067%2Cquant-ph%2F0403180%2Cquant-ph%2F0403167%2Cquant-ph%2F0403037%2Cquant-ph%2F0403047%2Cquant-ph%2F0403032%2Cquant-ph%2F0403093%2Cquant-ph%2F0403090%2Cquant-ph%2F0403170%2Cquant-ph%2F0403190%2Cquant-ph%2F0403086%2Cquant-ph%2F0403175%2Cquant-ph%2F0403184%2Cquant-ph%2F0403181%2Cquant-ph%2F0403005%2Cquant-ph%2F0403233%2Cquant-ph%2F0403116%2Cquant-ph%2F0403107%2Cquant-ph%2F0403127%2Cquant-ph%2F0403120%2Cquant-ph%2F0403129%2Cquant-ph%2F0403076%2Cquant-ph%2F0403161%2Cquant-ph%2F0403057%2Cquant-ph%2F0403012%2Cquant-ph%2F0403050%2Cquant-ph%2F0403119%2Cquant-ph%2F0403219%2Cquant-ph%2F0403060%2Cquant-ph%2F0403124%2Cquant-ph%2F0403073%2Cquant-ph%2F0403029%2Cquant-ph%2F0403144%2Cquant-ph%2F0403046%2Cquant-ph%2F0403078%2Cquant-ph%2F0403053%2Cquant-ph%2F0403222%2Cquant-ph%2F0403109%2Cquant-ph%2F0403033%2Cquant-ph%2F0403100%2Cquant-ph%2F0403101%2Cquant-ph%2F0403055%2Cquant-ph%2F0403026%2Cquant-ph%2F0403169%2Cquant-ph%2F0403105%2Cquant-ph%2F0403007%2Cquant-ph%2F0403224%2Cquant-ph%2F0403020%2Cquant-ph%2F0403206%2Cquant-ph%2F0403201%2Cquant-ph%2F0403208%2Cquant-ph%2F0403134%2Cquant-ph%2F0403039%2Cquant-ph%2F0403074%2Cquant-ph%2F0403004%2Cquant-ph%2F0403230%2Cquant-ph%2F0403035%2Cquant-ph%2F0403056%2Cquant-ph%2F0403141%2Cquant-ph%2F0403174%2Cquant-ph%2F0403072%2Cquant-ph%2F0403045%2Cquant-ph%2F0403096%2Cquant-ph%2F0403216%2Cquant-ph%2F0403018%2Cquant-ph%2F0403165%2Cquant-ph%2F0403204%2Cquant-ph%2F0403198%2Cquant-ph%2F0403210%2Cquant-ph%2F0403137%2Cquant-ph%2F0403168%2Cquant-ph%2F0403063%2Cquant-ph%2F0403122%2Cquant-ph%2F0403014%2Cquant-ph%2F0403163%2Cquant-ph%2F0403196%2Cquant-ph%2F0403044%2Cquant-ph%2F0403031%2Cquant-ph%2F0403215%2Cquant-ph%2F0403227%2Cquant-ph%2F0403082%2Cquant-ph%2F0403125%2Cquant-ph%2F0403191%2Cquant-ph%2F0403013%2Cquant-ph%2F0403155&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We present a notion of generalized entanglement which goes beyond the\nconventional definition based on quantum subsystems. This is accomplished by\ndirectly defining entanglement as a property of quantum states relative to a\ndistinguished set of observables singled out by Physics. While recovering\nstandard entanglement as a special case, our notion allows for substantially\nbroader generality and flexibility, being applicable, in particular, to\nsituations where existing tools are not directly useful."}, "authors": ["Lorenza Viola", "Howard Barnum", "Emanuel Knill", "Gerardo Ortiz", "Rolando Somma"], "author_detail": {"name": "Rolando Somma"}, "author": "Rolando Somma", "arxiv_comment": "14 pages, no figures. Invited contribution to the Proceedings of the\n  Coding Theory and Quantum Computing Workshop, AMS series in Contemporary\n  Mathematics (2004)", "links": [{"href": "http://arxiv.org/abs/quant-ph/0403044v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/quant-ph/0403044v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/quant-ph/0403044v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/quant-ph/0403044v1", "journal_reference": null, "doi": null, "fulltext": "arXiv:quant-ph/0403044v1 4 Mar 2004\n\nEntanglement beyond subsystems\nL. Viola, H. Barnum, E. Knill, G. Ortiz, and R. Somma\nAbstract. We present a notion of generalized entanglement which goes beyond the conventional definition based on quantum subsystems. This is accomplished by directly defining entanglement as a property of quantum states\nrelative to a distinguished set of observables singled out by Physics. While\nrecovering standard entanglement as a special case, our notion allows for substantially broader generality and flexibility, being applicable, in particular, to\nsituations where existing tools are not directly useful.\n\n.\n1. Introduction\nSince the early days of quantum mechanics, the concept of entanglement has\nproved a continuous source of physical, mathematical, and philosophical challenges.\nInterest in entanglement has heightened dramatically in recent years, the characterization and quantification of entanglement being nowadays one of the most active\nresearch areas within the emerging science of Quantum Information (QI) [NC]. So,\nwhat is the point about entanglement? Quoting from a landmark 1935 paper by\nSchrödinger, where the term entanglement was first introduced [S] (see also [EPR]),\n\"...This is the point. Whenever one has a complete expectation\ncatalog - a maximum total knowledge - a ψ function - for two\ncompletely separated bodies,... then one obviously has it also for\nthe two bodies together... But the converse is not true. Maximal knowledge of a total system does not necessarily include total\nknowledge of all its parts, not even when these are fully separated\nfrom each other and at the moment are not influencing each other\nat all.\"\nThis can be interpreted as pointing out the possibility that some pure states of\ncomposite quantum systems – precisely those Schrödinger calls \"entangled\" – have\nmixed reduced states on their constituent subsystems. It is exactly this aspect of\nentanglement that we propose to generalize beyond the subsystem framework. Of\ncourse, a lot more has been learned by now about the properties and significance\n1991 Mathematics Subject Classification. Primary 81P99; Secondary 81P68, 94A99.\nKey words and phrases. Quantum mechanics, quantum information, entanglement.\nResearch sponsored by the US DOE. L.V. gratefully acknowledges support from the Los\nAlamos Office of the Director through a J.R. Oppenheimer Fellowship. This paper is based on a\ntalk delivered at the Coding Theory and Quantum Computing Conference, University of Virginia,\nCharlottesville, May 20-24, 2003.\n1\n\n\f2\n\nL. VIOLA, H. BARNUM, E. KNILL, G. ORTIZ, AND R. SOMMA\n\nof such states from both a physical and an information-theoretic perspective. In\nparticular, because no pure state of a classical system can be correlated, the correlations present in a pure entangled state are intrinsically non-classical, as witnessed\nby the fact that the presence of entanglement is a necessary condition for the violation of Bell inequalities [BE, PS]. In addition, entangled states are known to\nprovide the defining resource for quantum communication, enabling non-classical\nprotocols such quantum teleportation and leading to provable improvements in the\nefficiency of various multipartite tasks [BU]. Finally, although a full assessment\nof the role of entanglement in quantum computational speed-up remains elusive to\ndate, entangled states involving unboundedly many qubits turn out to be necessary\nfor efficient pure-state quantum algorithms [JL].\nIn spite of such progress, there have been a number of signs recently that the\ntheory of entanglement developed so far is too restrictive to be applicable to the full\nvariety of both QI and physical settings one might like to consider. In particular,\nthe conventional approach to entanglement focuses on analyzing how a quantum\nsystem is made up from constituent subsystems, and implicitly incorporates the assumption that the latter are operationally distinguishable. Compelling motivations\nfor critically reconsidering the resulting entanglement notion come from situations\nwhere the operational access to the system of interest is inherently restricted by\nphysical constraints. A first example is offered by condensed-matter systems, where\nthe consequences of non-trivial (bosonic or fermionic) quantum statistics must be\ntaken into account, making the direct identification of particles as \"entanglable\"\nsubsystems problematic. A second example may occur in systems which are subject\nto superselection rules, which restrict the allowed transformations on the system's\nstate space and effectively cause sectors of the latter to be operationally unreachable. Both situations are being actively investigated in the QI literature, and no\nattempt will be made here to provide a complete account. While different solutions\nhave been examined thus far, they essentially all rely on either appropriately redefining the relevant subsystems to be used as primitive blocks, or the applicable\nmeasure for quantifying the accessible correlations – leaving, however, the underlying entanglement concept unchanged. We refer the reader to [ON, EK, ZF]\nand [BW, VC] for representative discussions of entanglement for indistinguishable\nparticles and in the presence of superselection rules, respectively.\nOur approach takes a different route, bypassing the need of a subsystem decomposition in the first place, and reformulating entanglement as a property of quantum\nstates which directly depends on physical observables. The investigation of the resulting notion of generalized entanglement (GE) was undertaken in [BKOV] and\ncontinued in [BKOSV]. In the following, we further highlight some properties and\nimplications of such a perspective.\n2. Entanglement and preferred subsystems\nLet S be a quantum system with associate state space H, dim (H) = d, for some\nd ∈ N. For simplicity, we shall focus on considering pure states of S throughout. A\nsubsystem of S can be defined in general as a factor (in the tensor product sense)\nof a subspace C ⊆ H [KLV]. In the simplest case where C = H, a subsystem\ndecomposition of S is described by a tensor product structure on H,\nO\n(2.1)\nH≃\nHl ,\nl\n\n\fENTANGLEMENT BEYOND SUBSYSTEMS\n\n3\n\nwhere Hl is the state space of the lth subsystem. Whenever a multipartition of\nthe form (2.1) is defined over a proper subspace of H, an encoded tensor product\nstructure is obtained, and the underlying subsystems are sometimes referred to as\n\"logical\" or \"virtual\" subsystems [Z].\nEven in the simplest setting described by Eq. (2.1), it is essential to realize\nthat, a priori, the number of inequivalent subsystem partitions that H can support\nmay be large, reflecting the fact that many possibilities of expressing d as a product\nof integers arise in general 1. Accordingly, entanglement of a state in H is unambiguously defined only once a preferred subsystem decomposition is selected – which\nphysically corresponds to a specific way of viewing S as made up from constituent\nparts. Relative to a distinguished multipartite structure, a pure state |ψi ∈ H is\nentangled iff is not expressible as a product of states in Hl . Given |ψi, the state of\nthe lth subsystem is determined by the reduced density operator ρl resulting from\nthe partial trace operation over the remaining subsystems. Thus, an equivalent\ncharacterization of standard pure-state entanglement is that |ψi is entangled iff ρl\nis mixed for some l: entangled pure states are exactly those which appear mixed to\nobservers whose operational access to S is restricted to local observables acting on\nonly a subsystem at a time.\nThe above observations suggest that the standard definition of entanglement\ncan be equivalently phrased in terms of the observables used to measure the system\nand describe its states, and that perhaps this could serve as a starting point for\nan operational characterization of entanglement under more general circumstances.\nA natural path for capturing such an intuition is to relate the emergence of a\npreferred subsystem decomposition to be used to the set of available interactions\nand measurement capabilities. Such a path, which naturally extends the observalebased definition of subsystems in terms of associative algebras introduced in [KLV,\nVKL, Z], has been recently investigated by Zanardi et al. [ZLL]. The essence of\nour GE approach, as we shall see, is instead to redefine entanglement so as to make\nit directly dependent upon a physically relevant set of observables – irrespective of\nand without reference to a preferred way for partitioning S into subsystems.\n3. The notion of generalized entanglement\nThe key realization underlying the GE approach is that the distinctive features of entanglement are determined by the expectation values of a distinguished\nsubspace of observables of S. The latter may directly incorporate an operational\nrestriction, such as limited means for controlling and measuring the system, or more\ngenerally reflect an insight or condition dictated by Physics. Let such a preferred\nobservable subspace be denoted by Ω. The steps leading to GE may be summarized\nas follows:\n• Pure states are unentangled (in the conventional sense) iff every subsystem\nstate is pure;\n• States can be represented as positive linear functionals on operator spaces,\ninduced by a density operator according to the trace map. Formally, given\na state of S described by ρ, this completely specifies a positive linear\n1See [Z] for a formal definition of equivalent factorizations and the resulting notion of tensorproduct-structure manifold.\n\n\f4\n\nL. VIOLA, H. BARNUM, E. KNILL, G. ORTIZ, AND R. SOMMA\n\nfunctional λ on the space End(H) of all operators on H via the action\nλ(X) = tr(ρX),\n\nX ∈ End(H),\n\nsuch that λ(X † X) ≥ 0 and λ(I) = 1. Such a state λ can be restricted\nto Ω ⊆ End(H), giving a reduced state ω = λ|Ω which only determines\nthe expectations of operators in Ω. If, additionally, Ω is closed under\nHermitian conjugation, we can define a reduced density operator ρred ∈ Ω\nassociated with the state by the relationship\nω(Y ) = tr(ρY ) = tr(ρred Y ),\n\nY ∈ Ω;\n\n• The set R of Ω-reduced states is convex, that is, closed under probabilistic\ncombinations;\n• A state in R is pure iff it is extremal, that is, it cannot be expressed as a\nnon-trivial convex combination of elements in R.\nWe are thus led to the following:\nDefinition 3.1. A pure state ρ = |ψihψ| of S is generalized unentangled relative\nto the distinguished set of observables Ω if its reduced state is pure, and generalized\nentangled otherwise2.\nWhile the above definition is applicable to an arbitrary linearly closed operator\nset Ω, a relevant situation which is often encountered in physical applications occurs\nwhen Ω is a Lie algebra of operators acting on H.\n3.1. Lie-algebraic framework and Lie-algebraic purity. Let us focus on\nthe case where Ω = h is a semisimple Lie algebra of operators acting irreducibly\non the representation space H. In order to make the connection with physical\nobservables more transparent, we also assume that h is a real Lie algebra consisting\nof Hermitian operators, with a modified Lie-bracket operation defined as follows:\n[X, Y ] = i(XY − Y X),\n\nX, Y ∈ h.\n\nAccordingly, the Lie group G generated by h will be obtained via the modified\nexponential map X 7→ eiX . The reader is referred to [G, HA, HU] for relevant\nbackground on Lie representation theory. The general case of a reducible action of\nh on H is addressed elsewhere (see for instance [SOBKV]).\nUnder the above assumptions, one of the key results established in [BKOV]\n(see Theorem 14, part (3)) is the identification of the generalized unentangled pure\nstates as the generalized coherent states (GCSs) associated with the Lie algebra h\n(see also [K] for a related characterization motivated by geometric invariant theory).\nA review of the theory underlying GCSs and their main physical applications may\nbe found in [PR, ZFG]. Recall that GCSs are obtained by extending the definition\nof canonical (harmonic-oscillator) coherent states in terms of a displaced reference\nstate within a general Lie-algebraic framework. Beside the Lie algebra h with\nassociated dynamical group G acting on H, the definition of GCSs requires the\nspecification of a normalized reference state |Ψ0 i ∈ H which, following Gilmore's\nconstruction, is chosen as an extremal (lowest-weight) state of the representation.\nKnowledge of G and |Ψ0 i determines the subgroup G0 ⊆ G of elements that preserve\nthe reference state up to a phase factor. The manifold of GCSs associated to\n2Similarly, a mixed state ρ of S is generalized unentangled relative to Ω if it can be written\nas a proper convex combination of generalized unentangled pure states.\n\n\fENTANGLEMENT BEYOND SUBSYSTEMS\n\n5\n\n(h, H, |Ψ0 i) is then defined by the orbit of the reference state under coset elements\nin G/G0 that is,\n(3.1)\n\nGCS(h,H,|Ψ0 i) = {D|Ψ0 i | D ∈ G/G0 }.\n\nAccordingly, all generalized unentangled states are GCSs and are in the orbit of a\n(unique) minimum weight state of h under the action of the Lie group.\nGiven a pure state |ψi ∈ H, one would like to obtain a quantitative way for\nrelating the properties of generalized unentanglement, generalized coherence, and\npurity with respect to the observable subspace. A natural procedure is to consider\nthe projection of |ψihψ| onto h, as the latter completely determines the expectation\nvalues of operators in the Lie algebra. This motivates the following:\nDefinition 3.2. Let {xi } be a Hermitian and commonly-normalized orthogonal (tr xi xj ∝ δij ) basis for h. For any |ψi ∈ H, the purity of |ψi relative to h (or\nh-purity) is\nX\nX\n|hψ|xi |ψi|2 .\n(tr|ψihψ|xi )2 =\n(3.2)\nPh (|ψi) =\ni\n\ni\n\nRemark 3.3. Let Ph denote the projection map onto h. As defined, the hpurity of a state is the square length of the projection Ph (|ψihψ|) according to the\ntrace-inner-product norm. Note that, in principle, different operator norms could\nbe used, resulting in different purity functionals for fixed h.\n\nRemark 3.4. Let D ∈ G be an arbitrary group transformation. Then Ph (|ψi)=\nP̃h (|ψi), where the latter is calculated by replacing the operators xi with D† xi D\nin Eq. (3.2). Because P̃h (|ψi) = Ph (D|ψi), the h-purity is invariant under group\ntransformations, as is desirable on physical grounds.\nWith the above definitions, the main features of GE within the Lie-algebraic\nframework are summarized by the following:\nTheorem 3.5. The following characterizations are equivalent for an irreducibly\nrepresented Lie algebra h on H:\n(1) ρ is generalized unentangled relative to h.\n(2) ρ = |ψihψ| with |ψi the unique ground state of some Hamiltonian H in h.\n(3) ρ = |ψihψ| with |ψi a lowest-weight vector of h.\n(4) ρ has maximum h-purity.\nA proof of this Theorem is available in [BKOV]. We also refer the reader to\nthe same paper for an extended discussion of generalizations of various informationtheoretic notions (such as local maps and complexity measures) to the Lie-algebraic\nsetting and beyond. In the following, we focus on illustrating some aspects of the\nrelationship between conventional and generalized entanglement.\n4. Conventional entanglement revisited\nGiven the quantum system S and a pure state |ψi ∈ H, the purity relative to the\n(real) Lie algebra of all traceless observables h = su(d) spanned by an orthogonal,\ncommonly normalized Hermitian basis {x1 * * * xL }, L = d2 − 1, is, according to Eq.\n(3.2), given by:\n(4.1)\n\nPh (|ψi) = K\n\nL\nX\n\nhxα i2 ,\n\nα=1\n\n\f6\n\nL. VIOLA, H. BARNUM, E. KNILL, G. ORTIZ, AND R. SOMMA\n\nwhere the overall normalization K depends on the dimension d and is determined\nby requiring that the maximum purity value is 1. For an orthonormal operator\nbasis, Tr(xα xβ ) = δα,β , K = d/(d − 1), whereas in the case Tr(xα xβ ) = dδα,β (as\nfor ordinary un-normalized Pauli matrices), K = 1/(d − 1). Because any quantum\nstate |ψi ∈ H can be obtained by applying a group operator D to a reference state\n|refi (a lowest-weight state of su(d)),\n(4.2)\n\n|ψi = D|refi,\n\nD = ei\n\nP\n\nα tα xα\n\n, tα ∈ C,\n\nany quantum state |ψi is a GCS of su(d), thus generalized unentangled relative to\nthe full observable algebra: Ph (|ψi) = 1 for all |ψi.\nLet now assume that S is composed of n distinguishable susbsytems, corresponding to a state-space\nfactorization of the form (2.1), that is, H ≃ ⊗l Hl , with\nQ\ndim(Hl ) = dl , l dl = d. In the conventional setting, distinguishability of the\nsubsystems motivates the assumption of local accessibility to their individual state\nspaces. Thus, the set of local observables, consisting of operators which act on each\nsubsystem independently, is physically distinguished. Let\n(4.3)\n\nhloc =\n\nn\nM\n\nsu(dl )\n\nl=1\n\ndenote the corresponding (real) Lie algebra of traceless local observables, acting\nirreducibly on H. Because standard unentangled pure states are exactly those\nfor which all reduced states remain extremal, the GE notion relative to the local\nobservable subspace coincides with the standard notion of pure state multipartite\nentanglement [BKOV]. This may be explicitly appreciated by studying the local\npurity Ph and its relation to the conventional subsystem purities determined by the\nreduced subsystem states.\n4.1. Local purities vs subsystem purities. An orthonormal basis which is\nsuitable for calculating Ph = Phloc may be obtained by considering a collection of\northonormal bases {xlα1 * * * xlαL }, Ll = d2l − 1, each acting on the lth factor alone,\nl\nthat is,\n\n(4.4)\n\nxlαl\n\nn factors\n}|\n{\nz\n= I1 ⊗ I2 ⊗ * * * ⊗ xαl ⊗ * * * ⊗ In ,\n|{z}\nlth factor\n\n√\nwhere Il = I/ dl . Let also hl = span{xαl } be the Lie algebra of traceless Hermitian operators acting on Hl alone, and ρl = Trl′ 6=l ({|ψihψ|}) the reduced density\noperator describing the lth subsystem's state. We can then prove:\nTheorem 4.1. For every pure state |ψi ∈ H the following identities hold:\n\n(1) For each l, the purity relative to the algebra hl is proportional to the\nconventional subsystem purity:\n\u0012\n\u0013\ndl\n1\n2\n(4.5)\nPhl (|ψi) =\ntrρl −\n.\ndl − 1\ndl\n\n\fENTANGLEMENT BEYOND SUBSYSTEMS\n\n7\n\n(2) The purity relative to the local algebra h is proportional to the average\nsubsystem purity:\n\" n \u0012\n\u0013#\n1X\n1\n1\n2\nPn\n.\n(4.6)\nPhloc (|ψi) =\ntrρl −\ndl\n1 − n1 l=1 d1 n\nl=1\n\nl\n\nProof. The state of the lth subsystem may be represented as\nX\nI\nhxαl ixαl ,\nρl =\n+\ndl\nα\nl\n\ntr(|ψihψ|xlαl )\n\nwhere hxαl i = tr(ρl xαl ) =\nand the last equality follows from the\ndefinition of reduced density operator. Thus,\nX\n1\ntrρ2l =\n+\nhxαl i2 xαl .\ndl\nα\nl\n\nBy combining the above relation with the definition of the Phl -purity,\nLl\ndl X\nhxα i2 xαl ,\ndl − 1 α =1 l\n\nPhl (|ψi) =\n\nl\n\nEq. (4.5) follows.\nTo derive the second equality, start from the definition of the Ph -purity which,\nusing Eqs. (3.2) and (4.4), reads:\nPh (|ψi) = K′\n\nLl\nn X\nX\n\nhxlαl i2 = K′\n\nl=1 αl =1\n\nn\nX\ndl − 1\nl=1\n\ndl\n\nPhl (|ψi).\n\nClearly, the maximum value of the above quantity will be attained when, and\nonly when, each of the terms trρ2l = 1 ↔ Phl = 1 for all l, corresponding to a\npure product state of the form |ψi = ⊗l |ψl i. This allows to determine the K′ normalization factor as\n1\n1\nP\nK′ =\n= \u0010\nP 1 \u0011,\n1\nn − l d1l\nn 1−\nn\n\nl dl\n\nleading to the expression given in Eq. (4.6).\n\n\u0003\n\nRemark 4.2. Note that 1/dl ≤ trρ2l ≤ 1 for every l, corresponding to a totally\nmixed and pure reduced state, respectively. Thus, the quantity in round parentheses\nin Eq. (4.5) varies between 0 and 1 − 1/dl, consistently implying a Phl -purity range\nbetween 0 and 1.\nRemark 4.3. In the case of co-dimensional subsystems, dl = d0 ∀l, Eq. (4.6)\ntakes the simpler form\n\" n \u0012\n!\n\u0013#\nn\nd0\n1X\nd0 X 2\n1\n1\n2\nPh (|ψi) =\n=\ntrρl −\ntrρl − 1 .\nd0 − 1 n\nd0\nd0 − 1 n\nl=1\n\nl=1\n\nAccording to the above Theorem, states corresponding to maximal local purity (i.e., generalized unentangled) are exactly the set of standard separable states.\nNote, however, that all pure states of H - whether they are conventionally unentangled or not relative to the selected state space decomposition - correspond to\nextremal reduced states relative to the full operator algebra g = su(d): accordingly,\n\n\f8\n\nL. VIOLA, H. BARNUM, E. KNILL, G. ORTIZ, AND R. SOMMA\n\nall pure states of H are generalized unentangled relative to such algebra. Physically, this expresses the fact that no distinction between entangled and unentangled\nstates is operationally meaningful if full access to arbitrary non-local operators is\navailable. In a sense, the emergence of entanglement in this generalized perspective\nappears intimately and directly associated with physical constraints.\n4.2. Multipartite qubit systems. The relevant case of n qubits is recovered\nby letting dl = d0 = 2 ∀l, in which case one simply has K′ = 2/n. A natural choice\nfor calculating the local purity via Eq. (3.2) is obtained by choosing standard\nmulti-qubit Pauli operators,\n(4.7)\n\nhloc =\n\nn\nM\nl=1\n\nwhere\n(4.8)\n\nσαl\n\nsu(2)l = span{σx1 , σy1 , σz1 , * * * , σxn , σyn , σzn },\n\nn factors\n}|\n{\nz\n⊗ * * * ⊗ I,\nσα\n= I ⊗ I ⊗ ***⊗\n|{z}\nlth factor\n\n2\nand the 2 × 2 matrices σα and\n√ I are the standard Pauli matrices, satisfying σα = I.\nBy noticing that xα = σα / 2 in this case, the purity of an arbitrary pure state\nbecomes then\nn\n1 X X l 2\n(4.9)\nPh (|ψi) =\nhσα i .\nn α=x,y,z\nl=1\n\nAs above, Ph = 1 in any product state of the form |ψi = ⊗l |ψl i, a multi-qubit\nGCS in this algebra. Using Theorem 4.1, the relationships between local purities\nand qubit reduced states rewrite respectively as follows:\n\u0012\n\u0013\n1\n(4.10)\nPhl (|ψi) = 2 trρ2l −\n2\n(4.11)\n\nPhloc (|ψi) =\n\n\u0013\nn \u0012\nn\n2X 2\n1\n2X\n=\ntrρ2l −\ntrρl − 1.\nn\n2\nn\nl=1\n\nl=1\n\nExample 4.4. With the above definitions, all pure product states of n qubits\nhave maximal purity that is, they are generalized unentangled.√ On the opposite\nlimit, states of√the form |GHZn i = (| ↑↑ . . . ↑i + | ↓↓ . . . ↓i)/ 2 or of the form\n[(|↑↓i − |↓↑i)/ 2]⊗n/2 (for n even) will be maximally entangled according to this\nmeasure (Ph = 0).\nBecause GE relative to the local algebra takes contributions, as quantified by\nthe measure Ph , from correlations involving all subsystems simultaneously, one\ncould expect such a measure to contain information about overall entanglement\nproperties of the system (as opposed, for instance, to the concurrence measure\nwhich is intrinsically bipartite [W]). A measure Q of global entanglement for pure\nstates of n qubits was recently proposed by Meyer and Wallach in [MW], and shown\nto exhibit correct invariance properties under local unitary operations. According\nto the original construction, the first step to define such a measure is to consider a\n\n\fENTANGLEMENT BEYOND SUBSYSTEMS\n\n9\n\nfamily of maps lj (b) given by the following action in the computational basis (and\nextended by linearity):\n(4.12)\n\nlj (b)|b1 , * * * , bn i = δbbj |b1 , * * * , b̂j , * * * , bn i,\n\nwhere b and bj are either |0i or |1i, and b̂j denotes the absence of the jth qubit in\n⊗n−1\nthe resulting (n − 1)-qubit state. Let anyPpure state in (C2 )P\nbe represented\nin the computational basis, and let |ui =\nui |φi i and |vi =\nvi |φi i be two such\nstates. If a distance function on (C2 )⊗n−1 ⊗ (C2 )⊗n−1 is introduced as\n(4.13)\n\nD(u, v) =\n\n1X\n|ui vj − uj vi |2 ,\n2 i,j\n\nthe global entanglement of a pure n-qubit state |ψi is defined as follows:\n(4.14)\n\nQ(|ψi) =\n\nn\n\u0011\n4X \u0010\nD lj (0)|ψi, lj (1)|ψi ,\nn j=1\n\nInterestingly, as explained in [BKOSV, SOBKV], the measures Ph and Q turn\nout to have a simple relationship.\nTheorem 4.5. Let h denote the local observable algebra for n qubits as defined\nabove. Then for every pure state |ψi ∈ H = (C2 )⊗n the following identity holds:\n(4.15)\n\nPh (|ψi) = 1 − Q(|ψi)\n\nProof. By partitioning the n qubits into the jth qubit and the remaining one,\nand by working in the computational bases {|0j i, |1j i} and {|φi i}, i = 1, . . . , 2n−1\nof the jth qubit and the rest, respectively, any pure quantum state |ψi ∈ (C2 )⊗n\ncan be represented as\n\n(4.16)\n\n|ψi =\n\nn−1\n2X\n\ni=1\n\nh\ni\ngij |0j i + hji |1j i |φi i,\n\nj ∈ {1, . . . , n},\n\nwhere gij and hji are complex coefficients. Therefore, the action of the map lj (b) on\n|ψi given in Eq. (4.12) is\nlj (0)|ψi =\nlj (1)|ψi =\n\nn−1\n2P\n\ni=1\nn−1\n2P\ni=1\n\ngij |φi i\nhji |φi i.\n\nUsing Eq. (4.13), the distance between the above states of (n − 1) qubits becomes\n(4.17)\n\ni\n\u0010\n\u0011 Xh\nD lj (0)|ψi, lj (1)|ψi =\n|gij |2 |hji′ |2 − (gij hji′ )(hji gij′ )∗ ,\ni,i′\n\n\f10\n\nwhere\n\nL. VIOLA, H. BARNUM, E. KNILL, G. ORTIZ, AND R. SOMMA\n∗\n\ndenotes complex conjugate. After some algebraic manipulations we get\nn−1\n\u0013\n\u0012\n2X\n1 + σzj\nj 2\n|ψi,\n|gi | = hψ|\n2\ni=1\nn−1\n2X\n\ni=1\n\nn−1\n2X\n\ni=1\n\n|hji |2\n\n= hψ|\n\n\u0012\n\n1 − σzj\n2\n\n\u0013\n\n|ψi,\n\nj\ngij (hji )∗ = hψ|σ−\n|ψi,\n\nthus Eq. (4.17) rewrites as\ni\n\u0010\n\u0011 1h\nD lj (0)|ψi, lj (1)|ψi = 1 − hσzj i2 − hσxj i2 − hσyj i2 .\n4\nBy taking a sum over all qubits and recalling Eq. (4.14), we finally obtain the\ndesired result\nn\ni\n1 Xh j 2\nQ(|ψi) = 1 −\nhσz i + hσxj i2 + hσyj i2 = 1 − Ph (|ψi).\nn j=1\n\n\u0003\n\nTheorem 4.5 together with Eq. (4.11) also implies a direct, linear relationship\nbetween the global entanglement metric Q of [MW] and the average subsystem\npurity, that is,\nn\n\u0010\n1 X 2\u0011\n(4.18)\nQ(|ψi) = 2 1 −\ntrρl .\nn\nl=1\n\nThe above relationship has been independently established by Brennen [BR].\n5. Generalized entanglement and subsystems\n\nAccording to the results of the previous section, GE includes conventional entanglement as a special case: when a given partition of H into subsystems is specified, there exists a natural observable subspace (the one describing local actions on\nindividual factors) such that entanglement relative to the given subsystem partition\nand GE relative to the associated local algebra coincides for all states. Suppose,\nhowever, that the opposite point of view is taken, namely that the state space H of a\nquantum system is known, along with a distinguished, irreducible Lie algebra h (or,\nmore generally, an observable set Ω). Then the following questions arise: Are there\npreferred subsystem partitions on H which may be determined by h? If so, does\na (possibly fictitious) subsystem partition exist, such that generalized entangled\nstates relative to h are exactly the set (or are a subset) of ordinary entangled states\nrelative to such a partition? In other words, does GE represent a genuine extension\nof the subsystem-based entanglement framework in its most general formulation?\nFrom the physical point of view, the novelty and added generality afforded by\nthe GE notion should be already clear from the direct applicability of our prescription to any situation where a laboratory condition or physical constraint singles out\na special observable set, shortcutting the need for any intermediate subsystem identification. From a mathematical perspective, a distinctive innovation with respect\nto the traditional framework is that GE ultimately depends only on the convexity\n\n\fENTANGLEMENT BEYOND SUBSYSTEMS\n\n11\n\nproperties of observable sets [BKOV]. The the resulting extremality characterization of unentangled states has not been emphasized in the conventional setting (for\ninstance, it is not part of [ZLL]'s treatment of the virtual-subsystem approach).\nWith these general considerations in mind, however, a thorough analysis of the relationships between our approach and the subsystem-based one is an interesting issue\nworth investigating per se. We limit ourselves here to a few illustrative remarks.\n5.1. Observable-dependent subsystems. If, as assumed so far, the distinguishable observables form a semisimple Lie algebra h, a natural multipartite\nsetting is determined by the fact that h is uniquely expressible as a product of simple Lie algebras h = ×k hk [HU]. A Hilbert space irreducibly representing h then\nfactors as3 H = ⊗k Hk , with the algebra hk acting as the identity over all factors except the kth one. In the language of [ZLL], the resulting multipartition is formally\nreminiscent of an observable-induced tensor product structure associated to {hk }\nover H. Similarly, a formal analogy with the emergence of encoded multipartitions\n(C ⊂ H) may be expected for a reducible representation of h on H. Note, however,\nthat actions on the individual state spaces Hk belong to a Lie group representation\nwhich need not be GL(dim(Hk )) as for standard entanglement theory [BKOV].\n5.2. Entanglement without subsystems. A situation which strikingly illustrates the added flexibility of the GE notion is offered by quantum systems whose\nstates space is intrinsically irreducible, that is, d is a prime number. In this case,\nthe system is physically elementary, and conventional entanglement is not directly\napplicable. Consider for instance a single spin-1 system, whose three-dimensional\nstate space H = C3 carries an irreducible representation of su(2), with usual angular momentum generators Jx , Jy , Jz given by\n\n\n\n\n\n\n0 1 0\n0 −i 0\n1 0 0\n1\n1\n1 \n1 0 1 , Jy = √  i 0 −i , Jz = √ 0 0 0  .\n(5.1) Jx = √\n2 0 1 0\n2 0 i\n2 0 0 −1\n0,\n\nSuppose that, due to operational limitations, observations on this system are restricted to observables linear in the above generators of su(2). Given an arbitrary\npure state |ψi ∈ C3 , the corresponding reduced state can be identified with the vector of expectation values of these three observables hJα i. The set of such reduced\nstates is a unit ball in R3 , defined by hJx i2 + hJy i2 + hJz i2 ≤ 1. The extremal\nstates correspond to points on the surface, resulting from maximal spin component\n1 for some linear combination of Jx , Jy , Jz . For any choice of spin direction, H\nis spanned by the |1, +1i, |1, 0i, |1, −1i eigenstates of that spin component, for instance the ẑ direction. Then the extremal states are immediately identified with\nthe spin coherent states |1, ξi, or GCSs for SU(2) [ZFG],\n(5.2)\n\n|1, ξi = eξJ+ −ξ\n\n∗\n\nJ−\n\n|1, −1i,\n\nξ ∈ C,\n\nwhere the exponential involving the ladder operators J± provides an explicit realization of the group-displacement D of Eq. (3.1), and the lowest-weight state\n|J = 1, Jz = −1i is chosen as the reference state. Note that the states |1, +1i\nand |1, −1i are GCSs, but |1, 0i is not: thus, the latter is a generalized (in fact,\nmaximally) entangled state relative to su(2). As also remarked earlier, access to\nthe full operator algebra (su(3) in this case) causes GE to disappear altogether,\n3Note that this implies d=dim(H) to be a non-prime integer.\n\n\f12\n\nL. VIOLA, H. BARNUM, E. KNILL, G. ORTIZ, AND R. SOMMA\n\nexpressing the fact that arbitrary state vectors can be connected through group\ntransformations in SU(3).\nNote that, in principle, one could formally regard the single spin-1 system\nconsidered above as arising from two spin-1/2 subsystems in a triplet configuration.\nThen states which are generalized unentangled (or entangled) relative to su(2)\nwould be associated with ordinary product (or entangled) states of the two fictitious\nsubsystems,\n|1, −1i ↔ | ↓i1 ⊗ | ↓i2\n| ↑i1 ⊗ | ↓i2 + | ↓i1 ⊗ | ↑i2\n√\n|1, 0i ↔\n2\n|1, +1i ↔ | ↑i1 ⊗ | ↑i2 ,\nwith self-explaining notation. We would like to stress that, from a physical point\nof view, such a partition is entirely artificial if operational access to the individual\nsubsystems is unavailable as assumed above. Moreover, the procedure is everything\nbut straightforward mathematically. Formally, the above line of reasoning requires\nembedding the original spin-1 irreducible representation of su(2) in the tensor product representation of two spin-1/2 irreducible representations of su(2), in such a way\nthat generalized entangled states becomes a subset of the ordinary entangled states\nin the extended representation4. While the simplicity of the state identification\ngiven above is coincidental to the elementary irreducible-representation-structure\nof this example, understanding to what extent a similar procedure could be carried\nout for general irreducible representations of semisimple Lie algebras might shed\nfurther light on the mathematical relationships between GE and abstract subsystem\nstructures (See also discussion in Section 5).\n6. Discussion\n6.1. Implications for condensed-matter systems. A feature which makes\nthe GE framework particularly attractive for applications to condensed-matter systems is the possibility to directly formulate entanglement in terms of the algebraic\noperator language (fermionic, bosonic, or other [BO]) which best describes the system. Among such applications, the possibility of gaining a better understanding\nof the nature and properties of the quantum correlations in a system undergoing\na quantum phase transition has attracted a growing interest recently, see for instance [ON, OAFF, VLRK]. The usefulness of the GE framework in the context\nof identifying and characterizing quantum phase transitions has been investigated\nbased on the explicit analysis of two integrable models undergoing a broken symmetry quantum phase transition – the well known one-dimensional spin-1/2 XY model\nin a transverse magnetic field and the so-called Lipkin-Meshkov-Glick model, respectively. We refer the interested reader to [BKOSV, OSBKV, SOBKV] for\ndetailed discussions. As these studies reveal, the purity relative to an appropriate Lie subalgebra of observables of the system provides a useful diagnostic tool for\ncharacterizing the many-body correlations which play a dominant role at criticality,\nby succeeding at both sharply detecting the critical point and correctly identifying\nthe underlying universality class.\n4Clearly, the (conventionally) entangled state spanning the singlet sector has no counterpart\nin the original physical space H.\n\n\fENTANGLEMENT BEYOND SUBSYSTEMS\n\n13\n\nWhile the above results are very suggestive and promising, several important\nquestions remain to be investigated in more depth. In particular, a general operational criterion for identifying the physically relevant observable subalgebra for\nHamiltonians whose ground-state properties are not easily computable is still lacking. The identification of a minimal collection of observable algebras able to provide\na complete description of the system's critical properties is likewise an open problem. Finally, the extension of similar concepts and techniques to more general\nclasses of quantum phase transitions (notably, topological quantum phase transitions) seems likely to require more sophisticated tools than the Lie-algebraic ones\nwhich suffice when a broken symmetry exists.\n6.2. Outlook and conclusion. We have presented a generalization of entanglement which provides a subsystem-independent, unifying conceptual framework\nfor defining entanglement in arbitrary physical settings. Unlike the conventional\ndefinition which is relative to a preferred decomposition into subsystem, GE is directly regarded as an observer-dependent property of quantum states, which is definable relative to any physically relevant set of observables for the system. Whenever\nthe latter possess a Lie-algebraic structure, our approach naturally links entanglement theory with the theory of generalized coherent states.\nIn addition to the condensed-matter implications mentioned above, numerous information-theoretic problems also deserve further investigation. Several issues concerning appropriate generalizations of local maps, resource scaling, and\nGE measures have been raised and partially addressed in [BKOV]. Additional\nresearch directions might involve exploring possible connections between the presence of GE and the violation of Bell-type inequalities [PS], assessing the potential\nof GE detection via appropriate witness operators [HO, T], looking at possible\ncharacterizations of GE via uncertainty relations as recently suggested for conventional entanglement [HT], and more. Ultimately, the fresh perspective offered by\nour approach will deepen our understanding of entanglement as a physical and\ninformation-theoretic resource.\nReferences\n[BE] J. S. Bell, Speakable and Unspeakable in Quantum Mechanics (Cambridge University Press,\nCambridge, 1993).\n[BO] C. D. Batista and G. Ortiz, Phys. Rev. Lett. 86, 1082 (2001); C. D. Batista, G. Ortiz, and\nJ. E. Gubernatis, Phys. Rev. B 65, 180402 (2002).\n[BR] G. K. Brennen, quant-ph/0305094, Quantum Inf. Comp. 3, 619 (2003).\n[BDSW] C. H. Bennett, D. P. DiVincenzo, J. Smolin, and W. Wootters, Phys. Rev. A 54, 3824\n(1996).\n[BKOSV] H. Barnum, E. Knill, G. Ortiz, R. Somma, and L. Viola, quant-ph/0305023, Phys. Rev.\nLett. 92 (2004), in press.\n[BKOV] H. Barnum, E. Knill, G. Ortiz, and L. Viola, Phys. Rev. A 68, 032308 (2003).\n[BU] H. Buhrman, R. Cleve, and W. Van Dam, SIAM J. Comp. 30, 1829 (2000).\n[BW] S. D. Bartlett and H. M. Wiseman, Phys. Rev. Lett. 91, 097903 (2003).\n[EK] K. Eckert, J. Schliemann, D. Bruss, and M. Lewenstein, Ann. Phys. 299, 88 (2002), and\nreferences therein.\n[EPR] A. Einstein, B. Podolsky, and N. Rosen, Phys. Rev. 47, 777 (1935).\n[G] H. Georgi, Lie Algebras in Particle Physics (Perseus Books, Reading, Massachusetts, 1999).\n[HA] B. C. Hall, Lie Groups, Lie Algebras, and Representations (Springer-Verlag, New York,\n2003).\n[HO] H. Horodecki, P. Horodecki, and R. Horodecki, Phys. Lett. A 223, 1 (1996).\n[HT] H. F. Hofmann and S. Takeuchi, Phys. Rev. A 68, 032103 (2003).\n\n\f14\n\nL. VIOLA, H. BARNUM, E. KNILL, G. ORTIZ, AND R. SOMMA\n\n[HU] J. E. Humphreys, Introduction to Lie Algebras and Representation Theory (Springer-Verlag,\nNew York, 1972).\n[JL] R. Jozsa and N. Linden, Proc. R. Soc. London A 459, 2011 (2003).\n[K] A. Klyachko, quant-ph/0206012.\n[KLV] E. Knill, R. Laflamme, and L. Viola, Phys. Rev. Lett. 84, 2525 (2000).\n[MW] D. A. Meyer and N. R. Wallach, J. Math. Phys. 43, 4273 (2002).\n[NC] M. A. Nielsen and I. L. Chuang, Quantum Computation and Quantum Information (Cambridge University Press, Cambridge, 2000).\n[OAFF] A. Osterloh, L. Amico, G. Falci, and R. Fazio, Nature 416, 608 (2002).\n[ON] T. J. Osborne and M. A. Nielsen, Quant. Inf. Process. 1, 45 (2002); Phys. Rev. A 66, 032110\n(2002).\n[OSBKV] G. Ortiz, R. Somma, H. Barnum, E. Knill, L. Viola, \"Entanglement as an observerdependent concept: An application to quantum phase transitions,\" quant-ph/0403043, to\nappear in Condensed Matter Theories, Vol. 19 (Nova Science Publishers, 2004).\n[PR] A. Perelomov, Generalized Coherent States and their Applications (Springer-Verlag, Berlin,\n1985).\n[PS] A. Peres, Found. Phys. 29, 589 (1999).\n[S] E. Schrödinger, Naturwissenschaften 23, 807 (1935). English translation available in Proc.\nAm. Phil. Soc 124, 323 (1980).\n[SOBKV] R. Somma, G. Ortiz, H. Barnum, E. Knill, and L. Viola, \"Nature and measure of\nentanglement in quantum phase transitions,\" quant-ph/0403035.\n[T] B. M. Terhal, Phys. Lett. A 271, 319 (2000).\n[VC] F. Verstraete and J. I. Cirac, Phys. Rev. Lett. 91, 010404 (2003).\n[VLRK] G. Vidal, J. I. Latorre, E. Rico, and A. Kitaev, Phys. Rev. Lett. 90, 227902 (2003).\n[VKL] L. Viola, E. Knill, and R. Laflamme, J. Phys. A 34, 7067 (2001).\n[W] W. Wootters, Phys. Rev. Lett. 80, 2245 (1998).\n[Z] P. Zanardi, Phys. Rev. Lett. 87, 077901 (2001).\n[ZF] P. Zanardi, Phys. Rev. A 65, 042101 (2002).\n[ZFG] W. M. Zhang, D. H. Feng, and R. Gilmore, Rev. Mod. Phys. 62, 867 (1990).\n[ZLL] P. Zanardi, D. A. Lidar, and S. Lloyd, quant-ph/0308043.\nLos Alamos National Laboratory, Los Alamos, New Mexico 87545\nE-mail address: lviola@lanl.gov\nLos Alamos National Laboratory, Los Alamos, New Mexico 87545\nE-mail address: barnum@lanl.gov\nNational Institute of Standards and Technology, Boulder, Colorado 80305\nE-mail address: knill@boulder.nist.gov\nLos Alamos National Laboratory, Los Alamos, New Mexico 87545\nE-mail address: ortiz@viking.lanl.gov\nLos Alamos National Laboratory, Los Alamos, NM 87545, USA\nE-mail address: somma@viking.lanl.gov\n\n\f"}