{"id": "http://arxiv.org/abs/quant-ph/0601173v1", "guidislink": true, "updated": "2006-01-26T02:17:56Z", "updated_parsed": [2006, 1, 26, 2, 17, 56, 3, 26, 0], "published": "2006-01-26T02:17:56Z", "published_parsed": [2006, 1, 26, 2, 17, 56, 3, 26, 0], "title": "A microfabricated surface-electrode ion trap for scalable quantum\n  information processing", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=quant-ph%2F0601178%2Cquant-ph%2F0601134%2Cquant-ph%2F0601014%2Cquant-ph%2F0601142%2Cquant-ph%2F0601108%2Cquant-ph%2F0601003%2Cquant-ph%2F0601023%2Cquant-ph%2F0601105%2Cquant-ph%2F0601117%2Cquant-ph%2F0601112%2Cquant-ph%2F0601055%2Cquant-ph%2F0601056%2Cquant-ph%2F0601052%2Cquant-ph%2F0601032%2Cquant-ph%2F0601070%2Cquant-ph%2F0601073%2Cquant-ph%2F0601058%2Cquant-ph%2F0601092%2Cquant-ph%2F0601177%2Cquant-ph%2F0601049%2Cquant-ph%2F0601186%2Cquant-ph%2F0601213%2Cquant-ph%2F0601132%2Cquant-ph%2F0601027%2Cquant-ph%2F0601184%2Cquant-ph%2F0601121%2Cquant-ph%2F0601098%2Cquant-ph%2F0601074%2Cquant-ph%2F0601148%2Cquant-ph%2F0601183%2Cquant-ph%2F0601122%2Cquant-ph%2F0601029%2Cquant-ph%2F0601084%2Cquant-ph%2F0601041%2Cquant-ph%2F0601012%2Cquant-ph%2F0601040%2Cquant-ph%2F0601072%2Cquant-ph%2F0601107%2Cquant-ph%2F0601173%2Cquant-ph%2F0601129%2Cquant-ph%2F0601172%2Cquant-ph%2F0601157%2Cquant-ph%2F0202009%2Cquant-ph%2F0202108%2Cquant-ph%2F0202042%2Cquant-ph%2F0202089%2Cquant-ph%2F0202017%2Cquant-ph%2F0202014%2Cquant-ph%2F0202155%2Cquant-ph%2F0202019%2Cquant-ph%2F0202114%2Cquant-ph%2F0202118%2Cquant-ph%2F0202001%2Cquant-ph%2F0202044%2Cquant-ph%2F0202160%2Cquant-ph%2F0202103%2Cquant-ph%2F0202065%2Cquant-ph%2F0202011%2Cquant-ph%2F0202043%2Cquant-ph%2F0202012%2Cquant-ph%2F0202041%2Cquant-ph%2F0202127%2Cquant-ph%2F0202071%2Cquant-ph%2F0202095%2Cquant-ph%2F0202094%2Cquant-ph%2F0202168%2Cquant-ph%2F0202004%2Cquant-ph%2F0202083%2Cquant-ph%2F0202176%2Cquant-ph%2F0202123%2Cquant-ph%2F0202058%2Cquant-ph%2F0202115%2Cquant-ph%2F0202018%2Cquant-ph%2F0202153%2Cquant-ph%2F0202119%2Cquant-ph%2F0202032%2Cquant-ph%2F0202105%2Cquant-ph%2F0202073%2Cquant-ph%2F0202038%2Cquant-ph%2F0202063%2Cquant-ph%2F0202023%2Cquant-ph%2F0202072%2Cquant-ph%2F0202066%2Cquant-ph%2F0202062%2Cquant-ph%2F0202112%2Cquant-ph%2F0202174%2Cquant-ph%2F0202003%2Cquant-ph%2F0202172%2Cquant-ph%2F0202129%2Cquant-ph%2F0202037%2Cquant-ph%2F0202162%2Cquant-ph%2F0202055%2Cquant-ph%2F0202139%2Cquant-ph%2F0202031%2Cquant-ph%2F0202076%2Cquant-ph%2F0202154%2Cquant-ph%2F0202158%2Cquant-ph%2F0202101%2Cquant-ph%2F0202102%2Cquant-ph%2F0202081%2Cquant-ph%2F0202054&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A microfabricated surface-electrode ion trap for scalable quantum\n  information processing"}, "summary": "We demonstrate confinement of individual atomic ions in a radio-frequency\nPaul trap with a novel geometry where the electrodes are located in a single\nplane and the ions confined above this plane. This device is realized with a\nrelatively simple fabrication procedure and has important implications for\nquantum state manipulation and quantum information processing using large\nnumbers of ions. We confine laser-cooled Mg-24 ions approximately 40 micrometer\nabove planar gold electrodes. We measure the ions' motional frequencies and\ncompare them to simulations. From measurements of the escape time of ions from\nthe trap, we also determine a heating rate of approximately five motional\nquanta per millisecond for a trap frequency of 5.3 MHz.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=quant-ph%2F0601178%2Cquant-ph%2F0601134%2Cquant-ph%2F0601014%2Cquant-ph%2F0601142%2Cquant-ph%2F0601108%2Cquant-ph%2F0601003%2Cquant-ph%2F0601023%2Cquant-ph%2F0601105%2Cquant-ph%2F0601117%2Cquant-ph%2F0601112%2Cquant-ph%2F0601055%2Cquant-ph%2F0601056%2Cquant-ph%2F0601052%2Cquant-ph%2F0601032%2Cquant-ph%2F0601070%2Cquant-ph%2F0601073%2Cquant-ph%2F0601058%2Cquant-ph%2F0601092%2Cquant-ph%2F0601177%2Cquant-ph%2F0601049%2Cquant-ph%2F0601186%2Cquant-ph%2F0601213%2Cquant-ph%2F0601132%2Cquant-ph%2F0601027%2Cquant-ph%2F0601184%2Cquant-ph%2F0601121%2Cquant-ph%2F0601098%2Cquant-ph%2F0601074%2Cquant-ph%2F0601148%2Cquant-ph%2F0601183%2Cquant-ph%2F0601122%2Cquant-ph%2F0601029%2Cquant-ph%2F0601084%2Cquant-ph%2F0601041%2Cquant-ph%2F0601012%2Cquant-ph%2F0601040%2Cquant-ph%2F0601072%2Cquant-ph%2F0601107%2Cquant-ph%2F0601173%2Cquant-ph%2F0601129%2Cquant-ph%2F0601172%2Cquant-ph%2F0601157%2Cquant-ph%2F0202009%2Cquant-ph%2F0202108%2Cquant-ph%2F0202042%2Cquant-ph%2F0202089%2Cquant-ph%2F0202017%2Cquant-ph%2F0202014%2Cquant-ph%2F0202155%2Cquant-ph%2F0202019%2Cquant-ph%2F0202114%2Cquant-ph%2F0202118%2Cquant-ph%2F0202001%2Cquant-ph%2F0202044%2Cquant-ph%2F0202160%2Cquant-ph%2F0202103%2Cquant-ph%2F0202065%2Cquant-ph%2F0202011%2Cquant-ph%2F0202043%2Cquant-ph%2F0202012%2Cquant-ph%2F0202041%2Cquant-ph%2F0202127%2Cquant-ph%2F0202071%2Cquant-ph%2F0202095%2Cquant-ph%2F0202094%2Cquant-ph%2F0202168%2Cquant-ph%2F0202004%2Cquant-ph%2F0202083%2Cquant-ph%2F0202176%2Cquant-ph%2F0202123%2Cquant-ph%2F0202058%2Cquant-ph%2F0202115%2Cquant-ph%2F0202018%2Cquant-ph%2F0202153%2Cquant-ph%2F0202119%2Cquant-ph%2F0202032%2Cquant-ph%2F0202105%2Cquant-ph%2F0202073%2Cquant-ph%2F0202038%2Cquant-ph%2F0202063%2Cquant-ph%2F0202023%2Cquant-ph%2F0202072%2Cquant-ph%2F0202066%2Cquant-ph%2F0202062%2Cquant-ph%2F0202112%2Cquant-ph%2F0202174%2Cquant-ph%2F0202003%2Cquant-ph%2F0202172%2Cquant-ph%2F0202129%2Cquant-ph%2F0202037%2Cquant-ph%2F0202162%2Cquant-ph%2F0202055%2Cquant-ph%2F0202139%2Cquant-ph%2F0202031%2Cquant-ph%2F0202076%2Cquant-ph%2F0202154%2Cquant-ph%2F0202158%2Cquant-ph%2F0202101%2Cquant-ph%2F0202102%2Cquant-ph%2F0202081%2Cquant-ph%2F0202054&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We demonstrate confinement of individual atomic ions in a radio-frequency\nPaul trap with a novel geometry where the electrodes are located in a single\nplane and the ions confined above this plane. This device is realized with a\nrelatively simple fabrication procedure and has important implications for\nquantum state manipulation and quantum information processing using large\nnumbers of ions. We confine laser-cooled Mg-24 ions approximately 40 micrometer\nabove planar gold electrodes. We measure the ions' motional frequencies and\ncompare them to simulations. From measurements of the escape time of ions from\nthe trap, we also determine a heating rate of approximately five motional\nquanta per millisecond for a trap frequency of 5.3 MHz."}, "authors": ["S. Seidelin", "J. Chiaverini", "R. Reichle", "J. J. Bollinger", "D. Leibfried", "J. Britton", "J. H. Wesenberg", "R. B. Blakestad", "R. J. Epstein", "D. B. Hume", "J. D. Jost", "C. Langer", "R. Ozeri", "N. Shiga", "D. J. Wineland"], "author_detail": {"name": "D. J. Wineland"}, "author": "D. J. Wineland", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevLett.96.253003", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/quant-ph/0601173v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/quant-ph/0601173v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "4 pages, 4 figures", "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/quant-ph/0601173v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/quant-ph/0601173v1", "journal_reference": "Phys. Rev. Lett. 96, 253003 (2006)", "doi": "10.1103/PhysRevLett.96.253003", "fulltext": "A microfabricated surface-electrode ion trap for scalable quantum information\nprocessing\nS. Seidelin,∗ J. Chiaverini,† R. Reichle, J. J. Bollinger, D. Leibfried, J. Britton, J. H. Wesenberg,\nR. B. Blakestad, R. J. Epstein, D. B. Hume, J. D. Jost, C. Langer, R. Ozeri, N. Shiga, and D. J. Wineland\n\narXiv:quant-ph/0601173v1 26 Jan 2006\n\nNIST, Time and Frequency Division, Boulder, CO\n(Dated: February 1, 2008)\nWe demonstrate confinement of individual atomic ions in a radio-frequency Paul trap with a novel\ngeometry where the electrodes are located in a single plane and the ions confined above this plane.\nThis device is realized with a relatively simple fabrication procedure and has important implications\nfor quantum state manipulation and quantum information processing using large numbers of ions.\nWe confine laser-cooled 24 Mg+ ions approximately 40 μm above planar gold electrodes. We measure\nthe ions' motional frequencies and compare them to simulations. From measurements of the escape\ntime of ions from the trap, we also determine a heating rate of approximately five motional quanta\nper millisecond for a trap frequency of 5.3 MHz.\n\nRecent interest in coherent quantum state control and\nmethods to realize practical quantum information processing (QIP) has led to impressive developments in\nquantum processing using several different physical systems [1]. Single quantum bit (qubit) rotations, two-qubit\ngates, and simple quantum algorithms have been implemented. However, perhaps the most significant challenge\nfor any possible physical implementation of a quantum\nprocessor is to devise methods that scale to very large\nnumbers of quantum information carriers.\nThe system of trapped ions is an interesting candidate for QIP because the basic requirements [2] have\nbeen demonstrated in separate experiments [1], and several schemes for scaling this system to large numbers of\nqubits have been proposed [1, 3, 4, 5, 6, 7]. One approach\nis based on a network of interconnected processing and\nmemory zones where ion qubits are selectively shuttled\nbetween zones [3, 6]. Within this approach, miniature\nlinear trap arrays [8, 9, 10, 11] and a three layer Tjunction trap [10] have been demonstrated. Since the\nspeed of most multi-ion qubit gates is proportional to\nthe ions' motional frequencies and these frequencies are\ninversely proportional to the square of the dimensions,\nwe would like to decrease the size of these dimensions.\nTo do this robustly, microfabrication techniques are required. Three-dimensional traps have been demonstrated\nwith boron-doped silicon [12] and monolithically fabricated gallium-arsenide electrodes [11]. A significant simplification in fabrication could be achieved if all trap electrodes reside on a single surface and the ions are trapped\nabove this surface [13]. In this case, the trapping electric fields would be the analog of magnetic fields used\nin \"chip\" traps for neutral atoms (see Ref. [14] and references therein). Surface-electrode ion traps have the\npotential added benefit for scaling that micro-electronics\nfor electrode potential control can be fabricated below\nthe plane of the electrodes [15].\nRecently, macroscopic charged particles have been confined in a surface-electrode trap [16]. Storage of atomic\nions, however, requires substantially different experimen-\n\na)\n\nb)\n\nRF\n\nRF\n\nControl\n\nIons\n\ny\n\nControl\n\nz\n\nx\n\nFIG. 1: (a) Standard linear RF Paul trap; (b) Surfaceelectrode geometry where all electrodes reside in a single\nplane, with the ions trapped above this plane.\n\ntal parameters. In this letter we report the first demonstration of stable confinement of atomic ions in a surfaceelectrode trap. The trap is constructed with standard\nand scalable microfabrication processes. We load 24 Mg+\ninto this trap, measure the motional frequencies of the\nions, and find reasonable agreement with those determined from simulations. We also approximately determine a motional heating rate of the ion(s) that is low\nenough to allow for high fidelity logic operations.\nThe standard linear radio-frequency (RF) Paul\ntrap [17] consists of four parallel rods whose centers\nare located on the vertices of a square (Fig. 1a). An\nRF potential is applied to two opposing rods with the\nother two (control electrode) rods held at RF ground.\nThis configuration creates a nearly harmonic ponderomotive pseudopotential in the x̂-ŷ plane. Longitudinal\nconfinement for a single trapping zone is obtained by\nsegmenting each control electrode along its length and\napplying appropriate static potentials to the different\nsegments. Several variations on this design have been\ndemonstrated [8, 9, 10, 11, 12], but it is very desirable\nto simplify their construction. A straightforward way\nto modify the 3-D design of Fig. 1a is to place the four\nrods in a common plane, with alternating RF and control\nelectrodes [13]; one version of this geometry is shown in\nFig. 1b. In this design, the rods are replaced with flat\n\n\f2\n\na\n\n2 mm\n\nx\nz\n\nLaser beams\nFilter\nCapacitor\n\nMicro-fabricated\nfilter resistor\n\nTrapping region\n\nAtom flux\n\n200μm\n\nControl electrodes\n5\n3\n4\n\n2\n\nb\n\nc\n\n1\nRF electrode\n\nTrap center\n\nFIG. 2: Pictures of the surface-electrode trap. (a) The complete trap structure, including out-lead wires (ribbons) and\nfilter capacitors. The directions of the laser beams (cooling\nand photoionization) and atom flux are indicated. (b) Expanded view of the trap region (center marked by ×). The\ncontrol electrodes are numbered for reference in the text. (c)\nOn-board meander line resistor.\n\nelectrodes, as shown in Fig. 2.\nWe can fabricate this electrode structure by means\nof photolithography and metal deposition using evaporation and electrodeposition. For the substrate we use\npolished fused quartz, a material with low RF loss. A\n0.030 μm titanium adhesion layer and a 0.100 μm copper seed layer are first evaporatively deposited onto the\nsubstrate. This deposition is uniform except for small\nareas for resistors where the quartz is left exposed. Resistors (∼1 kΩ) and leads are fabricated through a liftoff\nprocess that entails patterning them with standard photolithography and evaporation of a 0.013 μm titanium\nadhesion layer followed by 0.300 μm of gold. Resistors\nare fabricated directly on the quartz substrate; leads are\nfabricated on top of the copper seed layer. The gold electrodes near the trapping region are electroplated onto the\ncopper seed layer after a second photolithographic patterning step. Afterward, the exposed initial seed and\nadhesion layers are etched away to isolate electrodes and\nleads. The trap electrodes are plated to a thickness of ∼\n6 μm so that the ratio of height to inter-electrode spacing\nis relatively high (the inter-electrode spacing is ∼ 8 μm).\nThis should reduce alteration of the trapping potential\ndue to stray charges that may collect on the exposed insulator between electrodes.\nWe create ions in the trap by photoionizing thermally\nevaporated neutral magnesium atoms. The magnesium\nsource is realized by resistively heating a stainless steel\ntube containing solid magnesium, which is sealed at both\nends and has a small slit from which evaporated magnesium atoms emerge. With a planar electrode geometry,\n\nthere is a risk of shorting electrodes to each other due\nto magnesium deposited onto the trap structure. To reduce this risk, in a last processing step we perform a\ncontrolled hydrofluoric acid (HF) etch of the central trap\nregion. The HF etches away a small part of the titanium\nadhesion layer and the substrate, without affecting the\nelectrodes. The result is a ∼ 2 μm horizontal undercut\nof the electrodes to help prevent shorting due to deposition from the magnesium source. As a further precaution,\nwe direct the magnesium flux nearly parallel to the surface and avoid as much as possible having the channels\nbetween electrodes be parallel to the flux (Fig. 2).\nWe use five independent control electrodes to provide\nsufficient degrees of freedom to be able to overlap the\nelectric field null point of the static potential and the RF\npseudopotential minimum. We create a low impedance\npath for the RF to ground on the control electrodes with\ncapacitors (820 pF) that are surface mounted directly\nonto the chip (in the future, capacitors could be included\nas part of the fabrication process). Gold ribbons for applying the electrode potentials are gap-welded to contact\npads.\nThe trap structure is mounted in a copper tube that\nalso serves as part of an RF transformer [18] and the entire structure is surrounded by a quartz envelope. The\nsystem is baked under vacuum prior to operation to reach\na base pressure below 10−8 Pa with the use of an ion getter pump combined with a titanium sublimation pump.\nAs we describe below, the trap well depth UT for a\nsurface-electrode trap is fairly shallow [13], not much\nabove the mean kinetic energy of the neutral atoms before\nthey are ionized. Nevertheless, we can load 24 Mg+ ions\nefficiently by resonant two-photon photoionization (PI)\nat 285 nm [19]. The PI laser, resonant with the 3s2 1 S0\n↔ 3s3p 1 P1 electric dipole transition in neutral magnesium, co-propagates with a Doppler cooling beam tuned\napproximately 400 MHz below the 3s 2 S1/2 ↔ 3p 2 P1/2\nelectric dipole transition in 24 Mg+ at 280 nm. The laser\nbeams are parallel to the trap surface, and at an angle of\napproximately 45 degrees with respect to the trap ẑ axis\nas shown in Fig. 2a.\nSince the laser beam direction has significant overlap\nwith all principal trap axes, cooling will be efficient in all\ndirections [13]. During loading, both the Doppler cooling and PI beams have 2 mW power and waists of ∼ 40\nμm. The atomic flux of magnesium intersects the laser\nbeams at the trap (Fig. 2a). The cooling beam is applied\ncontinuously, while the PI beam needs to be applied for\nonly a few seconds to create ions in the trap. Ions are\ndetected by observing 3p 2 P1/2 → 3s 2 S1/2 fluorescence\nalong a direction perpendicular to the trap surface with\na CCD camera as in the view of Fig. 2b. Despite the fact\nthat the center of the laser beam is only 40 μm above\nthe surface, which increases the risk of scatter from light\nstriking the trap electrodes, the signal-to-background ratio for scattered light from the ions is greater than 100\n\n\f3\n\nTABLE I: Oscillation frequencies (experimental measurements (Exp.) and simulated values (Sim.)) for three different\npotential configurations explained in the text. The axial frequency is denoted fk , while f⊥1 and f⊥2 are the frequencies\nof the two transverse modes whose axes are indicated by the\ncross in Fig. 3. The uncertainties in the experimental values\nfor the frequencies are approximately 0.10 MHz.\nV5 VRF\n(V) (V)\n5.00 103.5\n2.00 103.5\n5.00 46.2\n\nfk\nf⊥1\nf⊥2\n(MHz) (MHz) (MHz)\n2.83 15.78 17.13\n2.77 15.67 17.21\n1.84 15.87 16.93\n1.75 16.23 16.87\n2.85\n5.28\n8.29\n2.77\n5.05\n8.75\n\nUT\n(meV)\n177± 6\n193± 11\n6± 1\n\n(Exp.)\n(Sim.)\n(Exp.)\n(Sim.)\n(Exp.)\n(Sim.)\n\nx [μm]\n−20\n\n−10\n\n0\n\n10\n\n20\n\n80\n70\n60\n\ny [μm]\n\nwhen the Doppler cooling laser is tuned approximately 20\nMHz (one-half linewidth) below resonance with intensity\nslightly below saturation.\nWe measure the oscillation frequencies for a single ion\nin the trap (equal to the center-of-mass mode frequencies\nfor multiple ions) by applying an oscillating field to a\ncontrol electrode and observing a change in fluorescence\nrate when the frequency of the applied field is equal to one\nof the motional frequencies, thereby heating the ion [18].\nTo excite the axial mode, we apply the oscillating field to\nelectrode 2, while both transverse modes can be excited\nusing electrode 1.\nAs an aid in initially determining the correct operating conditions, trapping potentials are determined using numerical solvers (boundary element method) subject to the constraint that the RF pseudopotential minimum overlaps the null points of the electric field from\nthe static potential, to minimize RF micromotion (see for\nexample [20]). For the experiments described here, the\nstatic potentials on each control electrode, expressed as\na fraction of the potential V5 on electrode 5 (Fig. 2b) are\nV1 = 0.320, V2 = 0.718, V3 = 0.738, and V4 = -0.898.\nThe peak potential amplitude VRF applied to the RF\nelectrode (at a frequency of 87 MHz) is difficult to measure directly. To determine it, we measure the three\nmode frequencies for a fixed RF power and V5 = 5.00\nV. We use the simulations with the measured electrode\ndimensions to extract a best fit value of VRF = 103.5\nV. The consistency between the experimental and simulated frequencies for this fit is shown in Table I. We\nfurther check for consistency by comparing the measured\nand predicted mode frequencies for two other values of\nthe control and RF potentials (also shown in Table I).\nThe value VRF = 46.2 V is determined by scaling the RF\npower delivered to the trap. The agreement between predicted and measured frequencies is within a few percent.\nFinally, we determine numerically the overall potential\ndepth UT in the pseudopotential approximation [21, 22]\nfor the different control and RF potentials (also shown\n\n50\n\nn\n\n|1\n\nn\n\n|2\n\n40\n30\n20\n10\n\nRF\n\n1\n\nRF\n\n3\n\n4\n\nFIG. 3: A transverse cross-section of the simulated trapping potential (both RF pseudopotential and static potentials included) for potentials corresponding to V5 = 5.00 V\nand VRF = 103.5 V (UT = 177 meV). The cross indicates the\ndirections of the normal mode axes n⊥1 and n⊥2 , and the expected position for an ion at the center of the trap in the x̂-ŷ\nplane. The separation between contour lines corresponds to\n5 meV and the colors blue to red correspond to low to high\npotential. The electrodes are depicted to scale in the lower\npart of the figure and labeled as in Fig. 2b.\n\nin Table I). A transverse cross-section (the x̂-ŷ plane\nof Fig. 1b) of the trapping potential for V5 = 5 V and\nVRF = 103.5 V near the central trap region is shown in\nFig. 3.\nIn Fig. 4, we show groups of ions for the VRF = 103.5\nV and V5 = 2.00 V configuration. The separation of\nthe ions is related to the center-of-mass axial oscillation frequency [3], and the horizontal bars indicate the\nexpected ion separations according to the measurement\nof this frequency (1.84 ± 0.10 MHz for this configuration). When the number of ions becomes large enough,\nthe string breaks into a zig-zag configuration (see for example [23]).\nBecause 24 Mg+ lacks hyperfine structure, we cannot\neasily determine heating rates near the quantum limit\n(without applying large magnetic fields) due to poor internal state discrimination [24]. However, an approximate value of the transverse mode heating rate can be determined by observing how long an ion remains trapped\nin a shallow well in the absence of the Doppler cooling\nlight [11]. If we assume the heating rate (the energy\nchange per unit of time) is constant until the ion can\novercome the saddle-point in Fig. 3, we can estimate the\ninitial heating rate as hri ≃ UT /(hτs ihf⊥1 ) quanta per\nsecond, where hτs i is the average survival time of the ion\nin absence of cooling light, h is Planck's constant and f⊥1\nis the smaller of the two transverse mode frequencies.\nTo help ensure that the results are not influenced by\nthe ions thermalizing to the ambient temperature (∼ 300\n\n\f4\nS. S. wishes to thank the Carlsberg Foundation for financial support. This manuscript is a publication of NIST\nand not subject to U. S. copyright.\n\n∗\n†\n\n[1]\n[2]\n[3]\n\nz\nx\n\n2μm\n\nFIG. 4: False-color images of one, two, three, six, and 12\nions loaded into the surface trap (red corresponds to highest fluorescence count rate). The length scale is determined\nfrom a separate image of the electrodes whose dimensions are\nknown. The horizontal bars indicate the separation distance\nbetween the ions as predicted from the measured axial oscillation frequency. The ratio between transverse and axial oscillation frequencies makes it energetically favorable for the 12\nion string to break into a zig-zag shape (see for example [23]).\n\n[4]\n[5]\n[6]\n[7]\n[8]\n\n[9]\n[10]\n\nK ≃ 25 meV) we perform the measurements of hτs i with\na very shallow well depth, UT = 6 ± 1 meV (V5 = 5 V,\nVRF = 46.2 V, and f⊥1 ≃ 5.3 MHz). From these data,\nwe determine hτs i = 53 ± 10 s, and find hri ≃ 5 quanta\nper millisecond.\nJohnson noise in the resistance of the RC filters on the\ncontrol electrodes is a potential source of heating [3], but\nwe theoretically estimate it to contribute only 1 quantum\nper second. Therefore the observed heating is apparently\ndominated by anomalous heating as observed in previous\nexperiments [25]. We note that in presence of Doppler\ncooling light, the lifetime of the ion is several hours (in\nthe trap with UT = 177 meV), presumably limited by\nchemical reactions [26].\nHeating and decoherence rates for small ion traps\nwill be an important issue for future implementations\nof quantum information processing, and will need to be\nmore thoroughly investigated. Therefore, an important\nnext step is to replace the 24 Mg+ with an isotope that\nallows for Raman sideband cooling, such as 25 Mg+ or\n9\nBe+ , and to study heating rates near the ground state\nof motion [24, 25]. A longer-term goal is to design and\nfabricate a surface trap with more complex structures\ninvolving T- or X-junctions with separate memory- and\nprocessing zones.\nWe thank E. Langlois and J. Moreland for advice on\nthe micro-fabrication processes and Y. Le Coq for helpful comments on the manuscript. This work was supported by the Advanced Research and Development Activity (ARDA) under contract MOD-7171.05 and NIST.\n\n[11]\n[12]\n\n[13]\n[14]\n[15]\n[16]\n[17]\n[18]\n[19]\n\n[20]\n[21]\n[22]\n[23]\n[24]\n\nElectronic address: seidelin@boulder.nist.gov\nPresent Address: Los Alamos National Laboratory\nSee for instance http://qist.lanl.gov/qcomp map.shtml.\nDiVinzenco, Fortschr. Phys. 48, 771 (2000).\nD.J. Wineland, C. Monroe, W.M. Itano, D. Leibfried,\nB.E. King, and D.M. Meekhof, J. Res. Nat. Inst. Stand.\nTech. 103, 259 (1998).\nR.G. DeVoe, Phys. Rev. A 58, 910 (1998).\nJ.I. Cirac and P. Zoller, Nature 404, 579 (2000).\nD. Kielpinski, C. Monroe and D.J. Wineland, Nature\n417, 709 (2002).\nL.-M. Duan, B.B. Blinov, D.L. Moehring, and C. Monroe, Quant. Inform. Comp. 4, 165 (2004).\nM.A. Rowe, A. Ben-Kish, B. DeMarco, D. Leibfried, V.\nMeyer, J. Beall, J. Britton, J. Hughes, W.M. Itano, B. Jelenkovic, C. Langer, T. Rosenband, and D.J. Wineland,\nQuant. Inform. Comp. 2, 257 (2002).\nM.D. Barrett, J. Chiaverini, T. Schaetz, J. Britton, W.M.\nItano, J.D. Jost, E. Knill, C. Langer, D. Leibfried, R.\nOzeri, D.J. Wineland, Nature 429, 737 (2004).\nW.K. Hensinger, S. Olmschenk, D. Stick, D. Hucul, M.\nYeo, M. Acton, L. Deslauriers, J. Rabchuk, C. Monroe,\nquant-ph/0508097.\nD. Stick, W.K. Hensinger, S. Olmschenk, M.J. Madsen,\nK. Schwab and C. Monroe, Nature Physics 2, 36 (2006).\nD.J. Wineland, D. Leibfried, M.D. Barrett, A. Ben-Kish,\nJ.C. Bergquist, R.B. Blakestad, J.J. Bollinger, J. Britton,\nJ. Chiaverini, B. DeMarco, D. Hume, W.M. Itano, M.\nJensen, J.D. Jost, E. Knill, J. Koelemeij, C. Langer, W.\nOskay, R. Ozeri, R. Reichle, T. Rosenband, T. Schaetz,\nP.O. Schmidt, S. Seidelin, in Proc. XVII Int. Conf. on\nLaser Spectroscopy, Avemore, Scotland, 2005, ed. by E.\nA. Hinds, A. Ferguson, and E. Riis (World Scientific,\nSingapore, 2005), pp. 393-402 (quant-ph/0508025).\nJ. Chiaverini, R.B. Blakestad, J. Britton, J.D. Jost,\nC. Langer, D. Leibfried, R. Ozeri and D.J. Wineland,\nQuant. Inform. Comp. 5, 419 (2005).\nR. Folman, P. Krüger, J. Schmiedmayer, J. Denschlag\nand C. Henkel, Adv. Atom. Mol. Phys. 48, 263 (2002).\nJ. Kim, S. Pau, Z. Ma, H.R. McLellan, J.V. Gages, A.\nKornblit, and R.E. Slusher, Quant. Inform. Comp. 5, 515\n(2005).\nC.E. Pearson, D.R. Leibrandt, W.S. Bakr, W. J. Mallard,\nK. R. Brown, and I. L. Chuang, quant-ph/0511018.\nW. Paul, Rev. Mod. Phys. 62, 531 (1990).\nS.R. Jefferts, C. Monroe, E.W. Bell, and D.J. Wineland,\nPhys. Rev. A 51, 3112 (1995).\nD.N. Madsen, S. Balslev, M. Drewsen, N. Kjaergaard, Z.\nVidesen and J.W. Thomsen, J. Phys. B: At. Mol. Opt\nPhys. 33, 4981 (2000).\nD.J. Berkeland, J.D. Miller, J.C. Bergquist, W.M. Itano,\nand D.J. Wineland, J. Appl. Phys. 83, 5025 (1998).\nH.G. Dehmelt, Adv. Atom. Mol. Phys. 3, 53 (1967).\nP.K. Ghosh, Ion Traps (Clarendon Press, Oxford, 1995).\nDaniel H.E. Dubin, Phys. Rev. Lett. 71, 2753 (1993).\nC. Monroe, D.M. Meekhof, B.E. King, S.R. Jefferts,\n\n\f5\nW.M. Itano, D.J. Wineland and P. Gould, Phys. Rev.\nLett. 75, 4011 (1995).\n[25] Q.A. Turchette, Kielpinski, B.E. King, D. Leibfried,\nD.M. Meekhof, C.J. Myatt, M.A. Rowe, C.A. Sackett,\nC.S. Wood, W.M. Itano, C. Monroe, and D.J. Wineland,\n\nPhys. Rev. A. 61, 063418 (2000).\n[26] K. Mølhave and M. Drewsen, Phys. Rev. A. 62, 011401\n(2002).\n\n\f"}