{"id": "http://arxiv.org/abs/quant-ph/0311069v1", "guidislink": true, "updated": "2003-11-11T14:49:42Z", "updated_parsed": [2003, 11, 11, 14, 49, 42, 1, 315, 0], "published": "2003-11-11T14:49:42Z", "published_parsed": [2003, 11, 11, 14, 49, 42, 1, 315, 0], "title": "Controlling bi-partite entanglement in multi-qubit systems", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=quant-ph%2F0311037%2Cquant-ph%2F0311191%2Cquant-ph%2F0311007%2Cquant-ph%2F0311085%2Cquant-ph%2F0311134%2Cquant-ph%2F0311020%2Cquant-ph%2F0311174%2Cquant-ph%2F0311153%2Cquant-ph%2F0311173%2Cquant-ph%2F0311093%2Cquant-ph%2F0311011%2Cquant-ph%2F0311010%2Cquant-ph%2F0311106%2Cquant-ph%2F0311094%2Cquant-ph%2F0311160%2Cquant-ph%2F0311084%2Cquant-ph%2F0311150%2Cquant-ph%2F0311098%2Cquant-ph%2F0311087%2Cquant-ph%2F0311044%2Cquant-ph%2F0311069%2Cquant-ph%2F0311029%2Cquant-ph%2F0311024%2Cquant-ph%2F0311171%2Cquant-ph%2F0311077%2Cquant-ph%2F0311109%2Cquant-ph%2F0311182%2Cquant-ph%2F0311125%2Cquant-ph%2F0311167%2Cquant-ph%2F0311061%2Cquant-ph%2F0311015%2Cquant-ph%2F0311035%2Cquant-ph%2F0311192%2Cquant-ph%2F0311095%2Cquant-ph%2F0311195%2Cquant-ph%2F0311164%2Cquant-ph%2F0311120%2Cquant-ph%2F0311083%2Cquant-ph%2F0311042%2Cquant-ph%2F0311059%2Cquant-ph%2F0311073%2Cquant-ph%2F0311136%2Cquant-ph%2F0311162%2Cquant-ph%2F0311176%2Cquant-ph%2F0311161%2Cquant-ph%2F0311118%2Cquant-ph%2F0311074%2Cquant-ph%2F0311086%2Cquant-ph%2F0311154%2Cquant-ph%2F0311103%2Cquant-ph%2F0311130%2Cquant-ph%2F0311105%2Cquant-ph%2F0311067%2Cquant-ph%2F0311054%2Cquant-ph%2F0311138%2Cquant-ph%2F0311033%2Cquant-ph%2F0311169%2Cquant-ph%2F0311031%2Cquant-ph%2F0311064%2Cquant-ph%2F0311057%2Cquant-ph%2F0311019%2Cquant-ph%2F0311187%2Cquant-ph%2F0311025%2Cquant-ph%2F0311041%2Cquant-ph%2F0311066%2Cquant-ph%2F0311197%2Cquant-ph%2F0311184%2Cquant-ph%2F0311198%2Cquant-ph%2F0311075%2Cquant-ph%2F0311148%2Cquant-ph%2F0311127%2Cquant-ph%2F0311046%2Cquant-ph%2F0311101%2Cquant-ph%2F0311196%2Cquant-ph%2F0311131%2Cquant-ph%2F0311183%2Cquant-ph%2F0311026%2Cquant-ph%2F0311112%2Cquant-ph%2F0311194%2Cquant-ph%2F0311052%2Cquant-ph%2F0311021%2Cquant-ph%2F0311121%2Cquant-ph%2F0311155%2Cquant-ph%2F0311038%2Cquant-ph%2F0304161%2Cquant-ph%2F0304015%2Cquant-ph%2F0304158%2Cquant-ph%2F0304103%2Cquant-ph%2F0304028%2Cquant-ph%2F0304130%2Cquant-ph%2F0304066%2Cquant-ph%2F0304099%2Cquant-ph%2F0304027%2Cquant-ph%2F0304033%2Cquant-ph%2F0304016%2Cquant-ph%2F0304128%2Cquant-ph%2F0304167%2Cquant-ph%2F0304174%2Cquant-ph%2F0304017%2Cquant-ph%2F0304159%2Cquant-ph%2F0304142&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Controlling bi-partite entanglement in multi-qubit systems"}, "summary": "Bi-partite entanglement in multi-qubit systems cannot be shared freely. The\nrules of quantum mechanics impose bounds on how multi-qubit systems can be\ncorrelated. In this paper we utilize a concept of entangled graphs with\nweighted edges in order to analyze pure quantum states of multi-qubit systems.\nHere qubits are represented by vertexes of the graph while the presence of\nbi-partite entanglement is represented by an edge between corresponding\nvertexes. The weight of each edge is defined to be the entanglement between the\ntwo qubits connected by the edge, as measured by the concurrence. We prove that\neach entangled graph with entanglement bounded by a specific value of the\nconcurrence can be represented by a pure multi-qubit state. In addition we\npresent a logic network with O(N2) elementary gates that can be used for\npreparation of the weighted entangled graphs of N qubits.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=quant-ph%2F0311037%2Cquant-ph%2F0311191%2Cquant-ph%2F0311007%2Cquant-ph%2F0311085%2Cquant-ph%2F0311134%2Cquant-ph%2F0311020%2Cquant-ph%2F0311174%2Cquant-ph%2F0311153%2Cquant-ph%2F0311173%2Cquant-ph%2F0311093%2Cquant-ph%2F0311011%2Cquant-ph%2F0311010%2Cquant-ph%2F0311106%2Cquant-ph%2F0311094%2Cquant-ph%2F0311160%2Cquant-ph%2F0311084%2Cquant-ph%2F0311150%2Cquant-ph%2F0311098%2Cquant-ph%2F0311087%2Cquant-ph%2F0311044%2Cquant-ph%2F0311069%2Cquant-ph%2F0311029%2Cquant-ph%2F0311024%2Cquant-ph%2F0311171%2Cquant-ph%2F0311077%2Cquant-ph%2F0311109%2Cquant-ph%2F0311182%2Cquant-ph%2F0311125%2Cquant-ph%2F0311167%2Cquant-ph%2F0311061%2Cquant-ph%2F0311015%2Cquant-ph%2F0311035%2Cquant-ph%2F0311192%2Cquant-ph%2F0311095%2Cquant-ph%2F0311195%2Cquant-ph%2F0311164%2Cquant-ph%2F0311120%2Cquant-ph%2F0311083%2Cquant-ph%2F0311042%2Cquant-ph%2F0311059%2Cquant-ph%2F0311073%2Cquant-ph%2F0311136%2Cquant-ph%2F0311162%2Cquant-ph%2F0311176%2Cquant-ph%2F0311161%2Cquant-ph%2F0311118%2Cquant-ph%2F0311074%2Cquant-ph%2F0311086%2Cquant-ph%2F0311154%2Cquant-ph%2F0311103%2Cquant-ph%2F0311130%2Cquant-ph%2F0311105%2Cquant-ph%2F0311067%2Cquant-ph%2F0311054%2Cquant-ph%2F0311138%2Cquant-ph%2F0311033%2Cquant-ph%2F0311169%2Cquant-ph%2F0311031%2Cquant-ph%2F0311064%2Cquant-ph%2F0311057%2Cquant-ph%2F0311019%2Cquant-ph%2F0311187%2Cquant-ph%2F0311025%2Cquant-ph%2F0311041%2Cquant-ph%2F0311066%2Cquant-ph%2F0311197%2Cquant-ph%2F0311184%2Cquant-ph%2F0311198%2Cquant-ph%2F0311075%2Cquant-ph%2F0311148%2Cquant-ph%2F0311127%2Cquant-ph%2F0311046%2Cquant-ph%2F0311101%2Cquant-ph%2F0311196%2Cquant-ph%2F0311131%2Cquant-ph%2F0311183%2Cquant-ph%2F0311026%2Cquant-ph%2F0311112%2Cquant-ph%2F0311194%2Cquant-ph%2F0311052%2Cquant-ph%2F0311021%2Cquant-ph%2F0311121%2Cquant-ph%2F0311155%2Cquant-ph%2F0311038%2Cquant-ph%2F0304161%2Cquant-ph%2F0304015%2Cquant-ph%2F0304158%2Cquant-ph%2F0304103%2Cquant-ph%2F0304028%2Cquant-ph%2F0304130%2Cquant-ph%2F0304066%2Cquant-ph%2F0304099%2Cquant-ph%2F0304027%2Cquant-ph%2F0304033%2Cquant-ph%2F0304016%2Cquant-ph%2F0304128%2Cquant-ph%2F0304167%2Cquant-ph%2F0304174%2Cquant-ph%2F0304017%2Cquant-ph%2F0304159%2Cquant-ph%2F0304142&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Bi-partite entanglement in multi-qubit systems cannot be shared freely. The\nrules of quantum mechanics impose bounds on how multi-qubit systems can be\ncorrelated. In this paper we utilize a concept of entangled graphs with\nweighted edges in order to analyze pure quantum states of multi-qubit systems.\nHere qubits are represented by vertexes of the graph while the presence of\nbi-partite entanglement is represented by an edge between corresponding\nvertexes. The weight of each edge is defined to be the entanglement between the\ntwo qubits connected by the edge, as measured by the concurrence. We prove that\neach entangled graph with entanglement bounded by a specific value of the\nconcurrence can be represented by a pure multi-qubit state. In addition we\npresent a logic network with O(N2) elementary gates that can be used for\npreparation of the weighted entangled graphs of N qubits."}, "authors": ["Martin Plesch", "Jaroslav Novotny", "Zuzana Dzurakova", "Vladimir Buzek"], "author_detail": {"name": "Vladimir Buzek"}, "author": "Vladimir Buzek", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0305-4470/37/5/025", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/quant-ph/0311069v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/quant-ph/0311069v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "20 pages, 3 figures, accepted in J. Phys. A", "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/quant-ph/0311069v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/quant-ph/0311069v1", "journal_reference": "J. Phys. A: Math. Gen. 37 (2004), 1843-1859", "doi": "10.1088/0305-4470/37/5/025", "fulltext": "arXiv:quant-ph/0311069v1 11 Nov 2003\n\nControlling bi-partite entanglement in multi-qubit\nsystems\nMartin Plesch1 , Jaroslav Novotný2 , Zuzana Dzuráková1 ,\nVladimı́r Bužek1,3\n1\n\nResearch Center for Quantum Information, Institute of Physics, Slovak Academy of\nSciences, 845 11 Dúbravská cesta 9, Bratislava, Slovakia\n2\nDepartment of Physics, FJFI ČVUT, Břehová 7,115 19 Praha 1,Czech Republic\n3\nFaculty of Informatics, Masaryk University, Botanická 68a, 602 00 Brno, Czech\nRepublic\nPACS numbers: 03.67.-a, 03.65.Bz, 89.70.+c\nAbstract. Bi-partite entanglement in multi-qubit systems cannot be shared freely.\nThe rules of quantum mechanics impose bounds on how multi-qubit systems can be\ncorrelated. In this paper we utilize a concept of entangled graphs with weighted edges\nin order to analyze pure quantum states of multi-qubit systems. Here qubits are\nrepresented by vertexes of the graph while the presence of bi-partite entanglement\nis represented by an edge between corresponding vertexes. The weight of each edge\nis defined to be the entanglement between the two qubits connected by the edge, as\nmeasured by the concurrence. We prove that each entangled graph with entanglement\nbounded by a specific value of the concurrence can be represented by a pure multi-qubit\nstate. In addition we present a logic network with O(N 2 ) elementary gates that can\nbe used for preparation of the weighted entangled graphs of N qubits.\n\n\fControlling bi-partite entanglement in multi-qubit systems\n\n2\n\n1. Introduction\nMotivated by the seminal paper of Einstein, Podolsky and Rosen (EPR) [1], Schrödinger\nin his paper entitled \"The present situation in quantum mechanics\" [2] has introduced a\nconcept of entanglement. This new type of purely-quantum mechanical correlation has\nbeen introduced to reflect the fact that (according to Schrödinger) \"Maximal knowledge\nof a total system does not necessarily include total knowledge of all its parts, not even\nwhen these are fully separated from each other and at the moment are not influencing\neach other at all.\" Quantum correlations have attracted lot of attention during the\nhistory of quantum mechanics. Bell [3] and Clauser et al. [4] have shown that these\ncorrelations violate inequalities that must be satisfied by any classical local hidden\nvariable model.\nThe complex phenomenon of quantum entanglement has been studied extensively\nin recent years because it represents an essential resource for quantum information\nprocessing (see, e.g. reference [5]). Entanglement between two qubits prepared in both\npure and mixed states is well understood by now. In particular, necessary and sufficient\nconditions for the presence of entanglement in mixed two-qubit states have been derived\n[6, 7] and reliable measures of degree of entanglement have been introduced. Among\nothers, the concurrence as introduced by Wootters et al. [8] is a very useful measure\nof entanglement since it is rather straightforward to calculate and is directly related to\nthe entanglement of formation.\nEntanglement properties in multi-qubit systems are, on the other hand, still\nnot completely revealed. Firstly, intrinsic multi-partite entanglement is of a totally\ndifferent nature then a \"sum\" of bi-partite correlations. Secondly, unlike classical\ncorrelations, bi-partite entanglement cannot be shared freely among many particles [9].\nIn particular, Coffman et al. have derived bounds on bi-partite concurrencies in threequbit systems, which are referred to as CKW (Coffman-Kundu-Wootters) inequalities.\nFurther investigation on entanglement sharing in multi-qubit systems have been reported\nin references [10, 11, 12, 13]. In these papers special states of multi-qubit systems\nthat maximize bi-partite entanglement between selected pairs of qubits in the system\nhave been presented. In addition, intrinsic multi-qubit quantum correlations have been\nanalyzed (see, for instance, references [14, 15]).\nControlling the amount of shared bi-partite entanglement in multi-qubit systems\ncan be used on multi-partite communication protocols such as quantum secret sharing\n[17] or specific multi-user teleportation schemes.\nThe entanglement properties of a multi-qubit system may be represented\nmathematically in several ways. Dür [13], for instance, has introduced entanglement\nmolecules: mathematical objects representing distributions of bi-partite entanglement\nin a multi-qubit system. He has shown that given an entanglement molecule, relevant\nmixed states with the corresponding entanglement properties can be found.\nAn alternative possibility for representing the entanglement relations of a multiqubit system is the application of entangled graphs. The entanglement properties of a\n\n\fControlling bi-partite entanglement in multi-qubit systems\n\n3\n\nsystem with N qubits are represented by a graph of N vertexes. The vertexes refer\nto the qubits, while the edges of the graph represent the presence of entanglement of\nthe corresponding pairs of qubits. It was shown in one of our earlier papers [16] that\nfor every possible graph one can find a pure state, which would be represented by that\ngraph. The amount of pairwise entanglement was however not taken into account.\nIn the present paper we extend the concept of entangled graphs to describe the\namount (degree) of pairwise entanglement in the system as well. Namely, we assign a\nweight to each edge of the graph, which is equal to the amount of the entanglement\nbetween the corresponding pair of qubits. The entanglement is quantified in terms of a\nconcurrence.\nFor a given state of an N qubit system, one can obviously calculate pairwise\nentanglement, thereby constructing the appropriate graph. The inverse problem, i.e.\nfinding a quantum state with entanglement properties represented by a given graph, is\nmore difficult.\nIn Sections 3 and 4 of the paper we will present a complete analysis of existence of\nquantum states of multi-qubit systems with entanglement properties represented by a\ngiven particular graph.\nFor a given graph, many quantum states may be appropriate per se. The graph\nitself is not, for instance, sensitive to local operations on the qubits. On the other hand,\nthere exist graphs for which no suitable state can be found. The reason behind this is\nthat bi-partite entanglement cannot be shared freely: e.g. the CKW inequalities form\nan obstacle. So, for instance, we cannot have an entangled graph of three qubits such\nthat each pair is maximally entangled with the value of concurrence equal to unity. In\nspite of this, a positive statement can be made. We prove in the following, that if an\nadditional criterion is fulfilled, namely that the weight of each edge is bounded from\nabove by a certain value, a pure state corresponding to the given graph can be found.\nThis bound on the weights depends only on the number of qubits in the system. We\nalso propose a constructive method, how to find these states.\nIt is known that an arbitrary quantum state of N qubits can be prepared using a\nsequence of single-qubit and two-qubit operations. These operations can formally be\nrepresented as a quantum logic network. In general one needs to use exponentially many\nresources (counted by the number of elementary gates) to prepare a quantum state of\nN qubits.\nWe will show in Section 5, that for preparing a system of qubits in a state with given\nentanglement properties resulting from our consideration, less resources are needed.\nNamely, a quantum logic network composed of two- and three-qubit gates enables us\nto generate the state in argument. The number of gates building up this network is\nproportional to the number of entangled qubit pairs in the system (i.e. the edges of\nthe graph). In the case of an entangled web for instance (c.f. reference [12]), when\nall vertexes of the graph are connected by edges, the number of gates necessary for a\ngeneration of the state is proportional to N 2 .\n\n\fControlling bi-partite entanglement in multi-qubit systems\n\n4\n\n2. Definitions\n2.1. Concurrence\nIn this paper we will use concurrence as a measure of bi-partite entanglement. This has\nbeen introduced by Wootters et al. [8] in the following way: Let us assume a two-qubit\nsystem prepared in a state described by the density operator ρ. From this operator one\ncan evaluate the so-called spin-flipped operator defined as\nρ̃ = (σy ⊗ σy )ρ∗ (σy ⊗ σy ),\n\n(1)\n\nwhere σy is the Pauli matrix and a star (∗ ) denotes the complex conjugation in the\ncomputational basis. Now we define the matrix\nR = ρρ̃ ,\n\n(2)\n\nand label its eigenvalues (which are all non-negative), in decreasing order λ1 , λ2, λ3 and\nλ4 . The definition of the concurrence is then\n\u001a\n\nC = max 0,\n\nq\n\nλ1 −\n\nq\n\nλ2 −\n\nq\n\nλ3 −\n\nq\n\nλ4\n\n\u001b\n\n.\n\n(3)\n\nThis function also serves as an indicator whether the two-qubit system is separable (in\nthis case C = 0), while for C > 0 it measures the amount of bipartite entanglement\nbetween two qubits with a number between 0 and 1. The larger the value of C the\nstronger the entanglement between two qubits is.\n2.2. Coffman-Kundu-Wootters inequalities\nCoffman et al. [9] have recently studied a set of three qubits, and have proved that\nthe sum of the entanglement measured in terms of the squared concurrence between\nthe qubits 1 and 2 and the qubits 1 and 3 is less than or equal to the entanglement\nbetween qubit 1 and the rest of the system, i.e. the subsystem 23. Specifically, using\nthe bi-partite concurrence (3) the state ̺jk between the qubits j and k we can express\nthe Coffman-Kundu-Wootters (CKW) inequality as\n2\n2\n2\nC12\n+ C13\n≤ C1,(23)\n.\n\n(4)\n\nCoffmann, Kundu and Wootters have conjectured that a similar inequality might hold\nfor an arbitrary number N of qubits prepared in a pure or mixed state. That is, one\nhas\nN\nX\n\nk=1;k6=j\n\n2\n2\n,\nCj,k\n≤ Cj,j\n\n(5)\n\nwhere the sum on the left-hand-side is taken over all qubits except the qubit j, while\n2\ndenotes the concurrence between the qubit j and the rest of the system (denoted\nCj,j\n2\nat the right-hand side of equation 5 is\nas j). The maximal value of the concurrence Cj,j\nequal to unity.\n\n\fControlling bi-partite entanglement in multi-qubit systems\n\n5\n\n2.3. Entangled graphs\nLet us consider a system of N qubits. As already mentioned, we will represent the\nentanglement properties of the system with a weighted graph with N vertexes. Every\nqubit is identified with one of the vertexes, whereas the concurrence between a pair\nof qubits is identified with a weighted edge, connecting relevant vertexes. If a pair of\nqubits is not entangled at all, there is no edge present in the graph between the relevant\nvertexes (thus, the edge with a zero weight is equivalent to no edge). The graph itself is\ndefined by the number of qubits N and a set of real numbers Cij , giving the concurrencies\nbetween relevant pairs of qubits.\n3. Simple examples\nThe simplest example of a multi-qubit system with interesting correlation properties\nwas studied in the work of Koashi et al. [12]. These authors have studied a completely\nsymmetric state of N qubits such that all N(N − 1)/2 pairs of qubits in the system\nare entangled with the same degree of entanglement. It has been shown that a state\nsatisfying this condition is the so-called W -state defined as\n|W i = |N; 1i,\n\n(6)\n\nwhere |N; ki is a totally symmetric state of N qubits, with k qubits in the state |1i and\nall the others in the state |0i. The concurrence in this case takes the value\n2\n(7)\nCmax = ,\nN\nthat is maximal under given conditions.\nOne can easily generalize this example for other completely symmetric\nconfigurations (e.g. for graphs with weights equal on all edges). As proved by Koashi\net al. [12], if the value of concurrence is larger than 2/N [see equation (7)], then the\ndesired state does not exist. If it is smaller than 2/N then a pure state corresponding\nto the desired entangled web reads\n√\n|Ψi = 1 − α2 |N; 0i + α|N; 1i .\nThe desired value of the concurrence C determines the value of a real parameter α which\nreads\ns\n\ns\n\nCN\nC\nα=\n=\n.\n2\nCmax\nA more complicated two-parameter example is the case of a star-shaped entangled\ngraph (see reference [18]). In this graph a given qubit is entangled with all the other\nqubits in the system while no other qubits are entangled between themselves. In\naddition, it is assumed that the strength of the entanglement between the given qubit\nand any other qubit is the same (constant). ‡ In the reference [18] it has been shown,\n‡ This is a special case of o more general graph such that all qubits are entangled (kind of an entangled\nweb [12]), but one qubit (let us denote it as the \"first\" qubit) is entangled with the rest of the qubits\n\n\fControlling bi-partite entanglement in multi-qubit systems\n\n6\n\nthat asymptotically, in the limit of large number of qubits (i.e. N → ∞), one is able to\nfind a state that saturates the CKW inequalities. Thus we are able to find a state for\nevery star-shaped graph in the N → ∞ limit §.\n4. General solution\nAs we have mentioned earlier, it has been conjectured, that all N-qubit states have to\nfulfil the Coffman-Kundu-Wootters (CKW) inequalities (see equation (5)) which in the\ncase when the qubit j is maximally entangled with the rest of the system reads\n∀ j,\n\nX\nk\n\n2\n2\n≤ 1.\nCkj\n≤ Cj,j\n\n(8)\n\nAny violation of this inequality means that the corresponding entangled graph cannot\nbe represented by a quantum-mechanical state. Under the assumption that all\nconcurrencies Ckj in equation (8) are mutually equal, i.e. C ≡ Ckj , we obtain from\nthe CKW inequality the bound\n1\nC≤√\nN\nwhich is definitely not achievable. To see this we remind ourselves, that in the case of the\nentangled web (all qubits are mutually entangled) the maximal value of the concurrence\nis given by equation (7), which represents a bound that is much lower than the bound\nthat follows from the CKW inequality.\nOne may proceed either by deriving tighter CKW-type inequalities that can be\nsaturated by physical states (graphs). Alternatively, one can consider only entangled\ngraphs with specifically bounded weights on their edges. In what follows we will study\nthis second option and will restrict the consideration to those graphs in which the\nconcurrence on every edge is smaller than a certain value. We will prove that there\nexists a nonzero bound on the concurrence such that all graphs with weighted edges\nthat satisfy this additional condition can be realized by pure states.\nThese states are of the form\n|Ψi = α|Ai +\n\nX\n\n{i,j}\n\nγij |Bij i\n\n(9)\n\nwhere\n|Bij i ≡ (|11..0i ..0j ..1i + |00..1i ..1j ..0i) ;\n|Ai ≡ (|00...0i + |11...1i) .\n\n(10)\n(11)\n\nThe real positive coefficients α and γij satisfy a normalization condition\n2α2 + 2\n\nX\n\nγij2 = 1.\n\n(12)\n\n{i,j}\n\nwith the constant concurrence C1 , while other qubits in the system are mutually entangled as well, but\nthe value of the concurrence C2 is different from C1 .\n§ The upper bound for bipartite entanglement given by the CKW inequalities is C ≤ N2 . The upper\nbound for star-shaped graph is Cmax = N2 − δ, where δ ∝ N12 .\n\n\fControlling bi-partite entanglement in multi-qubit systems\n\n7\n\nThe sums in equations (9) and (12) are taken through all pairs i < j, i, j ∈ N (or,\nequivalently, the sums can be extended for all pairs i, j ∈ N with the restriction γij = 0\nfor j ≤ i). The high (permutational) symmetry of the state allows us to calculate\ndirectly the concurrence (for details see Appendix A)\n(\n\nCij = max 2 2αγij −\nwhich is valid under the condition\n√\nα ≥ 2γmax N − 2 ,\n\nX\nk\n\n2\nγki\n−\n\nX\nk\n\n!\n\n)\n\n2\nγkj\n,0 ,\n\n(13)\n\n(14)\n\nwhere γmax = maxi,j (γij ).\nLet us note, that the concurrence between every pair of qubits in this rather complex\nsystem is expressed as an analytic function of input parameters, utilizing just a single\ncondition (14).\nThe set of N (N2−1) non-linear equations (13) connect parameters of the state γij\n(the parameter α is specified by gammas via the normalization condition) with the\nconcurrencies of different pairs of qubits. This set of equations is strongly coupled\nin a sense that in order to calculate one concurrence one needs to use approximately\n2N gammas. The task now is to invert this set of equations, i.e. to find the set\nof equation defining the gammas via the set of concurrencies that are given (these\nconcurrencies do specify the character of the entangled graph). Not for every possible\nchoice of concurrencies there exist parameters γij satisfying the normalization condition\nΣi,j |γij |2 < 1 and the condition (14). The reason is that even though the concurrencies\nunder consideration have to fulfil the CKW inequalities these inequalities are just\nnecessary but sufficient condition for the existence of an entangled graph with weighted\nedges. Hence, it is also an interesting question, for which set of concurrencies one can\nfind solutions of the reversed equations (13).\nWe have found the solution for the parameters γij as functions of the concurrencies\nCij (weights on the edges of the entangled graph) that specify the state (9), providing\nall concurrencies are smaller than a certain maximal value\nCij ≤ Cmax ,\n\n(15)\n\nwhere Cmax is a given constant.k .\nTheorem 1\nEvery entangled graph with weighted edges that is specified by the set of concurrencies\n{Cij }, that fulfil the condition (15), can be represented by a pure state given by\nequation (9)\nThe complete proof of this Theorem can be found in Appendix B. Here we just\nsketch how the relevant parameters γij can be obtained via an iteration algorithm. Let\nus start from a specific state (9) corresponding to the situation when\nCij = Cmax\nk The upper bound for Cmax is obtained from conditions for an iteration procedure as defined in\nAppendix B.\n\n\fControlling bi-partite entanglement in multi-qubit systems\n\n8\n\nfor all i, j and then adjusts iteratively the parameters γij to fit the concurrencies. We\ncan summarize the iteration process as follows:\n• After each step, all concurrencies that are evaluated for the state (9) are greater\nthan or equal to the desired set of concurrencies Cij .\n• After each step, all gammas are smaller than or equal to their values at the previous\nstep; they do not change only if for a specific i, j the relevant concurrence is reached.\n• The iteration limit, when all gammas are zero, leads to zero concurrencies, too.\nTherefore, one has to cross the searched state during the iteration procedure (for a\nfinite precision this stage can be achieved after a finite number of iteration steps)\nThe existence of the state itself is proved by showing, that the iteration process\nhas a proper limit. Also, to ensure the validity of the proposed process, we made a\nbroad numerical test, with varying number of qubits and the strength of entanglement.\nIn all tested examples that satisfied the condition (15), a very rapid convergence was\nobserved, when a precision of about 10−6 of the maximal permitted concurrence was\nachieved after nine to twelve steps (changing all gammas at once).\n5. Preparation of entangled graph with weighted edges\nIn the previous section we have shown that a large class of entangled graphs with\nweighted edges can be represented by a pure state (9). It is well known (see e.g. Ref. [5])\nthat any state of a multi-qubit system can be prepared with the help of a suitable logic\nnetwork. However, in general the number of two-qubit gates in this network increases\nexponentially with the number of qubits.\nIn what follows we present a quantum logic network for preparation of the state\n(9), corresponding to a given weighted entangled graph. This network is very efficient\nin a sense that it uses only a quadratic number of three-partite gates with respect to the\nnumber of qubits (every three-qubit gate can be decomposed in at most eight two-qubit\ngates). Three ancilla qubits are needed for the procedure; these are not entangled with\nthe other ones at the end of the preparation process. This keeps the fidelity of the\npreparation (in the case of error-free gates) perfect.\n5.1. Definitions\nFirstly let us introduce logic gates that will be used in our network. The first gate is\na two-qubit operator, the well-known controlled NOT (cNOT ) gate. In this gate the\nfirst input qubit serves as a control. The NOT operation is applied on the second qubit\nwhen the control qubit is in the state |1i, otherwise the second qubit does not change.\nThe operator which implements this gate acts on the basis vectors of the two qubits\nunder consideration as follows\ncNOT |0ii |0ij = |0ii |0ij\n\ncNOT |0ii |1ij = |0ii |1ij\n\n(16)\n\n\fControlling bi-partite entanglement in multi-qubit systems\n\n9\n\ncNOT |1ii |0ij = |1ii |1ij\n\ncNOT |1ii |1ij = |1ii |0ij ,\nwhere i denotes the control and j the target qubit.\nThe second gate we are going to use is a three-qubit Toffoli gate T with two control\nqubits. In the case that these two control qubits are in the state |11i then the NOT\noperation is applied on the third qubit. In all other cases the Toffoli gate acts as an\nidentity operator.\nThe third gate we will use is also a three-qubit gate, denoted as R (α). Here one\nqubit will serve as a control. When this control qubit is in the state |1i then a specific\n\"rotation\" in the two-dimensional subspace of the Hilbert space of the two target qubits\nwill be applied. This rotation acts on the two target qubits as follows:\n\u0010\n\nR (α) |00i = 1 − (α)2\n\n\u0010\n\n\u00111/2\n\n|00i − α |11i ;\n\nR (α) |11i = α |00i + 1 − (α)2\nR (α) |01i = |01i ;\n\n\u00111/2\n\n(17)\n\n|11i ;\n\nR (α) |10i = |10i ,\n\nwhere α is a parameter of the rotation.\nThe last gate that will be used in our network is a three-qubit gate, which will be\ndenoted by A. Again, one qubit serves as a control. The following transformation is\napplied to the two remaining qubits when the control qubit is in the state |1i:\nA |00i = k+ |00i − k+ |01i − k− |10i + k− |11i ;\n\n(18)\n\nA |01i = k− |00i + k+ |01i − k− |10i + k+ |11i ;\n\nA |10i = k+ |00i + k− |01i + k+ |10i − k− |11i ;\n\nA |11i = − k− |00i − k− |01i + k+ |10i + k+ |11i ,\nq\n\nwhere we have used a short-hand notation k± = 12 1 ± √12 . This operation will be used\nin our network even number of times, so only the effects of the operation A2 will appear\nat the end. The operation A2 acts in a simpler and understandable way\nA2 |00i = − |01i ;\n\n(19)\n\n2\n\nA |01i = |11i ;\n\nA2 |10i = |00i ;\n\nA2 |11i = |10i .\n\n5.2. Initial state of the N qubits\nIn order to prepare an entangled graph with N vertexes, i.e. a specific N-qubit state, we\nwill need three additional ancilla qubits. The ancilla is initially prepared in the product\nstate |1i|0i|0i and is completely factorized from the other, graph qubits. These graph\nstate are initially prepared in the generalized Greenberger-Horne-Zeilinger (GHZ) state\n\n\fControlling bi-partite entanglement in multi-qubit systems\n\n10\n\ni\n\nR(aij)\nij\n\nj\n\nFigure 1. A schematic description of the logic network corresponding to the first stage\nof the preparation procedure. The rotation R(α) is applied on every pair of the target\nqubits (all original qubits, except the ancilla qubits), with α defined by the parameters\nγij that specify the state corresponding to a given entangled graph. During this first\nstage of the preparation procedure approximately N 2 elementary gates are used.\n\n√\n¶(|ΨiI = |1i⊗N − |0i⊗N )/ 2. Thus the input state of the quantum logic network under\nconsideration reads\n1\n|ΨiI |1iN +1 |0iN +2 |0iN +3 = √ (|11...1i − |00...0i) |1iN +1 |0iN +2 |0iN +3 .(20)\n2\nIn what follows we will specify gates in the network with three indices, where the\nfirst index specifies the control qubit (or the first two qubits in the case of the Toffoli\ngate) and remaining index(es) determine(s) the target qubit(s) of the operation. In\naddition, if there will be some action or control applied on the ancillas, we will denote\ntheir relevant indexes as N + i, where i = 1, 2, 3 is the position of the ancilla qubit.\n5.3. The network\nThe action of the network can be divided into two main stages. In the first stage an\nentangled state of the graph qubits and the ancilla is created. This state contains state\nvectors that are essentially the same as those in the desired state (9). In the second\nstage of the preparation procedure the ancilla becomes factorized from the graph, which\nin turn is prepared in the state (9).\nDuring the first stage of the preparation procedure we will apply the rotation R (αij )\nto each pair i 6= j from N target qubits with the control on the first ancilla qubit (see\nFigure 1). After each R (αij )-gate the Toffoli gate with the\n\u0010 \u0011control on i and j qubits acts\non the f irst ancilla qubit. This procedure is repeated N2 -times, for all indices i 6= j.\nDuring each rotation, a fraction (that is specified by the amplitude αij ) of the state\n¶ To generate a √\nGHZ state one can start with a product state of N qubits with the first qubit in the\nstate (|1i − |0i)/ 2 while all other qubits are in the state|0i. Then one applies a cN OT gate to every\nqubit except the first one with the control on the first qubit. So, one needs only N − 1 two-qubit gates\nto prepare the input state.\n\n\fControlling bi-partite entanglement in multi-qubit systems\n\n11\n\nvector (|11...1i − |00...0i) is transformed into the state (|11..0i ..0j ..1i + |00..1i ..1j ..0i),\nwhereas the already transformed part of the state (|11..0k ..0l ..1i + |00..1k ..1l ..0i) is left\nunchanged.\nThus, after a few steps the state given by equation (20) is transformed into\n|Ψi =\n\nX\ng\n\nEij (|11..0i ..0j ..1i + |00..1i ..1j ..0i) |0i |0i |0i\n\n(21)\n\n{i,j}\n\n+ D (|11...1i − |00...0i) |1i |0i |0i ,\n\nwhere the tilde indicates that the sum is taken over all pairs of qubits that have already\nbeen involved in the transformation. The corresponding amplitudes Cij are given by\nthe relation\n\n\n1\n\nX 2\nαij\ng\nEij = √ 1 − 2\nEkl \n2\n{k,l}\n\n2\n\n(22)\n\nand D is given by the normalization condition.\nWe have also to specify the parameters αij for each rotation. These parameters\nare related to amplitudes γij that specify the desired state of the entangled graph given\nby equation (9), which we want to generate. Comparing the states (9) and (22) we\nsee, that for a successful generation of the state of the graph we need Eij = γij . Using\nequation (22) we can write\nαij =\n\n√\n\n\n\n2 1 − 2\n\nX\ng\n\n− 1\n2\n\n2\nγkl\n\n{k,l}\n\nγij .\n\n(23)\n\nAfter performing transformations on all pairs of target qubits the resulting state\nhas the form\n|Ψi =\n\nX\n\n{i,j}\n\nE\n\nγij |Bij i |0i |0i |0i + α A |1i |0i |0i .\n\n(24)\n\nwhere the state vector |Bij i is given by equation (10) and\n|Ai ≡ (|11...1i − |00...0i) .\n\n(25)\n\nWe see that the component states |Bij i and |Ai in equation (24) are essentially the\nsame as those of the desired entangled graph (see equation (9)). Now we will use the\nfirst ancilla qubit the last time before disentangling it from the rest of the system. We\nwill apply the specific controlled rotation on an arbitrary qubit of the graph with the\ncontrol being the first qubit of the ancilla. The rotation itself is described by the operator\n−σz (a Pauli matrix). This controlled rotation applied on the state (24) performs the\ntransformation |Ai → |Ai, while the state |Bij i remains unchanged.\nP\nWe see that at this stage the two desired components α|Ai and γij |Bij i of the\ngraph state (9) are generated, but they are entangled with the first ancilla qubit. The\nsecond stage of the preparation procedure is designed so that the ancilla is disentangled\nfrom the graph, while the graph is left in the state (9). To disentangle the first ancilla\nqubit from the rest of the system we will use the other two ancilla qubits. In order to\n\n\f12\n\n...\n\nControlling bi-partite entanglement in multi-qubit systems\n\nA\n\n...\n\nA\n\nA\n\nA\n\nFigure 2. This part of the network helps to disentangle the ancilla qubits from\nthe original qubits. In this case, the rotation A is applied only in the case, when\ntwo neighboring qubits are not equal. Only N elementary gates, in the order of the\nmagnitude, are used.\n\nperform this disentanglement we have to find a network that will discriminate between\nP\ntwo graph states |Ai and γij |Bij i\nP\nLet us analyze in more detail the state\nγij |Bij i. In this state two or four\nneighboring qubits are in different states. This is in contrary to the state |Ai, in which\nall qubits are in the same state. The discrimination of the two states can so be performed\nby applying the cNOT gate acting always on two neighbouring qubits. If the target is\nin the state |0i then after the action of the cNOT gate the two qubits that are involved\nin the action of the gate are in the same state. On the other hand, if it is |1i, the two\nqubits do differ. From here it follows that we can use the target qubit as a control for\nanother gate, which changes its targets if and only if the two graph qubits do differ.\nLet us utilize for this purpose the gate A which will act on the last two ancillas (see\nFigure 2). We apply the cNOT gate on two qubits from N graph qubits and then we\napply the A-gate controlled by the target of the cNOT , acting on the last two ancillas.\nAfter that, we apply again the cNOT gate on the same two qubits as before: This\noperation will bring all qubits into the original state (since cNOT 2 = I) and the only\neffect of this particular procedure is a rotation of the state of the last two ancillas. This\nrotation will take place only in the case when the two \"tested\" qubits were in a different\nstate.\nThan we repeat the same procedure for each pair of the first N neighboring qubits\nof the graph. After this, the A gate acted either 2 or 4 times on ancilla qubits, that are\nP\nentangled with the state γij |Bij i of the graph. On the other hand those ancillas that\nare entangled with the state |Ai are not changed.\nThe reason for using A-gate, the \"square root\" of the operation (19), now becomes\n\n\f13\n\nControlling bi-partite entanglement in multi-qubit systems\n\n2\n\n»N gates\n\n»N gates\n\nY\n\nR\ns\n1\n0\n\n...\n\nY initial\n\nA\n\nA\n\n0\n\n-1\n\n1\n0\n0\n\nFigure 3. A schematic description of the entire logic network for the preparation of\nthe entangled graph in the state (9). First we use the part with the rotation R(α), then\nwe correct a sign with the help of a cN OT gate. Finally, we disentangle the ancilla\nqubits with the help of the A and A−1 rotations. The desired state is prepared with\nthe help of (of the order of magnitude) N 2 elementary gates.\n\nclear: the A2 gate is acting once or twice and the state |0i |0i of the last two ancillas is\nchanged either to − |0i |1i or to |1i |1i. On the other hand in the case when all target\nqubits are equal, A will not act at all and the resulting state of the last two ancillas will\nbe unchanged, thus |0i |0i. If the cNOT gate between the last (control) and the first\n(target) ancilla qubit is applied, then the first ancilla will be changed to the state |0i\nand it becomes disentangled from the rest of the system. Now all the work is almost\ndone, the only thing we have to do is to disentangle the two remaining ancilla qubits.\nFor this we will simply run the procedure for all neighboring pairs of qubits as described\nabove, but with the gate A−1 instead of the gate A. This will change the state of the\nlast two ancilla qubits back to the original state |0i |0i and will finally disentangle the\nancilla from the system. That means that the desired state |Ψi of the N graph qubits\nis disentangled from the ancilla and the entangled graph is prepared in the state (9).\nFinally, let us summarize the preparation procedure for the entangled graph given\nby the state (9). As shown in Figure 3, first we apply the rotations R on all pairs of\nqubits of the graph, i.e.\nG1 = (cσz )N +1,N\n\nY\u0010\n\ni6=j\n\n\u0011\n\nTi,j,N +1R (αij )N +1,i,j ,\n\n(26)\n\nwhere the subscripts for each operation define the position of qubits, where operation\ntakes its action. Angles of rotations αij are defined by equation (23) and cσz stands for\nthe controlled sigma gate applied on the first ancilla as a control and one of the graph\n\nfinal\n\n\f14\n\nControlling bi-partite entanglement in multi-qubit systems\n\nqubits as a target. At this stage we will use roughly N 2 bipartite gates. The second\nstage of the preparation corresponds to disentangling the first ancilla qubit from the\ngraph qubits\nG2 = cNOTN +3,N +1\n\nN\nY\n\n(cNOTi,i+1Ai+1,N +2,N +3 cNOTi,i+1 ) .\n\n(27)\n\ni,i+1\n\nThe last stage of the preparation process is responsible for disentanglement of the last\ntwo ancilla qubits from the graph qubits, i.e.\nG3 =\n\nN \u0010\nY\n\n\u0011\n\ncNOTi,i+1 A−1 i+1,N +2,N +3 cNOTi,i+1 .\n\ni,i+1\n\n(28)\n\nIn the last two equations the indices i + 1 for the gates are taken implicitly as modulo\nN. Finally we can represent the action of the whole logic network as\n|ΨiF |1iN +1|0iN +2 |0iN +3 = G3 .G2 .G1 .|ΨiI |1iN +1 |0iN +2 |0iN +3,\n\n(29)\n\nwhere |ΨiF is the desired state (9) of the entangled graph with weighted edges.\n6. Conclusion\nIn this paper, we have introduced a concept of entangled graphs with weighted edges.\nUsing simple examples we have shown, that sharing of bipartite entanglement is a\ncomplicated phenomenon and that the Coffman-Kundu-Wootters inequalities [9] are\nonly a necessary condition for an existence of states with given entanglement properties.\nWe have proved that a whole class of entangled graphs, where the concurrence\nbetween an arbitrary pair of qubits (vertexes) is weaker than a certain value can be\nrealized by a state of N qubits. Moreover, we have proposed a logic network for\npreparation of the states corresponding to this entangled graphs. The network is\ncomposed of a number of elementary quantum gates that grows quadratically with the\nnumber of vertexes (qubits) in the graph.\nAcknowledgments\nThis work was supported by the IST-FET-QIPC project QUPRODIS.\nAppendix A. Concurrence in entangled graphs\nIn what follows we will evaluate the concurrence between an arbitrary pair of qubits of\na system in the state (9), i.e.\n|Ψi = α (|00...00i + |11...11i)+\n\nX\n\n{i,j}\n\n\u0010\n\nγij |11iij |00...00iij + |00iij |11...11iij\n\n\u0011\n\nwhere real positive amplitudes α and γij satisfy the normalization condition\n2α2 + 2\n\nX\n\n{i,j}\n\nγij2 = 1.\n\n(A.2)\n\n, (A.1)\n\n\f15\n\nControlling bi-partite entanglement in multi-qubit systems\n\nThe sum in equations (A.1) and (A.2) is taken through all pairs i 6= j, i, j ∈ N̂ , so\n{i, j} = {j, i} and thus γij = 0 for i < j. The special form of the state (A.1) leads to a\nrather compact density matrix for an arbitrary two-qubit operator that is obtained by\ntracing over the rest of the graph qubits:\n\n\nA 0 0 F\n0 B E 0\n0 E B 0\nF 0 0 A\n\n\n\n\nρij = \n\n\n\nwhere we have used the notation\nA = γij2 + α2 +\nB=\n\nX\u0010\n\nX\n\nX\n\n\n\n\n\n\n\n,\n\n(A.3)\n\n2\nγkl\n;\n\n(A.4)\n\n{k,l}\n\n\u0011\n\n2\n2\n;\nγkj\n+ γki\n\nk\n\nE=2\n\n\n\nγki γjk ;\n\nk\n\nF = 2αγij .\nAll sums in equations (A.4) are running through free parameter(s) k (and l), whereas\ni and j denote a specific pair of qubits in the graph. In addition, the condition\ni 6= k 6= l 6= j has to be fulfilled.\nThe convenient form of the matrix (A.3) allows us to calculate square roots of the\neigenvalues of the matrix R given by equation (2):\nλ1 = A + F ;\n\n(A.5)\n\nλ2 = A − F ;\n\nλ3 = B + E ;\nλ4 = B − E .\n\nBecause the coefficients A, B, E, F are positive, the only candidates for the largest\neigenvalue are λ1 and λ3 . Let us further define\nγmax = max(γij ) .\n\n(A.6)\n\ni,j\n\nUsing the condition\n\n√\nα ≥ 2γmax N − 2\n\n(A.7)\n\nwe find λ1 ≥ λ3 and the general expression for the concurrence associated with edges of\nthe entangled graph prepared in the state (A.1) reads\nCij =\n\n \n\nmax 22αγij\n\n\n−\n\nX\n\n{k,i}\n\n2\nγki\n−\n\nX\n\n{k,j}\n\n\n\n\n\n\n2 \nγkj\n,0 .\n\n\n\n(A.8)\n\n\fControlling bi-partite entanglement in multi-qubit systems\n\n16\n\nAppendix B. Proof of Theorem 1: Iterative procedure\nIn order to prove Theorem 1 we first label the set of concurrencies that determine a\ngiven entangled graph by Cij . We will use a bold C in order to distinguish these\nconcurrencies from any intermediate concurrencies, obtained by searching for the state\nof the entangled graph.\nWe will start the iteration procedure with an initial state of the entangled graph\ngiven by equation (9). The amplitudes γij are specified by the relation\nλ\n(0)\n,\nγij ≡ q\n2 + N(N − 1)λ2\n\n(B.1)\n\nthat is, the initial state is completely permutationally symmetric. The parameter λ is\ndefined as\nλ=\n\nq\n\n4(N − 2)2 + 2N(N − 1) − 2(N − 2))\nN(N − 1)\n\n.\n\n(B.2)\n\nThe corresponding bi-partite concurrencies can be evaluated straightforwardly and they\nread:\n\u0010\n\n(0)\n\n(0)\n\n(0)\n\nCij = Cmax = 2 α(0) γij − 2(N − 2)(γij )2\n√\n6N 2 − 18N + 16 − 2N + 4\n=\n.\nN(N − 1)\n\n\u0011\n\n(B.3)\n\n(0)\n\nWe remind ourselves that the parameters α(0) and γij are mutually related via the\nnormalization condition (12), therefore α is always implicitly defined by γij . It is also\nclear that for the state under consideration the condition (14) is fulfilled as well.\nBefore we describe the iteration procedure itself we introduce the following notation:\nwe enumerate all pairs of qubits in the entangled graph. All pairs of qubits (i.e. the\nedges of the graph) are listed in the set of pairs just once. At each iteration step one\nparameter γkl for a selected pair of indices {k, l} is changed, whereas all others gammas\nwill stay unchanged. Let us now suppose, that the n-th step of the iteration is done and\n(n)\nboth conditions (15) and (14) are still fulfilled. Moreover α(n) ,γij are positive. Hence\nwe find\n(n)\n\nCij ≥ Cij ;\n√\n(n)\n;\nα(n) ≥ 2 N − 2γmax\n\n(B.4)\n(B.5)\n(n)\n\n0 < α(n) ≤ 1\n\n0 ≤ γij < 1 ,\n\n(B.6)\n\n(n)\nfor all pairs of indices i,j. The parameter γmax\nis defined in the same way as in\nequation (A.6), i.e.\n(n)\n\n(n)\nγmax\n= max(γij ).\ni,j\n\n(B.7)\n\nIn the next iteration step we take a pair of qubits (i.e., the edge), that follows after\nthe pair, which was selected in the previous iteration step n. Let us denote this pair with\n\n\f17\n\nControlling bi-partite entanglement in multi-qubit systems\n\nindices {i, j}. Then, in the (n + 1) − st iteration step, we will change the parameters of\nthe state in a following way:\nU (n) − V (n)\n(n+1)\n;\n(B.8)\nγij\n=\n2\nU (n) + V (n)\nα(n+1) =\n,\n(B.9)\n2\nwhere\n\u0014\n\u00151/2\n1\n(n)\n(n)\nU (n) = (α(n) + γij )2 + (Cij − Cij )\n;\n(B.10)\n2\n\u0014\n\n\u0015\n\n1/2\n1\n(n)\n.\n(B.11)\nV\n= (α −\n− (Cij − Cij )\n2\nAll other gammas remain unchanged at this iteration step. Following the conditions\n(B.4) and (B.5) this iteration step is well defined. Now we will discuss several important\nproperties of the iteration process:\n(n)\n\n(n)\nγij )2\n\n(n)\n\n(n+1)\n\n(1) α(n+1) and γij\n\nare solutions of the equation\n\u0011\n1\u0010\n(n)\n(n+1)\n(n)\nCij − Cij\n= α(n) γij +\nα(n+1) γij\n4\nand thus according to equation (13)\n(n+1)\n\nCij\n\n(2) α(n+1) and\n(3)\n\n(n+1)\nγij\n\n(n+1)\nγij\n\n \n\n(n+1)\nmax 22α(n+1) γij\n\n\n=\n\n−\n\n= max {Cij , 0} = Cij .\n\nX\n\n(B.12)\n\n(n+1) 2\n\n(γki\n\n) −\n\n{k,i}\n\nX\n\n(n+1) 2 \n\n(γkj\n\n{k,j}\n\n\n\n)\n\n\n\n\n,0\n\n\n\n(B.13)\n\nfulfil the normalization condition (12).\n\nand α(n+1) are positive and satisfy the relations\n0\n\n(n+1)\n\n≤ γij\n\n(n)\n\n< γij ;\n\n(B.14)\n\nα(n) < α(n+1) ≤ 1.\n\n(B.15)\n\n(4) From equations (B.14) and (B.15) it follows that\n√\n√\n(n)\n(n+1)\n≥ 2 N − 2γmax\n.\nα(n+1) > α(n) ≥ 2 N − 2γmax\n\n(B.16)\n\nTherefore the condition (B.5) is valid also for the (n + 1) − st iteration step.\n\n(5) Let us now show, how will particular concurrencies change in this single iteration\nstep. For k, l 6= i, j we find\n(n+1)\nCkl\n\n=\n=\n>\n=\n\n\n\n(n+1)\n2 2α(n+1) γkl\n\n\n\n(n)\n2 2α(n+1) γkl\n\n\n\n(n)\n2 2α(n) γkl\n(n)\nCkl\n\n−\n\n−\n\n−\n\nX \u0010\n\n{k,m}\n\n\u0011\n(n+1) 2\nγkm\n\nX \u0010\n\n{k,m}\n\nX \u0010\n\n{k,m}\n\n\u0011\n(n) 2\nγkm\n\n\u0011\n(n) 2\nγkm\n\n−\n\n−\n\n−\n\nX \u0010\n\n{l,m}\n\nX \u0010\n\n{l,m}\n\nX \u0010\n\n{l,m}\n\n\n\n\u0011\n(n+1) 2 \nγlm\n\n\n\u0011\n(n) 2\nγlm \n\n\n\u0011\n(n) 2\nγlm \n\n(B.17)\n\n\f18\n\nControlling bi-partite entanglement in multi-qubit systems\nand for k = i\n(n+1)\n\nCil\n\n\n\n(n+1)\n\n= 2 2α(n+1) γil\n\n\n(n)\n\n= 2 2α(n+1) γil −\n>\n=\n\n\n\n(n)\n2 2α(n) γkl\n(n)\nCil .\n\n−\n\n−\n\nX \u0010\n\n(n+1)\n\nγim\n\n{i,m}\n\nX \u0010\n\n(n+1)\n\nγim\n\n{i,m}\n\nX \u0010\n\n{i,m}\n\n\u0011\n(n) 2\nγim\n\n\u00112\n\n−\n\n\u00112\n\n−\n\n−\n\nX \u0010\n\n{l,m}\n\nX \u0010\n\n(n)\n\nγlm\n\n{l,m}\n\nX \u0010\n\n{l,m}\n\n(n+1)\n\nγlm\n\n\n\n\u0011\n(n) 2\nγlm \n\n\u00112\n\n\n\n\u00112\n\n\n\n\n(B.18)\n\n\n\nThe same is valid also for k = j.\nThus we have shown, that after this iteration step the concurrence for fixed i, j (i.e.\n(n+1)\nfor the given edge) will be Cij\n= Cij and all other concurrencies of the entangled\n(n+1)\ngraph will become larger. Thus, the condition for all i, j Cij\n≥ Cij will be fulfilled.\n(n+1)\nTherefore, the state defined by equation (9) with the parameters γij\ncan be used for\nthe next (n + 2)-nd iteration step.\nTherefore,nthe whole\niteration\nois well defined and we will obtain an infinite sequence\nn\no∞\n(n) ∞\n(n)\nand γij\nfor each pair of indices i,j (i.e. for each edge of\nof parameters α\nn=0\nn=0\nthe entangled graph). All sequences are monotonous and are bounded, and therefore\nthey have proper limits. Let us denote these limits as α and γij\nα = lim α(n)\nn→∞\n\n(n)\n\nγij = lim γij\nn→∞\n\n⇒\n\nα ∈ (0, 1i\n\n(B.19)\n\n⇒\n\nγij ∈ h0, 1).\n\n(B.20)\n\nNow we will choose and fix one pair of indices i,j and we will show, that\n(n)\n\nlim Cij = Cij .\n\n(B.21)\n\nn→∞\n\nFirst we define a sequence {k(n)}∞\nn=0 in a following way: k(1) = p, where p is a rank of\n{i, j} in the order of pairs of indices, and k(n) = p + nN (N2 −1) . Then\n(k(n))\n\nCij\n\n= Cij .\n\nThe equation (B.21) is equivalent to the definition\n\n(B.22)\n\u0010\n\n(n)\n\n\u0011\n\n(∀ ε ∈ R, ε > 0) (∃n0 ∈ N) (∀ n ∈ N, n > n0 ) |Cij − Cij | < ε .\n\n(B.23)\n\nLet us choose and fix the small parameter\nn0 , that will have the\nn to find\no\no∞ task is\nn ε. Our\n(n) ∞\n(n)\nand γkl\nproperty (B.23). Because all sequences α\nhave a proper limit,\nn=0\nn=0\nthey are Cauchy sequences and therefore\n(∀ τ ∈ R, τ > 0) (∃m0 ∈ N) (∀ n, m ∈ N, n, m > m0 ) (∀{k, l})\nwhere\nτ=\n\nε\n.\n4N(N − 1)\n\n|α(n) − α(m) | < τ\n(n)\n(m)\n|γkl − γkl | < τ\n(B.25)\n\n!\n\n, (B.24)\n\n\f19\n\nControlling bi-partite entanglement in multi-qubit systems\n\nFor this τ there exists such m0 , that the property (B.24) is fulfilled and we can define\nn0 as\nn0 ≡ k(m0 ) > m0\n\n(B.26)\n(n+1)\n\n(n)\n\nFurther we will calculate the difference |Cij\n− Cij | for n + 1 > n0 and\n∞\nn+1 ∈\n/ {k(n)}n=0 . The last condition means, that the (n + 1) − st iteration step\n(n)\ndidn't change γij . From equations (B.17) and (B.18) we obtain two options for the\ndifference under consideration, either\n(n)\n\n(n)\n\n(n+1)\n\n− Cij\n\n(n+1)\n\n− Cij | = 4(α(n+1) − α(n) )γij − 2(γil\n\nCij\n\n= 4 α(n+1) − α(n) γij\n\n< 4τ < 8τ ,\n\n(B.27)\n\nor\n|Cij\n\n(n)\n\n(n+1) 2\n\n(n)\n\n(n+1)\n\n(n)\n\n< 4 α(n+1) − α(n) γij\n\n(n)\n\n) + 2(γil )2\n\n+ 2 γil\n\n< 8τ,\n\n(n)\n\n− γil\n\n(n+1)\n\nγil\n\n(n)\n\n+ γil\n\n(n)\n\nwhere γil is the parameter, which was changed in the (n + 1) − st iteration step.\n(n)\nFinally, we can say for n > n0 , if n ∈ {k(n)}∞\nn=0 , then |Cij − Cij | = 0. In the\nopposite case there exists such u ∈ N0 , that\nn ∈ hk(m0 + u), k(m0 + u + 1)i.\n\n(B.28)\n\nThus\n(n)\n\n(n)\n\n(n−1)\n\nCij − Cij = (Cij − Cij\n<\n\n(n−1)\n\n− Cij\n\n(k(m0 +u))\n\n) + * * * + (Cij\n|\n\n8N(N − 1)τ\n= ε.\n2\n\nBut then it must stand\n\n\n\n(n)\n(n)\nCij = lim Cij = lim 22α(n) γij −\nn→∞\n\n(n−2)\n\n) + (Cij\n\nn→∞\n\n\n\n= 22αγij −\n\nX\n\n{k,i}\n\nX\n\n{k,i}\n\n2\nγki\n−\n\n(n)\n\n(γki )2 −\n\nX\n\n{k,j}\n\n\n\nX\n\n(n)\n\n{z\n\n− Cij )\n\n=0\n\n\n\n(γkj )2 \n\n{k,j}\n\n2 \nγkj\n.\n\nAll other conditions remain fulfilled in the limit form as well. Because this property is\nvalid for all pairs of indices, we have found the parameters γij , that define the state (9)\nwhich corresponds to a given entangled graph.\n[1]\n[2]\n[3]\n[4]\n[5]\n\nA. Einstein, B. Podolski, and N. Rosen, Phys. Rev. 47, 777 (1935).\nE. Schrödinger, Naturwissenschaften 23, 844 (1935).\nJ.S. Bell, Physics 1, 195 (1964).\nJ. Clauser, M. Horne, A. Shimony, and R. Holt, Phys. Rev. Lett. 23, 880 (1969).\nM.A. Nielsen and I.L. Chuang, Quantum Computation and Qantum Information (Cambridge\nUniversity Press, Cambridge, 2000).\n[6] A. Peres, Phys. Rev. Lett. 77, 4524 (1996).\n[7] M. Horodecki, P. Horodecki, and R. Horodecki, Phys. Lett. A 223, 1 (1996).\n\n}\n\n\fControlling bi-partite entanglement in multi-qubit systems\n[8] S. Hill, W.K. Wootters, Phys. Rev. Lett. 78, 5022 (1997);\nW.K. Wootters, Phys. Rev. Lett. 80, 2245 (1998)\n[9] V. Coffman, J. Kundu, W. K. Wootters, Phys. Rev. A 61, 052306 (2000)\n[10] W.K. Wootters, Contemporary Mathematics 305, 299 (2002)\n[11] K.M. O'Connor and W.K. Wootters, Phys. Rev. A 63, 052302 (2001).\n[12] M. Koashi, V. Bužek, N. Imoto, Phys. Rev. A 62, 050302 (2000)\n[13] W. Dür, Phys. Rev. A 63, 020303(R) (2001)\n[14] A. Miyake, Phys. Rev. A 67, 012108 (2003)\n[15] P.J. Lin-Chung, quant-ph 0301083\n[16] M. Plesch, V. Bužek, Phys. Rev. A 67, 012322 (2003)\n[17] M. Hillery, V. Bužek, and A. Berthiaume , Phys. Rev. A 59, 1829 (1999).\n[18] M. Plesch, V. Bužek, Quantum Information and Computation 2, 530 (2002)\n\n20\n\n\f"}