{"id": "http://arxiv.org/abs/quant-ph/0203069v2", "guidislink": true, "updated": "2002-08-02T09:10:29Z", "updated_parsed": [2002, 8, 2, 9, 10, 29, 4, 214, 0], "published": "2002-03-15T13:01:50Z", "published_parsed": [2002, 3, 15, 13, 1, 50, 4, 74, 0], "title": "Quantum Theory of Feedback of Bosonic Gases", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=quant-ph%2F0203107%2Cquant-ph%2F0203085%2Cquant-ph%2F0203127%2Cquant-ph%2F0203083%2Cquant-ph%2F0203064%2Cquant-ph%2F0203132%2Cquant-ph%2F0203011%2Cquant-ph%2F0203042%2Cquant-ph%2F0203072%2Cquant-ph%2F0203063%2Cquant-ph%2F0203026%2Cquant-ph%2F0203130%2Cquant-ph%2F0203071%2Cquant-ph%2F0203067%2Cquant-ph%2F0203151%2Cquant-ph%2F0203055%2Cquant-ph%2F0203007%2Cquant-ph%2F0203056%2Cquant-ph%2F0203030%2Cquant-ph%2F0203079%2Cquant-ph%2F0203060%2Cquant-ph%2F0203150%2Cquant-ph%2F0203093%2Cquant-ph%2F0203105%2Cquant-ph%2F0203069%2Cquant-ph%2F0203003%2Cquant-ph%2F0203100%2Cquant-ph%2F0203005%2Cquant-ph%2F0203092%2Cquant-ph%2F0203143%2Cquant-ph%2F0203053%2Cquant-ph%2F0203140%2Cquant-ph%2F0203002%2Cquant-ph%2F0203111%2Cquant-ph%2F0203025%2Cquant-ph%2F0203077%2Cquant-ph%2F0203044%2Cquant-ph%2F0203018%2Cquant-ph%2F0203058%2Cquant-ph%2F0203090%2Cquant-ph%2F0203120%2Cquant-ph%2F0203033%2Cquant-ph%2F0203125%2Cquant-ph%2F0203080%2Cquant-ph%2F0203112%2Cquant-ph%2F0203097%2Cquant-ph%2F0203121%2Cquant-ph%2F0203035%2Cquant-ph%2F0203041%2Cquant-ph%2F0203144%2Cquant-ph%2F0203084%2Cquant-ph%2F0203019%2Cquant-ph%2F0203124%2Cquant-ph%2F0203108%2Cquant-ph%2F0203010%2Cquant-ph%2F0203049%2Cquant-ph%2F0203126%2Cquant-ph%2F0203133%2Cquant-ph%2F0203116%2Cquant-ph%2F0203141%2Cquant-ph%2F0203008%2Cquant-ph%2F0203146%2Cquant-ph%2F0203082%2Cquant-ph%2F0203015%2Cquant-ph%2F0203113%2Cquant-ph%2F0203051%2Cquant-ph%2F0203061%2Cquant-ph%2F0203152%2Cquant-ph%2F0203054%2Cquant-ph%2F0203029%2Cquant-ph%2F0203149%2Cquant-ph%2F0203066%2Cquant-ph%2F0203045%2Cquant-ph%2F0203046%2Cquant-ph%2F0203139%2Cquant-ph%2F0203052%2Cquant-ph%2F0203006%2Cquant-ph%2F0203009%2Cquant-ph%2F0203099%2Cquant-ph%2F0203148%2Cquant-ph%2F0203028%2Cquant-ph%2F0203098%2Cquant-ph%2F0203057%2Cquant-ph%2F0203135%2Cquant-ph%2F0203129%2Cquant-ph%2F0203043%2Cquant-ph%2F0203142%2Cquant-ph%2F0203089%2Cquant-ph%2F0203020%2Cquant-ph%2F0203048%2Cquant-ph%2F0203021%2Cquant-ph%2F0203106%2Cquant-ph%2F0203118%2Cquant-ph%2F0203117%2Cquant-ph%2F0203096%2Cquant-ph%2F0203014%2Cquant-ph%2F0203027%2Cquant-ph%2F0203138%2Cquant-ph%2F0203119%2Cquant-ph%2F0203013%2Cquant-ph%2F0203086&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Quantum Theory of Feedback of Bosonic Gases"}, "summary": "A quantum theory of feedback of bosonic many-atom systems is formulated. The\nfeedback-induced many-atom correlations are treated by use of a parameterized\ncorrelation function, for which closed equations of motion are derived.\nTherefrom the dynamics of any additive property of the system, i.e., properties\nderived from the reduced single-atom density operator, can be obtained. An\nexample is given that indicates the correlation effects of feedback.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=quant-ph%2F0203107%2Cquant-ph%2F0203085%2Cquant-ph%2F0203127%2Cquant-ph%2F0203083%2Cquant-ph%2F0203064%2Cquant-ph%2F0203132%2Cquant-ph%2F0203011%2Cquant-ph%2F0203042%2Cquant-ph%2F0203072%2Cquant-ph%2F0203063%2Cquant-ph%2F0203026%2Cquant-ph%2F0203130%2Cquant-ph%2F0203071%2Cquant-ph%2F0203067%2Cquant-ph%2F0203151%2Cquant-ph%2F0203055%2Cquant-ph%2F0203007%2Cquant-ph%2F0203056%2Cquant-ph%2F0203030%2Cquant-ph%2F0203079%2Cquant-ph%2F0203060%2Cquant-ph%2F0203150%2Cquant-ph%2F0203093%2Cquant-ph%2F0203105%2Cquant-ph%2F0203069%2Cquant-ph%2F0203003%2Cquant-ph%2F0203100%2Cquant-ph%2F0203005%2Cquant-ph%2F0203092%2Cquant-ph%2F0203143%2Cquant-ph%2F0203053%2Cquant-ph%2F0203140%2Cquant-ph%2F0203002%2Cquant-ph%2F0203111%2Cquant-ph%2F0203025%2Cquant-ph%2F0203077%2Cquant-ph%2F0203044%2Cquant-ph%2F0203018%2Cquant-ph%2F0203058%2Cquant-ph%2F0203090%2Cquant-ph%2F0203120%2Cquant-ph%2F0203033%2Cquant-ph%2F0203125%2Cquant-ph%2F0203080%2Cquant-ph%2F0203112%2Cquant-ph%2F0203097%2Cquant-ph%2F0203121%2Cquant-ph%2F0203035%2Cquant-ph%2F0203041%2Cquant-ph%2F0203144%2Cquant-ph%2F0203084%2Cquant-ph%2F0203019%2Cquant-ph%2F0203124%2Cquant-ph%2F0203108%2Cquant-ph%2F0203010%2Cquant-ph%2F0203049%2Cquant-ph%2F0203126%2Cquant-ph%2F0203133%2Cquant-ph%2F0203116%2Cquant-ph%2F0203141%2Cquant-ph%2F0203008%2Cquant-ph%2F0203146%2Cquant-ph%2F0203082%2Cquant-ph%2F0203015%2Cquant-ph%2F0203113%2Cquant-ph%2F0203051%2Cquant-ph%2F0203061%2Cquant-ph%2F0203152%2Cquant-ph%2F0203054%2Cquant-ph%2F0203029%2Cquant-ph%2F0203149%2Cquant-ph%2F0203066%2Cquant-ph%2F0203045%2Cquant-ph%2F0203046%2Cquant-ph%2F0203139%2Cquant-ph%2F0203052%2Cquant-ph%2F0203006%2Cquant-ph%2F0203009%2Cquant-ph%2F0203099%2Cquant-ph%2F0203148%2Cquant-ph%2F0203028%2Cquant-ph%2F0203098%2Cquant-ph%2F0203057%2Cquant-ph%2F0203135%2Cquant-ph%2F0203129%2Cquant-ph%2F0203043%2Cquant-ph%2F0203142%2Cquant-ph%2F0203089%2Cquant-ph%2F0203020%2Cquant-ph%2F0203048%2Cquant-ph%2F0203021%2Cquant-ph%2F0203106%2Cquant-ph%2F0203118%2Cquant-ph%2F0203117%2Cquant-ph%2F0203096%2Cquant-ph%2F0203014%2Cquant-ph%2F0203027%2Cquant-ph%2F0203138%2Cquant-ph%2F0203119%2Cquant-ph%2F0203013%2Cquant-ph%2F0203086&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A quantum theory of feedback of bosonic many-atom systems is formulated. The\nfeedback-induced many-atom correlations are treated by use of a parameterized\ncorrelation function, for which closed equations of motion are derived.\nTherefrom the dynamics of any additive property of the system, i.e., properties\nderived from the reduced single-atom density operator, can be obtained. An\nexample is given that indicates the correlation effects of feedback."}, "authors": ["S. Wallentowitz"], "author_detail": {"name": "S. Wallentowitz"}, "author": "S. Wallentowitz", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevA.66.032114", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/quant-ph/0203069v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/quant-ph/0203069v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "7 pages, 3 figures (to be published in Phys. Rev. A)", "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/quant-ph/0203069v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/quant-ph/0203069v2", "journal_reference": null, "doi": "10.1103/PhysRevA.66.032114", "fulltext": "Quantum theory of feedback of bosonic gases\nS. Wallentowitz∗\nFachbereich Physik, Universität Rostock, Universitätsplatz 3, D-18051 Rostock, Germany\n(Dated: March 13, 2002)\nA quantum theory of feedback of bosonic many-atom systems is formulated. The feedback-induced manyatom correlations are treated by use of a parameterized correlation function, for which closed equations of\nmotion are derived. Therefrom the dynamics of any additive property of the system, i.e., properties derived from\nthe reduced single-atom density operator, can be obtained. An example is given that indicates the correlation\neffects of feedback.\n\narXiv:quant-ph/0203069v2 2 Aug 2002\n\nPACS numbers: 03.65.-w, 05.30.Jp, 45.80.+r\n\nI.\n\nINTRODUCTION\n\nFeedback is widely used in engineering to control certain\nproperties of a system. Motivated by optical homodyne measurements, a theory of feedback has been formulated for cavity fields [1]. Many applications of feedback have been proposed for single quantum systems, such as, besides singlemode cavity fields, also for single atoms or generic harmonic oscillators. Moreover, extensions to time-delayed nonMarkovian feedback have been derived [2] and coherent feedback [4] and feedback using weak measurements [3] have\nbeen studied. Furthermore, alternative approaches to feedback\nhave been presented in the context of quantum-state estimation and quantum control [5].\nBesides laser cooling [6] many advances have been accomplished in the last years in cooling atoms to the ultimate limits.\nAmong them are Bose–Einstein condensation of dilute gases\nof alkali species [7, 8, 9, 10] and atomic hydrogen [11], the experimental realization of atom lasers [12, 13, 14] and the implementation of micro- and nanostructured atom-optical devices [15, 16, 17]. This experimental progress draws attention\nto the investigation of many-atom systems and their condensate features from a quantum-optical viewpoint. In view of\nthe experimental capabilities up to date, it is quite promising to engage in developing methods for controlling complex\nmany-atom systems, such as produced nowadays in the laboratory.\nThe use of feedback methods acting on accessible macroscopic observables of the system appears particularly desirable. An experimental implementation of it would not require\nthe active intervention of the experimenter, but would act as\na self-automated basic technological tool, such as it is now in\nengineering. Unfortunately, for the case of feedback acting\non a multi-mode many-atom system, the existing descriptions\nof feedback are in general not applicable: When trying to access arbitrary properties of the system, these methods become\nintractable, due to the required vast number of degrees of freedom.\nTypically employed mean-field approximations, could be\nused to factorize or truncate higher-order many-atom correlations, in order to simplify the problem. In the considered\n\n∗ Electronic\n\naddress: sascha.wallentowitz@physik.uni-rostock.de\n\ncase, however, the feedback operation contains the measurement of a macrostate observable of the many-atom system,\nto which all atoms contribute. The collective access to the\natoms in such a measurement induces strong correlations between them. These correlations represent a main ingredient of the feedback and should be taken care of in a nonapproximate way. The formation of correlations becomes\nclear when considering that an observed measurement outcome of a macrostate observable can be produced by a vast\nnumber of different microstates, that all enter the feedback operation in a coherent superposition. Such superposition states\nmay contain strong correlations between the atoms and one\nmay therefore expect that in general many-atom quantum correlations play a dominant role in the dynamics of the feedbacked system.\nCorrelations of this type are usually generated by interactions between atoms, such as for example two-body collisions.\nIn the case considered here, such explicit interactions will not\nbe taken into account. The many-atom correlations will solely\nbe generated by the measurement process. An interaction between the atoms can in fact be identified in the measurement.\nThe measurement process can be thought of as a probe field\ninteracting with all the atoms with a subsequent projection of\nthe probe by the final readout of the measurement result. Thus\nwe may imagine an effective interaction between the atoms\nbeing mediated via the probe field.\nIn the following an exact method is presented for describing the reduced single-atom dynamics under the influence of\nfeedback operations acting on macroscopic observables of a\nbosonic multi-mode many-atom system. The feedback loop\nconsists of a measurement with predefined measurement uncertainty σ and a subsequent unitary operation that again acts\non all atoms of the system. The feedback loop is assumed to\nact instantaneously without time delay between measurement\nand operation. As will be shown, the many-atom correlations,\nthat are generated by the measurement, can be formally incorporated into the single-atom dynamics by introducing a dynamically evolving additional degree of freedom. Thus the\nfree evolution intermitted by feedback operations can be formulated in terms of a quasi single-atom dynamics, revealing\nmodifications to the feedback dynamics of a true single-atom\nsystem.\nThe paper is structured as follows: In Sec. II the macroscopic observables needed for the feedback are introduced.\nFurthermore, the effect of the feedback on the many-atom\n\n\f2\n\nA\n\nthe resulting commutator relation for the annihilation and creation operators of atoms in mode λ, φ̂λ and φ̂†λ , respectively,\nreads\n[φ̂λ , φ̂†μ ] = δμλ .\n\nM^ (A A^)\n\nU^ (A)\n\nFIG. 1: Schematic function of the feedback loop. First a measurement on the system occurs, described by the operator M̂ (A−Â). The\nvalue of the measured outcome A is then used as a parameter for the\nunitary operation Û (A).\n\nquantum state is described and a first indication of the importance of atom-atom correlations is given. Section III proceeds by introducing a specially designed correlation function\nthat is shown to allow for a closed description of the feedback. Besides the dynamical evolution during the free evolution between feedback operations, also an interpretation of\nthis correlation function is presented. An application of the\ndeveloped method to the case of a condensed bosonic gas is\ngiven in Sec. IV and finally a summary and conclusions are\nfound in Sec. V.\n\nII. FEEDBACK LOOP\n\nThe feedback loop shall be considered as a measurement of\na macroscopic observable Â of the system and the use of the\nso obtained information, i.e., the measured value A, for applying a unitary operation, Û (A), on the system. Information is\ntherefore gained by measurements and used to manipulate the\nsystem, cf. Fig. 1. For the macroscopic observable we may\nthink of any extensive quantity of the system, i.e., a quantity\nthat has additive contributions from each atom in the system.\nThus measurements are not performed on single atoms but on\nlarge numbers of atoms.\nFirst let us consider the single-atom observable Â and its\ncanonical conjugate B̂ with commutator (~ = 1)\n[Â, B̂] = i.\n\n(1)\n\nNote that from now on for denoting single-atom Schrödinger\noperators calligraphic symbols are used. We now turn to a\nsecond-quantized description of the many-atom system by introducing the bosonic atom-field operator φ̂(x) with commutator\n[φ̂(x), φ̂† (x′ )] = δ(x−x′ ).\n\n(2)\n\nUsing an expansion into a set of complete and orthonormal\nmodes uλ (x),\nφ̂(x) =\n\nX\nλ\n\nφ̂λ uλ (x),\n\n(3)\n\n(4)\n\nThe macroscopic observable Â that is used for the measurement in the feedback loop is a sum of contributions of the\nindividual atoms. In the formalism of second quantization Â\nis therefore bilinear in the atom-field operators and reads\nX\nÂ =\n(5)\nφ̂†μ φ̂λ hμ|Â|λi.\nμλ\n\nHere hμ|Â|λi are the matrix elements of the corresponding single-atom operator Â with the single-atom Schrödinger\nmodes |λi being defined by: hx|λi = uλ (x).\nFor implementing a feedback operation Û (A) that is capable of changing the measured property A, the canonically\nconjugate variable of Â is needed. Whereas for a single atom\nthis is trivially given by the operator B̂, cf. Eq. (1), for a general many-atom system a conceptual problem arises. Clearly,\nthe proper canonical conjugate is given by\nB̂ =\n\n1 X\n\nN̂\n\nφ̂†μ φ̂λ hμ|B̂|λi,\n\n(6)\n\nμλ\n\nwhere again hμ|B̂|λi are the matrix elements of the corresponding single-atom operator B̂. Moreover, N̂ is the operator\nof the total number of atoms in the system,\nX †\nN̂ =\nφ̂λ φ̂λ .\n(7)\nλ\n\nWith this definition the sought commutator relation is established:\n[Â, B̂] = i,\n\n(8)\n\nas in the case of a single atom, cf. Eq. (1).\nHowever, due to the appearance of the atom-number operator N̂ in Eq. (6), the operator B̂ is not bidiagonal in the\natom-field operators. It is an intensive quantity and not an extensive one and thus is not a simple sum of contributions of\nthe individual atoms. Thus it cannot be experimentally realized by application of an external field (e.g. laser field) that\ninteracts with each individual atom. In other words, the problem is, that the total number of atoms is in principle unknown\nwithout its particular measurement. For the feedback action\nwe need to know how many atoms have contributed to the\npreviously measured quantity A. The lack of this knowledge\nis a potential source of imperfection of the overall feedback\naction.\nThis problem can be overcome in two ways: Either in each\nfeedback loop not only Â but also the atom number N̂ is measured, or the atom number is estimated. We will here concentrate on the latter approach, where the estimated number of\natoms Ne may be derived from a priori knowledge about the\nsystem, without additional measurements.\n\n\f3\nIt is worth noting, that neglecting this issue by replacing N̂\nby its average hN̂ i in Eq. (6), but still assuming the commutator relation (8), results in the neglect of atom-number fluctuations. Such an approach is only valid when the atom number\nis exact. Considering the case where only part of the system\nis subject to the feedback, say only atoms being located in\na predefined spatial region, an exact atom number in this region is rather doubtful even when the total number is precisely\nknown.\nSuch an approximation can be avoided by consistently\ndefining the operator B̂ by use of the estimated atom number\nNe ,\nB̂ =\n\n1 X †\nφ̂μ φ̂λ hμ|B̂|λi,\nNe\n\n(9)\n\nμλ\n\nand using the resulting commutator relations\n[Â, B̂] = iN̂ /Ne ,\n\n[Â, N̂ ] = [B̂, N̂ ] = 0.\n\n(10)\n\nThe measurement outcome is then a pure addition of all\nsingle-atom contributions. And the subsequent unitary operation will feed back the appropriately estimated part to each\natom.\nLet us now consider the action of the feedback loop on the\nquantum state of the many-atom system. Let t∓ be times infinitesimally before and after the time t when the feedback is\napplied. The action of the feedback on the many-atom density\noperator ̺ˆ then reads\nZ\n̺ˆ(t+ ) = dA Û (A) M̂ (A− Â) ̺ˆ(t− ) M̂ † (A− Â) Û † (A).\n(11)\nIt expresses the relation between the many-atom density operators ̺ˆ(t− ) and ̺ˆ(t+ ) before and after the feedback, respectively. The function M (A) is the resolution-amplitude [21]\nthat describes in its operator form the measurement process\nwith a measurement uncertainty σ determined by the width\nof |M (A)|2 . For simplicity we may take it to be a Gaussian.\nThe integration signifies the classical averaging over all possible measurement outcomes. Note that Eq. (11) can hardly be\nsolved due to the large number of degrees of freedom of the\nmany-atom density operator.\nAn important class of feedback mechanisms is defined by\nthe following action of Û (A) on the observable Â,\nÛ † (A) Â Û (A) = Â + f (A) N̂ /N.\n\n(12)\n\nIt is realized by choosing for the unitary feedback operation\nh\ni\nÛ (A) = exp −if (A) B̂ .\n(13)\nHere the function f (A) determines the response of the feedback loop to a measured value A. It encodes the desired action\nof the feedback and is a numerical function chosen by the experimenter.\nAn example may illustrate the feedback operation given in\nEq. (13): For a system containing exactly N atoms (Ne = N )\n\nand choosing for example f (A) = s(A+A0 ), the transformation (12) corresponds to positive (s > 0) or negative (s < 0)\nfeedback with an offset A0 . In the case of negative feedback\nand vanishing offset (s = −1, A0 = 0) we may derive from\nEq. (11) relations of the single-atom quantities A and B before and after the feedback. That is, the system is measured\nand fed back as a whole, and we regard the effects on the average properties of an individual atom in the system.\nThe relations for the mean values before and after the feedback read\nÂ\n\nt+\n\n= 0,\n\nB̂\n\nt+\n\n= B̂\n\nt−\n\n.\n\n(14)\n\nThus on average the quantity A is perfectly compensated to\nzero without affecting B, as expected for this type of feedback. Conceptual differences from the behavior of a true\nsingle-atom system are revealed when regarding the variances\nof these properties. The variance of B reflects the expected\nincrease of noise due to the back-action of the measurement:\n\u0012 \u00132\nD\nD\n\u00012 E\n\u00012 E\n1\n∆B̂\n= ∆B̂\n+\n.\n(15)\n2σ\nt+\nt−\nHowever, the variance of A, i.e., of the single-atom version of\nthe measured observable, does not correspond to that expected\nfor the feedback acting on a single-atom system:\nD\n\u0010 σ \u00112\nD\n\u00012 E\n\u00012 E\n\u00012 E\n1 D\n.\n∆\nÂ\n+\n∆Â\n=\n∆\nÂ\n−\nN2\nN\nt−\nt+\nt−\n(16)\nFor N = 1 atom in the system we have Â → Â and therefore the first two terms on the r.h.s. cancel each other, leaving\nas variance only the measurement uncertainty σ 2 . This is the\nresult that we expect for the single-atom case. In the general\nN atom case, however, the first two terms do not cancel each\nother. Equation (16) can be interpreted as follows: The uncertainty of the single-atom observable A is reduced by the gain\nof knowledge on the macroscopic observable A. However,\nthe uncertainty of the single-atom quantity A is in general not\nidentical to the uncertainty of the macroscopic observable Â\ndivided by the number of atoms. And therefore the first two\nterms do not compensate and in this way increase the noise\nabove the measurement uncertainty term.\nThe second term in Eq. (16) contains atom-atom correlations of the type hφ̂†μ φ̂λ φ̂†μ′ φ̂λ′ i, as can be seen from the definition (5). Therefore, the amount of compensation of noise\nin the single-atom properties due to the feedback depends on\nmany-atom quantum correlations. The determination of these\ncorrelations requires a hierarchy of equations for higher-order\natom correlations. To incorporate all these correlations in a\nconsistent way is therefore required even for obtaining singleatom properties.\nIII.\n\nSOLUTION IN TERMS OF CORRELATION\nFUNCTIONS\n\nOur goal is to describe expectation values of arbitrary extensive properties of the system, such as for example the total\n\n\f4\nNow the operator function T̂ (z) is chosen in such a way, that\nthe r.h.s. of this equation can again be expressed in terms\nof the correlation functions. More precisely, in terms of\nDμλ (z, t− ) at the time t− before the feedback operation. It\ncan be shown that the specific Ansatz\n\nenergy. Any such quantity can be expressed in terms of the\nso-called single-atom density matrix ρμλ , that is defined by\nρμλ = hφ̂†λ φ̂μ i.\n\n(17)\n\nThis density matrix describes the average properties of single\natoms in the system and is normalized to the total average\nnumber of atoms\nX\nρλλ = hN̂ i.\n(18)\n\nT̂ (z) = exp(i zT * Ẑ),\n\n(23)\n\nλ\n\nHowever, for the purpose of including the necessary higherorder atom correlations and for obtaining a closed set of equations we study a slightly different quantity. Namely, we consider the change due to a feedback operation of the correlation\nfunction,\nE\nD\n(19)\nDμλ (z) = φ̂†λ T̂ (z) φ̂μ .\n\nis appropriate for that purpose. Here the vector parameter is\nzT = (α, β, γ) [22] and Ẑ is defined as the vector operator\n\n\nÂ\nẐ =  B̂  .\nN̂ /Ne\n\n\nThe operator T̂ (z) is yet unknown, but we choose it to satisfy\nthe requirement\nlim T̂ (z) = 1.\n\n(20)\n\nz→0\n\nUsing this Ansatz, from Eq. (22) we obtain a closed set of\nequations that connects the correlations Dμλ (z) immediately\nafter the feedback operation with those before the feedback:\n\nIn this way the single-atom density matrix results as the value\nfor z = 0,\nDμλ (0) = hφ̂†λ φ̂μ i.\n\n(21)\n\nAs already mentioned, with the introduction of T̂ (z) higherorder many-atom correlations are contained in Dμλ (z), which\nis the clue to the solution.\nFrom Eq. (11) the correlation Dμλ (z, t+ ) right after a feedback operation can be expressed as\nZ\nD\nDμλ (z, t+ ) =\ndA M̂ † (A− Â) Û † (A) φ̂†λ T̂ (z) φ̂μ\nE\n× Û (A) M̂ (A− Â)\n.\n(22)\n\nDμλ (z, t+ ) =\n\n1\n= δ(β −β ) 2\n4π\n′\n\nZ\n\ndA\n\nXZ\n\n′\n\n′\n\nμλ\nd3z ′ Fμλ\n(z, z′ ) Dμ′ λ′ (z′ , t− ). (25)\n\nμ′ λ′\n\n′\n\n′\n\nμλ\n(z, z′ ) represents the action of the feedThe function Fμλ\nback mechanism and will be denoted in the following as feedback kernel. It is defined as\n\nt−\n\nμ′ λ′\nFμλ\n(α, β, γ, α′ , β ′ , γ ′ )\n\n(24)\n\nZ\n\n′\n\ndA\n\nZ\n\n′′\n\ndA\n\nZ\n\ndk δ[γ −γ ′ +αf (A)+βk]\n\n(26)\n\n× exp[i(α−α′ )(A−A′ )+ikA′′ ] hμ| Û(A) M̂(A′ +A′′ − Â)|μ′ i hλ′ | M̂† (A′ −A′′ − Â) Û † (A)|λi.\n\nThis kernel can easily be calculated since it only contains matrix elements of the single-atom measurement operator, that is\nobtained from the resolution amplitude M (A) by substituting\nfor the argument the single-atom operator A− Â, i.e.,\nM̂(A− Â) = M (A−B)\n\nB=Â\n\n.\n\n(27)\n\nMoreover, it contains the single-atom unitary operation that\n\nreads\nÛ(A) = exp[−if (A) B̂/Ne ] .\n\n(28)\n\nThe kernel (26) can be interpreted in terms of single-atom\nproperties as follows: First the single atom's observable Â is\nmeasured with outcome A′ ± A′′ and then this observable is\nshifted by f (A)/Ne , as would be expected when equally distributing the collective shift f (A) among the estimated num-\n\n\f5\nber of atoms. The connection between A and A′ ± A′′ , however, is determined by the mapping of the additionally introduced degrees of freedom, z and z′ . This latter mechanism is\nthe way how all orders of many-atom correlations are incorporated in the mapping and signifies the deviation from the\n\nD\n\nφ̂†λ φ̂μ\n\nE\n\nt+\n\n=\n\ntrue single-atom case.\nConsidering the case z = 0 (α = β = γ = 0), from Eqs (25)\nand (26) it becomes immediately clear that for the single-atom\ndensity matrix hφ̂†λ φ̂μ i no closed mapping is obtained:\n\nZ\nZ\nZ\n′\n′\n1 X\ndα′ dA dA′ e−iα (A−A ) hμ| Û (A) M̂(A′ − Â)|μ′ i\n2π ′ ′\nμλ\n\n× hλ′ | M̂† (A′ − Â) Û † (A)|λi Dμ′ λ′ (α′ , t− ),\n\n(29)\n\nwhere Ẑ(t) reads\n\nwhere\nDμ′ λ′ (α′ , t− ) = Dμ′ λ′ (z′ , t− )\n\nz′T =(α′ ,0,0)\n\n.\n\n(30)\n\nOn the r.h.s. of Eq. (29) higher-order many-atom correlations\nalways remain in Dμ′ λ′ (α′ , t− ) due to the non-vanishing integration variable α′ . That is, even when considering the singleatom dynamics, the mapping of the full correlations Dμλ (z)\nhas to be employed. Afterwards z can be set to zero to obtain\nthe sought single-atom density matrix.\nIt is worth mentioning, that an approximate closed mapping\nfor the single-atom density matrix in fact exists in the limit\nσ → ∞. Then the measurement resolution amplitude M only\nslowly depends on its argument and the A′ integration in (29)\nleads to non-vanishing contributions only for α′ ≈ 0. That\nshows that for very bad measurement resolutions, almost no\ncorrelations are generated between the atoms.\nIn the special case when exactly one atom is present in the\nsystem, the correlation function will naturally reduce to the\nsingle-atom density operator Dμλ (z) → hφ̂†λ φ̂μ i. Therefore, it\ndoes no longer depend on z. In this true single-atom case, the\nα′ integration in the mapping (29) acts only on the kernel and\nresults in the usual relation of the form given in Eq. (11). Now,\nhowever, for the single-atom density operator of a true singleatom system. Thus, the need of the parameter z signifies the\npresence of many-atom correlations in the feedback mapping.\nBetween two feedback operations the many-atom system\nwill evolve according to the Hamiltonian Ĥ. Assuming noninteracting atoms it is of the form\nX\nĤ =\nhμ|Ĥ|λi φ̂†μ φ̂λ .\n(31)\nμλ\n\nWithout loss of generality the mode functions uλ (x) = hx|λi\nare chosen as energy eigenstates of the single-atom Hamiltonian Ĥ with energies Eλ . Given the unitary time-evolution\noperator\nÛ (t) = exp(−iĤt),\n\n(32)\n\nwe may employ the time-dependent version of the operator\nT̂ (z),\nh\ni\nT̂ (z, t) = Û † (t) T̂ (z) Û (t) = exp i zT * Ẑ(t) ,\n(33)\n\nẐ(t) = Û † (t) Ẑ Û (t).\n\n(34)\n\nUsing these definitions we arrive at the expression for the correlation Dμλ (z) propagated according to the Hamiltonian (31)\nfrom time t′ to t,\nE\nD\n′\nDμλ (z, t) = φ̂†λ T̂ (z, t−t′ ) φ̂μ ′ e−i(Eμ −Eλ )(t−t ) . (35)\nt\n\nNow an assumption has to be made with respect to the free\ntime evolution of the operators contained in Ẑ. We assume\nthat Ẑ(t) can be given as\nẐ(t) = Vz (t−t′ ) * Ẑ(t′ ),\n\n(36)\n\nwhere the 3×3 real-valued matrix has the property Vz (−t) =\nVz−1 (t). Note that the free time evolution of many physical\nsystems can be cast into this form. Representative examples\nare free or harmonically trapped atoms when Â and B̂ are\ncenter-of-mass position and total momentum or vice versa. In\nsuch cases the correlations evolve as\nZ\nDμλ (z, t) = d3z ′ Wμλ (z, z′ , t−t′ ) Dμλ (z′ , t′ ),\n(37)\nwhere in energy representation the kernel is given as\n\u0002\n\u0003\nWμλ (z, z′ , t) = δ (3) z′ −VzT (t)*z e−i(Eμ −Eλ )t ,\n\n(38)\n\nwhich again can be evaluated rather easily.\nNow it becomes also clear, why the additional parameter β\nhas been introduced. Clearly it is not necessary for describing\nthe effect of a feedback operation on the single-atom density\nmatrix, as can be seen from Eq. (29). For the free evolution,\nhowever, this parameter is needed to provide a complete set\nof dynamically evolving variables. Consider, for example, the\ncase of harmonically trapped atoms where the feedback is performed on the total momentum. Then α is associated with the\ntotal momentum, whereas β is associated with the center-ofmass coordinate. The two parameters are then coupled during\nthe free evolution, which shows the need for the additional parameter β. Note, that the parameter γ naturally emerged due\nto the commutator relation of Â and B̂.\n\n\f6\nIt has been shown that by introduction of an additional\n(real-valued) vector parameter z a specifically chosen correlation function can be evolved in time by closed sets of equations of motion. Both for the feedback of a macroscopic observable and for the free evolution between the feedback operations [under the constraint (36)] the appropriate kernel functions can be given. The vector z could be formally interpreted\nas being an additional degree of freedom of the single atom, so\nthat we may view the complete feedback dynamics as a quasi\nsingle-atom problem. This is justified also by the fact that all\nrequired kernel functions are obtained from matrix elements\nof single-atom operators.\nThe correlation function Dμλ (z) reveals another interesting aspect. Clearly, for z = 0 it converges to the single-atom\ndensity matrix ρμλ and describes the microscopic properties\nof the average single atom. It has however also a connection\nto macroscopic properties, as will be shown now. If we would\nneglect in the definition (19) the field operators φ̂†λ and φ̂μ , we\ncould approximately write\nDμλ (z) ∼ D(z) = hT̂ (z)i.\n\n(39)\n\nGiven the definition of T̂ (z) in Eq. (23) it becomes clear that\nD(z) is the characteristic function (i.e. Fourier transform) of\nthe probability of measuring simultaneously the observables\nÂ, B̂, and N̂ /Ne . For a system with precise atom number, the\nlatter observable can be omitted and we essentially arrive at\nthe Fourier transform of the Wigner function W (A, B) of the\npair of canonically conjugate macroscopic variables Â and B̂.\nTurning back to the true definition (19) it can now be observed that the diagonal correlation Dλλ (z) can also be interpreted as the Fourier transform of a Wigner-type function of\nthe macroscopic phase space. However, it is that of a manyatom state, where one atom in mode λ has been removed.\nThe off-diagonal elements Dμλ (z) (λ 6= μ) represent the corresponding terms including single-atom coherences. Thus,\nthe chosen correlation function covers both microscopic and\nmacroscopic properties. Moreover, it accomplishes this in a\nspecific combination, that allows for the solution of the feedback dynamics.\n\nIV. APPLICATION TO AN IDEAL BOSE GAS\n\nFor illustrating the effects of atom correlations that can be\ntreated with the presented method, let us consider feedback of\na gas of N trapped bosonic atoms. We assume all the atoms\nto be initially in the ground state of the harmonic trap potential, e.g., a simple model for a non-interacting Bose–Einstein\ncondensate. The feedback shall consist in measuring the total momentum P̂ of all atoms and in subsequently shifting\nthis observable to zero by use of the observed value and the\ncenter-of-mass operator Q̂ [Â → P̂ , B̂ → Q̂, f (P ) = −P , and\nNe = N ].\nThe initial correlation function of the degenerate bosonic\n\n\u0001P =\u0001p0\n2\n1.8\n1.6\n1.4\n1.2\n1\n0.8\n\n1\n\n2\n\n3\n\n4\n\n5\n\nN\n\n6\n\n7\n\n8\n\n9\n\n10\n\nFIG. 2: Variance of the single-atom momentum, scaled in units of\nthe ground-state variance ∆p0 , versus atom number N for the state\nafter the feedback. Measurement uncertainties are σ/∆p0 = 1 (filled\nboxes) 1.5 (empty boxes), and 2 (triangles).\n\ngas reads\nDμλ (z) = N hμ|0ih0|λi exp[iγ(1−1/N )]\n\u001a\n\u0014\n\u0015\u001b\nN −1\n(∆q 0 )2 2\n2 2\n× exp −\n(∆p0 ) α +\n. (40)\nβ\n2\nN2\nHere ∆q 0 and ∆p0 are the position and momentum uncertainties, respectively, of the single-atom ground state |0i in the\ntrapping potential. This example shows quite well the above\nmentioned combination of microscopic and macroscopic descriptions. In this special case the correlation (40) is a product of the single atom density matrix ρμλ = N hμ|0ih0|λi, a\nphase factor determined by the precise number of atoms, and\na Gaussian distribution. The latter is the Fourier transform of\nthe joint probability distribution for simultaneously observing\nthe macroscopic values Q and P of N −1 atoms. That is, it is\nthe Fourier transform of the Wigner function W (Q, P ) of the\ncenter-of-mass degree of freedom of the macroscopic atomic\ngas with one atom being removed.\nThough the correlation (40) could be propagated in time\nas described previously, we consider here only the result of a\nsingle feedback operation. In this way, the variances of singleatom quantities, such as position and momentum, can be studied in dependence on the atom number N and the measurement uncertainty σ. Figure 2 shows the variance of the singleatom momentum in dependence on the atom number for three\ndifferent measurement uncertainties σ. One observes that for\nlarger numbers of atoms, the momentum variance converges\nto the initial ground-state variance ∆p0 , which establishes the\nregime of weak measurements where the single atom is only\nweakly affected by the measurement of the feedback loop. For\nonly a few atoms the dependence on the chosen measurement\nresolution indicates an increasing amount of atom-atom correlations with decreasing measurement uncertainty. For larger\nmeasurement uncertainties a σ/N behavior will appear in the\nsingle-atom momentum variance, as would be expected classically when the measurement uncertainty is equally distributed\namong all atoms [cf. Eq. (16)].\n\n\f7\n\n\u0001Q\u0001P =(\u0001p0\u0001q0)\n\nstates one may expect even more dramatic deviations from the\nclassically expected behavior.\n\n2.2\n2\n1.8\n\nV.\n\nSUMMARY AND CONCLUSIONS\n\n1.6\n1.4\n1.2\n1\n1\n\n3\n\n5\n\n7\n\nN\n\n9\n\n11\n\n13\n\n15\n\nFIG. 3: Uncertainty product of single-atom position and momentum,\nscaled in units of the ground-state uncertainty ∆q 0 ∆p0 , versus atom\nnumber N (same parameters as in Fig. 2). The minimum uncertainty\nproduct corresponds to the value 1.\n\nIn Fig. 3 the uncertainty product of single-atom momentum\nand position, including now also the measurement-induced\nback-action noise in the position, is plotted versus the atom\nnumber for different measurement uncertainties. For small\natom numbers atom-atom correlations can be build up, as in\nthe case σ/∆p0 = 1 (filled boxes), leading to minimum values at certain atom numbers. For larger atom numbers the\nmeasurement-induced noise dominates and the scaled value\n1\n[1+(∆p0 /σ)2 ] 2 is reached. The presented features are those\nof a condensate state, for other highly correlated quantum\n\n[1] H.M. Wiseman and G.J. Milburn, Phys. Rev. Lett. 70, 548\n(1993); Phys. Rev. A 49, 1350 (1994); 49, 4110 (1994); H.M.\nWiseman, ibid. 49, 2133 (1994); 49, 5159 (1994); 50, 4428\n(1994); D.B. Horoshko and S.Ya. Kilin, JETP 79, 691 (1994);\n[2] V. Giovannetti, P. Tombesi, and D. Vitali, Phys. Rev. A 60, 1549\n(1999).\n[3] S. Lloyd and J.-J.E. Slotine, Phys. Rev. A 62, 012307 (2000).\n[4] S. Lloyd, Phys. Rev. A 62, 022108 (2000); R.J. Nelson, Y. Weinstein, D. Cory, and S. Lloyd, Phys. Rev. Lett. 85, 3045 (2000).\n[5] A.C. Doherty and K. Jacobs, Phys. Rev. A 60, 2700 (1999);\nA.C. Doherty, S. Habib, and K. Jacobs, ibid. 62, 012105 (2000).\n[6] See S. Chu, Rev. Mod. Phys. 70, 685 (1998); C.N. Cohen–\nTannoudji, ibid. 70, 707 (1998); W.D. Phillips, ibid. 70, 721\n(1998), and references therein.\n[7] M.H. Anderson, J.R. Ensher, M.R. Matthews, C.E. Wieman,\nand E.A. Cornell, Science 269, 198 (1995).\n[8] C.C. Bradley, C.A. Sackett, J.J. Tollett, and R.G. Hulet, Phys.\nRev. Lett. 75, 1687 (1995).\n[9] K.B. Davies, M.-O. Mewes, M.R. Andrews, N.J. van Druten,\nD.S. Durfee, D.M. Kurn, and W. Ketterle, Phys. Rev. Lett. 75,\n3969 (1995).\n[10] C.C. Bradley, C.A. Sackett, and R.G. Hulet, Phys. Rev. Lett. 78,\n985 (1997).\n[11] D.G. Fried, T.C. Killian, L. Willmann, D. Landhuis, S.C. Moss,\nD. Kleppner, and T.J. Greytak, Phys. Rev. Lett. 81, 3811 (1998).\n[12] M.-O. Mewes, M.R. Andrews, D.M. Kurn, D.S. Durfee, C.G.\n\nIn conclusion a method has been presented for treating\nthe dynamics of feedback of macroscopic observables of\na bosonic multi-mode many-atom system. The introduced\nunique correlation function obeys closed equations of motion for the feedback operation and the free-evolution dynamics. Thus the dynamics intermitted by feedback operations at\npredefined times can be exactly described and calculated on\na quasi single-atom level. The description contains the full\nmany-atom correlations, that are generated by the feedback\nloop. In this way the dynamics of expectation values of any\nextensive property of the many-atom system, as for example\nthe energy of a dilute atomic gas, can be obtained. The advantage of the method is its exactness combined with the treatment on a quasi single-atom level, vastly reducing the number\nof degrees of freedom, that would have to be employed for a\nsolution of the full many-atom problem. Applications of the\nmethod can be found in the context of control and stochastic cooling of dilute bosonic gases [18] or feedback of a few\natoms in an optical cavity [19, 20].\nThe author thanks V.V. Kozlov, P.E. Toschek, I.A. Walmsley, and W. Vogel for comments. This research was supported by Deutsche Forschungsgemeinschaft and Deutscher\nAkademischer Austausch Dienst.\n\nTownsend, and W. Ketterle, Phys. Rev. Lett. 78, 582 (1997).\n[13] I. Bloch, T.W. Hänsch, and T. Esslinger, Phys. Rev. Lett. 82,\n3008 (1999).\n[14] E.W. Hagley, L. Deng, M. Kozuma, J. Wen, K. Helmerson, S.L.\nRolston, and W.D. Phillips, Science 283, 1706 (1999).\n[15] J. Reichel, W. Hänsel, and T.W. Hänsch, Phys. Rev. Lett. 83,\n3398 (1999).\n[16] D. Cassettari, B. Hessmo, R. Folman, T. Maier, and J. Schmiedmayer, Phys. Rev. Lett. 85, 5483 (2000).\n[17] W. Hänsel, J. Reichel, P. Hommelhoff, and T.W. Hänsch, Phys.\nRev. Lett. 86, 608 (2001); J. Reichel, W. Hänsel, P. Hommelhoff, and T.W. Hänsch, Appl. Phys. B 72, 81 (2001).\n[18] M.G. Raizen, J. Koga, B. Sundaram, Y. Kishimoto, H. Takuma,\nand T. Tajima, Phys. Rev. A 58, 4757 (1998).\n[19] C.J. Hood, T.W. Lynn, A.C. Doherty, A.S. Parkins, and H.J.\nKimble, Science 287, 1447 (2000); P.W.H. Pinkse, T. Fischer, P.\nMaunz, and G. Rempe, Nature 404, 365 (2000); P.W.H. Pinkse,\nT. Fischer, P. Maunz, T. Puppe, and G. Rempe, J. Mod. Opt. 47,\n2769 (2000).\n[20] T. Fischer, P. Maunz, P.W.H. Pinkse, T. Puppe, and G. Rempe,\nPhys. Rev. Lett. 88, 163002 (2002).\n[21] It is a positive operator-valued measure [cf. C.M. Caves, Phys.\nRev. D 33, 1643 (1986)].\n[22] zT means the transpose of z.\n\n\f"}