{"id": "http://arxiv.org/abs/quant-ph/0302025v1", "guidislink": true, "updated": "2003-02-04T03:03:45Z", "updated_parsed": [2003, 2, 4, 3, 3, 45, 1, 35, 0], "published": "2003-02-04T03:03:45Z", "published_parsed": [2003, 2, 4, 3, 3, 45, 1, 35, 0], "title": "Semiclassical approaches to controlling chemical reaction dynamics", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=quant-ph%2F0302188%2Cquant-ph%2F0302173%2Cquant-ph%2F0302131%2Cquant-ph%2F0302120%2Cquant-ph%2F0302031%2Cquant-ph%2F0302029%2Cquant-ph%2F0302115%2Cquant-ph%2F0302114%2Cquant-ph%2F0302127%2Cquant-ph%2F0302082%2Cquant-ph%2F0302182%2Cquant-ph%2F0302099%2Cquant-ph%2F0302013%2Cquant-ph%2F0302153%2Cquant-ph%2F0302092%2Cquant-ph%2F0302009%2Cquant-ph%2F0302116%2Cquant-ph%2F0302180%2Cquant-ph%2F0302104%2Cquant-ph%2F0302058%2Cquant-ph%2F0302164%2Cquant-ph%2F0302063%2Cquant-ph%2F0302175%2Cquant-ph%2F0302064%2Cquant-ph%2F0302087%2Cquant-ph%2F0302110%2Cquant-ph%2F0302140%2Cquant-ph%2F0302039%2Cquant-ph%2F0302129%2Cquant-ph%2F0302050%2Cquant-ph%2F0302148%2Cquant-ph%2F0302007%2Cquant-ph%2F0302191%2Cquant-ph%2F0302081%2Cquant-ph%2F0302012%2Cquant-ph%2F0302030%2Cquant-ph%2F0302126%2Cquant-ph%2F0302108%2Cquant-ph%2F0302101%2Cquant-ph%2F0302093%2Cquant-ph%2F0302190%2Cquant-ph%2F0302135%2Cquant-ph%2F0302181%2Cquant-ph%2F0302089%2Cquant-ph%2F0302032%2Cquant-ph%2F0302168%2Cquant-ph%2F0302022%2Cquant-ph%2F0302046%2Cquant-ph%2F0302157%2Cquant-ph%2F0302184%2Cquant-ph%2F0302192%2Cquant-ph%2F0302037%2Cquant-ph%2F0302004%2Cquant-ph%2F0302204%2Cquant-ph%2F0302121%2Cquant-ph%2F0302006%2Cquant-ph%2F0302158%2Cquant-ph%2F0302176%2Cquant-ph%2F0302193%2Cquant-ph%2F0302165%2Cquant-ph%2F0302041%2Cquant-ph%2F0302065%2Cquant-ph%2F0302150%2Cquant-ph%2F0302113%2Cquant-ph%2F0302156%2Cquant-ph%2F0302171%2Cquant-ph%2F0302083%2Cquant-ph%2F0302128%2Cquant-ph%2F0302123%2Cquant-ph%2F0302025%2Cquant-ph%2F0302008%2Cquant-ph%2F0302079%2Cquant-ph%2F0302109%2Cquant-ph%2F0302107%2Cquant-ph%2F0302002%2Cquant-ph%2F0302097%2Cquant-ph%2F0302086%2Cquant-ph%2F0302094%2Cquant-ph%2F0302179%2Cquant-ph%2F0302027%2Cquant-ph%2F0302053%2Cquant-ph%2F0302125%2Cquant-ph%2F0302042%2Cquant-ph%2F0302152%2Cquant-ph%2F0302195%2Cquant-ph%2F0302040%2Cquant-ph%2F0302001%2Cquant-ph%2F0302138%2Cquant-ph%2F0302084%2Cquant-ph%2F0302024%2Cquant-ph%2F0302189%2Cquant-ph%2F0302028%2Cquant-ph%2F0302091%2Cquant-ph%2F0302169%2Cquant-ph%2F0302074%2Cquant-ph%2F0302071%2Cquant-ph%2F0302124%2Cquant-ph%2F0302102%2Cquant-ph%2F0302080%2Cquant-ph%2F0302202%2Cquant-ph%2F0302018&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Semiclassical approaches to controlling chemical reaction dynamics"}, "summary": "We propose to use semiclassical methods to treat laser control problems of\nchemical reaction dynamics. Our basic strategy is as follows: Laser-driven\nchemical reactions are considered to consist of two processes. One is the\nwavepacket propagation on an adiabatic potential energy surface (PES), and the\nother is the electronic transition between PES's. Because the latter process is\nmathematically equivalent to nonadiabatic transitions between Floquet (dressed)\nstates, we can control such a process using the semiclassical Zhu-Nakamura\ntheory for nonadiabatic transitions. For the former process, we incorporate\nsemiclassical propagation methods such as the Herman-Kluk propagator into\noptimization procedures like optimal control theory. We show some numerical\nexamples for our strategies. We also develop a semiclassical direct algorithm\nto treat the adiabatic propagation and nonadiabatic transitions as a whole.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=quant-ph%2F0302188%2Cquant-ph%2F0302173%2Cquant-ph%2F0302131%2Cquant-ph%2F0302120%2Cquant-ph%2F0302031%2Cquant-ph%2F0302029%2Cquant-ph%2F0302115%2Cquant-ph%2F0302114%2Cquant-ph%2F0302127%2Cquant-ph%2F0302082%2Cquant-ph%2F0302182%2Cquant-ph%2F0302099%2Cquant-ph%2F0302013%2Cquant-ph%2F0302153%2Cquant-ph%2F0302092%2Cquant-ph%2F0302009%2Cquant-ph%2F0302116%2Cquant-ph%2F0302180%2Cquant-ph%2F0302104%2Cquant-ph%2F0302058%2Cquant-ph%2F0302164%2Cquant-ph%2F0302063%2Cquant-ph%2F0302175%2Cquant-ph%2F0302064%2Cquant-ph%2F0302087%2Cquant-ph%2F0302110%2Cquant-ph%2F0302140%2Cquant-ph%2F0302039%2Cquant-ph%2F0302129%2Cquant-ph%2F0302050%2Cquant-ph%2F0302148%2Cquant-ph%2F0302007%2Cquant-ph%2F0302191%2Cquant-ph%2F0302081%2Cquant-ph%2F0302012%2Cquant-ph%2F0302030%2Cquant-ph%2F0302126%2Cquant-ph%2F0302108%2Cquant-ph%2F0302101%2Cquant-ph%2F0302093%2Cquant-ph%2F0302190%2Cquant-ph%2F0302135%2Cquant-ph%2F0302181%2Cquant-ph%2F0302089%2Cquant-ph%2F0302032%2Cquant-ph%2F0302168%2Cquant-ph%2F0302022%2Cquant-ph%2F0302046%2Cquant-ph%2F0302157%2Cquant-ph%2F0302184%2Cquant-ph%2F0302192%2Cquant-ph%2F0302037%2Cquant-ph%2F0302004%2Cquant-ph%2F0302204%2Cquant-ph%2F0302121%2Cquant-ph%2F0302006%2Cquant-ph%2F0302158%2Cquant-ph%2F0302176%2Cquant-ph%2F0302193%2Cquant-ph%2F0302165%2Cquant-ph%2F0302041%2Cquant-ph%2F0302065%2Cquant-ph%2F0302150%2Cquant-ph%2F0302113%2Cquant-ph%2F0302156%2Cquant-ph%2F0302171%2Cquant-ph%2F0302083%2Cquant-ph%2F0302128%2Cquant-ph%2F0302123%2Cquant-ph%2F0302025%2Cquant-ph%2F0302008%2Cquant-ph%2F0302079%2Cquant-ph%2F0302109%2Cquant-ph%2F0302107%2Cquant-ph%2F0302002%2Cquant-ph%2F0302097%2Cquant-ph%2F0302086%2Cquant-ph%2F0302094%2Cquant-ph%2F0302179%2Cquant-ph%2F0302027%2Cquant-ph%2F0302053%2Cquant-ph%2F0302125%2Cquant-ph%2F0302042%2Cquant-ph%2F0302152%2Cquant-ph%2F0302195%2Cquant-ph%2F0302040%2Cquant-ph%2F0302001%2Cquant-ph%2F0302138%2Cquant-ph%2F0302084%2Cquant-ph%2F0302024%2Cquant-ph%2F0302189%2Cquant-ph%2F0302028%2Cquant-ph%2F0302091%2Cquant-ph%2F0302169%2Cquant-ph%2F0302074%2Cquant-ph%2F0302071%2Cquant-ph%2F0302124%2Cquant-ph%2F0302102%2Cquant-ph%2F0302080%2Cquant-ph%2F0302202%2Cquant-ph%2F0302018&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We propose to use semiclassical methods to treat laser control problems of\nchemical reaction dynamics. Our basic strategy is as follows: Laser-driven\nchemical reactions are considered to consist of two processes. One is the\nwavepacket propagation on an adiabatic potential energy surface (PES), and the\nother is the electronic transition between PES's. Because the latter process is\nmathematically equivalent to nonadiabatic transitions between Floquet (dressed)\nstates, we can control such a process using the semiclassical Zhu-Nakamura\ntheory for nonadiabatic transitions. For the former process, we incorporate\nsemiclassical propagation methods such as the Herman-Kluk propagator into\noptimization procedures like optimal control theory. We show some numerical\nexamples for our strategies. We also develop a semiclassical direct algorithm\nto treat the adiabatic propagation and nonadiabatic transitions as a whole."}, "authors": ["Hiroshi Fujisaki", "Yoshiaki Teranishi", "Alexey Kondorskiy", "Hiroki Nakamura"], "author_detail": {"name": "Hiroki Nakamura"}, "author": "Hiroki Nakamura", "arxiv_comment": "5 pages, 3 figures", "links": [{"href": "http://arxiv.org/abs/quant-ph/0302025v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/quant-ph/0302025v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/quant-ph/0302025v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/quant-ph/0302025v1", "journal_reference": null, "doi": null, "fulltext": "arXiv:quant-ph/0302025v1 4 Feb 2003\n\nSemiclassical approaches to controlling chemical\nreaction dynamics\nHiroshi FUJISAKI, Yoshiaki TERANISHI♠ , Alexey KONDORSKIY,\nand Hiroki NAKAMURA∗\nDepartment of Theoretical Studies, Institute for Molecular Science\n♠\nJapan Atomic Energy Research Institute\n\nAbstract\nWe propose to use semiclassical methods to treat laser control problems of chemical reaction\ndynamics. Our basic strategy is as follows: Laser-driven chemical reactions are considered to consist\nof two processes. One is the wavepacket propagation on an adiabatic potential energy surface\n(PES), and the other is the electronic transition between PES's. Because the latter process is\nmathematically equivalent to nonadiabatic transitions between Floquet (dressed) states, we can\ncontrol such a process using the semiclassical Zhu-Nakamura theory for nonadiabatic transitions.\nFor the former process, we incorporate semiclassical propagation methods such as the HermanKluk propagator into optimization procedures like optimal control theory. We show some numerical\nexamples for our strategies. We also develop a semiclassical direct algorithm to treat the adiabatic\npropagation and nonadiabatic transitions as a whole.\n\n1\n\nIntroduction\n\nControlling molecular dynamics is one of the intriguing targets in chemical physics. Since the works\nof Brumer and Shapiro, Tannor and Rice, and others, laser control of molecular dynamics has been\ndeveloped relatively well for simple molecular processes [1]. Theoretically, in order to obtain an optimal\nfield producing a desired product, optimal control theory (OCT) is one of the most natural and flexible\nvehicles [1]. It assumes a certain functional which should be maximized, from which one can derive\nequations of motion which in turn determines the optimal field. The equations including Schrödinger\nequation must be solved iteratively in general, hence its numerical cost becomes huge for large molecules.\nAlthough there exist some calculations for reduced dimensionality models of large molecules, it can be\nvery difficult to control even a triatomic molecule quantum mechanically within the present state of art.\nSome strategies to circumvent this difficulty are strongly desired.\nOur basic strategy is as follows: Laser-driven chemical reactions are considered to consist of two\nprocesses. One is the wavepacket propagation on an adiabatic potential energy surface (PES), and the\nother is the electronic transition between PES's. Because the latter process is mathematically equivalent\nto nonadiabatic transitions between Floquet (dressed) states, we can control such a process using the\nsemiclassical Zhu-Nakamura theory for nonadiabatic transitions [2]. (It has been shown in Refs. [2, 3, 4]\nthat this strategy is very successful.) In Sec. 2, we shall show another example of our strategy. A new\nthing here is that we treat a real diatomic molecule, HI, with its real PES information. We shall use\nthe idea of complete reflection to control HI photodissociation to two different channels. A complication\narises due to existence of three electronically excited states [5].\nFor controlling the wavepacket dynamics on a PES, on the other hand, we need to employ a general\noptimization procedure like OCT. There have been many applications of OCT in the literature; however,\nsuch works are often limited to rather small systems with less than three degrees of freedom. This is\nbecause the conventional methods of wavepacket propagation using grids are limited to rather small\nsystems. Semiclassical wavepacket propagation methods are believed to overcome this kind of difficulty\nwith use of classical trajectories. Hence it is very natural to examine the possibility of combining the\nsemiclassical wavepacket propagation methods with OCT. In Sec. 3, we employ one of semiclassical\nwavepacket propagation methods, the initial value representation (IVR) method using the HermanKluk propagator [6], and incorporate it into OCT. It is known that the IVR method can approximately\n∗ e-mail:\n\nfujisaki@ims.ac.jp, tera@apr.jaeri.go.jp, kondor@ims.ac.jp, nakamura@ims.ac.jp\n\n\freproduce the full quantum results for many molecular systems, and its computational scalability is\nmuch less than that of the corresponding quantum calculations for large molecules. In addition, we can\nunderstand the \"physical aspects\" of the optimal field because the IVR method represents the result as\na sum of the quantities calculated from classical trajectories.\nThe effectiveness of the IVR method has been mainly tested for single PES systems, i.e., systems\nwithout nonadiabatic transitions. (For exceptions, see Ref. [7].) On the other hand, we have the\nsemiclassical Zhu-Nakamura theory of nonadiabatic transition [2], and it is shown that it can be used to\ncontrol even wavepacket excitation between PES's under some conditions [4]. In Sec. 4, we examine the\npossibility to combine this kind of semiclassical theory of nonadiabatic transitions with the semiclassical\nwavepacket propagation method.\n\n2\n\nControlling a molecule by complete reflection: Application\nto HI photodissociation\n\nWe shall apply the strategy using complete reflection [3] to HI photodissociation. The ab initio potential\nenergy curve (PEC) information is reproduced in Fig. 2 of [5]. There are three electronically excited\nstates, and their transition dipole moments depend on the internuclear distance significantly.\nWhen applying a stationary laser field, we can consider this system as a curve-crossing system: one\ncurve from the electronically ground state crosses with the other three curves from the electronically\nexcited states. At crossings nonadiabatic transitions occur and such a phenomenon can be accurately\ntreated by the semiclassical ZN formula. If the energy of a vibrational state satisfies a resonant-like\ncondition, then the phenomenon, complete reflection, occurs: such a wavepacket cannot escape from the\nupper adiabatic PEC to the lower adiabatic PEC. (The lifetime is infinite.) This strategy can be used\nto control photodissociation and some model calculations were done in [3].\nTo control HI photodissociation, we need to control three crossings at the same time. Of course, this\nis mathematically impossible because the complete reflection occurs at a certain energy point, but it\nmight work in practice at some time interval. As shown in Fig. 1(a), at a certain energy (h̄ω ≃ 3.58 eV)\nand up to a certain time interval (14 ps), the two fluxes (J2 (t), J4 (t)) corresponding to two electronically\nexcited PEC's connected to H+I channel nearly equal zero because this energy satisfies the complete\nreflection condition for both states to a good extent. In this case, we have to prepare the vibrationally\nexcited state with v = 4 (v = 5 is better from experimental points of view [9], but the qualitative result\nis the same). In addition, the contribution from v = 0 component, which might remain as a major\ncomponent even after infrared excitation of the vibrational state, is very small as shown in Fig. 1(b).\nThis means that the H+I∗ photodissociation can be nearly completely achieved by using the vibrational\nstate with v = 4 and the stationary laser field with h̄ω ≃ 3.58 eV. (In contrast, it is easy to achieve H+I\nphotodissociation because only single excited PEC is asymptotically connected to H+I∗ which should\nbe blocked.)\nWe have not included the effect of rotation and temperature, which degrade the quality of control,\nbut the actual experimental condition is expected to be much similar to our calculation [9].\n\n3\n\nSemiclassical implementation of optimal control theory\n\nIn the previous section, we have shown that the electronic transition can be controlled with the help of the\nsemiclassical ZN formula. As mentioned in the introduction, however, laser-driven chemical reactions\nconsist of two processes, and we need to control not only electronic transitions but also wavepacket\npropagation. There seems to be no simple semiclassical methods to deal with the latter, so we examine\nthe possibility to combine the optimal control theory (OCT) with a semiclassical wavepacket propagation\nmethod with the Herman-Kluk propagator [6]. As an OCT procedure, we take the Zhu-Botina-Rabitz\nmethod [10], and substitute the semiclassical propagator into the control scheme. The numerical result\nfor HD+ molecule is shown in Fig. 2: The control here is to shift the vibrational ground state to 1 a.u.\naway from the equilibrium position, the target time T is 100 fs, and the so called penalty factor α is\n0.01.\nAs can be seen, the semiclassical result quantitatively agrees with the quantum result. Unfortunately,\nhowever, this straightforward semiclassical calculation needs more computational time compared with\nthe corresponding quantum calculation! This is because the optimal field expressed as\n1\n(1)\nε(t) = − Im [hφ(t)|χ(t)ihχ(t)|μ|φ(t)i]\nα\n\n\f1\n\n0.0035\nJ2(t)\nJ3(t)\nJ4(t)\n\n(a)\n\nJ2(t)\nJ3(t)\nJ4(t)\n\n(b)\n\n0.003\n\nJi(t)(i=2,3,4)\n\nJi(t)(i=2,3,4)\n\n0.8\n\n0.6\n\n0.4\n\n0.0025\n0.002\n0.0015\n0.001\n\n0.2\n0.0005\n0\n\n0\n0\n\n2\n\n4\n\n6\n\n8\n\n10\n\n12\n\n14\n\n0\n\n2\n\nt(ps)\n\n4\n\n6\n\n8\n\n10\n\n12\n\n14\n\nt(ps)\n\nFigure 1: Time variation of the time-integrated fluxes Ji (t) (i = 2, 3, 4 corresponds to three electronically\nexcited states) for the initial vibrational state with (a) v = 4 and (b) v = 0. The laser frequency is h̄ω ≃ 3.58\neV.\n\n1\n\n0.03\n0.02\n\n(a)\n\n0.9\n0.8\n\n0\n-0.01\n\n0.6\n\nε(t)(a.u.)\n\n2\n\n0.7\n\n|〈φT|φ(t)〉|\n\n(b)\n\n0.01\n\n0.5\n0.4\n\n-0.02\n-0.03\n-0.04\n\n0.3\n\n-0.05\n\n0.2\n\n-0.06\n\n0.1\n\n-0.07\n\n0\n\n-0.08\n0\n\n10 20 30 40 50 60 70 80 90 100\n\nt(fs)\n\n0\n\n10 20 30 40 50 60 70 80 90 100\n\nt(fs)\n\nFigure 2: (a) Semiclassical (solid line) and quantum (dashed line) calculations of the overlap integral\n|hφT |φ(t)i|2 where |φT i is the target state. (b) Semiclassical (solid line) and quantum (dashed line) optimal\nfields obtained after one iteration.\n\n\frequires O(N 2 ) calculations where N is the number of the trajectories. Here |φ(t)i and |χ(t)i are\nsemiclassically calculated wavefunctions with computational cost O(N ); so hφ(t)|χ(t)i and hχ(t)|μ|φ(t)i\namount to such an order of calculation in general. (μ is the transition dipole moment.) One might\nexpect that we can reduce the cost by decreasing the width of the Gaussian wavepacket in the HK\npropagator; but it turns out that the overall efficiency cannot be improved. The same difficulty appears\nwhen one semiclassically calculates general correlation functions as analyzed by Miller [11].\nWe are now planning to use a sort of genetic algorithm [12] to circumvent this difficulty since the\noptimal fields in the genetic algorithm procedure are represented as \"genes\", and there is no such a\nscaling problem. (The initially guessed field can be obtained from the concept of nonadiabatic transition\nbetween vibrational states.)\n\n4\n\nSemiclassical IVR method for nonadiabatic transitions\n\nThe semiclassical methods mentioned above separately treat the processes of adiabatic propagation on\na single adiabatic PES and those of electronic transition. This means that the whole process should\nbe divided into three steps: (i) propagation on an initial PES, (ii) nonadiabatic transition, and (iii)\npropagation on a final PES. The optimal field should be designed so that no unnecessary interference\noccurs between the steps. In order to overcome such a restriction and to use the unique pulse to control\nthe process, semiclassical IVR methods for nonadiabatic transitions should be constructed. One of\nthe purposes of this work is to develop such a method which generalizes the ordinary Herman-Kluk\npropagator for the case of several electronic states. For other studies in this direction, see [7].\nThe research is still under way and preliminary results for a 1D case are presented. The model\nsystem employed is H+\n2 molecule composed of 1sσg and 2pσu states. An initial wavefunction is assumed\nto be a Gaussian of width 0.5 a.u. with center at 5 a.u. on the 1sσg state. The external field is assumed\nto be a linearly polarized femtosecond pulse with the Gaussian profile of FWHM = 10 fs. The total\nduration of wavepacket propagation is 20 fs. The wavelength of the femtosecond pulse is 515 nm and\nthe crossing point of the dressed electronic states is located at 4 a.u. The results for the wavepacket\npropagation are shown in Fig. 3.\n0.5\n\n0.9\n\n(a)\n\nQuantum\nSemiclassical\n\n0.4\n\nQuantum\nSemiclassical\n\n0.7\n\nProbability density\n\nProbability density\n\n(b)\n\n0.8\n\n0.3\n\n0.2\n\n0.1\n\n0.6\n0.5\n0.4\n0.3\n0.2\n0.1\n\n0.0\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\nR [a.u.]\n\n6\n\n7\n\n8\n\n9\n\n10\n\n0.0\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\n9\n\n10\n\nR [a.u.]\n\nFigure 3: (a) Final wavepacket on the 2pσu state calculated quantum mechanically (thick line) and semiclassically (thin line). The total population: Quantum =0.30; Semiclassical =0.28. (b) The same on the\n1sσg state. The total population: Quantum =0.70; Semiclassical =0.72.\n\n5\n\nOutlook\n\nWe have advocated the use of semiclassical methods for control problems in view of its general capability\nto treat multidimensional systems with less computational cost. If the dimensionality of the system is\nhigh, the effects of \"chaos\" might also affect the quality of control. We have shown that a chaotic system\ncalled a kicked rotor can be controlled by using the Zhu-Botina-Rabitz method even when the system\nbecomes strongly chaotic in the classical limit [13]. It should be confirmed whether this is generic or not\nfor multidimensional systems. For much larger systems, even semiclassical calculations themselves are\nformidable, and in such a situation we need to use some kind of mixed quantum-classical methods. They\n\n\fare very practical ways to treat multidimensional phenomena like vibrational relaxation in solvents [14],\nso it is interesting to control such phenomena with use of mixed quantum-classical methods.\n\nReferences\n[1] S. A. Rice and M. Zhao, Optical Control of Molecular Dynamics, John-Wiley & Sons (2000).\n[2] C. Zhu, Y. Teranishi, and H. Nakamura, Adv. Chem. Phys. 117, 127 (2001); H. Nakamura, Nonadiabatic transition: Concepts, Basic Theories and Applications, World Scientific, Singapore (2002).\n[3] K. Nagaya, Y. Teranishi, and H. Nakamura, J. Chem. Phys. 113, 6197 (2000).\n[4] K. Nagaya, Y. Teranishi, and H. Nakamura, J. Chem. Phys. 117, 9588 (2002).\n[5] H. Fujisaki, Y. Teranishi, and H. Nakamura, J. Theor. Comp. Chem. 1, 245 (2002); e-print\nquant-ph/0211142.\n[6] See, B. R. McQuarrie and P. Brumer, Chem. Phys. Lett. 319, 27 (2000), and references therein.\n[7] X. Sun and W. H. Miller, J. Chem. Phys. 106, 6346 (1997); G. Stock and M. Thoss, Phys. Rev.\nLett. 78, 578 (1997); M. Thoss and G. Stock, Phys. Rev. A 59, 64 (1999); M. Thoss, W. H. Miller,\nand G. Stock, J. Chem. Phys. 112, 10282 (2000).\n[8] A. B. Alekseyev, H-P. Liebermann, D. B. Kokh, and R. J. Buenker, J. Chem. Phys. 113, 6174\n(2000); N. Balakrishnan, A. B. Alekseyev, and R. J. Buenker, Chem. Phys. Lett. 341, 594 (2001);\nN. Balakrishnan, private communication.\n[9] M. Kawasaki, private communication.\n[10] W. Zhu, J. Botina, and H. Rabitz, J. Chem. Phys. 108, 1953 (1998).\n[11] W. H. Miller, J. Phys. Chem. A 105, 2942 (2001).\n[12] R. S. Judson and H. Rabitz, Phys. Rev. Lett. 68, 1500 (1992).\n[13] T. Takami, H. Fujisaki, and T. Miyadera, unpublished.\n[14] T. Terashima, M. Shiga, and S. Okazaki, J. Chem. Phys. 114, 5663 (2001).\n\n\f"}