{"id": "http://arxiv.org/abs/quant-ph/0303075v1", "guidislink": true, "updated": "2003-03-12T15:06:05Z", "updated_parsed": [2003, 3, 12, 15, 6, 5, 2, 71, 0], "published": "2003-03-12T15:06:05Z", "published_parsed": [2003, 3, 12, 15, 6, 5, 2, 71, 0], "title": "Activation-like processes at zero temperature", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=quant-ph%2F0303016%2Cquant-ph%2F0303090%2Cquant-ph%2F0303059%2Cquant-ph%2F0303174%2Cquant-ph%2F0303026%2Cquant-ph%2F0303156%2Cquant-ph%2F0303161%2Cquant-ph%2F0303020%2Cquant-ph%2F0303081%2Cquant-ph%2F0303169%2Cquant-ph%2F0303092%2Cquant-ph%2F0303147%2Cquant-ph%2F0303151%2Cquant-ph%2F0303141%2Cquant-ph%2F0303098%2Cquant-ph%2F0303031%2Cquant-ph%2F0303120%2Cquant-ph%2F0303135%2Cquant-ph%2F0303008%2Cquant-ph%2F0303182%2Cquant-ph%2F0303004%2Cquant-ph%2F0303110%2Cquant-ph%2F0303084%2Cquant-ph%2F0303019%2Cquant-ph%2F0303126%2Cquant-ph%2F0303055%2Cquant-ph%2F0303152%2Cquant-ph%2F0303003%2Cquant-ph%2F0303180%2Cquant-ph%2F0303075%2Cquant-ph%2F0303011%2Cquant-ph%2F0303133%2Cquant-ph%2F0303113%2Cquant-ph%2F0303109%2Cquant-ph%2F0303036%2Cquant-ph%2F0303157%2Cquant-ph%2F0303038%2Cquant-ph%2F0303029%2Cquant-ph%2F0303009%2Cquant-ph%2F0303006%2Cquant-ph%2F0303064%2Cquant-ph%2F0303107%2Cquant-ph%2F0303005%2Cquant-ph%2F0303069%2Cquant-ph%2F0303187%2Cquant-ph%2F0303105%2Cquant-ph%2F0303048%2Cquant-ph%2F0303044%2Cquant-ph%2F0303021%2Cquant-ph%2F0303039%2Cquant-ph%2F0303124%2Cquant-ph%2F0303047%2Cquant-ph%2F0303041%2Cquant-ph%2F0303001%2Cquant-ph%2F0303112%2Cquant-ph%2F0303164%2Cquant-ph%2F0303014%2Cquant-ph%2F0303172%2Cquant-ph%2F0303089%2Cquant-ph%2F0303183%2Cquant-ph%2F0303017%2Cquant-ph%2F0303010%2Cquant-ph%2F0303153%2Cquant-ph%2F0303184%2Cquant-ph%2F0303167%2Cquant-ph%2F0303123%2Cquant-ph%2F0303083%2Cquant-ph%2F0303060%2Cquant-ph%2F0303166%2Cquant-ph%2F0303022%2Cquant-ph%2F0303043%2Cquant-ph%2F0303160%2Cquant-ph%2F0303150%2Cquant-ph%2F0303077%2Cquant-ph%2F0303078%2Cquant-ph%2F0303128%2Cquant-ph%2F0303079%2Cquant-ph%2F0303111%2Cquant-ph%2F0303086%2Cquant-ph%2F0303142%2Cquant-ph%2F0303091%2Cquant-ph%2F0303062%2Cquant-ph%2F0303125%2Cquant-ph%2F0303015%2Cquant-ph%2F0303140%2Cquant-ph%2F0303049%2Cquant-ph%2F0303138%2Cquant-ph%2F0303100%2Cquant-ph%2F0303134%2Cquant-ph%2F0303181%2Cquant-ph%2F0303057%2Cquant-ph%2F0303146%2Cquant-ph%2F0303119%2Cquant-ph%2F0303068%2Cquant-ph%2F0303122%2Cquant-ph%2F0303085%2Cquant-ph%2F0303132%2Cquant-ph%2F0303052%2Cquant-ph%2F0303063%2Cquant-ph%2F0303108%2Cquant-ph%2F0303088&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Activation-like processes at zero temperature"}, "summary": "We examine the possibility that a metastable quantum state could experiment a\nphenomenon similar to thermal activation but at zero temperature. In order to\ndo that we study the real-time dynamics of the reduced Wigner function in a\nsimple open quantum system: an anharmonic oscillator with a cubic potential\nlinearly interacting with an environment of harmonic oscillators. Our results\nsuggest that this activation-like phenomenon exists indeed as a consequence of\nthe fluctuations induced by the environment and that its associated decay rate\nis comparable to the tunneling rate as computed by the instanton method, at\nleast for the particular potential of the system and the distribution of\nfrequencies for the environment considered in this paper. However, we are not\nable to properly deal with the term which leads to tunneling in closed quantum\nsystems, and a definite conclusion cannot be reached until tunneling and\nactivation-like effects are considered simultaneously.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=quant-ph%2F0303016%2Cquant-ph%2F0303090%2Cquant-ph%2F0303059%2Cquant-ph%2F0303174%2Cquant-ph%2F0303026%2Cquant-ph%2F0303156%2Cquant-ph%2F0303161%2Cquant-ph%2F0303020%2Cquant-ph%2F0303081%2Cquant-ph%2F0303169%2Cquant-ph%2F0303092%2Cquant-ph%2F0303147%2Cquant-ph%2F0303151%2Cquant-ph%2F0303141%2Cquant-ph%2F0303098%2Cquant-ph%2F0303031%2Cquant-ph%2F0303120%2Cquant-ph%2F0303135%2Cquant-ph%2F0303008%2Cquant-ph%2F0303182%2Cquant-ph%2F0303004%2Cquant-ph%2F0303110%2Cquant-ph%2F0303084%2Cquant-ph%2F0303019%2Cquant-ph%2F0303126%2Cquant-ph%2F0303055%2Cquant-ph%2F0303152%2Cquant-ph%2F0303003%2Cquant-ph%2F0303180%2Cquant-ph%2F0303075%2Cquant-ph%2F0303011%2Cquant-ph%2F0303133%2Cquant-ph%2F0303113%2Cquant-ph%2F0303109%2Cquant-ph%2F0303036%2Cquant-ph%2F0303157%2Cquant-ph%2F0303038%2Cquant-ph%2F0303029%2Cquant-ph%2F0303009%2Cquant-ph%2F0303006%2Cquant-ph%2F0303064%2Cquant-ph%2F0303107%2Cquant-ph%2F0303005%2Cquant-ph%2F0303069%2Cquant-ph%2F0303187%2Cquant-ph%2F0303105%2Cquant-ph%2F0303048%2Cquant-ph%2F0303044%2Cquant-ph%2F0303021%2Cquant-ph%2F0303039%2Cquant-ph%2F0303124%2Cquant-ph%2F0303047%2Cquant-ph%2F0303041%2Cquant-ph%2F0303001%2Cquant-ph%2F0303112%2Cquant-ph%2F0303164%2Cquant-ph%2F0303014%2Cquant-ph%2F0303172%2Cquant-ph%2F0303089%2Cquant-ph%2F0303183%2Cquant-ph%2F0303017%2Cquant-ph%2F0303010%2Cquant-ph%2F0303153%2Cquant-ph%2F0303184%2Cquant-ph%2F0303167%2Cquant-ph%2F0303123%2Cquant-ph%2F0303083%2Cquant-ph%2F0303060%2Cquant-ph%2F0303166%2Cquant-ph%2F0303022%2Cquant-ph%2F0303043%2Cquant-ph%2F0303160%2Cquant-ph%2F0303150%2Cquant-ph%2F0303077%2Cquant-ph%2F0303078%2Cquant-ph%2F0303128%2Cquant-ph%2F0303079%2Cquant-ph%2F0303111%2Cquant-ph%2F0303086%2Cquant-ph%2F0303142%2Cquant-ph%2F0303091%2Cquant-ph%2F0303062%2Cquant-ph%2F0303125%2Cquant-ph%2F0303015%2Cquant-ph%2F0303140%2Cquant-ph%2F0303049%2Cquant-ph%2F0303138%2Cquant-ph%2F0303100%2Cquant-ph%2F0303134%2Cquant-ph%2F0303181%2Cquant-ph%2F0303057%2Cquant-ph%2F0303146%2Cquant-ph%2F0303119%2Cquant-ph%2F0303068%2Cquant-ph%2F0303122%2Cquant-ph%2F0303085%2Cquant-ph%2F0303132%2Cquant-ph%2F0303052%2Cquant-ph%2F0303063%2Cquant-ph%2F0303108%2Cquant-ph%2F0303088&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We examine the possibility that a metastable quantum state could experiment a\nphenomenon similar to thermal activation but at zero temperature. In order to\ndo that we study the real-time dynamics of the reduced Wigner function in a\nsimple open quantum system: an anharmonic oscillator with a cubic potential\nlinearly interacting with an environment of harmonic oscillators. Our results\nsuggest that this activation-like phenomenon exists indeed as a consequence of\nthe fluctuations induced by the environment and that its associated decay rate\nis comparable to the tunneling rate as computed by the instanton method, at\nleast for the particular potential of the system and the distribution of\nfrequencies for the environment considered in this paper. However, we are not\nable to properly deal with the term which leads to tunneling in closed quantum\nsystems, and a definite conclusion cannot be reached until tunneling and\nactivation-like effects are considered simultaneously."}, "authors": ["Daniel Arteaga", "Esteban Calzetta", "Albert Roura", "Enric Verdaguer"], "author_detail": {"name": "Enric Verdaguer"}, "author": "Enric Verdaguer", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1023/A:1025758616106", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/quant-ph/0303075v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/quant-ph/0303075v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "24 pages, 1 figure. To appear in the proceedings of the 7th Peyresq\n  meeting", "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/quant-ph/0303075v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/quant-ph/0303075v1", "journal_reference": "Int. J. Theor. Phys. 42, 1257-1280 (2003)", "doi": "10.1023/A:1025758616106", "fulltext": "Activation-like processes at zero temperature\n\narXiv:quant-ph/0303075v1 12 Mar 2003\n\nDaniel Arteaga∗,a , Esteban Calzetta†,b , Albert Roura‡,c ,\nand Enric Verdaguer§,a\na Departament\n\nde Fı́sica Fonamental\nand CER en Astrofı́sica, Fı́sica de Partı́cules i Cosmologia,\nUniversitat de Barcelona, Av. Diagonal 647, 08028 Barcelona, Spain.\nb Departamento\n\nde Fı́sica, Universidad de Buenos Aires,\nCiudad Universitaria, 1428 Buenos Aires, Argentina.\nc Department\n\nof Physics, University of Maryland,\nCollege Park, Maryland 20742–4111.\nAbstract\n\nWe examine the possibility that a metastable quantum state could experiment a phenomenon similar to thermal activation but at zero temperature. In order to do that we study the real-time dynamics of the reduced\nWigner function in a simple open quantum system: an anharmonic oscillator with a cubic potential linearly interacting with an environment of harmonic oscillators. Our results suggest that this activation-like phenomenon\nexists indeed as a consequence of the fluctuations induced by the environment and that its associated decay rate is comparable to the tunneling rate\nas computed by the instanton method, at least for the particular potential\nof the system and the distribution of frequencies for the environment considered in this paper. However, we are not able to properly deal with the\nterm which leads to tunneling in closed quantum systems, and a definite\nconclusion cannot be reached until tunneling and activation-like effects are\nconsidered simultaneously.\n\n1\n\nIntroduction\n\nThe study of the decay rate of a state trapped in a metastable state by a potential barrier has a long and distinguished history both in statistical physics and\nin quantum mechanics. In statistical mechanics one is usually worried about the\nthermal activation effect, by which a particle escapes over a potential barrier\ndue to the fluctuations induced by a thermal bath. As a paradigm we have the\n∗\n\nElectronic\nElectronic\n‡\nElectronic\n§\nElectronic\n\n†\n\naddress:\naddress:\naddress:\naddress:\n\ndarteaga@ffn.ub.es.\ncalzetta@df.uba.ar.\nroura@physics.umd.edu.\nverdague@ffn.ub.es.\n\n1\n\n\fclassical work by Kramers (1940), who considered a classical Brownian particle trapped in a metastable minimum and computed the escape probability by\nanalyzing the dynamics of its probability distribution function, both in the underdamped and overdamped cases. In quantum mechanics one is interested in\nthe tunneling effect, by which a particle escapes the local minimum by traversing\nthe potential barrier through a classically forbidden region. A technique which\nhas been of great success to compute the tunneling rate in quantum mechanics\nand quantum field theory is the instanton method (Coleman, 1977; Callan and\nColeman, 1977; Coleman, 1985), where the decay probability can be computed in\nterms of the classical trajectories in imaginary time. In both thermal activation\nand tunneling the decay rate r, meaning the decay probability per unit time,\nfollows an approximate exponential law, r ≈ A exp (−B). In thermal activation,\nB = Vs /(kT ), where k is Boltzmann's constant, T is the absolute temperature\nand Vs is the height of the free energy measured from the metastable minimum;\nin tunneling B = SE /~, where SE is the action for a suitable trajectory which\ngoes under the barrier in imaginary time.\nIn recent years mesoscopic physics has become a center of attention. Experimental advances are pushing the boundaries between classical and quantum\nsystems and lead, in particular, to the possibility of observing quantum tunneling for systems that can be described by macroscopic variables. These are\nessentially open quantum systems, which are characterized by a distinguished\nsubsystem within a larger closed quantum system, described by some degrees\nof freedom which are subject to physical experimentation, and the rest of the\nsystem, described by generally unobservable degrees of freedom which act as an\nenvironment or bath for the distinguished subsystem. The environment induces\nboth dissipation and noise to the distinguished system, which is usually referred\nto as the \"system\" for short. Many of these open quantum systems can be equivalently represented by a particle subject to an arbitrary external potential and\ncoupled to an environment consisting of an infinite set of independent harmonic\noscillators. A number of known physical systems can be modelled by adjusting\nthe coupling of the system and environment variables and choosing appropriate\npotentials.\nCaldeira and Leggett (1981, 1983b), in two influential papers, considered the\neffect of an environment on quantum tunneling. They were able to generalize\nthe instanton method to a simple open quantum system. In particular, they\nconsidered an anharmonic quadratic plus cubic potential bilinearly coupled an\nenvironment at zero temperature consisting of an infinite set of harmonic oscillators, with frequencies distributed according to the so-called ohmic distribution.\nThey argued that this system is a very good model for the flux trapped in\na superconducting quantum interference device (SQUID), a single Josephson\njunction biased by a fixed external current, and others. Assuming that the environment degrees of freedom are only weakly perturbed by the interaction with\n2\n\n\fthe system, they concluded that dissipation always tends to suppress tunneling.\nFujikawa et al. (1992a,b) reanalyzed the same problem as Caldeira and\nLeggett employing canonical perturbation theory and the second quantization\nformalism for the system instead of the instanton method, with a quadratic plus\nquartic potential in order to have a well-defined ground state. By considering\nthe two lowest energy eigenstates of the system they were able to reproduce\nCaldeira and Leggett's results. They studied the effect of the next two excited\nstates and concluded that, once these states are taken into account, dissipation\ncan enhance tunneling for some distributions of frequencies of the environment,\nbut not for the ohmic distribution considered by Caldeira and Leggett.\nIn some recent papers a different real-time approach to compute the vacuum\ndecay rate in quantum field theory was introduced (Calzetta et al., 2001, 2002)\nas a first step to consider situations far from the equilibrium. The analysis is\nbased on the time evolution equation, the so-called master equation, for the\nreduced Wigner function describing the open quantum system. The quantum\nfield theory problem was reduced to an open quantum system described by a\nsingle degree of freedom associate to the modes of the field which are nearly\nhomogeneous within a region whose size corresponds to a nucleating bubble of\ntrue vacuum, and coupled to an infinite set of harmonic oscillators corresponding\nto the inhomogeneous modes of the field. The coupling was linear in the system\nvariables but quadratic in the environment ones. The master equation contained\ndissipation and noise terms, which describe the influence of the environment on\nthe system, as well as derivative terms in the momentum coordinates (third\norder for a cubic potential), which are responsible for quantum tunneling in\nclosed quantum systems.\nUnfortunately it is not possible to compute the total decay rate in a closed\nanalytic or semianalytic form because it is very difficult to deal with the third\norder derivative terms. One should resort to methods such as those based on\nmatrix continued fractions in order to compute the decay rate master equations\nwith third-order derivative terms (Risken and Vogel, 1988). However in the work\nby Calzetta et al. (2001, 2002), as well as in the present paper, one was primarily\ninterested in the contribution from the environment backreaction on the vacuum\ndecay rate and, hence, the rather drastic approximation of neglecting the third\nderivative term responsible for tunneling was made. The decay rate obtained\nwas entirely due to the terms which at high temperature are responsible for\nthermal activation. In principle this approximation should be correct provided\nthat the timescales associated to the activation-like effect and the tunneling\neffect are very different. The remarkable result was that the activation-like\neffect produced by the backreaction of the inhomogeneous modes was, in fact,\nlarger that the tunneling effect obtained with the instanton method.\nThe fact that activation may be important as a backreaction effect can be\nunderstood by noting that the characteristic timescale for the decay process is\n3\n\n\fmuch larger than the dynamical and relaxation timescales; see Calzetta and\nVerdaguer (1999) for a detailed analysis. In fact, although the effects of dissipation and noise are very small on the characteristic dynamical timescale, they\ncan have a cumulative effect which becomes important in the long run. The real\ntime approach based on the master equation seems a suitable technique to deal\nwith those backreaction effects, but is difficult to implement when addressing\nthe tunneling effect. On the other hand, the instanton method is very well suited\nfor studying the tunneling effect, but, at least in some cases, seems to underplay\nthe backreaction of the environment on the system.\nThe aim of this paper is to study whether the results obtained by Calzetta\net al. (2001, 2002) are a particular feature of the particular system that they\nconsidered or, on the contrary, a general feature which can be extended to a\nwider class of systems. Therefore, using the real-time techniques mentioned\nabove, we reanalyze the simpler model studied by Caldeira and Leggett (1981,\n1983b), in order to check whether a similar activation-like effect is also found in\nthat case.\nThere are several differences between the model considered in this paper\nand the field theory case analyzed by Calzetta et al. (2001, 2002). First, we\nconsider here a bilinear coupling between the system and environment, whereas\nthe coupling considered in the field theory case was quadratic in the environment\ndegrees of freedom. Second, in the field theory case both the spectral distribution\nof the environment frequencies and the value of the coupling constant were a\npriori determined by the particular system-environment separation considered\nthere, whereas we shall freely choose the spectral distribution and the coupling\nparameter. Third, we will employ several techniques (harmonic approximation,\nKramers method and lowest eigenvalue expansion) which could not be applied\nto the field theory problem because of the particular features of that model.\nThe plan of the paper is the following. In section 2 we set up the model.\nIn section 3, we present the master equation for the reduced Wigner function.\nThen, following closely Calzetta et al. (2002), we neglect the third order derivative term and concentrate on the weak dissipation case by studying the averaged\ndynamics over an oscillation period. In section 4 we obtain an analytical expression for the decay rate by assuming a harmonic approximation for the classical\ntrajectories. Two alternative approaches are employed. The first one is based\non a perturbative expansion for the lowest eigenvalue, whereas the second one\nis based on Kramers's classical work. Finally, in section 5 we discuss the implications of our result.\n\n2\n\nThe open quantum system model\n\nLet us consider a particle of mass M , the \"system\", subject to an arbitrary\npotential V (x) and coupled to a bath of independent harmonic oscillators of\n4\n\n\fmass m, the \"environment\". Let us assume that the system and the environment\nare linearly coupled. The action for the whole set of degrees of freedom is given\nby\nS[x, {qj }] = Ss [x] + Se [{qj }] + Sint [x, {qj }],\n(1a)\nwhere the terms on the right-hand side, which correspond to the action of the\nsystem, the environment and the interaction term respectively, are given by\n\u0013\n\u0012\nZ\n1\n2\nM ẋ − V (x) ,\n(1b)\nSs [x] = dt\n2\n\u0012\n\u0013\nXZ\n1 2 1\n2 2\nSe [{qj }] =\ndt\nmq̇ − mωj qj ,\n(1c)\n2 j 2\nj\nX Z\nSint [x, {qj }] =\ncj dt x(t)qj (t),\n(1d)\nj\n\nwith cj being the system-environment coupling parameters and ωj the environment oscillator frequencies. The system potential V (x) includes a quadratic\npart, corresponding to an oscillator of frequency Ω0 , and an anharmonic part\nV (nl) ,\n1\n(2)\nV (x) = Ω20 x2 + V (nl) (x).\n2\nAt this point, the potential V (nl) (x) is arbitrary, but later on we will take a\ncubic potential V (nl) (x) = −(λ/6)x3 . It will be convenient for us to rewrite the\ninteraction term as\nZ\nZ ∞\n2mω\nI(ω) dt x(t)q(t; ω),\n(3)\nSint [x, {qj }] =\nπc(ω)\n0\nwhere c(ω) and q(t; ω) are functions such that c(ωj ) = cj and q(t; ωj ) = qj (t)\nand\nX πc2j\nI(ω) =\nδ(ω − ωj )\n(4)\n2mωj\nj\n\nis the spectral density of the environment.\nWhen the system and the environment are initially uncorrelated, i.e., when\nthe initial density matrix factorizes, the evolution for the reduced density matrix\ncan be written as\nZ\n′\nρr (x, x , t) = dxi dx′i J(x, x′ , t; xi , x′i , ti )ρr (xi , x′i , ti ),\n(5)\nwhere the propagator J is found to be, in a path integral representation,\nJ(xf , x′f , t; xi , x′i , ti ) =\n\nx(t)=x\nZ f\nx(ti )=xi\n\nDx\n\n′\nx′ (t)=x\nZ f\n\nx′ (ti )=x′i\n\n5\n\n′\n\n′\n\nDx ′ e i(S[x]−S[x ]+SIF [x,x ])/~\n\n(6)\n\n\fwhere SIF [x, x′ ] is the influence action, related to the influence functional FIF introduced by Feynman and Vernon (1963) through FIF [x, x′ ] = exp (iSIF [x, x′ ]/~).\nFor a Gaussian initial density matrix for the environment, the influence action\ncan be expressed as (Feynman and Vernon, 1963; Feynman and Hibbs, 1965;\nCaldeira and Leggett, 1983a):\n′\n\nSIF [x, x ] = − 2\ni\n+\n2\n\nZ\n\nt\n\nds\n\nds′ ∆(s)D(s, s′ )Σ(s′ )\n\nti\n\nti\n\nZ\n\ns\n\nZ\n\nt\n\nds\nti\n\nZ\n\nt\n\n(7)\n′\n\n′\n\n′\n\nds ∆(s)N (s, s )∆(s ),\n\nti\n\nwhere Σ ≡ (x + x′ )/2 and ∆ ≡ x′ − x. The kernels D(t, t′ ) and N (t, t′ ) are called\nthe dissipation and noise kernels, respectively. If initially we are at thermal\nequilibrium at a temperature T these kernels are given by:\nZ ∞\ndω\n′\nD(t, t ) =\nI(ω) sin ω(t − t′ ),\n(8a)\nπ\n0\n\u0012\n\u0013\nZ ∞\n~ω\ndω\nI(ω) coth\ncos ω(t − t′ ).\n(8b)\nN (t, t′ ) =\nπ\n2kT\n0\nThe influence action can be divergent and a renormalization procedure may\nbe required, as can be seen by reexpressing the influence action as\nZ t\nZ t\n′\nds′ ∆(s)H(s, s′ )Σ(s′ )\nds\nSIF [x, x ] =\nti\nti\n(9)\nZ t\nZ\ni t\n′\n′\n′\n+\nds ∆(s)N (s, s )∆(s ),\nds\n2 ti\nti\nwhere, at least formally, H(t, t′ ) ≡ −2θ(t − t′ )D(t, t′ ), being θ(t − t′ ) the step\nfunction. The kernel H(t, t′ ) is a product of two distributions, which in general is\nnot well defined and may contain divergences. Nevertheless, it is always possible\nto introduce suitable counterterms in the bare frequency of the system Ω0 in\norder to compensate the divergent terms coming from H(t, t′ ). See Caldeira and\nLeggett (1983a); Roura and Verdaguer (1999); Calzetta et al. (2003) for more\ndetails. However in the particular problem in which we are interested this issue\nwill turn to be unimportant since the divergent parts of the kernel H(t, t′ ) will\ncancel in the final results. Thus, we can use the bare kernel H(t, t′ ) (with some\nimplicit regularization) instead of its renormalized expression.\nFollowing Caldeira and Leggett (1981, 1983b) we shall consider the case of\nzero temperature and ohmic environment, in which we have a continuum of\nharmonic oscillators in the environment distributed according to:\nI(ω) = ηω.\n6\n\n(10)\n\n\fWith this spectral density the expectation value of x̂(t) obeys the equation of\nmotion of a classical damped oscillator with a friction coefficient given by the\nproportionality constant η. In this case dissipation and noise kernels are found\nto be:\nD(t, t′ ) = ηδ′ (t − t′ ),\nη\n−1\nN (t, t′ ) = Pf\n,\nπ\n(t − t′ )2\n\n(11a)\n(11b)\n\nwhere Pf indicates the Hadamard finite part prescription (Schwartz, 1957).\nLater on we will need the expressions of the Fourier transforms of the noise\nand dissipation kernels,\nZ\ndω −iω(t−t′ )\n′\ne\nD̃(ω),\n(12a)\nD(t, t ) =\n2π\nZ\ndω −iω(t−t′ )\ne\nN (t, t′ ) =\nÑ (ω),\n(12b)\n2π\nwhich in the case of zero temperature and ohmic environment are given by\nD̃(ω) = iηω,\n\nÑ (ω) = η|ω|.\n\n(13)\n\nV\n\nεs\n\nxs\n\nx\n\nFigure 1: Plot of the potential V (x) under which the particle is confined. The\nmaximum of the potential barrier is at xs and corresponds to an escape energy\nεs , which we consider much larger than the zero point energy of the harmonic\noscillator, ~Ω0 /2.\nWe will concentrate on the potential V (x) = (1/2)M Ω20 x2 − (λ/6)x3 , which\nexhibits a metastable minimum at x = 0 and an unstable maximum at x = xs =\n2M Ω20 /λ, which corresponds to an energy εs = V (xs ) = 2M 3 Ω60 /(3λ2 ) (see Fig.\n1). The system state will be peaked located around the metastable minimum at\n7\n\n\fx = 0, and can escape through the potential barrier. We will consider that once\nthe particle exits the potential well region, it never reenters. Since this potential\nis not bounded from below, it should be understood as an approximation to a\nmore realistic situation in which there exists an absolute minimum, located at a\nmuch lower energy, so that the return probability is negligible. We will restrict\nto the situation in which the energy barrier is much larger than ~Ω0 .\n\n3\n3.1\n\nPhase-space dynamics\nEvolution of the reduced Wigner function\n\nThe reduced Wigner function Wr is a phase space distribution defined from the\nreduced density matrix ρr by the following integral transform:\nZ ∞\n1\nWr (x, p, t) =\nd∆ e ip∆/~ ρr (x − ∆/2, x + ∆/2, t).\n(14)\n2π~ −∞\nThe Wigner function is a quantum mechanical analogue of a phase space probadistribution (Wigner, 1932; Hillery et al., 1984). The partial distribution\nRbility\n∞\ndp\nWr (x, p, t) gives the probability density of finding the system at the po−∞\nR∞\nsition x; in the same way, −∞ dx Wr (x, p, t) gives the probability density of\nfinding the system with momentum p. However, the uncertainty principle prevents us from determining at the same time the position and the momentum of a\nparticle, so that the Wigner function cannot be interpreted as a true probability\ndensity in phase space. In fact, the Wigner function it is not necessarily positive\ndefined everywhere and in general it may acquire negative values.\nUp to terms of order c2j , ~c2j , and ~2 , with cj being the environment coupling\nconstants, the reduced Wigner function Wr = Wr (x, p, t) obeys the following evolution equation (Calzetta et al., 2002; Roura, 2001), which we shall call master\nequation:\n∂\nλ ∂ 3 Wr\n∂Wr\n= {Hs , Wr }PB +\n(DWr + ~{N , Wr }PB ) − ~2\n,\n∂t\n∂p\n24 ∂p3\n\n(15)\n\nwhere {*, *}PB are the Poisson brackets,\n{f, g}PB =\n\n∂f ∂g ∂f ∂g\n−\n,\n∂x ∂p\n∂p ∂x\n\nHs is the reduced system Hamiltonian,\nHs =\n\np2\n1\nλ\n+ M Ω20 x2 − x3 ,\n2M\n2\n6\n\n8\n\n(16)\n\n\fand D and N are given by\nD(t) = −2\nN (t) =\n\nZ\n\nt\n\nZ\n\nt\n\ndt′ D(t, t′ )X (t′ ; x, p),\n\n(17a)\n\nti\n\ndt′ N (t, t′ )X(t′ ; x, p),\n\n(17b)\n\nti\n\nwhere X (t′ ; x, p) is a solution of the classical equations of motion associated to\nthe hamiltonian Hs ,\ndX\nP\n=\n,\ndt′\nM\nX2\ndP\n2\n,\n=\n−M\nΩ\nX\n+\nλ\n0\ndt′\n2\n\n(18a)\n(18b)\n\nwith final conditions X(t) = x and P (t) = p.\nFor the case of ohmic environment the friction coefficient η is proportional\nto c2j , and the above approximation for the evolution equation will be valid and\nconsistent when the condition S ≫ ~ & Sγ/Ω0 is fulfilled, where γ ≡ η/(2M )\nis the characteristic dissipation frequency and S is the typical action for the\nprocess considered. If we are interested in studying the jump over a potential\nbarrier of height εs this condition can be restated as εs ≫ ~Ω0 & εs γ/Ω0 , which\nshows that the master equation will be valid for small dissipation and large\nenergy barriers.\nAt this point it is worth making a comment on the notation. Throughout\nthis paper we will use lowercase letters (x, p, θ, j . . .) to indicate phase-space variables, which are the arguments of phase-space distributions such as the Wigner\nfunction, whereas the corresponding uppercase letters (X, P, Θ, J . . .) will indicate time-functions which give the phase-space position of a particle in a given\ntime.\nIn order to introduce the Fourier transform of the coefficients D and N later\non, it will be convenient for us to replace the integration limit in Eqs. (17a)\nand (17b) by −∞, although the initial conditions are set up at ti = 0. For the\ncoefficient D this does not introduce any error, since the dissipation kernel only\nhas support in t = t′ . For the coefficient N , this introduces a small error, which\ncan be estimated by performing the integral in Eq. (17a), choosing a periodic\nfunction for X(t′ ) of frequency Ω0 ; this will be enough in the context of the\nadiabatic approximation, which we will introduce later on. The result of the\ncalculation shows that for times t which verify t ≫ Ω−1\nthe contribution of\n0\nthe integral from −∞ to 0 is comparatively small. Since at the end we shall be\ninterested in studying time scales of the order of the decay time, which are much\nlarger than the characteristic dissipation time γ −1 , which will in turn be much\nlarger than the time of oscillation Ω−1\n0 , the approximation can be considered\nsafe.\n9\n\n\fIf the system were isolated, Eq. (15) would reduce to\nλ ∂3W\n∂W\n= {Hs , W }PB − ~2\n,\n∂t\n24 ∂p3\n\n(19)\n\nwhere W is the Wigner function of the closed system. This equation is exactly\nequivalent to von Neumann's equation for the density matrix of a one dimensional quantum mechanical system with the potential V (x). If the last term in\nthis equation were not present, the evolution of the Wigner function would be\nentirely equivalent to that of a classical ensemble in the phase space. Hence,\nthe term with the third derivatives must be the responsible for tunneling. In\nprinciple, one could compute the tunneling amplitude from Eq. (19), but in\npractice tunneling is more easily calculated with the WKB approximation to\nthe Schrödinger equation (see, e.g., Galindo and Pascual, 1991; Landau and\nLifshitz, 1977) or the instanton method (Coleman, 1977; Callan and Coleman,\n1977; Coleman, 1985). As we have discussed, in this contribution we are not\ngoing to deal with tunneling, but rather to compute the effect due to activation.\nWith this aim, we shall neglect the last term of Eq. (15), which is the responsible for tunneling. Hence we will use the following equation for the distribution\nfunction Wr :\n∂\n∂Wr\n= {Hs , Wr }PB +\n(DWr + ~{N , Wr }PB ) .\n∂t\n∂p\n\n(20)\n\nFormally Eq. (20) can be thought as a Fokker-Planck equation, describing\nthe dynamics of an ensemble of points in the phase space. The dynamics of\nthis ensemble of points can be equally characterized by means of the following\nLangevin equation:\nẊs =\n\nPs\n,\nM\n\n(21a)\n\nṖs = −V ′ (Xs ) −\n=\n\n−M Ω20 Xs\n\nZ\n\n∞\n\ndt ′ H(t, t′ )Xs (t′ ) + ξ\n\n−∞\n\nX2\n− η Ẋs + λ s + ξ,\n2\n\n(21b)\n\nwhere ξ is a Gaussian noise of zero mean and correlation function\nξ(t)ξ(t′ )\n\nξ\n\n= ~N (t, t′ ),\n\n(21c)\n\nXs = Xs (t, ξ] and Ps = Ps (t, ξ] are the stochastic functions corresponding to the\nphase space variables x and p respectively, and the second equality in Eq. (21b)\nis just valid in the case of ohmic environment. This Langevin equation does\nnot describe actual trajectories of the system (meaning a continuous sequence\nof projectors for the position and the momentum of the system at each instant\n10\n\n\fof time, which would violate Heisenberg's uncertainty principle) but must be\nregarded as a formal computational tool, in the same way as the Wigner function does not correspond to a true probability density. In fact, Langevin-like\nequations appear naturally in the context of open quantum systems when trying\nto derive the dynamics of the reduced Wigner function from the path integrals\nin Eq. (5) (Calzetta et al., 2003).\n\n3.2\n\nAction-angle variables\n\nIn order to obtain explicit expressions for the coefficients D and N , we need to\nsolve the set of Eqs. (18), which describe the motion of a classical particle in the\npotential V (x). Since we are interested in the motion inside the potential well,\nwhich is periodic, it is possible to introduce action-angle variables θ and j (see,\ne.g., Goldstein, 1980). The action variable is defined by\nI\n1\nP dX,\n(22)\nj=\n2π\nwhereas the angle variable θ changes from zero to 2π and is canonically conjugate\nto j. Recall that the reduced system Hamiltonian can be entirely written in\nterms of the action variable, Hs = Hs (j).\nWe shall consider θ and j phase-space variables like x and p, and we will\nanalyze the Fokker-Planck equation in terms of these new variables. However,\nthe solution of Eqs. (18) can be also described by giving the trajectory of the\nparticle in the θ–j space. In a completely analogous way to X and P , we will\nconsider the functions Θ(t′ ; θ, j) and J(t′ ; θ, j), which give the angular position\nand action of a particle satisfying the set of Eqs. (18), with final conditions\nΘ(t) = θ and J(t) = j. The functions Θ and J satisfy the equations of motion\nΘ̇ = ω(J) and J ̇ = 0, where ω(j) = dHs (j)/dj is the frequency of oscillation.\nWith the aforementioned boundary conditions, these equations of motion can\nbe immediately solved to give Θ(t′ ; θ, j) = θ + Ω(j)(t′ − t) and J(t′ ; θ, j) = j.\nSince θ is an angle, the transformation equation x = x(θ, j) is periodic in θ,\nx(θ, j) = x(θ + 2π, j) and thus it can be decomposed in terms of a Fourier series\nwith respect to θ,\n∞\nX\ne inθ xn (j),\n(23)\nx(θ, j) =\nn=−∞\n\nx∗n (j)\n\nwhere x−n (j) =\nsince x is real. The trajectory of the particle can be also\ndecomposed in terms of the Fourier series associated to the angular coordinate:\nX(t′ ; θ, j) =\n=\n\n∞\nX\n\nn=−∞\n∞\nX\n\n′\n\ne inΘ(t ;θ,j) xn (J(t′ ; θ, j))\n(24)\ne\n\nin[θ+Ω0 (t′ −t)]\n\nn=−∞\n\n11\n\nxn (j).\n\n\fThen we can write the functions D(t) and N (t) appearing in Eq. (20) as\nD(t) = −2\nN (t) =\n\nZ\n\nZ\n\nt\n\nt\n\n′\n\n′\n\n′\n\ndt D(t, t )X(t ) =\n−∞\n\ndt′ N (t, t′ )X(t′ ) =\n\n−∞\n\n∞\nX\n\ne inθ xn (j)Dn (j),\n\nn=−∞\n∞\nX\ninθ\n\ne\n\nxn (j)Nn (j),\n\n(25a)\n(25b)\n\nn=−∞\n\nwhere Dn (j) and Nn (j) are given by\nDn (j) =\n\nZ\n\ndω\n2iD̃(ω)\n,\n2π ω + nΩ(j) − iǫ\n\n(26a)\n\nNn (j) =\n\nZ\n\n−iÑ (ω)\ndω\n2π ω + nΩ(j) − iǫ\n\n(26b)\n\nIn order to\nR ∞derive these last expressions we have made use of the following\nequality: 0 exp(isu) = i/(s + iǫ), where ǫ is an arbitrarily small positive real\nnumber.\n\n3.3\n\nWeak dissipation limit: averaging over angles\n\nAs discussed by Kramers (1940), in the case of small dissipation, i.e., γ ≪ Ω0 ,\nthe phase space dynamics will mostly correspond to a gradual change of the\ndistribution of the ensemble over the different energy values. The change of\nthe Wigner function over an oscillation period will be small, so that we may\nsuppose that the reduced Wigner function only depends on the action variable\nj (or the energy E), and does not depend on the angular variable θ, Wr (θ, j) =\nF (j). Thus, we can obtain a simpler equation by averaging all the terms of\nthe Fokker-Planck equation over the variable θ. Furthermore, in this case the\naveraged Wigner function F is a partial distribution, and hence it admits a true\nprobabilistic interpretation, as opposed to the non-averaged Wigner function.\nNotice that in this case {Hs , F }PB = 0 and that, for any phase space function\nΨ = Ψ(θ, j),\n\u0012\n\u0013\nI\nI\nI\ndθ\ndθ ∂x ∂Ψ ∂x ∂Ψ\ndθ ∂Ψ\n=\n{x, Ψ}PB =\n−\n2π ∂p\n2π\n2π ∂θ ∂j\n∂j ∂θ\n\u0013\n\u0013\n\u0012\n\u0012\nI\nI\n2\ndθ ∂x ∂Ψ\n∂ x\nd\ndθ ∂x\n=\n+\nΨ =\nΨ .\n2π ∂θ ∂j\n∂j∂θ\ndj\n2π ∂θ\nUsing the last expression we can average Eq. (20) to obtain the following averaged Fokker-Planck equation:\n\u0013\n\u0012\n∂\n∂F\n∂F\n=\n+ D̄F ,\n(27)\n~N̄\n∂t\n∂j\n∂j\n12\n\n\fwhere we have introduced D̄(j) and N̄ (j), which are defined as follows:\nI\n∞\nX\ndθ ∂x\n|xn (j)|2 nDn (j),\nD = −i\nD̄ =\n2π ∂θ\nn=−∞\nI\n∞\nX\ndθ ∂x ∂N\nN̄ =\n|xn (j)|2 n2 Nn (j).\n=\n2π ∂θ ∂θ\nn=−∞\n\n(28a)\n(28b)\n\nEqs. (28a) and (28b) can be further simplified. Taking into account Eq. (26a)\nand the fact that 1/(z + iǫ) = P(1/z) − iπδ(z) we can write\nZ\ndω 2iD̃(ω)\nDn (j) = PV\n+ D̃(nΩ(j)),\n(29)\n2π ω + nΩ(j)\nwhere we took into account that D̃(ω) is an odd function. When summing over\nn in Eq. (28a), only the last term in Eq. (29) will contribute for every Dn . Since\nthe contributions from the first term in Dn and D−n cancel for each n because\nD(ω)\n2nD(ω)\nD(ω)\n−\n= 2\nω − nΩ(j) ω + nΩ(j)\nω − n2 Ω2 (j)\nis an odd function and integrates to zero. The final result for the coefficient D̄\nis\n∞\nX\n|xn (j)|2 nD̃(nΩ).\n(30a)\nD̄(j) = i\nn=−∞\n\nPerforming similar steps with Nn , we get the following expression for N̄ :\nN̄ (j) =\n\n∞\n1 X\n|xn (j)|2 n2 Ñ (nΩ).\n2 n=−∞\n\n(30b)\n\nParticularizing to the case of an ohmic environment initially at zero temperature, we have Ñ (ω) = η|ω|, D̃(ω) = iηω, which lead to\nD̄(j) = 2ηΩ(j)\n\n∞\nX\n\n|xn (j)|2 n2 ,\n\n(31a)\n\nn=0\n\nN̄ (j) = ηΩ(j)\n\n∞\nX\n\n|xn (j)|2 n3 .\n\n(31b)\n\nn=0\n\n4\n\nEnvironment induced decay rate\n\nOur aim in this section is to compute the environment induced decay rate by\nsolving the averaged Fokker-Planck equation, Eq. (27), with the appropriate\nboundary conditions. We begin by introducing a simplifying hypothesis.\n13\n\n\f4.1\n\nThe harmonic approximation\n\nThe non-dissipative dynamics described by (18) is approximately harmonic for\nenergies much lower than the escape energy εs . In this case the frequency of\nthat motion is simply Ω0 . For intermediate energies, the motion is qualitatively\nsimilar, but with a somewhat smaller frequency. It is only for energies extremely\nclose to the escape energy εs that the motion is substantially different: the\nparticle needs a very large amount of time to complete one period and hence\nthe frequency tends to zero.\nIn order to obtain an order of magnitude estimate of the escape rate, it\nis legitimate to approximate the classical motion of Eq. (18) by its harmonic\napproximation, since this approximation is qualitatively valid for all the values\nof the energy except for a very small region of energies extremely close to εs .1\nIn the case of vacuum decay in quantum field theory studied by Calzetta\net al. (2001, 2002) the harmonic approximation could not be introduced, since\nin that case there existed a frequency threshold with a value greater than Ω0\nin the dissipation, so that only Fourier modes with a frequency higher than\nthe threshold contributed to it. Hence it was crucial to consider the fully nonlinear dynamics of the system. On the other hand, in our case the noise and\ndissipation kernels do not exhibit such a threshold and it is possible to introduce\nthe harmonic approximation, which amounts to neglect the Fourier modes at\nhigher frequency in front of the lowest ones in the solution of Eq. (18).\nNeglecting the nonlinear term of the potential in Eq. (18b), the solution of\nthe equations of motion with final conditions X(t) = x and P (t) = p can be\nwritten as\n\u0013\n\u0013\n\u0012\n\u0012\n1\nip\nip\n1\n′\niΩ0 (t′ −t)\n′\ne\ne −iΩ0 (t −t) ,\n+\n(32a)\nx−\nx+\nX(t ) =\n2\nM Ω0\n2\nM Ω0\n′\n1\n′\n1\n(32b)\nP (t′ ) = (iM Ω0 x + p) e iΩ0 (t −t) + (−iM Ω0 x + p) e −iΩ0 (t −t) .\n2\n2\nThe frequency of the motion is simply given by Ω(j) = Ω0 , and thus the action\nvariable j is simply given by j = ε/Ω0 , being ε = p2 /(2M ) + Ω20 x2 /2 the energy.\nIn order to determine the action variable, we compare the solution for X(t′ )\nwith Eq. (24), and write\nr\nr\n′\n′\n1\n2j\n2j\n1\ni[θ+Ω\n(t\n−t)]\n0\ne\ne −i[θ+Ω0 (t −t)]\n+\n(33)\nX(t′ ) =\n2 M Ω0\n2 M Ω0\nwhere we have identified the angle variable θ as\n\n1\n\ne iθ = p\n\nM Ω0 x − ip\n(M Ω0 x)2 + p2\n\n.\n\n(34)\n\nIn fact, an exact solution of the equations of motion, together with a numerical analysis of the Fokker-Plank equation, reveal that the result that we will obtain here is not only\nqualitatively, but also quantitatively valid within the degree of approximation we are working.\n\n14\n\n\fThe decomposition of the x variable in terms of θ and j is given by\nr\nr\n1\n1\n2j\n2j\niθ\ne +\ne −iθ ,\nx(θ, j) =\n2 M Ω0\n2 M Ω0\nso that\n\n1\nx1 (j) = x−1 (j) =\n2\n\nr\n\n2j\n,\nM Ω0\n\nxn = 0,\n\nn 6= −1, 1.\n\n(35)\n\n(36)\n\nThe coefficients D̄(j) and N̄ (j) can be therefore expressed as\nD̄(j) = 2γj,\n\nN̄ (j) = γj,\n\n(37)\n\n[we recall that γ ≡ η/(2M )], and the averaged Fokker-Planck equation may be\nwritten as\n\u0013\n\u0012\n∂F\n∂ ~Ω0 ∂F\n= 2γ\nj\n+ Ω0 jF ,\n(38)\n∂t\n∂j\n2 ∂j\nor, equivalently, working with energies,\n\u0013\n\u0012\n∂\n∂F\n∂F\n= 2γ\n+ εF ,\nε0 ε\n∂t\n∂ε\n∂ε\n\n(39)\n\nwhere ε0 ≡ ~Ω0 /2. It can also be rewritten as a conservation equation,\n∂Φ\n∂F\n+\n= 0,\n∂t\n∂ε\n\n(40)\n\nwhere\n\u0012\n\n∂F\nΦ = −2γ ε0 ε\n+ εF\n∂ε\n\n\u0013\n\n(41)\n\nis the probability flux.\n\n4.2\n\nEscape rate: Normal mode analysis\n\nAssuming that the Fokker-Planck equation can be decomposed into a sum of\nnormal modes,\nX\nF (t, ε) =\ncr e −rt fr (ε),\n(42)\nr\n\nwe get the following time-independent equation:\n\u0013\n\u0012\nd\nd\nLfr + rfr = 0,\nL = 2γ\n+ε .\nε0 ε\ndε\ndε\n\n(43)\n\nThe boundary conditions of the partial differential equation are the following.\nFirst, we have assumed that the particle is removed once it arrives at the separatrix, so that there will be no probability to find the particle at the separatrix:\n15\n\n\ffr (εs ) = 0. Secondly, we will also assume a vanishing flux of incoming particles\nat ε = 0, i.e., Φ(0) = 0, which is equivalent to demanding the finiteness of fr\nand its derivative at ε = 0 (fr (0), fr′ (0) < ∞), as can be seen from Eq. (41) .\nThe normal-mode analysis can be formulated as a standard Sturm-Liouville\nproblem. The operator L, which may be written as\n\u0012\n\u0013\nd\nε/ε0 d\n−ε/ε0\ne\ne\nε\n+ 2γ,\n(44)\nL = 2γ\nε0\ndε\ndε\nis self-adjoint with the aforementioned boundary conditions and the scalar product defined by\nZ\nεs\n\n(f, g) = (2γ)−1\n\ndε e ε/ε0 f ∗ (ε)g(ε).\n\n(45)\n\n0\n\nThus, the theory of differential equations guarantees that the eigenfunctions\nfr (ε) constitute a complete orthogonal set, and that the eigenvalues r are real\n(Courant and Hilbert, 1953). Furthermore, the operator L is negative definite,\nwhich can be seen as follows:\n\u0014\nZ εs\n\u0010\n\u0011\u0015\nd\nε/ε0\n−ε/ε0 d\nε/ε0 ∗\ne\nf (ε)\nεe\ndε e\nf (ε)\n(f, Lf ) = ε0\ndε\ndε\n0\nZ εs\n\u00112\nd \u0010 ε/ε0\ne\ndε ε e −ε/ε0\n= −ε0\n< 0, f 6= 0,\nf (ε)\ndε\n0\nwhere we have integrated by parts in the last equality. This implies that the\neigenvalues r are always positive, as expected.\nPerforming the change of variables fr (ε) = 2γ e −y f ̄r̄ (y), where y ≡ ε/ε0 and\nr̄ ≡ r/(2γ), the differential equation Lfr = rfr adopts the form of the Laguerre\ndifferential equation,\ny f ̄r̄′′ (y) + (1 − y)f ̄r̄′ (y) + r̄fr̄ (y) = 0,\n\n(46)\n\nwhose unique regular solution is given by\nf ̄r̄ (y) = N Lr̄ (y),\n\n(47)\n\nwhere Lr̄ (y) are Laguerre functions (which reduce to the Laguerre polynomials\nin the case of non-negative integer r̄; see Gradsteyn and Ryzhik, 1980), and N\nis a normalization constant.\nThe solution we have found verifies the first of the boundary conditions, the\nregularity at the origin. Now we impose the second of the boundary conditions,\nnamely f ̄r̄ (ys ) = 0 (with ys ≡ εs /ε0 ). This boundary condition will imply a\ndiscretization on the possible values of the escape rate r. Finally, knowing\nthe initial state fi (ε) = F (0, ε), we will be able to reconstruct the solution by\ncomputing the coefficients cr :\n\u0012 \u0013\nZ εs\nε\nfi (ε).\n(48)\ndε L 2γr\ncr = (fr , fi ) = N\nε0\n0\n16\n\n\fUnfortunately, it is not possible to determine analytically the possible values\nof r̄ from the equation Lr̄ (ys ) = 0. However, if the potential barrier were infinitely high, the second boundary condition would read limy→∞ e −y Lr̄ (y) = 0,\nimplying that Lr̄ (y) should have, at most, a polynomial behavior at infinity, and\nthe eigenvalues would be r̄ = 0, 1, 2 . . ., so that eigenmodes with r̄ 6= 0 would\ndecay in a time given by γ −1 or shorter. However, the potential barrier corresponds to a some large but finite energy, and hence the real eigenvalues differ\nfrom those computed in the infinite barrier case by a small quantity, at least for\nthose eigenvalues corresponding to eigenstates with characteristic energies much\nlower than the potential barrier. Thus, we can compute them perturbatively.\nFurthermore, the relevant contribution to the decay rate will be given by the\nmode with the lowest eigenvalue, which will fulfill the condition r̄ ≪ 1, since the\nremaining modes will decay in a time of order γ −1 at most. Thus, we proceed\nto compute perturbatively the lowest order mode by expanding the Laguerre\nfunction around r̄ = 0:\nLr̄ (y) = 1 + r̄[ln y + γE − Ei(y)] + O(r̄ 2 ),\n\n(49)\n\nwhere γE = 0.577216 . .R. is Euler's constant, and Ei(y) is the exponential integral\ny\ndefined as Ei(y) ≡ PV −∞ (e u /u) du. The expansion in Eq. (49) can be found by\nsolving perturbatively Eq. (46) up to order r̄, and imposing the correct boundary\ncondition at y = 0.\nTherefore, imposing the boundary condition Lr̄ (ys ) = 0 is equivalent to\ndemanding\n2γ\n.\n(50)\nr = 2γr̄ ≈\nEi(εs /ε0 ) − ln(εs /ε0 ) − γE\nSince εs is much larger than ε0 , the exponential integral can be approximated by\nEi(εs /ε0 ) ≈ (ε0 /εs ) e εs /ε0 , and the other two terms in the denominator become\nnegligible in front of this one. Hence, we may approximate the lowest order\nsolution by\n\u0012\n\u0013\n2γεs\nεs\nr≈\nexp −\n.\n(51)\nε0\nε0\nEquation (51), which gives the probability per unit time for a particle to jump\nthe barrier, is our final result for the escape rate.\nIn the case of vacuum decay in quantum field theory studied by Calzetta et al.\n(2001, 2002) the time-independent Fokker-Planck equation had a continuous\nspectrum, and therefore in that case it was not possible to perform either an\neigenvalue expansion, like the one we have performed in this subsection, or follow\nKramers's method, as will be done in the next subsection.\n\n17\n\n\f4.3\n\nEscape rate: Kramers's method\n\nOur Fokker-Planck equation (39) is completely analogous to that found by\nKramers (1940) in the classical underdamped case, once we replace kT , the temperature times Boltzmann's constant, by the zero point energy of the harmonic\noscillator ε0 = ~Ω0 /2.2 Therefore, as an alternative to the previous subsection,\nwe can apply the same method as Kramers in order to compute the decay rate.\nInstead of imposing the correct boundary conditions, we look for the solutions of the Fokker-Planck equation with constant flux Φ = Φ0 . Since the flux\ncan be rewritten as\n∂ \u0010 ε/ε0 \u0011\ne\nF ,\n(52)\nΦ = −2γ e −ε/ε0 εε0\n∂ε\nthese solutions will be given by\nZ\n′\nΦ0 −ε/ε0 εs ′ e ε /ε0\ne\ndε\n2γε0\nε′\nε\nΦ0 −ε/ε0\ne\n[Ei(εs /ε0 ) − Ei(ε/ε0 )] .\n=\n2γε0\n\nF (ε) =\n\n(53)\n\nAgain, we have imposed that F (εs ) = 0 because we assume that when a particle\narrives at the separatrix it never reenters the potential well region. Notice that\nthe solution we have found has a logarithmic singular behavior at small energies,\nwhich takes into account the injection of a probability flux through the point\nε = 0 necessary for the maintenance of the constant flux. However, since we\nexpect the flux of probability to be very small, this contribution will be not very\nsignificative and will affect only the region of energies ε . ε0 , which are much\nlower than the scape energy εs .\nWe can compute the flux Φ0 by imposing\nthe correct normalization of the\nRε\naveraged Wigner function F (ε), namely 0 s dε F (ε) = 1:\nΦ0\n2γε0\n\nZ\n\nεs\n\ndε e\n0\n\n−ε/ε0\n\nZ\n\nε\n\nεs\n\n′\n\ne ε /ε0\ndε\n= 1.\nε′\n′\n\n(54)\n\nThe main contribution to the integral over ε′ is due to those values for ε′ which\ndiffer from εs by a quantity of order ε0 . We may replace ε′ by its value at\nthe separatrix, εs . Making this approximation we can perform analytically the\nintegrals in Eq. (54). Retaining only those terms which have an exponential\nfactor e εs /ε0 , we obtain the final result for the flux of particles:\n\u0012\n\u0013\n2γεs\nεs\nΦ = Φ0 ≈\nexp −\n.\n(55)\nε0\nε0\n2\n\nNotice that this is only true under the harmonic approximation. Had not we neglected the\ncubic term in the equations of motion, our Fokker-Planck equation would not be equivalent to\nthe one found by Kramers in the classical underdamped case.\n\n18\n\n\fAlthough we have assumed that the flux is constant in order to solve the differential equation, this is not actually the case, and the flux at the separatrix Φs is\nproportional to the total probability of finding the particle in the potential well\nregion: Φs (t) = P (t)Φ0 . Integrating the conservation equation (40) with respect\nto the energy, we easily find that the total probability decay follows the law\ndP (t)\n+ P (t)Φ0 = 0,\ndt\nwhich may be integrated to give P (t) = e −Φ0 t . Hence the probability flux Φ0\nis to be identified with the escape rate r of last subsection. We see that both\nmethods agree.\n\n5\n\nDiscussion\n\nThe study of quantum tunneling based on a real time formulation seems crucial\nin order to address highly non-equilibrium situations in which no adiabaticity\nassumptions can be made. As mentioned in the introduction, a first step in this\ndirection was made in Calzetta et al. (2001, 2002), where the effect on vacuum\ndecay in quantum field theory due to the backreaction of the short-wavelength\nmodes was analyzed by regarding the long-wavelength modes responsible for\ntunneling as an open quantum system. In that case it was found that such a\nbackreaction seemed to yield an enhancement of the decay rate. There are, however, a couple of aspects which deserve, in our opinion, a more careful analysis.\nThe first one is the need for a suitable identification of the tunneling degrees\nof freedom and the corresponding implementation of a system-environment separation which leads to the reformulation of the problem in terms of an open\nquantum system. Secondly, when solving the master equation that governs the\ntime evolution of the reduced Wigner function for the tunneling degree of freedom in order to obtain the vacuum decay rate, the attention was focused on the\nbackreaction of the environment (the short-wavelength modes) and the higher\nderivative terms which would be uniquely responsible for tunneling if the system\nwere isolated were neglected.\nIn this paper we have considered a fairly simple quantum mechanical open\nsystem, in which the system-environment separation is given before-hand and\nthe coupling constant governing the interaction between the system and the\nenvironment can be adjusted at will, rather than being self-consistently determined, as happened to be the case for vacuum decay in field theory. Therefore,\nit is interesting to check whether a similar enhancement of the tunneling rate\nis obtained in that simpler model and see if such an effect is generic. Furthermore, the result can be considered more robust than that in the field theory case\nsince the number of important assumptions made is rather small. It is, thus,\n\n19\n\n\fworthwhile to elaborate on this point and recall the different approximations\nemployed throughout the paper in order to obtain the decay rate.\nFirst of all, the master equation that we are considering in this paper can be\nobtained by keeping terms of order ~2 and ~γ at most, and restricting to values\nof γ which are small enough (in particular we should take (γ/Ω0 )S . ~, where\nS is the characteristic action of the problem), so that the terms of order γ 2 or\nhigher can be neglected3 (Roura, 2001). On the other hand, the master equation\nobtained in this way contains a term with third order derivatives of the reduced\nWigner function with respect to the momentum (the term of order ~2 ). This sort\nof terms, which are absent in any diffusion equation with a finite Kramers-Moyal\nexpansion associated to a classical stochastic process, are intimately related to\ngenuinely quantum effects due to the nonlinearities of the potential and imply\nthat even a reduced Wigner function which is initially positive everywhere will\nacquire negative values when it evolves in time. Moreover, this higher derivative\nterm would be uniquely responsible for tunneling if the system where isolated.\nDespite its remarkable features, this term has been neglected in the present\narticle, since otherwise we were unable to obtain analytical results for the decay\nrate. This approximation, whose justification will be further discussed below,\nconstitutes the most drastic assumption made throughout the paper.\nHaving neglected the higher derivative terms, the master equation is equivalent to the Fokker-Planck equation associated to a Langevin equation with a\nGaussian stochastic source characterized by a nonlocal correlation function (the\nnonlocal noise kernel). From this point on, most of the approximations employed in order to compute the decay rate are more or less standard (Hänggi\net al., 1990). First, we change to action-angle variables and make use of an adiabatic approximation to eliminate the fast variable (the angle). This is consistent\nprovided that γ ≪ Ω0 , which is in agreement with the previous assumption of\nsmall enough values for γ. Next, a harmonic approximation is introduced for\nthe solutions to the equations of motion for the isolated system which appear in\nboth the master equation and the Fokker-Planck equation. This approximation\nhelps to obtain a rather simple result for the decay rate and can be justified both\nqualitatively and quantitatively, in contrast to the field theory case analyzed by\nCalzetta et al. (2001, 2002), where the existence of a threshold for the dissipation and noise kernels would preclude such an approximation. Finally, it is\nassumed that the characteristic decay time is much smaller than the relaxation\nand dynamical timescales: r ≪ γ ≪ Ω0 , where r is the decay rate (the inverse\n3\n\nOne might be concerned that the truncation of higher orders in γ when considering times\nmuch larger than the characteristic relaxation timescale (i.e., γt ≫ 1), as required in order to\ncompute the decay rate, might no longer be valid due to the existence of secular terms among\nthe terms of higher order in γ that have been neglected. Although arguments that justify such\na truncation when computing the decay rate can be given, this point might deserve a more\ncareful analysis.\n\n20\n\n\fof the decay time). Although γ was required to be small enough, the previous\ninequality can be fulfilled provided that the potential barrier is sufficiently high,\ni.e., εs is large enough.\nAfter reviewing the main approximations employed, let us compare the result\nobtained for the decay rate to that of Caldeira and Leggett (1981, 1983b) as\nwell as to the tunneling rate when the coupling to the environment is absent.\nWhereas Caldeira and Leggett found that the interaction with the environment\ntends to suppress tunneling, we are not going to recover that result since, having\nneglected the higher derivative terms responsible for tunneling in an isolated\nsystem, the dissipation and diffusion terms that appear in the master equation\ndue to the backreaction of the environment will always lead to a positive (or, at\nmost, vanishing) probability of escaping from the metastable well. Nevertheless,\nif the decay rate obtained were much smaller or much larger than the tunneling\nrate for the isolated system so that the timescales governing both processes are\nvery different, one could expect that the contribution to the decay rate from the\nprocess with a shortest characteristic timescale would be dominant.\nThe tunneling rate for an isolated system initially trapped in the metastable\nminimum of the potential considered in this paper is (Caldeira and Leggett,\n1983b)\n\u0012\n\u0013\n\u0012 \u00131/2\n18 εs\nεs\nexp −\n,\n(56)\nrt ∼ Ω0\nε0\n5 ε0\nwhere we recall that ε0 is the zero-point energy of a harmonic oscillator of frequency Ω0 . On the other hand, Caldeira and Leggett (1981, 1983a) obtained the\nmodification of the tunneling rate due to the interaction with the environment,\nwhich in the case of small dissipation is given by\nrt ∼ Ω0\n\n\u0012\n\nεs\nε0\n\n\u00131/2\n\n\u0014\n\nεs\nexp −\nε0\n\n\u0012\n\n18 54ζ(3) γ\n+\n5\nπ 3 Ω0\n\n\u0013\u0015\n\n.\n\n(57)\n\nTherefore, since the interaction with the environment simply adds a negative\ncontribution to the exponent, it always tends to suppress the tunneling rate.\nFinally, the decay rate due to the activation-like effect obtained in the previous\nsection corresponds to\n\u0012\n\u0013\nεs\nεs\n,\n(58)\nr ∼ γ exp −\nε0\nε0\nwhich is valid for small γ and large εs . When γ is very small the decay rates from\nEqs. (56) and (57) become very close. Furthermore, although a small γ implies\na small contribution to the decay rate associated to the activation-like process,\nit can always be made arbitrarily larger than the tunneling rate by taking εs\nlarge enough.\nThe fact that the activation-like decay rate can be made arbitrarily large\nas compared to the tunneling rate for the isolated system seems to suggest, as\n21\n\n\fmentioned above, that even if the two phenomena were considered simultaneously, the former would be expected to dominate. If that were the case, it would\nimply that the usual instanton methods, when applied to a system interacting\nwith an environment, downplay the role of the backreaction of the environment\non the system dynamics. This can be qualitatively interpreted in the following\nway: while, roughly speaking, the tunneling effect for an isolated system can\nbe regarded as a consequence of the energy fluctuations implied by Heisenberg's\nuncertainty principle, the interaction with an environment would induce fluctuations on the system due to the quantum fluctuations of the environment itself\n(Nagaev and Büttiker, 2002), which would enhance the tunneling rate.\nNevertheless, in order to reach a definite conclusion it would be desirable to\ndeal with the two contributions simultaneously and make sure that the higher\nderivative terms do not disrupt the effect of the backreaction terms, even when\nthe timescale for the contribution to the decay rate from the former terms is\nmuch longer than the timescale associated to the activation-like process. Unfortunately, dealing with the higher derivative terms is not an easy task, and it\nseems hard to provide a real time description of the tunneling process in terms of\nthe Wigner function even for an isolated system; see, however, Risken and Vogel\n(1988) for a first step in that direction. One may try to gain partial information\non the relation between the two processes by considering different potentials\nwith wider or narrower barriers, since one would naively expect that tunneling is suppressed for wide barriers while the activation-like contribution does\nnot depend so much on the width of the barrier, as long as the height remains\nthe same. A couple of comments concerning the freedom to modify the system\npotential are, nevertheless, in order. First, the potential must be analytic in\norder the derive the master equation for the reduced Wigner function. Second,\nwhen solving the formally equivalent problem of a classical Brownian particle\nescaping from the potential well, we assumed that once the particle reaches the\nmaximum of the barrier it escapes and never comes back, but if a very wide\nbarrier is considered, the probability that the particle comes back due to the\nfluctuations may become no longer negligible.\nWe close this section insisting on the importance of finding a satisfactory\nmethod to deal with the higher derivative terms, which would be very helpful in\norder to elucidate whether the enhancement of the decay rate obtained in this\npaper and entirely due to the back reaction from the environment fluctuations\nwould still persist when the terms responsible for tunneling in isolated systems\nare also taken into account. Such a method would have an interest in its own\nright even if the results of Caldeira and Leggett (1981, 1983b) were finally recovered when properly taking into account the higher derivative terms, since it\nwould constitute a key step in formulating a real time description of tunneling.\n\n22\n\n\fAcknowledgments\nWe would like to thank Bei-Lok Hu, Fernando Lombardo, Slava Mukhanov\nand Renaud Parentani for interesting discussions in Peyresq. D. A. acknowledges support of a FI grant from the Generalitat de Catalunya, and A. R.\nacknowledges support from NSF under Grant PHY-9800967. This work is\nalso supported in part by MICYT Research Project No. FPA-2001-3598, European Project HPRN-CT-2000-00131, ANPCYT through Project No. PICT99\n03-05229, CONICET, UBA and Fundacion Antorchas.\n\nReferences\nCaldeira, A. O., and Leggett, A. J. (1981). Influence of Dissipation on Quantum\nTunneling in Macroscopic Systems, Physical Review Letters, 46, 211–214.\nCaldeira, A. O., and Leggett, A. J. (1983a). Path integral approach to quantum\nBrownian motion, Physica, 121A, 587–616.\nCaldeira, A. O., and Leggett, A. J. (1983b). Quantum tunnelling in a dissipative\nsystem, Annals of Physics, 149, 374–456.\nCallan, C. G., and Coleman, S. R. (1977). The fate of the false vacuum. 2. First\nquantum corrections, Physical Review D , 16, 1762–1768.\nCalzetta, E., Roura, A., and Verdaguer, E. (2001). Vacuum decay in quantum\nfield theory, Physical Review D , 64, 105008.\nCalzetta, E., Roura, A., and Verdaguer, E. (2002). Dissipation, Noise and Vacuum Decay in Quantum Field Theory, Physical Review Letters, 88, 010403.\nCalzetta, E., Roura, A., and Verdaguer, E. (2003). Stochastic description for\nopen quantum systems, Physica, 319A, 188–212..\nCalzetta, E., and Verdaguer, E. (1999). Noise induced transitions in semiclassical\ncosmology, Physical Review D , 59, 083513.\nColeman, S. R. (1977). The fate of the false vacuum. 1. Semiclassical theory,\nPhysical Review D , 15, 2929–2936.\nColeman, S. R. (1985). Aspects of Symmetry, Cambridge University Press, Cambridge, England.\nCourant, R., and Hilbert, D. (1953). Methods of mathematical physics, Interscience Publishers, New York.\nFeynman, R. P., and Hibbs, A. (1965). Quantum Mechanics and Path Integrals,\nMcGraw-Hill, New York.\n\n23\n\n\fFeynman, R. P., and Vernon, F. L. (1963). The Theory of a General Quantum\nSystem Interactiong with a Linear Dissipative System, Annals of Physics, 24,\n118–173.\nFujikawa, K., Iso, S., Sasaki, M., and Suzuki, H. (1992a). Canonical Formulation\nof Quantum Tunneling with Dissipation, Physical Review Letters, 68, 1093–\n1096.\nFujikawa, K., Iso, S., Sasaki, M., and Suzuki, H. (1992b). Quantum tunneling\nwith dissipation: Possible enhancement by dissipative interactions, Physical\nReview B , 46, 10295–10309.\nGalindo, A., and Pascual, P. (1991). Quantum Mechanics, Springer-Verlag, New\nYork.\nGoldstein, H. (1980). Classical Mechanics, Addison-Wesley, Reading, USA.\nGradsteyn, I. S., and Ryzhik, I. M. (1980). Tables of Integrals, Series, and\nProducts, Academic Press, New York.\nHänggi, P., Talkner, P., and Borkovec, M. (1990). Reaction-rate theory: fifty\nyears after Kramers, Reviews of Modern Physics, 62, 251–341.\nHillery, M., O'Connell, R. F., Scully, M. O., and Wigner, E. P. (1984). Distribution functions in physics: Fundamentals, Physics Reports, 106, 121–167.\nKramers, H. A. (1940). Brownian motion in a field of force and the diffusion\nmodel of chemical reactions, Physica (Amsterdam), 7, 284–304.\nLandau, L. D., and Lifshitz, E. M. (1977). Quantum Mechanics (Non Relativistic\nTheory), Pergamon, London.\nNagaev, K. E., and Büttiker, M. (2002). Ground State Energy Fluctuations of\na System Coupled to a Bath, Europhysics Letters, 58, 475–481.\nRisken, H., and Vogel, K. (1988). Quantum treatment of dispersive optical bistability, in Lecture notes of the X Sitges summerschool on \"Far from equilibrium\nphase transitions\", Springer, Berlin, pages 237–262.\nRoura, A. (2001). Stochastic description for open quantum systems and cosmological perturbations, Ph.D. thesis, Universitat de Barcelona.\nRoura, A., and Verdaguer, E. (1999). Mode decomposition and renormalization\nin semiclassical gravity, Physical Review D , 60, 107503.\nSchwartz, L. (1957). Théorie des distributions, Hermann, Paris, 2 vols.\nWigner, E. P. (1932). Quantum Corrections For Thermodynamic Equilibrium,\nPhysical Review , 40, 749–760.\n\n24\n\n\f"}