{"id": "http://arxiv.org/abs/quant-ph/0308055v1", "guidislink": true, "updated": "2003-08-10T02:25:52Z", "updated_parsed": [2003, 8, 10, 2, 25, 52, 6, 222, 0], "published": "2003-08-10T02:25:52Z", "published_parsed": [2003, 8, 10, 2, 25, 52, 6, 222, 0], "title": "Generation of photon number states", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=quant-ph%2F0011094%2Cquant-ph%2F0011086%2Cquant-ph%2F0011040%2Cquant-ph%2F0011107%2Cquant-ph%2F0011053%2Cquant-ph%2F0011015%2Cquant-ph%2F0011088%2Cquant-ph%2F0011087%2Cquant-ph%2F0011118%2Cquant-ph%2F0011111%2Cquant-ph%2F0011060%2Cquant-ph%2F0011010%2Cquant-ph%2F0011073%2Cquant-ph%2F0011020%2Cquant-ph%2F0011063%2Cquant-ph%2F0011029%2Cquant-ph%2F0011108%2Cquant-ph%2F0011026%2Cquant-ph%2F0011052%2Cquant-ph%2F0011090%2Cquant-ph%2F0011047%2Cquant-ph%2F0011096%2Cquant-ph%2F0011034%2Cquant-ph%2F0011031%2Cquant-ph%2F0011035%2Cquant-ph%2F0011006%2Cquant-ph%2F0011004%2Cquant-ph%2F0011017%2Cquant-ph%2F0011114%2Cquant-ph%2F0011048%2Cquant-ph%2F0011068%2Cquant-ph%2F0011113%2Cquant-ph%2F0011067%2Cquant-ph%2F0011083%2Cquant-ph%2F0011001%2Cquant-ph%2F0011043%2Cquant-ph%2F0011013%2Cquant-ph%2F0011038%2Cquant-ph%2F0011003%2Cquant-ph%2F0011057%2Cquant-ph%2F0308070%2Cquant-ph%2F0308149%2Cquant-ph%2F0308123%2Cquant-ph%2F0308121%2Cquant-ph%2F0308012%2Cquant-ph%2F0308114%2Cquant-ph%2F0308145%2Cquant-ph%2F0308060%2Cquant-ph%2F0308167%2Cquant-ph%2F0308065%2Cquant-ph%2F0308085%2Cquant-ph%2F0308063%2Cquant-ph%2F0308087%2Cquant-ph%2F0308117%2Cquant-ph%2F0308143%2Cquant-ph%2F0308118%2Cquant-ph%2F0308140%2Cquant-ph%2F0308041%2Cquant-ph%2F0308029%2Cquant-ph%2F0308111%2Cquant-ph%2F0308152%2Cquant-ph%2F0308072%2Cquant-ph%2F0308044%2Cquant-ph%2F0308154%2Cquant-ph%2F0308141%2Cquant-ph%2F0308025%2Cquant-ph%2F0308074%2Cquant-ph%2F0308146%2Cquant-ph%2F0308046%2Cquant-ph%2F0308001%2Cquant-ph%2F0308043%2Cquant-ph%2F0308124%2Cquant-ph%2F0308088%2Cquant-ph%2F0308151%2Cquant-ph%2F0308028%2Cquant-ph%2F0308073%2Cquant-ph%2F0308159%2Cquant-ph%2F0308002%2Cquant-ph%2F0308052%2Cquant-ph%2F0308106%2Cquant-ph%2F0308165%2Cquant-ph%2F0308005%2Cquant-ph%2F0308004%2Cquant-ph%2F0308024%2Cquant-ph%2F0308134%2Cquant-ph%2F0308110%2Cquant-ph%2F0308034%2Cquant-ph%2F0308040%2Cquant-ph%2F0308101%2Cquant-ph%2F0308135%2Cquant-ph%2F0308059%2Cquant-ph%2F0308102%2Cquant-ph%2F0308007%2Cquant-ph%2F0308055%2Cquant-ph%2F0308163%2Cquant-ph%2F0308136%2Cquant-ph%2F0308075%2Cquant-ph%2F0308107%2Cquant-ph%2F0308171%2Cquant-ph%2F0308166%2Cquant-ph%2F0308086&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Generation of photon number states"}, "summary": "The Visible Light Photon Counter (VLPC) has the capability to discriminate\nphoton number states, in contrast to conventional photon counters which can\nonly detect the presence or absence of photons. We use this capability, along\nwith the process of parametric down-conversion, to generate photon number\nstates. We experimentally demonstrate generation of states containing 1,2,3 and\n4 photons with high fidelity. We then explore the effect the detection\nefficiency of the VLPC has on the generation rate and fidelity of the created\nstates.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=quant-ph%2F0011094%2Cquant-ph%2F0011086%2Cquant-ph%2F0011040%2Cquant-ph%2F0011107%2Cquant-ph%2F0011053%2Cquant-ph%2F0011015%2Cquant-ph%2F0011088%2Cquant-ph%2F0011087%2Cquant-ph%2F0011118%2Cquant-ph%2F0011111%2Cquant-ph%2F0011060%2Cquant-ph%2F0011010%2Cquant-ph%2F0011073%2Cquant-ph%2F0011020%2Cquant-ph%2F0011063%2Cquant-ph%2F0011029%2Cquant-ph%2F0011108%2Cquant-ph%2F0011026%2Cquant-ph%2F0011052%2Cquant-ph%2F0011090%2Cquant-ph%2F0011047%2Cquant-ph%2F0011096%2Cquant-ph%2F0011034%2Cquant-ph%2F0011031%2Cquant-ph%2F0011035%2Cquant-ph%2F0011006%2Cquant-ph%2F0011004%2Cquant-ph%2F0011017%2Cquant-ph%2F0011114%2Cquant-ph%2F0011048%2Cquant-ph%2F0011068%2Cquant-ph%2F0011113%2Cquant-ph%2F0011067%2Cquant-ph%2F0011083%2Cquant-ph%2F0011001%2Cquant-ph%2F0011043%2Cquant-ph%2F0011013%2Cquant-ph%2F0011038%2Cquant-ph%2F0011003%2Cquant-ph%2F0011057%2Cquant-ph%2F0308070%2Cquant-ph%2F0308149%2Cquant-ph%2F0308123%2Cquant-ph%2F0308121%2Cquant-ph%2F0308012%2Cquant-ph%2F0308114%2Cquant-ph%2F0308145%2Cquant-ph%2F0308060%2Cquant-ph%2F0308167%2Cquant-ph%2F0308065%2Cquant-ph%2F0308085%2Cquant-ph%2F0308063%2Cquant-ph%2F0308087%2Cquant-ph%2F0308117%2Cquant-ph%2F0308143%2Cquant-ph%2F0308118%2Cquant-ph%2F0308140%2Cquant-ph%2F0308041%2Cquant-ph%2F0308029%2Cquant-ph%2F0308111%2Cquant-ph%2F0308152%2Cquant-ph%2F0308072%2Cquant-ph%2F0308044%2Cquant-ph%2F0308154%2Cquant-ph%2F0308141%2Cquant-ph%2F0308025%2Cquant-ph%2F0308074%2Cquant-ph%2F0308146%2Cquant-ph%2F0308046%2Cquant-ph%2F0308001%2Cquant-ph%2F0308043%2Cquant-ph%2F0308124%2Cquant-ph%2F0308088%2Cquant-ph%2F0308151%2Cquant-ph%2F0308028%2Cquant-ph%2F0308073%2Cquant-ph%2F0308159%2Cquant-ph%2F0308002%2Cquant-ph%2F0308052%2Cquant-ph%2F0308106%2Cquant-ph%2F0308165%2Cquant-ph%2F0308005%2Cquant-ph%2F0308004%2Cquant-ph%2F0308024%2Cquant-ph%2F0308134%2Cquant-ph%2F0308110%2Cquant-ph%2F0308034%2Cquant-ph%2F0308040%2Cquant-ph%2F0308101%2Cquant-ph%2F0308135%2Cquant-ph%2F0308059%2Cquant-ph%2F0308102%2Cquant-ph%2F0308007%2Cquant-ph%2F0308055%2Cquant-ph%2F0308163%2Cquant-ph%2F0308136%2Cquant-ph%2F0308075%2Cquant-ph%2F0308107%2Cquant-ph%2F0308171%2Cquant-ph%2F0308166%2Cquant-ph%2F0308086&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Visible Light Photon Counter (VLPC) has the capability to discriminate\nphoton number states, in contrast to conventional photon counters which can\nonly detect the presence or absence of photons. We use this capability, along\nwith the process of parametric down-conversion, to generate photon number\nstates. We experimentally demonstrate generation of states containing 1,2,3 and\n4 photons with high fidelity. We then explore the effect the detection\nefficiency of the VLPC has on the generation rate and fidelity of the created\nstates."}, "authors": ["Edo Waks", "Eleni Diamanti", "Yoshihisa Yamamoto"], "author_detail": {"name": "Yoshihisa Yamamoto"}, "author": "Yoshihisa Yamamoto", "links": [{"href": "http://arxiv.org/abs/quant-ph/0308055v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/quant-ph/0308055v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/quant-ph/0308055v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/quant-ph/0308055v1", "arxiv_comment": null, "journal_reference": null, "doi": null, "fulltext": "APS/123-QED\n\nGeneration of photon number states\nEdo Waks,1 Eleni Diamanti,1 and Yoshihisa Yamamoto1, 2\n1\n\nQuantum Entanglement Project, ICORP, JST, E.L. Ginzton Laboratories, Stanford University, Stanford, CA 94305\n2\nNTT basic research, Atsugi, Kanagawa, Japan\n(Dated: July 27, 2018)\n\narXiv:quant-ph/0308055v1 10 Aug 2003\n\nThe Visible Light Photon Counter (VLPC) has the capability to discriminate photon number\nstates, in contrast to conventional photon counters which can only detect the presence or absence of\nphotons. We use this capability, along with the process of parametric down-conversion, to generate\nphoton number states. We experimentally demonstrate generation of states containing 1,2,3 and 4\nphotons with high fidelity. We then explore the effect the detection efficiency of the VLPC has on\nthe generation rate and fidelity of the created states.\nPACS numbers: 42.50.Ar,42.50Dv\n\nPhoton number states play an important role in quantum optics. Such states exhibit effects which contradict\nclassical electromagnetic theory, such as anti-bunching\nand negativity of the Wigner function [1]. They also have\nimportant practical applications. In optical telecommunication, they achieve an optimal channel capacity [2, 3].\nThey can also improve the sensitivity of an interferometer to the Heisenberg limit [4]. In this limit, the minimum detectable phase shift is inversely proportional to\nthe number of photons, rather then the square root of\nthe number achieved by the standard quantum limit.\nRecently, there has been tremendous effort in generating single photon states. This is often achieved by using\nsingle emitters such as molecules, quantum dots, or diamond color centers [5, 6, 7, 8, 9, 10, 11]. Although\nthese sources hold great promise, they currently suffer\nfrom substantial collection losses. This creates a large\nvacuum contribution, which means that the generated\nstate greatly deviates from one with exactly one photon.\nFurthermore, the extension of these devices to generating higher order photon number states remains a difficult problem. The generation of a two photon number\nstate has been recently demonstrated in the microwave\nregime [12], using Rydberg atoms in a high-Q cavity.\nThere have also been proposals for generation higher order optical photon number states using trapped atoms\nin an optical cavity [13]. The implementation of these\nschemes remains experimentally challenging.\nThere are generally two ways to engineer the quantum\nstate of a system. The first is to start the system in a\nwell known initial state, and turn on a unitary time evolution which transforms the initial state to the desired\nstate. The second method is to make a non-destructive\nmeasurement of the quantum system, and project it onto\nthe desired Hilbert space using the projection postulate\nof quantum mechanics. In this letter, we use the latter\nmethod of projection and conditional post-selection to\ngenerate a photon number state. This is done using the\nnon-linear process of parametric down-conversion (PDC)\nin conjunction with a photon number detector known as\nthe Visible Light Photon Counter (VLPC). In PDC, a\n\nbright pump field is injected into a material which exhibits a second order non-linear dipole response. This\nnon-linearity can cause a pump photon to spontaneously\nsplit into two photons of lower energy, referred to as the\nsignal and idler. By appropriately adjusting the phase\nmatching conditions of the process, the signal and idler\ncan be made to propagate in different directions, allowing\nthem to be spatially resolved. Since these two photons\nalways come in pairs, if a signal photon is detected, there\nmust be an idler photon in the conjugate mode. If a photon counter is placed in front of the signal arm and detects one photon, the corresponding idler arm is prepared\nin a state containing only one photon by the projection\npostulate of quantum mechanics. The photon counter in\nessence performs a non-destructive measurement of the\nidler arm.\nThe above scheme can be extended to generation of\nhigher order number states. Suppose a short pump laser\npulse is injected into a non-linear Rcrystal. We can define\nthe photon number operator n̂ = T â† (t) â (t) dt, where\nthe integral is taken over the pulse duration of the pump\nand â (t) is the bosonic photon annihilation operator in\nthe time domain. If n signal photons are detected by a\nphoton counter in a given pulse, then the idler pulse is\nprojected onto a state |ψi i which satisfies the condition\nn̂|ψi i = n|ψi i.\n\n(1)\n\nThat is, the idler mode is an eigenstate of the number operator with eigenvalue n. States which satisfy this special\nproperty are known as photon number states.\nIn order to implement the above scheme, the photon\ncounter must be able to determine the exact number of\nphotons in the signal arm within the short time duration\nof the pump pulse. Conventional photon counters such as\navalanche photo-diodes (APDs) cannot do this, because\nthey suffer from long dead time and large multiplication\nnoise. Such detectors can only distinguish the zero photon case from the non-zero photon case in a pulse, making\nit impossible to generate photon number states.\nRecently, a new type of photon counter known as\nthe Visible Light Photon Counter (VLPC) [14], has\n\n\f2\nSCA\nSignal\nVLPC 1 500mm\nIntegrating VLPC 2 lens\nAmplifier\n\nIdler\n\nBBO\n\nIF\n266nm\n\nPBS\n\n2m lens\n\n2.5 s\nDelay\nsignal\n\nAND\n\ntrigger\n\nBoxcar\nIntegrator\n\nDiode\nPrism\n\nNd:YAG\n266nm\n\nFIG. 1: Experimental setup for photon number generation.\n\nbeen shown to have the capability to distinguish different photon number states with high quantum efficiency [15, 16, 17, 18]. When two photons are simultaneously detected by the VLPC, it generates an electrical pulse which is twice as large. This pattern holds for\nhigher photon numbers. The pulse height can then be\nused to determine the number of detected photons.\nThe VLPC can do photon number detection due to two\nunique properties. First, the VLPC has an active area of\n1mm in diameter. When one photon is detected, it forms\na 5μm diameter dead spot on the detector surface, leaving the rest of the active area available for subsequent\ndetection events. As long as the probability that two\nphotons land on the same spot is small, which is true if\nthe incident light in not too tightly focussed, all of the\nphotons will be detected. This circumvents the dead time\nproblem which conventional APDs suffer from. Second,\nthe VLPC has extremely low multiplication noise. Multiplication noise refers to the fluctuations in the number\nof electrons emitted by a detector in response to a photodetection event. These fluctuations limit the ability of\nthe detector to infer photon number [18]. Multiplication\nnoise is quantified by a parameter known as the Excess\nNoise Factor F = hM 2 i/hM i2 , where M is the number of\nelectrons emitted by the detector due to a photon detection. In the ideal limit where F = 1, the detector emits\na deterministic number of electrons for each detection.\nAPDs with single carrier multiplication, which achieves\nthe best noise performance, still have a large excess noise\nfactor of F = 2 [19], making it impossible to discriminate photon numbers. The VLPC, in contrast, achieves\nnearly noise free multiplication with F = 1.03 [18, 20].\nThe experimental setup for generating photon number states is shown in Figure 1. A 266nm pump source\nis generated from the fourth harmonic of a Q-switched\nNd:YAG laser. The pump pulses have a duration of 20ns,\nand a repetition rate of 45kHz. A dispersion prism separates the fourth harmonic from the residual second harmonic, which is used to illuminate a high speed photodiode to generate a triggering signal. The fourth harmonic\npumps a BBO crystal, which is set for non-collinear degenerate phase-matching. In this condition, the signal\nand idler waves are both 532nm in wavelength and have\na divergence angle of 1 degree from the pump. The pump\n\nis loosely focused before the BBO crystal to achieve a\nminimum waste at the collection lens. This results in a\nsharper two-photon image which enhances the collection\nefficiency [21].\nTwo VLPC detectors are used in this experiment.\nEach detector is held in a separate helium bath cryostat\nand cooled down to 6-7K, which is the optimum operating temperature. The VLPC is sensitive to photons with\nwavelengths of up to 30μm, so it must be shielded from\nroom temperature thermal radiation. This is achieved by\nencasing the detector in a copper shield, which is cooled\ndown to 6K. Acrylic windows at the front of the copper\nshield are used as infra red filters. These windows are\nhighly transparent at visible wavelengths and simultaneously nearly opaque at 2-30μm wavelengths.\nVLPC 1 is used as the triggering detector which detects the number of photons generated in the signal arm\non a given laser pulse. The output of VLPC 1 is amplified\nby an integrating amplifier, which generates an electrical\npulse whose height is proportional to the number of emitted electrons. The height of the pulse is discriminated by\na single channel analyzer (SCA). A logical AND is performed between the output of the SCA and the output of\nthe photodiode to reject all detection events which occur\noutside of the pulse duration. Figure 2a shows a pulse\nheight histogram of VLPC 1. This histogram features a\nseries of peaks corresponding to different photon number\nstates. The SCA can select pulse heights corresponding\nto one, two, three, and four photon events. The decision\nwindow set by the SCA for each photon number event is\nshown by the shaded areas in the figure.\nVLPC 2 is placed in the idler arm, and used to verify that the correct photon number state was generated.\nThe output of VLPC 2 is amplified, and connected to\nthe signal input of a boxcar integrator. On each pulse\nfrom the SCA, the output of VLPC 2 is integrated over a\n2μs window, which is sufficiently large to encompass the\nentire electrical pulse (determined by the bandwidth of\nsubsequent amplifiers). Figure 2b shows a pulse area distribution of VLPC 2 with no post-selection from VLPC\n1, at a pump excitation power of 40μW. This distribution\nalso features a series of peaks corresponding to the different photon numbers, starting with the first peak which\nis a zero photon event. In order to calculate the photon\nnumber distribution, each peak is fit to a gaussian. The\narea of each gaussian is normalized by the total area of all\nthe peaks. The calculated photon number distribution is\nshown in the inset.\nBoth VLPCs have imperfect detection efficiencies due\nto internal detection losses of the VLPC itself, as well\nas external losses from the collection optics. The efficiency is measured by comparing the coincidence rate between the two detectors to the singles count rates. From\nthis measurement we determine the detection efficiency\nof VLPC 1 to be 0.68, and VLPC 2 to be 0.58.\nThe detection efficiency of the monitoring detector\n\n\f3\n\na)\n\n2 Photons\n\n1 Photon\n\n1\n\n2\n\n3\n\nProbability\n\n2500\n\n4\n\nCounts\n\n2000\n\n1\n\n1\n\n0.8\n\n0.8\n\nProbability\n\nVLPC 1 Pulse Height Histogram\n\n0.6\n0.4\n0.2\n\n1500\n\n0\n0\n\n1\n\n2000\n\n3000\n\n4000\n\n5000\n\nPulse Height (mV)\n\nb)\n\n3500\n\n0.3\n\n5\n\n0\n\n1\n\n2\n\n3\n\n4\n\nPhoton Number\n\n3 Photons\n\n4 Photons\n\n1\n\n1\n\n0.8\n\n0.8\n\n0.6\n0.4\n\n5\n\n0.6\n0.4\n0.2\n\n0\n\n0\n0\n\n0.2\n\n2500\n\nCounts\n\n4\n\n0.2\n\n3000\n\n1\n\n2\n\n3\n\n4\n\nPhoton Number\n\n5\n\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\nPhoton Number\n\n0.1\n\n2000\n\n0\n1500\n\n0\n\n1000\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\nData point\nTotal Fit\nIndividual Peak\n\n500\n0\n0\n\n3\n\nProbability\n\n1000\n\nProbability\n\n0\n\n2\n\nPhoton Number\n500\n\n0\n\n0.4\n0.2\n\n0\n1000\n\n0.6\n\n500\n\n1000\n\n1500\n\n2000\n\n2500\n\nPulse Area (AU)\n\nFIG. 2: Photon number detection from the VLPCs. a, pulse\nheight histogram from VLPC 1 after an integrating amplifier. The histogram features a series of peaks corresponding\nto the photon number distribution of the parametric downconversion output. An SCA is used four different regions,\ncorresponding to the different photon number events, shown\nby the shaded regions. b, a pulse area histogram of VLPC 2\nwhen no post-selection is done from VLPC 1. Each peak is\nfit to a gaussian to calculate the photon number distribution,\nshown in the inset.\n\n(VLPC 2) can be corrected for, because we are interested mainly in how many photons were actually present\nin the idler arm, not how many have been detected.\nTo do this, we can define pj as the probability that\nj photons were generated in the idler pulse, and fi as\nthe probability that i photons were detected. These\ntwo probabilities\nare related by the linear loss model\n\u0001\nP\nj i\nfi = ∞\nη\n(1\n− η)j−i pi . The above transformation\nj=i i\nneeds to be inverted. In order to do this we truncate the\nphoton number distribution at some number n, which is\nsufficiently large so that p(n + 1) ≈ 0 is a good approximation. The initial and final probability distributions\nare then related by a constant matrix, which can simply\nbe inverted. This matrix can also be modified to account\nfor dark counts in a straightforward way.\nThe detection efficiency of the triggering detector\n(VLPC 1) plays a more subtle role in the experiment. Detection losses can result in a higher order photon number\nstate being misinterpreted by the detector as the correct\nphoton number. Because of this, the probability distribution in the idler arm will no longer be an exact photon\nnumber, but a mixture of the desired number plus higher\norder number states. This results in a degradation of the\n\nFIG. 3: Results of the photon number generation experiment.\nThe photon number distributions, after correcting for detection efficiency and dark counts of VLPC 2, are plotted for\nthe reported number n=1,2,3, and 4 by VLPC 1. The detection efficiency and dark counts of VLPC 2 are measured\nindependently.\n\nfidelity, defined as the overlap between the desired state\nand the actual generated state. For a state containing\nn photons the fidelity is simply the probability that n\nphotons are generated.\nWhen the pumping intensity is low, the efficiency of\nthe triggering detector does not play a major role. If\nthe triggering detector sees n photons, it is true with\nvery high probability that the same number of photons\nare present in both arms. The probability that there\nwere more photons present is extremely low, because low\npumping intensity makes the probability of generating\nhigher order photon pairs negligible. Figure 3 shows\nthe experimental results at this low pumping intensity\nregime. The figure shows the photon number distributions measured by VLPC 2, after correcting for detection\nefficiency and dark counts, when VLPC 1 post-selects a\none, two, three, and four photon event. For one, two, and\nthree photon post-selection, a nearly ideal photon number state is generated. For four photon post-selection\nhowever, there are contributions from three and five photon number states. These contributions are attributed to\nthe smearing between the four photon peak and its next\nnearest neighbors in the pulse height histogram of VLPC\n1 (Fig. 2a). The smearing is caused by buildup of multiplication noise, which puts a limit on the photon number resolution at higher numbers [18]. Note that, in a\nfew cases, the corrected probability distribution becomes\nnegative. This erroneous effect is caused by numerical\nerrors in the probability reconstruction.\nAs we increase the pumping power, the imperfect detection efficiency of VLPC 1 will result in degraded fidelity, as was previously discussed. On the other hand,\nhigher pump powers will increase the probability that the\n\n\f4\n1\n\n0.9\n\n0.3\n\n0.8\n\n0.5\n\na\n\n0.7\n\n0.05\n\n0.4\n\n0.3\n0.2\n0\n\n0.6\n0.5\n\n0.1\n\n0.4\n\n0.1\n\nb\n\n10\n\n20\n\n30\n\n40\n\n50\n\n0\n60\n\n0.3\n0\n\n10\n\n20\n\nPump Power (μ W)\n1\n\n0.1\n\n0.6\n0.025\n0.5\n\n10\n\n20\n\n30\n\n40\n\nPump Power (μ W)\n\n50\n\n0\n60\n\n0.015\n\n0.5\n4\n\n0.05\n\nF\n\nc\n\nEfficiency\n\n3\n\nF\n\n0.02\n\n4 Photons\n\n0.7\n\n0.4\n0\n\n0\n60\n\n50\n\n0.6\n\n0.075\n0.8\n\n40\n\n0.7\n\n3 Photons\n\n0.9\n\n30\n\nPump Power (μ W)\n\n0.4\n\n0.01\n\nd\n\n0.005\n\n0.3\n0.2\n10\n\nEfficiency\n\n0.6\n\n0.2\n\nF2\n\n0.7\n\nEfficiency\n\nF\n\n1\n\n0.8\n\nsible.\n\n0.15\n\n2 Photons\n\n0.9\n\nEfficiency\n\n0.4\n\n1 Photon\n\n1\n\n20\n\n30\n\n40\n\n50\n\n0\n\nPump Power (μ W)\n\nFIG. 4: The generation rate (circles) and fidelity (squares) are\nplotted as a function of pump power. The fidelity corresponds\nto the left y-axis, while the generation efficiency corresponds\nto the right y-axis.\n\ncorrect number of photons were generated, and hence the\ngeneration rate of the desired photon number state. This\nleads to a natural tradeoff between the state fidelity and\ngeneration rate of photon number states. The extent of\nthe tradeoff is determined mainly by the detection efficiency of VLPC 1. In order to determine this tradeoff,\nwe measure the fidelity and generation rate as a function of pump power for the four different photon number\nstates. The results are shown in Figure 4. For all four\ncases, increasing the pump power results in higher generation rates but decreased fidelity. In the figure, four data\npoints are labelled as a, b, c, and d. These points designate the pumping intensity before the fidelity begins to\ndrop for one, two, three, and four photon number states.\nThe generation rate and fidelity at these four points are:\na - 11800 Hz and F1 =1.0, b -1100 Hz and F2 =0.94, c 160 Hz and F3 =0.95, d - 84 Hz and F4 =0.6. The above\ngeneration rates are already large enough to be useful\nfor practical experiments. These rates are achieved using\nonly a 45kHz pump repetition rate. The rates could be\nsignificantly enhanced by simply using a pump laser with\na faster repetition rate.\nWe conclude by discussing some of the future extensions of this work. There are two main drawbacks to the\nexperimental scheme we present in this letter. First, the\nsetup does not allow for generation of photon number\nstates on demand. The time in which the number state\nis generated is known but uncontrollable. This problem\ncan be solved in principle by setting up a large parallel\narray of photon number generators along with an optical\nswitch. By making the array large, the probability that\nat least one of the number state generators will generate\nthe right photon number can be made arbitrarily close to\nunity. Of course, with the current setup such a solution\nis impractical, but perhaps the engineering of VLPC arrays, along with more compact two photon sources based\non waveguide technology, may make such a solution pos-\n\nThe second drawback of our experiment is that the\npump pulse to the down-conversion crystal has a 20ns\nduration, as opposed to the coherence time of the downconverted photons which is on the order of femtoseconds. This means that, although the states we generate\nare eigenfunctions of the photon number operator, the\nquantum mechanical wavefunctions of the photons is not\nfixed. In fact the wavefunction of each photon will generally fluctuate from shot to shot. A more ideal source\nwould generate a state in which both the number and\nwavefunction of the photons is constant. The best case\nscenario would be the generation of a so-called n-photon\nFock state, which is a state containing n-photons with\nidentical wavefunctions. Our setup could be extended to\ngenerate such a state by replacing the pumping laser with\na femtosecond pulse laser, so that the pulse duration is\non the order of the coherence length of the photons. This\ncould open up the door for interesting new experiments\nin quantum information using photon number states.\n\n[1] D. Walls and G. Milburn, Quantum optics (Springer,\nNew York, 1995).\n[2] Y. Yamamoto and H. Haus, Rev. Mod. Phys. 54, 1001\n(1986).\n[3] C. Caves and P. Drummond, Rev. Mod. Phys. 66, 481\n(1994).\n[4] M. Holland and K. Burnett, Phys. Rev. Lett. 86, 1502\n(2001).\n[5] C. Santori et al., Phys. Rev. Lett. 86, 1502 (2001).\n[6] J. Kim, O. Benson, H. Kan, and Y. Yamamoto, Nature\n397, 500 (1999).\n[7] B. Lounis and W. Moerner, Nature 407, 491 (2000).\n[8] P. Michler et al., Science 290, 2282 (2000).\n[9] E. Moreau et al., App. Phy. Lett. 79, 2865 (2001).\n[10] A. Beveratos et al., Euro. Phys. J 18, 191 (2002).\n[11] Z. Yuan et al., Science 295, 102 (2002).\n[12] B. Varcoe et al., Nature 403, 743 (2001).\n[13] K. Brown et al., Phys. Rev. A 67, 043818 (2003).\n[14] G. Turner et al., Visible light photon counters for scintillating fiber applications: I. characteristics and performance, Proceedings of the Workshop on Scintillating\nFiber Detectors (1993), pg. 613.\n[15] S. Takeuchi, J. Kim, and Y. Yamamoto, App. Phys. Lett.\n74, 1063 (1999).\n[16] M. Atac et al., Nucl. Instrum. & Methods in Phs. Research A 314, 56 (1994).\n[17] J. Kim, S. Takeuchi, and Y. Yamamoto, App. Phys. Lett.\n74, 902 (1999).\n[18] E. Waks et al., quant-ph/0308054.\n[19] R. McIntyre, IEEE Trans. Electron Devices ED-13, 164\n(1966).\n[20] J. Kim, Y. Yamamoto, and H. Hogue, App. Phys. Lett.\n70, 2852 (1997).\n[21] C. Monken, P. S. Ribeiro, and S. Padua, Phys. Rev. A\n57, R2267 (1998).\n\n\f"}