{"id": "http://arxiv.org/abs/quant-ph/0307083v2", "guidislink": true, "updated": "2004-06-22T08:13:24Z", "updated_parsed": [2004, 6, 22, 8, 13, 24, 1, 174, 0], "published": "2003-07-10T15:22:59Z", "published_parsed": [2003, 7, 10, 15, 22, 59, 3, 191, 0], "title": "Spontaneous-emission suppression via multiphoton quantum interference", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=quant-ph%2F0609140%2Cquant-ph%2F0609170%2Cquant-ph%2F0609079%2Cquant-ph%2F0609148%2Cquant-ph%2F0609182%2Cquant-ph%2F0609203%2Cquant-ph%2F0609155%2Cquant-ph%2F0609053%2Cquant-ph%2F0609014%2Cquant-ph%2F0609036%2Cquant-ph%2F0609098%2Cquant-ph%2F0609230%2Cquant-ph%2F0609106%2Cquant-ph%2F0609133%2Cquant-ph%2F0609189%2Cquant-ph%2F0609129%2Cquant-ph%2F0609025%2Cquant-ph%2F0609121%2Cquant-ph%2F0609046%2Cquant-ph%2F0609054%2Cquant-ph%2F0609130%2Cquant-ph%2F0609016%2Cquant-ph%2F0609067%2Cquant-ph%2F0609052%2Cquant-ph%2F0609082%2Cquant-ph%2F0609022%2Cquant-ph%2F0609191%2Cquant-ph%2F0609176%2Cquant-ph%2F0609219%2Cquant-ph%2F0609175%2Cquant-ph%2F0609209%2Cquant-ph%2F0609087%2Cquant-ph%2F0609010%2Cquant-ph%2F0609029%2Cquant-ph%2F0609119%2Cquant-ph%2F0609204%2Cquant-ph%2F0609152%2Cquant-ph%2F0609050%2Cquant-ph%2F0609044%2Cquant-ph%2F0609095%2Cquant-ph%2F0609166%2Cquant-ph%2F0609193%2Cquant-ph%2F0609073%2Cquant-ph%2F0609150%2Cquant-ph%2F0609062%2Cquant-ph%2F0609234%2Cquant-ph%2F0609048%2Cquant-ph%2F0609100%2Cquant-ph%2F0609184%2Cquant-ph%2F0307149%2Cquant-ph%2F0307130%2Cquant-ph%2F0307220%2Cquant-ph%2F0307135%2Cquant-ph%2F0307199%2Cquant-ph%2F0307165%2Cquant-ph%2F0307198%2Cquant-ph%2F0307222%2Cquant-ph%2F0307223%2Cquant-ph%2F0307117%2Cquant-ph%2F0307031%2Cquant-ph%2F0307134%2Cquant-ph%2F0307065%2Cquant-ph%2F0307189%2Cquant-ph%2F0307202%2Cquant-ph%2F0307003%2Cquant-ph%2F0307085%2Cquant-ph%2F0307156%2Cquant-ph%2F0307133%2Cquant-ph%2F0307088%2Cquant-ph%2F0307118%2Cquant-ph%2F0307157%2Cquant-ph%2F0307207%2Cquant-ph%2F0307216%2Cquant-ph%2F0307048%2Cquant-ph%2F0307034%2Cquant-ph%2F0307089%2Cquant-ph%2F0307158%2Cquant-ph%2F0307195%2Cquant-ph%2F0307226%2Cquant-ph%2F0307205%2Cquant-ph%2F0307060%2Cquant-ph%2F0307172%2Cquant-ph%2F0307072%2Cquant-ph%2F0307178%2Cquant-ph%2F0307113%2Cquant-ph%2F0307104%2Cquant-ph%2F0307141%2Cquant-ph%2F0307030%2Cquant-ph%2F0307021%2Cquant-ph%2F0307230%2Cquant-ph%2F0307069%2Cquant-ph%2F0307112%2Cquant-ph%2F0307083%2Cquant-ph%2F0307093%2Cquant-ph%2F0307020%2Cquant-ph%2F0307116%2Cquant-ph%2F0307173%2Cquant-ph%2F0307188%2Cquant-ph%2F0307014%2Cquant-ph%2F0307110%2Cquant-ph%2F0307164&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Spontaneous-emission suppression via multiphoton quantum interference"}, "summary": "The spontaneous emission is investigated for an effective atomic two-level\nsystem in an intense coherent field with frequency lower than the\nvacuum-induced decay width. As this additional low-frequency field is assumed\nto be intense, multiphoton processes may be induced, which can be seen as\nalternative transition pathways in addition to the simple spontaneous decay.\nThe interplay of the various interfering transition pathways influences the\ndecay dynamics of the two-level system and may be used to slow down the\nspontaneous decay considerably. We derive from first principles an expression\nfor the Hamiltonian including up to three-photon processes. This Hamiltonian is\nthen applied to a quantum mechanical simulation of the decay dynamics of the\ntwo-level system. Finally, we discuss numerical results of this simulation\nbased on a rubidium atom and show that the spontaneous emission in this system\nmay be suppressed substantially.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=quant-ph%2F0609140%2Cquant-ph%2F0609170%2Cquant-ph%2F0609079%2Cquant-ph%2F0609148%2Cquant-ph%2F0609182%2Cquant-ph%2F0609203%2Cquant-ph%2F0609155%2Cquant-ph%2F0609053%2Cquant-ph%2F0609014%2Cquant-ph%2F0609036%2Cquant-ph%2F0609098%2Cquant-ph%2F0609230%2Cquant-ph%2F0609106%2Cquant-ph%2F0609133%2Cquant-ph%2F0609189%2Cquant-ph%2F0609129%2Cquant-ph%2F0609025%2Cquant-ph%2F0609121%2Cquant-ph%2F0609046%2Cquant-ph%2F0609054%2Cquant-ph%2F0609130%2Cquant-ph%2F0609016%2Cquant-ph%2F0609067%2Cquant-ph%2F0609052%2Cquant-ph%2F0609082%2Cquant-ph%2F0609022%2Cquant-ph%2F0609191%2Cquant-ph%2F0609176%2Cquant-ph%2F0609219%2Cquant-ph%2F0609175%2Cquant-ph%2F0609209%2Cquant-ph%2F0609087%2Cquant-ph%2F0609010%2Cquant-ph%2F0609029%2Cquant-ph%2F0609119%2Cquant-ph%2F0609204%2Cquant-ph%2F0609152%2Cquant-ph%2F0609050%2Cquant-ph%2F0609044%2Cquant-ph%2F0609095%2Cquant-ph%2F0609166%2Cquant-ph%2F0609193%2Cquant-ph%2F0609073%2Cquant-ph%2F0609150%2Cquant-ph%2F0609062%2Cquant-ph%2F0609234%2Cquant-ph%2F0609048%2Cquant-ph%2F0609100%2Cquant-ph%2F0609184%2Cquant-ph%2F0307149%2Cquant-ph%2F0307130%2Cquant-ph%2F0307220%2Cquant-ph%2F0307135%2Cquant-ph%2F0307199%2Cquant-ph%2F0307165%2Cquant-ph%2F0307198%2Cquant-ph%2F0307222%2Cquant-ph%2F0307223%2Cquant-ph%2F0307117%2Cquant-ph%2F0307031%2Cquant-ph%2F0307134%2Cquant-ph%2F0307065%2Cquant-ph%2F0307189%2Cquant-ph%2F0307202%2Cquant-ph%2F0307003%2Cquant-ph%2F0307085%2Cquant-ph%2F0307156%2Cquant-ph%2F0307133%2Cquant-ph%2F0307088%2Cquant-ph%2F0307118%2Cquant-ph%2F0307157%2Cquant-ph%2F0307207%2Cquant-ph%2F0307216%2Cquant-ph%2F0307048%2Cquant-ph%2F0307034%2Cquant-ph%2F0307089%2Cquant-ph%2F0307158%2Cquant-ph%2F0307195%2Cquant-ph%2F0307226%2Cquant-ph%2F0307205%2Cquant-ph%2F0307060%2Cquant-ph%2F0307172%2Cquant-ph%2F0307072%2Cquant-ph%2F0307178%2Cquant-ph%2F0307113%2Cquant-ph%2F0307104%2Cquant-ph%2F0307141%2Cquant-ph%2F0307030%2Cquant-ph%2F0307021%2Cquant-ph%2F0307230%2Cquant-ph%2F0307069%2Cquant-ph%2F0307112%2Cquant-ph%2F0307083%2Cquant-ph%2F0307093%2Cquant-ph%2F0307020%2Cquant-ph%2F0307116%2Cquant-ph%2F0307173%2Cquant-ph%2F0307188%2Cquant-ph%2F0307014%2Cquant-ph%2F0307110%2Cquant-ph%2F0307164&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The spontaneous emission is investigated for an effective atomic two-level\nsystem in an intense coherent field with frequency lower than the\nvacuum-induced decay width. As this additional low-frequency field is assumed\nto be intense, multiphoton processes may be induced, which can be seen as\nalternative transition pathways in addition to the simple spontaneous decay.\nThe interplay of the various interfering transition pathways influences the\ndecay dynamics of the two-level system and may be used to slow down the\nspontaneous decay considerably. We derive from first principles an expression\nfor the Hamiltonian including up to three-photon processes. This Hamiltonian is\nthen applied to a quantum mechanical simulation of the decay dynamics of the\ntwo-level system. Finally, we discuss numerical results of this simulation\nbased on a rubidium atom and show that the spontaneous emission in this system\nmay be suppressed substantially."}, "authors": ["J. Evers", "C. H. Keitel"], "author_detail": {"name": "C. H. Keitel"}, "author": "C. H. Keitel", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0953-4075/37/13/013", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/quant-ph/0307083v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/quant-ph/0307083v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "18 pages, 7 figures, latest version with minor changes", "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/quant-ph/0307083v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/quant-ph/0307083v2", "journal_reference": "J. Phys. B: At. Mol. Opt. Phys. 37, 2771-2796 (2004)", "doi": "10.1088/0953-4075/37/13/013", "fulltext": "arXiv:quant-ph/0307083v2 22 Jun 2004\n\nSpontaneous-emission suppression via multiphoton\nquantum interference\nJörg Evers1 and Christoph H Keitel2,1\n1\n\nTheoretische Quantendynamik, Fakultät für Mathematik und Physik, Universität\nFreiburg, Hermann-Herder-Strasse 3, D-79104 Freiburg, Germany\n2\nMax-Planck-Institut für Kernphysik, Saupfercheckweg 1, D-69117 Heidelberg,\nGermany\nE-mail: evers@physik.uni-freiburg.de, keitel@mpi-hd.mpg.de\nAbstract. The spontaneous emission is investigated for an effective atomic twolevel system in an intense coherent field with frequency lower than the vacuuminduced decay width. As this additional low-frequency field is assumed to be intense,\nmultiphoton processes may be induced, which can be seen as alternative transition\npathways in addition to the simple spontaneous decay. The interplay of the various\ninterfering transition pathways influences the decay dynamics of the two-level system\nand may be used to slow down the spontaneous decay considerably. We derive\nfrom first principles an expression for the Hamiltonian including up to three-photon\nprocesses. This Hamiltonian is then applied to a quantum mechanical simulation of\nthe decay dynamics of the two-level system. Finally, we discuss numerical results of\nthis simulation based on a rubidium atom and show that the spontaneous emission in\nthis system may be suppressed substantially.\n\nSubmitted to: J. Phys. B: At. Mol. Phys.\nPACS numbers: 42.50.Lc, 42.50.Ct, 42.50.Hz\n\n1. Introduction\nWhile spontaneous decay is a fundamental ingredient for many physical processes, many\napplications have been proposed recently where spontaneous processes are amongst\nthe main limiting factors [1]. These schemes usually rely on the persistence of either\npopulation trapped in a specific state or of coherences on timescales long as compared to\ntypical atomic timescales such as the lifetime of an atomic state. A well-known example\nfor this restriction is the construction of a high frequency laser, where it is hard to\nreach a population inversion as the spontaneous decay is considerable on high frequency\ntransitions. For the storage and the processing of quantum information, spontaneous\nemission is a major limitation, because it is necessary to avoid all possible sources of\ndecoherence in these schemes. The same holds for the secure information transmission\nusing quantum effects.\n\n\fSpontaneous-emission suppression via multiphoton quantum interference\n\n2\n\nBecause of the great interest in these applications, various schemes to modify the\nspontaneous dynamics of an atomic system have been proposed [2, 3, 4, 5, 6, 7, 8, 9,\n10, 11, 12]. One ansatz is the quantum Zeno effect [2]. According to the measurement\npostulate, a system is projected into one of its eigenstates upon a measurement. If the\nmeasurements are repeated rapidly, the system evolution may effectively be stopped,\nbecause each measurement projects the system back into the initial state. The technical\nconditions on the brevity of the pulses though may not always be easily fulfilled for\nevery transition, especially in the free vacuum. Another possibility is a modification of\nthe vacuum surrounding the given atomic system, e.g. by an optical cavity [3]. If the\nvacuum is modified such that the mode density at the frequency of an atomic transition\nis decreased, spontaneous processes on the given transition may be suppressed. Here\nthe control of the environmental modes with cavities is rather challenging in reality and\nnot suitable to all schemes. Thirdly it is possible to find superpositions of more than\none upper state which are stable [4] or almost stable [5, 6] against spontaneous decay.\nThe suppression of the spontaneous decay here is due to quantum interference effects\nsuch as the cancellation of the amplitudes of several possible pathways between two\nsystem states [7]. In spite of the conceptual beauty, the disadvantage here often is the\ndifficulty to provide convenient atomic systems which fulfill all conditions such as parallel\ntransition dipole moments for interference to be present. Finally, a system driven by an\nelectromagnetic field periodic in time is somewhat related to systems exhibiting spacial\nperiodicity such as crystals. Thus schemes relying on spacial periodicity which involve\na change of the probability for incoherent processes such as the Borrmann effect [13]\nor the suppression of nuclear reactions [14] may be transferred to laser-driven atomic\nsystems [8]. Recently, this idea has also been applied to modify the decay of a three\nlevel system in V-configuration [9].\nIn [10], a scheme was proposed to slow down the spontaneous decay of the upper\nstate population of an effective atomic two-level system considerably. This scheme\nmakes use of an intense low-frequency laser field of constant frequency and intensity\nwhich is applied to the two-level system such that the frequency of the low-frequency\nfield is lower than the decay width of the atomic transition. This additional field\ninduces multiphoton transitions between the two atomic states under consideration,\nthus allowing for alternative pathways between the two states in addition to spontaneous\ntransitions. In the literature, Hamiltonians describing two-photon processes have been\ndiscussed to a great extend [15, 16]. However these mainly apply to systems involving\ndipole-forbidden transitions. As our aim is to inhibit spontaneous decay, it is not\nsufficient to look at the spontaneous emission on dipole-forbidden transitions as these\nrates are very low naturally. For dipole-allowed transitions, two- and four-photon\npathways vanish due to parity reasons. Therefore it is necessary to extend the analysis\nto third-order processes [17]. The leading-order corrections are five-photon processes,\nwhich we neglect as these have a low probability in the discussed parameter range.\nThus in this paper, we derive the Hamiltonian describing the interaction of the twolevel system with both the vacuum modes and the additional low-frequency field mode\n\n\fSpontaneous-emission suppression via multiphoton quantum interference\n\n3\n\nincluding up to three-photon processes from first principles by adiabatically removing\nthe intermediate atomic states of the multiphoton processes. We calculate the coupling\nconstants which were taken as free parameters in [10] in terms of the properties of the\natom and the laser field. Furthermore, the Hamiltonian includes Stark shift effects not\ndiscussed in [10], which however will turn out to be of no importance for the suppression\nscheme. This Hamiltonian is then applied to a quantum mechanical simulation of the\ndecay dynamics of the two-level system. As it will turn out, the spontaneous decay\nmay be slowed down considerably due to the additional transition pathways induced by\nthe intense low-frequency field. In the final part, this is demonstrated using numerical\nresults of this simulation based on rubidium atoms.\n2. Derivation of the multiphoton Hamiltonian\nThe derivation starts from the usual Hamiltonian for an atomic system coupled to\nquantized electromagnetic fields [1]. The atomic system consists of two atomic states\n(typically of opposite parity) which are considered as the ground state |1i and the excited\nstate |2i of an two-level atom, which we will denote as the effective two-level system\nthroughout this paper. To model possible multiphoton transitions between the two\neffective atomic levels, unspecified auxiliary states |ji (j = 3, 4, . . .) are required, which\nwill be adiabatically eliminated throughout the analysis. These states might even be\npart of the continuum; the only condition on them is that they are sufficiently far away\nfrom the two main atomic states as will be explained in more detail below. Since there\nare no isolated two-level atomic systems, the presence of this states is always guaranteed.\nThe auxiliary states are necessary as in starting from first principles, i.e. the interaction\n~ we only allow for one-photon transitions between the two\nHamiltonian HI = −d~E,\n\n|3i, |4i, . . .\n|2i\nPSfrag replacements\n\n|1i\nFigure 1. The two-level atom and the auxiliary states |3i, |4i, . . . which will be\nadiabatically removed in the derivation of the multiphoton Hamiltonian. The auxiliary\nstates are show schematically; their relative position is not restricted to be above the\ntwo main atomic states. After the adiabatic elimination, the effective two-level system\nexhibits multiphoton processes as symbolized in the figure. Here, the short arrows\ndepict interactions with the intense low-frequency field and the long arrows interactions\nwith the vacuum field.\n\n\fSpontaneous-emission suppression via multiphoton quantum interference\n\n4\n\neffective atomic states. Multiphoton processes are then introduced by considering series\nof one-photon processes from one of the two effective states to the other effective state\nvia one or more of the auxiliary states, which within the adiabatic approximation occur\nsimultaneously. The result will be a Hamiltonian involving the states of the effective\ntwo-level system only, which will turn out to be a generalization of the one used in [10].\nThe applied field consists of the low frequency field of frequency ω̄ and the vacuum\nfield modes. The following analysis is similar to the one in [15], and the notation is close\nto [15, 10]. The system Hamiltonian is given by\nH = H0 + HI ,\n\n(1)\n\nH0 = ~ω1 |1ih1| + ~ω2 |2ih2| +\n~.\nHI = −d~E\n\nX\n\nj ∈{1,2}\n/\n\n†\n\n~ωj |jihj| + ~ω̄b b + ~\n\nX\n\nωk a†k ak\n\n,\n\n(2)\n\nk\n\n(3)\n\nHere, ~ω1 , ~ω2 and ~ωj (j = 3, 4, . . .) are the energies of state |1i, |2i and auxiliary state\n|ji, respectively. k is a multi index over all polarization modes and vacuum frequencies\nωk . Throughout the analysis, we denote sums over all auxiliary states excluding the two\neffective atomic states |1i, |2i by the sum subscript j ∈\n/ {1, 2}, where j is the summation\n†\nindex. b (b ) is a low-frequency field annihilation (creation) operator, ak (a†k ) annihilates\n~ is\n(creates) a vacuum photon of mode k, d~ is the total atomic dipole operator, and E\nthe electric field given by\n!\nX\n†\n~ = i E(~eb − ~e∗ b† ) +\nEk (~ek ak − ~e∗ a ) .\n(4)\nE\nk k\n\nk\n\nThe ~e, ~ek are polarization vectors, while the E, Ek are field amplitudes. The frequency\ncorresponding to the low-frequency field operators b, b† is assumed to be different\nfrom the relevant frequencies for the vacuum photons, which are close to the atomic\ntransition frequency of the effective two-level system, such that the low-frequency\nfield operators commute with the relevant vacuum field operators. In the following\nanalysis, we make use of the approximation that no multiphoton transitions involving\ntwo or more spontaneous photons with different frequencies are included. As in our\nsystem spontaneous one-photon transitions are possible, transitions involving more\nthan one spontaneous photon are highly suppressed; see the processes considered and\nobserved in [19]. However we include multiple spontaneous photons with the same\nfrequency to account for Stark shifts, which arise from interactions of the atom with the\nelectromagnetical field as a sequence of an absorption and an emissions (or vice versa)\nwhich does not change the state of the atomic system. Also we consider all possible\ncombinations of interactions with the low-frequency field as it is intense.\nThe interaction part of the Hamiltonian may be expanded as follows:\nX\nX\n~\n~ =−\n~ =−\n~\nHI = −d~E\n|nihn|d|mihm|\nE\nd~nm σnm E\nn,m\n\nn,m\n\n\u0010\n\u0011\n\u0011\nX \u0010\n~−\n~\n= − d~12 σ12 + d~21 σ21 E\nd~1j σ1j + d~j1 σj1 + d~2j σ2j + d~j2 σj2 E\nj ∈{1,2}\n/\n\n\fSpontaneous-emission suppression via multiphoton quantum interference\nX\n~.\nd~jj ′ σjj ′ E\n−\n\n5\n(5)\n\nj,j ′ ∈{1,2}\n/\n\n~\nσnm = |nihm| is the atomic transition operator, d~nm = hn|d|mi\nis the dipole moment\ncorresponding to transition n ↔ m. Some of these dipole moments may be zero due to\nsymmetry reasons, however as this depends on the configuration of the auxiliary states,\nwe keep this most general form of the Hamiltonian. A specific example for this will be\ngiven in section 3.2 where we discuss rubidium as a model system. In this expansion,\nthe first part in equation (5) corresponds to direct transitions between the ground and\nthe excited state by dipole coupling to one of the electric field components (i.e. onephoton transitions). The second addend couples both the ground and the excited state\nto one of the auxiliary states. After an adiabatic elimination of these intermediate\nstates, this part will turn out to represent multiphoton transitions. Obviously n-photon\ntransitions with n > 2 require transitions amongst the auxiliary states; thus these effects\nare accounted for by the last part in equation (5). These last two parts together with\nthe intense low-frequency field lead to a system evolution which qualitatively differs\nfrom the well-known Mollow-type evolution for two-level systems resonantly driven by\na laser field [18]. It is important to note that a higher order multiphoton treatment\nbased on the above Hamiltonians involves operator ordering issues, as in the following\nanalysis the atomic transition operators involving auxiliary states will be represented\nby expressions containing photon operators. If these issues are not taken into account,\nthe resulting Hamiltonians are not self-adjoint. Thus strictly speaking, expressions like\n(d~1j σ1j + d~j1σj1 )(~eb − ~e∗ b† )\n\n(6)\n\nin the above Hamiltonians are understood to be read as\nd~j1σj1 (~eb − ~e∗ b† ) + (~eb − ~e∗ b† ) d~1j σ1j .\n\n(7)\n\nAs the above equation equation (5) is difficult to solve exactly, we use a perturbative\napproach which consists of an expansion in the number of interactions with the auxiliary\nlevels. The lowest order Hamiltonian thus does not include any interactions with the\nauxiliary levels and may therefore be written as\n\u0010\n\u0011\n(1−photon)\n~ 12 + d~21 σ21 E\n~ .\nHI\n= − d~12 Eσ\n(8)\n\nThis Hamiltonian simply describes the coupling of the vacuum- and the low-frequency\nfield to the effective two-level atom and does not contain contributions of the auxiliary\nstates. To account for two-photon processes, we have to consider transitions from the\nground or the excited state into and out of the auxiliary states, but no transitions\n(0)\n(0)\namongst the auxiliary states. For this we introduce the transition operators σ1j , σ2j\nand their conjugates, where the super index (0) denotes the lowest order approximation\nwhose equations of motion do not include any contribution of the auxiliary states.\nOnly the operators involving the auxiliary states are approximated, as the operators\nconnecting only the ground and the excited state contain the main evolution of the\nsystem and therefore have to be taken into account to all orders. Thus the two-photon\n\n\fSpontaneous-emission suppression via multiphoton quantum interference\n\n6\n\nHamiltonian is given by\n(2−photon)\n\nHI\n\n\u0010\n\u0011\nX \u0010\n~ 12 + d~21 σ21 E\n~ −\n~ (0) + d~j1 σ (0) E\n~\n= − d~12 Eσ\nd~1j Eσ\n1j\nj1\nj ∈{1,2}\n/\n\n+\n\n~ (0)\nd~2j Eσ\n2j\n\n+\n\n(0) ~\nd~j2σj2 E\n\n\u0011\n\n.\n\n(9)\n(0)\n\n(0)\n\nAs it will be shown in section 2.1, the transition operators σ1j , σ2j and their conjugates\nconsist of sums of products of a transition operator σij (i, j ∈ {1, 2}) and a photon\nannihilation or creation operator. Thus it may easily be seen that contributions to the\nHamiltonian in equation (9) containing transition operators to one of the auxiliary states\ndescribe two-photon processes. Including up to three-photon processes, a transition\nfrom one of the two effective atomic levels to one of the auxiliary levels may be\nfollowed by a transition to another auxiliary state. Thus the three-photon Hamiltonian\n(1)\n(1)\nmay be expressed in terms of the first order transition operators σ1j , σ2j and their\nconjugates, whose equations of motion contain either lowest-order transition operators to\nthe auxiliary state or transitions between the two effective atomic states. Also, transition\n(0)\noperators between two auxiliary states are possible in lowest order σjj ′ (j, j ′ ∈\n/ {1, 2}),\ni.e. with no reference to the auxiliary states in the equations of motion. This yields\n\u0010\n\u0011\nX\n(0) ~\n(3−photon)\n~\n~\n~\n~\nd~jj ′ σjj ′ E\nHI\n= − d12 Eσ12 + d21 σ21 E −\nj,j ′ ∈{1,2}\n/\n\n\u0011\nX \u0010\n~ (1) + d~j1 σ (1) E\n~ + d~2j Eσ\n~ (1) + d~j2 σ (1) E\n~\n−\nd~1j Eσ\n1j\nj1\n2j\nj2\n\n(10)\n\nj ∈{1,2}\n/\n\nas the three-photon Hamiltonian. Here, the operator ordering was not applied to the\nterm containing a double sum over j, j ′ for notational simplicity as it will turn out to\n(n−photon)\nbe irrelevant for the present analysis. For higher order processes, HI\nwith n > 3\nmay be obtained similarly. Introducing the coupling constants\ni Ek d~ij ~ek\ni E d~ij ~e\n,\nλijk = −\n(11)\nλij = −\n~\n~\nwhere the transition dipole moments are assumed to be real, the Hamiltonians may be\nwritten as\n\u0011o\nn\nX\u0010\n(1−photon)\nσ12 + h.c. ,\n(12)\nλ12k ak + λ∗12k a†k\nHI\n= ~ λ12 b + λ∗12 b† +\nk\n\n(2−photon)\nHI\n\n=\n\n(1−photon)\nHI\n2\nX\nX\n\n+~\n\nm=1 j ∈{1,2}\n/\n\n(3−photon)\nHI\n\n=\n\n(1−photon)\nHI\n2\nX\nX\n\n+~\n\nm=1 j ∈{1,2}\n/\n\n+~\n\n\u0011o\nn\nX\u0010\n(0)\nσmj + h.c. , (13)\nλmjk ak + λ∗mjk a†k\nλmj b + λ∗mj b† +\nk\n\n\u0011o\nn\nX\u0010\n(1)\n†\n∗\n∗\n†\nσmj\nλmjk ak + λmjk ak\nλmj b + λmj b +\nk\n\n\u0011o\nX\u0010\nX n\n(0)\nσjj ′ + h.c. .\nλjj ′k ak + λ∗jj ′k a†k\nλjj ′ b + λ∗jj ′ b† +\n\nj,j ′∈{1,2}\n/\n\nk\n\n(14)\n\n\fSpontaneous-emission suppression via multiphoton quantum interference\n\n7\n\n2.1. Atomic transition operators\n2.1.1. Equations of motion The equations of motion for the various operators involved\nmay be obtained using the Heisenberg equation\ni\nd\nO = [H, O]\n(15)\ndt\n~\nwhere O is an operator in the Heisenberg picture. For the transition operator σij with\ni = 1, j ∈\n/ {1, 2} - which is one of the elements that occurs in the above Hamiltonians\nin equations (13, 14) - this may be expanded as follows to the lowest two orders in the\ninteraction with the auxiliary states:\n\u0011\ni \u0010~\n(0)\n(0)\n~,\ndj1σ11 + d~j2σ12 E\n(16)\nσ̇1j = i ω1j σ1j +\n~\n\n\n\u0011\nX\ni \u0010~\n(0) ~ \n(1)\n(1)\n~ (0) −\n~ − i d~21 Eσ\nd~jn σ1n E\n,\n(17)\nσ̇1j = i ω1j σ1j +\ndj1σ11 + d~j2σ12 E\n2j\n~\n~\nn∈{1,2}\n/\n\nwhere ωnm = ωn −ωm (n, m ∈ N). The zeroth order equation does not include references\nto the auxiliary states, while the first order includes operators connecting one of the\nmain atomic states with an auxiliary state in zeroth order. Note that for simplicity we\n(0)\nomitted an addend containing the transition operator σnj in the first-order equation, as\nit will turn out to be zero (see equation (28)). Higher order expressions may be obtained\nsimilarly. For i = 2, j ∈\n/ {1, 2}, we have:\n\u0010\n\u0011\ni ~\n(0)\n(0)\n~,\ndj1σ21 + d~j2σ22 E\n(18)\nσ̇2j = i ω2j σ2j +\n~\n\n\n\u0011\nX\ni \u0010~\n(1)\n(1)\n(0) ~ \n~ − i d~12 Eσ\n~ (0) −\nσ̇2j = i ω2j σ2j +\ndj1σ21 + d~j2σ22 E\nd~jn σ2n E\n.\n(19)\n1j\n~\n~\nn∈{1,2}\n/\n\nFor i, j ∈\n/ {1, 2} the corresponding expression in lowest order simply becomes\n(0)\n\n(0)\n\nσ̇ij = i ωij σij .\n\n(20)\n\n2.1.2. First-order transition operators The basic tool to eliminate the auxiliary states\nfrom the equation of motion is the adiabatic integration. For this, the equations of\nmotion are written in terms of slowly varying operators which are denoted by the\ncorresponding symbol with a tilde and which may be seen as an interaction picture\nrepresentation of the operator:\nσ̃12 = σ12 ei(ω̄+ωk )t ,\n\nσ̃1j = σ1j e−iω1j t ,\n\nσ̃ii = σii ,\n\nσ̃2j = σ2j e−iω2j t ,\n\nb̃ = b eiω̄t ,\n\nãk = ak eiωk t .\n\n(21)\n\nThe adiabatic approximations with superscripts (0), (1) are transferred as their full\ncounterparts. The definition of the slowly varying operators is chosen as in [15] to allow\nfor a comparison of the results. This for example yields using equations (4), (11) and\n\n\f8\n\nSpontaneous-emission suppression via multiphoton quantum interference\n(16)\n(0)\nσ̃ ̇ 1j = −i λj1 σ̃11 b̃ e−i(ω1j +ω̄)t − i λ∗j1 σ̃11 b̃† e−i(ω1j −ω̄)t − i λj1k σ̃11 ãk e−i(ω1j +ωk )t\n\n−i λ∗j1k σ̃11 ã†k e−i(ω1j −ωk )t − i λj2 σ̃12 b̃ e−i(ω1j +2ω̄+ωk )t − i λ∗j2 σ̃12 b̃† e−i(ω1j +ωk )t\n\n−i λj2k σ̃12 ãk e−i(ω1j +2ωk +ω̄)t − i λ∗j2k σ̃12 ã†k e−i(ω1j +ω̄)t .\n\n(22)\n\nNow we integrate over time, using the partial integration rule. For simplicity, only the\nfirst addend of equation (22) is shown to illustrate the basic idea of adiabatic integration:\nZ\n(0)\nσ̃1j = − i\nλj1 σ̃11 b̃ e−i(ω1j +ω̄)t dt + (other addends)\n\u001a \u0010\nZ\n\u0011\u001b\nd\nλj1 e−i(ω1j +ω̄)t\nλj1 σ̃11 b̃ −i(ω1j +ω̄)t\nσ̃11 b̃\ndt\ne\n−\n=\n(ω1j + ω̄)\n(ω1j + ω̄)\ndt\n+ (other addends) .\n(23)\nIn the adiabatic integration one now assumes that the time evolution of the slowly\nchanging operators\n\u0011\nd \u0010\nσ̃11 b̃\n(24)\ndt\n(which is typically of the order of the atomic decay rate or the Rabi frequencies involved)\nis low as compared to the oscillation of the exponential function. This is fulfilled if the\nRabi frequencies involved are not too large and if the intermediate states |ji (j ∈\n/ {1, 2})\nare sufficiently far away from the atomic ground and excited state, which we assume in\nthe following. Therefore the integral on the right hand side of equation (23) may be\ndropped, yielding using (21) and including all addends:\n(0)\nσ1j\n\nλj1 σ̃11 b̃ −iω̄t λ∗j1 σ̃11 b̃† iω̄t\nλj2 σ̃12 b̃\n=\ne\n+\ne +\ne−i(2ω̄+ωk )t\n(ω1j + ω̄)\n(ω1j − ω̄)\n(ω1j + 2ω̄ + ωk )\n\nλ∗j2k σ̃12 ã†k −iω̄t\nλ∗j2 σ̃12 b̃† −iωk t\nλj2k σ̃12 ãk\n−i(2ωk +ω̄)t\n+\ne\n+\ne\n+\ne\n(ω1j + ωk )\n(ω1j + ω̄ + 2ωk )\n(ω1j + ω̄)\n†\nλj1k σ̃11 ãk −iωk t λ∗j1k σ̃11 ãk iωk t\n+\ne\n+\ne .\n(ω1j + ωk )\n(ω1j − ωk )\n\n(25)\n\nas the lowest order adiabatic approximation for this atomic transition operator. A\nsimilar calculation yields\n(0)\nσ2j\n\nλj2 σ̃22 b̃ −iω̄t λ∗j2 σ̃22 b̃† iω̄t λj2k σ̃22 ãk −iωk t\ne\n+\ne +\ne\n=\n(ω2j + ω̄)\n(ω2j − ω̄)\n(ω2j + ωk )\n\nλ∗j2k σ̃22 ã†k iωk t\nλ∗j1 σ̃21 b̃†\nλj1 σ̃21 b̃ iωk t\n+\ne\n+\ne\n+\nei(ωk +2ω̄)t\ni(ω2j − ωk )\n(ω2j − ωk )\n(ω2j − ωk − 2ω̄)\n†\n\nλ∗j1k σ̃21 ãk\nλj1k σ̃21 ãk iω̄t\n+\ne +\nei(2ωk +ω̄)t .\n(ω2j − ω̄)\n(ω2j − 2ωk − ω̄)\n\n(26)\n\n(0)\nσ̃ ̇ ij = 0 .\n\n(27)\n\nFrom equation (20), we obtain for i, j ∈\n/ {1, 2} in the slowly varying operator frame:\n\n\fSpontaneous-emission suppression via multiphoton quantum interference\n\n9\n\nAs the auxiliary states are far from resonance with the applied frequencies, in lowest\norder of the adiabatic approximation we thus have [15]\n(0)\n\n(0)\n\nσ̃ij = 0 = σij\n\n(28)\n\nfor i, j ∈\n/ {1, 2}. Another way of seeing this is that due to the vanishing time derivative,\nin this order of approximation the populations of the auxiliary states remain constant.\nAs these populations are zero if the population initially is distributed over the ground\nand the excited state, they are empty at all times.\nThese results are sufficient to calculate the effective two-photon Hamiltonian\nequation (9) and to obtain the first order expressions for the transition operators in\nequations (17) and (19). As the expressions in equations (25) and (26) only contain\ntransition operators involving the ground and the excited state, the elimination of\nthe auxiliary states both from the two-photon Hamiltonian and from the first order\nexpressions for the transition operators is obvious. Note however that the dipole\nmoments connecting the ground and the excited atomic state to the auxiliary states\nremain in the equations influencing the various coefficients or coupling parameters.\n2.1.3.\nHigher-order transition operators To calculate the first order transition\noperators, we we insert the lowest-order transition operators equations (25) and (26) and\ntheir conjugates in the equations of motion for the first order operators equations (17)\nand (19). Then the equations are transferred to the slowly changing operator picture\n(1)\n(1)\nusing the transformation rules equations (21). The resulting expression for σ̃ ̇ 1j , σ̃ ̇ 2j\n(1)\n(1)\n(1)\nand their conjugates may again be adiabatically integrated yielding σ1j , σj1 , σ2j and\n(1)\nσj2 . In addition to the corresponding operator of zeroth order, each of these operators\ncontains 56 addends as first order contribution, 28 of which depend on a sum over\nauxiliary intermediate atomic states |ni. For example, we have\nX\n\u0001\n(1)\n(0)\n21\n12\nσ1j = σ1j + A22\n+\nA\n+\nA11\n(29)\n1j\n1j\n1j (n) + A1j (n) .\nn∈{1,2}\n/\n\nThe operators Aij , which are proportional to σij , and the other first order transition\noperators may be found in Appendix A.\n2.2. Effective Hamiltonians\n\nIn this section, we will use the transition operators derived in the last section to\ngive an explicit representation of the two-photon and the three-photon Hamiltonian\nin equations (9) and (10). The resulting Hamiltonian will turn out to be equivalent\nto the Hamiltonian used in [10]. However here we obtain expressions for the coupling\nconstants gk , ḡi introduced as free parameters in the Hamiltonian in [10] and extend\nthe analysis to include Stark shift contributions to the Hamiltonian. The role of the\nStark shifts for the decay dynamics of the effective two-level atom will be discussed in\nsection 3.\n\n\fSpontaneous-emission suppression via multiphoton quantum interference\n\n10\n\n2.2.1. Two-photon Hamiltonian Using the rotating-wave approximation, we drop all\nterms oscillating with frequencies of the order of ωk or higher in the two-photon\nHamiltonian in equation (9). Thus we neglect counter-rotating interactions with the\nvacuum field, but do not apply the rotating-wave approximation to the interaction of\nthe atom with the low-frequency field. Transferring the resulting expression back to the\nHeisenberg picture adopted in the initial equations equation (5) using the transformation\nrules in equations (21), we obtain\no\nXn\n(2−photon)\nα0 ak σ21 + α1 b ak σ21 + α2 b† ak σ21 + h.c.\nHI\n=~\nk\n\n+~\n\nX\n\n(α3 a†k\n\n∗\nak + α4 ak a†k ) σ11 + ~ (α5 b† b + α6 b b† + α11 b b + α11\nb† b† ) σ11\n\nk\n\n+~\n\nX\n\n∗\n(α7 a†k ak + α8 ak a†k ) σ22 + ~ (α9 b† b + α10 b b† + α12 b b + α12\nb† b† ) σ22 , (30)\n\nk\n\nwhere the coefficients are given by α0 = λ12k ,\n\u0013\nX \u0012 λ2j λj1k\nλ2j λj1k\nλ2jk λj1\nλ2jk λj1\nα1 =\n,\n−\n−\n+\n(∆ − ∆j )\n∆j\n(∆j + ωk − ω̄) (∆ − ∆j − ωk + ω̄)\nj ∈{1,2}\n/\n\u0013\nX \u0012 λj1k λ∗2j\nλj1k λ∗2j\nλ2jk λ∗j1\nλ2jk λ∗j1\n,\n−\n+\n−\nα2 =\n(∆ − ∆j ) (∆j − 2ω̄) (∆ − ∆j − ωk − ω̄) (∆j + ωk − ω̄)\n\n(31)\n(32)\n\nj ∈{1,2}\n/\n\nα3 =\n\nX\n\n−\n\nX\n\n−\n\nj ∈{1,2}\n/\n\nα5 =\n\nj ∈{1,2}\n/\n\nα7 =\n\nX\n\nj ∈{1,2}\n/\n\n2λj1k λ∗1jk\n,\n∆j\n2λj1 λ∗1j\n(∆j + ωk − ω̄)\n\nα4 =\n\nX\n\n−\n\n2λ1jk λ∗j1k\n,\n(∆j + 2ωk )\n\n(33)\n\nX\n\n−\n\n2λ1j λ∗j1\n,\n(∆j + ωk + ω̄)\n\n(34)\n\n2λ2jk λ∗j2k\n,\n(∆ − ∆j − ωk + ω̄)\n\n(35)\n\nj ∈{1,2}\n/\n\n,\n\n2λj2k λ∗2jk\n(∆ − ∆j + ωk + ω̄)\n\nα6 =\n\nj ∈{1,2}\n/\n\n,\n\nα8 =\n\nX\n\nj ∈{1,2}\n/\n\nX 2λ2j λ∗j2\n2λj2 λ∗2j\nα9 =\n,\nα10 =\n,\n(∆ − ∆j + 2ω̄)\n(∆ − ∆j )\nj ∈{1,2}\n/\nj ∈{1,2}\n/\n\u0013\nX \u0012\nλ1j λj1\nλ1j λj1\n,\n−\nα11 =\n−\n(∆j + ωk − ω̄) (∆j + ωk + ω̄)\nj ∈{1,2}\n/\n\u0013\nX \u0012 λ2j λj2\nλ2j λj2\nα12 =\n,\n+\n(∆ − ∆j ) (∆ − ∆j + 2ω̄)\nX\n\n(36)\n(37)\n(38)\n\nj ∈{1,2}\n/\n\nand the detunings are defined as\n\n∆ = ω2 − ω1 − (ωk + ω̄) ,\n\n∆j = ωj1 − ωk .\n\n(39)\n\nHere, the terms proportional to α0 are the usual one-photon Hamiltonian parts. The\nnext addends including α1 , α2 are two-photon transitions which will turn out to be of\nmost interest for the following analysis. Terms with α3 , . . . , α10 may be interpreted\nas Stark shifts due to the presence of the two electromagnetic field modes. This\nHamiltonian is an extension to the one obtained in [15] in that it includes more\n\n\fSpontaneous-emission suppression via multiphoton quantum interference\n\n11\n\ntransitions such as direct one-photon transitions due to the vacuum and also field\nordering effects. These ordering effects are the reason why for example α3 and α4\nhere are not the same other than in [15]. The addends proportional to α11 , α12 are\nsomewhat generalized Stark shifts in that they involve the population operators σ11 and\nσ22 . Usually they do not appear in effective multiphoton Hamiltonians as they may\nbe dropped in a rotating wave approximation if the frequency of the involved photons\nis large enough. For example, the addend with α11 stems from a transition b |jih1|\nfollowed by a transition b |1ihj|, one of which is counter-rotating. But here b represents\na low-frequency photon such that these terms may not be dropped a priori. However as\ndiscussed later the numerical simulations indicate that they do not disturb the effects\ndescribed in [10]. One hint that may help to understand this is that from a quantum\nmechanical point of view, these contributions account for a distribution of the system\nstate over the various Fock states of the low-frequency field without inducing atomic\ntransitions. The trapping effect however does not rely on a specific configuration of the\nlow-frequency field modes such as a concentration of the states to only few of the Fock\nstates.\nThe interpretation of the general structure of this Hamiltonian is straightforward.\nIn each addend of the αl (l = 0, . . . , 12), the number of λ coefficients is equal to\nthe number of photons exchanged. The various processes involved may also be read\noff from the λ coefficients, as for example in α1 in equation (31), which describes\na transition of the effective atom from the ground state |1i to the excited state |2i\ntogether with the absorption of both a low-frequency and a spontaneous photon (bak σ21\nin Hamiltonian equation (30)). The first addend stems from a transition between |1i and\nan intermediate state |ji via a vacuum-induced transition (λj1k ) and a low frequency\nfield photon absorption between |ji and |2i (λ2j ). The third addend is due to a transition\nbetween |1i and an intermediate state |ji via a low frequency field photon absorption\n(λj1 ) and a vacuum-induced transition between |ji and |2i (λ2jk ).\n2.2.2. Three-photon Hamiltonian Using the results of section 2.1.3 in the expression for\nthe three-photon Hamiltonian equation (10) yields after a calculation as in section 2.2.1\nfor the two-photon Hamiltonian the following three-photon Hamiltonian:\no\nXn\n(3−photon)\n(2−photon)\n†\n†\n†\n† †\n(β1 bb + β2 b b + β3 bb + β4 b b ) ak σ12 + h.c. . (40)\nHI\n= HI\n+~\nk\n\nThus as expected the one- and two-photon processes of this Hamiltonian are identical\nto the ones in the two-photon Hamiltonian equation (30). All additional terms in\nequation (40) are three-photon processes. The terms with β1 , β2 are corrections to α0\nin the two-photon Hamiltonian, as they effectively induce the same transition. β3 and\nβ4 are coefficients to the three-photon transition parts, which will be of most interest in\nthe simulation of the decay dynamics. Third-order Stark effects vanish due to symmetry\nreasons. Introducing the detuning ∆n = ωn1 − ωk , the explicit expressions for the β\ncoefficients are given as follows (Note that the sums over j and n have been omitted\nfor notational simplicity; all occurrences of these indices are summed over all auxiliary\n\n\fSpontaneous-emission suppression via multiphoton quantum interference\n\n12\n\nstates in these coefficients):\nλ12 λ∗2jk λ∗j2\nλ1j λ∗jnk λ∗n2\nλ2j λ∗12k λ∗j2\n+\n+\n∆j (∆ − ∆j + ω̄) ∆j (∆ − ∆j + ωk + 2ω̄) ∆n (∆j + ωk )\nλ2j λ∗12 λ∗j2k\nλn2 λ∗1jk λ∗jn\nλjn λ∗j2 λ∗n1k\n+\n+\n+\n(∆j + ωk − ω̄)(∆ − ∆j + ω̄) (∆ − ∆n )(∆ − ∆j − ω̄) (∆n − 2ω̄)(∆j − ω̄)\nλ21 λ∗j1k λ∗j1\nλ1j λ∗jn λ∗n2k\n+\n+\n(∆ − ∆j )(∆j + ωk + 2ω̄) (∆j + ωk )(∆n + ωk − ω̄)\nλj1 λ∗21 λ∗j1k\nλj1 λ∗21k λ∗j1\n+\n+\n(∆ − ∆j − ωk − ω̄)(∆j + 2ωk + ω̄) (∆ − ∆j − ωk − ω̄)(∆j + ωk + 2ω̄)\nλn1 λ∗j2 λ∗jnk\nλjn λ∗j2k λ∗n1\n+\n+\n,\n(41)\n(∆ − ∆j − ω̄)(∆ − ∆n − ωk − ω̄) (∆ − ∆j − ωk )(∆ − ∆n − ωk + ω̄)\nλj1 λ∗21 λ∗j1k\nλn2 λ∗1j λ∗jnk\nλjn λ∗1jk λ∗n2\nβ2 =\n+\n+\n(∆ − ∆j )(∆j + ωk ) (∆n − 2ω̄)(∆j + ωk − 2ω̄) ∆n (∆j − ω̄)\nλn1 λ∗j2k λ∗jn\nλj2 λ∗12k λ∗2j\n+\n+\n(∆ − ∆j − ωk )(∆ − ∆n − ωk − ω̄) (∆j − 2ω̄)(∆ − ∆j + 3ω̄)\nλj2 λ∗jn λ∗n1k\nλjn λ∗1j λ∗n2k\n+\n+\n(∆ − ∆n )(∆ − ∆j + ω̄) (∆j + ωk − 2ω̄)(∆n + ωk − ω̄)\nλj2λ∗jnk λ∗n1\nλj1 λ∗21k λ∗j1\n+\n+\n(∆j + ωk )(∆ − ∆j − ωk + ω̄) (∆ − ∆j + ω̄)(∆ − ∆n − ωk + ω̄)\nλ21 λ∗j1k λ∗j1\nλj2λ∗12 λ∗2jk\n+\n+\n(∆ − ∆j − ωk + ω̄)(∆j + 2ωk + ω̄) (∆j − 2ω̄)(∆ − ∆j + ωk + 2ω̄)\nλ12 λ∗2j λ∗j2k\n+\n,\n(42)\n(∆j + ωk − ω̄)(∆ − ∆j + 3ω̄)\nλjn λn2 λ∗1jk\nλ1j λn2 λ∗jnk\nλj2 λjn λ∗n1k\nβ3 =\n+\n+\n(∆j − 3ω̄)(∆n − 2ω̄) (∆n − 2ω̄)(∆j + ωk − 2ω̄) (∆ − ∆n )(∆ − ∆j − ω̄)\nλ12 λ2j λ∗j2k\nλ21 λj1 λ∗j1k\nλ2j λj2 λ∗12k\n+\n+\n+\n(∆ − ∆j )(∆j + ωk + 2ω̄) (∆j − 2ω̄)(∆ − ∆j + 3ω̄) (∆j + ωk − ω̄)(∆ − ∆j + 3ω̄)\nλjn λn1 λ∗j2k\nλj2 λn1 λ∗jnk\n+\n+\n(∆ − ∆j − ωk − 2ω̄)(∆ − ∆n − ωk − ω̄) (∆ − ∆j − ω̄)(∆ − ∆n − ωk − ω̄)\nλ1j λjn λ∗n2k\nλ∗21k λj1 λj1\n+\n+\n(∆j + ωk − 2ω̄)(∆n + ωk − ω̄) (∆ − ∆j − ωk − ω̄)(∆j + ωk + 2ω̄)\nλ21 λj1 λ∗j1k\nλ12 λj2λ∗2jk\n+\n+\n,\n(43)\n(∆ − ∆j − ωk − ω̄)(∆j + 2ωk + 3ω̄) (∆j − 2ω̄)(∆ − ∆j + ωk + 4ω̄)\nλ∗12 λ∗2j λ∗j2k\nλ∗21 λ∗j1k λ∗j1\nλ∗12 λ∗2jk λ∗j2\n+\n+\nβ4 =\n∆j (∆ − ∆j + ωk ) (∆j + ωk − ω̄)(∆ − ∆j + ω̄) (∆ − ∆j )(∆j + ωk )\nλ∗1j λ∗jn λ∗n2k\nλ∗12k λ∗2j λ∗j2\nλ∗j2 λ∗jn λ∗n1k\n+\n+\n+\n(∆j + ωk )(∆n + ωk − ω̄) ∆j (∆ − ∆j + ω̄) (∆ − ∆n )(∆ − ∆j + ω̄)\nλ∗1j λ∗jnk λ∗n2\nλ∗1jk λ∗jn λ∗n2\nλ∗21k λ∗j1 λ∗j1\n+\n+\n+\n∆n (∆j + ω̄) (∆j + ωk )(∆ − ∆j − ωk + ω̄) ∆n (∆j + ωk )\n\nβ1 =\n\n\fSpontaneous-emission suppression via multiphoton quantum interference\n|ni\n|ji\n\n(1)\n\nPSfrag replacements\n\n|ni\n|ji\n\n(2)\n\n|2i\n\n|2i\n\n|1i\n\n|1i\n|ni\n|ji\n\n(3)\n\n13\n\n|ni\n|ji\n\n(4)\n\n|2i\n\n|2i\n\n|1i\n\n|1i\n\nFigure 2. The first four transitions involved in the coupling constant β3 corresponding\nto the transition bba†k σ12 . The solid lines denote interactions with the low-frequency\nfield, the dashed line denotes a vacuum photon emission. All paths start in state |2i\nand end in state |1i. The lengths of the arrows are not related to the frequencies of\nthe involved photons.\n\nλ∗21 λ∗j1k λ∗j1\nλ∗j2λ∗jnk λ∗n1\n+\n(∆j + 2ωk − ω̄)(∆ − ∆j − ωk + ω̄) (∆ − ∆j + ω̄)(∆ − ∆n − ωk + ω̄)\nλ∗j2k λ∗jn λ∗n1\n.\n+\n(∆ − ∆n − ωk + ω̄)(∆ − ∆j − ωk + 2ω̄)\n\n+\n\n(44)\n\nThe structure of the coefficients is similar to the one in the two-photon Hamiltonian,\nand the contributing transition pathways may be read off each addend. Figure 2\nshows the first four processes contributing to β3 . This coefficient corresponds to the\ntransition bba†k σ12 in the Hamiltonian equation (40). For example, the first addend in\nβ3 in equation (43) describes a path starting by a transition from the excited state |2i\nto the auxiliary state |ni induced by a low-frequency field absorption, followed by a\ntransition to the auxiliary state |ji induced by a low-frequency field absorption, and\nthen a vacuum photon emission with a transition to the ground state |1i. The other\ntransition pathways may be read off the addends accordingly. It is important to note\nthat the frequency of the spontaneous photon emitted or absorbed in the multiphoton\nprocesses is always close to the atomic transition frequency, because the sum of the\nfrequencies of all photons (with a relative sign between emitted and absorbed photons)\nis required to be close to the atomic transition frequency for a spontaneous emission to\noccur. This will be shown using a Wigner-Weisskopf-like calculation in section 3.\nFor any application of the above Hamiltonian equation (40), it is important to be\nable to decide which intermediate states need to be taken into account in the analysis.\nFirst of all, the number of exchanged photons restricts the atomic level space. For\nexample in a three-photon transition from a S (angular momentum l = 0) to a P (l = 1)\nstate, states with l > 2 are not possible as intermediate states. The two important\nparameters which decide about the relevance of the remaining intermediate states are the\ntransition dipole moments which connect the state in question to other relevant states,\nand the frequency separation to the other states. A reasonable parameter involving\nthese quantities is e.g. the ratio βi /α0 (i = 1, . . . , 4), i.e., the coupling strength of the\n\n\fSpontaneous-emission suppression via multiphoton quantum interference\n\n14\n\nmultiphoton transitions relative to the single photon transition strength. By evaluating\nthe expression for βi for each combination of the intermediate states j and n separately,\nit is possible to compare the relative weights of the various pathways as e.g. shown in\nfigure 2. Then the states which give rise to pathways with small relative contribution\ncan be neglected. For this, it is not necessary to evaluate all possible combinations. If\nm is the principal quantum number of an intermediate state which is higher than the\nprincipal quantum numbers of the ground and the excited state, then the contribution\nof the corresponding intermediate state with principal quantum number m + 1 can be\nexpected to be lower than the contribution of the state with quantum number m due\nto the larger frequency separation and due to a lower transition dipole moment.\n3. Decay dynamics of the effective two-level system\n3.1. General considerations\nTo further understand the various contributions in the derived Hamiltonian, and to\nanalyze the modification of the decay dynamics due to the additional multiphoton\ntransition pathways we apply the three-photon Hamiltonian equation (40) in a quantum\nmechanical simulation of the effective two-level atom subject to an intense low-frequency\nfield and the vacuum modes. For this, we rearrange the free and the interaction part of\nthe three-photon Hamiltonian as follows:\nX\n(3−photon)\nωk a†k ak\nH0\n= ~ω̄b† b + ~\nk\nn\no\nX\n+ ~ ω1 + α5 b† b + α6 b b† +\n(α3 a†k ak + α4 ak a†k ) σ11\n\nk\nn\no\nX\n†\n†\n+ ~ ω2 + α9 b b + α10 b b +\n(α7 a†k ak + α8 ak a†k ) σ22 ,\n\n(45)\n\nk\n\n(3−photon)\nHvac\n=~\n\nXn\n\nα0 + α1 b + α2 b† + β1∗ b b†\n\nk\n\n(3−photon)\n\nHb\n\n(3−photon)\n\no\n+β2∗ b† b + β3∗ b† b† + β4∗ b b ak σ21 + h.c. ,\n\u0010\n\u0011\n= ~ α11 b b σ11 + α12 b b σ22 + h.c. .\n\n(46)\n(47)\n\nH0\nis the effective free Hamiltonian, including the Stark shifts of the two\n(3−photon)\ndescribes the interaction with the vacuum field, i.e. the\natomic levels. Hvac\nspontaneous decay. The contributions involving operators b and b† in this part account\nfor multiphoton transitions consisting of one interaction with the vacuum field and one\n(3−photon)\nor more interactions with the low-frequency field. Hb\ncontains terms due to the\nlow frequency field alone which drive the effective system.\n(3−photon)\nIn order to calculate the system evolution we notice that Hb\ncontains\nmultiphoton processes only such that its coupling constants αi (i ∈ {11, 12}) are\nmoderate even for an intense low-frequency field. Thus in the regime where the previous\napproximations such as the adiabatic elimination are valid, the evolution which gives\n\n\fSpontaneous-emission suppression via multiphoton quantum interference\n\n15\n\nrise to the damping of the system (i.e. the coupling to the vacuum) may be evaluated\nseparately from external driving fields as it is common practice in quantum optical\ncalculations, see e.g. Chapter 8.6.1 in [20]. Thus in our case, we evaluate the system\n(3−photon)\n(3−photon)\nwith H0\n+ Hvac\nalone and then combine the resulting equations of motion\n(3−photon)\nwith the ones resulting from the driving part Hb\n. This approximation holds\n(3−photon)\n(3−photon)\n(3−photon)\nif ||Hb\n|| ≪ ||H0\n||, which means that coupling constants in Hb\nhave to be low as compared to the atomic transition frequency of the effective two-level\nsystem.\n(3−photon)\nFirst, we transfer the vacuum interaction part of the Hamiltonian Hvac\nto the\n(3−photon)\ninteraction picture with respect to the free part H0\n. To understand the Stark\n† n\nshift contribution, we transfer the partial Hamiltonian ak b σ21 as an example:\na†k bn σ21 ⇒ a†k bn σ21 e−it(ω2 −ω1 −ωk +nω̄) Sa Sb\n\nwith\n\nSa = e−it\n\nP\n\n†\nl (α7 +α8 )(al al −δkl )\n\n−it(α9 +α10 )(b† b+n)\n\nSb = e\n\neit\n\nP\n\nl (α3 +α4 )\n\na†l al\n\n,\n\nit(α5 +α6 ) b† b\n\ne\n\n(48)\n(49)\n(50)\n\nas the Stark shift contributions due to spontaneous photons Sa and due to coherent\nlow-frequency photons Sb . The two exponential functions in each of the contributions\ndescribe the Stark shift of the upper level |2i and of the lower level |1i, respectively.\nAs expected, the shifts are proportional to the number of photons in the respective\nmodes. The difference in the photon number factors for the two states (e.g. (b† b + n) as\ncompared to b† b) is due to the fact that the example Hamiltonian part induces changes\nin the photon numbers. To evaluate their importance, these contributions have to be\ncompared to the exponential factor in equation (48). There is at most one photon in the\nvacuum modes (a†l al ∈ {0, 1}), thus Sa may be safely neglected. For the low-frequency\nfield, it is reasonable to assume a coherent state with a large mean number of photons\nN, as this represents an intense laser field. As the relative photon number distribution\nwidth decreases as N −1/2 for coherent states, and as 0 ≤ n ≤ 2 in the vacuum part of\nthe three-photon Hamiltonian, we approximate b† b ≈ b† b + n ≈ N and thus have\nSa Sb ≈ e−it(α9 +α10 −α5 −α6 ) N\n\n(51)\n\nω = ω2 − ω1 + N (α9 + α10 − α5 − α6 ) .\n\n(52)\n\nas the Stark shift contribution. It is important to note that the simulated model system\ndoes not loose its quantum character in adopting these approximations, which are less\ninspired by physical than by numerical reasoning, as we keep the photon operators and\nthe distinguishable Fock states for the electromagnetical fields. The above argument\n(3−photon)\nholds for all terms in Hvac\nwith the same result, thus these shifts may be taken\ncare of by introducing an effective atomic transition frequency\nThen the vacuum interaction part becomes\nX\u0010\n(3−photon)\nα0 + α1 b e−iω̄t + α2 b† eiω̄t + β1∗ b b† + β2∗ b† b\n=~\nVvac\nk\n\n+\n\nβ3∗\n\n\u0011\nb† b† e2iω̄t + β4∗ b b e−2iω̄t ak σ21 ei(ω−ωk )t + h.c. .\n\n(53)\n\n\fSpontaneous-emission suppression via multiphoton quantum interference\n\n16\n\nThis expression is equivalent to the interaction Hamiltonian in [10], while we do not\n(j)\n(j)\nintroduce the generalized ladder operators σ+ and σ− (j ∈ Z) here which were used in\nthe semiclassical approximation in [10]. We proceed with the ansatz for the wavefunction\nX\nXX\n′\n|Ψ(t)i =\nEn (t) |2, n, 0i +\nGkn (t) |1, n, k ′i .\n(54)\nn\n\nn\n\nk′\n\nHere the first index in the kets denotes the atomic state, the second slot represents\nthe number of photons in the low-frequency field, and the last entry is either 0 for the\nvacuum without photons or k for a single photon in mode k. As described earlier, we\nfirst derive an equation of motion for the state amplitudes due to the vacuum part of\n(3−photon)\nthe Hamiltonian Vvac\n, which we denote by Envac and Gk,vac\n. In a second step, we\nn\n(3−photon)\ncalculate the equations corresponding to the driving part of the Hamiltonian Vb\nwith amplitudes Enb . These two sets of equations of motion are then summed to give\nthe equations for the full amplitudes En and Gkn . Inserting the ansatz equation (54)\n(3−photon)\nin the Schrödinger equation with Hamiltonian Vvac\nyields as vacuum part of the\nequations of motion for the state amplitudes\nXn\nd\n(3−photon)\n(α0 + β1∗ (n + 1) + β2∗ n) Gk,vac\n|Ψi = ~\ni~ Envac = h2, n, 0|Vvac\nn\ndt\nk\n√\n√\n−iω̄t\niω̄t\n+ α1 n + 1 Gk,vac\n+ α2 n Gk,vac\nn+1 e\nn−1 e\np\n−2iω̄t\n+ β4∗ (n + 1)(n + 2) Gk,vac\nn+2 e\no\np\n2iω̄t\nei(ω−ωk )t ,\n(55)\n+ β3∗ n(n − 1) Gk,vac\nn−2 e\ni~\n\nd k,vac\n(3−photon)\nGn\n= h1, n, k|Vvac\n|Ψi\ndt\nn\n√\nvac iω̄t\n= ~ (α0∗ + β1 (n + 1) + β2 n) Envac + α1∗ n En−1\ne\np\n√\nvac −iω̄t\nvac 2iω̄t\ne\n+ β4 n(n − 1) En−2\n+ α2∗ n + 1 En+1\ne\no\np\nvac −2iω̄t\n+ β3 (n + 1)(n + 2) En+2\ne−i(ω−ωk )t .\ne\n\n(56)\n\nFormally integrating (56) and inserting the result in (55) allows to obtain an equation\nof motion for the upper state amplitudes Envac of the form\nZ tX X\nn+4\nd vac\nE =−\nCl (t, t′ )Elvac (t′ ) dt′\n(57)\ndt n\n0\nk\n\nl=n−4\n\n′\n\nwhere Cl (t, t ) are time dependent coefficients depending on the coupling constants αi\nand βj . Expanding equation (57), it turns out that all addends on the right hand side\nare of the form\nZ tX\n′\n′\nvac ′\nR(ωk )λrsk S ∗ (ωk )λ∗xyk eiμω̄t eiν ω̄t ei(ω−ωk +κω̄)(t−t ) En+δ\n(t ) dt′ .\n(58)\nA=−\n0\n\nk\n\nHere, r, s, x, y, μ, ν, κ and δ are integers depending on the specific addend. R(ωk )λrsk\nand S(ωk )λxyk are one of the coefficients αi (i = 0, 1, 2) or βj (j = 1, 2, 3, 4) respectively,\nwritten as products of the dipole moment corresponding to the spontaneous transition\n\n\fSpontaneous-emission suppression via multiphoton quantum interference\n\n17\n\nλrsk and λxyk and of the remaining factors R(ωk ) and S(ωk ). In a Wigner-Weisskopf-like\ncalculation, this generic contribution may be evaluated to give\nR(ω + κω̄)S ∗ (ω + κω̄) d~rs d~xy\nvac\n(ω + κω̄)3 En+δ\n(t) ei(μ+ν)ω̄t\nA=−\n3\n6~ǫ0 c π\nq\nvac\n∗\nxy i(μ+ν)ω̄t 1\nΓrs (ω + κω̄)Γxy (ω + κω̄) En+δ\n(t) .\n(59)\n= −R(ω + κω̄)S (ω + κω̄) prs e\n2\nHere Γij (x) is the spontaneous decay rate of transition i ↔ j with transition frequency\nmodified to x, i.e.\n\u0012\n\u0013 3\n1 4|dij |2 ωij3\nx3\nx\nΓij (x) =\n=\nΓ̂\nij 3 ,\n4πǫ0 3~c3\nωij3\nωij\nwhere Γ̂ij is the spontaneous decay rate of transition i ↔ j with transition frequency\nωij , and\nd~rs d~xy\n(60)\n=\npxy\nrs\n|d~rs | * |d~xy |\nis a prefactor describing the amount of quantum interference possible between transition\nr ↔ s and transition x ↔ y. It is zero if the dipole moments are orthogonal and reaches\nits maximum value of 1 (-1) for parallel (antiparallel) dipole moments. Thus we find\nthe usual form of a square root of the product of the two corresponding spontaneous\ndecay rates as characteristic for vacuum induced interference effects [6]. The R and\nS merely are prefactors which are present because the corresponding process is a\nmultiphoton process. Assuming as for the Stark shift contributions that the photon\nnumber distribution width of the low-frequency field is negligible as compared to the\nnumber of photons N, i.e. n ≈ n + 1 ≈ n − 1 ≈ . . . ≈ N, one may introduce the\nlow-frequency field Rabi frequency in equation (57) given by\n√\n(61)\nΩij = 2 λij n + 1\nfor transition i ↔ j. This finally leads to a system of equations for the upper state\npopulations given by\nd vac\nvac\nvac\nvac\nEn (t) = −c0 En (t) − c1 eiω̄t En−1\n(t) − c2 e−iω̄t En+1\n(t) − c3 e2iω̄t En−2\n(t)\ndt\nvac\nvac\nvac\n− c4 e−2iω̄t En+2\n(t) − c5 e3iω̄t En−3\n(t) − c6 e−3iω̄t En+3\n(t)\nvac\nvac\n− c7 e4iω̄t En−4\n(t) − c8 e−4iω̄t En+4\n(t) ,\n\n(62)\n\nwhere the ci (i = 1 . . . 8) are constant coefficients, whose specific form which may be\nobtained by expanding equation (57) and (59) is omitted here as e.g. c0 contains\nof several hundred addends in its most general form. The generalized Stark shift\n(3−photon)\ncontributions in the driving part Vb\nof the Hamiltonian give rise to an equation\nof motion for the upper atomic state amplitude which is given by\nd\n(3−photon)\nb\nb\n(t)|Ψ(t)i = d3 e2iω̄t En−2\n(t) + d4 e−2iω̄t En+2\n(t)\n(63)\ni Enb (t) = h2, n, 0|Vb\ndt\nwith constant coefficients di (i = 3, 4). Thus the total equation of motion of the\nupper atomic state amplitude En is given by the sum of the right hand side of the\n\n\fSpontaneous-emission suppression via multiphoton quantum interference\n\n18\n\ntwo contributions of equations (62) and (63) upon replacement of the amplitudes Envac\nand Enb by En :\nd\nEn (t) = −c0 En (t) − c1 eiω̄t En−1 (t) − c2 e−iω̄t En+1 (t) − (c3 + id3 ) e2iω̄t En−2 (t)\ndt\n− (c4 + id4 ) e−2iω̄t En+2 (t) − c5 e3iω̄t En−3 (t) − c6 e−3iω̄t En+3 (t)\n− c7 e4iω̄t En−4 (t) − c8 e−4iω̄t En+4 (t) .\n\n(64)\n\nThese equations are a generalization of equations (3) in [10], which means that they\nhave the same structure, but different coefficients ci (i = 0, . . . , 8) and di (i = 3, 4) than\nin [10]. The difference is due to the fact that here we include Stark shifts and do not use\nthe semiclassical sum over all possible low-frequency photon numbers as in [10]. Some\neffects of these differences will be discussed in section 3.2.2. In particular, it will turn\nout later that the driving terms which may be interpreted as generalized Stark shift\nterms do not change the decay dynamics of the simulated system in a notable manner.\nTo simulate the system behavior, one has to choose an initial number of photons N\nin the low-frequency mode and a possible range of deviations ∆N from this number. The\nset of state amplitudes considered in the analysis is then chosen as {En (t)|N − ∆N ≤\nn ≤ N + ∆N }. In the equations of motion for these state amplitudes according to\nequation (64) all references to states outside the chosen set are neglected. Thus ∆N has\nto be chosen large enough such that the outermost states are barely populated during\nthe calculated evolution time to avoid numerical artefacts due to the artificially added\nborders of the simulated level space. As initial condition we choose\n|Ψ(0)i = |2, α, 0i =\n\n1 −|α|2 /2\ne\nP\n\nNX\n+W\n\nn=N −W\n\nαn\n√ |2, n, 0i .\nn!\n\n(65)\n\nThus the atom is in the excited state, the vacuum is assumed empty and the low\nfrequency field is in a coherent state |αi which simulates a strong quantized laser field.\nThe field parameter α is given by\n√\nα = N eiφ ,\n(66)\nas |α|2 is the expectation value of the photon number in a coherent state. The phase φ\naccounts for the possible complexity of α. As only upper state amplitudes En (t) with\nN − ∆N ≤ n ≤ N + ∆N are considered in the analysis, also the initial photon number\ndistribution of the coherent state has to be restricted. Thus W is a cutoff of the photon\nnumber distribution width chosen such that W < ∆N . Again, this avoids population\nlosses at the borders of the simulated Hilbert space. P is a normalization constant such\nthat hΨ(0)|Ψ(0)i = 1, which is required because of the cutoff width W . As a rough\nconsistency check, the range parameters ∆N and W must be chosen large enough for\nthe specific system parameters such that increasing these values does not affect the\nresult. After solving this set of (2∆N + 1) coupled ordinary differential equations the\ntotal upper state population may be obtained as\nΠ(t) =\n\nNX\n+∆N\n\nn=N −∆N\n\n|En (t)|2 .\n\n(67)\n\n\fSpontaneous-emission suppression via multiphoton quantum interference\n\n19\n\n|8i = 6P3/2\n|7i = 6P1/2\nPSfrag replacements\n\n|3i = 6S1/2\n\n|5i = 4D3/2\n|6i = 4D5/2\n\n|2i = 5P3/2\n|4i = 5P1/2\nΓ̂21\n|1i = 5S1/2\n\nFigure 3. Partial level scheme of rubidium taken as the simulated model system.\nThe spontaneous emission of transition |2i → |1i is to be slowed down by the discussed\nscheme. The figure is not drawn to scale.\n\nThis population may then be compared to the exponential decay for the two-state system\nwithout an additional low-frequency field.\n3.2. Rubidium as an example\n3.2.1. Model system To demonstrate the feasibility of the scheme, we use rubidium as\nour model system. The simulated atomic levels are shown in figure 3. The population\nis assumed to be in the 5P3/2 state initially. Without additional fields, this state decays\nto the 5S1/2 state with a decay rate of Γ̂21 = 37.5 * 106 s−1 [21]. As discussed in the\nprevious section, within the adiabatic approximation the intermediate states are never\npopulated, see equation (28). Thus it is possible to include states even if there are decay\nchannels leading out of the simulated level space. Also, low spontaneous decay rates\ndo not in general mean that the corresponding transitions do not need to be taken into\naccount, as the low rates may be due to the small energy spacing between two states.\nThe dipole moments however which are important for the low-frequency field may be\ncomparable to the other transition dipole moments. In the simulation, only dipoleallowed transitions are considered. This amounts to a simplification of the equation of\nthe upper state amplitudes equation (64) by e.g. eliminating c1 and c2 which rely on\ndipole-forbidden transitions, as in addition to the spontaneous photon a second photon\nis exchanged with the low-frequency field. The energies of the various states are given\nby [21]\nE1 = 0 eV ,\n\nE2 = 1.589 eV ,\n\nE5 = 2.400 eV ,\n\nE6 = 2.400 eV ,\n\nE3 = 2.496 eV ,\n\nE7 = 2.940 eV ,\n\nE4 = 1.560 eV ,\n\nE7 = 2.950 eV .\n\nThe energy separation (E5 − E6 ) is about 55 MHz; the main transition has a frequency\nof ω21 = 3.84 * 1014 Hz. We consider decay rates as obtained by theoretical calculations\nin [21], where also the required branching ratios of the various decay pathways from the\n\n\fSpontaneous-emission suppression via multiphoton quantum interference\n\n20\n\n1.0\n\nΠ(t)\n\n0.8\n0.6\n0.4\n0.2\n\nPSfrag replacements\n\n0.0\n0\n\n1\n\n2\n\n3\n\n4\n\nt[1/Γ̂21 ]\n\nFigure 4. Dependence of the total upper state population on Ω12 . The chosen values\nare Ω12 = 1; 3; 5; 8; 10; 12 [1012 Hz]. The graph order corresponds to the Rabi frequency\nwhere the highest graph corresponds to the largest driving strength. The graph for\nΩ12 = 1 * 1012 Hz is almost on top of the dashed reference curve.\n\nexcited states are given:\nΓ̂21 = 37.5 * 106 s−1 ,\n\nΓ̂41 = 35.6 * 106 s−1 ,\n\nΓ̂32 = 12.9 * 106 s−1 ,\n\nΓ̂34 = 6.6 * 106 s−1 ,\n\nΓ̂62 = 11.9 * 106 s−1 ,\n\nΓ̂71 = 2.4 * 106 s−1 ,\n\nΓ̂81 = 2.8 * 106 s−1 ,\n\nΓ̂83 = 4.5 * 106 s−1 ,\n\nΓ̂52 = 2.0 * 106 s−1 ,\n\nΓ̂73 = 4.3 * 106 s−1 ,\n\nΓ̂85 = 0.2 * 106 s−1 ,\n\nΓ̂54 = 10.7 * 106 s−1 ,\n\nΓ̂75 = 2.4 * 106 s−1 ,\n\nΓ̂86 = 1.7 * 106 s−1 .\n\nFor the transitions which are listed in [22], the above values are in reasonable agreement\nwith the data reported there. The system parameters for the figures are chosen as\nN = 106 , ∆N = 15000, W = 500, φ = 0, ω̄ = 0.1 MHz and pxy\nrs = 1 if not stated\notherwise. Here N only affects the initial population of the low-frequency Fock states.\nIt is chosen independent of the field strength of the low-frequency field in order to\nestimate the dependence of the population dynamics on the initial conditions. The value\npxy\nrs = 1 has been chosen for simplicity, but is not required to for our scheme to work.\nA calculation with a p-value of 0.5 reduces the trapping duration e.g. of the top curve\nin figure 4 by less than a factor of 3, such that the remaining effect is still considerable.\nFor this one should note that other than in most previously studied systems exhibiting\nquantum interference effects [4, 5, 6, 7], in our setup non-zero values for pxy\nrs can be\nfound in any atomic system, which is due to the fact that here the two transitions do\nnot need to have a similar transition frequency or a common atomic state. To speed\nup the numerical calculations, the driving terms in equation (63) are suppressed by the\nreplacement\ndi → ̺ di (i = 3, 4)\n\n(68)\n\n\fSpontaneous-emission suppression via multiphoton quantum interference\n\n21\n\n1.0\n\n(c)\n\nΠ(t)\n\n0.8\n\n(b)\n\n0.6\n\nPSfrag replacements\n\n0.4\n\n(a)\n0.2\n\n(d)\n\n0.0\n0\n\n1\n\n2\n\n3\n\n4\n\nt[1/Γ̂21 ]\n\nFigure 5. Dependence of the population trapping on the low-frequency field frequency\nω̄. Chosen values are ω̄ = 102 ; 104 ; 106 ; 107 ; 108 ; 109 Hz. (a) ω̄ = 102 ; 104 Hz; (b)\nω̄ = 106 Hz ; (c) ω̄ = 107 Hz and (d) ω̄ = 108 ; 109 Hz. The two curves in (d) can be\ndistinguished as the one corresponding to the lower frequency ω̄ slightly wiggles. The\ndashed curve is the reference.\n\nin equation (64), where we choose ̺ = 1/1000 in the following calculations. For this one\nshould note that for the above parameters the simulation consists of 2∆N + 1 = 30001\ncoupled complex differential equations. The validity of this suppression is discussed in\nsection 3.2.2. In the following figures 4-7, dashed lines are reference curves given by\nexp(−Γ̂21 t).\n3.2.2. Results The first figure 4 shows the total upper state population Π(t) for\ndifferent values of Ω12 . The chosen values for this Rabi frequency are Ω12 =\n1; 3; 5; 8; 10; 12 [1012 Hz]. As expected an increasing Rabi frequency of the low-frequency\nfield increases the amount of trapping. The reason for this is that the relative probability\nof low-frequency-field-assisted transitions increases with an increasing field strength.\nHowever the Rabi frequency must not be chosen too high as otherwise the adiabatic\napproximation is not valid any longer. Also higher-order processes with more than\nthree exchanged photons have to be considered if the Rabi-frequency is chosen too\nlarge. The Rabi frequency Ω12 = 1013 Hz chosen in most of the figures is about 1/40\nof the atomic transition frequency ω21 , which is well within the validity range of the\napplied approximations.\nFigure 5 shows the role of the low-frequency field frequency ω̄. The chosen values\nare ω̄ = 102 ; 104 ; 106 ; 107; 108 ; 109 Hz, while the other parameters are chosen as in figure 4\nwith Ω12 = 1013 Hz. As long as ω̄ is low as compared to the natural decay width Γ̂12 ,\nthe result is independent of ω̄ and the population plots are on top of each other. For\nhigher frequencies, the population trapping decreases until the oscillation due to ω̄ is\nvisible for ω̄ ' Γ̂12 . The behavior of the system in the limit of small frequencies ω̄ is\nsomewhat different from the behavior found in [10]. There the trapping was found to\nimprove with decreasing ω̄ until in the limit ω̄ → 0 the decay was completely stopped.\nAs already discussed in [10], this is the expected behavior for the system simulated in\n[10] which is equivalent to a system with near-degenerate upper states [23]. But while in\n\n\fSpontaneous-emission suppression via multiphoton quantum interference\n\n22\n\n1.0\n0.8\n\nΠ(t)\n\n(c)\n0.6\n\nPSfrag replacements\n\n(a)\n\n0.4\n\n(d)\n0.2\n\n(b)\n\n0.0\n0\n\n1\n\n2\n\n3\n\n4\n\nt[1/Γ̂21 ]\n\nFigure 6. Dependence of the population trapping on the phase of the initial lowfrequency field coherent state. The chosen values are φ = −0.25; 0; 0.25; 0.5; 0.75; 1[π].\nPlots are (a) for φ = 0.5π and the dashed reference, (b) for φ = −0.25π; 0.75π, (c) for\nφ = 0.25π, and (d) for φ = 0; π.\n\nour model in [10] all other parameters were kept constant in changing ω̄, in the present\nanalysis other parameters such as the various coupling strengths also change with ω̄,\nthus leading to a different behavior. Still the slowing down of the spontaneous emission\nis most pronounced for low values of ω̄. However this is a key ingredient of all similar\nquantum interference effects [23] which may be depicted as follows: The smaller the field\nfrequency is, the harder is it to distinguish between the various interference pathways,\nwhich leads to stronger quantum interference effects. As the scheme relies on the fact\nthat photons with nonzero frequency may be exchanged during atomic transitions, the\nsingular case of zero frequency, i.e. a static field, is excluded from our analysis as in\n[10].\nIn figure 6, the phase φ of the initial low-frequency field coherent state in\nequation (65) is varied. The chosen values are φ = −0.25; 0; 0.25; 0.5; 0.75; 1[π]; the\nother parameters are chosen as in figure 4 with Ω12 = 1013 Hz. The phase of the\ninitial coherent state crucially influences the decay dynamics of the effective two-level\nsystem. By choosing the phase, the effective spontaneous decay varies between the usual\ndecay rate Γ̂21 and the maximum trapping for φ = 0; π. This may be understood from\nequation (64) which shows that the decay dynamics of the state amplitude En depends\non the neighboring amplitudes En±m (m = 1, . . . , 4) which change relative to En with\nvarying phase φ.\nFigure 7 (a) shows that the initial photon distribution width of the coherent lowfrequency laser field does not influence the result of the numerical calculation notably.\nThis is a consistency check of the approximate coherent state in the ansatz for the\nwavefunction equation (65). The chosen values are W = 100, 300, 500, 1000, 2000, 3000;\nthe other parameters are chosen as in figure 4 with Ω12 = 1013 Hz.\nFigure 7 (b) shows that the number of photons of the coherent low-frequency laser\nfield does not visibly influence the result of the numerical simulation. To evaluate the\ninfluence of the initial conditions, this value was chosen independent from the intensity of\n\n\fΠ(t)\n\nSpontaneous-emission suppression via multiphoton quantum interference\n\nΠ(t)\n\nPSfrag replacements\n\n1.0\n0.8\n0.6\n0.4\n0.2\n0.0\n1.0\n0.8\n0.6\n0.4\n0.2\n0.0 0\n\n1\n\n2\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n3\n\nt[1/Γ̂21 ]\n\n40\n\n1\n\n2\n\n3\n\n23\n\n4\n\nt[1/Γ̂21 ]\n\nFigure 7. Consistency checks of the simulation. (a) Dependence of the population\ntrapping on the initial laser distribution width W . The chosen values are W =\n100, 300, 500, 1000, 2000, 3000. (b) Dependence of the population trapping on the\nnumber of photons in the low-frequency mode considered in the simulation. The\nchosen values are N = 104 , 105 , 106 , 107 , 108 , 109 . (c) Dependence of the population\ntrapping on the driving strength considered in the simulation. The chosen values\nare ̺ = 10−5 ; 10−4 ; 10−3 ; 10−2 ; 10−1 ; 1. (d) Dependence of the population trapping\non the number of simulated photon number states. The chosen values are ∆N =\n3000, 5000, 8000, 10000, 12000, 15000. In all subfigures, all plots but the dashed\nreference are on top of each other.\n\nthe low-frequency field. The chosen values are N = 104 , 105 , 106, 107 , 108 , 109; the other\nparameters are chosen as in figure 4 with Ω12 = 1013 Hz. Increasing N broadens the\ninitial photon number distribution. However if N is large enough, neighboring photon\nnumber states have similar amplitudes up to a possible phase. This does not change\nnotably for increasing N, and as the equation of motion for state amplitude En depends\non the neighboring amplitudes En±m (m = 1, . . . , 4) as discussed before, the results are\nindependent of N if it is not too small.\nFigure 7 (c) shows the dependence of the population trapping on the damping\nfactor ̺ of the driving terms which was introduced in equation (68) to speed up the\nnumerical calculations. The chosen values are ̺ = 10−5 ; 10−4 ; 10−3; 10−2 ; 10−1 ; 1; the\nother parameters are chosen as in figure 4 with Ω12 = 1013 Hz. The Figure does not\nshow a dependence on the damping of the driving strength. This may be explained\nalong the lines of the interpretation of figures 7 (a) and (b), as these driving terms\nmerely account for a broadening of the photon number distribution of the low-frequency\nfield. The trapping mechanism however does not rely on a specific distribution width.\nAlso, the driving terms are due to the same interactions as the ones which lead to\nthe Stark shift discussed before. The last consistency check is shown in figure 7 (d),\nwhere the number of simulated photon number states ∆N is varied. The chosen values\nare ∆N = 3000, 5000, 8000, 10000, 12000, 15000; the other parameters are chosen as in\nfigure 4 with Ω12 = 1013 Hz. Again, there is no visible dependence on ∆N for the chosen\nvalues which shows that ∆N = 15000 is large enough to eliminate errors due to border\nlosses.\n\n\fSpontaneous-emission suppression via multiphoton quantum interference\n\n24\n\n4. Summary\nIn summing up, we have derived an explicit expression for the multiphoton Hamiltonian\ndescribing the interaction of an atomic two-level system with both the vacuum field and\nan additional intense low-frequency laser field including up to three-photon processes.\nThis Hamiltonian was used in a quantum mechanical simulation of the decay dynamics\nof a two level atom subject to the intense low-frequency laser field and the vacuum field\nmodes. Using this simulation it was shown that the usual spontaneous decay found on\none of the transitions in rubidium may be decelerated considerably by a suitably chosen\nlow-frequency field.\nAcknowledgments\nSupport by the German National Academic Foundation for JE and funding by\nDeutsche Forschungsgemeinschaft (SFB 276) is gratefully acknowledged. We thank\nU.D. Jentschura for helpful discussions related to the parameters of the chosen model\nsystem.\nAppendix A. First order transition operators\nIn this appendix explicit expressions for the first-order transition operators calculated\nin section 2.1.3 are given. These transition operators may be written as\nX\n(1)\n(0)\n21\n12\nσ1j = σ1j + A22\nA11\n1j + A1j +\n1j (n) + A1j (n) ,\nn∈{1,2}\n/\n\n(1)\n\n(0)\n\n12\nσ2j = σ2j + A11\n2j + A2j +\n\nX\n\n21\nA22\n2j (n) + A2j (n) .\n\nn∈{1,2}\n/\n(1)\n\n(1)\n\nThe corresponding operators σj1 and σj2 may be obtained by conjugation.\noperators Akl\nij (i = 1, 2) are proportional to σkl . They are given by\nA11\n1j (n) = A(1, n) ,\n\nThe\n(A.1)\n\nwhere\nA(α, n) =\n\nλnαk λ∗jnk ak a†k σαα\nλjnk λ∗nαk a†k ak σαα\n+\n(ωα − ωj )(ωα − ωn − ωk ) (ωα − ωj )(ωα − ωn + ωk )\nλ∗jn λ∗nα b† b† σαα\nλjn λ∗nα b† b σαα\n+\n+\n(ωα − ωj )(ωα − ωn − ω̄) (ωα − ωj − 2ω̄)(ωα − ωn − ω̄)\n\nλ∗jnk λ∗nα b† a†k σαα\nλ∗jn λ∗nαk a†k b† σαα\n+\n+\n(ωα − ωn − ωk )(ωα − ωj − ωk − ω̄) (ωα − ωn − ω̄)(ωα − ωj − ωk − ω̄)\nλnαk λ∗jn ak b† σαα\nλjnk λ∗nα b† ak σαα\n+\n+\n(ωα − ωn + ωk )(ωα − ωj + ωk − ω̄) (ωα − ωn − ω̄)(ωα − ωj + ωk − ω̄)\nλnα λ∗jn b b† σαα\nλjn λ∗nαk a†k b σαα\n+\n+\n(ωα − ωj )(ωα − ωn + ω̄) (ωα − ωn − ωk )(ωα − ωj − ωk + ω̄)\n\n\f25\n\nSpontaneous-emission suppression via multiphoton quantum interference\n\nλnα λ∗jnk b a†k σαα\nλjn λnαk ak b σαα\n+\n+\n(ωα − ωn + ω̄)(ωα − ωj − ωk + ω̄) (ωα − ωn + ωk )(ωα − ωj + ωk + ω̄)\nλjn λnα b b σαα\nλjnk λnα b ak σαα\n+\n, (A.2)\n+\n(ωα − ωn + ω̄)(ωα − ωj + ωk + ω̄) (ωα − ωn + ω̄)(ωα − ωj + 2ω̄)\nA22\n1j = B(1, 2) ,\n\n(A.3)\n\nwhere\n\nλβαk λ∗jβk ak a†k σββ\nλjβk λ∗βαk a†k ak σββ\nB(α, β) = −\n−\n(ωα − ωj )(ωβ − ωj − ωk ) (ωα − ωj )(ωβ − ωj + ωk )\nλ∗βα λ∗jβ b† b† σββ\nλβα λ∗jβ b b† σββ\n−\n−\n(ωα − ωj )(ωβ − ωj − ω̄) (ωα − ωj − 2ω̄)(ωβ − ωj − ω̄)\n\nλ∗βα λ∗jβk b† a†k σββ\nλ∗βαk λ∗jβ a†k b† σββ\n−\n−\n(ωβ − ωj − ωk )(ωα − ωj − ωk − ω̄) (ωβ − ωj − ω̄)(ωα − ωj − ωk − ω̄)\nλβαk λ∗jβ ak b† σββ\nλjβk λ∗βα b† ak σββ\n−\n−\n(ωβ − ωj + ωk )(ωα − ωj + ωk − ω̄) (ωβ − ωj − ω̄)(ωα − ωj + ωk − ω̄)\n−\n\nλjβ λ∗βα b† b σββ\nλβα λ∗jβk b a†k σββ\n−\n(ωα − ωj )(ωβ − ωj + ω̄) (ωβ − ωj − ωk )(ωα − ωj − ωk + ω̄)\n\nλjβ λ∗βαk a†k b σββ\nλβα λjβk b ak σββ\n−\n(ωβ − ωj + ω̄)(ωα − ωj − ωk + ω̄) (ωβ − ωj + ωk )(ωα − ωj + ωk + ω̄)\nλβα λjβ b b σββ\nλβαk λjβ ak b σββ\n−\n, (A.4)\n−\n(ωβ − ωj + ω̄)(ωα − ωj + ωk + ω̄) (ωβ − ωj + ω̄)(ωα − ωj + 2ω̄)\n\n−\n\nA12\n1j (n)\n\nλ∗jnk λ∗n2 b† a†k σ12\nλjnk λ∗n2 b† ak σ12\n=\n+\n(ω1 − ωj )(ω1 − ωn + ωk ) (ω1 − ωn + ωk )(ω1 − ωj + 2ωk )\n\nλ∗jn λ∗n2k a†k b† σ12\nλ∗jn λ∗n2 b† b† σ12\n+\n+\n(ω1 − ωn + ωk )(ω1 − ωj + ωk − ω̄) (ω1 − ωj )(ω1 − ωn + ω̄)\n\nλjn λ∗n2 b† b σ12\nλjnk λ∗n2k a†k ak σ12\n+\n+\n(ω1 − ωn + ωk )(ω1 − ωj + ωk + ω̄) (ω1 − ωn + ω̄)(ω1 − ωj + ωk + ω̄)\n\nλn2k λ∗jnk ak a†k σ12\nλn2k λ∗jn ak b† σ12\n+\n+\n(ω1 − ωj + 2ωk )(ω1 − ωn + 2ωk + ω̄) (ω1 − ωj + ωk + ω̄)(ω1 − ωn + 2ωk + ω̄)\nλn2 λ∗jn b b† σ12\nλjn λ∗n2k a†k b σ12\n+\n+\n(ω1 − ωn + ω̄)(ω1 − ωj + 2ω̄) (ω1 − ωj + ωk + ω̄)(ω1 − ωn + ωk + 2ω̄)\n\nλn2 λ∗jnk b a†k σ12\nλjn λn2k ak b σ12\n+\n(ω1 − ωj + 2ω̄)(ω1 − ωn + ωk + 2ω̄) (ω1 − ωn + 2ωk + ω̄)(ω1 − ωj + 2ωk + 2ω̄)\nλjnk λn2 b ak σ12\n+\n(ω1 − ωn + ωk + 2ω̄)(ω1 − ωj + 2ωk + 2ω̄)\nλjn λn2 b b σ12\n+\n,\n(A.5)\n(ω1 − ωn + ωk + 2ω̄)(ω1 − ωj + ωk + 3ω̄)\n+\n\nA21\n1j = −\n\nλ21k λj1 ak b σ21\nλj1λ∗21k a†k b σ21\n−\n(ω1 − ωj )(ω2 − ωj − ωk ) (ω1 − ωj − 2ωk )(ω2 − ωj − ωk )\n\n\f26\n\nSpontaneous-emission suppression via multiphoton quantum interference\n−\n−\n\nλ21k λ∗j1 ak b† σ21\nλ∗21 λ∗j1 b† b† σ21\n−\n(ω1 − ωj − ωk − 3ω̄)(ω2 − ωj − ωk − 2ω̄) (ω1 − ωj − 2ω̄)(ω2 − ωj − ωk − 2ω̄)\nλ∗21k λ∗j1 a†k b† σ21\nλ21 λj1k b ak σ21\n−\n(ω1 − ωj − 2ωk − 2ω̄)(ω2 − ωj − ωk − 2ω̄) (ω1 − ωj )(ω2 − ωj − ω̄)\n\nλ21 λ∗j1k b a†k σ21\nλj1k λ∗21 b† ak σ21\n−\n−\n(ω1 − ωj − 2ω̄)(ω2 − ωj − ω̄) (ω1 − ωj − 2ωk )(ω2 − ωj − 2ωk − ω̄)\n\nλ∗21 λ∗j1k b† a†k σ21\nλj1 λ∗21 b† b σ21\n−\n(ω1 − ωj − 2ωk − 2ω̄)(ω2 − ωj − 2ωk − ω̄) (ω2 − ωj − ωk )(ω1 − ωj − ωk − ω̄)\nλ21 λ∗j1 b b† σ21\nλj1k λ∗21k a†k ak σ21\n−\n−\n(ω2 − ωj − ωk − 2ω̄)(ω1 − ωj − ωk − ω̄) (ω2 − ωj − ω̄)(ω1 − ωj − ωk − ω̄)\n\n−\n\nλ21k λ∗j1k ak a†k σ21\n−\n(ω2 − ωj − 2ωk − ω̄)(ω1 − ωj − ωk − ω̄)\nλ21 λj1 b b σ21\n−\n,\n(ω2 − ωj − ωk )(ω1 − ωj − ωk + ω̄)\n\n(A.6)\n\nA11\n2j = B(2, 1) ,\n\n(A.7)\n\nA22\n2j (n) = A(2, n) ,\n\n(A.8)\n\nA12\n2j\n\nλ12k λ∗j2 ak b† σ12\nλ∗12k λ∗j2 a†k b† σ12\n−\n=−\n(ω2 − ωj )(ω1 − ωj + ωk ) (ω1 − ωj + ωk )(ω2 − ωj + 2ωk )\n\nλ∗12 λ∗j2k b† a†k σ12\nλ∗12 λ∗j2 b† b† σ12\n−\n−\n(ω1 − ωj + ωk )(ω2 − ωj + ωk − ω̄) (ω2 − ωj )(ω1 − ωj + ω̄)\n\nλ12k λ∗j2k ak a†k σ12\nλ12 λ∗j2 b b† σ12\n−\n−\n(ω1 − ωj + ωk )(ω2 − ωj + ωk + ω̄) (ω1 − ωj + ω̄)(ω2 − ωj + ωk + ω̄)\n\nλj2k λ∗12 b† ak σ12\nλj2k λ∗12k a†k ak σ12\n−\n−\n(ω2 − ωj + 2ωk )(ω1 − ωj + 2ωk + ω̄) (ω2 − ωj + ωk + ω̄)(ω1 − ωj + 2ωk + ω̄)\n\nλ12 λ∗j2k b a†k σ12\nλj2 λ∗12 b† b σ12\n−\n−\n(ω1 − ωj + ω̄)(ω2 − ωj + 2ω̄) (ω2 − ωj + ωk + ω̄)(ω1 − ωj + ωk + 2ω̄)\n\nλj2 λ∗12k a†k b σ12\nλ12 λj2k b ak σ12\n−\n(ω2 − ωj + 2ω̄)(ω1 − ωj + ωk + 2ω̄) (ω1 − ωj + 2ωk + ω̄)(ω2 − ωj + 2ωk + 2ω̄)\nλ12k λj2 ak b σ12\n−\n(ω1 − ωj + ωk + 2ω̄)(ω2 − ωj + 2ωk + 2ω̄)\nλ12 λj2 b b σ12\n−\n,\n(A.9)\n(ω1 − ωj + ωk + 2ω̄)(ω2 − ωj + ωk + 3ω̄)\n−\n\nA21\n2j (n)\n\nλn1 λ∗jnk b a†k σ21\nλjnk λn1 b ak σ21\n+\n=\n(ω2 − ωj )(ω2 − ωn − ωk ) (ω2 − ωj − 2ωk )(ω2 − ωn − ωk )\nλ∗jn λ∗n1 b† b† σ21\nλjnk λ∗n1 b† ak σ21\n+\n+\n(ω2 − ωj − ωk − 3ω̄)(ω2 − ωn − ωk − 2ω̄) (ω2 − ωj − 2ω̄)(ω2 − ωn − ωk − 2ω̄)\n\n\fSpontaneous-emission suppression via multiphoton quantum interference\n\n27\n\nλ∗jnk λ∗n1 b† a†k σ21\nλjn λn1k ak b σ21\n+\n+\n(ω2 − ωj − 2ωk − 2ω̄)(ω2 − ωn − ωk − 2ω̄) (ω2 − ωj )(ω2 − ωn − ω̄)\nλn1k λ∗jn ak b† σ21\nλjn λ∗n1k a†k b σ21\n+\n+\n(ω2 − ωj − 2ω̄)(ω2 − ωn − ω̄) (ω2 − ωj − 2ωk )(ω2 − ωn − 2ωk − ω̄)\n+\n+\n\nλ∗jn λ∗n1k a†k b† σ21\nλn1 λ∗jn b b† σ21\n+\n(ω2 − ωj − 2ωk − 2ω̄)(ω2 − ωn − 2ωk − ω̄) (ω2 − ωn − ωk )(ω2 − ωj − ωk − ω̄)\nλn1k λ∗jnk ak a†k σ21\nλjn λ∗n1 b† b σ21\n+\n(ω2 − ωn − ωk − 2ω̄)(ω2 − ωj − ωk − ω̄) (ω2 − ωn − ω̄)(ω2 − ωj − ωk − ω̄)\n\nλjnk λ∗n1k a†k ak σ21\n(ω2 − ωn − 2ωk − ω̄)(ω2 − ωj − ωk − ω̄)\nλjn λn1 b b σ21\n+\n.\n(ω2 − ωn − ωk )(ω2 − ωj − ωk + ω̄)\n\n+\n\n(A.10)\n\n[1] Scully M O and Zubairy M S 1997 Quantum Optics, Cambridge University Press\n[2] Agarwal G S, Scully M O and Walther H 2001 Phys. Rev. Lett. 86 4271\nKofman A G and Kurizki G 2001 Phys. Rev. Lett. 87 270405\n[3] Purcell E M 1946 Phys. Rev. 69 681\nHaroche S and Kleppner D 1989 Phys. Tod. 42 24\n[4] Zhu S Y and Scully M O 1996 Phys. Rev. Lett. 76 388\nZhu S Y, Narducci L M and Scully M O 1995 Phys. Rev. A 52 4791\nHuang H, Zhu S Y and Zubairy M S 1997 Phys. Rev. A 55 744\nScully M O and Zhu S Y 1998 Science 281 1973\nFrishman E and Shapiro M 2001 Phys. Rev. Lett. 87 253001\n[5] Knight P L 1979 J. Phys. B: At. Mol. Phys. 12 3297\nKnight P L and Milonni P 1980 Phys. Rep. 66 21\nColeman P E, Knight P L and Burnett K 1982 Opt. Comm. 42 171\nNarducci L M, Scully M O, Oppo G L, Ru P and Tredicce J R 1990 Phys. Rev. A 42 1630\nManka A S, Doss H M, Narducci L M, Ru P, Oppo G L 1991 Phys. Rev. A 43 3748\nGauthier D J, Zhu Y and Mossberg T W 1991 Phys. Rev. Lett. 66 2460\nZhou P and Swain S 1996 Phys. Rev. Lett. 77 3995\nPaspalakis E and Knight P L 1998 Phys. Rev. Lett. 81 293\nKeitel C H 1999 Phys. Rev. Lett. 83 1307\nAgarwal G S 2000 Phys. Rev. Lett. 84 5500\n[6] Cardimona D A, Raymer M G and Stroud Jr. C R 1982 J. Phys. B: At. Mol. Phys. 15 65\n[7] Ficek Z 2001 Advances in Chemical Physics, 119, Wiley, New York, part 1 and references therein\nSwain S and Ficek Z 2002 J. Mod. Opt. 49 1\nEvers J, Bullock D and Keitel C H 2002 Opt. Comm. 209 173\n[8] Feranchuk I D 1981 Phys. Lett. 83A 126\n[9] Feranchuk I D, Komarov L I and Ulyanenkov A 2002 J. Phys. B: At. Mol. Opt. Phys. 35 3957\n[10] Evers J and Keitel C H 2002 Phys. Rev. Lett. 89 163601\n[11] Berman P R 2004 Phys. Rev. Lett. 92 159301\nKofman A G 2004 Phys. Rev. Lett. 92 159302\nEvers J and Keitel C H 2004 Phys. Rev. Lett. 92 159303\n[12] Kocharovskaya O, Mandel P and Scully M O 1995 Phys. Rev. Lett. 74 2451\n[13] Borrmann G 1950 Z. Phys. 127 297\nDeCamp M F et. al. 2001 Nature 413 825\n[14] Afanas'ev A M and Kagan Yu M 1965 Zh. Exsp. Teor. Fiz. 48 327\nVoitovetskii V K, Korsunskii I L, Novikov A I and Pazhin Yu F 1970 Pis'ma Zh. Exsp. Teor.\n\n\fSpontaneous-emission suppression via multiphoton quantum interference\n[15]\n[16]\n\n[17]\n[18]\n[19]\n[20]\n[21]\n[22]\n[23]\n\n28\n\nFiz. 11 149\nCardimona D A, Kovanis V and Sharma M P 1993 Phys. Rev. A 47, 1227\nAllen L and Stroud C R 1982 Phys. Rep. 91, 1\nZhu S Y and Li X S 1987 Phys. Rev. A 36 3889\nAlsing P and Zubairy M S 1987 J. Opt. Soc. Am. B 4 177\nZhu S Y and Scully M O 1988 Phys. Rev. A 38 5433\nPuri R R and Bullough R K 1988 J. Opt. Soc. Am. B 5 2021\nLugiato L A, Galatola P and Narducci L M 1990 Opt. Commun. 76 276\nToor A H and Zubairy M S 1992 Phys. Rev. A 45 4951\nHarris S E 1994 Opt. Lett. 19 2018\nZubairy M S and Yeh J J 1980 Phys. Rev. A 21 1624\nSellin P B, Yu C C, Bochinski J R and Mossberg T W, 1997 Phys. Rev. Lett. 78 1432\nMollow B R 1969 Phys. Rev. 188 1969\nBochinsky J R, Yu C C, Loftus T, Mossberg T W 2001 Phys. Rev. A 63 051402(R)\nPuri R R 2001 Mathematical Methods of Quantum Optics, Springer series in optical sciences, Berlin\nHeavens O S 1961 J. Opt. Soc. Am. 51 1058\nNIST Atomic Spectra Database\nTheodosiou E 1984 Phys. Rev. A 30 2881\nZhu S Y, Chan R C F and Lee C P 1995 Phys. Rev. A 52 710\n\n\f"}