{"id": "http://arxiv.org/abs/quant-ph/0209133v1", "guidislink": true, "updated": "2002-09-25T07:42:43Z", "updated_parsed": [2002, 9, 25, 7, 42, 43, 2, 268, 0], "published": "2002-09-25T07:42:43Z", "published_parsed": [2002, 9, 25, 7, 42, 43, 2, 268, 0], "title": "Efficient classical simulation of measurements in optical quantum\n  information", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=quant-ph%2F0209032%2Cquant-ph%2F0209127%2Cquant-ph%2F0209033%2Cquant-ph%2F0209157%2Cquant-ph%2F0209063%2Cquant-ph%2F0209155%2Cquant-ph%2F0209085%2Cquant-ph%2F0209168%2Cquant-ph%2F0209091%2Cquant-ph%2F0209132%2Cquant-ph%2F0209053%2Cquant-ph%2F0209122%2Cquant-ph%2F0209029%2Cquant-ph%2F0209020%2Cquant-ph%2F0209015%2Cquant-ph%2F0209058%2Cquant-ph%2F0209019%2Cquant-ph%2F0209095%2Cquant-ph%2F0209003%2Cquant-ph%2F0209005%2Cquant-ph%2F0209068%2Cquant-ph%2F0209009%2Cquant-ph%2F0209023%2Cquant-ph%2F0209002%2Cquant-ph%2F0209109%2Cquant-ph%2F0209106%2Cquant-ph%2F0209158%2Cquant-ph%2F0209062%2Cquant-ph%2F0209165%2Cquant-ph%2F0209131%2Cquant-ph%2F0209117%2Cquant-ph%2F0209171%2Cquant-ph%2F0209064%2Cquant-ph%2F0209115%2Cquant-ph%2F0209087%2Cquant-ph%2F0209084%2Cquant-ph%2F0209118%2Cquant-ph%2F0209093%2Cquant-ph%2F0209120%2Cquant-ph%2F0209044%2Cquant-ph%2F0209160%2Cquant-ph%2F0209074%2Cquant-ph%2F0209145%2Cquant-ph%2F0209052%2Cquant-ph%2F0209151%2Cquant-ph%2F0209054%2Cquant-ph%2F0209050%2Cquant-ph%2F0209149%2Cquant-ph%2F0209036%2Cquant-ph%2F0209017%2Cquant-ph%2F0209102%2Cquant-ph%2F0209056%2Cquant-ph%2F0209167%2Cquant-ph%2F0209170%2Cquant-ph%2F0209048%2Cquant-ph%2F0209010%2Cquant-ph%2F0209098%2Cquant-ph%2F0209133%2Cquant-ph%2F0209088%2Cquant-ph%2F0209082%2Cquant-ph%2F0209007%2Cquant-ph%2F0209004%2Cquant-ph%2F0209099%2Cquant-ph%2F0209119%2Cquant-ph%2F0209059%2Cquant-ph%2F0209100%2Cquant-ph%2F0209043%2Cquant-ph%2F0209107%2Cquant-ph%2F0209092%2Cquant-ph%2F0209129%2Cquant-ph%2F0209161%2Cquant-ph%2F0209108%2Cquant-ph%2F0209162%2Cquant-ph%2F0209169%2Cquant-ph%2F0209090%2Cquant-ph%2F0209103%2Cquant-ph%2F0209045%2Cquant-ph%2F0209038%2Cquant-ph%2F0209163%2Cquant-ph%2F0209011%2Cquant-ph%2F0209046%2Cquant-ph%2F0209041%2Cquant-ph%2F0209086%2Cquant-ph%2F0209026%2Cquant-ph%2F0209027%2Cquant-ph%2F0209006%2Cquant-ph%2F0209057%2Cquant-ph%2F0209139%2Cquant-ph%2F0209154%2Cquant-ph%2F0209065%2Cquant-ph%2F0209083%2Cquant-ph%2F0209039%2Cquant-ph%2F0209148%2Cquant-ph%2F0209143%2Cquant-ph%2F0209144%2Cquant-ph%2F0209047%2Cquant-ph%2F0209089%2Cquant-ph%2F0209142%2Cquant-ph%2F0209067%2Cquant-ph%2F0209060%2Cquant-ph%2F0209111&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Efficient classical simulation of measurements in optical quantum\n  information"}, "summary": "We present conditions for the efficient simulation of a broad class of\noptical quantum circuits on a classical machine: this class includes unitary\ntransformations, amplification, noise, and measurements. Various proposed\nschemes for universal quantum computation using optics are assessed against\nthese conditions, and we consider the minimum resource requirements needed in\nany optical scheme to generate optical nonlinear processes and perform\nuniversal quantum computation.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=quant-ph%2F0209032%2Cquant-ph%2F0209127%2Cquant-ph%2F0209033%2Cquant-ph%2F0209157%2Cquant-ph%2F0209063%2Cquant-ph%2F0209155%2Cquant-ph%2F0209085%2Cquant-ph%2F0209168%2Cquant-ph%2F0209091%2Cquant-ph%2F0209132%2Cquant-ph%2F0209053%2Cquant-ph%2F0209122%2Cquant-ph%2F0209029%2Cquant-ph%2F0209020%2Cquant-ph%2F0209015%2Cquant-ph%2F0209058%2Cquant-ph%2F0209019%2Cquant-ph%2F0209095%2Cquant-ph%2F0209003%2Cquant-ph%2F0209005%2Cquant-ph%2F0209068%2Cquant-ph%2F0209009%2Cquant-ph%2F0209023%2Cquant-ph%2F0209002%2Cquant-ph%2F0209109%2Cquant-ph%2F0209106%2Cquant-ph%2F0209158%2Cquant-ph%2F0209062%2Cquant-ph%2F0209165%2Cquant-ph%2F0209131%2Cquant-ph%2F0209117%2Cquant-ph%2F0209171%2Cquant-ph%2F0209064%2Cquant-ph%2F0209115%2Cquant-ph%2F0209087%2Cquant-ph%2F0209084%2Cquant-ph%2F0209118%2Cquant-ph%2F0209093%2Cquant-ph%2F0209120%2Cquant-ph%2F0209044%2Cquant-ph%2F0209160%2Cquant-ph%2F0209074%2Cquant-ph%2F0209145%2Cquant-ph%2F0209052%2Cquant-ph%2F0209151%2Cquant-ph%2F0209054%2Cquant-ph%2F0209050%2Cquant-ph%2F0209149%2Cquant-ph%2F0209036%2Cquant-ph%2F0209017%2Cquant-ph%2F0209102%2Cquant-ph%2F0209056%2Cquant-ph%2F0209167%2Cquant-ph%2F0209170%2Cquant-ph%2F0209048%2Cquant-ph%2F0209010%2Cquant-ph%2F0209098%2Cquant-ph%2F0209133%2Cquant-ph%2F0209088%2Cquant-ph%2F0209082%2Cquant-ph%2F0209007%2Cquant-ph%2F0209004%2Cquant-ph%2F0209099%2Cquant-ph%2F0209119%2Cquant-ph%2F0209059%2Cquant-ph%2F0209100%2Cquant-ph%2F0209043%2Cquant-ph%2F0209107%2Cquant-ph%2F0209092%2Cquant-ph%2F0209129%2Cquant-ph%2F0209161%2Cquant-ph%2F0209108%2Cquant-ph%2F0209162%2Cquant-ph%2F0209169%2Cquant-ph%2F0209090%2Cquant-ph%2F0209103%2Cquant-ph%2F0209045%2Cquant-ph%2F0209038%2Cquant-ph%2F0209163%2Cquant-ph%2F0209011%2Cquant-ph%2F0209046%2Cquant-ph%2F0209041%2Cquant-ph%2F0209086%2Cquant-ph%2F0209026%2Cquant-ph%2F0209027%2Cquant-ph%2F0209006%2Cquant-ph%2F0209057%2Cquant-ph%2F0209139%2Cquant-ph%2F0209154%2Cquant-ph%2F0209065%2Cquant-ph%2F0209083%2Cquant-ph%2F0209039%2Cquant-ph%2F0209148%2Cquant-ph%2F0209143%2Cquant-ph%2F0209144%2Cquant-ph%2F0209047%2Cquant-ph%2F0209089%2Cquant-ph%2F0209142%2Cquant-ph%2F0209067%2Cquant-ph%2F0209060%2Cquant-ph%2F0209111&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We present conditions for the efficient simulation of a broad class of\noptical quantum circuits on a classical machine: this class includes unitary\ntransformations, amplification, noise, and measurements. Various proposed\nschemes for universal quantum computation using optics are assessed against\nthese conditions, and we consider the minimum resource requirements needed in\nany optical scheme to generate optical nonlinear processes and perform\nuniversal quantum computation."}, "authors": ["Stephen D. Bartlett", "Barry C. Sanders"], "author_detail": {"name": "Barry C. Sanders"}, "author": "Barry C. Sanders", "arxiv_comment": "4 pages, presented at QCMC'02 (MIT, Boston, USA, July 22-26, 2002)", "links": [{"href": "http://arxiv.org/abs/quant-ph/0209133v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/quant-ph/0209133v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/quant-ph/0209133v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/quant-ph/0209133v1", "journal_reference": "Quantum Communication, Measurement & Computing (QCMC'02), ed. J.\n  H. Shapiro and O. Hirota (Rinton Press, Princeton NJ, 2003), p. 430.", "doi": null, "fulltext": "arXiv:quant-ph/0209133v1 25 Sep 2002\n\nEFFICIENT CLASSICAL SIMULATION OF MEASUREMENTS\nIN OPTICAL QUANTUM INFORMATION\nSTEPHEN D. BARTLETT AND BARRY C. SANDERS\nDepartment of Physics and Centre for Advanced Computing – Algorithms and\nCryptography, Macquarie University, Sydney, NSW 2109, Australia\nE-mail: stephen.bartlett@mq.edu.au\nWe present conditions for the efficient simulation of a broad class of optical quantum circuits on a classical machine: this class includes unitary transformations,\namplification, noise, and measurements. Various proposed schemes for universal\nquantum computation using optics are assessed against these conditions, and we\nconsider the minimum resource requirements needed in any optical scheme to generate optical nonlinear processes and perform universal quantum computation.\n\nInformation processing using the rules of quantum mechanics may allow\ntasks that cannot be performed using classical laws1 . Of the many possible realizations of quantum information processes, optical realizations have\nthe advantange of negligible decoherence. Both qubit2,3,4 and continuousvariable5 schemes offer significant potential for optical quantum information\nprocessing, especially if efficient processes can be performed that are not efficient on any classical device.\nAdvanced techniques in linear optics and squeezing are known to be insufficient to perform universal quantum computation1,5,6 ; in particular, optical\nnonlinear processes (such as a Kerr nonlinearity7 ) have been identified as a\nnecessary requirement. (Schemes that employ only linear optics8 are not scalable, in that they require resources that grow exponentially in the number\nof qubits.) However, Kerr nonlinearities suffer either from weak strengths or\nhigh losses, and the lack of appropriate nonlinear materials greatly restricts\nthe type of processes that can be performed in practice.\nRecently, nonunitary processes such as measurement have been identified\nas a means to implement nonlinear operations. Proposals for optical quantum\ncomputation by Knill, Laflamme and Milburn3 (KLM) and Gottesman, Kitaev and Preskill4 (GKP) employ photon counting to induce nonlinear transformations in optical systems. Photon counting is an important example of a\nprocess that can be used to achieve nonlinear transformations via feedforward\nof measurement results. Such a nonunitary transformation appears to enable\nimpressive capabilities equivalent to nonlinear transformations.\nIt is imperative to determine what type of processes (unitary transformations, projective measurements, interaction with a reservoir, etc.) can be used\nto implement nonlinear transformations and thus perform universal quantum computation. One approach is to identify classes of processes that can\nbe efficiently simulated on a classical computer. Under the assumption that\nuniversal quantum computation is not efficiently simulatable classically, such\n1\n\n\fprocesses are also insufficient to implement optical nonlinear transformations.\nThe Gottesman-Knill (GK) theorem1 for qubits, the continuous-variable classical simulatability theorem of Bartlett et al.6 (BSBN), and the general optical\nclassical simulatability theorem of Bartlett and Sanders9 (BS) allow us to investigate the classical complexity of a quantum process using particular classes\nof initial states, unitary operations and measurements.\nHere, we consider the implications of the BS optical classical simulatability theorem on various proposals for quantum computation using optics.\nThis theorem employs the powerful formalism of Gaussian completely positive (CP) maps10 to describe efficiently simulatable operations on Gaussian\nstates.\nTheorem for efficient classical simulatability (BS): Any quantum information process that initiates in a Gaussian state and that performs only\nGaussian CP maps can be efficiently simulated using a classical computer.\nThese maps include (i) the unitary transformations corresponding to linear\noptics and squeezing, (ii) linear amplification (including phase-insensitive and\nphase-sensitive amplification and optimal cloning), linear loss mechanisms or\nadditive noise, (iii) measurements that are Gaussian CP maps including, but\nnot limited to, projective measurements in the position/momentum eigenstate\nbasis or coherent/squeezed state basis, with finite losses, and (iv) any of the\nabove Gaussian CP maps conditioned on classical numbers or the outcomes\nof prior Gaussian CP measurements (classical feedforward).\nOur theorem for efficient classical simulation provides a powerful tool in\nassessing whether a given optical process can enhance linear optics to perform\nnonlinear transformations or allow quantum processes that are exponentially\nfaster than classical ones. Algorithms or circuits employing Gaussian CP\nmaps can be efficiently simulated on a classical computer, and thus do not\nprovide any sort of quantum exponential speedup.\nWe now consider some of the key new results of this theorem in terms of\nknown processes.\nCorollary 1: Linear optics or squeezing transformations conditioned on the\nmeasurement outcome of homodyne detection with finite losses using Gaussian\nstates cannot induce a nonlinearity.\nThus, initiating with Gaussian states, it is not possible to use homodyne\nmeasurements and feedforward of measurement results to induce a (possibly\nnondeterministic) optical nonlinearity in the way that photon counting allows\nin the KLM scheme. In terms of optical implementations of quantum computing, this theorem reveals why all previous schemes either propose some form\nof optical nonlinearity2,5 , use other forms of measurement such as photon\ncounting3,4 or are not efficiently scalable8 .\nThis theorem also places severe constraints on the use of photodetection to perform nonlinear transformations in realizations of optical quantum\n2\n\n\fTable 1. Efficient classical simulatability for schemes employing various initial states, unitary gates, and measurements.\nInitial States\n\nUnitary Gates\n\nMeasurements\n\nEfficiently\nsimulatable?\n\nVacua\n\nLinear optics, squeezing\n\nGaussian CP\n(i.e., homodyne)\n\nYes6,9\n\nVacua\n\nLinear optics, squeezing,\nKerr nonlinearity\n\nHomodyne\n\nNo (Lloyd &\nBraunstein5 )\n\nSingle photons\n\nLinear optics only\n\nPhoton counting\n\nNo (KLM3 )\n\nVacua\n\nLinear optics, squeezing\n\nPhoton counting\n& homodyne\n\nNo (GKP4 )\n\nSingle photons\n\nLinear optics, squeezing\n\nHomodyne\n\n???\n\ncomputing. For a threshold photodetector3,11,12 with perfect efficiency, the\nPOVM is given by two elements, corresponding to \"absorption\" and \"noabsorption\" of light. Photon counters are effectively constructed as arrays of\nsuch detectors12 . The vacuum projection describes the non-absorption measurement, and the corresponding map describing this measurement result is\nGaussian CP. However, the absorption outcome is not.\nCorollary 2: Gaussian CP maps conditioned on the no-absorption outcome\nof a photodetection measurement are also Gaussian CP, whereas transformations conditioned on the absorption outcome are not.\nNote that the same result holds for finite-efficiency photodetectors: such\ndetectors can be modelled as unit efficiency photodetectors with a linear loss\nmechanism describable using Gaussian CP maps. Thus, the absorption outcome of photodetection and the feedforward of this measurement result is a\nkey resource for optical quantum information processing. This corollary also\nproves that any nonlinear gate employing linear optics and photon counting\nmust be nondeterministic; a photon counting measurement of a Gaussian state\ncould possibly result in an outcome of zero photons, and such a result corresponds to an efficiently classically simulatable process. (Note that nonlinear\noptics, in contrast, can be deterministic.)\nOur classical simulatability theorem may be useful in assessing the \"minimum\" requirements for universal quantum computation with optics. Table\n1 presents various classes of initial states, unitary gates, and measurements\n(that can be used for classical feedforward) and their classical simulatability according to our theorem. Employing only Gaussian states and Gaussian\nCP maps results in an efficiently simulatable circuit; one can now consider\nsupplementing this set with various \"resources\" that may allow for universal\nquantum computation. As shown by Lloyd and Braunstein5 , the addition\nof a Kerr nonlinearity or any higher-order transformation on a single mode\n3\n\n\fresults in universal quantum computation. The schemes of KLM and GKP\nreveal that photon counting is also a resource that allows for universal quantum computation. The KLM scheme also requires single photon Fock states\n\"on demand\" as ancilla inputs to their nondeterministic nonlinear gates; such\nstates lie outside the domain of our theorem (they are not Gaussian) and may\nserve as a resource for performing nonlinear operations.\nIt is interesting to consider, then, if single photons on demand are by\nthemselves sufficient to bestow Gaussian CP maps with the power to perform\nnonlinear operations and thus universal quantum computation. Considering\nthe recent progress in creating single photon turnstile devices13 (with low\nprobablility of producing zero or two photons by accident), a scheme that\nrequires single photons but otherwise employs only linear optics, squeezing,\nand high-efficiency homodyne detection would obviate the need for ultra-high\nefficiency photon counters14 .\nAcknowledgments\nSDB acknowledges helpful discussions with M. A. Nielsen. This project has\nbeen supported by an ARC Large Grant and a Macquarie University New\nStaff Grant.\nReferences\n1. M. A. Nielsen and I. L. Chuang, Quantum Computation and Quantum\nInformation (Cambridge University Press, Cambridge, 2000).\n2. I. L. Chuang and Y. Yamamoto, Phys. Rev. A 52, 3489 (1995).\n3. E. Knill et al, Nature (London) 409, 46 (2001).\n4. D. Gottesman et al, Phys. Rev. A 64, 012310 (2001).\n5. S. Lloyd and S. L. Braunstein, Phys. Rev. Lett. 82, 1784 (1999).\n6. S. D. Bartlett et al, Phys. Rev. Lett. 88, 097904 (2002).\n7. D. F. Walls and G. J. Milburn, Quantum Optics (Springer, Berlin, 1994).\n8. N. J. Cerf et al, Phys. Rev. A 57, 1477 (1998).\n9. S. D. Bartlett and B. C. Sanders, Phys. Rev. Lett., in press, (2002);\neprint quant-ph/0204065.\n10. G. Lindblad, J. Phys. A: Math. Gen. 33, 5059 (2000).\n11. P. Kok and S. L. Braunstein, Phys. Rev. A 63, 033812 (2001).\n12. S. D. Bartlett and B. C. Sanders, Phys. Rev. A 65, 042302 (2002).\n13. C. Santori et al, Phys. Rev. Lett. 86, 1502 (2001).\n14. S. D. Bartlett et al, in Proceedings of Free-Space Laser Communication\nand Laser Imaging II, Vol. 4821, ed. J. C. Ricklin and D. G. Voelz (SPIE,\nBellingham, WA, 2002); eprint quant-ph/0204073.\n\n4\n\n\f"}