{"id": "http://arxiv.org/abs/quant-ph/0012007v1", "guidislink": true, "updated": "2000-12-01T15:46:33Z", "updated_parsed": [2000, 12, 1, 15, 46, 33, 4, 336, 0], "published": "2000-12-01T15:46:33Z", "published_parsed": [2000, 12, 1, 15, 46, 33, 4, 336, 0], "title": "Levels of Reality as Source of Quantum Indeterminacy", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=quant-ph%2F0012006%2Cquant-ph%2F0012060%2Cquant-ph%2F0012074%2Cquant-ph%2F0012013%2Cquant-ph%2F0012086%2Cquant-ph%2F0012027%2Cquant-ph%2F0012020%2Cquant-ph%2F0012104%2Cquant-ph%2F0012133%2Cquant-ph%2F0012038%2Cquant-ph%2F0012134%2Cquant-ph%2F0012071%2Cquant-ph%2F0012059%2Cquant-ph%2F0012012%2Cquant-ph%2F0012097%2Cquant-ph%2F0012148%2Cquant-ph%2F0012062%2Cquant-ph%2F0012070%2Cquant-ph%2F0012151%2Cquant-ph%2F0012102%2Cquant-ph%2F0012115%2Cquant-ph%2F0012138%2Cquant-ph%2F0012109%2Cquant-ph%2F0012128%2Cquant-ph%2F0012141%2Cquant-ph%2F0012137%2Cquant-ph%2F0012120%2Cquant-ph%2F0012147%2Cquant-ph%2F0012035%2Cquant-ph%2F0012007%2Cquant-ph%2F0012132%2Cquant-ph%2F0012072%2Cquant-ph%2F0012045%2Cquant-ph%2F0012099%2Cquant-ph%2F0012103%2Cquant-ph%2F0012055%2Cquant-ph%2F0012004%2Cquant-ph%2F0012100%2Cquant-ph%2F0012093%2Cquant-ph%2F0012037%2Cquant-ph%2F0012065%2Cquant-ph%2F0012014%2Cquant-ph%2F0012017%2Cquant-ph%2F0012094%2Cquant-ph%2F0012057%2Cquant-ph%2F0012052%2Cquant-ph%2F0012025%2Cquant-ph%2F0012106%2Cquant-ph%2F0012058%2Cquant-ph%2F0012089%2Cquant-ph%2F0012021%2Cquant-ph%2F0012126%2Cquant-ph%2F0012066%2Cquant-ph%2F0012079%2Cquant-ph%2F0012124%2Cquant-ph%2F0012092%2Cquant-ph%2F0012069%2Cquant-ph%2F0012082%2Cquant-ph%2F0012087%2Cquant-ph%2F0012139%2Cquant-ph%2F0012009%2Cquant-ph%2F0012140%2Cquant-ph%2F0012024%2Cquant-ph%2F0012110%2Cquant-ph%2F0012041%2Cquant-ph%2F0012081%2Cquant-ph%2F0012019%2Cquant-ph%2F0012053%2Cquant-ph%2F0012054%2Cquant-ph%2F0012001%2Cquant-ph%2F0012117%2Cquant-ph%2F0012015%2Cquant-ph%2F0012050%2Cquant-ph%2F0012076%2Cquant-ph%2F0012131%2Cquant-ph%2F0012091%2Cquant-ph%2F0012077%2Cquant-ph%2F0012056%2Cquant-ph%2F0012067%2Cquant-ph%2F0012049%2Cquant-ph%2F0012101%2Cquant-ph%2F0012040%2Cquant-ph%2F0012032%2Cquant-ph%2F0012047%2Cquant-ph%2F0012044%2Cquant-ph%2F0012096%2Cquant-ph%2F0012107%2Cquant-ph%2F0012061%2Cquant-ph%2F0012084%2Cquant-ph%2F0012090%2Cquant-ph%2F0012125%2Cquant-ph%2F0012063%2Cquant-ph%2F0012150%2Cquant-ph%2F0012119%2Cquant-ph%2F0012034%2Cquant-ph%2F0012129%2Cquant-ph%2F0012144%2Cquant-ph%2F0012029%2Cquant-ph%2F0012085%2Cquant-ph%2F0012002%2Cquant-ph%2F0012083&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Levels of Reality as Source of Quantum Indeterminacy"}, "summary": "We show that the notion of \"levels of Reality\" introduced by Werner\nHeisenberg in his \"Manuscript of 1942\" (1984) and by myself (1983-1985) could\nexplain the quantum indeterminacy. General epistemological implications of this\nnotion are also studied.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=quant-ph%2F0012006%2Cquant-ph%2F0012060%2Cquant-ph%2F0012074%2Cquant-ph%2F0012013%2Cquant-ph%2F0012086%2Cquant-ph%2F0012027%2Cquant-ph%2F0012020%2Cquant-ph%2F0012104%2Cquant-ph%2F0012133%2Cquant-ph%2F0012038%2Cquant-ph%2F0012134%2Cquant-ph%2F0012071%2Cquant-ph%2F0012059%2Cquant-ph%2F0012012%2Cquant-ph%2F0012097%2Cquant-ph%2F0012148%2Cquant-ph%2F0012062%2Cquant-ph%2F0012070%2Cquant-ph%2F0012151%2Cquant-ph%2F0012102%2Cquant-ph%2F0012115%2Cquant-ph%2F0012138%2Cquant-ph%2F0012109%2Cquant-ph%2F0012128%2Cquant-ph%2F0012141%2Cquant-ph%2F0012137%2Cquant-ph%2F0012120%2Cquant-ph%2F0012147%2Cquant-ph%2F0012035%2Cquant-ph%2F0012007%2Cquant-ph%2F0012132%2Cquant-ph%2F0012072%2Cquant-ph%2F0012045%2Cquant-ph%2F0012099%2Cquant-ph%2F0012103%2Cquant-ph%2F0012055%2Cquant-ph%2F0012004%2Cquant-ph%2F0012100%2Cquant-ph%2F0012093%2Cquant-ph%2F0012037%2Cquant-ph%2F0012065%2Cquant-ph%2F0012014%2Cquant-ph%2F0012017%2Cquant-ph%2F0012094%2Cquant-ph%2F0012057%2Cquant-ph%2F0012052%2Cquant-ph%2F0012025%2Cquant-ph%2F0012106%2Cquant-ph%2F0012058%2Cquant-ph%2F0012089%2Cquant-ph%2F0012021%2Cquant-ph%2F0012126%2Cquant-ph%2F0012066%2Cquant-ph%2F0012079%2Cquant-ph%2F0012124%2Cquant-ph%2F0012092%2Cquant-ph%2F0012069%2Cquant-ph%2F0012082%2Cquant-ph%2F0012087%2Cquant-ph%2F0012139%2Cquant-ph%2F0012009%2Cquant-ph%2F0012140%2Cquant-ph%2F0012024%2Cquant-ph%2F0012110%2Cquant-ph%2F0012041%2Cquant-ph%2F0012081%2Cquant-ph%2F0012019%2Cquant-ph%2F0012053%2Cquant-ph%2F0012054%2Cquant-ph%2F0012001%2Cquant-ph%2F0012117%2Cquant-ph%2F0012015%2Cquant-ph%2F0012050%2Cquant-ph%2F0012076%2Cquant-ph%2F0012131%2Cquant-ph%2F0012091%2Cquant-ph%2F0012077%2Cquant-ph%2F0012056%2Cquant-ph%2F0012067%2Cquant-ph%2F0012049%2Cquant-ph%2F0012101%2Cquant-ph%2F0012040%2Cquant-ph%2F0012032%2Cquant-ph%2F0012047%2Cquant-ph%2F0012044%2Cquant-ph%2F0012096%2Cquant-ph%2F0012107%2Cquant-ph%2F0012061%2Cquant-ph%2F0012084%2Cquant-ph%2F0012090%2Cquant-ph%2F0012125%2Cquant-ph%2F0012063%2Cquant-ph%2F0012150%2Cquant-ph%2F0012119%2Cquant-ph%2F0012034%2Cquant-ph%2F0012129%2Cquant-ph%2F0012144%2Cquant-ph%2F0012029%2Cquant-ph%2F0012085%2Cquant-ph%2F0012002%2Cquant-ph%2F0012083&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We show that the notion of \"levels of Reality\" introduced by Werner\nHeisenberg in his \"Manuscript of 1942\" (1984) and by myself (1983-1985) could\nexplain the quantum indeterminacy. General epistemological implications of this\nnotion are also studied."}, "authors": ["Basarab Nicolescu"], "author_detail": {"name": "Basarab Nicolescu"}, "author": "Basarab Nicolescu", "arxiv_comment": "18 pages", "links": [{"href": "http://arxiv.org/abs/quant-ph/0012007v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/quant-ph/0012007v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.hist-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/quant-ph/0012007v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/quant-ph/0012007v1", "journal_reference": "\"Determinismo e complessita\", Fondazione Nova Spes and Armando\n  Editore, Roma, 2000, pp.127-158, edited by F. Tito Arecchi", "doi": null, "fulltext": "arXiv:quant-ph/0012007v1 1 Dec 2000\n\nLEVELS OF REALITY AS SOURCE OF\nQUANTUM INDETERMINACY∗\n\nBasarab NICOLESCU\n\nLaboratoire de Physique Nucléaire et de Hautes Energies (LPNHE) 1\nLPTPE, Tour 12 E3 - 4, Place Jussieu 75252 Paris Cedex 05, France\ne-mail: nicolesc@in2p3.fr\n\nPublished in Determinismo e complessità, Fondazione Nova Spes and Armando Editore, Roma, 2000, pp. 127-158, edited by F. Tito Arecchi.\n1\nUnité de Recherche des Universités Paris 6 et Paris 7, Associée au CNRS.\n∗\n\n1\n\n\f1\n\nQuantum physics and levels of Reality\n\nThe major cultural impact of the quantum physics has certainly raised questions for the contemporary philosophical dogma of the existence of a single\nlevel of Reality [1].\nHere the meaning we give to the word \"Reality\" is pragmatic and ontological at the same time.\nBy Reality I intend first of all to designate that which resists our experiences, representations, descriptions, images or mathematical formalizations.\nQuantum physics caused us to discover that abstraction is not simply an intermediary between us and Nature, a tool for describing reality, but rather,\none of the constituent parts of Nature. In quantum physics, mathematical\nformalization is inseparable from experience. It resists in its own way by\nits simultaneous concern for internal consistency, and the need to integrate\nexperimental data without destroying that self-consistency.\nIn so far as Nature participates in the being of the world one must ascribe\nan ontological dimension to the concept of Reality. Nature is an immense,\ninexhaustible source of the unknown which justifies the very existence of science. Reality is not only a social construction, the consensus of a collectivity,\nor an intersubjective agreement. It also has a trans-subjective dimension, to\nthe extent that one simple experimental fact can ruin the most beautiful\nscientific theory.\nBy level of Reality [1] I intend to designate an ensemble of systems which\nare invariant under the action of certain general laws: for example, quantum\nentities are subordinate to quantum laws, which depart radically from the\nlaws of the macrophysical world. That is to say that two levels of Reality\nare different if, while passing from one to the other, there is a break in the\nlaws and a break in fundamental concepts (like, for example, causality). No\none has succeeded in finding a mathematical formalism which permits the\nrigorous passage from one world to another. Semantic glosses, tautological\ndefinitions or approximations are unable to replace a rigorous mathematical\nformalism. The recent decoherence models have nothing precise to say on\nthe passage between the quantum level and the macrophysical level: in fact,\nthe main problem is not decoherence but precisely coherence.\nThere are even strong mathematical indications that the continuous passage from the quantum world to the macrophysical world would never be\npossible. But there is nothing catastrophic about this. The discontinuity\nwhich is manifest in the quantum world is also manifest in the structure of\n2\n\n\fthe levels of Reality. That does not prevent the two worlds from co-existing.\nThe levels of Reality are radically different from the levels of organization\nas these have been defined in systemic approaches [2]. Levels of organization do not presuppose a break with fundamental concepts: several levels\nof organization appear at one and the same level of Reality. The levels of\norganization correspond to different structurings of the same fundamental\nlaws. For example, Marxist economy and classical physics belong to one and\nthe same level of Reality.\nThe emergence of at least two different levels of Reality in the study of\nnatural systems is a major event in the history of knowledge.\nThe existence of different levels of Reality has been affirmed by different\ntraditions and civilizations, but these affirmations were founded on religious\ndogma or on the exploration of the interior universe.\nIn our century, in their questioning of the foundations of science, Edmund\nHusserl [3] and other scholars have discovered the existence of different levels\nof perception of Reality by the subject-observer. But these thinkers, pioneers in the exploration of a multi-dimensional and multi-referential reality,\nhave been marginalized by academic philosophers and misunderstood by the\nmajority of physicists, enclosed in their respective specializations. The view\nI am expressing here is totally conform to the one of Heisenberg, Pauli and\nBohr.\nIn fact, Werner Heisenberg came very near, in his philosophical writings,\nto the concept of \"level of Reality\". In his famous Manuscript of the year 1942\n(published only in 1984) Heisenberg, who knew well Husserl, introduces the\nidea of three regions of reality, able to give access to the concept of \"reality\"\nitself: the first region is that of classical physics, the second - of quantum\nphysics, biology and psychic phenomena and the third - that of the religious,\nphilosophical and artistic experiences [4]. This classification has a subtle\nground: the closer and closer connectiveness between the Subject and the\nObject.\nAs we shall see in the following, the notion of levels of Reality will lead\nus to a general philosophical understanding of the nature of indeterminacy.\nIf there was only one region or level of reality, it was impossible to conceive\nwhat means a true, irreducible indeterminacy, like the quantum one.\n\n3\n\n\f2\n\nThe logic of the included middle\n\nKnowledge of the coexistence of the quantum world and the macrophysical world and the development of quantum physics has led, on the level of\ntheory and scientific experiment, to the upheaval of what were formerly considered to be pairs of mutually exclusive contradictories (A and non-A): wave\nand corpuscle, continuity and discontinuity, separability and nonseparability, local causality and global causality, symmetry and breaking of symmetry,\nreversibility and irreversibility of time, etc.\nThe intellectual scandal provoked by quantum mechanics consists in the\nfact that the pairs of contradictories that it generates are actually mutually\ncontradictory when they are analyzed through the interpretative filter of\nclassical logic. This logic is founded on three axioms:\n1. The axiom of identity : A is A.\n2. The axiom of non-contradiction : A is not non-A.\n3. The axiom of the excluded middle : There exists no third term T which\nis at the same time A and non-A.\nUnder the assumption of the existence of a single level of Reality, the\nsecond and third axioms are obviously equivalent.\nIf one accepts the classical logic one immediately arrives at the conclusion\nthat the pairs of contradictories advanced by quantum physics are mutually\nexclusive, because one cannot affirm the validity of a thing and its opposite\nat the same time: A and non-A.\nSince the definitive formulation of quantum mechanics around 1930 the\nfounders of the new science have been acutely aware of the problem of formulating a new, \"quantum logic.\" Subsequent to the work of Birkhoff and van\nNeumann a veritable flourishing of quantum logics was not long in coming\n[5]. The aim of these new logics was to resolve the paradoxes which quantum\nmechanics had created and to attempt, to the extent possible, to arrive at a\npredictive power stronger than that afforded by classical logic.\nMost quantum logics have modified the second axiom of classical logic –\nthe axiom of non-contradiction – by introducing non-contradiction with several truth values in place of the binary pair (A, non-A). These multivalent\nlogics, whose status with respect to their predictive power remains controversial, have not taken into account one other possibility: the modification\nof the third axiom – the axiom of the excluded middle.\n4\n\n\fHistory will credit Stéphane Lupasco with having shown that the logic\nof the included middle is a true logic, formalizable and formalized, multivalent (with three values: A, non-A, and T) and non-contradictory [6]. His\nphilosophy, which takes quantum physics as its point of departure, has been\nmarginalized by physicists and philosophers. Curiously, on the other hand,\nit has had a powerful albeit underground influence among psychologists, sociologists, artists, and historians of religions. Perhaps the absence of the\nnotion of \"levels of Reality\" in his philosophy obscured its substance: many\npersons wrongly believed that Lupasco's logic violated the principle of noncontradiction.\nOur understanding of the axiom of the included middle – there exists a\nthird term T which is at the same time A and non-A – is completely clarified\nonce the notion of \"levels of Reality\" is introduced.\nIn order to obtain a clear image of the meaning of the included middle, we\ncan represent the three terms of the new logic – A, non-A, and T – and the\ndynamics associated with them by a triangle in which one of the vertices is\nsituated at one level of Reality and the two other vertices at another level of\nReality. If one remains at a single level of Reality, all manifestation appears\nas a struggle between two contradictory elements (example: wave A and\ncorpuscle non-A). The third dynamic, that of the T-state, is exercised at\nanother level of Reality, where that which appears to be disunited (wave or\ncorpuscle) is in fact united (quanton), and that which appears contradictory\nis perceived as non-contradictory.\nIt is the projection of T on one and the same level of Reality which\nproduces the appearance of mutually exclusive, antagonistic pairs (A and\nnon-A). A single level of Reality can only create antagonistic oppositions. It\nis inherently self-destructive if it is completely separated from all the other\nlevels of Reality. A third term, let us call it T0 , which is situated on the same\nlevel of Reality as that of the opposites A and non-A, can not accomplish\ntheir reconciliation.\nThe T-term is the key in understanding indeterminacy: being situated\non a different level of Reality than A and non-A, it necessarily induces an\ninfluence of its own level of Reality upon its neighbouring and different level\nof Reality: the laws of a given level are not self-sufficient to describe the\nphenomena occuring at the respective level.\nThe entire difference between a triad of the included middle and an\nHegelian triad is clarified by consideration of the role of time. In a triad\nof the included middle the three terms coexist at the same moment in time.\n5\n\n\fOn the contrary, each of the three terms of the Hegelian triad succeeds the\nformer in time. This is why the Hegelian triad is incapable of accomplishing\nthe reconciliation of opposites, whereas the triad of the included middle is\ncapable of it. In the logic of the included middle the opposites are rather\ncontradictories : the tension between contradictories builds a unity which\nincludes and goes beyond the sum of the two terms. The Hegelian triad\nwould never explain the nature of indeterminacy.\nOne also sees the great dangers of misunderstanding engendered by the\ncommon enough confusion made between the axiom of the excluded middle\nand the axiom of non-contradiction . The logic of the included middle is noncontradictory in the sense that the axiom of non-contradiction is thoroughly\nrespected, a condition which enlarges the notions of \"true\" and \"false\" in\nsuch a way that the rules of logical implication no longer concerning two\nterms (A and non-A) but three terms (A, non-A and T), co-existing at the\nsame moment in time. This is a formal logic, just as any other formal logic:\nits rules are derived by means of a relatively simple mathematical formalism.\nOne can see why the logic of the included middle is not simply a metaphor,\nlike some kind of arbitrary ornament for classical logic, which would permit\nadventurous incursions into the domain of complexity. The logic of the included middle is the privileged logic of complexity, privileged in the sense that\nit allows us to cross the different areas of knowledge in a coherent way, by\nenabling a new kind of simplicity.\nThe logic of the included middle does not abolish the logic of the excluded\nmiddle: it only constrains its sphere of validity. The logic of the excluded\nmiddle is certainly valid for relatively simple situations. On the contrary, the\nlogic of the excluded middle is harmful in complex, transdisciplinary cases.\nFor me, the problem of indeterminacy is precisely belonging to this class of\ncases.\n\n3\n\nThe Gödelian unity of the world\n\nThe transdisciplinary approach [7] sets forth for consideration a multi-dimensional Reality, structured by multiple levels replacing the single level of classical thought – one-dimensional reality. This proposal is not enough, by itself,\nto justify a new vision of the world. We must first of all answer many questions in the most rigorous possible way. What is the nature of the theory\nwhich can describe the passage from one level of Reality to another? Is there\n6\n\n\ftruly a coherence, a unity of the totality of levels of Reality? What is the\nrole of the subject-observer of Reality in the dynamics of the possible unity\nof all the levels of Reality? Is there a level of Reality which is privileged in\nrelation to all other levels? What is the role of reason in the dynamics of the\npossible unity of knowledge? What is the predictive power of the new model\nof Reality in the sphere of reflection and action? Finally, is understanding of\nthe present world possible ?\nAccording to our model, Reality comprises a certain number of levels\n[1,2]. The considerations which follow do not depend on whether or not this\nnumber is finite or infinite. For the sake of clarity, let us suppose that this\nnumber is infinite.\nTwo adjacent levels are connected by the logic of the included middle in\nthe sense that the T-state present at a certain level is connected to a pair of\ncontradictories (A and non-A) at the immediately adjacent level. The T-state\noperates the unification of contradictories A and non-A but this unification is\noperated at a level different from the one on which A and non-A are situated.\nThe axiom of non-contradiction is thereby respected. Does this fact signify\nthat we can obtain a complete theory, which will be able to account for all\nknown and forthcoming results ?\nThere is certainly a coherence between different levels of Reality, at least\nin the natural world. In fact, an immense self-consistency – a cosmic bootstrap – seems to govern the evolution of the universe, from the infinitely\nsmall to the infinitely large, from the infinitely brief to the infinitely long [1].\nA flow of information is transmitted in a coherent manner from one level of\nReality to another level of Reality in our physical universe.\nThe logic of the included middle is capable of describing the coherence\nbetween the levels of Reality by an iterative process defined by the following\nstages: 1. A pair of contradictories (A, non-A) situated at a certain level\nof reality is unified by a T-state situated at a contiguous level of Reality;\n2. In turn, this T-state is linked to a couple of contradictories (A', nonA'), situated at its own level; 3. The pair of contradictories (A', non-A')\nis, in its turn, unified by a T'-state situated at a different level of Reality,\nimmediately contiguous to that where the ternary (A', non-A', T) is found.\nThe iterative process continues indefinitely until all the levels of Reality,\nknown or conceivable, are exhausted.\nIn other terms, the action of the logic of the included middle on the\ndifferent levels of Reality induces an open, Gödelian structure of the unity of\nlevels of Reality. This structure has considerable consequences for the theory\n7\n\n\fof knowledge because it implies the impossibility of a complete theory, closed\nin upon itself.\nIn effect, in accordance with the axiom of non-contradiction, the T-state\nrealizes the unification of a pair of contradictories (A, non-A) but it is associated, at the same time with another pair of contradictories (A', non-A'). This\nsignifies that starting from a certain number of mutually exclusive pairs one\ncan construct a new theory which eliminates contradictions at a certain level\nof Reality, but this theory is only temporary because it inevitably leads, under the joint pressure of theory and experience, to the discovery of new levels\nof contradictories, situated at a new level of Reality. In turn this theory will\ntherefore be replaced by still more unified theories as new levels of Reality\nare discovered. This process will continue indefinitely without ever resulting\nin a completely unified theory. The axiom of non-contradiction is increasingly strengthened during this process. In this sense, without ever leading\nto an absolute non-contradiction, we can speak of an evolution of knowledge\nwhich encompasses all the levels of Reality: knowledge which is forever open.\nFiner matter penetrates coarser matter, just as quantum matter penetrates\nmacrophysical matter, but the reverse is not true. Degrees of materiality\ninduce an orienting arrow for tracing the transmission of information from\none level to the other. This orienting arrow is associated with the discovery\nof more and more general, unifying, and encompassing laws.\nThe open structure of the unity of levels of Reality is in accord with\none of the most important scientific results of the 20th century concerning\narithmetic, the theorem of Kurt Gödel [8]. Gödel's theorem tells us that\na sufficiently rich system of axioms inevitably lead to results which would\nbe either undecidable or contradictory. The implications of Gödel's theorem\nhave considerable importance for all modern theories of knowledge. First of\nall it does not only concern the field of arithmetic but also all mathematics\nwhich includes arithmetic. Now, obviously the mathematics which underlies\ntheoretical physics include arithmetic. This means that all research for a\ncomplete physical theory is illusory.\nIn fact, the search for an axiomatic system leading to a complete theory (without undecidable or contradictory results) marks at once the apex\nand the starting point of the decline of classical thought. The axiomatic\ndream is unraveled by the verdict of the holy of holies of classical thought –\nmathematical rigor.\nThe theorem that Kurt Gödel demonstrated in 1931 sounded only a faint\necho beyond a very limited circle of specialists. The difficulty and extreme\n8\n\n\fsubtlety of its demonstration explains why this theorem has taken a certain\ntime to be understood within the mathematical community. Today, it has\nscarcely begun to penetrate the world of physicists. Wolfgang Pauli, one\nof the founders of quantum mechanics, was one of the first physicists to\nunderstand the extreme importance Gödel's theorem has for the construction\nof physical theories [9].\nThe Gödelian structure of the unity of levels of Reality associated with\nthe logic of the included middle implies that it is impossible to construct a\ncomplete theory for describing the passage from one level to the other and,\na fortiori, for describing the unity of levels of Reality.\nIf it does exist, the unity linking all the levels of Reality must necessarily\nbe an open unity.\nTo be sure, there is a coherence of the unity of levels of Reality, but we\nmust remember that this coherence is oriented : there is an arrow associated\nwith all transmission of information from one level to the other. As a consequence of this, if coherence is limited only to the levels of Reality, it is stopped\nat the \"highest\" level and at the \"lowest\" level. If we wish to posit the idea\nof a coherence which continues beyond these two limited levels so that there\nis an open unity, one must conceive the unity of levels of Reality as a unity\nwhich is extended by a zone of non-resistance to our experiences, representations, descriptions, images and mathematical formalizations. Within our\nmodel of Reality, this zone of non-resistance corresponds to the \"veil\" which\nBernard d'Espagnat referred to as \"the veil of the real\" [10]. The \"highest\"\nlevel and the \"lowest\" level of the unity of levels of Reality are united across\na zone of absolute transparence. But these two levels are different; from\nthe point of view of our experiences, representations, descriptions, images,\nand mathematical formalizations, absolute transparence functions like a veil.\nIn fact, the open unity of the world implies that that which is \"below\" is\nthe same as that which is \"above\". The isomorphism between \"above\" and\n\"below\" is established by the zone of non-resistance.\nQuite simply, the non-resistance of this zone of absolute transparence is\ndue to the limitations of our bodies and of our sense organs, limitations which\napply regardless of the instruments of measure used to extend these sense\norgans. To claim that there is an infinite human knowledge (which excludes\nany zone of non-resistance), while simultaneously affirming the limitations\nof our body and our sense organs, seems to us a feat of linguistic sleight of\nhand. The zone of non-resistance corresponds to the sacred, that is to say to\nthat which does not submit to any rationalization.\n9\n\n\fThe unity of levels of Reality and its complementary zone of non-resistance\nconstitutes the transdisciplinary Object.\nA new Principle of Relativity [7] emerges from the coexistence between\ncomplex plurality and open unity : no one level of Reality constitutes a\nprivileged place from which one is able to understand all the other levels of\nReality. A level of Reality is what it is because all the other levels exist at the\nsame time. This Principle of Relativity is what originates a new perspective\non religion, politics, art, education, and social life. In the transdisciplinary\nvision, Reality is not only multi-dimensional, it is also multi-referential.\nThe different levels of Reality are accessible to human knowledge thanks\nto the existence of different levels of perception, which are in bi-univocal\ncorrespondence with levels of Reality. These levels of perception permit an\nincreasingly general, unifying, encompassing vision of Reality, without ever\nentirely exhausting it.\nAs in the case of levels of Reality the coherence of levels of perception\npresupposes a zone of non-resistance to perception.\nThe unity of levels of perception and its complementary zone of nonresistance constitutes the transdisciplinary Subject.\nThe two zones of non-resistance of transdisciplinary Object and Subject\nmust be identical in order that the transdisciplinary Subject can communicate with the transdisciplinary Object. A flow of consciousness crossing the\ndifferent levels of perception in a coherent manner must correspond to the\nflow of information crossing the different levels of Reality in a coherent manner. The two flows are in a relation of isomorphism thanks to the existence\nof one and the same zone of non-resistance. Knowledge is neither exterior\nnor interior: it is at the same time exterior and interior. The study of the\nuniverse and the study of the human being sustain one another. The zone\nof non-resistance permits the unification of the transdisciplinary Subject and\nthe transdisciplinary Object while preserving their difference.\nTransdisciplinarity is the transgression of duality opposing binary pairs:\nsubject/object,\nsubjectivity/objectivity,\nmatter/consciousness,\nnature/divine, simplicity/complexity, reductionism/holism, diversity/unity.\nThis duality is transgressed by the open unity which encompasses both the\nuniverse and the human being.\nThe transdisciplinary model of Reality has, in particular, some important consequences in the study of complexity. Without its contradictory pole\nof simplicity (or, more precisely, simplexity) complexity appears as an increasingly enlarging distance between the human being and Reality which\n10\n\n\fintroduces a self-destructive alienation of the human being who is plunged\ninto the absurdity of destiny. The infinite simplicity of the transdisciplinary\nSubject corresponds to the infinite complexity of the transdisciplinary Object.\nThe Subject/Object problem was central for the founding-fathers of quantum mechanics. Pauli, Heisenberg and Pauli, as Husserl, Heidegger and Cassirer refuted the basic axiom of modern metaphysics: the clear-cut distinction\nbetween Subject and Object. Our considerations here are inscribed in the\nsame framework.\n\n4\n\nThe death and the resurrection of Nature\n\nModernity is particularly deadly. It has invented all kinds of \"deaths\" and\n\"ends\": the death of God, the death of Man, the end of ideologies, the end\nof history and, today, the end of science [11].\nBut, there is a death which is spoken of much less, on account of shame\nor ignorance : the death of Nature. In my view, this death of Nature is the\nsource of all the other deadly concepts which were just invoked. In any case,\nthe very word \"Nature\" has ended by disappearing from scientific vocabulary.\nOf course, the \"man in the street\", just as the scientist (in popularized works)\nstill uses this word, but in a confused, sentimental way, reminiscent of magic.\nSince the beginning of time we have not stopped modifying our vision of\nNature [12]. Historians of science are in accord in saying that, despite all appearances to the contrary, there is not only one vision of Nature across time.\nWhat can there be in common between the Nature of so-called \"primitive\"\npeoples, the Nature of the Greeks, the Nature in the time of Galileo, of the\nMarquis de Sade, of Laplace or of Novalis? The vision of Nature of a given\nperiod depends on the imaginary which predominates during that period;\nin turn, that vision depends on a multiplicity of parameters: the degree of\ndevelopment of science and technology, social organization, art, religion, etc.\nOnce formed, an image of Nature exercises an influence on all areas of knowledge. The passage from one vision to another is not progressive, continuous –\nit occurs by means of sharp, radical, discontinuous ruptures. Several contradictory visions can co-exist. The extraordinary diversity of visions of Nature\nexplains why one cannot speak of Nature, but only of a certain nature in\naccord with the imaginary of a given period.\nThe image of Nature has always had a multiform action: it has influenced\n11\n\n\fnot only science but also art, religion, and social life. This allows us to explain\nsome strange synchronicities. Here I limit myself to but a single example:\nthe simultaneous appearance of the theory of the end of history and of the\nend of science just before the beginning of the 3rd millenium. For example,\nunified theories in physics have as their aim the elaboration of a complete\napproach, founded on a unique interaction, which can predict everything\n(hence the name, \"Theory of Everything\"). It is quite obvious that if such a\ntheory were formulated in the future, it would signify the end of fundamental\nphysics, because there would be nothing left to look for. It is interesting to\nobserve that both the idea of the end of history and of the end of science\nhave simultaneously emerged from the \"end of the century\" imaginary.\nNotwithstanding the abundant and fascinating diversity of images of Nature one can nevertheless distinguish three main stages: Magic Nature, Nature as Machine, and the Death of Nature. Magical thought views nature\nas a living organism, endowed with intelligence and consciousness. The fundamental postulate of magical thought is that of universal interdependence:\nNature cannot be conceived outside of its relations with us. Everything is\nsign, trace, signature, symbol. Science, in the modern sense of this word, is\nsuperfluous.\nAt the other extreme, the mechanist and determinist thought of the 18th\nand above all the 19th century (which, by the way, still predominates today) conceives Nature not as an organism, but as a machine. It suffices to\ndisassemble this machine piece by piece in order to possess it entirely. The\nfundamental postulate of mechanistic and determinist thought is that Nature can be known and conquered by scientific methodology, defined in a\nway which is completely independent of human beings and separate from us.\nThe logical outcome of the mechanist and determinist vision is the Death\nof Nature, the disappearance of the concept of Nature from the scientific field.\nFrom the very beginning of the mechanistic vision, Nature as Machine, with\nor without the image of God as watchmaker, is split up into an ensemble of\nseparate parts. From that moment on, there is no more need for a coherent\nwhole, for a living organism, or even, for a machine which still kept the musty\nodor of finality. Nature is dead, but complexity remains. An astonishing\ncomplexity (in fact, often confused with \"complication\"), which penetrates\neach and every field of knowledge. But this complexity is perceived as an\naccident; we ourselves are considered to be an accident of complexity.\nThe Death of Nature is incompatible with a coherent interpretation of\nthe results of contemporary science, in spite of the persistence of the neo12\n\n\freductionistic attitude which accords exclusive importance to the fundamental building-blocks of matter and to the four known physical interactions.\nAccording to this neo-reductionist attitude, all recourse to Nature is superfluous and devoid of sense. In truth, Nature is dead only for a certain vision\nof the world – the classical vision.\nThe rigid objectivity of classical thought is only viable in the classical\nworld. The idea of total separation between an observer and a Reality assumed to be completely independent from that observer brings us to the\nverge of insurmountable paradoxes. In fact, a far more subtle notion of objectivity characterizes the quantum world: objectivity depends on the level\nof Reality in question.\nSpace-time itself no longer rests on a fixed concept. Our space-time which\nproceeds in four dimensions is not the only conceivable space-time. According to certain physical theories, it appears more an approximation, like a\npart of a space-time all the more rich for being the generator of possible\nphenomena. Supplementary dimensions are not the result of mere intellectual speculation. On the one hand, these dimensions are necessary to insure\nthe self-consistency of the theory and the elimination of certain undesirable\naspects. On the other hand, they do not have a purely formal character –\nthey have physical consequences for our own scale. For example, according\nto certain cosmological theories, if the universe had been associated from the\n\"beginning\" of the big bang in a multi-dimensional space-time, supplementary dimensions would have remained forever hidden, unobservable; rather,\ntheir vestiges would be precisely the known physical interactions. By means\nof generalizing the example provided by particle physics, it becomes conceivable that certain levels of Reality correspond to a space-time different than\nthat characterizing our own level. Moreover, complexity itself would depend\non the nature of space-time as well.\nWe can make, like Heisenberg made [4], a step further and assert that the\nclassical four-dimensional space-time is, in fact, an anthropomorphic concept,\nfounded on our sense-organs.\nAccording to present scientific conceptions, matter is far from being identical with substance. In the quantum world, matter is associated with a\nsubstance-energy-information-space-time complexus.\nIt is somewhat mysterious why trajectories played such a central role\nin the formulation of modern physics. The quantum indeterminacy showed\nthat trajectories are not a fondamental concept. In more recent years, a new\ndiscipline is born by the unexpected encounter between the theory of infor13\n\n\fmation and quantum mechanics: the Quantum Theory of Information [13].\nThis new-born science already poses a crucial question : are the information\nlaws more general, and therefore deeper, than the equations of movement?\nAre the central concepts of positions, speeds and trajectories of particles to\nbe abandoned in favour of information laws which, in fact, could be valid not\nonly for physics but also for other fields of knowledge? There were these last\nyears fabulous experimental advances in the fields of non-separability, disentaglement, quantum cryptography and teleportation, in conjonction with the\npossible advent of quantum computers. This shows that notions like \"levels\nof Reality\" or \"included middle\" cease to be just theoretical speculations, by\nentering today in the field of experiments and, tomorrow, in the everyday\nlife.\nWe can assert that the notion itself of laws of Nature completely changes\nits contents when compared with that of the classical vision. This situation\ncan be summed up by three theses formulated by the well-known physicist\nWalter Thirring [14] :\n1. The laws of any inferior level are not completely determined by the laws\nof a superior level. Thus, notions well anchored in classical physics, like \"fundamental\" and \"accidental,\" must be re-examined. That which is considered\nto be fundamental on one level can appear to be accidental on a superior\nlevel and that which is considered to be accidental or incomprehensible on a\ncertain level can appear to be fundamental on a superior level.\n2. The laws of an inferior level depend more on the circumstances of their\nemergence than on the laws of a superior level. The laws of a certain level\ndepend essentially on the local configuration to which these laws refer. There\nis therefore a kind of local autonomy of respective levels of Reality; however,\ncertain internal ambiguities concerning laws of an inferior level of Reality are\nresolved by taking into account the laws of a superior level. It is the internal\nconsistency of laws which reduces the ambiguity of laws.\n3. The hierarchy of laws evolves at the same time as the universe itself.\nIn other words, the birth of laws occurs simultaneously with the evolution\nof the universe. These laws pre-exist at the \"beginning\" of the universe as\npotentialities. It is the evolution of the universe which actualizes these laws\nand their hierarchy. A transdisciplinary model of Nature must integrate all\nthis new knowledge of the emergent characteristics of the physical universe.\nThe Thirring's description of the laws of Nature is in perfect agreement\nwith our own considerations about the Gödelian structure of Nature and\nknowledge. The problem of quantum indeterminacy can now be fully under14\n\n\fstood as the influence of the quantum level of Reality on our own macrophysical level of Reality. Of course, the laws of the macrophysical level depend\nmore, as Thirring writes, on \"the circumstances of their emergence\". From\nthe point of view of the macrophysical level indeterminacy appears as accidental, incomprehensible, or at most as a rare event. But this reveals,\nin fact, an internal ambiguity which can be solved only by taking into account the laws of the quantum level. At this last level the indeterminacy is\nfundamental.\nOne can ask if one can not logically conceive a generalized indeterminacy,\nwhich goes far beyond the problem of trajectories of particles. Heisenberg\nalready considered the indeterminacy of language [4] : the natural language\ncan not express with arbitrary high precision all its elements, because the\nway of expressing acts in an essential manner on what is expressed. The\nindeterminacy of the natural language is just one example of the generalized\nindeterminacy generated by the Gödelian structure of Nature and knowledge.\nIn conclusion, we can distinguish three major aspects of Nature in accordance with the transdisciplinary model of Reality :\n(1) Objective Nature, which is connected with the natural properties of\nthe transdisciplinary Object; objective Nature is subject to subjective objectivity. This objectivity is subjective to the extent that the levels of Reality\nare connected to levels of perception. Nevertheless emphasis here is on objectivity, to the extent to which the methodology employed is that of science.\n2) Subjective Nature, which is connected with the natural properties of the\ntransdisciplinary Subject; subjective Nature is subject to objective subjectivity. This subjectivity is objective to the extent that the levels of perception\nare connected to levels of Reality. Nevertheless, emphasis here is on subjectivity, to the extent to which the methodology is employed is that of the\nancient science of being, which crosses all the traditions and religions of the\nworld.\n3) Trans-Nature, which is connected with a similarity in Nature which exists between the transdisciplinary Object and the transdisciplinary Subject.\nTrans-Nature concerns the domain of the sacred. It cannot be approached\nwithout considering the other two aspects of Nature at the same time.\nTransdisciplinary Nature has a ternary structure (objective Nature, subjective Nature, trans-Nature), which defines living Nature. This Nature is\nliving because it is there that life is present in all its degrees and because its\nstudy demands the integration of lived experience. The three aspects of Nature must be considered simultaneously in terms of their inter-relation and\n15\n\n\ftheir conjunction within all the phenomena of living Nature [15].\nThe study of living Nature asks for a new methodology – transdisciplinary\nmethodology [7] – which is different from the methodology of modern science\nand the methodology of the ancient science of being. It is the co-evolution\nof the human being and of the universe which asks for a new methodology.\nAn attempt to elaborate a new Philosophy of Nature, a privileged mediator of a dialogue between all the areas of knowledge, is one of the highest\npriorities of transdisciplinarity.\n\nReferences\n[1] Basarab Nicolescu, Nous, la particule et le monde, Le Mail, Paris, 1985.\n[2] Basarab Nicolescu, Levels of Complexity and Levels of Reality, in \"The\nEmergence of Complexity in Mathematics, Physics, Chemistry, and Biology\", Proceedings of the Plenary Session of the Pontifical Academy\nof Sciences, 27-31 October 1992, Casina Pio IV, Vatican, Ed. Pontificia\nAcademia Scientiarum, Vatican City, 1996 (distributed by Princeton University Press), edited by Bernard Pullman; Basarab Nicolescu, Gödelian\nAspects of Nature and Knowledge, in \"Systems - New Paradigms for the\nHuman Sciences\", Walter de Gruyter, Berlin - New York, 1998, edited by\nGabriel Altmann and Walter A. Koch ; Michel Camus, Thierry Magnin,\nBasarab Nicolescu and Karen-Claire Voss, Levels of Representation and\nLevels of Reality : Towards an Ontology of Science, in The Concept of Nature in Science and Theology (part II), Éditions Labor et Fides, Genève,\n1998, pp. 94-103, edited by Niels H. Gregersen, Michael W.S. Parsons\nand Christoph Wassermann.\n[3] Edmund Husserl, Méditations cartésiennes, translated form German by\nGabrielle Peiffer and Emmanuel Levinas, Vrin, Paris, 1966.\n[4] Werner Heisenberg, Philosophie - Le manuscrit de 1942, Seuil, Paris,\n1998, translation from German and introduction by Catherine Chevalley.\n\n16\n\n\f[5] T.A. Brody, On Quantum Logic, in Foundation of Physics, vol. 14, n 5,\n1984, pp. 409-430.\n[6] Stéphane Lupasco, Le principe d'antagonisme et la logique de l'énergie,\nLe Rocher, Paris, 1987 (2nd edition), foreword by Basarab Nicolescu ;\nStéphane Lupasco - L'homme et l'oeuvre, Le Rocher, Paris, coll. \"Transdisciplinarité\", 1999, under the direction of Horia Badescu and Basarab\nNicolescu.\n[7] Basarab Nicolescu, La transdisciplinarité, manifeste, Le Rocher, Paris,\ncoll. \"Transdisciplinarité\", 1996. The word \"transdisciplinarity\", as carrying a different meaning from \"interdisciplinarity\", was first introduced in\n1970 by Jean Piaget in L'interdisciplinarité - Problèmes d'enseignement\net de recherche dans les universités, OCDE, Paris, 1972. From etymological point of view \"trans\" means \"between, across, beyond\". We mean\nby \"transdisciplinarity\" that which crosses all disciplines and finds itself\nbetween and beyond all disciplines. Therefore the transdisciplinarity is\nclearly not a new discipline. See also the Internet site of the International Center for Transdisciplinary Research (CIRET) http://perso.clubinternet.fr/nicol/ciret/ (materials in French, English, Portuguese and\nSpanish).\n[8] See, for example, Ernest Nagel and James R. Newman, Gödel's Proof,\nNew York University Press, New York, 1958; Hao Wang, A Logical\nJourney - From Gödel to Philosophy, The MIT Press, Cambridge, Massachusetts - London, England, 1996.\n[9] Wolfgang Pauli, Writings on Physics and Philosophy, Springer-Verlag,\nBerlin-Heidelberg, Germany, 1994, edited by Charles P. Enz and Karl\nvon Meyenn, translated by Robert Schlapp; K.V. Laurikainen, Beyond the\nAtom - The Philosophical Thought of Wolfgang Pauli, Springer - Verlag,\nBerlin - Heidelberg, Germany, 1988.\n[10] Bernard d'Espagnat, Le réel voilé - Analyse des concepts quantiques,\nFayard, Paris, 1994.\n[11] John Horgan, The End of Science, Broadway Books, New York, 1997.\n[12] Robert Lenoble, Histoire de l'idée de Nature, Albin Michel, Paris, coll.\n\"L'évolution de l'humanité\", 1990.\n17\n\n\f[13] See, for example, David Deutsch, The Fabric of Reality, Penguin Books,\nLondon, England, 1997.\n[14] Walter Thirring, Do the laws of Nature evolve ?, in What is life ? The Next Fifty Years: Speculations on the Future of biology, Cambridge\nUniversity Press, USA, 1995, edited by Michael P. Murphy and Luke A.\nO'Neil.\n[15] In fact the term \"living Nature\" is a pleonasm, because the word \"Nature\" is intimately linked to that of \"birth.\" The root of the Latin word,\nnatura is nasci and designates the action of giving birth as well as the\nfeminine organs of generation.\n\n18\n\n\fLEVELS OF REALITY AS SOURCE OF\nQUANTUM INDETERMINACY\u0003\nBasarab NICOLESCU\nLaboratoire de Physique Nu l\u0013eaire et de Hautes Energies (LPNHE) 1\nLPTPE, Tour 12 E3 - 4, Pla e Jussieu 75252 Paris Cedex 05, Fran e\ne-mail: ni oles \bin2p3.fr\n\n\u0003 Published\n\nin Determinismo e omplessit\u0012a, Fondazione Nova Spes and Armando Editore, Roma, 2000, pp. 127-158, edited by F. Tito Are hi.\n1 Unit\u0013\ne de Re her he des Universit\u0013es Paris 6 et Paris 7, Asso i\u0013ee au CNRS.\n\n1\n\n\f1 Quantum physi s and levels of Reality\nThe major ultural impa t of the quantum physi s has ertainly raised questions for the ontemporary philosophi al dogma of the existen e of a single\nlevel of Reality [1℄.\nHere the meaning we give to the word \"Reality\" is pragmati and ontologi al at the same time.\nBy Reality I intend rst of all to designate that whi h resists our experien es, representations, des riptions, images or mathemati al formalizations.\nQuantum physi s aused us to dis over that abstra tion is not simply an intermediary between us and Nature, a tool for des ribing reality, but rather,\none of the onstituent parts of Nature. In quantum physi s, mathemati al\nformalization is inseparable from experien e. It resists in its own way by\nits simultaneous on ern for internal onsisten y, and the need to integrate\nexperimental data without destroying that self- onsisten y.\nIn so far as Nature parti ipates in the being of the world one must as ribe\nan ontologi al dimension to the on ept of Reality. Nature is an immense,\ninexhaustible sour e of the unknown whi h justi es the very existen e of s ien e. Reality is not only a so ial onstru tion, the onsensus of a olle tivity,\nor an intersubje tive agreement. It also has a trans-subje tive dimension, to\nthe extent that one simple experimental fa t an ruin the most beautiful\ns ienti theory.\nBy level of Reality [1℄ I intend to designate an ensemble of systems whi h\nare invariant under the a tion of ertain general laws: for example, quantum\nentities are subordinate to quantum laws, whi h depart radi ally from the\nlaws of the ma rophysi al world. That is to say that two levels of Reality\nare di erent if, while passing from one to the other, there is a break in the\nlaws and a break in fundamental on epts (like, for example, ausality). No\none has su eeded in nding a mathemati al formalism whi h permits the\nrigorous passage from one world to another. Semanti glosses, tautologi al\nde nitions or approximations are unable to repla e a rigorous mathemati al\nformalism. The re ent de oheren e models have nothing pre ise to say on\nthe passage between the quantum level and the ma rophysi al level: in fa t,\nthe main problem is not de oheren e but pre isely oheren e.\nThere are even strong mathemati al indi ations that the ontinuous passage from the quantum world to the ma rophysi al world would never be\npossible. But there is nothing atastrophi about this. The dis ontinuity\nwhi h is manifest in the quantum world is also manifest in the stru ture of\n2\n\n\fthe levels of Reality. That does not prevent the two worlds from o-existing.\nThe levels of Reality are radi ally di erent from the levels of organization\nas these have been de ned in systemi approa hes [2℄. Levels of organization do not presuppose a break with fundamental on epts: several levels\nof organization appear at one and the same level of Reality. The levels of\norganization orrespond to di erent stru turings of the same fundamental\nlaws. For example, Marxist e onomy and lassi al physi s belong to one and\nthe same level of Reality.\nThe emergen e of at least two di erent levels of Reality in the study of\nnatural systems is a major event in the history of knowledge.\nThe existen e of di erent levels of Reality has been aAErmed by di erent\ntraditions and ivilizations, but these aAErmations were founded on religious\ndogma or on the exploration of the interior universe.\nIn our entury, in their questioning of the foundations of s ien e, Edmund\nHusserl [3℄ and other s holars have dis overed the existen e of di erent levels\nof per eption of Reality by the subje t-observer. But these thinkers, pioneers in the exploration of a multi-dimensional and multi-referential reality,\nhave been marginalized by a ademi philosophers and misunderstood by the\nmajority of physi ists, en losed in their respe tive spe ializations. The view\nI am expressing here is totally onform to the one of Heisenberg, Pauli and\nBohr.\nIn fa t, Werner Heisenberg ame very near, in his philosophi al writings,\nto the on ept of \"level of Reality\". In his famous Manus ript of the year 1942\n(published only in 1984) Heisenberg, who knew well Husserl, introdu es the\nidea of three regions of reality, able to give a ess to the on ept of \"reality\"\nitself: the rst region is that of lassi al physi s, the se ond - of quantum\nphysi s, biology and psy hi phenomena and the third - that of the religious,\nphilosophi al and artisti experien es [4℄. This lassi ation has a subtle\nground: the loser and loser onne tiveness between the Subje t and the\nObje t.\nAs we shall see in the following, the notion of levels of Reality will lead\nus to a general philosophi al understanding of the nature of indetermina y.\nIf there was only one region or level of reality, it was impossible to on eive\nwhat means a true, irredu ible indetermina y, like the quantum one.\n\n3\n\n\f2 The logi of the in luded middle\nKnowledge of the oexisten e of the quantum world and the ma rophysial world and the development of quantum physi s has led, on the level of\ntheory and s ienti experiment, to the upheaval of what were formerly onsidered to be pairs of mutually ex lusive ontradi tories (A and non-A): wave\nand orpus le, ontinuity and dis ontinuity, separability and nonseparability, lo al ausality and global ausality, symmetry and breaking of symmetry,\nreversibility and irreversibility of time, et .\nThe intelle tual s andal provoked by quantum me hani s onsists in the\nfa t that the pairs of ontradi tories that it generates are a tually mutually\nontradi tory when they are analyzed through the interpretative lter of\nlassi al logi . This logi is founded on three axioms:\n1. The axiom of identity : A is A.\n2. The axiom of non- ontradi tion : A is not non-A.\n3. The axiom of the ex luded middle : There exists no third term T whi h\nis at the same time A and non-A.\nUnder the assumption of the existen e of a single level of Reality, the\nse ond and third axioms are obviously equivalent.\nIf one a epts the lassi al logi one immediately arrives at the on lusion\nthat the pairs of ontradi tories advan ed by quantum physi s are mutually\nex lusive, be ause one annot aAErm the validity of a thing and its opposite\nat the same time: A and non-A.\nSin e the de nitive formulation of quantum me hani s around 1930 the\nfounders of the new s ien e have been a utely aware of the problem of formulating a new, \"quantum logi .\" Subsequent to the work of Birkho and van\nNeumann a veritable ourishing of quantum logi s was not long in oming\n[5℄. The aim of these new logi s was to resolve the paradoxes whi h quantum\nme hani s had reated and to attempt, to the extent possible, to arrive at a\npredi tive power stronger than that a orded by lassi al logi .\nMost quantum logi s have modi ed the se ond axiom of lassi al logi {\nthe axiom of non- ontradi tion { by introdu ing non- ontradi tion with several truth values in pla e of the binary pair (A, non-A). These multivalent\nlogi s, whose status with respe t to their predi tive power remains ontroversial, have not taken into a ount one other possibility: the modi ation\nof the third axiom { the axiom of the ex luded middle.\n4\n\n\fHistory will redit St\u0013ephane Lupas o with having shown that the logi\nof the in luded middle is a true logi , formalizable and formalized, multivalent (with three values: A, non-A, and T) and non- ontradi tory [6℄. His\nphilosophy, whi h takes quantum physi s as its point of departure, has been\nmarginalized by physi ists and philosophers. Curiously, on the other hand,\nit has had a powerful albeit underground in uen e among psy hologists, soiologists, artists, and historians of religions. Perhaps the absen e of the\nnotion of \"levels of Reality\" in his philosophy obs ured its substan e: many\npersons wrongly believed that Lupas o's logi violated the prin iple of nonontradi tion.\nOur understanding of the axiom of the in luded middle { there exists a\nthird term T whi h is at the same time A and non-A { is ompletely lari ed\non e the notion of \"levels of Reality\" is introdu ed.\nIn order to obtain a lear image of the meaning of the in luded middle, we\nan represent the three terms of the new logi { A, non-A, and T { and the\ndynami s asso iated with them by a triangle in whi h one of the verti es is\nsituated at one level of Reality and the two other verti es at another level of\nReality. If one remains at a single level of Reality, all manifestation appears\nas a struggle between two ontradi tory elements (example: wave A and\norpus le non-A). The third dynami , that of the T-state, is exer ised at\nanother level of Reality, where that whi h appears to be disunited (wave or\norpus le) is in fa t united (quanton), and that whi h appears ontradi tory\nis per eived as non- ontradi tory.\nIt is the proje tion of T on one and the same level of Reality whi h\nprodu es the appearan e of mutually ex lusive, antagonisti pairs (A and\nnon-A). A single level of Reality an only reate antagonisti oppositions. It\nis inherently self-destru tive if it is ompletely separated from all the other\nlevels of Reality. A third term, let us all it T0 , whi h is situated on the same\nlevel of Reality as that of the opposites A and non-A, an not a omplish\ntheir re on iliation.\nThe T-term is the key in understanding indetermina y: being situated\non a di erent level of Reality than A and non-A, it ne essarily indu es an\nin uen e of its own level of Reality upon its neighbouring and di erent level\nof Reality: the laws of a given level are not self-suAE ient to des ribe the\nphenomena o uring at the respe tive level.\nThe entire di eren e between a triad of the in luded middle and an\nHegelian triad is lari ed by onsideration of the role of time. In a triad\nof the in luded middle the three terms oexist at the same moment in time.\n5\n\n\fOn the ontrary, ea h of the three terms of the Hegelian triad su eeds the\nformer in time. This is why the Hegelian triad is in apable of a omplishing\nthe re on iliation of opposites, whereas the triad of the in luded middle is\napable of it. In the logi of the in luded middle the opposites are rather\nontradi tories : the tension between ontradi tories builds a unity whi h\nin ludes and goes beyond the sum of the two terms. The Hegelian triad\nwould never explain the nature of indetermina y.\nOne also sees the great dangers of misunderstanding engendered by the\nommon enough onfusion made between the axiom of the ex luded middle\nand the axiom of non- ontradi tion . The logi of the in luded middle is nonontradi tory in the sense that the axiom of non- ontradi tion is thoroughly\nrespe ted, a ondition whi h enlarges the notions of \"true\" and \"false\" in\nsu h a way that the rules of logi al impli ation no longer on erning two\nterms (A and non-A) but three terms (A, non-A and T), o-existing at the\nsame moment in time. This is a formal logi , just as any other formal logi :\nits rules are derived by means of a relatively simple mathemati al formalism.\nOne an see why the logi of the in luded middle is not simply a metaphor,\nlike some kind of arbitrary ornament for lassi al logi , whi h would permit\nadventurous in ursions into the domain of omplexity. The logi of the inluded middle is the privileged logi of omplexity, privileged in the sense that\nit allows us to ross the di erent areas of knowledge in a oherent way, by\nenabling a new kind of simpli ity.\nThe logi of the in luded middle does not abolish the logi of the ex luded\nmiddle: it only onstrains its sphere of validity. The logi of the ex luded\nmiddle is ertainly valid for relatively simple situations. On the ontrary, the\nlogi of the ex luded middle is harmful in omplex, transdis iplinary ases.\nFor me, the problem of indetermina y is pre isely belonging to this lass of\nases.\n\n3 The G\u007fodelian unity of the world\nThe transdis iplinary approa h [7℄ sets forth for onsideration a multi-dimensional Reality, stru tured by multiple levels repla ing the single level of lassial thought { one-dimensional reality. This proposal is not enough, by itself,\nto justify a new vision of the world. We must rst of all answer many questions in the most rigorous possible way. What is the nature of the theory\nwhi h an des ribe the passage from one level of Reality to another? Is there\n6\n\n\ftruly a oheren e, a unity of the totality of levels of Reality? What is the\nrole of the subje t-observer of Reality in the dynami s of the possible unity\nof all the levels of Reality? Is there a level of Reality whi h is privileged in\nrelation to all other levels? What is the role of reason in the dynami s of the\npossible unity of knowledge? What is the predi tive power of the new model\nof Reality in the sphere of re e tion and a tion? Finally, is understanding of\nthe present world possible ?\nA ording to our model, Reality omprises a ertain number of levels\n[1,2℄. The onsiderations whi h follow do not depend on whether or not this\nnumber is nite or in nite. For the sake of larity, let us suppose that this\nnumber is in nite.\nTwo adja ent levels are onne ted by the logi of the in luded middle in\nthe sense that the T-state present at a ertain level is onne ted to a pair of\nontradi tories (A and non-A) at the immediately adja ent level. The T-state\noperates the uni ation of ontradi tories A and non-A but this uni ation is\noperated at a level di erent from the one on whi h A and non-A are situated.\nThe axiom of non- ontradi tion is thereby respe ted. Does this fa t signify\nthat we an obtain a omplete theory, whi h will be able to a ount for all\nknown and forth oming results ?\nThere is ertainly a oheren e between di erent levels of Reality, at least\nin the natural world. In fa t, an immense self- onsisten y { a osmi bootstrap { seems to govern the evolution of the universe, from the in nitely\nsmall to the in nitely large, from the in nitely brief to the in nitely long [1℄.\nA ow of information is transmitted in a oherent manner from one level of\nReality to another level of Reality in our physi al universe.\nThe logi of the in luded middle is apable of des ribing the oheren e\nbetween the levels of Reality by an iterative pro ess de ned by the following\nstages: 1. A pair of ontradi tories (A, non-A) situated at a ertain level\nof reality is uni ed by a T-state situated at a ontiguous level of Reality;\n2. In turn, this T-state is linked to a ouple of ontradi tories (A', nonA'), situated at its own level; 3. The pair of ontradi tories (A', non-A')\nis, in its turn, uni ed by a T'-state situated at a di erent level of Reality,\nimmediately ontiguous to that where the ternary (A', non-A', T) is found.\nThe iterative pro ess ontinues inde nitely until all the levels of Reality,\nknown or on eivable, are exhausted.\nIn other terms, the a tion of the logi of the in luded middle on the\ndi erent levels of Reality indu es an open, G\u007fodelian stru ture of the unity of\nlevels of Reality. This stru ture has onsiderable onsequen es for the theory\n7\n\n\fof knowledge be ause it implies the impossibility of a omplete theory, losed\nin upon itself.\nIn e e t, in a ordan e with the axiom of non- ontradi tion, the T-state\nrealizes the uni ation of a pair of ontradi tories (A, non-A) but it is asso iated, at the same time with another pair of ontradi tories (A', non-A'). This\nsigni es that starting from a ertain number of mutually ex lusive pairs one\nan onstru t a new theory whi h eliminates ontradi tions at a ertain level\nof Reality, but this theory is only temporary be ause it inevitably leads, under the joint pressure of theory and experien e, to the dis overy of new levels\nof ontradi tories, situated at a new level of Reality. In turn this theory will\ntherefore be repla ed by still more uni ed theories as new levels of Reality\nare dis overed. This pro ess will ontinue inde nitely without ever resulting\nin a ompletely uni ed theory. The axiom of non- ontradi tion is in reasingly strengthened during this pro ess. In this sense, without ever leading\nto an absolute non- ontradi tion, we an speak of an evolution of knowledge\nwhi h en ompasses all the levels of Reality: knowledge whi h is forever open.\nFiner matter penetrates oarser matter, just as quantum matter penetrates\nma rophysi al matter, but the reverse is not true. Degrees of materiality\nindu e an orienting arrow for tra ing the transmission of information from\none level to the other. This orienting arrow is asso iated with the dis overy\nof more and more general, unifying, and en ompassing laws.\nThe open stru ture of the unity of levels of Reality is in a ord with\none of the most important s ienti results of the 20th entury on erning\narithmeti , the theorem of Kurt G\u007fodel [8℄. G\u007fodel's theorem tells us that\na suAE iently ri h system of axioms inevitably lead to results whi h would\nbe either unde idable or ontradi tory. The impli ations of G\u007fodel's theorem\nhave onsiderable importan e for all modern theories of knowledge. First of\nall it does not only on ern the eld of arithmeti but also all mathemati s\nwhi h in ludes arithmeti . Now, obviously the mathemati s whi h underlies\ntheoreti al physi s in lude arithmeti . This means that all resear h for a\nomplete physi al theory is illusory.\nIn fa t, the sear h for an axiomati system leading to a omplete theory (without unde idable or ontradi tory results) marks at on e the apex\nand the starting point of the de line of lassi al thought. The axiomati\ndream is unraveled by the verdi t of the holy of holies of lassi al thought {\nmathemati al rigor.\nThe theorem that Kurt G\u007fodel demonstrated in 1931 sounded only a faint\ne ho beyond a very limited ir le of spe ialists. The diAE ulty and extreme\n8\n\n\fsubtlety of its demonstration explains why this theorem has taken a ertain\ntime to be understood within the mathemati al ommunity. Today, it has\ns ar ely begun to penetrate the world of physi ists. Wolfgang Pauli, one\nof the founders of quantum me hani s, was one of the rst physi ists to\nunderstand the extreme importan e G\u007fodel's theorem has for the onstru tion\nof physi al theories [9℄.\nThe G\u007fodelian stru ture of the unity of levels of Reality asso iated with\nthe logi of the in luded middle implies that it is impossible to onstru t a\nomplete theory for des ribing the passage from one level to the other and,\na fortiori, for des ribing the unity of levels of Reality.\nIf it does exist, the unity linking all the levels of Reality must ne essarily\nbe an open unity.\nTo be sure, there is a oheren e of the unity of levels of Reality, but we\nmust remember that this oheren e is oriented : there is an arrow asso iated\nwith all transmission of information from one level to the other. As a onsequen e of this, if oheren e is limited only to the levels of Reality, it is stopped\nat the \"highest\" level and at the \"lowest\" level. If we wish to posit the idea\nof a oheren e whi h ontinues beyond these two limited levels so that there\nis an open unity, one must on eive the unity of levels of Reality as a unity\nwhi h is extended by a zone of non-resistan e to our experien es, representations, des riptions, images and mathemati al formalizations. Within our\nmodel of Reality, this zone of non-resistan e orresponds to the \"veil\" whi h\nBernard d'Espagnat referred to as \"the veil of the real\" [10℄. The \"highest\"\nlevel and the \"lowest\" level of the unity of levels of Reality are united a ross\na zone of absolute transparen e. But these two levels are di erent; from\nthe point of view of our experien es, representations, des riptions, images,\nand mathemati al formalizations, absolute transparen e fun tions like a veil.\nIn fa t, the open unity of the world implies that that whi h is \"below\" is\nthe same as that whi h is \"above\". The isomorphism between \"above\" and\n\"below\" is established by the zone of non-resistan e.\nQuite simply, the non-resistan e of this zone of absolute transparen e is\ndue to the limitations of our bodies and of our sense organs, limitations whi h\napply regardless of the instruments of measure used to extend these sense\norgans. To laim that there is an in nite human knowledge (whi h ex ludes\nany zone of non-resistan e), while simultaneously aAErming the limitations\nof our body and our sense organs, seems to us a feat of linguisti sleight of\nhand. The zone of non-resistan e orresponds to the sa red, that is to say to\nthat whi h does not submit to any rationalization.\n9\n\n\fThe unity of levels of Reality and its omplementary zone of non-resistan e\nonstitutes the transdis iplinary Obje t.\nA new Prin iple of Relativity [7℄ emerges from the oexisten e between\nomplex plurality and open unity : no one level of Reality onstitutes a\n\nprivileged pla e from whi h one is able to understand all the other levels of\nReality. A level of Reality is what it is be ause all the other levels exist at the\nsame time. This Prin iple of Relativity is what originates a new perspe tive\non religion, politi s, art, edu ation, and so ial life. In the transdis iplinary\nvision, Reality is not only multi-dimensional, it is also multi-referential.\nThe di erent levels of Reality are a essible to human knowledge thanks\nto the existen e of di erent levels of per eption, whi h are in bi-univo al\norresponden e with levels of Reality. These levels of per eption permit an\nin reasingly general, unifying, en ompassing vision of Reality, without ever\nentirely exhausting it.\nAs in the ase of levels of Reality the oheren e of levels of per eption\npresupposes a zone of non-resistan e to per eption.\nThe unity of levels of per eption and its omplementary zone of nonresistan e onstitutes the transdis iplinary Subje t.\nThe two zones of non-resistan e of transdis iplinary Obje t and Subje t\nmust be identi al in order that the transdis iplinary Subje t an ommuniate with the transdis iplinary Obje t. A ow of ons iousness rossing the\ndi erent levels of per eption in a oherent manner must orrespond to the\now of information rossing the di erent levels of Reality in a oherent manner. The two ows are in a relation of isomorphism thanks to the existen e\nof one and the same zone of non-resistan e. Knowledge is neither exterior\nnor interior: it is at the same time exterior and interior. The study of the\nuniverse and the study of the human being sustain one another. The zone\nof non-resistan e permits the uni ation of the transdis iplinary Subje t and\nthe transdis iplinary Obje t while preserving their di eren e.\nTransdis iplinarity is the transgression of duality opposing binary pairs:\nsubje t/obje t,\nsubje tivity/obje tivity,\nmatter/ ons iousness,\nnature/divine, simpli ity/ omplexity, redu tionism/holism, diversity/unity.\nThis duality is transgressed by the open unity whi h en ompasses both the\nuniverse and the human being.\nThe transdis iplinary model of Reality has, in parti ular, some important onsequen es in the study of omplexity. Without its ontradi tory pole\nof simpli ity (or, more pre isely, simplexity ) omplexity appears as an inreasingly enlarging distan e between the human being and Reality whi h\n10\n\n\fintrodu es a self-destru tive alienation of the human being who is plunged\ninto the absurdity of destiny. The in nite simpli ity of the transdis iplinary\nSubje t orresponds to the in nite omplexity of the transdis iplinary Obje t.\nThe Subje t/Obje t problem was entral for the founding-fathers of quantum me hani s. Pauli, Heisenberg and Pauli, as Husserl, Heidegger and Cassirer refuted the basi axiom of modern metaphysi s: the lear- ut distin tion\nbetween Subje t and Obje t. Our onsiderations here are ins ribed in the\nsame framework.\n\n4 The death and the resurre tion of Nature\nModernity is parti ularly deadly. It has invented all kinds of \"deaths\" and\n\"ends\": the death of God, the death of Man, the end of ideologies, the end\nof history and, today, the end of s ien e [11℄.\nBut, there is a death whi h is spoken of mu h less, on a ount of shame\nor ignoran e : the death of Nature. In my view, this death of Nature is the\nsour e of all the other deadly on epts whi h were just invoked. In any ase,\nthe very word \"Nature\" has ended by disappearing from s ienti vo abulary.\nOf ourse, the \"man in the street\", just as the s ientist (in popularized works)\nstill uses this word, but in a onfused, sentimental way, reminis ent of magi .\nSin e the beginning of time we have not stopped modifying our vision of\nNature [12℄. Historians of s ien e are in a ord in saying that, despite all appearan es to the ontrary, there is not only one vision of Nature a ross time.\nWhat an there be in ommon between the Nature of so- alled \"primitive\"\npeoples, the Nature of the Greeks, the Nature in the time of Galileo, of the\nMarquis de Sade, of Lapla e or of Novalis? The vision of Nature of a given\nperiod depends on the imaginary whi h predominates during that period;\nin turn, that vision depends on a multipli ity of parameters: the degree of\ndevelopment of s ien e and te hnology, so ial organization, art, religion, et .\nOn e formed, an image of Nature exer ises an in uen e on all areas of knowledge. The passage from one vision to another is not progressive, ontinuous {\nit o urs by means of sharp, radi al, dis ontinuous ruptures. Several ontradi tory visions an o-exist. The extraordinary diversity of visions of Nature\nexplains why one annot speak of Nature, but only of a ertain nature in\na ord with the imaginary of a given period.\nThe image of Nature has always had a multiform a tion: it has in uen ed\n11\n\n\fnot only s ien e but also art, religion, and so ial life. This allows us to explain\nsome strange syn hroni ities. Here I limit myself to but a single example:\nthe simultaneous appearan e of the theory of the end of history and of the\nend of s ien e just before the beginning of the 3rd millenium. For example,\nuni ed theories in physi s have as their aim the elaboration of a omplete\napproa h, founded on a unique intera tion, whi h an predi t everything\n(hen e the name, \"Theory of Everything\"). It is quite obvious that if su h a\ntheory were formulated in the future, it would signify the end of fundamental\nphysi s, be ause there would be nothing left to look for. It is interesting to\nobserve that both the idea of the end of history and of the end of s ien e\nhave simultaneously emerged from the \"end of the entury\" imaginary.\nNotwithstanding the abundant and fas inating diversity of images of Nature one an nevertheless distinguish three main stages: Magi Nature, Nature as Ma hine, and the Death of Nature. Magi al thought views nature\nas a living organism, endowed with intelligen e and ons iousness. The fundamental postulate of magi al thought is that of universal interdependen e:\nNature annot be on eived outside of its relations with us. Everything is\nsign, tra e, signature, symbol. S ien e, in the modern sense of this word, is\nsuper uous.\nAt the other extreme, the me hanist and determinist thought of the 18th\nand above all the 19th entury (whi h, by the way, still predominates today) on eives Nature not as an organism, but as a ma hine. It suAE es to\ndisassemble this ma hine pie e by pie e in order to possess it entirely. The\nfundamental postulate of me hanisti and determinist thought is that Nature an be known and onquered by s ienti methodology, de ned in a\nway whi h is ompletely independent of human beings and separate from us.\nThe logi al out ome of the me hanist and determinist vision is the Death\nof Nature, the disappearan e of the on ept of Nature from the s ienti\neld.\nFrom the very beginning of the me hanisti vision, Nature as Ma hine, with\nor without the image of God as wat hmaker, is split up into an ensemble of\nseparate parts. From that moment on, there is no more need for a oherent\nwhole, for a living organism, or even, for a ma hine whi h still kept the musty\nodor of nality. Nature is dead, but omplexity remains. An astonishing\nomplexity (in fa t, often onfused with \" ompli ation\"), whi h penetrates\nea h and every eld of knowledge. But this omplexity is per eived as an\na ident; we ourselves are onsidered to be an a ident of omplexity.\nThe Death of Nature is in ompatible with a oherent interpretation of\nthe results of ontemporary s ien e, in spite of the persisten e of the neo12\n\n\fredu tionisti attitude whi h a ords ex lusive importan e to the fundamental building-blo ks of matter and to the four known physi al intera tions.\nA ording to this neo-redu tionist attitude, all re ourse to Nature is superuous and devoid of sense. In truth, Nature is dead only for a ertain vision\nof the world { the lassi al vision.\nThe rigid obje tivity of lassi al thought is only viable in the lassi al\nworld. The idea of total separation between an observer and a Reality assumed to be ompletely independent from that observer brings us to the\nverge of insurmountable paradoxes. In fa t, a far more subtle notion of obje tivity hara terizes the quantum world: obje tivity depends on the level\nof Reality in question.\nSpa e-time itself no longer rests on a xed on ept. Our spa e-time whi h\npro eeds in four dimensions is not the only on eivable spa e-time. A ording to ertain physi al theories, it appears more an approximation, like a\npart of a spa e-time all the more ri h for being the generator of possible\nphenomena. Supplementary dimensions are not the result of mere intelle tual spe ulation. On the one hand, these dimensions are ne essary to insure\nthe self- onsisten y of the theory and the elimination of ertain undesirable\naspe ts. On the other hand, they do not have a purely formal hara ter {\nthey have physi al onsequen es for our own s ale. For example, a ording\nto ertain osmologi al theories, if the universe had been asso iated from the\n\"beginning\" of the big bang in a multi-dimensional spa e-time, supplementary dimensions would have remained forever hidden, unobservable; rather,\ntheir vestiges would be pre isely the known physi al intera tions. By means\nof generalizing the example provided by parti le physi s, it be omes on eivable that ertain levels of Reality orrespond to a spa e-time di erent than\nthat hara terizing our own level. Moreover, omplexity itself would depend\non the nature of spa e-time as well.\nWe an make, like Heisenberg made [4℄, a step further and assert that the\nlassi al four-dimensional spa e-time is, in fa t, an anthropomorphi on ept,\nfounded on our sense-organs.\nA ording to present s ienti on eptions, matter is far from being identi al with substan e. In the quantum world, matter is asso iated with a\nsubstan e-energy-information-spa e-time omplexus.\nIt is somewhat mysterious why traje tories played su h a entral role\nin the formulation of modern physi s. The quantum indetermina y showed\nthat traje tories are not a fondamental on ept. In more re ent years, a new\ndis ipline is born by the unexpe ted en ounter between the theory of infor13\n\n\fmation and quantum me hani s: the Quantum Theory of Information [13℄.\nThis new-born s ien e already poses a ru ial question : are the information\nlaws more general, and therefore deeper, than the equations of movement?\nAre the entral on epts of positions, speeds and traje tories of parti les to\nbe abandoned in favour of information laws whi h, in fa t, ould be valid not\nonly for physi s but also for other elds of knowledge? There were these last\nyears fabulous experimental advan es in the elds of non-separability, disentaglement, quantum ryptography and teleportation, in onjon tion with the\npossible advent of quantum omputers. This shows that notions like \"levels\nof Reality\" or \"in luded middle\" ease to be just theoreti al spe ulations, by\nentering today in the eld of experiments and, tomorrow, in the everyday\nlife.\nWe an assert that the notion itself of laws of Nature ompletely hanges\nits ontents when ompared with that of the lassi al vision. This situation\nan be summed up by three theses formulated by the well-known physi ist\nWalter Thirring [14℄ :\n1. The laws of any inferior level are not ompletely determined by the laws\nof a superior level. Thus, notions well an hored in lassi al physi s, like \"fundamental\" and \"a idental,\" must be re-examined. That whi h is onsidered\nto be fundamental on one level an appear to be a idental on a superior\nlevel and that whi h is onsidered to be a idental or in omprehensible on a\nertain level an appear to be fundamental on a superior level.\n2. The laws of an inferior level depend more on the ir umstan es of their\nemergen e than on the laws of a superior level. The laws of a ertain level\ndepend essentially on the lo al on guration to whi h these laws refer. There\nis therefore a kind of lo al autonomy of respe tive levels of Reality; however,\nertain internal ambiguities on erning laws of an inferior level of Reality are\nresolved by taking into a ount the laws of a superior level. It is the internal\nonsisten y of laws whi h redu es the ambiguity of laws.\n3. The hierar hy of laws evolves at the same time as the universe itself.\nIn other words, the birth of laws o urs simultaneously with the evolution\nof the universe. These laws pre-exist at the \"beginning\" of the universe as\npotentialities. It is the evolution of the universe whi h a tualizes these laws\nand their hierar hy. A transdis iplinary model of Nature must integrate all\nthis new knowledge of the emergent hara teristi s of the physi al universe.\nThe Thirring's des ription of the laws of Nature is in perfe t agreement\nwith our own onsiderations about the G\u007fodelian stru ture of Nature and\nknowledge. The problem of quantum indetermina y an now be fully under14\n\n\fstood as the in uen e of the quantum level of Reality on our own ma rophysi al level of Reality. Of ourse, the laws of the ma rophysi al level depend\nmore, as Thirring writes, on \"the ir umstan es of their emergen e\". From\nthe point of view of the ma rophysi al level indetermina y appears as a idental, in omprehensible, or at most as a rare event. But this reveals,\nin fa t, an internal ambiguity whi h an be solved only by taking into a ount the laws of the quantum level. At this last level the indetermina y is\nfundamental.\nOne an ask if one an not logi ally on eive a generalized indetermina y,\nwhi h goes far beyond the problem of traje tories of parti les. Heisenberg\nalready onsidered the indetermina y of language [4℄ : the natural language\nan not express with arbitrary high pre ision all its elements, be ause the\nway of expressing a ts in an essential manner on what is expressed. The\nindetermina y of the natural language is just one example of the generalized\nindetermina y generated by the G\u007fodelian stru ture of Nature and knowledge.\nIn on lusion, we an distinguish three major aspe ts of Nature in a ordan e with the transdis iplinary model of Reality :\n(1) Obje tive Nature, whi h is onne ted with the natural properties of\nthe transdis iplinary Obje t; obje tive Nature is subje t to subje tive obje tivity. This obje tivity is subje tive to the extent that the levels of Reality\nare onne ted to levels of per eption. Nevertheless emphasis here is on obje tivity, to the extent to whi h the methodology employed is that of s ien e.\n2) Subje tive Nature, whi h is onne ted with the natural properties of the\ntransdis iplinary Subje t; subje tive Nature is subje t to obje tive subje tivity. This subje tivity is obje tive to the extent that the levels of per eption\nare onne ted to levels of Reality. Nevertheless, emphasis here is on subje tivity, to the extent to whi h the methodology is employed is that of the\nan ient s ien e of being, whi h rosses all the traditions and religions of the\nworld.\n3) Trans-Nature, whi h is onne ted with a similarity in Nature whi h exists between the transdis iplinary Obje t and the transdis iplinary Subje t.\nTrans-Nature on erns the domain of the sa red. It annot be approa hed\nwithout onsidering the other two aspe ts of Nature at the same time.\nTransdis iplinary Nature has a ternary stru ture (obje tive Nature, subje tive Nature, trans-Nature), whi h de nes living Nature. This Nature is\nliving be ause it is there that life is present in all its degrees and be ause its\nstudy demands the integration of lived experien e. The three aspe ts of Nature must be onsidered simultaneously in terms of their inter-relation and\n15\n\n\ftheir onjun tion within all the phenomena of living Nature [15℄.\nThe study of living Nature asks for a new methodology { transdis iplinary\nmethodology [7℄ { whi h is di erent from the methodology of modern s ien e\nand the methodology of the an ient s ien e of being. It is the o-evolution\nof the human being and of the universe whi h asks for a new methodology.\nAn attempt to elaborate a new Philosophy of Nature, a privileged mediator of a dialogue between all the areas of knowledge, is one of the highest\npriorities of transdis iplinarity.\n\nReferen es\n[1℄ Basarab Ni oles u, Nous, la parti ule et le monde, Le Mail, Paris, 1985.\n[2℄ Basarab Ni oles u, Levels of Complexity and Levels of Reality, in \"The\nEmergen e of Complexity in Mathemati s, Physi s, Chemistry, and Biology\", Pro eedings of the Plenary Session of the Ponti al A ademy\nof S ien es, 27-31 O tober 1992, Casina Pio IV, Vati an, Ed. Ponti ia\nA ademia S ientiarum, Vati an City, 1996 (distributed by Prin eton University Press), edited by Bernard Pullman; Basarab Ni oles u, G\u007fodelian\nAspe ts of Nature and Knowledge, in \"Systems - New Paradigms for the\nHuman S ien es\", Walter de Gruyter, Berlin - New York, 1998, edited by\nGabriel Altmann and Walter A. Ko h ; Mi hel Camus, Thierry Magnin,\nBasarab Ni oles u and Karen-Claire Voss, Levels of Representation and\n\nLevels of Reality : Towards an Ontology of S ien e, in The Con ept of Na\u0013\nture in S ien e and Theology (part II), Editions\nLabor et Fides, Gen\u0012eve,\n1998, pp. 94-103, edited by Niels H. Gregersen, Mi hael W.S. Parsons\nand Christoph Wassermann.\n\n[3℄ Edmund Husserl, M\u0013editations art\u0013esiennes, translated form German by\nGabrielle Pei er and Emmanuel Levinas, Vrin, Paris, 1966.\n[4℄ Werner Heisenberg, Philosophie - Le manus rit de 1942, Seuil, Paris,\n1998, translation from German and introdu tion by Catherine Chevalley.\n16\n\n\f[5℄ T.A. Brody, On Quantum Logi , in Foundation of Physi s, vol. 14, n 5,\n1984, pp. 409-430.\n[6℄ St\u0013ephane Lupas o, Le prin ipe d'antagonisme et la logique de l'\u0013energie,\nLe Ro her, Paris, 1987 (2nd edition), foreword by Basarab Ni oles u ;\nSt\u0013ephane Lupas o - L'homme et l'oeuvre, Le Ro her, Paris, oll. \"Transdis iplinarit\u0013e\", 1999, under the dire tion of Horia Bades u and Basarab\nNi oles u.\n[7℄ Basarab Ni oles u, La transdis iplinarit\u0013e, manifeste, Le Ro her, Paris,\noll. \"Transdis iplinarit\u0013e\", 1996. The word \"transdis iplinarity\", as arrying a di erent meaning from \"interdis iplinarity\", was rst introdu ed in\n1970 by Jean Piaget in L'interdis iplinarit\u0013e - Probl\u0012emes d'enseignement\net de re her he dans les universit\u0013es, OCDE, Paris, 1972. From etymologi al point of view \"trans\" means \"between, a ross, beyond\". We mean\nby \"transdis iplinarity\" that whi h rosses all dis iplines and nds itself\nbetween and beyond all dis iplines. Therefore the transdis iplinarity is\nlearly not a new dis ipline. See also the Internet site of the International Center for Transdis iplinary Resear h (CIRET) http://perso. lubinternet.fr/ni ol/ iret/ (materials in Fren h, English, Portuguese and\nSpanish).\n[8℄ See, for example, Ernest Nagel and James R. Newman, G\u007fodel's Proof,\nNew York University Press, New York, 1958; Hao Wang, A Logi al\nJourney - From G\u007fodel to Philosophy, The MIT Press, Cambridge, Massa husetts - London, England, 1996.\n[9℄ Wolfgang Pauli, Writings on Physi s and Philosophy, Springer-Verlag,\nBerlin-Heidelberg, Germany, 1994, edited by Charles P. Enz and Karl\nvon Meyenn, translated by Robert S hlapp; K.V. Laurikainen, Beyond the\nAtom - The Philosophi al Thought of Wolfgang Pauli, Springer - Verlag,\nBerlin - Heidelberg, Germany, 1988.\n[10℄ Bernard d'Espagnat, Le r\u0013eel voil\u0013e - Analyse des on epts quantiques,\nFayard, Paris, 1994.\n[11℄ John Horgan, The End of S ien e, Broadway Books, New York, 1997.\n[12℄ Robert Lenoble, Histoire de l'id\u0013ee de Nature, Albin Mi hel, Paris, oll.\n\"L'\u0013evolution de l'humanit\u0013e\", 1990.\n17\n\n\f[13℄ See, for example, David Deuts h, The Fabri of Reality, Penguin Books,\nLondon, England, 1997.\n[14℄ Walter Thirring, Do the laws of Nature evolve ?, in What is life ? The Next Fifty Years: Spe ulations on the Future of biology, Cambridge\nUniversity Press, USA, 1995, edited by Mi hael P. Murphy and Luke A.\nO'Neil.\n[15℄ In fa t the term \"living Nature\" is a pleonasm, be ause the word \"Nature\" is intimately linked to that of \"birth.\" The root of the Latin word,\nnatura is nas i and designates the a tion of giving birth as well as the\nfeminine organs of generation.\n\n18\n\n\f"}