{"id": "http://arxiv.org/abs/quant-ph/0202080v1", "guidislink": true, "updated": "2002-02-14T18:02:45Z", "updated_parsed": [2002, 2, 14, 18, 2, 45, 3, 45, 0], "published": "2002-02-14T18:02:45Z", "published_parsed": [2002, 2, 14, 18, 2, 45, 3, 45, 0], "title": "Reconstruction of motional states of neutral atoms via MaxEnt principle", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=quant-ph%2F0202117%2Cquant-ph%2F0202030%2Cquant-ph%2F0202027%2Cquant-ph%2F0202048%2Cquant-ph%2F0202070%2Cquant-ph%2F0202159%2Cquant-ph%2F0202026%2Cquant-ph%2F0202052%2Cquant-ph%2F0202120%2Cquant-ph%2F0202087%2Cquant-ph%2F0202098%2Cquant-ph%2F0202113%2Cquant-ph%2F0202088%2Cquant-ph%2F0202121%2Cquant-ph%2F0202104%2Cquant-ph%2F0202122%2Cquant-ph%2F0202111%2Cquant-ph%2F0202138%2Cquant-ph%2F0202137%2Cquant-ph%2F0202124%2Cquant-ph%2F0202144%2Cquant-ph%2F0202170%2Cquant-ph%2F0202084%2Cquant-ph%2F0202131%2Cquant-ph%2F0202033%2Cquant-ph%2F0202059%2Cquant-ph%2F0202107%2Cquant-ph%2F0202078%2Cquant-ph%2F0202171%2Cquant-ph%2F0202156%2Cquant-ph%2F0202022%2Cquant-ph%2F0202125%2Cquant-ph%2F0202145%2Cquant-ph%2F0202164%2Cquant-ph%2F0202057%2Cquant-ph%2F0202069%2Cquant-ph%2F0202151%2Cquant-ph%2F0202134%2Cquant-ph%2F0202157%2Cquant-ph%2F0202005%2Cquant-ph%2F0202096%2Cquant-ph%2F0202091%2Cquant-ph%2F0202173%2Cquant-ph%2F0202068%2Cquant-ph%2F0202169%2Cquant-ph%2F0202075%2Cquant-ph%2F0202021%2Cquant-ph%2F0202016%2Cquant-ph%2F0202163%2Cquant-ph%2F0202039%2Cquant-ph%2F0202051%2Cquant-ph%2F0202143%2Cquant-ph%2F0202135%2Cquant-ph%2F0202002%2Cquant-ph%2F0202130%2Cquant-ph%2F0202086%2Cquant-ph%2F0202082%2Cquant-ph%2F0202061%2Cquant-ph%2F0202034%2Cquant-ph%2F0202100%2Cquant-ph%2F0202040%2Cquant-ph%2F0202126%2Cquant-ph%2F0202099%2Cquant-ph%2F0202079%2Cquant-ph%2F0202064%2Cquant-ph%2F0202166%2Cquant-ph%2F0202106%2Cquant-ph%2F0202080%2Cquant-ph%2F0202056%2Cquant-ph%2F0202133%2Cquant-ph%2F0202028%2Cquant-ph%2F0202128%2Cquant-ph%2F0202092%2Cquant-ph%2F0202085%2Cquant-ph%2F0202074%2Cquant-ph%2F0202049%2Cquant-ph%2F0202046%2Cquant-ph%2F0202029%2Cquant-ph%2F0202147%2Cquant-ph%2F0202146%2Cquant-ph%2F0202036%2Cquant-ph%2F0202093%2Cquant-ph%2F0202110%2Cquant-ph%2F0202175%2Cquant-ph%2F0202008%2Cquant-ph%2F0202060%2Cquant-ph%2F0202077%2Cquant-ph%2F0202006%2Cquant-ph%2F0202045%2Cquant-ph%2F0202053%2Cquant-ph%2F0202161%2Cquant-ph%2F0202007%2Cquant-ph%2F0202116%2Cquant-ph%2F0202150%2Cquant-ph%2F0202148%2Cquant-ph%2F0202013%2Cquant-ph%2F0202140%2Cquant-ph%2F0202142%2Cquant-ph%2F0202035%2Cquant-ph%2F0202090%2Cquant-ph%2F0202047&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Reconstruction of motional states of neutral atoms via MaxEnt principle"}, "summary": "We present a scheme for a reconstruction of states of quantum systems from\nincomplete tomographic-like data. The proposed scheme is based on the Jaynes\nprinciple of Maximum Entropy. We apply our algorithm for a reconstruction of\nmotional quantum states of neutral atoms. As an example we analyze the\nexperimental data obtained by the group of C. Salomon at the ENS in Paris and\nwe reconstruct Wigner functions of motional quantum states of Cs atoms trapped\nin an optical lattice.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=quant-ph%2F0202117%2Cquant-ph%2F0202030%2Cquant-ph%2F0202027%2Cquant-ph%2F0202048%2Cquant-ph%2F0202070%2Cquant-ph%2F0202159%2Cquant-ph%2F0202026%2Cquant-ph%2F0202052%2Cquant-ph%2F0202120%2Cquant-ph%2F0202087%2Cquant-ph%2F0202098%2Cquant-ph%2F0202113%2Cquant-ph%2F0202088%2Cquant-ph%2F0202121%2Cquant-ph%2F0202104%2Cquant-ph%2F0202122%2Cquant-ph%2F0202111%2Cquant-ph%2F0202138%2Cquant-ph%2F0202137%2Cquant-ph%2F0202124%2Cquant-ph%2F0202144%2Cquant-ph%2F0202170%2Cquant-ph%2F0202084%2Cquant-ph%2F0202131%2Cquant-ph%2F0202033%2Cquant-ph%2F0202059%2Cquant-ph%2F0202107%2Cquant-ph%2F0202078%2Cquant-ph%2F0202171%2Cquant-ph%2F0202156%2Cquant-ph%2F0202022%2Cquant-ph%2F0202125%2Cquant-ph%2F0202145%2Cquant-ph%2F0202164%2Cquant-ph%2F0202057%2Cquant-ph%2F0202069%2Cquant-ph%2F0202151%2Cquant-ph%2F0202134%2Cquant-ph%2F0202157%2Cquant-ph%2F0202005%2Cquant-ph%2F0202096%2Cquant-ph%2F0202091%2Cquant-ph%2F0202173%2Cquant-ph%2F0202068%2Cquant-ph%2F0202169%2Cquant-ph%2F0202075%2Cquant-ph%2F0202021%2Cquant-ph%2F0202016%2Cquant-ph%2F0202163%2Cquant-ph%2F0202039%2Cquant-ph%2F0202051%2Cquant-ph%2F0202143%2Cquant-ph%2F0202135%2Cquant-ph%2F0202002%2Cquant-ph%2F0202130%2Cquant-ph%2F0202086%2Cquant-ph%2F0202082%2Cquant-ph%2F0202061%2Cquant-ph%2F0202034%2Cquant-ph%2F0202100%2Cquant-ph%2F0202040%2Cquant-ph%2F0202126%2Cquant-ph%2F0202099%2Cquant-ph%2F0202079%2Cquant-ph%2F0202064%2Cquant-ph%2F0202166%2Cquant-ph%2F0202106%2Cquant-ph%2F0202080%2Cquant-ph%2F0202056%2Cquant-ph%2F0202133%2Cquant-ph%2F0202028%2Cquant-ph%2F0202128%2Cquant-ph%2F0202092%2Cquant-ph%2F0202085%2Cquant-ph%2F0202074%2Cquant-ph%2F0202049%2Cquant-ph%2F0202046%2Cquant-ph%2F0202029%2Cquant-ph%2F0202147%2Cquant-ph%2F0202146%2Cquant-ph%2F0202036%2Cquant-ph%2F0202093%2Cquant-ph%2F0202110%2Cquant-ph%2F0202175%2Cquant-ph%2F0202008%2Cquant-ph%2F0202060%2Cquant-ph%2F0202077%2Cquant-ph%2F0202006%2Cquant-ph%2F0202045%2Cquant-ph%2F0202053%2Cquant-ph%2F0202161%2Cquant-ph%2F0202007%2Cquant-ph%2F0202116%2Cquant-ph%2F0202150%2Cquant-ph%2F0202148%2Cquant-ph%2F0202013%2Cquant-ph%2F0202140%2Cquant-ph%2F0202142%2Cquant-ph%2F0202035%2Cquant-ph%2F0202090%2Cquant-ph%2F0202047&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We present a scheme for a reconstruction of states of quantum systems from\nincomplete tomographic-like data. The proposed scheme is based on the Jaynes\nprinciple of Maximum Entropy. We apply our algorithm for a reconstruction of\nmotional quantum states of neutral atoms. As an example we analyze the\nexperimental data obtained by the group of C. Salomon at the ENS in Paris and\nwe reconstruct Wigner functions of motional quantum states of Cs atoms trapped\nin an optical lattice."}, "authors": ["Gabriel Drobny", "Vladimir Buzek"], "author_detail": {"name": "Vladimir Buzek"}, "author": "Vladimir Buzek", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevA.65.053410", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/quant-ph/0202080v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/quant-ph/0202080v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/quant-ph/0202080v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/quant-ph/0202080v1", "arxiv_comment": null, "journal_reference": null, "doi": "10.1103/PhysRevA.65.053410", "fulltext": "Reconstruction of motional states of neutral atoms via MaxEnt principle\nGabriel Drobný1 and Vladimı́r Bužek1,2\n1\n\nResearch Center for Quantum Information, Slovak Academy of Sciences, Dúbravská cesta 9, 842 28 Bratislava, Slovakia\n2\nFaculty of Informatics, Masaryk University, Botanická 68a, 602 00 Brno, Czech Republic\n(2 January 2002)\n\narXiv:quant-ph/0202080v1 14 Feb 2002\n\nWe present a scheme for a reconstruction of states of quantum systems from incomplete\ntomographic-like data. The proposed scheme is based on the Jaynes principle of Maximum Entropy. We apply our algorithm for a reconstruction of motional quantum states of neutral atoms.\nAs an example we analyze the experimental data obtained by the group of C. Salomon at the ENS\nin Paris and we reconstruct Wigner functions of motional quantum states of Cs atoms trapped in\nan optical lattice.\n\nI. INTRODUCTION\n\nA reconstruction of states of quantum systems from experimental data represents an important tool for a verification\nof predictions of quantum theory. It also allows us to check the fidelity of quantum state preparation as well to study\nthe fidelity of processing of information encoded in states of quantum systems. Complementary, discrepancies between\nestimated (reconstructed) states based on the measured data and theoretical predictions can serve as an indicator of\nvarious noise sources which occur during the quantum information processing or in the measurement of quantum states.\nWithout a priori assumptions about the character of physical processes and properties of reconstruction schemes the\nreconstruction cannot distinguish between imperfections related to an incoherent quantum state processing and nonideal measurements [1]. Determination of limits for coherent control of quantum degrees of freedom or identification\nof sources of decoherence are essential for systems which are considered for quantum computing and information\nprocessing [2].\nIn atomic optics a highly coherent control of motional degrees of freedom has been achieved for trapped ions [3]\nand recently also for neutral atoms [4,5]. Cold atoms can be cooled into specific quantum states within micro-wells\nof an optical lattice which is induced by laser beams. Cold neutral atoms in optical lattices represent a promising\nsystem for quantum information processing. To verify a degree (fidelity) of coherent control over motional degrees of\nfreedom of neutral atoms a reconstruction of their motional quantum states from measured data has to be considered.\nWe develop a reconstruction procedure based on the Jaynes principle of Maximum Entropy (MaxEnt) [6–8] to achieve\nthis goal. This scheme allows us to perform a state reconstruction from the experimental data obtained at the ENS\nin Paris.\nIn Section II we present a brief description of the reconstruction procedure of a density operator of a quantum system\nbased on the Jaynes principle of Maximum Entropy. In Section III we utilize the MaxEnt principle for development\nof the reconstruction scheme of motional states of atoms and we perform numerical tests of our approach in Section\nIII. Our reconstruction scheme is applied to the experimental data in Section IV.\n\nII. MAXENT PRINCIPLE AND RECONSTRUCTION OF DENSITY OPERATORS\n\nLet us assume a set of observables Ĝν (ν = 1, . . . , n) associated with the quantum system under consideration.\nThis system is prepared in an unknown state ρ̂. Let us assume that from a measurement performed over the system\nmeanvalues Gν of the observables Ĝν are found. The task is to determine (estimate) the unknown state of the quantum\nsystem based on the results of the measurement. Providing the set of the observables Ĝν is not equal to the quorum\n(i.e., the complete set of system observables [9]), then the measured meanvalues do not determine the state uniquely.\nSpecifically, there is a large number of density operators which fulfill the conditions\nTr ρ̂{Ĝ} = 1,\nTr (ρ̂{Ĝ} Ĝν ) = Gν , ν = 1, 2, ..., n ,\n\n(2.1)\n\nthat is, the the normalization condition and the constraints imposed by the results of the measurement. To estimate\nthe unknown density operator in the most reliable way we utilize the Jaynes principle of maximum entropy (MaxEnt\n1\n\n\fprinciple) [6–8,10] according to which among those operators which fulfill the constraints (2.1) the most reliable\nreconstruction (estimation) ρ̂r is the one with the maximal value of the von Neumann entropy S(ρ̂) = −Tr(ρ̂ ln ρ̂):\ni\nh\n(2.2)\nS(ρ̂r ) = max S(ρ̂{Ĝ} ); ∀ρ̂{Ĝ} .\nAs shown by E.Jaynes [6] The operator which fulfills the constraints (2.1) and simultaneously maximizes the von\nNeumann entropy can be expressed in the generalized canonical form\nX\n1\nexp (−\n(2.3)\nρ̂r =\nλν Ĝν );\nZ{Ĝ}\nν\nwhere\nZ{Ĝ} (λ1 , ..., λn ) = Tr[exp(−\n\nX\n\nλν Ĝν )],\n\n(2.4)\n\nν\n\nis the generalized partition function and λν are the Lagrange multipliers. The Lagrange multipliers λν are chosen\nso that the density operator (2.3) fulfills the constraints (2.1) imposed by the results of the measurement. It is then\nobvious that the meanvalues Gν which determine the density operator are related to the Lagrange multipliers via the\nderivatives of the partition function\nGν = Tr(ρ̂r Ĝν ) = −\n\n∂\nln Z{Ĝ} (λ1 , ..., λn ).\n∂λν\n\n(2.5)\n\nIf we solve the last equation with respect to the Lagrange multipliers we can express them in terms of the measured\nmeanvalues\nλν = λν (G1 , ..., Gn ).\n\n(2.6)\n\nWhen we substitute the Lagrange multipliers (2.6) into the expression for the generalized canonical density operator\n(2.3) we obtain the explicit expression for the reconstructed (estimated) density operator.\nAs a typical example of the application of the MaxEnt principle we can consider a measurement of a single-mode\nelectromagnetic field, modeled as a harmonic oscillator. Imagine, that as a result of the measurement we know the\nmean photon number n̄ in the given field mode. Certainly, there are (infinitely) many quantum states of a single-mode\nelectromagnetic field (e.g., a Fock state, a coherent state, a squeezed state, etc.) with the given mean photon number.\nSo the question is: Which is the best (most reliable) estimation of the measured state given the mean photon number\nis known? The mean photon number is in some sense the least available information about the measured state.\nConsequently, the state is least determined. On the other, pure states are completely determined which is reflected\nby the fact that they have a zero von Neumann entropy. Therefore we expect that the most reliable reconstruction\nin the given case is a statistical mixture which is determined just by a single parameter - the mean photon number.\nIt is well known that a statistical mixture which is parametrized just by a single parameter is a thermal state. This\nstatistical mixture of Fock states is characterized by a temperature, or the corresponding mean photon number. In\naddition, for a given temperature (mean photon number) the thermal state exhibits the largest von Neumann entropy.\nConsequently, from the Jaynes principle of the maximum entropy it follows that if from a measurement only a mean\nphoton number is known that the most reliable estimation of the measured state is the thermal state.\nThe MaxEnt principle is not the only criterion how to choose an appropriate density operator among those ρ̂{Ĝ}\nwhich fulfill the constraints (2.1). Based on an intuition or some addition a priori knowledge one can apply other\ncriteria. For example, the maximum likelihood principle has been adopted successfully for estimation of quantum\nstates [12]. Although this reconstruction scheme can result in nonphysical estimations (e.g., density operators which\nare not properly normalized, etc). In general, a consistent reconstruction scheme has to avoid nonphysical results\n(e.g. occurrence of negative probabilities). In the MaxEnt reconstruction a physical estimate is guaranteed by the\ncanonical form of the density operator (2.3). The MaxEnt principle is the most conservative assignment in the sense\nthat it does not permit one to draw any conclusions not warranted by the data. From this point of view the MaxEnt\nprinciple has a very close relation (or can be understood as the generalization) of the Laplace's principle of indifference\nwhich states that where nothing is known one should choose a constant valued function to reflect this ignorance. Then\nit is just a question how to quantify a degree of this ignorance. If we choose an entropy to quantify the ignorance,\nthen the relation between the Laplace's indifference principle and the Jaynes principle of the Maximum Entropy is\ntransparent, i.e. for a constant-valued probability distribution the entropy takes its maximum value.\nThe MaxEnt reconstruction has been applied for various quantum systems, such as light field mode, spin systems\n[11]. In what follows we adopt it for the reconstruction of vibrational states of neutral atoms. We assume the\nexperimental setup realized by the group of C. Salomon at the ENS in Paris [4,5].\n2\n\n\fIII. RECONSTRUCTION OF MOTIONAL STATES OF NEUTRAL ATOMS\n\nRecently, experimental manipulations of motional quantum states of neutral atoms have been reported by the group\nof C. Salomon in Paris [4,5]. Cold Cs atoms can be cooled into specific quantum states of a far detuned 1D optical\nlattice. The optical lattice is induced by the interference of two laser beams. Along the vertical z axis a periodic\npotential of \"harmonic\" micro-wells is produced with a period of 665 nm and with an amplitude of about 0.2 μK [5].\nThe vertical oscillation frequency in ap\nmicro-well at the center of the trappis ωz /2π = 85 kHz. The corresponding\nground state has the rms size ∆z0 = h̄/2mωz ≈ 21 nm and ∆p0 /m = h̄ωz /2m ≈ 11 mm/s is its rms velocity\nwidth. The trapped cloud of neutral Cs atoms has a nearly Gaussian shape with a vertical rms size ∆ξ0 = 53 μm.\nWith the help of deterministic manipulations the neutral atoms can be prepared in non-classical 1D motional states\nalong the vertical axis such as squeezed states, number states, or specific superpositions of number states [5]. The\nmeasurement of the prepared quantum state ρ̂ is performed as follows: The system is evolved within the harmonic\npotential during the time τ . Then the lasers are turned off and the system undergoes the ballistic expansion (BE).\nAfter the time of flight T = 8.7 ms a 2D absorption image of the cloud is taken in 50 μs with a horizontal beam [5].\nIntegration of 2D absorption images in the horizontal direction gives us the spatial distribution along the vertical z\naxis. Therefore we will consider only 1D quantum-mechanical system along the vertical axis.\nTo confirm that a desired quantum state has been obtained (engineered) one can compare the spatial distributions\nalong the vertical axis with the predicted ones. The coincidence of these spatial distributions is a necessary but not\nthe sufficient requirement. A complete verification of the fidelity of the preparation of desired quantum states requires\na quantum state reconstruction procedure. In order to perform this task we adopt the MaxEnt principle [11]. To do\nso we utilize a close analogy between quantum homodyne tomography [14] and the BE absorption imaging for the\ncase of the point-like cloud (with the rms size equal to zero).\nA. Quantum tomography via MaxEnt principle\n\nQuantum tomography is based on the inverse Radon transformation\nof the the measured probability density distri\u0001\nbutions wρ̂ (xθ ) for rotated quadratures x̂θ = √12 âe−iθ + â† eiθ [13,14]. These distributions can be represented as a\nresult of the measurement of the continuous set of projectors |xθ ihxθ |. Based on the measurement of the distributions\nwρ̂ (xθ ) for all values of θ ∈ [0, π] we can formally reconstruct the density operator according to the formula [15]\n\u0014 Z π\n\u0015\nZ ∞\n1\nexp −\ndθ\ndxθ |xθ ihxθ |λ(xθ ) ,\n(3.1)\nρ̂r =\nZ0\n0\n−∞\nwhere the Lagrange multipliers λ(xθ ) are given by an infinite set of equations\n√\nwρ̂ (xθ ) = 2πhxθ |ρ̂r |xθ i;\n∀xθ ∈ (−∞, ∞).\n\n(3.2)\n\nIf the distributions wρ̂ (xθ ) are measured for all values of xθ and all angles θ then the density operator ρ̂r is reconstructed\nprecisely and is equal to density operator obtained with the help of the inverse Radon transformation or with the help\nof the pattern functions (for more details see [15]).\nIn practical experimental situation (e.g., see the experiments by Raymer et al. [16] and by Mlynek et al. [17])\nit is impossible to measure the distributions wρ̂ (xθ ) for all values of xθ and all angles θ. What is measured are\ndistributions (histograms) for finite number Nθ quadrature angles θ and the finite number Nx of \"bins\" for quadrature\noperators. This means that practical experiments are associated with an observation level specified by a finite number\nof observables\n(j)\n\n(j)\n\nF̂jk = |xθk ihxθk |\n\n(3.3)\n\nwith the number of quadrature angles equal to Nθ and the number of bins for each quadrature equal to Nx . We\ncan therefore assume that from the measurement of the observables F̂jk the meanvalues F jk are determined (these\nmeanvalues correspond to \"discretized\" quadrature distributions). In addition it is usually the case that the mean\nexcitation number of the state is known (measured) as well.\nThe operators F̂jk together with n̂ form a specific observation level corresponding to the incomplete tomographic\nmeasurement. In this case we can express the generalized canonical density operator in the form\n\n\nNθ\nNx X\nX\n1\nρ̂r = exp −λn n̂ −\n(3.4)\nλj,k F̂jk \nZ\nj=1\nk=1\n\n3\n\n\fThe knowledge of the mean photon number is essential for the MaxEnt reconstruction because it formally regularizes\nthe MaxEnt reconstruction scheme (the generalized partition function is finite in this case).\n\nB. Motional states of atoms via MaxEnt principle: Formalism\n\nIn the quantum homodyne tomography the probability distributions are measured for the rotated quadrature\noperators x̂θ . The annihilation and creation operators of motional quanta, â and â† , are related to the position\nand momentum operators, ẑ and p̂, via expressions ẑ = √12 (â + â† ) and p̂ = √12 i(â − â† ), respectively. The angle\nθ of the quadrature operator corresponds to ωz τ and vertical \"cuts\" of the absorption images (taken after the BE)\ncan be associated with quadrature probability distributions. However, for a real physical situation with a nonzero\nrms size of the cloud the vertical \"cuts\" of absorption images correspond to a coarse-grained quadrature probability\ndistributions. In particular, the vertical cuts of measured absorption images (taken in 2D) give us (after integration\nalong the horizontal direction) the spatial distribution along the vertical axis. The spatial distribution along the\nvertical z axis can be expressed as\nZ\n−1\nF τ (z) = T\nF0 (ξ0 )Pτ ((z − ξ0 )/T )dξ0 ,\n(3.5)\nwhere F0 (ξ0 ) is the initial spatial distribution of the cloud in the z-direction (i.e., a Gaussian distribution with the\nrms size ∆ξ0 ). The function Pτ (v) denotes the velocity probability distribution of the measured quantum state which\nhas been evolved for time τ in the harmonic potential before the BE, i.e.\nPτ (v) = |hv|ψ(τ )i|2 ,\n\n|ψ(τ )i = Û (τ )|ψ(0)i.\n\n(3.6)\n\nHere Û (τ ) = exp(−iĤτ /h̄) represents the time-evolution operator for the harmonic oscillator with the Hamiltonian\nĤ = p̂2 /2m + mωz2 ẑ 2 /2. Now we can treat the measured \"cuts\" as the mean values of specific observables: F τ (z) =\nTr [ρ̂F̂τ (z)]. In practice just a few discrete times τj (j = 1, . . . , Nτ ) are considered and the z coordinate is discretized\ninto the bins zk (k = −Nz , . . . , Nz ) of a given resolution ∆z. The set of operators which enters the equation (3.4) for\nthe MaxEnt reconstruction then takes the form\n\u001d\u001c\nZ\nzk − ξ0\nzk − ξ0\n−1\n†\nF̂τj (zk ) = T\nF0 (ξ0 )Û (τj )\nÛ (τj )dξ0\n(j = 1, . . . , Nτ ; k = −Nz , . . . , Nz ).\n(3.7)\nT\nT\nWe have already commented that the operator of mean phonon number n̂ is added to the set of observables {F̂τj (zk )}.\nKnowledge of the mean excitation number n̄ is essential in the case of an incomplete set of observables [11]. Knowledge\nof the mean excitation number leads to a natural \"truncation\" of the Hilbert space. The inclusion of the mean phonon\nnumber into the MaxEnt reconstruction scheme does not represent its limitation as the mean energy represents one\nof basic characteristics of any system which should be inferred from the measurement.\nThe experimental \"cuts\" of the BE absorption images [F̂τj (z)] can be taken at few selected times, for example\nωz τj = 0, π/4, π/2, 3π/4 (Nτ = 4). To perform the reconstruction we have to determine the Lagrange multipliers\n{λj,k } and λn associated with {F̂τj (zk )} and n̂, respectively, in the expression for the generalized canonical density\noperator (3.4). The Lagrange multipliers can be determined via the minimization of a deviation function ∆F with\nrespect to the measured data, i.e.\n∆F =\n\nX\nj,k\n\nn\n\u0011o2\n\u0010\nwj,k F τj (zk ) − Tr ρ̂r F̂τj (zk )\n2\n\n+ wn̄ {n̄ − Tr (ρ̂r n̂)} .\n\n(3.8)\n\nHere {wj,k } and wn̄ represent positive weight factors for particular observables. Without any prior knowledge about\nthe state we can take for simplicity wi,j = 1. The weight factor wn̄ associated with the mean phonon number can\nbe chosen according to our preference either to fit better the \"cuts\" of the BE images or the mean phonon number.\nIn the case of the perfect measurement and the complete reconstruction the result has to be independent of the\nchoice of the weight factors (in this case we can take wn̄ = 1). The weight factors could be also associated with the\nprior information about the dispersion of the measured observables. In particular, the weight factors can be taken as\nwν ∼ σν−2 to reflect the knowledge of variances σν for the measured observables Ĝν . When the mean values of the\nobservables for the MaxEnt estimate ρ̂r fit within desired interval Gν ± σν then contributions of the observables to\n4\n\n\fthe deviation function ∆F are of the same order (∼ 1). However, in our case we do not assume the knowledge of\nvariances for the measured discretized probability distributions (taking wν = 1).\nOnce the Lagrange multipliers are numerically fitted, the result of the reconstruction – the generalized canonical\ndensity operator ρ̂r – can be visualized, for example, via the corresponding Wigner function [18] which can be defined\nas a particular Fourier transform of the density operator ρ̂ of a harmonic oscillator expressed in the basis of the\neigenvectors |qi of the position operator q̂:\nZ ∞\nWρ̂ (q, p) ≡\ndζhq − ζ/2|ρ̂|q + ζ/2ieipζ .\n(3.9)\n−∞\n\nC. Numerical simulation\n\nTo test our reconstruction procedure\n√ let us consider the reconstruction of the Wigner function of the motional\nquantum state |ψ(0)i = (|0i + |1i)/ 2 of Cs atoms trapped in the optical lattice. This kind of states has been\ndemonstrated in recent experiments [5]. We assume the following setup parameters: ωz /2π = 80 kHz, the rms size\nof the ground state ∆z0 = 22 nm, the rms velocity width ∆p0 /m = 11 mm/s and the rms width of the cloud of the\natoms about 60 μm. Before BE (with BE time T = 8.7 ms) the atoms evolve within the harmonic trapping potential\nfor τ = 0, 1.6, 3.2, 4.8 μs. As the input for the reconstruction via the MaxEnt principle four vertical \"ideal\" cuts of the\nBE absorption images are taken as shown in insets of Fig. 1. In addition, for the phonon number operator n̂ which is\nincluded in the set of measured observables (see discussion above) we assume the mean value n̄ = 0.5. The result of\nthe ideal reconstruction is shown in Fig. 1. The fidelity of the measured and the reconstructed quantum states is close\n−10\n−7\n−8\nto unity which\nP means a perfect reconstruction with ∆F = 10 , entropy S = 10 , ∆ρ = 10 has been achieved.\nHere ∆ρ = m,n |(ρ̂ − ρ̂r )mn |2 denotes a deviation of the original and reconstructed density operators.\n2=0\n\n2=1.6\n\ns\n\nintensity [a.u.]\n\n0.4\n\n0.4\n\n0.3\n\n0.3\n\n0.2\n\n0.2\n\n0.1\n\n0.1\n\n0.0\n-400\n\n0.0\n-400\n\n-200\n\n0\n2=3.2\n\n200\n\n400\n\nintensity [a.u.]\n\nW(p,q)\n\n-200\n\n0\n2=4.8\n\ns\n\n0.4\n\n0.2\n\ns\n\n0.4\n\n200\n\n400\n\n200\n\n400\n\ns\n\n0.4\n\n0.3\n\n0.3\n\n0.2\n\n0.2\n\n0.1\n\n0.1\n\n0.0\n-400\n\n0.0\n-400\n\n-200\n\n0\n\nz [ m]\n\n200\n\n400\n\n-200\n\n0\n\nz [ m]\n\n0\n4\n2\n\n-4\n\n0\n\n-2\n\n0\n\nq/q0\n\n2\n\np/p\n\n-2\n\n0\n\n4 -4\n\n√\nFIG. 1. Numerical simulation of the reconstruction of the Wigner function of the motional quantum state (|0i + |1i)/ 2 of\nCs atoms trapped in the optical lattice (assuming ωz /2π = 80 kHz, the rms size of the ground state ∆z0 = 22 nm and the rms\nvelocity width ∆p0 /m = 11 mm/s). As shown in insets for the reconstruction via the MaxEnt principle four vertical cuts of\nthe absorption images (with BE time T = 8.7 ms) have been taken. The histograms in the insets correspond to the measured\ndata while the solid lines are obtained from the reconstructed Wigner function (i.e. they correspond to reconstructed marginal\ndistrubutions). Before BE the atoms evolve within the trapping potential for the times τ = 0, 1.6, 3.2, 4.8 μs. In addition, the\nmean number of motional quanta n̄ = 0.5 and the rms width of the cloud of the atoms about 60 μm have been assumed.\n\nObviously, in a real measurement the measured values are always fluctuating around the exact ones due to an\nexperimental noise. Therefore we simulate a non-ideal measurement introducing random fluctuations to the measured\n5\n\n\fvalues of observables. It means that instead of the ideal values F τj (zk ) we use for the MaxEnt reconstruction procedure\nthe fluctuating (\"noisy\") values\n\u00011/2\n′\nF τj (zk ) = F τj (zk ) + ηξj,k F τj (zk )\n.\n\n(3.10)\n\nHere η is a relative-error parameter which characterizes the quality of the measurement and {ξj,k } represents a\nGaussian noise for observables. The result of the reconstruction is shown in Fig. 2 for η = 0.1. Noisy mean values of\nthe observables are shown in the insets. Despite of a significant relative error the reconstruction is almost perfect with\nthe fidelity of the measured and the reconstructed states still close to one (∆F = 0.16, entropy S = 0.01, ∆ρ = 0.05).\nThe minimum value of the deviation function ∆F = 0.16 can serve also as a measure of the imperfection of the given\nmeasurement (due to a technical noise) [20].\n2=0\n\n2=1.6\n\ns\n\nintensity [a.u.]\n\n0.4\n\n0.4\n\n0.3\n\n0.3\n\n0.2\n\n0.2\n\n0.1\n\n0.1\n\n0.0\n-400\n\n0.0\n-400\n\n-200\n\n0\n2=3.2\n\n200\n\n400\n\nintensity [a.u.]\n\nW(p,q)\n\n-200\n\n0\n2=4.8\n\ns\n\n0.4\n\n0.2\n\ns\n\n0.4\n\n200\n\n400\n\n200\n\n400\n\ns\n\n0.4\n\n0.3\n\n0.3\n\n0.2\n\n0.2\n\n0.1\n\n0.1\n\n0.0\n-400\n\n0.0\n-400\n\n-200\n\n0\n\nz [ m]\n\n200\n\n400\n\n-200\n\n0\n\nz [ m]\n\n0\n4\n2\n\n-4\n\n0\n\n-2\n\n0\n\nq/q0\n\n2\n\np/p\n\n-2\n\n0\n\n4 -4\n\nFIG. 2. √ Numerical simulation of the reconstruction of the Wigner function of the atomic motional quantum state\n(|0i + |1i)/ 2 for the same settings as in Fig. 1. Four vertical cuts of the absorption images taken for reconstruction (see\nthe insets) are fluctuating randomly around their ideal values shown in Fig. 1 with the relative error η = 0.1. In addition, the\nmean phonon number n̄′ = 0.6 has been considered.\n\nA typical non-classical state which we can utilize for a further test is the even coherent state\n√ Ne (|αi+|−αi) which−8is\na superposition of two coherent states with opposite phases [19]. For the amplitude α = 2 we obtained ∆F = 10 ,\nthe entropy S = 0.026 and ∆ρ = 10−4 (under assumption that the exact mean phonon number n̄ = 1.928 is known).\nIn the case of the imperfect measurement with η = 0.1 the reconstruction leads to ∆F = 0.14, entropy S = 0.13, and\n∆ρ = 0.06 for n̄ = 2.09. The fidelity of the reconstructed and the measured states is in this case also close to one.\nIn order to model a technical noise in the measurement we have been considered Gaussian fluctuations proportional\nto the square root of the mean values. It means that tails of the \"cuts\" of BE images do not introduce a significant\nerror (compare insets in Fig. 1 and Fig. 2). However, in the current measurements the situation seems to be different\nand the fluctuations do not decrease with the amplitude of the expected values.\nThe fundamental question in the context of the MaxEnt reconstruction of states from incomplete tomographic data\nis whether the quality of the reconstruction can be improved using additional data from subsequent time moments τ\nand how many such time moments τ are required for the complete reconstruction of the unknown state ρ̂. We have\nshown recently [15] that for the quantum tomography just three quadrature distribution are sufficient for a complete\nreconstruction using the MaxEnt principle (in the case of the perfect measurement). This corresponds to the ideal\ncase without the spatial dispersion of the cloud of atoms, i.e. the choice with ωz τj = 0, π/4, π/2 (Nτ = 3) is sufficient\nfor ∆ξ0 → 0. Obviously, in experiments with neutral atoms the spatial size of the atomic cloud is nonzero. However,\nin the case of the ideal measurement three BE absorption images associated with three \"rotations\" ωz τj are still\nsufficient for a complete reconstruction of tested examples of quantum states. On the other hand, it seems that for\nhigher mean phonon numbers the spatial distributions along the vertical axis which are directly determined from\n6\n\n\fabsorption images should be known with improving precision (and on a wider interval of values as well). In the above\nexamples we have considered for convenience BE images for four \"rotations\" (Nτ = 4) which results in a very good\nreconstruction.\n2=0\n\n2=1.6\n\ns\n\nintensity [a.u.]\n\n0.4\n\n0.4\n\n0.3\n\n0.3\n\n0.2\n\n0.2\n\n0.1\n\n0.1\n\n0.0\n-400\n\n0.0\n-400\n\n-200\n\n0\n\n200\n\n2=3.2\n\n400\n\nintensity [a.u.]\n\nW(p,q)\n\n-200\n\n0\n2=4.8\n\ns\n\n0.4\n\n0.2\n\ns\n\n0.4\n\n200\n\n400\n\n200\n\n400\n\ns\n\n0.4\n\n0.3\n\n0.3\n\n0.2\n\n0.2\n\n0.1\n\n0.1\n\n0.0\n-400\n\n0.0\n-400\n\n-200\n\n0\n\n200\n\n400\n\n-200\n\nz [ m]\n\n0\n\nz [ m]\n\n0\n\n-4\n\n-2\n\n0\n\nq/q0\n\n2\n\n4 -4\n\n-2\n\n2\n\n0\n\n4\n\np/p 0\n\nFIG. 3. √Numerical simulation of the reconstruction of the Wigner function of the motional quantum state Ne (|αi + | − αi)\nwith α = 2 for the case of the ideal measurement. The mean number of motional quanta n̄ = 1.928. Other settings are same\nas in Fig. 1.\n\n2=0\n\n2=1.6\n\ns\n\nintensity [a.u.]\n\n0.4\n\n0.4\n\n0.3\n\n0.3\n\n0.2\n\n0.2\n\n0.1\n\n0.1\n\n0.0\n\n0.0\n-400\n\n-4\n\n-2\n\n0\n2=3.2\n\n2\n\n4\n\nintensity [a.u.]\n\nW(p,q)\n\n-200\n\n0\n2=4.8\n\ns\n\n0.4\n\n0.2\n\ns\n\n0.4\n\n200\n\n400\n\n200\n\n400\n\ns\n\n0.4\n\n0.3\n\n0.3\n\n0.2\n\n0.2\n\n0.1\n\n0.1\n\n0.0\n-400\n\n0.0\n-400\n\n-200\n\n0\n\nz [ m]\n\n200\n\n400\n\n-200\n\n0\n\nz [ m]\n\n0\n\n-4\n\n-2\n\n0\n\nq/q0\n\n2\n\n4 -4\n\n-2\n\n2\n\n0\n\n4\n\np/p 0\n\nFIG. 4. √ Numerical simulation of the reconstruction of the Wigner function of the motional quantum state Ne (|αi + | − αi)\nwith α = 2 for the case of noisy measurement with η = 0.1. The \"measured\" mean number of the motional quanta n̄′ = 2.09.\nOther settings are the same as in Fig. 1.\n\n7\n\n\fIV. RECONSTRUCTION FROM EXPERIMENTAL DATA\n\nIn what follows we will apply the MaxEnt reconstruction scheme to the data obtained at the ENS in Paris [21].\nFirstly we note that the unknown quantum state should belong to a Hilbert subspace which can be determined easily.\nThus we can limit ourselves to the subspace spanned by Fock (number) states |0i, |1i, . . . |N − 1i. The upper bound\non the accessible phonon number N is given by experimental limitations such as, for example, a feasible depth of\nmicro-wells of the optical lattice and the validity of the harmonic potential approximation. For recent experiments N\nhas been typically of the order of 10. This value is large enough to demonstrate the preparation of many non-classical\nstates but on the other hand excludes highly squeezed states from a coherent processing.\nLet us consider the experimental arrangement used in Paris [21] with the parameters: ωz /2π = 80 kHz, the rms\nsize of the ground state ∆z0 = 22 nm, the rms velocity width ∆p0 /m = 11 mm/s, the rms width of the cloud of the\natoms about 60 μm and BE time T = 8.7 ms. Initially the atoms are prepared in a well defined motional state |ψ0 i\n(e.g. in the vacuum state |0i). Then the optical lattice is switched off for the time period t1 during which the atoms\nevolve freely towards the state |ψ1 i = exp(−it1 p̂2 /2m)|ψ0 i. Next, the optical lattice is again switched on for the time\nτ during which the atoms evolve within the harmonic trapping potential. The measurement is performed after the\nBE time. The first two stages can be considered as the preparation of the state |ψ1 i. After its \"rotation\" by ωz τ\n(within the phase space of the harmonic oscillator) and the subsequent BE the absorption images are taken.\n2=0\n\nintensity [a.u.]\n\n0.3\n\n0.3\n\n0.3\n\n0.2\n\n0.2\n\n0.1\n\n0.1\n\n0.0\n\n0.0\n\n-400 -200\n\n0\n\n200 400\n\nintensity [a.u.]\n\nW(p,q)\n\n-400 -200\n\n0\n\n2=4.8\n\ns\n\n0.4\n\n0.1\n\ns\n\n0.4\n\n2=3.2\n\n0.2\n\n2=1.6\n\ns\n\n0.4\n\n200 400\n\ns\n\n0.4\n\n0.3\n\n0.3\n\n0.2\n\n0.2\n\n0.1\n\n0.1\n\n0.0\n\n0.0\n\n-400 -200\n\n0\n\n200 400\n\nz [ m]\n\n-400 -200\n\n0\n\n200 400\n\nz [ m]\n\n4\n\n0\n-4\n\n2\n\n-2\n\n0\n\n0\n\nq/q\n\n0\n\n-2\n\n2\n\np/p\n\n0\n\n4 -4\n\nFIG. 5. The Wigner function reconstructed from the experimental data obtained at the ENS, Paris. The experimental\nsetting is the same as for Fig. 1. From the experimental data we have inferred the mean number of motional quanta n̄ ≈ 1.0,\nwhile the reconstructed value is n̄′ ≈ 1.1. Deviation of the measured and predicted values of observables is ∆F = 0.09 and\nentropy of the reconstructed mixture state is S = 1.0.\n\nThe considered data are for the initial vacuum state which means that under ideal conditions a squeezed state\n|ψ1 i = exp(−it1 p̂2 /2m)|0i should be prepared. The vertical spatial distributions obtained from the measured 2Dabsorption images are discretized into pixels (bins) with the pixel width 5.45 μm. The optical density of each pixel\nis averaged in the horizontal direction in which the absorption images are divided into 50 rows, each 3.9 μm wide\n(these rows cover the size of the cloud in the horizontal direction). For the reconstruction via the MaxEnt principle\nfour vertical spatial distributions for \"rotation\" times τ = 0, 1.6, 3.2 and 4.8 μs are taken. The selected times roughly\ncorrespond to rotations within the phase space by ωz τ = 0, π/4, π/2 and 3π/4, respectively. Unfortunately, the\nmean excitation number n̂ for measured state |ψ1 i was not measured explicitly in the experiment, therefore we have\nto estimate it as follows: During the free expansion period the rms size of the cloud increases by ∆x = p0 τ1 /m.\nThe corresponding increase of the potential energy 21 mωz2 (∆x)2 in units h̄ωz gives us the increase of the number\nof excitation quanta with respect to the initial state |ψ0 i. For τ1 = 4 μ and the initial vacuum it means n̄ ≈ 1.\nExperiments can be realized also for higher τ1 . For example, τ1 = 8 μ leads to n̄ ≈ 4. However, as mentioned above,\n8\n\n\fsuch \"squeezed\" states with a significant contribution of higher phonon number states violate the underlying harmonic\napproximation for the potential. To keep a coherent control an an-harmonic part of the potential has to be taken into\naccount.\nThe result of the reconstruction via the MaxEnt principle is shown in Fig. 5. The deviation of the fitted and\nmeasured values is ∆F = 0.09 and the entropy of the reconstructed state S = 1.0. It means that the reconstructed\nstate is a statistical mixture. We see a two peak structure which suggests that there is a mixture of two squeezed\nstates coherently displaced from each other. It is caused by the fact that the vertical center of the cloud was not\nfixed in the experiment and it has to be determined by our fit for each measured BE absorption image separately.\nAssuming a priori knowledge that the Wigner function has a symmetric shape with respect to the origin of the phase\nspace (i.e. there is no coherent amplitude) a Gaussian fit can be used to determine the center of the cloud for each\nvertical distribution. For states with a non-zero coherent amplitude the center of the cloud should be fixed already\nin the experiment.\nIt turns out that the reconstruction results do not describe the squeezed vacuum state as was originally expected\n[21]. The main reason is that the mean phonon number was not measured directly in the experiment. It can be\ninferred only indirectly from the ideal case without any incoherence during preparation or measurement. As we\ndiscussed above, it is essential to include the information about the mean number of vibrational quanta into the\nMaxEnt reconstruction scheme. In optical tomography the analogous information about mean photon number can be\nobtained from distributions of two \"orthogonal\" quadratures. In our case it could correspond to two absorption images\nsuch that ωz (τj − τk ) = π/2. However, it would require a precise timing of the evolution within the harmonic trapping\npotential. Therefore the mean number of vibrational quanta should be determined in an independent measurement.\nAnother problem arises from a slow convergence of anti-squeezed spatial distributions which are derived directly\nfrom the measured absorption images. In particular, the convergence of tails is too slow for those \"rotations\" which\ncorresponds to anti-squeezed phases, i.e. τ = 1.6, 4.8 μs (see insets of Fig. 5). The slow convergence is reflected by the\npresence of non-negligible backgrounds for Gaussian fits to these spatial distributions. If we eliminate (subtract) these\nbackgrounds from the measured distributions the MaxEnt reconstruction gives almost the same Wigner function as\nin Fig. 5 but with a highly reduced deviation function ∆F = 0.02 (comparing to ∆F = 0.09 in Fig. 5). Such\nbackground in these absorption images can be caused by an incoherence associated with a violation of the the\nharmonic approximation. In fact, in our analysis we have neglected the change of the oscillation frequency along the\nz-axis. In recent experiments, the oscillation frequency decreases 10% from ωz for micro-wells at the edge of the initial\ncloud.\nV. CONCLUSIONS\n\nWe have presented a very efficient reconstruction scheme for the reconstruction of motional states of atoms based\non the MaxEnt principle. The main advantage of the scheme is that it always results in reconstructions which are\nphysical states (unlike in the case of the maximum likelihood estimation which can results in nonphysical estimations).\nMoreover, the scheme is very efficient in a sense that it requires just a small number of tomographic phase-space cuts.\nWe have applied the scheme for a reconstruction of motional quantum states of neutral atoms. As an example have\nwe analyzed the experimental data obtained by by the group of C. Salomon at the ENS in Paris and we reconstruct\nthe Wigner function of motional quantum states of Cs atoms trapped in the optical lattice. In our analysis we have\nneglected the change of the oscillation frequency along z axis in recent experiments. The dispersion of the oscillation\nfrequency is of the order of a few percent. This source of errors can significantly affect the quality of a quantum state\npreparation and its reconstruction. In addition, only up to first 10 bound states of micro-wells of the optical lattice\ncan be approximated by a harmonic potential. It implies limits on coherent manipulations of quantum states. It\nmeans that states with a significant contribution of higher number (Fock) states cannot be prepared and manipulated\nin a controlled way.\n\nACKNOWLEDGMENTS\n\nThis work was supported by the European Union projects QUBITS and QUEST under the contracts IST-199913021 and HPRN-CT-2000-00121, respectively. We thank Christophe Salomon and Isabelle Bouchoule for providing\nus with their experimental data and for helpful discussions and correspondence.\n\n9\n\n\f[1] E. T. Jaynes, Information theory and statistical mechanics, in 1962 Brandeis Lectures vol. 3, ed. K. W. Ford (Benjamin,\nElmstord, New York, 1963).\n[2] M. A. Nielsen and I. L. Chuang, Quantum Computation and Quantum Information (Cambridge University Press, Cambridge, 2000).\n[3] For recent review articles on trapped ions see D.J. Wineland et al.: Fortschr. Phys. 46, 363 (1998); H. C. Nägerlet al.,\nFortschr. Phys. 48, 623 (2000); and references therein.\n[4] I. Bouchoule, H. Perrin, A. Kuhn, M. Morinaga, and C. Salomon, Phys. Rev. A 59, R8 (1999).\n[5] M. Morinaga, I. Bouchoule, J.-C. Karam, and C. Salomon, Phys. Rev. Lett. 83, 4037 (1999).\n[6] E.T. Jaynes, Phys. Rev. 108, 171 (1957); ibid. 108, 620 (1957) 620; Am. J. Phys. 31, 66 (1963).\n[7] E. Fick and G. Sauermann: The Quantum Statistics of Dynamic Processes (Springer Verlag, Berlin, 1990).\n[8] J.N.Kapur and H.K.Kesavan: Entropic Optimization Principles with Applications (Academic Press, New York, 1992).\n[9] R.G.Newton and Bing-Lin Young, Ann. Phys. (N.Y.) 49, 393 (1968).\n[10] A. Katz: Principles of Statistical Mechanics, (W.H. Freeman and Company, San Francisco, 1967);\nA. Hobson, Concepts in Statistical Mechanics, (Gordon Breach Science Publishers, New York, 1971).\n[11] V. Bužek, G. Adam, and G. Drobný, Ann. Phys. (N.Y.) 245, 37 (1996); V.Bužek, G. Drobný, R.Derka, G.Adam, and\nH.Wiedeman, Chaos, Solitons & Fractals 10, 981–1074 (1999).\n[12] Z. Hradil, J. Summhammer, and H. Rauch, Phys. Lett. A 261, 20 (2000).\n[13] K.Vogel and H.Risken, Phys. Rev. A 40, 2847 (1989).\n[14] U.Leonhardt, Measuring the quantum state of light (Cambridge University Press, Cambridge, 1997).\n[15] V. Bužek and G. Drobný, J. Mod. Optics 47, 2823 (2000).\n[16] D.T. Smithey, M. Beck, M.G. Raymer and A. Faridani, Phys. Rev. Lett.70, 1244 (1993); M. Beck, D.T. Smithey, and\nM.G. Raymer, Phys. Rev. A 48, R890 (1993); M.G. Raymer, M. Beck, and D.F. Mc Alister, Phys. Rev. Lett. 72, 1137\n(1994);\n[17] S. Schiller, G. Breitenbach, S.F. Pereira, T. Müller, and J. Mlynek, Phys. Rev. Lett. 77, 2933 (1996);\nCh. Kurtsiefer, T. Pfau, and J. Mlynek, Nature 386, 150 (1997).\n[18] E.P.Wigner, Phys. Rev. 40, 749 (1932); see also\nM.Hillery, R.F.O'Connell, M.O.Scully, and E.P.Wigner, Phys. Rep. 106, 121 (1984).\n[19] V.Bužek and P.L.Knight: Quantum interference, superposition states of light and non-classical effects, in Progress in\nOptics, Vol. 34, ed. E. Wolf (North Holland, Amsterdam, 1995), p.1.\n[20] We should stress that due to random fluctuations of \"observed\" mean values (3.10) physically incompatible data might\nbe obtained. It means that there does not exist a physical density operator which could fit perfectly the results of the\nnoisy measurement (i.e. leading to ∆F → 0). Obviously increasing the relative error of the measurement we increase also\na number of incompatible results and the reconstruction becomes meaningless.\n[21] C. Salomon and I. Bouchoule, private communication.\n\n10\n\n\f"}