{"id": "http://arxiv.org/abs/quant-ph/0507047v2", "guidislink": true, "updated": "2005-09-26T11:44:32Z", "updated_parsed": [2005, 9, 26, 11, 44, 32, 0, 269, 0], "published": "2005-07-05T19:13:02Z", "published_parsed": [2005, 7, 5, 19, 13, 2, 1, 186, 0], "title": "Matter-wave interferometry in a double well on an atom chip", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=quant-ph%2F0507179%2Cquant-ph%2F0507233%2Cquant-ph%2F0507134%2Cquant-ph%2F0507043%2Cquant-ph%2F0507149%2Cquant-ph%2F0507126%2Cquant-ph%2F0507156%2Cquant-ph%2F0507127%2Cquant-ph%2F0507036%2Cquant-ph%2F0507041%2Cquant-ph%2F0507176%2Cquant-ph%2F0507046%2Cquant-ph%2F0507054%2Cquant-ph%2F0507251%2Cquant-ph%2F0507059%2Cquant-ph%2F0507015%2Cquant-ph%2F0507192%2Cquant-ph%2F0507259%2Cquant-ph%2F0507087%2Cquant-ph%2F0507235%2Cquant-ph%2F0507142%2Cquant-ph%2F0507265%2Cquant-ph%2F0507079%2Cquant-ph%2F0507154%2Cquant-ph%2F0507195%2Cquant-ph%2F0507178%2Cquant-ph%2F0507137%2Cquant-ph%2F0507193%2Cquant-ph%2F0507255%2Cquant-ph%2F0507071%2Cquant-ph%2F0507272%2Cquant-ph%2F0507108%2Cquant-ph%2F0507146%2Cquant-ph%2F0507064%2Cquant-ph%2F0507256%2Cquant-ph%2F0507184%2Cquant-ph%2F0507177%2Cquant-ph%2F0507196%2Cquant-ph%2F0507163%2Cquant-ph%2F0507088%2Cquant-ph%2F0507091%2Cquant-ph%2F0507262%2Cquant-ph%2F0507275%2Cquant-ph%2F0507150%2Cquant-ph%2F0507279%2Cquant-ph%2F0507093%2Cquant-ph%2F0507175%2Cquant-ph%2F0507190%2Cquant-ph%2F0507038%2Cquant-ph%2F0507218%2Cquant-ph%2F0507032%2Cquant-ph%2F0507085%2Cquant-ph%2F0507160%2Cquant-ph%2F0507035%2Cquant-ph%2F0507240%2Cquant-ph%2F0507012%2Cquant-ph%2F0507034%2Cquant-ph%2F0507047%2Cquant-ph%2F0507170%2Cquant-ph%2F0507182%2Cquant-ph%2F0507007%2Cquant-ph%2F0507128%2Cquant-ph%2F0507231%2Cquant-ph%2F0507191%2Cquant-ph%2F0507282%2Cquant-ph%2F0507083%2Cquant-ph%2F0507113%2Cquant-ph%2F0507189%2Cquant-ph%2F0507248%2Cquant-ph%2F0507280%2Cquant-ph%2F0507252%2Cquant-ph%2F0507040%2Cquant-ph%2F0507267%2Cquant-ph%2F0507152%2Cquant-ph%2F0507198%2Cquant-ph%2F0507185%2Cquant-ph%2F0507058%2Cquant-ph%2F0507159%2Cquant-ph%2F0507001%2Cquant-ph%2F0507118%2Cquant-ph%2F0507199%2Cquant-ph%2F0507181%2Cquant-ph%2F0507105%2Cquant-ph%2F0507147%2Cquant-ph%2F0507281%2Cquant-ph%2F0507261%2Cquant-ph%2F0507139%2Cquant-ph%2F0507022%2Cquant-ph%2F0507140%2Cquant-ph%2F0507202%2Cquant-ph%2F0507049%2Cquant-ph%2F0507102%2Cquant-ph%2F0507215%2Cquant-ph%2F0507026%2Cquant-ph%2F0507107%2Cquant-ph%2F0507051%2Cquant-ph%2F0507204%2Cquant-ph%2F0507271%2Cquant-ph%2F0507210%2Cquant-ph%2F0507070%2Cquant-ph%2F0507073&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Matter-wave interferometry in a double well on an atom chip"}, "summary": "Matter-wave interference experiments enable us to study matter at its most\nbasic, quantum level and form the basis of high-precision sensors for\napplications such as inertial and gravitational field sensing. Success in both\nof these pursuits requires the development of atom-optical elements that can\nmanipulate matter waves at the same time as preserving their coherence and\nphase. Here, we present an integrated interferometer based on a simple,\ncoherent matter-wave beam splitter constructed on an atom chip. Through the use\nof radio-frequency-induced adiabatic double-well potentials, we demonstrate the\nsplitting of Bose-Einstein condensates into two clouds separated by distances\nranging from 3 to 80 microns, enabling access to both tunnelling and isolated\nregimes. Moreover, by analysing the interference patterns formed by combining\ntwo clouds of ultracold atoms originating from a single condensate, we measure\nthe deterministic phase evolution throughout the splitting process. We show\nthat we can control the relative phase between the two fully separated samples\nand that our beam splitter is phase-preserving.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=quant-ph%2F0507179%2Cquant-ph%2F0507233%2Cquant-ph%2F0507134%2Cquant-ph%2F0507043%2Cquant-ph%2F0507149%2Cquant-ph%2F0507126%2Cquant-ph%2F0507156%2Cquant-ph%2F0507127%2Cquant-ph%2F0507036%2Cquant-ph%2F0507041%2Cquant-ph%2F0507176%2Cquant-ph%2F0507046%2Cquant-ph%2F0507054%2Cquant-ph%2F0507251%2Cquant-ph%2F0507059%2Cquant-ph%2F0507015%2Cquant-ph%2F0507192%2Cquant-ph%2F0507259%2Cquant-ph%2F0507087%2Cquant-ph%2F0507235%2Cquant-ph%2F0507142%2Cquant-ph%2F0507265%2Cquant-ph%2F0507079%2Cquant-ph%2F0507154%2Cquant-ph%2F0507195%2Cquant-ph%2F0507178%2Cquant-ph%2F0507137%2Cquant-ph%2F0507193%2Cquant-ph%2F0507255%2Cquant-ph%2F0507071%2Cquant-ph%2F0507272%2Cquant-ph%2F0507108%2Cquant-ph%2F0507146%2Cquant-ph%2F0507064%2Cquant-ph%2F0507256%2Cquant-ph%2F0507184%2Cquant-ph%2F0507177%2Cquant-ph%2F0507196%2Cquant-ph%2F0507163%2Cquant-ph%2F0507088%2Cquant-ph%2F0507091%2Cquant-ph%2F0507262%2Cquant-ph%2F0507275%2Cquant-ph%2F0507150%2Cquant-ph%2F0507279%2Cquant-ph%2F0507093%2Cquant-ph%2F0507175%2Cquant-ph%2F0507190%2Cquant-ph%2F0507038%2Cquant-ph%2F0507218%2Cquant-ph%2F0507032%2Cquant-ph%2F0507085%2Cquant-ph%2F0507160%2Cquant-ph%2F0507035%2Cquant-ph%2F0507240%2Cquant-ph%2F0507012%2Cquant-ph%2F0507034%2Cquant-ph%2F0507047%2Cquant-ph%2F0507170%2Cquant-ph%2F0507182%2Cquant-ph%2F0507007%2Cquant-ph%2F0507128%2Cquant-ph%2F0507231%2Cquant-ph%2F0507191%2Cquant-ph%2F0507282%2Cquant-ph%2F0507083%2Cquant-ph%2F0507113%2Cquant-ph%2F0507189%2Cquant-ph%2F0507248%2Cquant-ph%2F0507280%2Cquant-ph%2F0507252%2Cquant-ph%2F0507040%2Cquant-ph%2F0507267%2Cquant-ph%2F0507152%2Cquant-ph%2F0507198%2Cquant-ph%2F0507185%2Cquant-ph%2F0507058%2Cquant-ph%2F0507159%2Cquant-ph%2F0507001%2Cquant-ph%2F0507118%2Cquant-ph%2F0507199%2Cquant-ph%2F0507181%2Cquant-ph%2F0507105%2Cquant-ph%2F0507147%2Cquant-ph%2F0507281%2Cquant-ph%2F0507261%2Cquant-ph%2F0507139%2Cquant-ph%2F0507022%2Cquant-ph%2F0507140%2Cquant-ph%2F0507202%2Cquant-ph%2F0507049%2Cquant-ph%2F0507102%2Cquant-ph%2F0507215%2Cquant-ph%2F0507026%2Cquant-ph%2F0507107%2Cquant-ph%2F0507051%2Cquant-ph%2F0507204%2Cquant-ph%2F0507271%2Cquant-ph%2F0507210%2Cquant-ph%2F0507070%2Cquant-ph%2F0507073&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Matter-wave interference experiments enable us to study matter at its most\nbasic, quantum level and form the basis of high-precision sensors for\napplications such as inertial and gravitational field sensing. Success in both\nof these pursuits requires the development of atom-optical elements that can\nmanipulate matter waves at the same time as preserving their coherence and\nphase. Here, we present an integrated interferometer based on a simple,\ncoherent matter-wave beam splitter constructed on an atom chip. Through the use\nof radio-frequency-induced adiabatic double-well potentials, we demonstrate the\nsplitting of Bose-Einstein condensates into two clouds separated by distances\nranging from 3 to 80 microns, enabling access to both tunnelling and isolated\nregimes. Moreover, by analysing the interference patterns formed by combining\ntwo clouds of ultracold atoms originating from a single condensate, we measure\nthe deterministic phase evolution throughout the splitting process. We show\nthat we can control the relative phase between the two fully separated samples\nand that our beam splitter is phase-preserving."}, "authors": ["T. Schumm", "S. Hofferberth", "L. M. Andersson", "S. Wildermuth", "S. Groth", "I. Bar-Joseph", "J. Schmiedmayer", "P. Kruger"], "author_detail": {"name": "P. Kruger"}, "author": "P. Kruger", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1038/nphys125", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/quant-ph/0507047v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/quant-ph/0507047v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/quant-ph/0507047v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/quant-ph/0507047v2", "arxiv_comment": null, "journal_reference": "Nature Physics 1, 57 (2005)", "doi": "10.1038/nphys125", "fulltext": "Matter-wave interferometry in a double well on an atom chip\nT. Schumm,1, 2 S. Hofferberth,1 L. M. Andersson,1 S. Wildermuth,1\nS. Groth,1, 3 I. Bar-Joseph,3 J. Schmiedmayer,1, ∗ and P. Krüger1, 4, †\n1\nPhysikalisches Institut, Universität Heidelberg, D-69120 Heidelberg, Germany\nLaboratoire Charles Fabry de l'Insitut d'Optique, UMR 8105 du CNRS, F-91403 Orsay, France\n3\nDepartment of Condensed Matter Physics, The Weizmann Institute of Science, Rehovot 76100, Israel\n4\nCurrent address: Laboratoire Kastler Brossel, École Normale Supérieure, F-75005 Paris, France\n(Dated: February 1, 2008)\n\narXiv:quant-ph/0507047v2 26 Sep 2005\n\n2\n\nMatter-wave interference experiments enable us to study matter at its most basic, quantum level\nand form the basis of high-precision sensors for applications such as inertial and gravitational field\nsensing. Success in both of these pursuits requires the development of atom-optical elements that\ncan manipulate matter waves at the same time as preserving their coherence and phase. Here,\nwe present an integrated interferometer based on a simple, coherent matter-wave beam splitter\nconstructed on an atom chip. Through the use of radio-frequency-induced adiabatic double-well\npotentials, we demonstrate the splitting of Bose-Einstein condensates into two clouds separated\nby distances ranging from 3 to 80 μm, enabling access to both tunnelling and isolated regimes.\nMoreover, by analysing the interference patterns formed by combining two clouds of ultracold atoms\noriginating from a single condensate, we measure the deterministic phase evolution throughout the\nsplitting process. We show that we can control the relative phase between the two fully separated\nsamples and that our beam splitter is phase-preserving.\nPACS numbers: 39.90.+d, 03.75.Be\n\nThe wave nature of matter becomes visible in interference experiments [1]. Interferometry with atoms has\nbecome an important tool for both fundamental and applied experiments in the diverse fields of atomic physics,\nquantum optics, and metrology [2]. For example, highly\naccurate acceleration measurements have been based on\natom interference [3]. Even though in most cases, interference is fundamentally a single particle phenomenon,\nthe experiments become even more powerful when performed with Bose-Einstein condensates (BECs). Interferometry was used to demonstrate the remarkable property of atoms in a BEC to possess a common phase [4].\nRealizing miniaturized matter-wave interferometers, as\nwell as controlling and engineering quantum states on a\nmicroscale in general, have been long standing goals. Microscopic integrated matter-wave devices [5] can be used\nto study the physics of correlated many-body quantum\nsystems and are promising candidates for the implementation of scalable quantum information processing [6].\nThe combination of well-established tools for atom\ncooling and manipulation with state-of-the-art microfabrication technology has led to the development of atom\nchips [5, 7, 8, 9, 10]. These devices have been shown to\nbe capable of trapping and guiding ultracold atoms on\na microscale. A variety of complex manipulation potentials have been formed using magnetic [11], electric [12],\nand optical fields [13]. BECs can be created efficiently in\nsuch microtraps and coherent quantum phenomena such\nas internal-state Rabi oscillations [14] and coherent splitting in momentum space [15, 16] have been observed.\nIt is of particular interest to control the external (motional) degrees of freedom of trapped atoms and spatially\ndelocalized wave packets on a quantum level [17, 18]. A\n\ngeneric configuration for studies of matter-wave dynamics is the double well [19, 20]. Dynamically splitting a\nsingle trap into a double well is analogous to a beam\nsplitter in optics and hence forms a basic element of a\nmatter-wave interferometer. Interferometers on a microchip can be used as highly sensitive devices because\nthey allow measurements of quantum phases. This enables experiments exploring the intrinsic phase dynamics in complex interacting quantum systems (for example, Josephson oscillations [20, 21]) or the influence of\nthe coupling to an external 'environment' (decoherence\n[22]). Technologically, chip-based atom interferometers\npromise to be very useful as inertial sensors on a microscale [23]. For all these applications it is imperative\nthat the deterministic coherent quantum evolution of the\nmatter waves is not perturbed by the splitting process\nitself. Although several atom chip beam-splitter configurations have been proposed and experimentally demonstrated [12, 24, 25, 26, 27] none of them has fulfilled this\ncrucial requirement.\nWe present an easily implementable scheme for a phase\npreserving matter-wave beam splitter. We demonstrate\nexperimentally, for the first time, coherent spatial splitting and subsequent stable interference of matter waves\non an atom chip. Our scheme is exclusively based on a\ncombination of static and radio-frequency (RF) magnetic\nfields forming an adiabatic potential [28]. The atomic\nsystem in the combined magnetic fields can be described\nby a hamiltonian with uncoupled adiabatic eigenstates,\nso-called dressed states. For sufficiently strong amplitudes of the RF field, transitions between the adiabatic\nlevels are inhibited as the strong coupling induces large\nrepulsion of these levels. This property of the combined\n\n\f2\nstatic and RF fields could be exploited to form trapping geometries using the effective potential acting on\nthe dressed eigenstates [29], and related demonstration\nexperiments with thermal atoms have been performed\n[30].\nIn a more general case than considered in ref. [29], the\norientation, in addition to the intensity and frequency, of\nthe RF field determine the effective adiabatic potential\nVeff at the position r:\nVeff (r) =\n(1)\np\n2\nmF [μB gF Bd.c. (r) − h̄ωRF ] + [μB gF BRF⊥ (r)/2]2\nHere mF is the magnetic quantum number of the state,\ngF is the Landé factor, μB is the Bohr magneton, h̄ is the\nreduced Planck's constant, Bd.c. is the magnitude of the\nstatic trapping field and ωRF is the frequency of the RF\nfield. BRF⊥ is the amplitude of the component of the\nRF field perpendicular to the local direction of the static\ntrapping field. The directional dependence of this term\nimplies the relevance of the vector properties of the RF\nfield, which enables the formation of a true double-well\npotential.\nFigure 1 illustrates the operation principle of the beam\nsplitter. A standard magnetic microtrap [5] is formed by\nthe combined fields of a current-carrying trapping wire\nand an external bias field; a static magnetic field minimum forms where atoms in low-field-seeking states can be\ntrapped. An RF field generated by an independent wire\ncarrying an alternating current couples internal atomic\nstates with different magnetic moments. Owing to the\nstrong confinement in a microtrap, the angle between\nthe RF field and the local static magnetic field varies\nsignificantly over short distances, resulting in a corresponding local variation of the RF coupling strength. By\nslowly changing the parameters of the RF current we\nsmoothly change the adiabatic potentials and transform\na tight magnetic trap into a steep double well, thereby\ndynamically splitting a BEC without exciting it. We accurately control the splitting distance over a wide range.\nThe potential barrier between the two wells can be raised\ngradually with high precision, thus enabling access to the\ntunnelling regime [20] as well as to the regime of entirely\nisolated wells.\nThe beam splitter is fully integrated on the atom chip,\nas the manipulating potentials are provided by currentcarrying microfabricated wires. The use of chip-wire\nstructures allows one to create sufficiently strong RF\nfields with only moderate currents and permits precise\ncontrol over the orientation of the RF field. Note that in\nour configuration the magnetic near-field part of the RF\nfield completely dominates.\nWe complete the interferometer sequence and measure\nthe relative phase between the split BECs by recombining the clouds in time-of-flight expansion. In our ex-\n\nFIG. 1: Operation principle of the beam splitter. (a), A\nstraight wire carrying a static (d.c.) current (∼1 A) is used\nto trap a BEC on an atom chip directly below a second wire\ncarrying a RF current (∼60 mA at 500 kHz). The d.c. wire\nhas a width of 50 μm, it is separated by 80 μm from the RF\nwire (width 10 μm). Placing the trap 80 μm from the chip surface at the indicated position allows for symmetric horizontal\nsplitting. (b), Top view onto the atom chip (mounted upside\ndown in the experiment): an elongated BEC is transversely\nsplit. All images are taken along the indicated direction. (c),\nLeft: The RF magnetic field couples different atomic spin\nstates (only two shown for simplicity). Right: the initial d.c.\ntrapping potential is deformed to an effective adiabatic potential under the influence of the RF field with a frequency\nbelow the Larmor frequency at the trap minimum (∼1 G). In\nthe vertical (y) direction, the spatially homogeneous RF coupling strength leads to a slight relaxation of the static trap\n(dashed green line). Along the horizontal (x) direction, the\nadditional effect of local variations of the RF coupling breaks\nthe rotational symmetry of the trap and allows for the formation of a double-well potential with a well separation (d) and\npotential barrier height Vbar (solid blue line).\n\nperiments we found an interference pattern with a fixed\nphase as long as the two wells are not completely separated. The phase distribution remains non-random and\nits centre starts to evolve deterministically once the wells\nare entirely separated so that tunnelling is fully inhibited\non all experimental timescales.\nThe experiments are performed in the following way.\nWe routinely prepare BECs of up to ∼105 rubidium-87\n\n\f3\n\nFIG. 2: The splitting of BECs is controlled over a wide spatial range. By adjusting amplitude and frequency of the RF\nfield, we have been able to reach splitting distances of up\nto 80 μm. (a), A comparison of the measured splitting distances (red circles) to the theoretical expectation (black lines)\nyields good agreement for three different strengths of transverse confinement (gradients 1.1, 1.9 and 2.4 kG cm−1 , top to\nbottom). (b), The experimental data are derived from in situ\nabsorption images (Roper Scientific MicroMAX: 1024BFT).\n(c), The fringe spacing is plotted as a function of RF amplitude (red circles). A simple approximation of the expected\nfringe spacing based on an expansion of a non-interacting\ngas from two points located at the two double-well minima\nagrees well with the data for sufficiently large splittings (solid\nline). For small splitting distances (large fringe spacings),\ninter-atomic interactions affect the expansion of the cloud. A\nnumerical integration of the time-dependent Gross-Pitaevskii\nequation using our experimental parameters takes this effect\ninto account (dotted line). (d), Interference patterns obtained\nafter 14 ms potential-free time-of-flight expansion of the two\nBECs. For splittings below our imaging resolution (d < 6μm),\nthe splitting distances can be derived from these interference\npatterns.\n\natoms in the F = mF = 2 hyperfine state in microtraps\nnear the surface of an atom chip [31]. Our smooth microwires [32] enable us to create pure one-dimensional\ncondensates (aspect ratio ∼400) with chemical potential μ ∼ h̄ω⊥ in a trap with high transverse confinement\n(ω⊥ = 2π × 2.1 kHz) [33, 34]. By tilting the external bias\nfield, we position the BECs directly below an auxiliary\nwire (Fig. 1). A small sinusoidally alternating current\nthrough this wire provides the RF field that splits the\ntrap. For small splitting distances (< 6 μm) we ramp\nthe amplitude of the RF current from zero to its final\nvalue (typically 60-70 mA) at a constant RF frequency\n(∼500 kHz). This frequency is slightly below the Larmor frequency of the atoms at the minimum of the static\n\ntrap (∼1 G corresponding to ∼700 kHz). By applying the\nramp, we smoothly split a BEC confined in the single-well\ntrap into two. The splitting is performed transversely to\nthe long axis of the trap, as shown in Fig. 1b. The distance between the two wells can be further increased by\nraising the frequency of the RF field (up to 4 MHz in\nour experiment). The atoms are detected by resonant\nabsorption imaging (see Fig. 2) along the weak trapping\ndirection, that is, integrating over the long axis of the\none-dimensional clouds. The images are either taken in\nsitu or after time-of-flight expansion.\nUnbalanced splitting can occur owing to the spatial inhomogeneity of the RF field, owing to asymmetries in the\nstatic magnetic trap and owing to gravity. Although the\nsplitting process itself is very robust, imbalances lead to\na rapid evolution of the relative phase of the two condensates once they are separated. The influence of gravity\ncan be eliminated by splitting the trap horizontally. In\nthe experiment we balance the double well by fine-tuning\nthe position of the original trap relative to the RF wire.\nTo characterize the splitting, the split cloud is detected\nin situ. We are able to split BECs over distances of up to\n80 μm without significant loss or heating (determined in\ntime-of-flight imaging). The measured splitting distances\nare in very good agreement with the theoretical expectations for different configurations of the initial single well\n(Fig. 2a).\nTo study the coherence of the splitting process we recombine the split clouds in time-of-flight expansion after a non-adiabatically fast (< 50 μs) extinction of the\ndouble-well potential. Typical matter-wave interference\npatterns obtained by taking absorption images 14 ms after releasing the clouds are depicted in Figure 2d. The\ntransverse density profile derived from these images contains information on both the distance d of the BECs in\nthe double-well potential and the relative phase φ of the\ntwo condensates. We determine the fringe spacing ∆z\nand the phase φ by fitting a cosine function with a Gaussian envelope to the measured profiles (Fig. 3). For large\nsplittings (d > 5 μm for our experimental parameters),\nthe fringe spacing is given by ∆z = ht/md, where h is\nPlanck's constant, t is the expansion time and m is the\natomic mass. This approximation of a non-interacting\ngas expanding from two point sources is inaccurate for\nsmaller splittings where the repulsive interaction in the\nBEC has to be taken into account [35]. Figure 2c shows\nthe observed fringe spacing that is compared with the\nabove approximation and with a numerical integration of\nthe time-dependent Gross-Pitaevskii equation. We find\nexcellent agreement with the latter theory.\nWe assess the coherence properties of the beam splitter\nby analysing the relative phase between the two condensates throughout the splitting process. Figure 3 shows\nthe results for 40 repetitions of the interference experiment performed directly after the two condensates are\nseparated (Fig. 3a) and after they have been taken far-\n\n\f4\n\nFIG. 3:\nThe coherence of the splitting is examined by\nanalysing matter-wave interference patterns. (a), Directly after (0.1 ms) the BECs have been split far enough (d = 3.4 μm)\nto inhibit tunnelling completely. (b), After (0.8 ms) the clouds\nhave been taken farther apart (d = 3.85μm). Left: a cosine\nfunction with a Gaussian envelope is fitted to the profiles derived from the two-dimensional images (insets). This yields\ninformation on fringe spacing, contrast and phase. Right:\ncontrast and relative phase for 40 realizations of the same experiment are plotted in a polar diagram (inset). A histogram\nof the same data shows a very narrow distribution of the differential phase (σ = 13◦ ) directly after separating the clouds\nand a slightly broadened distribution (σ = 28◦ ) later in the\nsplitting process. Both phase spreads are significantly smaller\nthan what is expected for a random phase.\n\nther apart (Fig. 3b), respectively. We find a very narrow\nphase distribution with a Gaussian width of σ = 13◦ and\n28◦ , respectively. Hence, the splitting process is phasepreserving and the beam splitter is coherent.\nWe have performed similar measurements throughout\nthe entire splitting process, starting from a well separation of d ∼ 3 μm where the BECs are still connected\nto a splitting of d ∼ 5.5 μm. At larger d, the interference fringes are no longer optically resolved. For splitting\ndistances larger than 3.4 μm the potential barrier is sufficiently high to suppress tunnel coupling between the two\nwells, so that the splitting process is complete. For fast\nsplitting we find the phase distribution to be non-random\nover the whole splitting range (Fig. 4a). In a more detailed experiment with slower splitting we find that the\nspread is smaller than the expectation of a randomized\nphase by more than three standard deviations for splitting times shorter than 2 ms (Fig. 4c). Within these\nlimits, our data show an increase in phase spread and a\n\nFIG. 4: Evolution of the differential phase throughout the\nsplitting process. Error bars indicate the statistical error of\nthe mean value. (a), Splitting the condensate to variable distances within 12 ms (splitting speed 1.4 μm ms−1 ). The\ndashed vertical line indicates the trap separation for which\nthe chemical potential μ of the BEC equals the potential barrier height Vbar (3.4 μm). As long as the barrier between\nthe two wells is sufficiently low (left of the dashed line), the\nrelative phase remains locked at zero. Once the wells are\nfully separated so that tunnelling is inhibited (right of the\ndashed line), the differential phase starts to evolve owing to\na slight residual imbalance in the double well. (b), Relative\nphase of the two condensates throughout a slower splitting\nprocess (splitting speed 0.6 μm ms−1 ). The evolution of the\ndifferential phase is controlled by deliberately adjusting the\ndouble-well imbalance by displacing the trap. The observed\nevolution is in agreement with a numerical simulation based\non our experimental parameters (dashed lines) for all data\nsets (yellow, red, green and blue points). Both signs of imbalance have been realized and the phase evolution is observed\nfor a time (2 ms), which is more than four times the transverse\noscillation period. (c), A typical distribution of the relative\nphase shows significantly non-random phases for the entire\nsplitting process, the limits for a deviation by one and three\nstandard deviations are indicated.\n\ncoinciding loss of average contrast. A possible explanation is the longitudinal phase diffusion inside the individual one-dimensional quasi-BECs [36]. This hypothesis is supported by the fact that we always observe phase\nrandomization (at finite interference contrast) approximately 2.5 ms after the splitting is complete, independent of the splitting distance d. This timescale roughly\nagrees with the theoretical prediction for our experimental parameters. More detailed experimental studies of\nthe longitudinal phase diffusion inside one-dimensional\nquasi-BECs are underway.\n\n\f5\nAs the splitting is a coherent operation, we are able\nto measure the phase evolution throughout the splitting\nprocess. We find that the relative phase between the\ntwo condensates is locked to zero as long as the chemical potential exceeds the potential barrier (d < 3.4 μm).\nOnce the splitting is complete (d > 3.4 μm), a deterministic phase evolution occurs (Fig. 4a,b). A differential\nphase shift is induced by a slight residual imbalance of\nthe double-well potential (in the case shown in Fig. 4a\nan energy difference of the order of h × 1 kHz μm−1 additional splitting).\nThe double-well imbalance can be controlled by appropriately adjusting the trap parameters. In our experiment we have studied this by varying the current in the\nd.c. trapping wire and thereby adjusting the position of\nthe original single-well trap with respect to the RF wire\nand the orientation of the splitting axis with respect to\ngravity. The data depicted in Fig. 4b show the resulting phase evolution for four different settings. Again, the\ndifferential phase φ is zero as long as the clouds are not\nfully separated; once tunnelling is inhibited, φ evolves\nquadratically with the split time. Although the differential phase evolution in an asymmetric double well is\nusually linear in time, in our case the wells are separated\nfurther as the split time is increased, so that the imbalance itself increases linearly with time. This leads to an\noverall quadratic scaling, which is confirmed by a numerical integration of the time-dependent Gross-Pitaevskii\nequation. We have varied both the sign and strength of\nthe imbalance in the double-well potential. It is a crucial\nproperty of our beam splitter that the balancing is fairly\ninsensitive to changes of the controlling parameter. The\nbalancing can then be performed well above the experimental noise level. In the illustrated case we have varied\nthe d.c. wire current on the per cent level (∼10 mA corresponding to a trap displacement of ∼ 1 μm), whereas\nthe current stability is better than 10−4 . In our experiment, we have been able to balance the double well to\nan extent that within one transverse oscillation period\n(0.5 ms) after the condensates were fully separated, the\nphase shift remained smaller than 18◦ .\nThere are several advantages of our atom chip beamsplitter concept over previously implemented approaches:\nthe splitting distances are not limited by the structure\nsize on the chip [37], but rather by the ground-state size\nof the initial single-well trap that can be orders of magnitude smaller. This allows us to reach full splitting of a\nBEC of 1.1 μm transverse size (full width at half maximum) at a double-well separation of only 3.4 μm. The\ntrapping wire, in contrast, has a width of 50 μm; the\natoms are located at a distance of 80 μm from the surface. Furthermore, the dynamic splitting process can be\nperformed in a smooth (adiabatic) fashion, avoiding excitations, by simply controlling the parameters of the RF\nfield.\nIn conclusion, we have demonstrated coherent splitting\n\nand interference of BECs using an atom chip. Our experiments are based on a versatile microfabricated beam\nsplitter that is fully integrated on the chip. With our interferometer we have measured and controlled the phase\nevolution between two BECs gradually split over increasingly large distances. We are convinced that such doublewell potentials on atom chips are a starting point for a\nvariety of in-depth studies of the dynamics of one- and\nthree-dimensional quantum gases. Exploring the splitting and recombination process in more detail is an immediate next step, as are detailed studies of tunnelling and\nself-trapping in low-dimensional quantum gases [20, 38].\nOf particular interest will be the time-dependent evolution and phase coherence along low-dimensional correlated quantum systems in the fully split and in the tunnelling regimes. Applications of our scheme may range\nfrom investigations of atom-surface interactions and the\nfundamental question of surface-induced decoherence to\nmicroscopic atom interferometers for precision metrology.\nLast but not least, simple and robust atom chip beam\nsplitters and interferometers based on our beam splitter\nmay constitute the building blocks for quantum information processing on the atom chip [6, 17].\nWe thank H. Perrin and I. Lesanovsky for useful discussions. We acknowledge financial support from the European Union, contract numbers IST-2001-38863 (ACQP),\nMRTN-CT-2003-505032 (Atom Chips), HPRN-CT-200200304 (FASTNet), HPMF-CT-2002-02022, and HPRICT-1999-00114 (LSF) and the Deutsche Forschungsgemeinschaft, contract number SCHM 1599/1-1.\n\n∗\n†\n\n[1]\n\n[2]\n[3]\n[4]\n\n[5]\n[6]\n\n[7]\n[8]\n[9]\n\nElectronic address: schmiedmayer@atomchip.org\nElectronic address:\nkrueger@physi.uni-heidelberg.de;\nURL: http://www.atomchip.net\nG. Badurek, H. Rauch, and A. Zeilinger, eds., Matter\nWave Interferometry (North Holland Physics Publishing\nDivision, Amsterdam, 1988).\nP. Berman, ed., Atom Interferometry, vol. 37 of Adv. At.\nMol. Opt. Phys. (Academic Press, New York, 1997).\nM. Kasevich and S. Chu, Phys. Rev. Lett. 67, 181 (1991).\nM. R. Andrews, C. G. Townsend, H.-J. Miesner, D. S.\nDurfee, D. M. Kurn, and W. Ketterle, Science 275, 637\n(1997).\nR. Folman, P. Krüger, J. Schmiedmayer, J. Denschlag,\nand C. Henkel, Adv. At. Mol. Opt. Phys. 48, 263 (2002).\nM. A. Cirone, A. Negretti, T. Calarco, P. Krger,\nand J. Schmiedmayer (2005), published online DOI:\n10.1140/epjd/e2005-00175-8.\nD. Müller, D. Z. Anderson, R. J. Grow, P. D. D.\nSchwindt, and E. A. Cornell, Phys. Rev. Lett. 83, 5194\n(1999).\nJ. Reichel, W. Hänsel, and T. W. Hänsch, Phys. Rev.\nLett. 83, 3398 (1999).\nR. Folman, P. Krüger, D. Cassettari, B. Hessmo,\nT. Maier, and J. Schmiedmayer, Phys. Rev. Lett. 84,\n4749 (2000).\n\n\f6\n[10] N. H. Dekker, C. S. Lee, V. Lorent, J. H. Thywissen, S. P.\nSmith, M. Drndić, R. M. Westervelt, and M. Prentiss,\nPhys. Rev. Lett. 84, 1124 (2000).\n[11] K. Brugger, P. Krüger, X. Luo, S. Wildermuth, H. Gimpel, M. W. Klein, S. Groth, R. Folman, I. Bar-Joseph,\nand J. Schmiedmayer, Phys. Rev. A 72, 023607 (2005).\n[12] P. Krüger, X. Luo, M. W. Klein, K. Brugger, A. Haase,\nS. Wildermuth, S. Groth, I. Bar-Joseph, R. Folman, and\nJ. Schmiedmayer, Phys. Rev. Lett. 91, 233201 (2003).\n[13] R. Dumke, T. Müther, M. Volk, W. Ertmer, and G. Birkl,\nPhys. Rev. Lett. 89, 220402 (2002).\n[14] P. Treutlein, P. Hommelhoff, T. Steinmetz, T. W.\nHänsch, and J. Reichel, Phys. Rev. Lett. 92, 203005\n(2004).\n[15] Y.-J. Wang, D. Z. Anderson, V. M. Bright, E. A. Cornell,\nQ. Diot, T. Kishimoto, M. Prentiss, R. A. Saravanan,\nS. R. Segal, and S. Wu, Phys. Rev. Lett. 94 (2005).\n[16] A. Günther, S. Kraft, M. Kemmler, D. Koelle,\nR. Kleiner, C. Zimmermann, and J. Fortagh (2005),\ncond-mat/0504210.\n[17] T. Calarco, E. A. Hinds, D. Jaksch, J. Schmiedmayer,\nJ. I. Cirac, and P. Zoller, Phys. Rev. A 61, 022304 (2000).\n[18] E. Charron, E. Tiesinga, F. Mies, and C. Williams, Phys.\nRev. Lett. 88, 077901 (2002).\n[19] Y. Shin, M. Saba, T. A. Pasquini, W. Ketterle, D. E.\nPritchard, and A. E. Leanhardt, Phys. Rev. Lett. 92,\n050405 (2004).\n[20] M. Albiez, R. Gati, J. Flling, S. Hunsmann, M. Cristiani,\nand M. K. Oberthaler1, Phys. Rev. Lett. 95, 010402\n(2005).\n[21] B. D. Josephson, Physics Letters 1, 251 (1962).\n[22] W. H. Zurek, Rev. Mod. Phys. 75, 715 (2003).\n[23] M. Kasevich, Science 298, 1363 (2002).\n[24] D. Cassettari, B. Hessmo, R. Folman, T. Maier, and\nJ. Schmiedmayer, Phys. Rev. Lett. 85, 5483 (2000).\n[25] D. Müller, E. A. Cornell, M. Prevedelli, P. D. D.\n\n[26]\n[27]\n[28]\n[29]\n[30]\n[31]\n\n[32]\n[33]\n\n[34]\n[35]\n[36]\n[37]\n\n[38]\n\nSchwindt, A. Zozulya, and D. Z. Anderson, Opt. Lett.\n25, 1382 (2000).\nP. Hommelhoff, W. Hnsel, T. Steinmetz, T. W. Hnsch,\nand J. Reichel, New Journal of Physics 7, 3 (2005).\nY. Shin, C. Sanner, G.-B. Jo, T. A. Pasquini, M. Saba,\nW. Ketterle, D. E. Pritchard, M. Vengalattore, and\nM. Prentiss (2005), cond-mat/0506464.\nE. Muskat, D. Dubbers, and O. Schrpf, Phys. Rev. Lett.\n58, 2047 (1987).\nO. Zobay and B. M. Garraway, Phys. Rev. Lett. 86, 1195\n(2001).\nY. Colombe, E. Knyazchyan, O. Morizot, B. Mercier,\nV. Lorent, and H. Perrin, Europhys. Lett. 67, 593 (2004).\nS. Wildermuth, P. Krüger, C. Becker, M. Brajdic,\nS. Haupt, A. Kasper, R. Folman, and J. Schmiedmayer,\nPhys. Rev. A 69, 030901(R) (2004).\nS. Groth, P. Krüger, S. Wildermuth, R. Folman, T. Fernholz, D. Mahalu, I. Bar-Joseph, and J. Schmiedmayer,\nAppl. Phys. Lett. 85, 2980 (2004).\nP. Krüger, L. M. Andersson, S. Wildermuth, S. Hofferberth, E. Haller, S. Aigner, S. Groth, I. Bar-Joseph, and\nJ. Schmiedmayer (2005), cond-mat/0504686.\nS. Wildermuth, S. Hofferberth, I. Lesanovsky, E. Haller,\nL. M. Andersson, S. Groth, I. Bar-Joseph, P. Krüger, and\nJ. Schmiedmayer, Nature 435, 440 (2005).\nA. Röhrl, M. Naraschewski, A. Schenzle, and H. Wallis,\nPhys. Rev. Lett. 78, 4143 (1997).\nN. K. Whitlock and I. Bouchoule, Phys. Rev. A 68,\n053609 (2003).\nJ. Estève, T. Schumm, J.-B. Trebbia, I. Bouchoule,\nA. Aspect, and C. I. Westbrook, Eur. Phys. J. D 35,\n141 (2005).\nS. Giovanazzi, R. Shenoy, A. Smerzi, and S. Fantoni,\nPhys. Rev. Lett. 79, 4950 (1997).\n\n\f"}