{"id": "http://arxiv.org/abs/quant-ph/0501066v3", "guidislink": true, "updated": "2005-09-30T14:49:22Z", "updated_parsed": [2005, 9, 30, 14, 49, 22, 4, 273, 0], "published": "2005-01-13T04:21:15Z", "published_parsed": [2005, 1, 13, 4, 21, 15, 3, 13, 0], "title": "The Symmetric Group Defies Strong Fourier Sampling: Part II", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=quant-ph%2F0501008%2Cquant-ph%2F0501049%2Cquant-ph%2F0501147%2Cquant-ph%2F0501159%2Cquant-ph%2F0501072%2Cquant-ph%2F0501173%2Cquant-ph%2F0501164%2Cquant-ph%2F0501137%2Cquant-ph%2F0501179%2Cquant-ph%2F0501036%2Cquant-ph%2F0501118%2Cquant-ph%2F0501050%2Cquant-ph%2F0501122%2Cquant-ph%2F0501043%2Cquant-ph%2F0501006%2Cquant-ph%2F0501111%2Cquant-ph%2F0501019%2Cquant-ph%2F0501069%2Cquant-ph%2F0501073%2Cquant-ph%2F0501150%2Cquant-ph%2F0501154%2Cquant-ph%2F0501059%2Cquant-ph%2F0501109%2Cquant-ph%2F0501079%2Cquant-ph%2F0501060%2Cquant-ph%2F0501025%2Cquant-ph%2F0501115%2Cquant-ph%2F0501108%2Cquant-ph%2F0501110%2Cquant-ph%2F0501064%2Cquant-ph%2F0501094%2Cquant-ph%2F0501020%2Cquant-ph%2F0501101%2Cquant-ph%2F0501055%2Cquant-ph%2F0501007%2Cquant-ph%2F0501184%2Cquant-ph%2F0501010%2Cquant-ph%2F0501057%2Cquant-ph%2F0501176%2Cquant-ph%2F0501177%2Cquant-ph%2F0501180%2Cquant-ph%2F0501182%2Cquant-ph%2F0501117%2Cquant-ph%2F0501116%2Cquant-ph%2F0501062%2Cquant-ph%2F0501166%2Cquant-ph%2F0501042%2Cquant-ph%2F0501146%2Cquant-ph%2F0501132%2Cquant-ph%2F0501022%2Cquant-ph%2F0501035%2Cquant-ph%2F0501143%2Cquant-ph%2F0501037%2Cquant-ph%2F0501039%2Cquant-ph%2F0501103%2Cquant-ph%2F0501149%2Cquant-ph%2F0501054%2Cquant-ph%2F0501009%2Cquant-ph%2F0501144%2Cquant-ph%2F0501134%2Cquant-ph%2F0501095%2Cquant-ph%2F0501160%2Cquant-ph%2F0501003%2Cquant-ph%2F0501104%2Cquant-ph%2F0501024%2Cquant-ph%2F0501105%2Cquant-ph%2F0501077%2Cquant-ph%2F0501048%2Cquant-ph%2F0501034%2Cquant-ph%2F0501075%2Cquant-ph%2F0501041%2Cquant-ph%2F0501119%2Cquant-ph%2F0501121%2Cquant-ph%2F0501083%2Cquant-ph%2F0501145%2Cquant-ph%2F0501135%2Cquant-ph%2F0501012%2Cquant-ph%2F0501169%2Cquant-ph%2F0501171%2Cquant-ph%2F0501170%2Cquant-ph%2F0501127%2Cquant-ph%2F0501161%2Cquant-ph%2F0501098%2Cquant-ph%2F0501172%2Cquant-ph%2F0501136%2Cquant-ph%2F0501107%2Cquant-ph%2F0501029%2Cquant-ph%2F0501066%2Cquant-ph%2F0501011%2Cquant-ph%2F0501033%2Cquant-ph%2F0501068%2Cquant-ph%2F0501148%2Cquant-ph%2F0501088%2Cquant-ph%2F0501001%2Cquant-ph%2F0501016%2Cquant-ph%2F0501125%2Cquant-ph%2F0501178%2Cquant-ph%2F0501162%2Cquant-ph%2F0501061%2Cquant-ph%2F0501097%2Cquant-ph%2F0501130&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Symmetric Group Defies Strong Fourier Sampling: Part II"}, "summary": "Part I of this paper showed that the hidden subgroup problem over the\nsymmetric group--including the special case relevant to Graph\nIsomorphism--cannot be efficiently solved by strong Fourier sampling, even if\none may perform an arbitrary POVM on the coset state. In this paper, we extend\nthese results to entangled measurements. Specifically, we show that the hidden\nsubgroup problem on the symmetric group cannot be solved by any POVM applied to\npairs of coset states. In particular, these hidden subgroups cannot be\ndetermined by any polynomial number of one- or two-register experiments on\ncoset states.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=quant-ph%2F0501008%2Cquant-ph%2F0501049%2Cquant-ph%2F0501147%2Cquant-ph%2F0501159%2Cquant-ph%2F0501072%2Cquant-ph%2F0501173%2Cquant-ph%2F0501164%2Cquant-ph%2F0501137%2Cquant-ph%2F0501179%2Cquant-ph%2F0501036%2Cquant-ph%2F0501118%2Cquant-ph%2F0501050%2Cquant-ph%2F0501122%2Cquant-ph%2F0501043%2Cquant-ph%2F0501006%2Cquant-ph%2F0501111%2Cquant-ph%2F0501019%2Cquant-ph%2F0501069%2Cquant-ph%2F0501073%2Cquant-ph%2F0501150%2Cquant-ph%2F0501154%2Cquant-ph%2F0501059%2Cquant-ph%2F0501109%2Cquant-ph%2F0501079%2Cquant-ph%2F0501060%2Cquant-ph%2F0501025%2Cquant-ph%2F0501115%2Cquant-ph%2F0501108%2Cquant-ph%2F0501110%2Cquant-ph%2F0501064%2Cquant-ph%2F0501094%2Cquant-ph%2F0501020%2Cquant-ph%2F0501101%2Cquant-ph%2F0501055%2Cquant-ph%2F0501007%2Cquant-ph%2F0501184%2Cquant-ph%2F0501010%2Cquant-ph%2F0501057%2Cquant-ph%2F0501176%2Cquant-ph%2F0501177%2Cquant-ph%2F0501180%2Cquant-ph%2F0501182%2Cquant-ph%2F0501117%2Cquant-ph%2F0501116%2Cquant-ph%2F0501062%2Cquant-ph%2F0501166%2Cquant-ph%2F0501042%2Cquant-ph%2F0501146%2Cquant-ph%2F0501132%2Cquant-ph%2F0501022%2Cquant-ph%2F0501035%2Cquant-ph%2F0501143%2Cquant-ph%2F0501037%2Cquant-ph%2F0501039%2Cquant-ph%2F0501103%2Cquant-ph%2F0501149%2Cquant-ph%2F0501054%2Cquant-ph%2F0501009%2Cquant-ph%2F0501144%2Cquant-ph%2F0501134%2Cquant-ph%2F0501095%2Cquant-ph%2F0501160%2Cquant-ph%2F0501003%2Cquant-ph%2F0501104%2Cquant-ph%2F0501024%2Cquant-ph%2F0501105%2Cquant-ph%2F0501077%2Cquant-ph%2F0501048%2Cquant-ph%2F0501034%2Cquant-ph%2F0501075%2Cquant-ph%2F0501041%2Cquant-ph%2F0501119%2Cquant-ph%2F0501121%2Cquant-ph%2F0501083%2Cquant-ph%2F0501145%2Cquant-ph%2F0501135%2Cquant-ph%2F0501012%2Cquant-ph%2F0501169%2Cquant-ph%2F0501171%2Cquant-ph%2F0501170%2Cquant-ph%2F0501127%2Cquant-ph%2F0501161%2Cquant-ph%2F0501098%2Cquant-ph%2F0501172%2Cquant-ph%2F0501136%2Cquant-ph%2F0501107%2Cquant-ph%2F0501029%2Cquant-ph%2F0501066%2Cquant-ph%2F0501011%2Cquant-ph%2F0501033%2Cquant-ph%2F0501068%2Cquant-ph%2F0501148%2Cquant-ph%2F0501088%2Cquant-ph%2F0501001%2Cquant-ph%2F0501016%2Cquant-ph%2F0501125%2Cquant-ph%2F0501178%2Cquant-ph%2F0501162%2Cquant-ph%2F0501061%2Cquant-ph%2F0501097%2Cquant-ph%2F0501130&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Part I of this paper showed that the hidden subgroup problem over the\nsymmetric group--including the special case relevant to Graph\nIsomorphism--cannot be efficiently solved by strong Fourier sampling, even if\none may perform an arbitrary POVM on the coset state. In this paper, we extend\nthese results to entangled measurements. Specifically, we show that the hidden\nsubgroup problem on the symmetric group cannot be solved by any POVM applied to\npairs of coset states. In particular, these hidden subgroups cannot be\ndetermined by any polynomial number of one- or two-register experiments on\ncoset states."}, "authors": ["Cristopher Moore", "Alexander Russell"], "author_detail": {"name": "Alexander Russell"}, "author": "Alexander Russell", "arxiv_comment": "18 pages; v2: fix typos, v3: adds technical lemma and revises Lemma\n  19", "links": [{"href": "http://arxiv.org/abs/quant-ph/0501066v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/quant-ph/0501066v3", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cs.CC", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/quant-ph/0501066v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/quant-ph/0501066v3", "journal_reference": null, "doi": null, "fulltext": "The Symmetric Group Defies Strong Fourier Sampling: Part II\n\narXiv:quant-ph/0501066v3 30 Sep 2005\n\nCristopher Moore\nmoore@cs.unm.edu\nDepartment of Computer Science\nUniversity of New Mexico\n\nAlexander Russell\nacr@cse.uconn.edu\nDepartment of Computer Science and Engineering\nUniversity of Connecticut\nFebruary 1, 2008\nAbstract\n\nPart I of this paper showed that the hidden subgroup problem over the symmetric group-including\nthe special case relevant to Graph Isomorphism-cannot be efficiently solved by strong Fourier sampling,\neven if one may perform an arbitrary POVM on the coset state. In this paper, we extend these results\nto entangled measurements. Specifically, we show that the case of the hidden subgroup problem which\nis relevant to Graph Isomorphism cannot be solved by any polynomial number of experiments on oneor two-register coset states.\n\n1\n\nIntroduction: the hidden subgroup problem\n\nMany problems of interest in quantum computing can be reduced to an instance of the Hidden Subgroup\nProblem (HSP). This is the problem of determining a subgoup H of a group G given oracle access to a\nfunction f : G → S with the property that\nf (g) = f (hg) ⇔ h ∈ H .\nEquivalently, f is constant on the cosets of H and takes distinct values on distinct cosets.\nAll known efficient solutions to the problem rely on the standard method or the method of Fourier\nsampling [3], described below.\nStep 1. Prepare two registers, the first in a uniform superposition over the elements of G and the second\nwith the value zero, yielding the state\n1 X\n|gi ⊗ |0i .\nψ1 = p\n|G| g∈G\n\nStep 2. Query (or calculate) the function f defined on G and XOR it with the second register. This\nentangles the two registers and results in the state\n1 X\nψ2 = p\n|gi ⊗ |f (g)i .\n|G| g∈G\n\nStep 3. Measure the second register. This puts the first register in a uniform superposition over one of f 's\nlevel sets, i.e., one of the cosets of H, and disentangles it from the second register. If we observe the\nvalue f (c), we have the state ψ3 ⊗ |f (c)i where\nX\n1\nψ3 = |cHi = p\n|chi .\n|H| h∈H\n1\n\n\fStep 4. Carry out the quantum Fourier transform on ψ3 and measure the result.\nThe result of Step 3 above is the coset state |cHi, where c is chosen uniformly from G. Expressing this\nas a mixed state, let\n1 X\nρH =\n|cHi hcH| .\n|G|\nc∈G\n\nWe shall focus on the hidden conjugate problem, where the hidden subgroup is a random conjugate H g =\ng −1 Hg of a known (non-normal) subgroup H. It was shown in the first part of this paper that when G = S2n ,\nthe symmetric group on 2n letters, and H is a the subgroup generated by the involution (1 2) . . . (2n − 1 2n),\nthe outcome of any measurement on ρH is nearly independent of the random choice of g ∈ Sn . In particular,\nno polynomial number of coset state experiments can determine such a hidden subgroup with non-negligible\nprobability.\nIt is known, however, that a measurement exists to determine hidden subgroups of a group G from\nk = poly log |G| independent copies of ρH . In light of the discussion above, this measurement cannot, in\ngeneral, be a product measurement: it must involve entangled measurement operators. In this paper, we\nextend the framework of part I to such entangled measurements, showing that for the subgroup H of S2n\ndescribed above, the result of any measurement of the two-coset state ρH g ⊗ ρH g is nearly independent\nof g. In particular, no polynomial number of two-register coset-state experiments can determine H with\nnon-negligible probability.\nRelated work. Both Simon's and Shor's seminal algorithms rely on the standard method over an Abelian\ngroup. In Simon's problem [29], G = Zn2 and f is an oracle such that, for some y, f (x) = f (x + y) for all\nx; in this case H = {0, y} and we wish to identify y. In Shor's factoring algorithm [28] G is the group Z∗n\nwhere n is the number we wish to factor, f (x) = rx mod n for a random r < n, and H is the subgroup of\nZ∗n whose index is the multiplicative order of r. (Note that in Shor's algorithm, since |Z∗n | is unknown, the\nFourier transform is performed over Zq for some q = poly(n); see [28] or [10, 11].)\nFor such abelian instances; it is not hard to see that a polynomial number (i.e., polynomial in log |G|)\nof experiments of this type determine H. In essence, each experiment yields a random element of the dual\nspace H ⊥ perpendicular to H's characteristic function, and as soon as these elements span H ⊥ they, in\nparticular, determine H.\nWhile the nonabelian hidden subgroup problem appears to be much more difficult, it has very attractive\napplications. In particular, solving the HSP for the symmetric group Sn would provide an efficient quantum\nalgorithm for the Graph Automorphism and Graph Isomorphism problems (see e.g. Jozsa [17] for a review).\nAnother important motivation is the relationship between the HSP over the dihedral group with hidden shift\nproblems [4] and cryptographically important cases of the Shortest Lattice Vector problem [23].\nSo far, algorithms for the HSP are only known for a few families of nonabelian groups, including wreath\nproducts Zk2 ≀ Z2 [24]; more generally, semidirect products K ⋉ Zk2 where K is of polynomial size, and\ngroups whose commutator subgroup is of polynomial size [16]; \"smoothly solvable\" groups [7]; and some\nsemidirect products of cyclic groups [14]. Ettinger and Høyer [5] provided another type of result, by showing\nthat Fourier sampling can solve the HSP for the dihedral groups Dn in an information-theoretic sense. That\nis, a polynomial number of experiments gives enough information to reconstruct the subgroup, though it is\nunfortunately unknown how to determine H from this information in polynomial time.\nTo discuss Fourier sampling for a nonabelian group G, one needs to develop the Fourier transform over\nG. For abelian groups, the Fourier basis functions are homomorphisms φ : G → C such as the familiar\nexponential function φk (x) = e2πikx/n for the cyclic group Zn . In the nonabelian case, there are not enough\nsuch homomorphisms to span the space of all C-valued functions on G; to complete the picture, one introduces\nrepresentations of the group, namely homomorphisms ρ : G → U(V ) where U(V ) is the group of unitary\nmatrices acting on some C-vector space V of dimension dρ . It suffices to consider irreducible representations,\nnamely those for which no nontrivial subspace of V is fixed by the various operators ρ(g). Once a basis for\neach irreducible ρ is chosen, the matrix elements ρij provide an orthogonal basis for the vector space of all\nC-valued functions on G.\n2\n\n\fPThe quantum Fourier transform then consists of transforming (unit-length) vectors in C[G] =\n{ g∈G αg |gi | αg ∈ C} from the basis {|gi | g ∈ G} to the basis {|ρ, i, ji} where ρ is the name of an\nirreducible representation and 1 ≤ i, j ≤ dρ index a row and column (in a chosen basis for V ). Indeed,\nthis transformation can be carried out efficiently for a wide variety of groups [2, 13, 21]. Note, however,\nthat a nonabelian group G does not distinguish any specific basis for its irreducible representations which\nnecessitates a rather dramatic choice on the part of the transform designer. Indeed, careful basis selection\nappears to be critical for obtaining efficient Fourier transforms for the groups mentioned above.\nPerhaps the most fundamental question concerning the hidden subgroup problem is whether there is\nalways a basis for the representations of G such that measuring in this basis (in Step 4, above) provides\nenough information to determine the subgroup H. This framework is known as strong Fourier sampling.\nPart I of this article answers this question in the negative, showing that natural subgroups of Sn cannot\nbe determined by this process; in fact, it shows this for an even more general model, where we perform\nan arbitrary positive operator-valued measurement (POVM) on coset states |cHi. We emphasize that this\nresult includes the most important special cases of the nonabelian HSP, as they are those to which Graph\nIsomorphism naturally reduces. Namely, as in [12] we focus on order-2 subgroups of the form {1, m}, where\nm is an involution consisting of n/2 disjoint transpositions; then if we fix two rigid connected graphs of size\nn/2 and consider permutations of their disjoint union, then the hidden subgroup is of this form if the graphs\nare isomorphic and trivial if they are not.\nThe next logical step is to consider multi-register algorithms, in which we prepare multiple coset states\nand subject them to entangled measurements. Ettinger, Høyer and Knill [6] showed that the HSP on arbitrary groups can be solved information-theoretically with a polynomial number of registers, although their\nalgorithm\ntakes exponential time for most groups of interest. Kuperberg [20] devised a subexponential\n√\n(2O( log n) ) algorithm for the HSP on the dihedral group Dn that works by performing entangled measurements on two registers at a time, and Bacon, Childs, and van Dam [1] have determined the optimal\nmultiregister measurement for the dihedral group.\nWhether a similar approach can be taken for the symmetric group is a major open question. In this\npaper, we take a step towards answering this question by showing that if we perform arbitrary entangled\nmeasurements over pairs of registers, distinguishing\nH = {1, m} from the trivial group in Sn requires a\n√\nsuperpolynomial number (specifically, eΩ( n/ log n) ) of experiments.\n\n2\n\nTwo combinatorial representations\n\nWith apologies to the reader, we will rely on the introductory sections of Part I rather than repeating them\nhere. However, here we introduce two combinatorial representations that will be extremely useful to us.\nb denote a collection of unitary representations of G consisting of exactly one from\nFor a group G, we let G\neach isomorphism class. We let C[G] denote the group algebra of G; this is the |G|-dimensional vector space\nof formal sums\nnX\no\nαg * g | αg ∈ C\ng\n\nequipped with the unique inner product for which hg, hi is equal to one when g = h and zero otherwise. (Note\nthat C[G] is precisely the Hilbert space of a single register containing a superposition of group elements.)\nWe introduce two combinatorial representations related to the group algebra. The first is the regular\nrepresentation R, given by the permutation action of G on itself. Then R is the representation R : G →\nU(C[G]) given by linearly extending left multiplication, R(g) : h 7→ gh. It is not hard to see that its character\nχR is given by\n(\n|G| g = 1 ,\nχR (g) =\n0\ng 6= 1 ,\nb Thus R contains dρ copies of each irreducible ρ ∈ G,\nb\nin which case we have hχR , χρ iG = dσ for each ρ ∈ G.\nP\n2\nand counting dimensions on each side of this decomposition implies |G| = ρ∈Gb dρ .\n3\n\n\fThe other combinatorial representation we will rely on is the conjugation representation C, given by the\nconjugation action of G on C[G]. Specifically, C : G → U(C[G]) is the map obtained by linearly extending\nthe rule C(g) : h 7→ ghg −1 . While the decomposition of C into irreducibles is, in general, unknown, one does\nhave the decomposition\nM\nX\nC=\nρ ⊗ ρ∗ and therefore χC (g) =\nχρ (g)χρ (g)∗ .\n(2.1)\nb\nρ∈G\n\nb\nρ∈G\n\nHere ρ∗ denotes the complex conjugate representation of ρ, which acts on vectors u∗ as ρ∗ (g)u = (ρ(g)u)∗ .\nWe also note that an elementary argument shows that\nχC (g) =\n\n|G|\n,\n|[g]|\n\nwhere [g] = {h−1 gh | h ∈ G} denotes the conjugacy class of g.\n\n3\n3.1\n\nBackground from Part I\nThe structure of the optimal measurement\n\nAs in Part I, we focus on the special case of the hidden subgroup problem called the hidden conjugate problem\nin [22]. Here there is a (non-normal) subgroup H, and we are promised that the hidden subgroup is one of\nits conjugates, H g = g −1 Hg for some g ∈ G; the goal is to determine which.\nThe most general possible measurement in quantum mechanics is a positive operator-valued measurement\n(POVM). Part I of this paper establishes that the optimal POVM for the Hidden Subgroup Problem on a\nsingle coset state consists of measuring the name ρ of the irreducible representation, followed by a POVM\non the vector space V on which ρ acts. In the special case of a von Neumann measurement, this corresponds\nto measuring the row of ρ in some orthonormal basis; in general it consists of measuring according to some\nover-complete basis, or frame, B = {b} with positive real weights ab that obeys the completeness condition\nX\n(3.1)\nab πb = 1 ,\nb\n\nwhere πb denotes the projection onto the unit length vector b. We remark that the frame B weighted\naccording to a is energy-conserving in the sense that\nX\nX\na(b)πb (x)i =\nab kπb (x)k2 .\nkxk2 = hx, 1xi = hx,\nb\n\nb\n\nDuring Fourier sampling, the probability we observe ρ, and the conditional probability that we observe\na given b ∈ B, are given by\nP (ρ) =\nP (ρ, b) =\n\nwhere ΠH is the projection operator 1/|H|\nand P (ρ, bj ) is given by\n\nP\n\nh∈H\n\ndρ |H|\nrk ΠH\n|G|\n\n(3.2)\n\naj\n\n(3.3)\n\nkΠH bk\nrk ΠH\n\n2\n\nρ(h). In the case where H is the trivial subgroup, ΠH = 1dρ\n\nP (ρ, b) =\n\nab\n.\ndρ\n\n(3.4)\n\nWe call this the natural distribution on the frame B = {b}. In the case that B is an orthonormal basis,\nab = 1 and this is simply the uniform distribution. This probability distribution over B changes for a\nconjugate H g in the following way:\n2\nkΠH gbk\nP (ρ, b) = aj\nrk ΠH\n4\n\n\f2\n\nwhere we write gb for ρ(g)b. It is not hard to show that, for any b ∈ V , the expected value of kΠH (gb)k ,\nover the choice of g ∈ G, is rk ΠH /dρ .\n\n3.2\n\nThe expectation and variance of an involution projector\n\nThe following lemmas are proved in Part I; we repeat them here for convenience.\nLemma 1. Let ρ be a representation of a group G acting on a space V and let b ∈ V . Let m be an element\nchosen uniformly from a conjugacy class I of involutions. If ρ is irreducible, then\nExpm hb, mbi =\nIf ρ is reducible, then\nExpm hb, mbi =\n\nχρ (I)\n2\nkbk .\ndim ρ\n\nX χσ (I)\n2\nkΠρσ bk .\ndim\nσ\nσ≺ρ\n\nLemma 2. Let ρ be a representation of a group G acting on a space V and let b ∈ V . Let m be an element\nchosen uniformly at random from a conjugacy class I of involutions. Then\nX χσ (I)\n2\n∗\n2\nExpm |hb, mbi| =\nΠρ⊗ρ\n(b ⊗ b∗ )\n.\nσ\ndim σ\nσ≺ρ⊗ρ∗\nGiven an involution m and the hidden subgroup H = {1, m}, let Πm = ΠH denote the projection operator\ngiven by\nv + mv\n.\nΠm v =\n2\n2\nThen the expectation and variance of kΠm bk are given by the following lemma.\nLemma 3. Let ρ be an irreducible representation acting on a space V and let b ∈ V . Let m be an element\nchosen uniformly at random from a conjugacy class I of involutions. Then\n\u0013\n\u0012\n1\nχρ (I)\n2\n2\nExpm kΠm bk =\nkbk 1 +\n(3.5)\n2\ndim ρ\n2\n∗\n1 X χσ (I)\n2\nVarm kΠm bk ≤\nΠρ⊗ρ\n(b ⊗ b∗ )\n.\n(3.6)\nσ\n4 σ≺ρ⊗ρ∗ dim σ\nFinally, we point out that since\n2\n\nExpm kΠm bk = kbk\nwe have\n\n3.3\n\nrk Πm\n1\n=\ndim ρ\n2\n\n2\n\nrk Πm\ndim ρ\n\n\u0012\n\u0013\nχρ (I)\n1+\n.\ndim ρ\n\n(3.7)\n\nThe representation theory of the symmetric group\n\nWe will use several specific properties of the symmetric group Sn and its asymptotic representation theory;\nwe refer the reader to Section 5 of Part I for more background and notation. Recall that the irreducible\nrepresentations S λ of Sn are labeled by Young diagrams λ, and that the number of irreducible representations\nis the partition number p(n), which obeys\n√\np\n(3.8)\np(n) < eδ n where δ = π 2/3 .\nWe denote the dimension and character of S λ as dλ and χλ respectively. Recall also that the Plancherel\ndistribution assigns the probability d2ρ /|G| to each irreducible representation ρ. Then we will rely on the\nfollowing results of Vershik and Kerov.\n5\n\n\fcn according to the Plancherel distribution. Then there exist\nTheorem 4 ([30]). Let S λ be chosen from S\npositive constants c1 and c2 for which\nh\n√ √\n√ √ i\nlim Pr e−c1 n n! ≤ dλ ≤ e−c2 n n! = 1 .\nn→∞\n\nTheorem 5 ([30]). There exist positive constants č and ĉ such that for all n ≥ 1,\n√ √\n√ √\ne−č n n! ≤ max dλ ≤ e−ĉ n n! .\ncn\nS λ ∈S\n\nIn Part I we prove the following:\n\ncn .\nLemma 6. Let S λ be chosen according to the Plancherel distribution on S\nh\n√ √ i\n√\np\n1. Let δ = π 2/3 as in (3.8). Then for sufficiently large n, Pr dλ ≤ e−δ n n! < e−δ n .\n2. Let 0 < c < 1/2. Then Pr[dλ ≤ ncn ] = n−Ω(n) .\n\nFinally, we will also apply Roichman's [25] estimates for the characters of the symmetric group:\nDefinition 1. For a permutation π ∈ Sn , define the support of π, denoted supp(π), to be the cardinality of\nthe set {k ∈ [n] | π(k) 6= k}.\nTheorem 7 ([25]). There exist constants b > 0 and 0 < q < 1 so that for n > 4, for every conjugacy class\nC of Sn , and every irreducible representation S λ of Sn ,\nχλ (C)\n≤\ndλ\n\n\u0012\n\u0010 λ λ′ \u0011\u0013b*supp(C)\n1\nmax q, , 1\n,\nn n\n\nwhere supp(C) = supp(π) for any π ∈ C.\nIn our application, we take n to be even and consider involutions m in the conjugacy class of elements\nconsisting of n/2 disjoint transpositions, M = Mn = {σ ((12)(34) * * * (n − 1 n)) σ −1 | σ ∈ Sn }. Note that\neach m ∈ Mn is associated with one of the (n − 1)!! perfect matchings of n things, and that supp(m) = n.\n\n3.4\n\nStrong Fourier sampling on one register\n\nThe main result of Part I is the following.\nTheorem 8. Let B = {b} be a frame with weights {ab } satisfying the completeness condition (3.1) for\nan irreducible representation S λ . Given the hidden subgroup H = {1, m} where m is chosen uniformly at\nrandom from M , let Pm (b) be the probability that we observe the vector b conditioned on having observed\nthe representation name S λ , and let N be the natural distribution (3.4) on B. Then there is a constant δ > 0\nsuch that for sufficiently large n, with probability at least 1 − e−δn in m and λ, we have\nkPm − N k1 < e−δn .\n2\n\nThe proof strategy is to bound Varm kΠm bk using Lemma 3, and apply Chebyshev's inequality to\nconclude that it is almost certainly close to its expectation. Recall, however, that our bounds on the variance\n2\nof kΠm bk depend on the decomposition of S λ ⊗(S λ )∗ is into irreducibles and, furthermore, on the projection\n∗\nof b ⊗ b into these irreducible subspaces. Matters are somewhat complicated by the fact that certain S μ\nappearing in S λ ⊗ (S λ )∗ may contribute more to the variance than others. While Theorem 7 allows us to\nbound the contribution of those constituent irreducible representations S μ for which μ1 and μ′1 are much\nsmaller than n, those which violate this condition could conceivably contribute large terms to the variance\nestimates. Fortunately, in this single coset case, the total fraction of the space S λ ⊗ (S λ )∗ , dimensionwise,\n6\n\n\fconsisting of such S μ is small with overwhelming probability. Despite this, we cannot preclude the possibility\n2\nthat for a specific vector b, the quantity Var kΠm bk is large, as b may project solely into spaces of the type\ndescribed above. On the other hand, as these troublesome spaces amount to a small fraction of S λ ⊗ (S λ )∗ ,\nonly a few b can have this property.\nSpecifically, let 0 < c < 1/4 be a constant, and let Λ = Λc denote the collection of Young diagrams μ\nwith the property that either μ1 ≥ (1 − c)n or μ′1 ≥ (1 − c)n. Then Part I establishes the following upper\nbounds on the cardinality of Λ and the dimension of any S μ with μ ∈ Λ:\n\nLemma 9. Let p(n) denote the number of integer partitions of n. Then |Λ| ≤ 2cnp(cn), and dμ < ncn for\nany μ ∈ Λ.\n\ncn ;\nAs a result, the representations associated with diagrams in Λ constitute a negligible fraction of S\nspecifically, from Lemma 6, part 2, the probability that a λ drawn according to the Plancherel distribution\nfalls into Λ is n−Ω(n) . The following lemma shows that this is also true for the distribution P (ρ) induced on\ncn by weak Fourier sampling the coset state |Hi.\nS\nLemma 10. Let d < 1/2 be a constant and let n be sufficiently large. Then there is a constant γ > 0 such\nthat we observe a representation S λ with dλ ≥ ndn with probability at least 1 − n−γn .\nOn the other hand, for a representation S μ with μ ∈\n/ Λ, Theorem 7 implies that\n\u0001bn\nχμ (M )\n≤ max(q, 1 − c)\n≤ e−αn\nμ\nd\n\n(3.9)\n\nfor a constant α ≥ bc > 0. Thus the contribution of such an irreducible to the variance estimate of Lemma 3\nis exponentially small. The remainder of the proof of Theorem 8 uses a combination of Chebyshev's and\nMarkov's inequalities to bound the total variation distance between Pm and the natural distribution.\n\n4\n\nVariance and decomposition for multiregister experiments\n\nWe turn now to the multi-register case, where Steps 1, 2 and 3 are carried out on k independent registers.\nThis yields a state in C[Gk ], i.e.,\n|c1 Hi ⊗ * * * ⊗ |ck Hi\n\nwhere the ci are uniformly random coset representatives. The symmetry argument of Section 3 of Part I\napplies to each register, so that the optimal measurement is consistent with first measuring the representation\nname in each register. However, the optimal measurement generally does not consist of k independent\nmeasurements on this tensor product state; rather, it is entangled, consisting of measurement in a basis\nwhose basis vectors b are not of the form b1 ⊗ * * * ⊗ bk . As mentioned above, for the dihedral groups\nin particular, a fair amount is known: Ip [15] showed that the optimal measurement for two registers is\nentangled, Kuperberg [20] showed that an entangled measurement yields a subexponential-time algorithm for\nthe hidden subgroup problem, and Bacon, Childs and van Dam [1] have calculated the optimal measurement\non k registers.\nExtending the results of part I to this case involving multiple coset states will proceed in three steps:\n• In Section 4.1, we generalize the expectation and variance bounds of Lemma 3 to the algebra C[Gk ],\nviewed as a representation of G.\n• As in the single register proof, we must control the decomposition of the representations that appear\nin the expressions for expectation and variance. Unfortunately, the naive bounds applied in part I\n(relying on the fact that hχσ , χρ χτ iG ≤ dσ for irreducible representations ρ, σ, and τ ) are insufficient\nfor controlling these decompositions. In Section 4.2, we show how to bound the decomposition of these\nrepresentations on average.\n• Finally, in Section 5, we show how to apply these results to eliminate the possibility of solving the HSP\nover Sn with any polynomial number of two-register experiments on coset states.\n7\n\n\f4.1\n\nVariance for Fourier sampling product states\n\nWe begin by generalizing Lemmas 1, 2, and 3 of Part I to the multi-register case. The reasoning is analogous\nto that of Section 4 of Part I; the principal difficulty is notational, and we ask the reader to bear with us.\nWe assume we have measured the representation name on each of the registers, and that we are currently\nin an irreducible representation of Gk labeled by ρ1 ⊗ * * *⊗ ρk . Given a subset I ⊆ {1, . . . , k}, we can separate\nthis tensor product into the registers inside I and those outside, and then decompose the product of those\ninside I into irreducibles σ:\nO\nO\nρi\nρ1 ⊗ * * * ⊗ ρk =\nρi ⊗\ni∈I\n\nM\n\n=\n\ni∈I\n/\n\naIσ σ\n\nσ≺⊗i∈I ρi\n\n!\n\n⊗\n\nO\n\nρi\n\ni∈I\n/\n\nwhere aIσ is the multiplicity of σ in ⊗i∈I ρi . Now given an irrep σ, let ΠIσ denote the projection operator\nonto the subspace acted on by\nO\nρi .\naIσ σ ⊗\ni∈I\n/\n\nΠIσ\n\nIn other words,\nprojects the registers in I onto the subspaces isomorphic to σ, and leaves the registers\n{i}\noutside I untouched. Note that in the case where I is a singleton we have Πρi = 1.\nAs before, the hidden subgroup is H = {1, m} for an involution m chosen at random from a conjugacy\nclass M . However, we now have, in effect, the subgroup H k ⊂ Gk , and summing over the elements of H k\ngives the projection operator ΠH k = Π⊗k\nm . The probability we observe an (arbitrarily entangled) basis vector\nb ∈ ρ1 ⊗ * * * ⊗ ρk is then\n2\nΠ⊗k\nm b\n.\n(4.1)\nPm (b) =\nrk Π⊗k\nm\nWhen we calculate the expectation of this over m, we will find ourselves summing the following quantity\nover the subsets I ⊆ {1, . . . , k}:\nX χσ (M )\n2\nE I (b) =\nΠIσ b\n(4.2)\ndim\nσ\nσ≺⊗\nρ\ni∈I\n\n∅\n\ni\n\n2\n\nwith E (b) = kbk (since an empty tensor product gives the trivial representation).\nFor the variance, we will find ourselves dealing with pairs of subsets I1 , I2 ⊆ {1, . . . , k} and decompositions\nof the form\n\n! \nO\nO\nO\nO\n(ρ1 ⊗ * * * ⊗ ρk ) ⊗ (ρ∗1 ⊗ * * * ⊗ ρ∗k ) =\nρi ⊗\nρ∗i ⊗ \nρ∗i \nρi ⊗\ni∈I1\n\n\n\n= \n\nσ≺\n\ni∈I2\n\nN\n\ni∈I\n\nM\nρi ⊗\n\nN\n\ni∈I\n/ 1\n\ni∈I2\n\nρ∗\ni\n\n\n\ni∈I\n/ 2\n\n\n\naIσ1 ,I2 σ  ⊗ \n\nO\n\ni∈I\n/ 1\n\nρi ⊗\n\nO\n\ni∈I\n/ 2\n\n\n\nρ∗i \n\njust as we considered ρ ⊗ ρ∗ in the one-register case. We can then define a projection operator ΠIσ1 ,I2 onto\nthe subspace acted on by\n\n\nO\nO\nρ∗i \naIσ1 ,I2 σ ⊗ \nρi ⊗\ni∈I\n/ 1\n\ni∈I\n/ 2\n\nand we define the following quantity,\n\nE I1 ,I2 (b) =\nσ≺\n\nN\n\ni∈I\n\nX\nρi ⊗\n\nN\n\ni∈I2\n\nρ∗\ni\n\n8\n\nχσ (M )\nΠIσ1 ,I2 (b ⊗ b∗ )\ndim σ\n\n2\n\n(4.3)\n\n\f4\n\nwith E ∅,∅ (b) = kbk .\nWe can now state the following lemma. The reader can check that (4.5) corresponds exactly to Equation\n(4.3) of part I in the one-register case.\nLemma 11. Let b ∈ ρ1 ⊗ * * * ⊗ ρk and let m be an element chosen uniformly from a conjugacy class M of\ninvolutions. Then\n\n\nX\n1 \n2\n⊗k\nE I (b)\n(4.4)\n1+\nExpm Πm\nb\n=\n2k\nVarm Π⊗k\nm b\n\n2\n\n=\n\n1\n4k\n\nI⊆{1,...,k}:I6=∅\n\nX\n\nI1 ,I2 ⊆{1,...,k}:I1 ,I2 6=∅\n\nE I1 ,I2 (b) − E I1 (b)E I2 (b)∗ .\n\n(4.5)\n\nProof. Let mI denote the operator that operates on the ith\nN register by m for each i ∈ I and leaves the other\nregisters unchanged. This acts on b as τ (m) where τ = i∈I ρi (m), and Lemma 1 implies that\nExpm hb, mI bi = E I (b) .\n\nThen (4.4) follows from the observation that\nΠ⊗k\nm b=\n\n1\n2k\n\nX\n\nmI b\n\nI⊆{1,...,k}\n\nand so\n⊗k\nExpm Πm\nb\n\n2\n\n= Expm hb, Π⊗k\nm bi =\n\n1\n2k\n\nX\n\nI⊆{1,...,k}\n\nExpm hb, mI bi =\n\n1\n2k\n\nX\n\nE I (b) .\n\nI⊆{1,...,k}\n\nSeparating out the term E ∅ (b) = kbk2 completes the proof of (4.4).\nSimilarly, let the operator mI1 ⊗ mI2 act on b ⊗ b∗ by multiplying the ith register of b by\nNm whenever\niN∈ I1 , and multiplying the ith register of b∗ whenever i ∈ I2 . Then it acts as τ (m) where τ = i∈I1 ρi (m)⊗\n∗\ni∈I2 ρi (m), and Lemma 1 implies\nExpm hb ⊗ b∗ , (mI1 ⊗ mI2 )(b ⊗ b∗ )i = E I1 ,I2 (b) .\n\nThen analogous to Lemmas 2 and 3, the second moment is\nExpm Π⊗k\nm b\n\n4\n\n∗\n⊗k ∗\n= Expm hb, Π⊗k\nm bihb , Πm b i\n\n⊗k\n∗\n= Expm hb ⊗ b∗ , (Π⊗k\nm ⊗ Πm )(b ⊗ b )i\nX\n1\nExpm hb ⊗ b∗ , (mI1 ⊗ mI2 )(b ⊗ b∗ )i\n=\nn\n4\n\n=\n\n1\n4n\n\nI1 ,I2 ⊆{1,...,k}\n\nX\n\nE I1 ,I2 (b)\n\nI1 ,I2 ⊆{1,...,k}\n\nand so the variance is\nVarm Π⊗k\nm b\n\n2\n\n=\n=\n\nExpm Π⊗k\nm b\nX\n1\n4k\n\n4\n\nI1 ,I2 ⊆{1,...,k}\n\n\u0010\n⊗k\n− Expm Πm\nb\n\n\u0011\n2 2\n\nE I1 ,I2 (b) − E I1 (b)E I2 (b)∗ .\n\nFinally, (4.5) follows from the fact that the two terms in the sum cancel whenever I1 or I2 is empty.\n9\n\n\f4.2\n\nThe associated Clebsch-Gordan problem\n\nThe expressions E I (b) and E I1 ,I2 (b) above depend on the decomposition of representations of the form\n\n\nO\nO\nO\nO\nO\nρi ⊗\nρ∗i = \nρ∗i  ⊗\nρi ⊗\n(ρi ⊗ ρ∗i ) .\ni∈I1\n\ni∈I2\n\ni∈I2 \\I1\n\ni∈I1 \\I2\n\ni∈I1 ∩I2\n\nMoreover, since the Plancherel distribution is symmetric with respect to conjugation, this is a tensor product\nof |I1 △I2 | representations ρi with |I1 ∩ I2 | representations σj ⊗ σj∗ , where both the ρi and the σj are chosen\naccording to the Plancherel distribution. This motivates the following definition.\nb k and σ = (σ1 , . . . , σl ) ∈ G\nbl , let\nDefinition 2. For non-negative integers k and l and ρ = (ρ1 , . . . , ρk ) ∈ G\nV (ρ, σ) denote the representation\nl\nk\nO\nO\n(σj ⊗ σj∗ ) .\nρi ⊗\ni=1\n\nj=1\n\nOf particular interest is the dimensionwise fraction of such representations consisting of low-dimensional\nirreducibles. For these representations, the naive decomposition results of Equation (6.4) of Part I no longer\nsuffice to obtain nontrivial estimates. Fortunately, the combinatorial representations R and C discussed in\nSection 2 can be used to control the structural properties of these tensor products on average. We will apply\nthis machinery in Section 5 to control general two-register experiments.\nRecall that the multiplicity of an irreducible representation τ in the decomposition of a representation V\ninto irreducibles is the inner product hχτ , χV iG , and that [g] denotes the conjugacy class of g.\nb and let ρ and σ be random variables taking values in G\nbk and G\nb l , respectively, so\nLemma 12. Fix τ ∈ G\nthat each ρi and σj is independently distributed according to the Plancherel distribution. Then\nExpρ,σ\n\nχτ , χV (ρ,σ) G\ndim V (ρ, σ)\n\n=\n\nExpρ,σ\n\nχτ , χV (ρ,σ) G\ndim V (ρ, σ)\n\n≤\n\ndτ\n|G|\n\nif k > 0 ,\n\ndτ X 1\n|G| g |[g]|l\n\nif k = 0 .\n\nProof. The two permutation representations R and C will play a special role in the analysis: in particular,\nwe will see that the expectation of interest can be expressed in terms of these combinatorial characters.\nSpecifically,\n\n#\n!\n\"\nX X Y d2ρ\nY d2σj hχτ , χV (ρ,σ) iG\nχτ , χV (ρ,σ) G\ni\n\n\n=\nExpρ,σ\n(4.6)\ndim V (ρ, σ)\n|G|\n|G|\ndim V (ρ, σ)\ni\nj\nbl\nb k σ∈G\nρ∈G\n!\nX X Y\n1\n=\n(4.7)\ndρi hχτ , χV (ρ,σ) iG\n|G|k+l\ni\nl\nk\nb\nb\nρ∈G σ∈G\n+\n!\n*\nY\nX\nX\nY\n1\n(4.8)\ndρi χρi  χσj χ∗σj \nχτ ,\n=\n|G|k+l\nj\ni\nbl\nb k σ∈G\nρ∈G\n\n1\nχτ , χkR χlC\n=\n|G|k+l\n\nG\n\n(4.9)\n\nG\n\nQ\nQ\nV (ρ, σ)Qis i dσi * j d2σj and the\nwhere the equality of line (4.7) follows from the fact that the dimension of Q\nequality of line (4.8) follows from the fact that the character of V (ρ, σ) is i χρi j χσj χ∗σj .\n10\n\n\fRecall that for any representation υ we have χυ (1) = dυ . As χR is a multiple of the delta function δg ,\nwhenever k > 1 we have hχτ , χkR χlC iG = dτ |G|k+l−1 and\n\"\n#\nχτ , χV (ρ,σ) G\ndτ\nExpρ,σ\n=\n.\ndim V (ρ, σ)\n|G|\nOn the other hand, when k = 0 we have\n#\n\"\nχτ , χV (ρ,σ) G\n1\n=\nExpρ,σ\nχτ , χlC\ndim V (ρ, σ)\n|G|l\n=\n≤\n\nG\n\n=\n\n1 X ∗\nχ (g)χlC (g)\n|G|l+1 g τ\n\n1\n1 X ∗\n|G|l\n1 X ∗\nχτ (g)\nχτ (g)\n=\nl\nl\nl+1\n|G|\n|G| g\n|[g]|\n|[g]|\ng\ndτ X 1\n,\n|G| g |[g]|l\n\nwhere the last inequality follows from the fact that |χτ (g)| ≤ dτ for all g.\nP\nl\nNow note that the sum\ng 1/ |[g]| can also be written as a sum over the conjugacy classes C. In\nparticular, if l ≥ 2,\nX 1\nX 1\nX 1\n≤\n.\n=\nl\nl−1\n|C|\n|C|\ng |[g]|\nC\nC\nIn the case of the symmetric group Sn , the next lemma shows that this quantity is in fact 1 + o(1).\nP\nLemma 13. Given a partition λ = (λ1 , . . . , λt ) with i λi = n and λi ≥ λi+1 for all i, let Cλ denote the\nconjugacy class of Sn consisting of permutations with cycle structure λ. Then\nX 1\n= 1 + o(1) .\n|Cλ |\nλ\n\nProof. First note that if we group the λi into blocks consisting of τ1 1s, τ2 2s, and so on (such that\nthen the size of the conjugacy class is given by\n\nP\n\ni τi i\n\n= n)\n\nn!\nQ\n|Cλ | = Q\n( i τi !) ( i λi )\n\nsince we can cyclically permute the elements of each cycle, and permute cycles of the same size with each\nother. Thus\n!\n!\nY\nX 1 Y\nX 1\n.\n(4.10)\nλi\nτi !\n=\n|Cλ |\nn!\ni\ni\nλ\n\nλ\n\nNow suppose that the conjugacy class consists of elements with support s, i.e., with τ1 = n − s fixed points.\nSince we can specify such a partition with a partition of s objects, the number of such partitions is at most\np(s). Moreover we have\nY\nY\nτi ! = (n − s)!\nτi ! ≤ (n − s)! (s/2)!\ni\n\nand\n\ni≥2\n\nY\ni\n\nλi =\n\nY\n\nλ>1\n\nλ ≤ es/e .\n\n11\n\n\fsince this is true for any set of reals λ ≥ 0 such that\n\nP\n\nλ = s. Then (4.10) becomes\n\nn\nX 1\nX\n(n − s)! (s/2)!\n≤\np(s)es/e\n|Cλ | s=0\nn!\n\n(4.11)\n\nλ\n\nNow, for s >\n\nand for s ≤\n\n√\nn, we have\n\n(n − s)! (s/2)!\n1 (s/2)!\n(s/2)!\n= n\u0001\n≤\n<\nn!\ns!\ns!\ns\n\n√\nn, for sufficiently large n a stronger bound holds,\n\n\u0012\n\n2s\ne\n\n\u0013−s/2\n\n≤ n−s/4\n\n(4.12)\n\n√\n( n/2)s/2\n(n − s)! (s/2)!\n≤ n−3s/4 .\n≤\nn!\n(n − s)s\n\nThus (4.12) holds for all s. Using the absurdly crude bound p(s) es/e < 4s , (4.11) then becomes\nn\nX 1\nX\n1\n= 1 + O(n−1/4 ) .\n≤\nn−s/4 4s <\n−1/4\n|Cλ | s=0\n1\n−\n4n\nλ\n\nP\nOn the other hand, if l = 1 then the sum g 1/ |[g]| is simply the number of conjugacy classes. Therefore,\nin the case of the symmetric group, we have the following corollary of Lemma 12.\nCorollary 14. Let G = Sn and k, l, ρ, and σ as in Lemma 12. Then for any irreducible character χτ ,\nExpρ,σ\n\nχτ , χV (ρ,σ)\n\nSn\n\ndim V (ρ, σ)\n\n≤ (1 + o(1))\n\ndτ\nn!\n\nunless k = 0 and l = 1, in which case\nExpρ,σ\n\n4.3\n\nχτ , χV (ρ,σ)\n\nSn\n\ndim V (ρ, σ)\n\n≤\n\ndτ p(n)\n.\nn!\n\nA transverse projection lemma\n\nAs a final technical preparatory element, we record a projection lemma concerning the relationship between\ntensor powers of bases and \"transverse\" subspaces.\nLemma 15. Let U and Y be finite-dimensional Hilbert spaces and let B be an orthonormal basis for U ⊗ Y .\nLet W be a subspace of U ⊗ U ∗ and ΠW be the projection operator onto W . Then\nX\n|(ΠW ⊗ 1Y ⊗Y ∗ )(b ⊗ b∗ )|2 ≤ dim Y × dim W .\nb∈B\n\nProof. Since ΠW can be written as a sum of one-dimensional projection operators, it suffices to establish the\nlemma in the case where dim W = 1. Let {ui } be an orthonormal basis for U . Then we can write ΠW = Πw\nwhere\nX\naij (ui ⊗ u∗j ) .\nw=\ni,j\n\n12\n\n\fNow let {zk } be an orthonormal basis for Y . Then\nX\n|(Πw ⊗ 1Y ⊗Y ∗ )(b ⊗ b∗ )|2 =\n|hw ⊗ (zk ⊗ zl∗ ), b ⊗ b∗ i|2\nk,l\n\n=\n\nai,j (ui ⊗\n\nX X\n\nai,j hui ⊗ zk , bi u∗j ⊗ zl∗ , b∗\n\nk,l\n\n=\n\n2\n\nX X\n\nk,l\n\ni,j\n\ni,j\n\n≤\n\n=\n\nX\n\ni\n\ni,l\n\n*\n\n⊗ (zk ⊗\n\nzl∗ ), b\n\n∗\n\n⊗b\n2\n\nX X\nk,l\n\nu∗j )\n\nX\nj\n\n2\n\n|hui ⊗ zk , bi|\n\n!\n\nai,j u∗j ⊗ zl∗ , b∗\n\n\nX X\nai,j u∗j ⊗ zl∗ , b∗\n\ni\n\n+\n\n2\n\nj\n\n2\n\n\n\n\n\nwhere we used the Cauchy-Schwartz inequality in the fourth line. Summing over all b ∈ B then gives\nX\n\nb∈B\n\n|(Πw ⊗ 1Y ⊗Y ∗ )(b ⊗ b∗ )| ≤\n2\n\n=\n\nX\ni,j\n\n2\n\nX X\ni,l\n\nj\n\n2\n\nai,j u∗j ⊗ zl∗\n\n|aij | dim Y = dim Y ,\n\nas desired.\n\n5\n\nTwo registers are insufficient for the symmetric group\n\nIn this section we show that no polynomial number of two-register experiments can distinguish the involutions we have been considering in Sn from each other or from the trivial subgroup. As in Section 4, we\nassume we have measured the representation name on each of the two registers, and that we observed the\nirreducible representations S λ and S μ . For simplicity we present the proof for von Neumann measurements;\nthe generalization to arbitrary frames {b} proceeds exactly as in the proof of Theorem 8.\nTheorem 16. Let B = {b} be an orthonormal basis for S λ ⊗ S μ . Given the hidden subgroup H = {1, m}\nwhere m is chosen uniformly at random from M , let Pm (b) be the probability that we observe the vector b\nconditioned on having observed the representation names S λ and S μ , and let U be the uniform distribution\n√\non B. Then there is a constant δ > 0 such that for sufficiently large n, with probability at least 1−e−δ n/ log n\nin m, λ and μ, we have\n√\nkPm − U k1 < e−δ n/ log n .\nProof. For k = 2, Lemma 11 specializes to the following:\n\nX\n1\n2\n1 +\nExpm Π⊗2\n=\nm b\n4\nVarm Π⊗2\nm b\n\n2\n\n=\n\n1\n16\n\nI⊆{λ,μ}:I6=∅\n\nX\n\nE I (b)\n\nI1 ,I2 ⊆{λ,μ}:I1 ,I2 6=∅\n\n13\n\n\n\nE I1 ,I2 (b) − E I1 (b)E I2 (b)∗ .\n\n(5.1)\n(5.2)\n\n\fAs before, S λ and S μ are chosen with the distribution P (ρ). Since this is exponentially close to the Plancherel\ndistribution [12], we can use Lemma 12 to calculate the expectations over λ and μ of E I (b) and E I1 ,I2 (b) with\nnegligible error. We will then show that E I (b) and E I1 ,I2 (b) are superpolynomially small with the stated\nprobability, for all but a small fraction of basis vectors b, namely those that project into low-dimensional\nrepresentations. As in Theorem 8, we will then use Markov's inequality to control the number of these basis\nvectors and use Chebyshev's inequality to control the rest, and thus bound the total distance kPm − U k1 .\nHowever, the analysis, at least when |I1 | = |I2 | = 2, is more delicate than for the one-register case. As\nbefore, we exclude a set of low-dimensional representations Λ, but now we restrict Λ to Young diagrams with\nwidth or height extremely close to n. Specifically, let c > 0 be a constant to be determined below, and let\nΛ = Λc be the set of Young diagrams ν such that\n√\nmax(ν1 , ν1′ ) ≥ n − c n/ ln n .\n/ Λ,\nAnalogously to (3.9), Theorem 7 provides the following bound on the characters χν for ν ∈\nχν (M )\n≤\ndν\n\n\u0012\n\n1− √\n\nc\nn ln n\n\n\u0013bn\n\n√\n\n< e−α\n\nn/ ln n\n\n(5.3)\n\nwhere α = bc > 0. The size and dimension of Λ is bounded by the following lemma.\n√\n√\n√\n√\nP\nLemma 17. |Λ| = eo( n) and dν < ec n for any ν ∈ Λ. Therefore, ν∈Λ (dν )2 < e2c n+o( n) .\n√\nProof. The proof of Lemma 9 applies, except now |Λ| < 2xp(x) where x = c n/ ln n.\nThen the next lemma shows that with high probability in λ and μ, E I (b) is superpolynomially small for\nall b ∈ B. (Indeed, it is exponentially small for all but a few b, but we give this statement for simplicity.)\ncn . Let I ⊆ {λ, μ},\nLemma 18. Let S μ and S λ be distributed according to the Plancherel distribution in S\n√\nI 6= ∅. There is a constant γ > 0 such that for sufficiently large n, with probability 1 − e−γ n , E I (b) ≤\n√\ne−α n/ ln n for all b ∈ B.\nI\nλ\nλ\nProof. The case when |I| = 1 is identical\n√ to the one-register case, since then E (b) = χ (M )/d . Lemma 6\n−δ n\nimplies λ ∈\n/ Λ with probability 1 − e\n, and (5.3) completes the proof of this case.\nFor the case |I| = 2, it suffices to ensure that S λ ⊗ S μ contains no low-dimensional representations. Let\nν ∈ Λ; then by Lemma 12 and Lemma 17, the expected multiplicity of S ν in S λ ⊗ S μ is\n\nExpλ,μ hχν , χλ χμ iSn = Expλ,μ dλ dμ\n\n√\n√\nhχν , χλ χμ iSn\n≤ e−2ĉ n dν ≤ e(c−2ĉ) n\nλ\nμ\nd d\n\nwhere ĉ is the constant appearing in Theorem 5. Thus if c < ĉ, Lemma 17\n√ and Markov's inequality imply\nthat the probability any S ν with ν ∈ Λ appears in S λ ⊗ S μ is at most e−ĉ n . If none do, then (5.3) and the\nν\nν\nfact that E I ≤ maxν ∈Λ\n/ |χ (M )/d | complete the proof with γ = ĉ.\ncn and I1 , I2 ⊂ {λ, μ}, recall Definition 2 and let\nFor the variance estimates, for each S λ , S μ ∈ S\nV [I1 , I2 ] = V (I1 △I2 , I1 ∩ I2 ) ,\n\nwhere I1 △I2 is the symmetric difference. (We abuse notation here, allowing, e.g., the set I1 △I2 to stand for\nthe tuple of representations S λ with λ ∈ I1 △I2 .) For the variance calculation, as in the single-register case,\nlet L[I1 , I2 ] ⊂ V [I1 , I2 ] be the subspace consisting of copies of representations S ν with ν ∈ Λ, and let ΠL[I1 ,I2 ]\nbe the projection operator onto this subspace; note that the projection oerator in (4.3) is ΠL[I1 ,I2 ] ⊗ 1, where\n1 acts on V [I1 , I2 ]. We will abbreviate L = L[I1 , I2 ] and V = V [I1 , I2 ] when the parameters are clear from\ncontext. Then the following lemma bounds the dimension of this subspace.\n\n14\n\n\fcn and let I1 , I2 ⊆\nLemma 19. Let S λ and S μ be distributed according to the Plancherel distribution in S\n{λ, μ}, √\nI1 , I2 6= ∅. There is a constant β > 0 such that for sufficiently large n, with probability at least\n1 − e−β n ,\nX\n√\n(ΠL[I1 ,I2 ] ⊗ 1)(b ⊗ b∗ ) ≤ e−β n |B| .\nb∈B\n\nProof. If |I1 | = |I2 | = 1 and\nI1 6= I2 , then the proof of the previous lemma shows that L is in fact empty\n√\nwith probability 1 − e−Ω( n) . When I1 = I2 and |I1 | = 1, however, this is not true; taking I1 = I2 = {λ},\nS λ ⊗ (S λ )∗ contains exactly one copy of the trivial representation. However, applying Lemma 15 (with\nU = S λ , Y = S μ , and W = L), Corollary 14, Theorem 5, Lemma 17, and (3.8) gives\n1 X\ndμ dim L\n(ΠL ⊗ 1)(b ⊗ b∗ ) = Expλ,μ\nExpλ,μ\n|B|\n|B|\nb∈B\n1 X ν ν\n= Expλ,μ λ\nd hχ , (χλ )2 iSn\nd\nν∈Λ\n\nd p(n) X ν 2\n(d )\nn!\nλ\n\n≤ Expλ,μ\n≤\n\ne\n\nν∈Λ\n√\n√\n(−ĉ+δ+2c) n+o( n)\n\n√\nn!\n\n= n−Ω(n)\n\nwhere we recall that |B| = dμ dλ and dim V = (dλ )2 .\nWhen |I1 | = 2 and |I2 | = 1, e.g. I1 = {λ, μ} and I2 = {λ}, then dim V = (dλ )2 dμ . Applying Lemma 12\nand taking into account the fact that 1 acts on a space of dimension dμ , we have\n1 X\ndμ dim L\n(ΠL ⊗ 1)(b ⊗ b∗ ) = Expλ,μ\nExpλ,μ\n|B|\n|B|\nb∈B\n1 X ν ν\n= Expλ,μ λ\nd hχ , (χλ )2 χμ iSn\nd\n≤ Expλ,μ\n≤e\n\nν∈Λ\nλ μ X\n\nd d\nn!\n\n(dν )2\n\nν∈Λ\n√\n√\n(−2ĉ+2c) n+o( n)\n\n< e−ĉ\n\n√\nn\n\nif we set c < ĉ/2. The case when |I2 | = 2 and |I1 | = 1 is identical.\nFinally, we consider the case when |I1 | = |I2 | = 2. Now dim V = (dλ )2 (dμ )2 , and Corollary 14 gives\n1 X\ndim L\n(ΠL ⊗ 1)(b ⊗ b∗ ) = Expλ,μ\nExpλ,μ\n|B|\n|B|\nb∈B\n1 X ν ν\n= Expλ,μ λ μ\nd hχ , (χλ )2 iSn\nd d\nν∈Λ\n\n≤ (1 + o(1)) Expλ,μ\n√\n−ĉ n\n\ndλ dμ X ν 2\n(d )\nn!\nν∈Λ\n\nwhich, as in the previous case, is less than e\nif we set c < ĉ/2.\nThus, in all three cases we have\n√\n1 X\n(ΠL ⊗ 1)(b ⊗ b∗ ) < e−ĉ n .\nExpλ,μ\n|B|\nb∈B\n\nBy Markov's inequality, the probability that dim L > e−(ĉ/2)\ncompletes the proof.\n15\n\n√\nn\n\n|B| is at most e−(ĉ/2)\n\n√\n\nn\n\n. Thus setting β < ĉ/2\n\n\fNow, let E0 denote the following event:\n\u0001\n1. max |χλ (M )/dλ |, |χμ (M )/dμ | ≤ e−Ω(n) ,\n√\n\n2. E I (b) = e−α n/ ln n for all b ∈ B and all I ⊂ {λ, μ}, and\n√\nP\n∗\n−β n\n3.\n|B| for each I1 , I2 ⊂ {λ, μ} with I1 6= ∅ and I2 6= ∅.\nb∈B (ΠL ⊗ 1)(b ⊗ b ) ≤ e\n√\n\nAs a consequence of (3.9) and Lemmas 10, 18 and 19, E0 occurs with probability 1−e−Ω( n) . In what follows\nwe condition on E0 . This will allow us to control the three principal parameters that determine the total\n⊗2\n⊗2\nvariation distance between Pm and the uniform distribution: rk Π⊗2\nm , Expm [Πm (b)], and Varm [Πm (b)].\n⊗2\n⊗2\nλ\nμ\nConsidering rk Πm , note that the rank of Πm restricted to a representation S ⊗ S is the product of\nthe ranks of Πm restricted to S λ and S μ ; then (3.7), and item 1 of E0 give\n\u0012\n\u0013\u0012\n\u0013\n\u0011\nχμ (M )\nχλ (M )\n|B| \u0010\ndμ dλ\n⊗2\n(5.4)\n1+\n1 + e−Ω(n) .\n1\n+\n=\nrk Πm\n=\nμ\nλ\n4\nd\nd\n4\nAs for the expectation Expm [Π⊗2\nm (b)], in light of (5.1) and item 2 of E0 , we conclude that for each b ∈ B,\nExpm Π⊗2\nm b\n\n2\n\n−\n\n√\n1\n≤ 3e−α n/ ln n .\n4\n\n(5.5)\n\nFinally, we focus on the variance. Define BL ⊂ B to be the\nset of basis vectors b such that for some\n√\n∗ 2\n−(β/2) n\nnontrivial I1 , I2 ⊂ {λ, μ}, (ΠL[I1 ,I2 ] ⊗ 1)(b ⊗ b ) ≥ e\n. Then since item 3 of E0 holds for each of\nthe 32 = 9 pairs of nonempty subsets I1 , I2 , we have\n√\n√ X X\n|BL | ≤ e(β/2) n\n(ΠL[I1 ,I2 ] ⊗ 1)(b ⊗ b∗ ) ≤ 9e−(β/2) n |B| .\nI1 ,I2 b∈B\n\nObserve that for any b ∈ B \\ BL , Equations (5.2), (5.3), and item 2 of E0 give\n2\n\n⊗2\nb\nVarm Πm\n\n≤\n\n√\n√\n√ \u0011\n9 \u0010 −α√n/ ln n\ne\n+ e−2α n/ ln n + e−(β/2) n < e−α n/ ln n .\n16\n\nThen Chebyshev's inequality gives\nh\n2\n⊗2\nPr\nΠ⊗2\n− Expm Πm\nb\nm b\n\n2\n\n≥ e−(α/3)\n\n√\n\nn/ ln n\n\ni\n\n≤ e−(α/3)\n\n√\nn/ ln n\n\n.\n\n(5.6)\n\n(5.7)\n\nAnalogous to Theorem 8, let Bbad ⊂ B \\ BL denote the subset of basis vectors for which the event of (5.7)\nis violated. (As in the one-register case, while BL depends only on the choice of λ and μ, Bbad depends also\non m.) Let E1 denote the event\n√\n|Bbad | < e−(α/6) n/ ln n |B| .\n√\n\nThen (5.7) and Markov's inequality imply that E1 occurs with probability 1 − e−(α/6) n/ ln n .\n2\nSo, finally, recall that Pm (b) = Π⊗2\n/rk Π⊗2\nm (b)\nm and let P (b) denote the distribution P (b) =\nExpm [Pm (b)]. We separate Pm − P 1 into contributions from basis vectors outside and inside BL ∪ Bbad :\nPm − P\n\n1\n\n=\n\nX\n\nb∈B\n/ L ∪Bbad\n\nPm (b) − P (b) +\n\nX\n\nb∈BL ∪Bbad\n\nPm (b) − P (b) .\n\nThe first sum is taken only over vectors b for which\nΠ⊗2\nm (b)\n\n2\n\n− Expm Π⊗2\nm (b)\n\n16\n\n2\n\n< e−(α/3)\n\n√\nn/ ln n\n\n.\n\n(5.8)\n\n\fThen conditioning on E0 and E1 , the rank estimate of (5.4) implies that\n√\n\nX\n\nb∈B\n/ L ∪Bbad\n\n√\n\n√\ne−(α/3) n/ ln n\n4e−(α/3) n/ ln n\n−(α/3) n/ ln n\nPm (b) − P (b) ≤\n.\n<\n8e\n*\n|B|\n=\n1 + e−Ω(n)\nrk Π⊗2\nm\n\n(5.9)\n\nOn the other hand, conditioning on E0 and E1 we have\n\u0011\n\u0010\n√\n√\n√\n|BL ∪ Bbad | ≤ 9e−(β/2) n + e−(α/6) n/ ln n |B| < 2e−(α/6) n/ ln n |B| ,\n\nand then (5.4) and (5.5) imply that the total expected probability of the basis vectors in BL ∪ Bbad is\n\u0012\n\u0013\n2\nX\nX\n√\nExpm Π⊗2\n|BL ∪ Bbad |\n1\nm (b)\n−α n/ ln n\n≤\n*\nP (b) =\n+\n3e\n4\nrk Π⊗2\nrk Π⊗2\nm\nm\nb∈BL ∪Bbad\n\nb∈BL ∪Bbad\n√\n−(α/6) n/ ln n\n\n≤ 2e\nThen we must have\n\nX\n\nb∈B\n/ L ∪Bbad\n\nand hence, by (5.9),\nX\n\nb∈B\n/ L ∪Bbad\n\n(1 + o(1)) < 3e−(α/6)\n\nP (b) > 1 − 3e−(α/6)\n\nPm (b) > 1 − 3e−(α/6)\n\nand so\n\nX\n\n√\nn/ ln n\n\n− 8e−(α/3)\n\nPm (b) < 4e−(α/6)\n\n√\nn/ ln n\n\n.\n\n(5.10)\n\n√\nn/ ln n\n\n√\nn/ ln n\n\n√\nn/ ln n\n\n> 1 − 4e−(α/6)\n\n√\nn/ ln n\n\n.\n\nb∈BL ∪Bbad\n\nCombining this with (5.10) bounds the second sum in (5.8),\nX\n√\nPm (b) − P (b) < 7e−(α/6) n/ ln n .\n\n(5.11)\n\nb∈BL ∪Bbad\n\nThen combining (5.8), (5.9) and (5.11),\nPm − P\n\n< 8e−(α/6)\n\n1\n√\n−Ω( n)\n\n√\nn/ ln n\n\n√\n\n√\n\nwith probability at least Pr[E0 ∧ E1 ] ≥ 1 − e\n− e−(α/6) n/ ln n > 1 − 2e−(α/6) n/ ln n .\nFinally, it remains to be proved that P is, with high probability, close to the uniform distribution U on\nB. But this follows from (5.4) and (5.5); conditioning on E0 , we have\nP −U\n\n1\n\n≤\n\nX Expm Π⊗2\nm b\n\nb∈B\n\nrk\n\nΠ⊗2\nm\n\n2\n\n−\n\n√\n1\n< 12e−α n/ ln n (1 + e−Ω(n) ) .\n|B|\n\nWe complete the proof by setting δ < α/6 and invoking the triangle inequality.\n\n6\n\nConclusion\n\nThe reader will notice that our current machinery cannot extend to three or more registers when applied to\nthe symmetric group, as the representations of Sn have typical dimension equal to (n!)1/2−o(1) . However,\nwe have been very pessimistic in our analysis; in particular, we have assumed that vectors of the form b ⊗ b\nproject into low-dimensional representations, S ν with ν ∈ Λ, as much as possible. Perhaps a more detailed\nunderstanding of how these vectors lie inside the decomposition of V (ρ, σ) into irreducibles would allow one\nto prove that this hidden subgroup problem requires entangled measurements over Ω(log |G|) = Ω(n log n)\ncoset states. Therefore, we make the following conjecture.\n17\n\n\fConjecture 1. Let B = {b} with weights {ab } be a complete frame for S λ1 ⊗ * * * ⊗ S λk . Given the hidden\nsubgroup H = {1, m} where m is chosen uniformly at random from M , and a coset state |c1 Hi ⊗ * * * ⊗ |ck Hi\non k registers, let Pm (b) be the probability that we observe the vector b conditioned on having observed the\nrepresentation names {S λi }, and let U be the natural distribution on B. Then for all c > 0, with probability\n1 − o(n−c ) in m and {S λi }, we have\nkPm − U k1 = o(n−c )\nunless k = Ω(n log n).\n\nAcknowledgments.\nThis work was supported by NSF grants CCR-0093065, PHY-0200909, EIA-0218443, EIA-0218563, CCR0220070, and CCR-0220264. We are grateful to Denis Thérien, McGill University, and Bellairs Research\nInstitute for organizing a workshop at which this work began; to Dorit Aharonov, Daniel Rockmore, Leonard\nSchulman, and Umesh Vazirani for helpful conversations; to Sean Hallgren, Martin Rötteler and Pranab Sen\nfor identifying a flaw in an earlier draft; and to Tracy Conrad and Sally Milius for their support and tolerance.\nC.M. also thanks Rosemary Moore for providing a larger perspective.\n\nReferences\n[1] David Bacon, Andrew Childs, and Wim van Dam. Optimal measurements for the dihedral hidden\nsubgroup problem. Preprint, quant-ph/0501044 (2005).\n[2] Robert Beals. Quantum computation of Fourier transforms over symmetric groups. Proc. 29th Annual\nACM Symposium on the Theory of Computing, pages 48–53, 1997.\n[3] Ethan Bernstein and Umesh Vazirani. Quantum complexity theory (preliminary abstract). Proc. 25th\nAnnual ACM Symposium on the Theory of Computing, pages 11–20, 1993.\n[4] Wim van Dam, Sean Hallgren, and Lawrence Ip. Quantum algorithms for some hidden shift problems.\nProc. 14th ACM-SIAM Symposium on Discrete Algorithms, pages 489–498, 2003.\n[5] Mark Ettinger and Peter Høyer. On quantum algorithms for noncommutative hidden subgroups.\nPreprint, quant-ph/9807029 (1998).\n[6] Mark Ettinger and Peter Høyer and Emmanuel Knill. The quantum query complexity of the hidden\nsubgroup problem is polynomial. Information Processing Letters, to appear.\n[7] Katalin Friedl, Gábor Ivanyos, Frédéric Magniez, Miklos Santha, and Pranab Sen. Hidden translation\nand orbit coset in quantum computing. Proc. 35th ACM Symposium on Theory of Computing, 2003.\n[8] William Fulton and Joe Harris. Representation Theory: A First Course. Number 129 in Graduate Texts\nin Mathematics. Springer-Verlag, 1991.\n[9] Michelangelo Grigni, Leonard J. Schulman, Monica Vazirani, and Umesh Vazirani. Quantum mechanical\nalgorithms for the nonabelian hidden subgroup problem. Proc. 33rd ACM Symposium on Theory of\nComputing, pages 68–74, 2001.\n[10] Lisa Hales and Sean Hallgren. Quantum Fourier sampling simplified. Proc. 31st Annual ACM Symposium on Theory of Computing, 1999.\n[11] Lisa Hales and Sean Hallgren. An improved quantum Fourier transform algorithm and applications.\nProc. 41st Annual Symposium on Foundations of Computer Science, 2000.\n\n18\n\n\f[12] Sean Hallgren, Alexander Russell, and Amnon Ta-Shma. Normal subgroup reconstruction and quantum\ncomputation using group representations. Proc. 32nd ACM Symposium on Theory of Computing, pages\n627–635, 2000.\n[13] Peter Høyer. Efficient quantum transforms. Preprint, quant-ph/9702028 (1997).\n[14] Yoshifumi Inui and François Le Gall. An efficient algorithm for the hidden subgroup problem over a\nclass of semi-direct product groups. Proc. EQIS 2004.\n[15] Lawrence Ip. Shor's algorithm is optimal. Preprint, 2004.\n[16] Gábor Ivanyos, Frédéric Magniez, and Miklos Santha. Efficient quantum algorithms for some instances\nof the non-abelian hidden subgroup problem. Int. J. Found. Comput. Sci. 14(5): 723–740, 2003.\n[17] Richard Jozsa. Quantum factoring, discrete logarithms and the hidden subgroup problem. Preprint,\nquant-ph/0012084 (2000).\n[18] Julia Kempe and Aner Shalev. The hidden subgroup problem and permutation group theory. Preprint,\nquant-ph/0406046 (2004).\n[19] S. V. Kerov. Asymptotic representation theory of the symmetric group and its applications in analysis.\nTranslated by N. V. Tsilevich. Volume 219 in Translations of Mathematical Monographs. American\nMathematical Society, 2003.\n[20] Greg Kuperberg. A subexponential-time quantum algorithm for the dihedral hidden subgroup problem.\nPreprint, quant-ph/0302112 (2003).\n[21] Cristopher Moore, Daniel Rockmore, and Alexander Russell. Generic quantum Fourier transforms.\nProc. 15th Annual ACM-SIAM Symposium on Discrete Algorithms, pages 778–787, 2004.\n[22] Cristopher Moore, Daniel Rockmore, Alexander Russell, and Leonard Schulman. The value of basis\nselection in Fourier sampling: hidden subgroup problems for affine groups. Proc. 15th Annual ACMSIAM Symposium on Discrete Algorithms, pages 1113–1122, 2004.\n[23] Oded Regev. Quantum computation and lattice problems. Proc. 43rd Symposium on Foundations of\nComputer Science, pages 520–530, 2002.\n[24] Martin Roetteler and Thomas Beth. Polynomial-time solution to the hidden subgroup problem for a\nclass of non-abelian groups. Preprint, quant-ph/9812070 (1998).\n[25] Yuval Roichman. Upper bound on the characters of the symmetric groups. Inventiones Mathematicae,\n125:451–485, 1996.\n[26] Steven Roman. Advanced Linear Algebra. Number 135 in Graduate Texts in Mathematics. Springer,\n1992.\n[27] Jean-Pierre Serre. Linear Representations of Finite Groups. Number 42 in Graduate Texts in Mathematics. Springer-Verlag, 1977.\n[28] Peter W. Shor. Polynomial-time algorithms for prime factorization and discrete logarithms on a quantum\ncomputer. SIAM Journal on Computing, 26(5):1484–1509, 1997.\n[29] Daniel R. Simon. On the power of quantum computation. SIAM Journal on Computing, 26(5):1474–\n1483, 1997.\n[30] A. M. Vershik and S. V. Kerov. Asymptotic behavior of the maximum and generic dimensions of\nirreducible representations of the symmetric group. Funk. Anal. i Prolizhen, 19(1):25–36, 1985; English\ntranslation, Funct. Anal. Appl., 19:21–31, 1989.\n\n19\n\n\f"}